{
  "ground_truth": "In the hallway, Barton sees the rugged man behind him. The stranger stops. Behind Barton, the stout, baby-faced man steps into the hall and shoots him. The G-man lurches and falls. In the street, Purvis turns. The shooter and his rugged associate leave. Outside, Purvis races toward the building. Baum whips out his gun, then peers at a car parked in the alley. Inside, Purvis enters the hallway and raises his gun. He advances cautiously. Purvis stops, looking down. Glancing whirly ahead, he crouches. Purvis' mouth drops open as he stares downward. On the floor, a blood pool spreads beneath Barton. As the wounded man twitches feebly, Purvis watches with a clenched jaw. His expression grows solemn. He glares down the hall. He rises, leaving a lifeless Barton. Outside, Baum sees two men hurrying down the alley steps. The baby-faced shooter raises a Tommy gun. The G-man ducks behind a wall as bullets pepper its surface. Scrambling out, he takes cover behind a garden planter. As the two criminals get into the parked car, Baum pops up and returns fire. The car pulls away. Back indoors, Purvis bursts into the apartment. He ignores the panic maul and leans out an open window. As the car below quits the alley, Purvis shoots, then hurries out of the apartment. Outside, two agents pull their car up as their superior exits the building. Purvis stops, staring with his mouth agape. The agent shifts his rueful gaze. With a slow, deliberate stride, Purvis steps closer to his men. Purvis' frustrated gaze scans the agents. His breath puffing visibly in the night air, he steps away. A bank's doors open. Three men in long coats enter. Our gaze drifts up to find Pete between Dillinger and a heavyset thug. The two leaner men split off together. Pete encounters a guard, sucker punches him, and bangs his head against the counter. Without breaking his stride, Dillinger draws a gun in each hand. The bankers all obey. Pete shifts his aim. A banker leads Dillinger to a vault. Now in his office, Hoover talks on the phone. Hoover shifts his resentful gaze and works his jaw. In Chicago, Purvis grimly lowers the phone, then shifts his troubled gaze. A locomotive pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform. The heavy wheels slow to a halt. An older, smartly dressed man with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform, suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause, taking in their surroundings. Now at a shoeshine stand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the corridor, Barton perceives the rugged individual behind him. The outsider pauses. Behind Barton, the stout, baby-faced fellow moves into the passage and fires at him. The G-man staggers and collapses. In the road, Purvis rotates. The gunman and his rugged comrade depart. Outside, Purvis rushes toward the edifice. Baum produces his pistol, then peers at an automobile parked in the alleyway. Inside, Purvis enters the corridor and elevates his firearm. He proceeds cautiously. Purvis halts, observing downward. Glancing warily forward, he crouches. Purvis' mouth gapes as he gazes downward. On the surface, a blood puddle expands beneath Barton. As the injured man shudders feebly, Purvis observes with a clenched jaw. His countenance becomes solemn. He glowers down the passage. He rises, leaving a lifeless Barton. Outside, Baum perceives two men hastening down the alleyway stairs. The baby-faced gunman elevates a Tommy gun. The G-man dodges behind a barrier as bullets pock its surface. Scrambling out, he seeks cover behind a garden container. As the two felons enter the stationed automobile, Baum rises and returns fire. The vehicle pulls away. Back inside, Purvis bursts into the apartment. He disregards the panic maul and leans out an open window. As the automobile below departs the alleyway, Purvis fires, then rushes out of the apartment. Outside, two operatives pull their vehicle up as their superior exits the structure. Purvis halts, staring with his mouth agape. The operative shifts his rueful gaze. With a slow, deliberate stride, Purvis steps closer to his men. Purvis' frustrated gaze scans the operatives. His breath visible in the night air, he steps away. A bank's doors open. Three individuals in long coats enter. Our gaze drifts up to find Pete between Dillinger and a heavyset thug. The two leaner individuals divide together. Pete encounters a guard, sucker punches him, and bangs his head against the counter. Without breaking his stride, Dillinger draws a gun in each hand. The bankers all comply. Pete adjusts his aim. A banker guides Dillinger to a vault. Now in his office, Hoover speaks on the telephone. Hoover shifts his resentful gaze and works his jaw. In Chicago, Purvis grimly lowers the phone, then shifts his troubled gaze. A locomotive pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform. The heavy wheels decelerate to a halt. An older, smartly dressed gentleman with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform, suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause, taking in their surroundings. Now at a shoeshine stand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the hallway, the rugged man behind Barton is seen by him. The stranger is stopped. Behind Barton, the hall is stepped into by the stout, baby-faced man, and he shoots him. Lurching and falling, the G-man is seen by the hall. In the street, Purvis is turned. The shooter and his rugged associate are left by them. Outside, the building is raced toward by Purvis. Baum whips out his gun, then a car parked in the alley is peered at by him. Inside, the hallway is entered by Purvis and his gun is raised. He is advanced cautiously. Purvis is stopped, looking down. Ahead, he whirly glances and crouches. Purvis' mouth is dropped open by him as he stares downward. On the floor, beneath Barton, a blood pool is spread. As the wounded man twitches feebly, he is watched by Purvis with a clenched jaw. Solemn grows Purvis' expression. The hall is glared down by him. Rising, a lifeless Barton is left by him. Outside, two men hurrying down the alley steps are seen by Baum. A Tommy gun is raised by the baby-faced shooter. The G-man as bullets pepper its surface is ducked behind a wall by him. Scrambling out, cover is taken by him behind a garden planter. As the parked car is gotten into by the two criminals, return fire is popped up by Baum. The car is pulled away. Back indoors, the apartment is burst into by Purvis. The panic maul is ignored by him, and an open window is leaned out. As the car below quits the alley, it is shot by Purvis, then he hurries out of the apartment. Outside, their car is pulled up by two agents as the building is exited by their superior. Purvis, staring with his mouth agape, is stopped by him. The agent shifts his rueful gaze. With a slow, deliberate stride, his men are stepped closer to by Purvis. The agents are scanned by Purvis' frustrated gaze. His breath puffing visibly in the night air, away is stepped by him. A bank's doors are opened. Three men in long coats are entered. Up, to find Pete between Dillinger and a heavyset thug, our gaze is drifted. The two leaner men are split off together. A guard is encountered by Pete, who sucker-punches him, and a counter is banged against by his head. Without breaking his stride, a gun in each hand is drawn by Dillinger. All the bankers are obeyed. His aim is shifted by Pete. To a vault, a banker is led by Dillinger. Now in his office, the phone is talked on by Hoover. Hoover's resentful gaze is shifted, and his jaw is worked by him. In Chicago, the phone is grimly lowered by Purvis, then his troubled gaze is shifted. A station is pulled into by a locomotive. The unfazed travelers and workers on the platform are blasted by puffs of brake steam. The heavy wheels are slowed to a halt. An older, smartly dressed man with wizened features disembarks flanked by two associates. Down the platform through beady eyes, the platform is peered down by him. Down the platform, their way is made by the three newcomers, suitcases in hand. On the vast terminal's marble floors, travelers mill about. Taking in their surroundings, the three arriving men pause. Now at a shoeshine stand."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the hallway, Barton spots a rugged man behind him, who stops. A stout, baby-faced man emerges, shooting Barton. The G-man lurches and collapses. Outside, Purvis turns as the shooter and his associate depart. Purvis races to the building, while Baum draws his gun, then peers at a car in the alley. Inside, Purvis cautiously advances with his gun raised. He stops, crouches, and stares at the blood spreading beneath Barton, watching the wounded man twitch. Purvis’s expression turns solemn as he rises and leaves Barton. Outside, Baum sees two men descend the alley steps. The shooter raises a Tommy gun, forcing Baum to duck behind a wall as bullets hit. He takes cover behind a planter and returns fire as the criminals get into a car and drive away. Indoors, Purvis enters an apartment, ignores the panic, leans out a window, fires at the car below, then exits. Outside, two agents arrive as Purvis exits, staring ruefully. He scans the agents and walks away, his breath visible in the night air. Bank doors open, revealing Pete between Dillinger and a thug. The men split, and Pete knocks out a guard. Dillinger draws guns, commanding obedience. A banker leads him to a vault. In his office, Hoover talks on the phone, shifting his resentful gaze. In Chicago, Purvis lowers the phone, troubled. A locomotive arrives, steam blasting travelers. An older man disembarks with two associates, scanning the platform with beady eyes. The trio carries suitcases through the bustling terminal and pauses at a shoeshine stand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the hallway, Barton notices a rugged man behind him who stops. Suddenly, a stout, baby-faced man steps out, shoots Barton, and he falls. Outside, Purvis notices and rushes in, gun ready. Inside, he finds Barton bleeding, his expression solemn. Baum sees two men flee down the alley; a shooter fires a Tommy gun, forcing Baum to take cover before returning fire. Purvis enters an apartment, disregards chaos, and shoots at the escaping car. Two agents arrive as Purvis steps away, frustrated. At a bank, Pete, Dillinger, and a thug enter. Pete knocks out a guard as Dillinger draws weapons, leading a banker to the vault. Hoover's call interrupts his office. In Chicago, Purvis sets down the phone troubled. A train arrives, and a smartly dressed older man disembarks with associates, observing the platform. They proceed with suitcases through the busy terminal, pausing at the shoeshine stand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the long, dimly lit hallway, Barton suddenly notices the rugged-looking man walking directly behind him. The mysterious stranger comes to an abrupt stop. Behind Barton, a stout man with a baby-faced appearance steps confidently into the hallway and fires a shot at him. The G-man stumbles forward and collapses to the floor. Out on the busy street, Purvis swiftly turns around. The shooter, accompanied by his rugged associate, quickly leaves the scene. Outside, Purvis races determinedly toward the building. At the same time, Baum swiftly draws his gun and keenly peers at a car parked quietly in the alley. Inside the building, Purvis enters the hallway, his gun raised and poised, advancing cautiously. Purvis halts, directing his gaze downward. He glances anxiously ahead and crouches low, his mouth falling open in shock as he stares at the floor. There, a pool of blood spreads ominously beneath Barton's fallen body. As Barton lies twitching weakly, Purvis observes with a clenched jaw, his expression shifting to one of solemn resolve. He glares menacingly down the hallway, rises, and leaves Barton lying lifeless behind him. Outside, Baum notices two men hurriedly descending the alley steps. The baby-faced shooter raises a menacing Tommy gun. The G-man swiftly ducks behind a solid wall as bullets pepper its surface with alarming intensity. Scrambling out, he takes cover behind a nearby garden planter. As the two criminals make their escape into the parked car, Baum suddenly pops up and fires back. The car speeds away into the distance. Meanwhile, back indoors, Purvis bursts into the apartment. Ignoring the chaotic panic of others around him, he leans carefully out of an open window. As the car below quickly exits the alley, Purvis shoots at it, then hurriedly departs the apartment. On the street outside, two agents pull their car up just as their superior exits the building. Purvis stops abruptly, staring with his mouth agape in disbelief. The agent shifts his gaze ruefully. With a slow, deliberate stride, Purvis steps closer to his men, scanning them with a frustrated gaze. His breath puffs visibly into the cold night air as he steps away. Nearby, the doors of a bank swing open. Three men, clad in long coats, make their entrance. Our gaze drifts upward to see Pete positioned between Dillinger and a heavyset thug. The two leaner men quickly split off together. Pete unexpectedly encounters a guard, sucker punches him, and forcefully bangs his head against the counter. Without breaking his stride, Dillinger deftly draws a gun in each hand. The intimidated bankers immediately comply with their demands. Pete shifts his aim expertly. A compliant banker guides Dillinger to the vault. Meanwhile, in his office, Hoover talks on the phone, shifting his gaze resentfully and working his jaw. In Chicago, Purvis grimly hangs up the phone and shifts his troubled gaze elsewhere. A powerful locomotive pulls into the bustling station, its puffs of brake steam blasting over the unfazed travelers and workers on the platform. The heavy wheels slowly grind to a halt. An older man, smartly dressed with wizened features, disembarks flanked by two associates. He peers keenly down the platform through beady eyes. The three newcomers make their way down the platform with suitcases in hand. Travelers mill about on the vast marble floors of the terminal. The three arriving men pause briefly, taking in their surroundings. Now, they find themselves at a shoeshine stand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Barton makes his way through the long, dimly lit hallway, he suddenly becomes acutely aware of a rugged-looking man walking directly behind him. This mysterious stranger comes to an abrupt halt. At that precise moment, a stout man with a baby-faced appearance confidently steps into the hallway behind Barton and, without hesitation, fires a shot at him. The G-man stumbles awkwardly forward, ultimately collapsing to the floor. Out on the bustling street, Purvis swiftly turns around. Meanwhile, the shooter, now accompanied by his rugged associate, hastily leaves the chaotic scene. Outside, Purvis races determinedly toward the building with a sense of urgency. Simultaneously, Baum swiftly draws his gun, glancing sharply at a car parked quietly in the shadowy alley. Inside the building, Purvis enters the hallway, gun raised and poised, advancing cautiously. He halts, directing his gaze downward with intensity. Anxiously looking ahead, he crouches low, his mouth falling open in shock as he stares at the floor. There, a pool of blood spreads ominously beneath Barton's fallen body. As Barton lies twitching weakly, Purvis observes with clenched jaw, his expression shifting dramatically to one of solemn resolve. He glares menacingly down the hallway, rises decisively, leaving Barton lying lifeless behind him. Outside, Baum notices two men hurriedly descending the alley steps. The baby-faced shooter raises a menacing Tommy gun. The G-man swiftly ducks behind a solid wall as bullets pepper its surface with alarming intensity. Scrambling out, he takes cover behind a nearby garden planter. As the two criminals make their escape into the parked car, Baum suddenly pops up and fires back at them. The car speeds away into the distance in a blur. Meanwhile, back indoors, Purvis bursts into the apartment. Ignoring the chaotic panic of others around him, he leans carefully out of an open window. As the car below quickly exits the alley, Purvis shoots at it, then hurriedly departs the apartment. On the street outside, two agents pull their car up just as their superior exits the building. Purvis stops abruptly, staring with his mouth agape in disbelief. The agent shifts his gaze ruefully. With a slow, deliberate stride, Purvis steps closer to his men, scanning them with a frustrated gaze. His breath puffs visibly into the cold night air as he steps away. Nearby, the doors of a bank swing open. Three men, clad in long coats, make their entrance. Our gaze drifts upward to see Pete positioned between Dillinger and a heavyset thug. The two leaner men quickly split off together. Pete unexpectedly encounters a guard, sucker punches him, and forcefully bangs his head against the counter. Without breaking his stride, Dillinger deftly draws a gun in each hand. The intimidated bankers immediately comply with their demands. Pete shifts his aim expertly. A compliant banker guides Dillinger to the vault. Meanwhile, in his office, Hoover talks on the phone, shifting his gaze resentfully and working his jaw. In Chicago, Purvis grimly hangs up the phone and shifts his troubled gaze elsewhere. A powerful locomotive pulls into the bustling station, its puffs of brake steam blasting over the unfazed travelers and workers on the platform. The heavy wheels slowly grind to a halt. An older man, smartly dressed with wizened features, disembarks flanked by two associates. He peers keenly down the platform through beady eyes. The three newcomers make their way deliberately down the platform with suitcases in hand. Travelers mill about on the vast marble floors of the terminal. The three arriving men pause briefly, taking in their surroundings. Now, they find themselves at a shoeshine stand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the hallway, Barton is intently moving forward when he suddenly notices a rugged man positioned behind him. This man momentarily halts, creating a tense pause in the interaction. Unbeknownst to Barton, a stout man with a baby face emerges into the hallway, carefully positioning himself, and, with calculated precision, draws his weapon and shoots Barton. The impact forces Barton, the G-man, to lurch violently before collapsing onto the ground. Meanwhile, out on the street, Purvis is alert and instinctively pivots around at the sound of the commotion. The shooter, along with his rugged-looking associate, turns to leave their location. Purvis, driven by urgency, races towards the building, encountering Baum, who swiftly whips out his own gun and peers intently at a car stationed in the alley. With determination, Purvis makes his way inside, entering the hallway with his gun raised, advancing forward in a cautious, deliberate manner. He halts, his gaze drawn downward, and with a cautious glance around, he crouches to get a better look. Purvis' mouth drops open in shock as he stares at the floor where a pool of blood ominously spreads beneath the wounded Barton. Purvis watches as Barton twitches feebly, his jaw clenching in response to the unfolding tragedy. His expression evolves into one of solemnity, and he fixes his glare down the hall. Rising from his crouched position, he reluctantly leaves Barton, who lies lifeless on the floor. Outside, Baum's attention is captured by two men hurriedly descending the alley steps. The baby-faced shooter is quick to raise a Tommy gun, prompting the G-man to duck hastily behind a protective wall as bullets begin to pepper its surface. Moving quickly, Baum scrambles to take cover behind a garden planter. As the two criminals hastily get into the waiting car, Baum seizes the moment to pop up and return fire. The car speeds away from the scene. Indoors again, Purvis bursts into an apartment, cutting through the chaos and panic, as he leans out an open window to get a clear view. Seeing the car below exiting the alley, Purvis takes aim and fires, then promptly hurries out of the apartment, propelled by the urgency of the situation. Outside, two agents rapidly pull up in their car just as their superior emerges from the building. Purvis halts, momentarily frozen, as he stares with his mouth open in astonishment. The agent shifts his gaze ruefully, and with a slow, deliberate stride, Purvis steps closer to his assembled men. His gaze, filled with frustration, scans the faces of the agents, his breath forming visible puffs in the cool night air. He then steps away, his mind preoccupied with the events that have unfolded. At a bank, the large doors swing open, admitting three men clad in long coats. Our attention moves upwards to reveal Pete standing between Dillinger and a heavyset thug. The two leaner men then split off together, moving with purpose. Pete soon encounters a guard, delivering a swift sucker punch and forcefully banging his head against the counter, all without breaking his stride. At this crucial moment, Dillinger, with fluid motion, draws a gun in each hand, quickly asserting control over the situation as the bankers offer their compliance. Pete then shifts his aim towards the bankers, ensuring compliance. One banker, feeling cornered, leads Dillinger towards the vault, setting the stage for the next phase of their plan. Back in his office, Hoover is engaged in a phone conversation, his expression reflecting a simmering resentment as he shifts his gaze and works his jaw in frustration. In Chicago, Purvis on the other end grimly lowers the phone, his gaze shifting to mirror his troubled emotions. Meanwhile, a locomotive steams into a bustling station, with clouds of steam from the brakes enveloping the untroubled travelers and workers on the platform. The heavy wheels of the train gradually come to a halt, and an older, smartly dressed man with wizened features disembarks, flanked by two associates. His beady eyes survey the scene as the trio makes their way down the platform, suitcases in hand. Travelers continue to mill about on the vast marble floors of the terminal. The three new arrivals pause momentarily, taking in their surroundings, now stationed at a nearby shoeshine stand."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the hallway, Barton notices a rugged man behind him, who then stops. A stout, baby-faced man appears and shoots Barton, causing him to lurch and fall. Outside, Purvis turns as the shooter and his companion leave. Racing toward the building, Baum draws his gun and surveys a car in the alley. Inside, Purvis enters cautiously, raising his gun, and stops when he sees Barton lying on the floor with blood pooling beneath him. With a clenched jaw, Purvis watches the wounded man twitch before turning solemnly to glare down the hall and then moves on, leaving Barton behind. \n\nOutside, Baum spots two men fleeing down alley steps. The baby-faced shooter fires a Tommy gun, forcing Baum to duck and take cover. As the criminals enter a car, Baum pops up to return fire, but they drive away. Back inside, Purvis bursts into an apartment, bypasses the chaos, and leans out a window to shoot at the departing car before hurrying out. Outside, two agents arrive as their superior exits the building. Purvis pauses, gazing with frustration at the agents before stepping away into the night air.\n\nIn a bank, Pete, flanked by Dillinger and a heavyset thug, enters with three men in long coats. Pete sucker punches a guard and bangs his head against the counter as Dillinger draws guns, asserting control. Meanwhile, Hoover talks on the phone in his office, his gaze shifting resentfully. In Chicago, Purvis lowers the phone grimly, reflecting on his troubles. A locomotive arrives at a station, where a smartly dressed older man disembarks confidently with two associates. They proceed through the bustling terminal, luggage in hand, pausing briefly to survey their surroundings before heading to a shoeshine stand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the hallway of a dimly lit building that's part of a maze-like Prohibition-era Chicago, Barton sees the rugged man behind him. The stranger, who has a scar on his cheek from a past conflict, stops. Behind Barton, the stout, baby-faced man, who is infamously known in the underworld as Babyface Nelson, steps into the hall and shoots him. The G-man, an agent from the early forces of the FBI tasked with combating gangster activity, lurches and falls. In the bustling street outside, Purvis, a determined FBI agent famously known for pursuing notorious criminals like John Dillinger, turns. The shooter and his rugged associate leave. Outside, Purvis races toward the building, his senses heightened by years of dangerous fieldwork. Baum, another agent with a reputation for sharp instincts, whips out his gun, then peers at a car parked stealthily in the alley. Inside, Purvis enters the hallway and raises his gun, the weight of his duty evident in his steady hand. He advances cautiously, aware of every sound. Purvis stops, looking down at the horrific scene. Glancing warily ahead, he crouches. Purvis' mouth drops open as he stares downward, the reality of violence stark before him. On the floor, a blood pool spreads beneath Barton. As the wounded man twitches feebly, Purvis watches with a clenched jaw, the harsh truths of his profession reflected in his eyes. His expression grows solemn as he glares down the hall, remembering the faces of criminals who evade justice. He rises, leaving a lifeless Barton, another casualty in the relentless war on crime. Outside, Baum sees two men hurrying down the alley steps, shadows in the dim streetlight. The baby-faced shooter raises a Tommy gun, a notorious weapon of choice for gangsters of the era. The G-man ducks behind a wall as bullets pepper its surface, the sound echoing in the narrow passageway. Scrambling out, he takes cover behind a garden planter, knowing any misstep could be fatal. As the two criminals get into the parked car, Baum pops up and returns fire, a testament to his unwavering courage. The car, a getaway vehicle typical of 1930s gangster operations, pulls away. Back indoors, Purvis bursts into the apartment, driven by an urgent need for justice. He ignores the panic maul, the chaotic aftermath of a violent encounter, and leans out an open window. As the car below quits the alley, Purvis shoots, then hurries out of the apartment with the precision of a practiced lawman. Outside, two agents pull their car up as their superior exits the building, ready to continue the chase. Purvis stops, staring with his mouth agape, the realization of another escape etched in his features. The agent shifts his rueful gaze, lamenting the fleeting moments of missed capture. With a slow, deliberate stride, Purvis steps closer to his men, his leadership undeniable even in the face of frustration. Purvis' frustrated gaze scans the agents, assessing the next move in their relentless pursuit. His breath puffing visibly in the night air, a reminder of the chilly Chicago night, he steps away. A bank's doors open, revealing a new scene of tension. Three men in long coats, reminiscent of the gangster fashion of the day, enter. Our gaze drifts up to find Pete, a small-time crook trying to make a big name for himself, between Dillinger, the notorious bank robber whose exploits have captured national attention, and a heavyset thug known for his silent but brutal efficiency. The two leaner men split off together, their coordination suggesting a practiced routine. Pete encounters a guard, sucker punches him with a speed born of desperation, and bangs his head against the counter. Without breaking his stride, Dillinger draws a gun in each hand, demonstrating the confidence that made him a legend. The bankers all obey, knowing defiance could mean death. Pete shifts his aim, keeping control of the situation. A banker, fearing for his safety, leads Dillinger to a vault, a treasure trove for criminals of the time. Now in his office at the FBI's headquarters, Hoover, the stern and ambitious director who transformed the bureau into a national force, talks on the phone. Hoover shifts his resentful gaze and works his jaw, aware of the mounting pressure to capture public enemies. In Chicago, Purvis grimly lowers the phone, then shifts his troubled gaze, the weight of the conversation settling on him. A locomotive, an essential mode of transport during this period, pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform, a common sight in the busy railways of the 1930s. The heavy wheels slow to a halt, signaling another arrival in the city's endless flow of comings and goings. An older, smartly dressed man with wizened features, an indication of his long years navigating the criminal underworld, disembarks flanked by two associates. He peers down the platform through beady eyes, scanning for any sign of trouble. The three newcomers make their way down the platform, suitcases in hand, likely filled with plans or stolen goods. Travelers mill about on the vast terminal's marble floors, oblivious to the shadowy dealings around them. The three arriving men pause, taking in their surroundings, aware of their precarious position in a city rife with law enforcement scrutiny. Now at a shoeshine stand, they blend in with the ordinary hustle and bustle, their true intentions masked by the mundane facade of a polished appearance."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In the hallway Barton sees the rugged man behind him. The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him. The Gman lurches and falls In the street. Purvis turns. The shooter and his rugged associate leave Outside. Purvis races toward the building. Baum whips out his gun then peers at a car parked in the alley. Inside Purvis enters the hallway and raises his gun. He advances cautiously. Purvis stops looking down. Glancing whirly ahead he crouches. Purvis' mouth drops open as he stares downward. On the floor a blood pool spreads beneath Barton. As the wounded man twitches feebly Purvis watches with a clenched jaw. His expression grows solemn. He glares down the hall. He rises leaving a lifeless Barton. Outside Baum sees two men hurrying down the alley steps. The babyfaced shooter raises a Tommy gun. The Gman ducks behind a wall as bullets pepper its surface. Scrambling out he takes cover behind a garden planter. As the two criminals get into the parked car Baum pops up and returns fire. The car pulls away Back indoors. Purvis bursts into the apartment. He ignores the panic maul and leans out an open window. As the car below quits the alley Purvis shoots then hurries out of the apartment. Outside two agents pull their car up as their superior exits the building. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Purvis stops staring with his mouth agape. The agent shifts his rueful gaze. With a slow deliberate stride Purvis steps closer to his men. Purvis' frustrated gaze scans the agents. His breath puffing visibly. in the night air he steps away. A bank's doors open. Three men in long coats enter. Our gaze drifts up to find Pete between Dillinger and a heavyset thug. The two leaner men split off together. Pete encounters a guard. sucker punches him and bangs his head against the counter. Without breaking his stride Dillinger draws a gun in each hand. The bankers all obey. Pete shifts his aim. A banker leads Dillinger to a vault. Now in his office Hoover talks on the phone. Hoover shifts his resentful gaze and works his jaw. In Chicago Purvis grimly lowers the phone then shifts his troubled gaze. A locomotive pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform. The heavy wheels slow to a halt. An older smartly dressed man with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause taking in their surroundings. Now at a shoeshine stand."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In the hallway Barton sees the rugged man behind him. The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him. The Gman lurches and falls In the street. Purvis turns. The shooter and his rugged associate leave Outside. Purvis races toward the building. Baum whips out his gun then peers at a car parked in the alley. Inside Purvis enters the hallway and raises his gun. He advances cautiously. Purvis stops looking down. Glancing whirly ahead he crouches. Purvis' mouth drops open as he stares downward. On the floor a blood pool spreads beneath Barton. As the wounded man twitches feebly Purvis watches with a clenched jaw. His expression grows solemn. He glares down the hall. He rises leaving a lifeless Barton. Outside Baum sees two men hurrying down the alley steps. The babyfaced shooter raises a Tommy gun. The Gman ducks behind a wall as bullets pepper its surface. Scrambling out he takes cover behind a garden planter. As the two criminals get into the parked car Baum pops up and returns fire. The car pulls away Back indoors. Purvis bursts into the apartment. He ignores the panic maul and leans out an open window. As the car below quits the alley Purvis shoots then hurries out of the apartment. Outside two agents pull their car up as their superior exits the building. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Purvis stops staring with his mouth agape. The agent shifts his rueful gaze. With a slow deliberate stride Purvis steps closer to his men. Purvis' frustrated gaze scans the agents. His breath puffing visibly. in the night air he steps away. A bank's doors open. Three men in long coats enter. Our gaze drifts up to find Pete between Dillinger and a heavyset thug. The two leaner men split off together. Pete encounters a guard. sucker punches him and bangs his head against the counter. Without breaking his stride Dillinger draws a gun in each hand. The bankers all obey. Pete shifts his aim. A banker leads Dillinger to a vault. Now in his office Hoover talks on the phone. Hoover shifts his resentful gaze and works his jaw. In Chicago Purvis grimly lowers the phone then shifts his troubled gaze. A locomotive pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform. The heavy wheels slow to a halt. An older smartly dressed man with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause taking in their surroundings. Now at a shoeshine stand."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In the hallway Barton sees the rugged man behind him. The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him. The Gman lurches and falls In the street. Purvis turns. The shooter and his rugged associate leave Outside. Purvis races toward the building. Baum whips out his gun then peers at a car parked in the alley. Inside Purvis enters the hallway and raises his gun. He advances cautiously. Purvis stops looking down. Glancing whirly ahead he crouches. Purvis' mouth drops open as he stares downward. On the floor a blood pool spreads beneath Barton. As the wounded man twitches feebly Purvis watches with a clenched jaw. Pete shifts his aim. A banker leads Dillinger to a vault. Now in his office Hoover talks on the phone. Hoover shifts his resentful gaze and works his jaw. In Chicago Purvis grimly lowers the phone then shifts his troubled gaze. A locomotive pulls into a station. Puffs of brake steam blast the unfazed travelers and workers on the platform. The heavy wheels slow to a halt. An older smartly dressed man with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause taking in their surroundings. Now at a shoeshine stand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In the hallway Barton sees the rugged man behind him. The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him. The Gman lurches and falls In the street. Purvis turns. The shooter and his rugged associate leave Outside. An older smartly dressed man with wizened features disembarks flanked by two associates. He peers down the platform through beady eyes. The three newcomers make their way down the platform suitcases in hand. Travelers mill about on the vast terminal's marble floors. The three arriving men pause taking in their surroundings. Now at a shoeshine stand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the forest, Mason notices the timid woman beside her. The tourist waits. Beside Mason, the lanky, curly-haired woman crawls onto the path and whispers to her. The traveler tumbles and rolls. In the garden, Sawyer pivots. The whisperer and her timid ally drift away. Nearby, Sawyer jogs toward the hut. Gordon pulls out his laptop, then squints at a bicycle hidden in the bushes. Outside, Sawyer sneaks into the forest and lowers his umbrella. He marches boldly. Sawyer waits, peering upward. Blinking slyly downward, he kneels. Sawyer's eyes widen as he gazes upward. In the sky, a leaf storm dances above Mason. As the injured woman flinches weakly, Sawyer observes with a curled lip. His demeanor becomes stern. He gazes skyward down the meadow. He stands, leaving a motionless Mason. Nearby, Gordon observes two women sprinting up the rock steps. The curly-haired whisperer wields a hockey stick. The traveler crouches beneath a tree as raindrops tickle its leaves. Scuttling in, she hides behind a garden gnome. As the two tourists board the hidden bicycle, Gordon springs up and waves farewell. The bicycle speeds away. Back within the forest, Sawyer leaps into the cabin. He forgets the chaos beast and stretches through an open window. As the bicycle above abandons the bushes, Sawyer claps, then dashes out of the cabin. Nearby, two explorers park their bicycle as their chief removes the helmet. Sawyer waits, watching with his eyes wide. The explorer directs his wistful glance. With a brisk, eager march, Sawyer steps closer to his crew. Sawyer's exasperated look sweeps the explorers. His breath visible in the cool morning air, he marches on. A café's curtain parts. Three women in short skirts file out. Our vision shifts upwards to spot Alex among Taylor and a slender hero. The two heavier individuals pair up together. Alex confronts a performer, nudges him, and taps his arm against the cashier. Without breaking her jog, Taylor raises a cane in each palm. The performers all comply. Alex alters her focus. A performer guides Taylor to an attic. Now in his barn, Carter mumbles into the radio. Carter flicks his bitter focus and flexes his elbow. In Boston, Sawyer solemnly hangs up the radio, then flicks his worried brow. A bicycle glides into a barn. Traces of smoke mist the unbothered revelers and farmers on the field. The tiny vines glide to a rest. An elder, dapper youth with weathered cheeks leaps encircled by two allies. She glances up the field through narrow pupils. The three guardians make their path up the field, canes gripped tight. Revelers drift about on the endless field's carpeted grass. The three departing youths pause, absorbing their location. Now by a lemonade stand."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the hallway, Barton encounters a rugged man before being shot by a baby-faced assailant. Barton collapses as Purvis discovers him and grimly observes the scene. Baum, outside, spots the shooters and dodges gunfire as they escape in a car. Purvis pursues but arrives too late, shooting as the car speeds away. Outside, two agents join Purvis, whose frustration is evident. Meanwhile, three men, including Pete and Dillinger, enter a bank. Pete assaults a guard, while Dillinger brandishes guns and demands access to the vault. In Chicago, Hoover and Purvis both appear conflicted after a phone call. Elsewhere, a train arrives, and a distinguished older man disembarks with two associates, surveying the station as they move through the bustling terminal."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Now at a shoeshine stand The three arriving men pause taking in their surroundings Travelers mill about on the vast terminal's marble floors The three newcomers make their way down the platform suitcases in hand He peers down the platform through beady eyes An older smartly dressed man with wizened features disembarks flanked by two associates The heavy wheels slow to a halt Puffs of brake steam blast the unfazed travelers and workers on the platform A locomotive pulls into a station In Chicago Purvis grimly lowers the phone then shifts his troubled gaze Hoover shifts his resentful gaze and works his jaw Now in his office Hoover talks on the phone A banker leads Dillinger to a vault Pete shifts his aim The bankers all obey Without breaking his stride Dillinger draws a gun in each hand sucker punches him and bangs his head against the counter Pete encounters a guard The two leaner men split off together Our gaze drifts up to find Pete between Dillinger and a heavyset thug Three men in long coats enter A bank's doors open in the night air he steps away His breath puffing visibly Purvis' frustrated gaze scans the agents With a slow deliberate stride Purvis steps closer to his men The agent shifts his rueful gaze Purvis stops staring with his mouth agape Outside two agents pull their car up as their superior exits the building As the car below quits the alley Purvis shoots then hurries out of the apartment He ignores the panic maul and leans out an open window Purvis bursts into the apartment The car pulls away Back indoors As the two criminals get into the parked car Baum pops up and returns fire Scrambling out he takes cover behind a garden planter The Gman ducks behind a wall as bullets pepper its surface The babyfaced shooter raises a Tommy gun Outside Baum sees two men hurrying down the alley steps He rises leaving a lifeless Barton He glares down the hall His expression grows solemn As the wounded man twitches feebly Purvis watches with a clenched jaw On the floor a blood pool spreads beneath Barton Purvis' mouth drops open as he stares downward Glancing whirly ahead he crouches Purvis stops looking down He advances cautiously Inside Purvis enters the hallway and raises his gun Baum whips out his gun then peers at a car parked in the alley Purvis races toward the building The shooter and his rugged associate leave Outside Purvis turns The Gman lurches and falls In the street The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him In the hallway Barton sees the rugged man behind him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him In the hallway Barton sees the rugged man behind him Purvis turns The Gman lurches and falls In the street Purvis races toward the building The shooter and his rugged associate leave Outside Inside Purvis enters the hallway and raises his gun Baum whips out his gun then peers at a car parked in the alley Purvis stops looking down He advances cautiously Purvis' mouth drops open as he stares downward Glancing whirly ahead he crouches As the wounded man twitches feebly Purvis watches with a clenched jaw On the floor a blood pool spreads beneath Barton He glares down the hall His expression grows solemn Outside Baum sees two men hurrying down the alley steps He rises leaving a lifeless Barton The Gman ducks behind a wall as bullets pepper its surface The babyfaced shooter raises a Tommy gun As the two criminals get into the parked car Baum pops up and returns fire Scrambling out he takes cover behind a garden planter Purvis bursts into the apartment The car pulls away Back indoors As the car below quits the alley Purvis shoots then hurries out of the apartment He ignores the panic maul and leans out an open window Purvis stops staring with his mouth agape Outside two agents pull their car up as their superior exits the building With a slow deliberate stride Purvis steps closer to his men The agent shifts his rueful gaze His breath puffing visibly Purvis' frustrated gaze scans the agents A bank's doors open in the night air he steps away Our gaze drifts up to find Pete between Dillinger and a heavyset thug Three men in long coats enter Pete encounters a guard The two leaner men split off together Without breaking his stride Dillinger draws a gun in each hand sucker punches him and bangs his head against the counter Pete shifts his aim The bankers all obey Now in his office Hoover talks on the phone A banker leads Dillinger to a vault In Chicago Purvis grimly lowers the phone then shifts his troubled gaze Hoover shifts his resentful gaze and works his jaw Puffs of brake steam blast the unfazed travelers and workers on the platform A locomotive pulls into a station An older smartly dressed man with wizened features disembarks flanked by two associates The heavy wheels slow to a halt The three newcomers make their way down the platform suitcases in hand He peers down the platform through beady eyes The three arriving men pause taking in their surroundings Travelers mill about on the vast terminal's marble floors Now at a shoeshine stand"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The agent shifts his rueful gaze With a slow deliberate stride Purvis steps closer to his men Purvis' frustrated gaze scans the agents His breath puffing visibly in the night air he steps away A bank's doors open Three men in long coats enter Our gaze drifts up to find Pete between Dillinger and a heavyset thug The two leaner men split off together Pete encounters a guard sucker punches him and bangs his head against the counter Without breaking his stride Dillinger draws a gun in each hand The bankers all obey Pete shifts his aim A banker leads Dillinger to a vault Now in his office Hoover talks on the phone Hoover shifts his resentful gaze and works his jaw In Chicago Purvis grimly lowers the phone then shifts his troubled gaze A locomotive pulls into a station Puffs of brake steam blast the unfazed travelers and workers on the platform The heavy wheels slow to a halt An older smartly dressed man with wizened features disembarks flanked by two associates He peers down the platform through beady eyes The three newcomers make their way down the platform suitcases in hand Travelers mill about on the vast terminal's marble floors The three arriving men pause taking in their surroundings Now at a shoeshine stand In the hallway Barton sees the rugged man behind him The stranger stops Behind Barton the stout babyfaced man steps into the hall and shoots him The Gman lurches and falls In the street Purvis turns The shooter and his rugged associate leave Outside Purvis races toward the building Baum whips out his gun then peers at a car parked in the alley Inside Purvis enters the hallway and raises his gun He advances cautiously Purvis stops looking down Glancing whirly ahead he crouches Purvis' mouth drops open as he stares downward On the floor a blood pool spreads beneath Barton As the wounded man twitches feebly Purvis watches with a clenched jaw His expression grows solemn He glares down the hall He rises leaving a lifeless Barton Outside Baum sees two men hurrying down the alley steps The babyfaced shooter raises a Tommy gun The Gman ducks behind a wall as bullets pepper its surface Scrambling out he takes cover behind a garden planter As the two criminals get into the parked car Baum pops up and returns fire The car pulls away Back indoors Purvis bursts into the apartment He ignores the panic maul and leans out an open window As the car below quits the alley Purvis shoots then hurries out of the apartment Outside two agents pull their car up as their superior exits the building Purvis stops staring with his mouth agape"
        }
      ]
    }
  ]
}