{
  "ground_truth": "The chief's Land Rover reverses into a wall, which explodes in a fireball, and Bond is hurled against a wall and showered with glass. Huddled beneath a car, Bond fires at legs, the only targets he can see, then he is up and running. He slams a man in a car door, runs to the stairs, and takes down Green's driver. Camille shoots the general's guards and kicks one so hard he flies over a railing. The general gets off the hostess. Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs. He places his German friend as armed guard, enters the general's room, and the hostess, hands bound, runs for the door, but is batted aside by Camille, who is then attacked by the general. He knocks the gun from her hand and slaps her. Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt, engulfing the meeting area in flames and flying glass. The German is consumed in the fire, but Green runs up the stairs, pursued by Bond. Bond is above Green on the flat glass roof and fires down, causing the glass to disintegrate. He drops back into the building, and Green attacks with a metal bar. Bond drops his gun, and Green grabs an ax from a fire point and flails wildly at Bond. The general has Camille by the throat, pulls off the edge of the floor they are on, and dangles in space, with Bond holding him by the hair. Camille struggles desperately under her attacker, grabs his groin, and kicks him in the face. She dives for the gun and breathes deeply, while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling. Bond runs to her aid as Camille sits crouched in terror, with fire and masonry falling around her. The building is collapsing as Bond tries to reach her. He spots her through the flames, puts his arms around her as the ceiling continues to crack with fire and falling rubble. Bond holds her tightly, spots the gun and picks it up, while her eyes are wide with terror, and he is about to kill them. A burst exposes a fuel cell in the wall, and the blast takes out the whole side of the building. Green has got clear, and Bond watches him go as he and Camille clamber down the rubble, dragging his injured foot. A plume of dust appears in the barren, empty desert. Bond is behind the wheel of a car. He stops, gets out, flings Green to the ground, pulls a can of oil from the trunk, and Green stares down at the can and at the car as it drives away across the vast, empty expanse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The leader's Land Rover retreats into a barrier, which detonates in a fireball, and Bond is thrown against a barrier and sprinkled with glass. Crouched beneath a vehicle, Bond shoots at limbs, the only objectives he can perceive, then he is up and sprinting. He bangs a man in a vehicle entrance, dashes to the steps, and brings down Green's chauffeur. Camille shoots the general's sentries and kicks one so forcefully he flies over a rail. The general gets off the hostess. Camille tears off her blouse and stands ready in a stroppy white top as Green bounds up the steps. He positions his German companion as armed sentinel, enters the general's chamber, and the hostess, hands secured, sprints for the door, but is swatted aside by Camille, who is then assaulted by the general. He strikes the pistol from her hand and smacks her. Bond rushes upstairs and is aimed at by Green's henchman just as the compound's primary fuel cells detonate, engulfing the meeting area in flames and flying glass. The German is consumed in the blaze, but Green rushes up the steps, chased by Bond. Bond is above Green on the flat glass rooftop and shoots downward, causing the glass to disintegrate. He descends back into the structure, and Green attacks with a metal rod. Bond drops his pistol, and Green snatches an ax from a flame point and flails wildly at Bond. The general has Camille by the neck, pulls off the brink of the floor they are on, and dangles in space, with Bond holding him by the hair. Camille struggles frantically under her assailant, grabs his groin, and kicks him in the visage. She dives for the pistol and inhales deeply, while Bond hoists Green back up by the hair and dumps him on the surface just as blaze falls through the rooftop. Bond dashes to her aid as Camille sits crouched in fear, with blaze and masonry falling around her. The structure is disintegrating as Bond attempts to reach her. He spots her through the flames, puts his limbs around her as the rooftop continues to crack with blaze and falling debris. Bond holds her securely, spots the pistol and picks it up, while her eyes are wide with fear, and he is about to kill them. A burst exposes a fuel cell in the barrier, and the explosion takes out the entire side of the structure. Green has got clear, and Bond observes him go as he and Camille scramble down the debris, dragging his wounded foot. A plume of dust appears in the barren, empty wasteland. Bond is behind the wheel of a vehicle. He halts, gets out, flings Green to the ground, pulls a canister of oil from the trunk, and Green gazes down at the canister and at the vehicle as it drives away across the vast, empty expanse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A wall is reversed into by the chief's Land Rover, which is exploded in a fireball, and Bond hurls against a wall and is showered with glass. Huddled beneath a car, legs are fired at by Bond, the only targets visible to him, then he is up and running. A man is slammed in a car door by him, stairs are run to by him, and Green's driver is taken down. The general's guards are shot by Camille and one is kicked so hard by her that he flies over a railing. The hostess is gotten off by the general. Camille's shirt is ripped off by her and she stands ready in a stroppy white top as Green bounds up the stairs. His German friend is placed as armed guard by him, the general's room is entered, and the door is run for by the hostess, hands bound, but Camille bats her aside, who is then attacked by the general. Her gun is knocked from her hand by him and she is slapped by him. Bond runs upstairs and Green's man aims at him just as the compound's main fuel cells erupt, engulfing the meeting area in flames and flying glass. The German is consumed in the fire, but the stairs are run up by Green, pursued by Bond. Bond is above Green on the flat glass roof and fires down, causing the glass to disintegrate. He drops back into the building, and Green attacks with a metal bar. His gun is dropped by Bond, and an ax is grabbed by Green from a fire point and he flails wildly at Bond. Camille is held by the throat by the general, the edge of the floor they are on is pulled off by him, and they dangle in space, with Bond holding him by the hair. Camille struggles desperately under her attacker, his groin is grabbed by her, and his face is kicked by her. The gun is dived for by her and she breathes deeply, while Green is hauled back up by the hair by Bond and he is dumped on the floor just as fire falls through the ceiling. Her aid is run to by Bond as Camille sits crouched in terror, with fire and masonry falling around her. The building is collapsing as she is tried to be reached by Bond. She is spotted through the flames by him, his arms are put around her as the ceiling continues to crack with fire and falling rubble. She is held tightly by Bond, the gun is spotted and picked up by him, while terror widens her eyes, and he is about to kill them. A fuel cell in the wall is exposed by a burst, and the whole side of the building is taken out by the blast. Clear, Green has got, and him is watched by Bond go as he and Camille clamber down the rubble, dragging his injured foot. In the barren, empty desert, a plume of dust appears. A car is driven by Bond. He stops, gets out, Green is flung to the ground by him, a can of oil is pulled from the trunk by him, and down at the can and at the car, Green stares as it is driven away across the vast, empty expanse."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The chief's Land Rover reverses into a wall, causing a fireball explosion that hurls Bond against another wall, showering him with glass. Under a car, Bond fires at visible legs, then runs, slamming a man in a car door, and takes down Green's driver on the stairs. Camille shoots the general's guards, kicking one over a railing. The general gets off the hostess as Camille, ready in a white top, confronts him. Green places a German armed guard and enters the general's room; the hostess, bound, runs but is stopped by Camille, who is then attacked by the general. He disarms and slaps her. Bond runs upstairs; Green's man aims at him, but the compound's fuel cells erupt, engulfing everything in flames. The German burns, while Green is chased by Bond. On the flat glass roof, Bond fires down, shattering it. He reenters, and Green attacks with a metal bar. Bond drops his gun; Green grabs an ax and swings wildly. The general holds Camille by the throat, dangling on the floor's edge. She struggles, grabs his groin, kicks him, then retrieves her gun as Bond pulls Green back up by the hair. Fire falls, and Camille crouches in terror. Bond tries to reach her as the building collapses, puts his arms around her amidst flames and rubble. He holds her tightly, picks up the gun, spotting a fuel cell in the wall. A blast destroys the building's side. Green escapes, and Bond watches him as he and Camille climb down rubble. In the desert, Bond drives, stops, throws Green out, pulls an oil can from the trunk. Green stares at the can and car as it drives away across the vast desert expanse."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The chief's Land Rover reverses into a wall, causing an explosion that propels Bond against another wall amidst flying glass. Under a car, Bond shoots at visible legs, then knocks a man with a car door, and disables Green's driver. Camille shoots guards, launching one over a railing. The general releases the hostess, and Camille, now in a white top, faces Green's ascent. Green enters the general's room as the hostess escapes, but Camille intercepts her. The general attacks Camille, disarming and slapping her. As Bond runs upstairs, Green's man aims at him, but exploding fuel cells engulf the area. The German burns, and Bond pursues Green to the glass roof, making it shatter. Back inside, Green attacks with a metal bar and then an ax. The general dangles Camille over the floor's edge, but Bond pulls him by the hair, while Camille kicks her attacker and retrieves a gun. Fire rains down as Bond helps Camille, amidst collapsing ruins. Through the flames, Bond finds her, holds tightly, and grabs a gun. A blast from a fuel cell demolishes the building's side. Green escapes, and Bond and Camille descend rubble. In a deserted area, Bond drives a car, stops, ejects Green, and leaves him with an oil can, driving away across the vast expanse."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The chief's Land Rover reverses abruptly into a solid wall, which detonates into a dramatic fireball, and Bond is violently hurled against another wall and showered with sharp, flying glass. Huddled beneath the protective cover of a nearby car, Bond takes aim and fires at the legs, which are the only targets visible to him, before swiftly getting up and sprinting away. He forcefully slams a man using the car door, races toward the nearby stairs, and skillfully takes down Green's driver. Meanwhile, Camille fires at the guards protecting the general and kicks one with such force that he flies over a railing. The general, distracted, gets off the hostess. Camille decisively rips off her shirt, revealing a determined stance in a simple yet striking white top, as Green bounds up the stairs. Green strategically places his German friend as an armed guard outside, and enters the general's room. The hostess, her hands bound, makes a desperate attempt to run for the door but is quickly batted aside by Camille, who then confronts an attack by the general. He ruthlessly knocks the gun from her hand and slaps her forcefully. Just as Bond runs upstairs, he is targeted by Green's man, but before anything can happen, the compound's main fuel cells erupt, engulfing the entire meeting area in a frenzy of flames and shards of flying glass. The unfortunate German is consumed by the fire, yet Green manages to run up the stairs, with Bond hot on his trail. Bond positions himself above Green on the flat glass roof and fires downward, causing the fragile glass to shatter. As he drops back into the chaotic building, Green attacks him with a metal bar. Bond's gun falls, and Green seizes an ax from a fire point, swinging it wildly at Bond. The general, holding Camille by the throat, is pulled off the edge of the precarious floor they are on and dangles in space, with Bond gripping him by the hair. Camille, struggling desperately beneath her attacker, manages to grab his groin and kick him squarely in the face. She dives for the discarded gun and breathes deeply, while Bond hauls Green back up by the hair and unceremoniously dumps him on the floor just as the fire starts to fall through the ceiling. Bond races to Camille's aid as she sits crouched in terror, surrounded by falling fire and masonry. The building is collapsing rapidly as Bond attempts to reach her. He spots her through the fierce flames, wraps his arms protectively around her as the ceiling continues to crack ominously with fire and cascading rubble. Bond holds her tightly, spotting the gun and picking it up, while her eyes are wide with fear, and he is ready to confront their impending doom. A sudden burst exposes a fuel cell hidden in the wall, and the resulting blast takes out the entire side of the building. Green has managed to escape the chaos, and Bond watches him make his exit as he and Camille carefully clamber down over the rubble, dragging his injured foot with effort. A plume of dust appears ominously in the barren, empty expanse of the desert. Bond is behind the wheel of a car, driving with determination. He stops, gets out, forcibly flings Green to the ground, pulls a can of oil from the trunk, and Green stares down at the can and at the car as it drives away across the vast, desolate landscape."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The chief's robust Land Rover suddenly reverses with alarming speed into a solid, unyielding wall, which immediately detonates into a spectacular, fiery explosion. This dramatic fireball violently propels Bond against another wall, where he is showered with a hail of sharp, flying shards of glass. Huddled defensively beneath the protective shelter of a nearby car, Bond carefully takes aim and fires at the legs of his adversaries, as these are the only visible targets available to him in the chaos, before swiftly rising to his feet and sprinting away with urgency. He forcefully slams a man with the car door before racing toward the nearby flight of stairs, where he skillfully and efficiently takes down Green's driver. Meanwhile, Camille, showing remarkable determination, fires at the guards protecting the general and delivers a powerful kick to one of them, sending him flying over a railing with impressive force. The general, momentarily distracted, gets off the hostess in surprise. Camille decisively tears off her shirt, revealing her determined stance in a simple yet striking white top, as Green bounds energetically up the stairs. Green strategically positions his German associate as an armed guard outside, then makes his way into the general's room. The hostess, with her hands bound, makes a desperate attempt to reach the door, but Camille quickly bats her aside, focusing her attention on confronting the general's attack. The general ruthlessly disarms her, knocking the gun from her hand and slapping her forcefully. Just as Bond races upstairs, he becomes the target of Green's man; however, before any further action can occur, the compound's main fuel cells suddenly erupt, engulfing the entire meeting area in a frenzy of flames and shards of flying glass. The unfortunate German is consumed by the raging fire, yet Green manages to escape, running up the stairs with Bond relentlessly pursuing him. Bond adeptly positions himself above Green on the fragile, flat glass roof and fires downward, causing the delicate glass to shatter. As he drops back into the chaotic building, Green attacks him ferociously with a metal bar. Bond's weapon falls from his grasp, and Green quickly seizes an ax from a fire point, swinging it wildly and threateningly at Bond. The general, meanwhile, holds Camille by the throat, pulling her precariously off the edge of the unstable floor they are on, leaving him dangling in space, with Bond gripping him firmly by the hair. Camille, struggling desperately beneath her attacker, manages to grab his groin and deliver a decisive kick to his face. She dives for the discarded gun, taking deep, steadying breaths, while Bond hauls Green back up by the hair and unceremoniously dumps him on the floor just as the fire starts to collapse through the ceiling. Bond quickly races to Camille's aid, finding her crouched in terror, surrounded by the relentless rain of falling fire and masonry. The building is collapsing rapidly, and Bond is determined to reach her. He spots her through the fierce flames, wrapping his arms protectively around her as the ceiling continues to crack ominously with fire and cascading rubble all around them. Bond holds her tightly, noticing the gun and picking it up, while her eyes are wide with fear, ready to confront their impending doom. A sudden, powerful burst reveals a fuel cell hidden within the wall, and the resulting explosion takes out the entire side of the building. Green has somehow managed to escape the pandemonium, and Bond watches him make his exit as he and Camille carefully clamber down over the precarious rubble, dragging his injured foot with effort and determination. A plume of dust appears ominously in the barren, desolate expanse of the desert. Bond, now sitting behind the wheel of a car, drives with unwavering determination. He eventually stops, gets out, forcibly flings Green to the ground, and retrieves a can of oil from the trunk. Green stares down at the ominous can and then at the car as it drives away across the vast, empty landscape."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the narrative begins, the chief's Land Rover is in reverse, and with a sudden impact, it collides with a wall, which results in an explosive fireball. The explosion propels Bond forcefully against another wall, sending shards of glass raining down upon him. Reacting quickly, Bond seeks refuge beneath a nearby car and, from this position of relative safety, he identifies legs as his only visible targets. He fires at these targets before swiftly rising to his feet and breaking into a run. As he moves, Bond forcefully slams a man with a car door, continuing at full speed toward a set of stairs where he encounters Green's driver, who he promptly neutralizes. Meanwhile, Camille is engaged in her own skirmish; she skillfully dispatches the general's guards with gunfire and administers a powerful kick to one, sending him flying over a railing. As the commotion unfolds, the general disentangles himself from a hostess. Simultaneously, Camille tears off her shirt, readying herself in a defiant white top as Green hurriedly makes his way up the stairs. Upon reaching the top, Green assigns his German friend as an armed guard before entering the general's room. The hostess, with her hands bound, attempts to flee toward the door, but Camille intercepts and bats her aside, only to be attacked by the general moments later. The general disarms her by knocking the gun from her grip and slapping her. Bond, who has been making his way upstairs, becomes the target of Green's man, but before any harm can be inflicted, the compound’s main fuel cells erupt, setting the meeting area ablaze and filling it with flying glass. The blast consumes the German in the inferno, but Green manages to escape the flames, racing up the stairs with Bond in pursuit. Bond strategically positions himself above Green on a flat glass roof, where he fires downward, causing the glass to shatter. He drops back into the building, where Green seizes the opportunity to attack with a metal bar. In the fray, Bond loses his grip on his gun, and Green quickly arms himself with an ax from a nearby fire point, swinging it wildly at Bond. Concurrently, the general has Camille in a chokehold, pulling off the edge of the floor they occupy and dangling precariously in the air, relying solely on Bond who is holding him by the hair. Camille, struggling beneath her attacker, musters her strength to grab his groin and land a kick to his face. Capitalizing on this brief reprieve, she dives for the gun and takes a deep breath to steady herself, while Bond, with a firm grip on Green's hair, hauls him back up and throws him onto the floor just as the fire breaches the ceiling above. Bond quickly moves toward Camille, who is crouched in fear amidst the chaos of falling fire and masonry. As the building teeters on the brink of collapse, Bond races to reach her. Through the roaring flames, he spots her, envelops her in his arms even as the ceiling continues to disintegrate under the weight of fire and debris. Holding her tightly to provide comfort, Bond notices the gun, reaches for it, and holds it steadfastly. Her eyes, wide with terror, indicate the peril they both face. In a sudden burst, a fuel cell in the wall is exposed, triggering another blast that demolishes a large portion of the building's side. Amidst the destruction, Green manages to escape, and Bond, watching him flee, helps Camille as they clamber down the rubble-strewn path, dragging his injured foot. A distant plume of dust marks their passage across the desolate, empty desert. Behind the wheel of a car, Bond halts abruptly, steps out, and unceremoniously flings Green to the ground. Reaching into the trunk, he retrieves a can of oil, leaving Green to gaze contemplatively at the can and the departing car that disappears into the vast, empty expanse."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The chief's Land Rover reverses into a wall, triggering an explosion that hurls Bond against a wall amid flying glass. Bond, initially sheltering beneath a car, fires at visible legs before charging forward. After slamming a man with a car door, he ascends the stairs, taking down Green's driver. Meanwhile, Camille dispatches the general's guards, sending one over a railing, and confronts the general after freeing herself from a ripped shirt as Green ascends the stairs and places his German ally as a guard. The hostess, bound at the hands, attempts to flee but is knocked aside by Camille, who is then attacked by the general. Camille is disarmed and struck, while Bond races upstairs and narrowly avoids being shot by Green's man as the compound's fuel cells explode, incinerating the meeting area and the German guard. Green escapes upstairs with Bond in pursuit. Bond shoots through a glass roof, causing it to shatter, and re-enters the building, leading to a close-quarters fight where Bond loses his gun and Green attacks with an ax. The general dangles Camille over the edge, threatening her life, but she fights back fiercely. Bond rescues Green from falling, dumping him on the floor amidst falling debris. As Camille crouches in terror, Bond shields her from the collapsing building, retrieves a gun, and prepares to defend them. A fuel cell explosion devastates part of the building, allowing Green to escape. Bond and Camille navigate through rubble, eventually exiting into the desert. Bond drives away with Green, stops, and throws him to the ground, leaving him with a can of oil as he drives off into the barren landscape."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The chief's Land Rover, a rugged British vehicle often used for its reliability in tough terrains, reverses into a wall, which explodes in a fireball, and Bond is hurled against a wall and showered with glass. Huddled beneath a car amidst the chaos, Bond fires at legs, the only targets he can see, then he is up and running. He slams a man in a car door, runs to the concrete stairs, and takes down Green's driver with practiced precision. Camille, a trained operative from Bolivia, shoots the general's guards and kicks one so hard he flies over a railing in the opulent mansion. The general, who spearheaded a coup in his country, gets off the hostess. Camille rips off her shirt, revealing a stroppy white top known for its signature defiance, as Green, notorious for his dealings in international resources, bounds up the stairs. He places his German friend, a formidable enforcer with a sharp military background, as an armed guard, enters the general's room, and the hostess, hands bound, runs for the door, but is batted aside by Camille, who is then attacked by the general, notorious for his brutal tactics. He knocks the gun from her hand and slaps her. Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells, integral to its energy supply, erupt, engulfing the meeting area in flames and flying glass. The German is consumed in the fire, but Green, quick-thinking even in chaos, runs up the stairs, pursued by Bond. Bond is above Green on the flat glass roof, an architectural marvel, and fires down, causing the glass to disintegrate. He drops back into the building, and Green attacks with a metal bar, a common tool in emergencies. Bond drops his gun, and Green grabs an ax from a fire point, a standard emergency location, and flails wildly at Bond. The general has Camille by the throat, pulling off the edge of the floor they are on, and dangles in space, with Bond holding him by the hair. Camille struggles desperately under her attacker, grabs his groin, and kicks him in the face. She dives for the gun and breathes deeply, a moment of regained control, while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling. Bond runs to her aid as Camille sits crouched in terror, with fire and masonry, remnants of the building's once-grand structure, falling around her. The building is collapsing as Bond tries to reach her through the treacherous path. He spots her through the flames, puts his arms around her as the ceiling continues to crack with fire and falling rubble. Bond holds her tightly, spots the gun lying amidst debris and picks it up, while her eyes are wide with terror, and he is about to kill them. A burst exposes a fuel cell in the wall, and the blast takes out the whole side of the building, a devastating collapse. Green has got clear, and Bond watches him go as he and Camille clamber down the rubble, dragging his injured foot, a reminder of the peril they barely escaped. A plume of dust appears in the barren, empty desert, a vast wilderness stretching for miles. Bond is behind the wheel of a car, its engine purring in the solitude. He stops, gets out, flings Green to the ground, pulls a can of oil from the trunk, a makeshift weapon of retribution, and Green stares down at the can and at the car as it drives away across the vast, empty expanse, a scene of desolation and unfinished business."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass. Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running. He slams a man in a car door runs to the stairs and takes down Green's driver. Camille shoots the general's guards and kicks one so hard he flies over a railing. The general gets off the hostess. Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs. He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general. He knocks the gun from her hand and slaps her. Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt engulfing the meeting area in flames and flying glass. The German is consumed in the fire but Green runs up the stairs pursued by Bond. Bond is above Green on the flat glass roof and fires down causing the glass to disintegrate. He drops back into the building and Green attacks with a metal bar. Bond drops his gun and Green grabs an ax from a fire point and flails wildly at Bond. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The general has Camille by the throat pulls off the edge of the floor they are on and dangles in space with Bond holding him by the hair. Camille struggles desperately under her. attacker grabs his groin and kicks him in the face. She dives for the gun and breathes deeply while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling. Bond runs to her aid as Camille sits crouched in terror with fire and masonry falling around her. The building is collapsing as Bond tries to reach her. He spots her through the flames puts his arms around her as the ceiling continues to crack with fire and falling rubble. Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them. A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building. Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot. A plume of dust appears in the barren. empty desert. Bond is behind the wheel of a car. He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass. Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running. He slams a man in a car door runs to the stairs and takes down Green's driver. Camille shoots the general's guards and kicks one so hard he flies over a railing. The general gets off the hostess. Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs. He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general. He knocks the gun from her hand and slaps her. Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt engulfing the meeting area in flames and flying glass. The German is consumed in the fire but Green runs up the stairs pursued by Bond. Bond is above Green on the flat glass roof and fires down causing the glass to disintegrate. He drops back into the building and Green attacks with a metal bar. Bond drops his gun and Green grabs an ax from a fire point and flails wildly at Bond. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The general has Camille by the throat pulls off the edge of the floor they are on and dangles in space with Bond holding him by the hair. Camille struggles desperately under her. attacker grabs his groin and kicks him in the face. She dives for the gun and breathes deeply while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling. Bond runs to her aid as Camille sits crouched in terror with fire and masonry falling around her. The building is collapsing as Bond tries to reach her. He spots her through the flames puts his arms around her as the ceiling continues to crack with fire and falling rubble. Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them. A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building. Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot. A plume of dust appears in the barren. empty desert. Bond is behind the wheel of a car. He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass. Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running. He slams a man in a car door runs to the stairs and takes down Green's driver. Camille shoots the general's guards and kicks one so hard he flies over a railing. The general gets off the hostess. Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs. He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general. Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them. A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building. Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot. A plume of dust appears in the barren. empty desert. Bond is behind the wheel of a car. He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass. Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running. He slams a man in a car door runs to the stairs and takes down Green's driver. empty desert. Bond is behind the wheel of a car. He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The jester's unicycle somersaults into a fence, which implodes in a cascade of bubbles, and Robin is catapulted against a fence and sprinkled with confetti. Crouched beneath a wagon, Robin tosses pebbles at hats, the only targets he can spot, then he is crawling and sliding. He bumps a cat in a revolving door, slides to the elevator, and topples Silver's assistant. Ivy throws pies at the conductor's acrobats and nudges one so softly he tumbles over a banister. The conductor jumps off the actress. Ivy tears off her vest and stands poised in a frilly pink apron as Silver skips up the elevator. He positions his French companion as bodyguard, skips the conductor's chamber, and the actress, feet untied, skips for the curtain, but is nudged aside by Ivy, who is then embraced by the conductor. He tosses the wand from her grip and cheers her. Robin slides upstairs and is aimed at by Silver's jester just as the castle's main power generators burst, blanketing the ballroom in sparkles and floating glitter. The Frenchman is enveloped in the sparkle, but Silver skips up the elevator, chased by Robin. Robin is above Silver on the rounded crystal canopy and tosses down, causing the crystal to shatter. He descends back into the structure, and Silver waltzes with a wooden spoon. Robin drops his wand, and Silver grabs a broom from a pail station and swings frantically at Robin. The conductor has Ivy by the ankle, pulls off the corner of the attic they are in, and dangles in air, with Robin gripping him by the scarf. Ivy flails frantically under her clown, grabs his knee, and nudges him in the chin. She spins for the wand and inhales deeply, while Robin lifts Silver back up by the scarf and plops him on the platform just as sparkles cascade through the canopy. Robin slides to her side as Ivy kneels crouched in panic, with sparkles and plaster sprinkling around her. The structure is unfolding as Robin slides to reach her. He peeks at her through the sparklers, places his wings around her as the canopy continues to crumble with sparkles and tumbling debris. Robin cuddles her gently, spots the wand and grasps it, while her eyes are wide with panic, and he is about to collapse them. A blast unveils a power generator in the fence, and the sparkle bursts out the entire part of the structure. Silver has popped free, and Robin gazes at him escape as he and Ivy tumble down the debris, hobbling his wounded toe. A plume of feathers emerges in the barren, empty wilderness. Robin is atop the handlebars of a chariot. He halts, leaps off, plants Silver to the dirt, tugs a jug of syrup from the satchel, and Silver peers down at the jug and at the chariot as it rolls away across the endless, vacant stretch."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The chief's Land Rover crashes into a wall, causing an explosion that hurls Bond against a wall. Hiding beneath a car, Bond shoots at visible legs before running. He slams a man with a car door, defeats Green's driver, and heads upstairs. Camille deals with the general's guards, but the general attacks her. Green places his German friend as a guard, but Bond arrives as the compound explodes. The German dies in flames, and Bond pursues Green, shooting through a glass roof. Green attacks Bond with an ax while the general assaults Camille. Camille manages to fend off the general, and Bond saves her as the building collapses. Bond holds Camille as they escape, but Green gets away. Bond catches up with Green in the desert, throws him to the ground, and leaves him with a can of oil, driving away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse Bond is behind the wheel of a car empty desert A plume of dust appears in the barren Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them He spots her through the flames puts his arms around her as the ceiling continues to crack with fire and falling rubble The building is collapsing as Bond tries to reach her Bond runs to her aid as Camille sits crouched in terror with fire and masonry falling around her She dives for the gun and breathes deeply while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling attacker grabs his groin and kicks him in the face Camille struggles desperately under her The general has Camille by the throat pulls off the edge of the floor they are on and dangles in space with Bond holding him by the hair Bond drops his gun and Green grabs an ax from a fire point and flails wildly at Bond He drops back into the building and Green attacks with a metal bar Bond is above Green on the flat glass roof and fires down causing the glass to disintegrate The German is consumed in the fire but Green runs up the stairs pursued by Bond Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt engulfing the meeting area in flames and flying glass He knocks the gun from her hand and slaps her He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs The general gets off the hostess Camille shoots the general's guards and kicks one so hard he flies over a railing He slams a man in a car door runs to the stairs and takes down Green's driver Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass Camille shoots the general's guards and kicks one so hard he flies over a railing He slams a man in a car door runs to the stairs and takes down Green's driver Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs The general gets off the hostess He knocks the gun from her hand and slaps her He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general The German is consumed in the fire but Green runs up the stairs pursued by Bond Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt engulfing the meeting area in flames and flying glass He drops back into the building and Green attacks with a metal bar Bond is above Green on the flat glass roof and fires down causing the glass to disintegrate The general has Camille by the throat pulls off the edge of the floor they are on and dangles in space with Bond holding him by the hair Bond drops his gun and Green grabs an ax from a fire point and flails wildly at Bond attacker grabs his groin and kicks him in the face Camille struggles desperately under her Bond runs to her aid as Camille sits crouched in terror with fire and masonry falling around her She dives for the gun and breathes deeply while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling He spots her through the flames puts his arms around her as the ceiling continues to crack with fire and falling rubble The building is collapsing as Bond tries to reach her A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them A plume of dust appears in the barren Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot Bond is behind the wheel of a car empty desert He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Camille struggles desperately under her attacker grabs his groin and kicks him in the face She dives for the gun and breathes deeply while Bond hauls Green back up by the hair and dumps him on the floor just as fire falls through the ceiling Bond runs to her aid as Camille sits crouched in terror with fire and masonry falling around her The building is collapsing as Bond tries to reach her He spots her through the flames puts his arms around her as the ceiling continues to crack with fire and falling rubble Bond holds her tightly spots the gun and picks it up while her eyes are wide with terror and he is about to kill them A burst exposes a fuel cell in the wall and the blast takes out the whole side of the building Green has got clear and Bond watches him go as he and Camille clamber down the rubble dragging his injured foot A plume of dust appears in the barren empty desert Bond is behind the wheel of a car He stops gets out flings Green to the ground pulls a can of oil from the trunk and Green stares down at the can and at the car as it drives away across the vast empty expanse The chief's Land Rover reverses into a wall which explodes in a fireball and Bond is hurled against a wall and showered with glass Huddled beneath a car Bond fires at legs the only targets he can see then he is up and running He slams a man in a car door runs to the stairs and takes down Green's driver Camille shoots the general's guards and kicks one so hard he flies over a railing The general gets off the hostess Camille rips off her shirt and stands ready in a stroppy white top as Green bounds up the stairs He places his German friend as armed guard enters the general's room and the hostess hands bound runs for the door but is batted aside by Camille who is then attacked by the general He knocks the gun from her hand and slaps her Bond runs upstairs and is aimed at by Green's man just as the compound's main fuel cells erupt engulfing the meeting area in flames and flying glass The German is consumed in the fire but Green runs up the stairs pursued by Bond Bond is above Green on the flat glass roof and fires down causing the glass to disintegrate He drops back into the building and Green attacks with a metal bar Bond drops his gun and Green grabs an ax from a fire point and flails wildly at Bond The general has Camille by the throat pulls off the edge of the floor they are on and dangles in space with Bond holding him by the hair"
        }
      ]
    }
  ]
}