{
  "ground_truth": "His features are broad, friendly, Asian-American. A waitress meets them at the table. Again she glances about. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The reverse shows a disappearing waiter and the backs of many, many people sitting at tables between us and the very distant stage. Jose Feliciano, very small, performs on a spotlit stool. The acoustics are poor. Carl grimaces. Carl is humping the escort. The escort is grabbed and flung out of bed. Shep slaps him hard, forehand, backhand. He hauls him up. After hitting him several times, Shep yanks Carl's belt out of his dangling pants and strangles him with it. Carl gurgles. Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the belt. His face is deeply bruised and cut. Finally, through the phone, Jerry is at the kitchen phone. Through the door to the dining room we see Wade picking up an extension. The line goes dead. A door slams off-screen. Wade, briefcase in hand, gets into his Cadillac, slams the door and peels out. Thunk! - his first boot goes on. He mumbles to himself as he drives. He pulls out a gun and fires into Wade's gut. Jerry pulls to a halt next to Wade's idling Cadillac. Jerry approaches in the Cadillac. The wooden gate barring the exit has been broken away. The booth is empty. Jerry eases toward the street, looking over at the booth as he passes. Inside the booth we see the awkwardly angled leg of a prostrate body. The car pulls into the driveway. Jerry enters and sits on the foyer chair to take off his galoshes. In his car, now parked, one hand holding the rag pressed to his mangled jaw. He is staring down at something in the front seat next to him. It has money inside - a lot of money. Carl unfreezes, takes out one of the bank-wrapped wads and looks at it. Marge drives, gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot, eating a breakfast sandwich. Jerry is at his desk using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry periodically checks. The carbon-copy form shows thick smudgy, illegible entries. She starts to enter. Jerry looks up and freezes, mouth hanging open, brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "His facial characteristics are wide, amiable, Asian-American. A server greets them at the table. Again, she peeks around. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The opposite view shows a vanishing server and the backs of numerous, numerous people seated at tables between us and the very distant stage. Jose Feliciano, very small, performs on a spotlighted stool. The acoustics are subpar. Carl winces. Carl is thrusting the companion. The companion is grabbed and thrown out of bed. Shep slaps him hard, forehand, backhand. He drags him up. After hitting him several times, Shep yanks Carl's belt out of his hanging trousers and strangles him with it. Carl gurgles. Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the belt. His visage is deeply bruised and cut. Finally, through the phone, Jerry is at the kitchen phone. Through the door to the dining room, we see Wade picking up an extension. The line goes dead. A door slams off-screen. Wade, briefcase in hand, gets into his Cadillac, slams the door and peels out. Thunk! - his first boot goes on. He mutters to himself as he drives. He draws out a gun and fires into Wade's abdomen. Jerry pulls to a halt next to Wade's idling Cadillac. Jerry approaches in the Cadillac. The wooden gate obstructing the exit has been broken away. The booth is unoccupied. Jerry eases toward the street, looking over at the booth as he passes. Inside the booth, we see the awkwardly angled leg of a fallen body. The vehicle pulls into the driveway. Jerry enters and sits on the foyer chair to remove his galoshes. In his car, now parked, one hand holding the cloth pressed to his mangled jaw. He is staring down at something in the front seat next to him. It has cash inside - a lot of cash. Carl unfreezes, takes out one of the bank-wrapped wads and examines it. Marge drives, gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot, consuming a breakfast sandwich. Jerry is at his desk using a dull pencil to enter numerals onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry periodically checks. The carbon-copy form shows thick smudgy, indecipherable entries. She starts to enter. Jerry looks up and freezes, mouth hanging open, brow knitted with worry. But she is already sitting in the chair opposite with a sigh of relieved weight. There is a silent pause. He trails off into silence."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His features are broad, friendly, Asian-American. They are met at the table by a waitress. Again the place is glanced about by her. His side of the booth is slid out of, and Marge is eased in next to by him. It is clinked by Marge. The reverse shows a disappearing waiter and the backs of many, many people sitting at tables between us and the very distant stage. Jose Feliciano, very small, is performing on a spotlit stool. The acoustics are poor. A grimace is made by Carl. The escort is humped by Carl. He grabs and flings the escort out of bed. Shep hard forehands and backhands him. Carl is hauled up by him. After he hits Carl several times, Carl's belt is yanked out of his dangling pants by Shep and used to strangle him. Carl gurgles. Carl is kneed repeatedly by Shep, then Carl is dumped onto the floor and a whipping is started with the buckle end of the belt by him. His face is deeply bruised and cut. Finally, Jerry is on the kitchen phone. Through the door to the dining room, we see Wade picking up an extension. The line goes dead. Off-screen, a door is slammed. Wade, briefcase in hand, gets into his Cadillac, slams the door, and peels out. Thunk! - the first boot is put on by him. To himself, he mumbles as he drives. Into Wade's gut, he pulls out a gun and fires. Next to Wade's idling Cadillac, Jerry pulls to a halt. Inside the Cadillac, Jerry approaches. The wooden gate barring the exit has been broken away. The booth is empty. Toward the street, Jerry eases, looking over at the booth as he passes. Inside the booth, an awkwardly angled leg of a prostrate body is seen. Pulling into the driveway, the car stops. On the foyer chair, Jerry sits to take off his galoshes. In the car, now parked, a hand is holding the rag pressed to his mangled jaw. Down at something in the front seat next to him, he is staring. Inside the seat, money is placed - a lot of money. Carl unfreezes, takes out one of the bank-wrapped wads, and it is looked at by him. The road is gazed out at as Marge drives. Out of her open window, she leans and yells at the order panel. Sitting in the lot, a breakfast sandwich is eaten by her. At his desk, Jerry is using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper, and beneath that, another form copy is periodically checked by Jerry. Thick, smudgy, illegible entries are shown on the carbon-copy form. She starts to enter. Up Jerry looks, and a freeze is initiated with his mouth hanging open, brow knit with worry. But she is already sitting in the chair opposite with a sigh of relieved weight. A silent beat occurs. Silence is trailed off into by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "His features are broad, friendly, Asian-American. A waitress meets them at the table. He slides out of his booth and sits next to Marge, who clinks her glass. The reverse shows a disappearing waiter and many people between us and the distant stage where Jose Feliciano performs on a spotlit stool. The acoustics are poor. Carl grimaces, then attacks the escort, flinging her out of bed. Shep slaps Carl, hauls him up, and strangles him with his belt. Carl gurgles as Shep knees him and whips him with the belt buckle. Carl's face is bruised and cut. Jerry is on the kitchen phone, and Wade picks up an extension. The line goes dead, and Wade, briefcase in hand, gets into his Cadillac and speeds off. Thunk! - his first boot goes on. He mumbles while driving, pulls out a gun, and shoots Wade. Jerry stops next to Wade's idling Cadillac. The wooden gate barring the exit is broken. The booth is empty. Jerry eases toward the street, glancing at the booth. Inside, a prostrate body is visible. Jerry enters his car, holding a rag to his mangled jaw, staring at a lot of money in the front seat. Carl unfreezes, takes out a bank-wrapped wad, and looks at it. Marge drives, gazing at the road, leans out her window, and yells at the order panel. She eats a breakfast sandwich in the lot. Jerry, at his desk, uses a blunt pencil to enter numbers onto a form with carbon paper beneath, creating smudgy, illegible entries. She enters, and Jerry freezes, worried. She sits opposite him with a relieved sigh. There is a silent beat. He trails off into silence."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "His features are broad, friendly, Asian-American. A waitress meets them at the table. He slides out of his booth and sits next to Marge, who clinks her glass. The reverse shows a disappearing waiter and many people between us and the distant stage. Jose Feliciano performs on a stool; the acoustics are poor. Carl grimaces, humping the escort, who is flung out of bed. Shep slaps Carl, hauls him up, and strangles him with his belt. Carl gurgles as Shep knees him and whips him with the belt buckle. Carl's face is bruised and cut. Jerry is at the kitchen phone; Wade picks up an extension. The line goes dead, and Wade, with a briefcase, gets into his Cadillac and peels out. Thunk! - his first boot goes on. He mumbles while driving, pulls out a gun, and shoots Wade. Jerry halts next to Wade's Cadillac. The wooden gate is broken. The booth is empty. Jerry eases toward the street, passing the booth with a prostrate body inside. Jerry enters, sits in the foyer, and removes his galoshes. In his parked car, he holds a rag to his jaw, staring at money in the seat. Carl unfreezes, takes a bank-wrapped wad, and looks at it. Marge drives, yells at the order panel, and eats a breakfast sandwich. Jerry uses a blunt pencil to enter numbers on a form with carbon paper beneath, creating smudgy, illegible entries. She enters, and Jerry freezes, worried. She sits opposite with a relieved sigh. There is a silent beat. He trails off into silence."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "His facial features are broad and friendly, reflecting his Asian-American heritage. A waitress approaches them at the table, ready to take their order. Once again, she glances around the room, taking in her surroundings. He is in the process of sliding out from his side of the booth and gently easing himself in next to Marge. Marge raises her glass, and they clink it together in a toast. The reverse shot reveals a waiter disappearing into the distance and the backs of numerous people sitting at tables between us and the very distant stage. On that stage, Jose Feliciano, appearing very small, performs while seated on a spotlit stool. Unfortunately, the acoustics in the room are poor, causing Carl to grimace in discomfort. Carl is engaged in an intimate moment with the escort. Suddenly, the escort is grabbed and forcefully flung out of bed. Shep slaps Carl hard, first with a forehand and then with a backhand. He hauls Carl up roughly. After hitting him several times, Shep yanks Carl's belt out of his dangling pants and uses it to strangle him. Carl gurgles in distress. Shep knees Carl repeatedly, then dumps him onto the floor and begins whipping him with the buckle end of the belt. Carl's face becomes deeply bruised and cut. Finally, through the phone, Jerry is at the kitchen phone. Through the door leading to the dining room, we see Wade picking up an extension. The line suddenly goes dead. A door slams off-screen. Wade, with a briefcase in hand, gets into his Cadillac, slams the door shut, and peels out of the driveway. Thunk! - his first boot goes on. He mumbles to himself as he drives. He pulls out a gun and fires it into Wade's gut. Jerry pulls to a halt next to Wade's idling Cadillac. Jerry approaches in the Cadillac. The wooden gate that was barring the exit has been broken away. The booth is now empty. Jerry eases toward the street, glancing over at the booth as he passes by. Inside the booth, we see the awkwardly angled leg of a prostrate body. The car pulls into the driveway. Jerry enters the house and sits on the foyer chair to take off his galoshes. In his car, now parked, he holds a rag pressed to his mangled jaw with one hand. He is staring down at something in the front seat next to him. It is filled with money—a lot of money. Carl unfreezes, takes out one of the bank-wrapped wads, and looks at it. Marge drives, gazing out at the road ahead. She leans out of her open window and yells at the order panel. She sits in the parking lot, eating a breakfast sandwich. Jerry is at his desk, using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper, and beneath that, another form copy, which Jerry periodically checks. The carbon-copy form shows thick, smudgy, and illegible entries. She starts to enter. Jerry looks up and freezes, his mouth hanging open, his brow knit with worry. But she is already sitting into the chair opposite him with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "His facial features are broad and friendly, embodying a welcoming expression that reflects his Asian-American heritage with a warmth that is both inviting and genuine. As they sit at the table, a waitress approaches with a practiced, attentive demeanor, prepared and eager to take their order with a ready smile. Once again, she momentarily glances around the room, absorbing the ambiance and taking in the details of her surroundings with a curious and attentive gaze. He begins the process of sliding out from his side of the booth, moving with gentle deliberation as he eases himself in next to Marge, settling comfortably beside her. Marge raises her glass in a celebratory gesture, and they clink their glasses together in a shared toast that signals camaraderie and mutual goodwill. The reverse shot reveals a waiter, quietly retreating into the distance, disappearing from view while the backs of numerous individuals sitting at tables create a bustling backdrop between us and the distant stage. On that far-off stage, Jose Feliciano, appearing very small from the distance, is performing while seated on a stool that is illuminated by a solitary spotlight. Unfortunately, the room's acoustics are poor, causing Carl to grimace in visible discomfort at the sound. Carl is intimately engaged with the escort, sharing a moment before it is abruptly interrupted. Suddenly, the escort is grabbed and forcefully flung out of bed, disrupting the moment. Shep slaps Carl hard, first delivering a forehand slap and then following with a backhand. He hauls Carl up with rough urgency. After striking him several times, Shep yanks Carl’s belt out of his dangling pants and uses it to strangle him, leaving Carl gurgling in distress. Shep continues his assault, repeatedly kneeing Carl before dumping him onto the floor and commencing to whip him with the buckle end of the belt. Carl's face increasingly becomes deeply bruised and cut from the violent encounter. Finally, Jerry is at the kitchen phone, his voice reaching through the line, while through the door leading to the dining room, we see Wade picking up an extension, adding tension to the moment. Suddenly, the line goes dead, and a door slams off-screen. Wade, with a briefcase in hand, decisively gets into his Cadillac, slams the door shut with a firm motion, and peels out of the driveway with a sense of urgency. Thunk! - the sound punctuates the moment as his first boot goes on. He mumbles to himself, a stream of consciousness, as he drives. He pulls out a gun and fires it with lethal intent into Wade's gut. Jerry pulls to a halt next to Wade's idling Cadillac, observing the scene. Jerry approaches the Cadillac, and the wooden gate that once barred the exit has been decisively broken away. The booth is now conspicuously empty. Jerry eases toward the street, his gaze drifting over toward the booth as he passes by. Inside the booth, we catch a glimpse of the awkwardly angled leg of the prostrate body within. The car pulls into the driveway, completing its journey. Jerry enters the house and settles into the foyer chair to remove his galoshes with methodical motions. In his parked car, he holds a rag pressed against his mangled jaw with one hand, staring down intently at something occupying the front seat next to him. It is filled with money—a significant amount of money. Carl eventually unfreezes, taking out one of the bank-wrapped wads, examining it with scrutiny. Marge drives along the road, her gaze fixed intently on the road ahead. She leans out of her open window, yelling emphatically at the order panel to make her intention clear. She then settles into the parking lot, consuming her breakfast sandwich with quiet satisfaction. Jerry is at his desk, using a blunt pencil to painstakingly enter numbers onto a form, his focus evident. Beneath the form, a piece of carbon paper lies ready, and beneath that, another copy of the form that Jerry checks periodically, examining its details. The carbon-copy form shows thick, smudgy, and illegible entries, adding to the complexity of his task. As she starts to enter, Jerry looks up abruptly, freezing in place, his mouth hanging open in surprise, his brow knit with worry. Yet, she is already seated in the chair opposite him, letting out a sigh of relieved weight as she settles. A silent beat follows as he trails off into silence, the moment suspended in time."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "His features are broad and friendly, reflecting his Asian-American heritage, as a waitress approaches their table, glancing around the room with a quick, assessing look. He begins to slide out from his side of the booth, carefully maneuvering his body to ease in next to Marge, who responds by clinking her glass against his. The scene shifts to reveal a waiter disappearing into the distance, while the backs of numerous people seated at tables create a barrier between us and the very distant stage, where a very small Jose Feliciano performs on a stool illuminated by a spotlight. The poor acoustics of the venue cause Carl to grimace in discomfort. In a sudden shift, Carl is seen humping the escort, who is then abruptly grabbed and flung out of bed. Shep, with a swift motion, slaps Carl hard, alternating between forehand and backhand strikes, before hauling him up with a forceful grip. After delivering several blows, Shep yanks Carl's belt out of his dangling pants and uses it to strangle him, causing Carl to gurgle in distress. Shep continues his assault by kneeing Carl repeatedly, then dumping him onto the floor and starting to whip him with the buckle end of the belt, leaving Carl's face deeply bruised and cut. Meanwhile, Jerry is at the kitchen phone, and through the door to the dining room, we see Wade picking up an extension, only for the line to go dead as a door slams off-screen. Wade, with a briefcase in hand, gets into his Cadillac, slams the door shut, and peels out with a sense of urgency. As he drives, he mumbles to himself, then pulls out a gun and fires into Wade's gut. Jerry brings his car to a halt next to Wade's idling Cadillac and approaches it, noticing that the wooden gate barring the exit has been broken away. The booth is now empty, and as Jerry eases toward the street, he glances over at the booth, where inside, the awkwardly angled leg of a prostrate body is visible. The car pulls into the driveway, and Jerry enters the house, sitting on the foyer chair to remove his galoshes. In his parked car, he holds a rag pressed to his mangled jaw, staring down at something in the front seat next to him, which turns out to be a lot of money. Carl unfreezes, takes out one of the bank-wrapped wads, and examines it. Meanwhile, Marge drives, her gaze fixed on the road ahead. She leans out of her open window to yell at the order panel, then sits in the lot, eating a breakfast sandwich. Jerry is at his desk, using a blunt pencil to enter numbers onto a form, beneath which lies a piece of carbon paper and another form copy that Jerry periodically checks, revealing thick, smudgy, illegible entries on the carbon-copy form. As she starts to enter, Jerry looks up and freezes, his mouth hanging open and brow knit with worry, but she is already settling into the chair opposite him with a sigh of relieved weight. There is a silent beat as he trails off into silence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "His features are broad and friendly, reflecting his Asian-American heritage. A waitress approaches their table, glancing around as he slides out of his booth seat to sit next to Marge, who clinks her glass. In the background, a distant stage features a small Jose Feliciano performing on a poorly acoustically set stool, causing Carl to grimace. The scene shifts to Carl being violently attacked by Shep, who slaps him, hauls him up, and strangles him with his own belt before repeatedly kneeing and whipping him, leaving Carl bruised and cut. \n\nMeanwhile, Jerry is on the kitchen phone as Wade picks up an extension in the dining room, but the line goes dead, and Wade exits abruptly, briefcase in hand, driving off in his Cadillac. As he drives, he mumbles to himself, pulls out a gun, and shoots Wade. Jerry arrives at the scene, halting next to Wade's idling Cadillac, and notices the broken wooden gate. He approaches the booth, spotting a prostrate body inside, then drives into a driveway, enters a house, and sits to remove his galoshes. In his parked car, he holds a rag to his injured jaw, staring at a large sum of money in the front seat. Carl examines one of the bank-wrapped wads.\n\nMarge drives, yelling at an order panel through her open window before eating a breakfast sandwich in the parking lot. Jerry, at his desk, uses a blunt pencil to fill out a form with carbon paper underneath, resulting in smudged, illegible entries. As someone enters, Jerry looks up, frozen with worry, but she sits opposite him with a relieved sigh, leading to a silent pause as he trails off into silence."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "His features are broad, friendly, Asian-American, reflecting a diverse heritage that is a blend of various Asian cultures with American influences. A waitress, a staff member known for her efficiency at the popular downtown café, meets them at the table. Again she glances about, perhaps looking for a colleague to assist during the busy lunch hour. He is sliding out of his side of the booth and easing in next to Marge, who is widely recognized in their circle for her boisterous laugh. Marge clinks it, a gesture rooted in the tradition of toasting to companionship and good times. The reverse shows a disappearing waiter and the backs of many, many people sitting at tables between us and the very distant stage. Jose Feliciano, a renowned Puerto Rican guitarist and singer known for his soulful interpretations, very small, performs on a spotlit stool. The acoustics are poor, making it difficult for the audience to fully appreciate his usually vibrant performances. Carl grimaces, a reaction to the sound quality that's not up to the usual high standards of the famous music venue. Carl is humping the escort, a situation that's turned dangerous in the room of a budget motel known for its transient clientele. The escort is grabbed and flung out of bed in what seems to be escalating violence. Shep slaps him hard, forehand, backhand, his actions clearly fueled by growing rage. He hauls him up as if possessed by a singular purpose. After hitting him several times, Shep yanks Carl's belt out of his dangling pants and strangles him with it, a horrifying scene of aggression. Carl gurgles, a sound that signals his desperate struggle. Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the belt, showing no sign of remorse. His face is deeply bruised and cut, evidence of Shep's vicious assault. Finally, through the phone, Jerry is at the kitchen phone, an outdated rotary model rarely seen these days. Through the door to the dining room, we see Wade picking up an extension, a gesture that connects them to the same line. The line goes dead, abruptly ending the communication. A door slams off-screen with a sound that hints at hurried movement. Wade, briefcase in hand, gets into his Cadillac, a luxury vehicle that suggests his taste for status symbols, slams the door and peels out. Thunk! - his first boot goes on, a sound that denotes urgency. He mumbles to himself as he drives, possibly rehearsing a plan or grappling with a decision. He pulls out a gun, a small silver revolver, and fires into Wade's gut, a fatal action that seals Wade's fate. Jerry pulls to a halt next to Wade's idling Cadillac, absorbing the gravity of the situation. Jerry approaches in the Cadillac, which idles quietly despite the chaos. The wooden gate barring the exit has been broken away, signaling a hasty departure. The booth is empty, devoid of the usual attendant. Jerry eases toward the street, looking over at the booth as he passes, seeing remnants of a once-busy scene. Inside the booth, we see the awkwardly angled leg of a prostrate body, a tragic figure left unattended. The car pulls into the driveway, marking a brief pause in Jerry's tumultuous day. Jerry enters and sits on the foyer chair to take off his galoshes, a thoughtful action that speaks to the rainy weather outside. In his car, now parked, one hand holding the rag pressed to his mangled jaw, a stark reminder of recent violence. He is staring down at something in the front seat next to him. It has money inside - a lot of money, all tightly bound in bank-issued straps. Carl unfreezes, takes out one of the bank-wrapped wads and looks at it, a sight that might represent his way out of this mess. Marge drives, gazing out at the road, mentally planning her next move. She leans out of her open window and yells at the order panel of a roadside drive-thru. She sits in the lot, eating a breakfast sandwich that hints at a long day ahead. Jerry is at his desk using a blunt pencil to enter numbers onto a form, a tedious task that adds to his growing frustration. Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry periodically checks, a process that ensures accurate record-keeping despite the outdated method. The carbon-copy form shows thick smudgy, illegible entries, a testament to the pencil's wear and tear. She starts to enter, her presence introducing a new tension in the room. Jerry looks up and freezes, mouth hanging open, brow knit with worry, sensing the impending challenge. But she is already sitting into the chair opposite with a sigh of relieved weight, marking the end of her search for resolution. There is a silent beat that underscores the gravity of the moment. He trails off into silence, feeling the weight of unspoken words."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "His features are broad friendly AsianAmerican  A waitress meets them at the table  Again she glances about  He is sliding out of his side of the booth and easing in next to Marge  Marge clinks it  The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage  Jose Feliciano very small performs on a spotlit stool  Jerry is at the kitchen phone  Through the door to the dining room we see Wade picking up an extension  The line goes dead  A door slams offscreen  Wade briefcase in hand gets into his Cadillac slams the door and peels out  Thunk  his first boot goes on  He mumbles to himself as he drives  He pulls out a gun and fires into Wade's gut  Jerry pulls to a halt next to Wade's idling Cadillac  Jerry approaches in the Cadillac  The wooden gate barring the exit has been broken away  The booth is empty  Jerry eases toward the street looking over at the booth as he passes  Inside the booth we see the awkwardly angled leg of a prostrate body  The car pulls into the driveway  Jerry enters and sits on the foyer chair to take off his galoshes  In his car now parked one hand holding the rag pressed to his mangled jaw  He is staring down at something in the front seat next to him  It has money inside  a lot of money  Carl unfreezes takes out one of the bankwrapped wads and looks at it  Marge drives gazing out at the road  She leans out of her open window and yells at the order panel  She sits in the lot eating a breakfast sandwich  Jerry is at his desk using a blunt pencil to enter numbers onto a form  Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks  The carboncopy form shows thick smudgy illegible entries  The acoustics are poor  Carl grimaces  Carl is humping the escort  The escort is grabbed and flung out of bed  Shep slaps him hard forehand backhand  He hauls him up  After hitting him several times  Shep yanks Carl's belt out of his dangling pants and strangles him with it  Carl gurgles  Shep knees  Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt  His face is deeply bruised and cut  Finally through the phone  Jerry is at the kitchen phone  Through the door to the dining room we see Wade picking up an extension  The line goes dead  A door slams offscreen  Wade briefcase in hand gets into his Cadillac slams the door and peels out  Thunk  his first boot goes on  He mumbles to himself as he drives  He pulls out a gun and fires into Wade's gut  Jerry pulls to a halt next to Wade's idling Cadillac  Jerry approaches in the Cadillac  The wooden gate barring the exit has been broken away  The booth is empty  Jerry eases toward the street looking over at the booth as he passes  Inside the booth we see the awkwardly angled leg of a prostrate body  The car pulls into the driveway  Jerry enters and sits on the foyer chair to take off his galoshes  In his car now parked one hand holding the rag pressed to his mangled jaw  He is staring down at something in the front seat next to him  It has money inside  a lot of money  Carl unfreezes takes out one of the bankwrapped wads and looks at it  Marge drives gazing out at the road  She leans out of her open window and yells at the order panel  She sits in the lot eating a breakfast sandwich  Jerry is at his desk using a blunt pencil to enter numbers onto a form  Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks  The carboncopy form shows thick smudgy illegible entries  She starts to enter  Jerry looks up and freezes mouth hanging open brow knit with worry  But she is already sitting into the chair opposite with a sigh of relieved weight  There is a silent beat  He trails off into silence"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "His features are broad friendly AsianAmerican. A waitress meets them at the table. Again she glances about. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage. Jose Feliciano very small performs on a spotlit stool. The acoustics are poor. Carl grimaces. Carl is humping the escort. The escort is grabbed and flung out of bed. Shep slaps him hard forehand backhand. He hauls him up. After hitting him several times. Shep yanks Carl's belt out of his dangling pants and strangles him with it. Carl gurgles. Shep knees. Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt. His face is deeply bruised and cut. Finally through the phone. Jerry is at the kitchen phone. Through the door to the dining room we see Wade picking up an extension. The line goes dead. A door slams offscreen. Wade briefcase in hand gets into his Cadillac slams the door and peels out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Thunk  his first boot goes on. He mumbles to himself as he drives. He pulls out a gun and fires into Wade's gut. Jerry pulls to a halt next to Wade's idling Cadillac. Jerry approaches in the Cadillac. The wooden gate barring the exit has been broken away. The booth is empty. Jerry eases toward the street looking over at the booth as he passes. Inside the booth we see the awkwardly angled leg of a prostrate body. The car pulls into the driveway. Jerry enters and sits on the foyer chair to take off his galoshes. In his car now parked one hand holding the rag pressed to his mangled jaw. He is staring down at something in the front seat next to him. It has money inside  a lot of money. Carl unfreezes takes out one of the bankwrapped wads and looks at it. Marge drives gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot eating a breakfast sandwich. Jerry is at his desk using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks. The carboncopy form shows thick smudgy illegible entries. She starts to enter. Jerry looks up and freezes mouth hanging open brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "His features are broad friendly AsianAmerican. A waitress meets them at the table. Again she glances about. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage. Jose Feliciano very small performs on a spotlit stool. The acoustics are poor. Carl grimaces. Carl is humping the escort. The escort is grabbed and flung out of bed. Shep slaps him hard forehand backhand. He hauls him up. After hitting him several times. Shep yanks Carl's belt out of his dangling pants and strangles him with it. Carl gurgles. Shep knees. Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt. His face is deeply bruised and cut. Finally through the phone. Jerry is at the kitchen phone. Through the door to the dining room we see Wade picking up an extension. The line goes dead. A door slams offscreen. Wade briefcase in hand gets into his Cadillac slams the door and peels out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Thunk  his first boot goes on. He mumbles to himself as he drives. He pulls out a gun and fires into Wade's gut. Jerry pulls to a halt next to Wade's idling Cadillac. Jerry approaches in the Cadillac. The wooden gate barring the exit has been broken away. The booth is empty. Jerry eases toward the street looking over at the booth as he passes. Inside the booth we see the awkwardly angled leg of a prostrate body. The car pulls into the driveway. Jerry enters and sits on the foyer chair to take off his galoshes. In his car now parked one hand holding the rag pressed to his mangled jaw. He is staring down at something in the front seat next to him. It has money inside  a lot of money. Carl unfreezes takes out one of the bankwrapped wads and looks at it. Marge drives gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot eating a breakfast sandwich. Jerry is at his desk using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks. The carboncopy form shows thick smudgy illegible entries. She starts to enter. Jerry looks up and freezes mouth hanging open brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "His features are broad friendly AsianAmerican. A waitress meets them at the table. Again she glances about. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage. Jose Feliciano very small performs on a spotlit stool. The acoustics are poor. Carl grimaces. Carl is humping the escort. The escort is grabbed and flung out of bed. Shep slaps him hard forehand backhand. He hauls him up. It has money inside  a lot of money. Carl unfreezes takes out one of the bankwrapped wads and looks at it. Marge drives gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot eating a breakfast sandwich. Jerry is at his desk using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks. The carboncopy form shows thick smudgy illegible entries. She starts to enter. Jerry looks up and freezes mouth hanging open brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "His features are broad friendly AsianAmerican. A waitress meets them at the table. Again she glances about. He is sliding out of his side of the booth and easing in next to Marge. Marge clinks it. The carboncopy form shows thick smudgy illegible entries. She starts to enter. Jerry looks up and freezes mouth hanging open brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "His features are broad, friendly, Asian-American. A penguin meets them at the table. Again the penguin glances about. The giraffe is sliding out of its side of the booth and easing in next to Marge. Marge clinks it. The reverse shows a disappearing kangaroo and the backs of many, many people sitting at tables between us and the very distant stage. A squirrel, very small, performs on a spotlit stool. The acoustics are poor. A rabbit grimaces. The rabbit is humping the escort. The escort is grabbed and flung out of bed. An elephant slaps the rabbit hard, forehand, backhand. The elephant hauls the rabbit up. After hitting the rabbit several times, the elephant yanks a rabbit's belt out of its dangling pants and strangles the rabbit with it. The rabbit gurgles. The elephant knees the rabbit repeatedly, then dumps the rabbit onto the floor and starts whipping the rabbit with the buckle end of the belt. Its face is deeply bruised and cut. Finally, through the phone, a parrot is at the kitchen phone. Through the door to the dining room, we see a koala picking up an extension. The line goes dead. A door slams off-screen. The koala, briefcase in hand, gets into its Cadillac, slams the door and peels out. Thunk! - the koala's first boot goes on. The koala mumbles to itself as it drives. The koala pulls out a gun and fires into the koala’s gut. The parrot pulls to a halt next to the koala's idling Cadillac. The parrot approaches in the Cadillac. The wooden gate barring the exit has been broken away. The booth is empty. The parrot eases toward the street, looking over at the booth as it passes. Inside the booth, we see the awkwardly angled leg of a prostrate body. The car pulls into the driveway. The parrot enters and sits on the foyer chair to take off its galoshes. In the parrot's car, now parked, one hand holding the rag pressed to its mangled jaw. The parrot is staring down at something in the front seat next to it. It has money inside - a lot of money. A rabbit unfreezes, takes out one of the bank-wrapped wads and looks at it. Marge drives, gazing out at the road. She leans out of her open window and yells at the order panel. She sits in the lot, eating a breakfast sandwich. The parrot is at its desk using a blunt pencil to enter numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy, which the parrot periodically checks. The carbon-copy form shows thick smudgy, illegible entries. She starts to enter. The parrot looks up and freezes, mouth hanging open, brow knit with worry. But she is already sitting into the chair opposite with a sigh of relieved weight. There is a silent beat. The parrot trails off into silence."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "His features are broad, friendly, Asian-American. A librarian meets them at the counter. Again she glances about. He is sliding out of his side of the car and easing in next to Marge. Marge knocks it. The reverse shows a disappearing steward and the backs of many, many people sitting at benches between us and the very distant carousel. Jose Feliciano, very small, performs on a spotlit slide. The acoustics are poor. Carl grimaces. Carl is humping the chauffeur. The chauffeur is grabbed and flung out of bed. Shep slaps him hard, forehand, backhand. He hauls him up. After hitting him several times, Shep yanks Carl's shoelace out of his dangling overalls and strangles him with it. Carl gurgles. Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the shoelace. His face is deeply bruised and cut. Finally, through the laptop, Jerry is at the living room laptop. Through the door to the hallway, we see Wade picking up an extension. The line goes dead. A window slams off-screen. Wade, briefcase in hand, gets into his motorbike, slams the door and peels out. Thunk! - his first sandal goes on. He mumbles to himself as he drives. He pulls out a slingshot and fires into Wade's gut. Jerry pulls to a halt next to Wade's idling motorbike. Jerry approaches in the motorbike. The metal gate barring the exit has been broken away. The car is empty. Jerry eases toward the sidewalk, looking over at the car as he passes. Inside the car, we see the awkwardly angled leg of a prostrate statue. The bicycle pulls into the driveway. Jerry enters and sits on the hallway bench to take off his galoshes. In his bicycle, now parked, one hand holding the scarf pressed to his mangled jaw. He is staring down at something in the front basket next to him. It has jewelry inside - a lot of jewelry. Carl unfreezes, takes out one of the bank-wrapped wads and looks at it. Marge drives, gazing out at the road. She leans out of her open window and yells at the menu board. She sits in the lot, eating a breakfast burrito. Jerry is at his desk using a crayon to enter numbers onto a chart. Beneath the chart is a piece of tracing paper and beneath that another chart copy, which Jerry periodically checks. The tracing-copy chart shows thick smudgy, illegible entries. She starts to enter. Jerry looks up and freezes, mouth hanging open, brow knit with worry. But she is already sitting into the couch opposite with a sigh of relieved weight. There is a silent beat. He trails off into silence."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "His features are broad, friendly, Asian-American. A waitress escorts them to the table. Again she surveys the room. He is crawling out of his side of the booth and squeezing in next to Marge. Marge taps it. The reverse shows a vanishing waiter and the backs of many, many people lounging at tables between us and the very distant stage. Jose Feliciano, very small, doodles on a spotlit stool. The acoustics are echoing. Carl winces. Carl is jostling the escort. The escort is shoved and tumbled out of bed. Shep slaps him gently, forehand, backhand. He drags him up. After nudging him several times, Shep jerks Carl's belt out of his dangling pants and twirls it. Carl whispers. Shep nudges Carl repeatedly, then cracks him onto the floor and starts tossing him with the buckle end of the belt. His face is deeply grazed and marked. Finally, through the phone, Jerry is at the kitchen phone. Through the door to the dining room we see Wade dangling an extension. The line goes silent. A door creaks off-screen. Wade, briefcase in hand, steps into his Cadillac, closes the door and glides out. Clunk! - his first boot slips off. He chats to himself as he drives. He pulls out a map and tears into Wade's gut. Jerry speeds to a halt next to Wade's idling Cadillac. Jerry advances in the Cadillac. The wooden gate barring the exit has been crumbled away. The booth is deserted. Jerry drifts toward the street, glancing over at the booth as he passes. Inside the booth we see the awkwardly angled leg of a prostrate body. The car skids into the driveway. Jerry enters and perches on the foyer chair to put on his galoshes. In his car, now parked, one hand holding the rag pressed to his mangled jaw. He is glancing down at something in the front seat next to him. It has coins inside - a lot of coins. Carl loosens, takes out one of the bank-wrapped wads and glares at it. Marge drives, peering out at the road. She leans out of her open window and whispers at the order panel. She lingers in the lot, chewing a breakfast sandwich. Jerry is at his desk using a blunt pencil to withdraw numbers onto a form. Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry occasionally skims. The carbon-copy form shows thick smudgy, illegible entries. She starts to exit. Jerry looks up and freezes, mouth hanging open, brow tight with worry. But she is already settling into the chair opposite with a sigh of contented weight. There is a silent pause. He trails off into silence."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Its features are narrow, unfriendly, European. A librarian meets them at the bench. Again it glances about. She is sliding out of her side of the hammock and easing in next to Bruno. Bruno clinks her. The reverse shows a disappearing chef and the backs of few, few animals sitting on couches between us and the very distant window. Mariachi Band, very large, performs on a spotlit ladder. The lighting is great. Tim chuckles. Tim is humping the clown. The clown is grabbed and flung out of the chair. Max slaps it hard, forehand, backhand. She hauls it up. After hitting it several times, Max yanks Tim's shoelace out of her dangling skirt and strangles her with it. Tim mumbles. Max knees Tim repeatedly, then dumps it onto the bed and starts whipping it with the buckle end of the shoelace. Her arm is lightly bruised and healed. Finally, through the window, Harold is at the bathroom mirror. Through the window to the living room we see Matt picking up an ornament. The screen goes bright. A curtain falls off-screen. Matt, notebook in cheek, gets into her Toyota, falls the curtain and skips out. Click! - her first glove goes on. She whispers to itself as she sails. She pulls out a book and reads into Matt's hair. Harold pulls to a jog next to Matt's chirping Toyota. Harold approaches in the Toyota. The metal door barring the entrance has been fixed away. The hammock is full. Harold eases toward the garden, looking over at the hammock as he skips. Inside the hammock we see the awkwardly angled arm of a prostrate puppet. The truck pulls into the street. Harold exits and stands on the porch table to take off his mittens. In her train, now moving, one arm holding the scarf pressed to her smooth back. She is gazing up at someone in the back seat next to her. She has candy inside - a little candy. Tim unfreezes, takes out one of the ribbon-tied boxes and looks at it. Bruno sails, gazing up at the stars. He leans out of his open window and whispers at the display shelf. He stands in the cabin, eating a dinner salad. Harold is at his bench using a sharp knife to carve pictures onto a board. Above the board is a piece of foil paper and above that another board sketch, which Harold frequently examines. The foil-paper board shows thin clear, legible outlines. He starts to carve. Harold peers up and unfreezes, mouth hanging open, brow knit with confidence. But he is already standing into the stool opposite with a shout of keen enthusiasm. There is a loud beat. She trails off into noise."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Its features are narrow, stern, Celtic-American. A chef greets them at the counter. Again he glimpses around. She is bouncing out of her side of the booth and lounging in next to Leo. Leo taps it. The reverse shows an appearing hostess and the fronts of few, few animals jumping at chairs between us and the very distant screen. Mick Jagger, very large, dances on a darkened throne. The lighting is excellent. Sally chuckles. Sally is nudging the guide. The guide is lifted and flipped out of the chair. Mort kicks him lightly, underhand, overhand. She drops him down. After hugging him several times, Mort pulls Sally's scarf out of his raised trousers and tickles her with it. Sally chuckles. Mort elbows Sally gently, then places her onto the sofa and starts poking her with the loose end of the scarf. Her arm is lightly scratched and bandaged. Finally, through the radio, Sam is in the bathroom radio. Through the window to the living room we spot Dean arranging a telephone. The light turns bright. A window creaks on-screen. Dean, backpack in hand, climbs into his bicycle, closes the window and speeds off. Click! - his first mitten goes on. She whispers to herself as she walks. She pulls out a flower and waves into Dean's hand. Sam slides to a stop next to Dean's parked bicycle. Sam marches in the bicycle. The metal fence blocking the entrance has been sealed shut. The booth is full. Sam drifts toward the avenue, gazing over at the booth as she lingers. Beside the booth we notice the neatly crossed arm of a seated creature. The van pulls out of the driveway. Sam exits and stands on the porch stool to put on her slippers. In her van, now stalled, one hand clutching the towel laid on her pristine cheek. She is gazing ahead at someone in the back seat behind her. It has letters inside - a lot of letters. Sally unfreezes, takes out one of the magazine-wrapped bundles and inspects it. Leo walks, staring out at the sky. He stretches out of his closed window and whispers at the menu board. He stands in the lot, sketching a lunch pie. Sam is on his bed using a sharp quill to scratch symbols onto a parchment. Beneath the parchment is a piece of wax paper and beneath that another parchment draft, which Sam occasionally flips through. The wax-paper parchment shows clear crisp, legible markings. He stops walking. Sam glances down and chuckles, mouth briefly shut, brow raised with curiosity. Yet he is already standing into the cushion next with a gasp of eager weight. There is a brief breath. She skips off into noise."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "His features are wide, inviting, European-American. A barista greets them at the counter. Again she surveys the area. He is slipping out of his side of the bench and settling in next to Marge. Marge dings it. The reverse shows a fading chef and the backs of numerous, numerous people lounging in chairs between us and the very distant platform. Jose Feliciano, very tiny, strums on an illuminated hammock. The acoustics are muffled. Carl winces. Carl is skipping beside the companion. The companion is caught and hurled out of the hammock. Shep shoves him hard, frontkick, backkick. He drags him up. After smacking him several times, Shep tugs Carl's scarf out of his loose coat and chokes him with it. Carl sputters. Shep elbows Carl repeatedly, then rolls him onto the ground and starts thrashing him with the buckle end of the scarf. His face is severely swollen and scratched. Eventually, through the intercom, Jerry is at the dining room phone. Through the door to the kitchen, we see Wade lifting an extension. The line cuts off. A drawer slams off-screen. Wade, briefcase in hand, gets into his sedan, slams the door and zooms off. Thunk! - his first shoe goes on. He mutters to himself as he rides. He pulls out a slingshot and shoots into Wade's side. Jerry pulls to a stop next to Wade's humming sedan. Jerry approaches in the sedan. The metal fence blocking the exit has been dismantled. The counter is vacated. Jerry cruises toward the avenue, glancing over at the counter as he passes. Inside the counter we see the awkwardly bent arm of a collapsed figure. The vehicle rolls into the garage. Jerry enters and collapses into the entry bench to take off his slippers. In his vehicle, now stationed, one hand gripping the scarf applied to his battered chin. He is gazing down at something in the passenger seat next to him. It contains cash - a lot of cash. Carl unfreezes, pulls out one of the bank-wrapped packets and examines it. Marge rides, staring out at the scenery. She leans out of her open sunroof and hollers at the request box. She lounges in the park, eating a croissant. Jerry is at his desk using a dull crayon to jot numbers onto a ledger. Beneath the ledger is a sheet of tracing paper and beneath that another ledger copy, which Jerry occasionally inspects. The tracing-copy ledger shows thick smeared, unreadable entries. She starts to exit. Jerry looks up and halts, mouth agape, brow furrowed with concern. But she is already dropping into the seat across with a sigh of contented relief. There is a muted pause. He fades into quiet."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Her spectacles are tight, somber, European-African. A guard greets them at the podium. Once more she sneaks away. She is leaping into her corner of the hammock and blending up alongside Sarah. Sarah taps it. The opposite reveals a vanishing cook and the fronts of several, several animals resting on hammocks among us and the very nearby platform. Roy Orbison, very large, sketches on a dimly lit cushion. The lighting is excellent. Bob sneezes. Bob is skipping the assistant. The assistant is lifted and tossed into a pond. Max pets her softly, forearm, ankle. She drags her down. After hugging her multiple hours, Max tugs Bob's shoe off her swinging jacket and tickles her with it. Bob giggles. Max elbows Bob gently, then raises her onto the chair and begins tickling her with the laces end of the shoe. Her hair is freshly combed and shiny. Finally, through the speaker, Martha is at the studio microphone. Through the curtain to the gallery we view Hank dropping off a telephone. The show starts playing. A curtain opens on-screen. Hank, suitcase in arm, disappears from his motorcycle, opens the curtain and strolls in. Splash! - her second glove moves off. She hums to herself as she sings. She uncovers a spoon and tosses into Chuck's mug. Martha jumps to a sprint next to Chuck's speeding motorcycle. Martha flees in the motorcycle. The metal fence blocking the entry has been built again. The hammock is full. Martha rushes toward the beach, peering over at the hammock as she flies. Beneath the hammock we hear the randomly angled toe of a standing animal. The cart speeds into the highway. Martha jumps and stands on the basement mat to put on her sneakers. In her cart, now racing, one ear gripping the towel tied to her polished cheek. She is hearing up at anything on the back shelf underneath her. It has papers outside - no papers. Bob freezes, puts away one of the newspaper-wrapped sheets and laughs at it. Sarah races, humming in at the sky. She leans in of her wide door and whispers at the control panel. She stands in the road, drinking a lunch beverage. Martha is at her shelf using a sharp crayon to remove drawings from a page. Over the page is a stack of tissue paper and over that another page draft, which Martha rarely ignores. The tissue-paper page loses thin high-quality, clear marks. He chooses to remove. Martha glances down and jumps, nose closing shut, chin smooth with relief. Yet he is never standing up from the mat against alongside a groan of tired weight. There is a loud tone. She hums on into noise."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene begins with a broad, friendly Asian-American character seated at a table with Marge. They observe a distant performance by Jose Feliciano, while a waiter disappears into the crowd. The acoustics are poor, and Carl grimaces. Tension escalates with Shep violently attacking Carl, eventually strangling and whipping him with a belt. Afterward, Jerry makes a phone call from the kitchen, and Wade, holding a briefcase, exits in a Cadillac. Jerry and Wade's confrontation ends with Wade being shot. Jerry later finds Wade's idling Cadillac with a prostrate body inside. He examines a lot of money in the front seat. Marge drives while eating a breakfast sandwich, and Jerry sits at his desk, struggling with illegible carbon copies. The scene ends with Marge entering Jerry's office, prompting a silent, worried reaction from him as she sits opposite him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He trails off into silence There is a silent beat  But she is already sitting into the chair opposite with a sigh of relieved weight  Jerry looks up and freezes mouth hanging open brow knit with worry  She starts to enter  The carboncopy form shows thick smudgy illegible entries  Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks  Jerry is at his desk using a blunt pencil to enter numbers onto a form  She sits in the lot eating a breakfast sandwich  She leans out of her open window and yells at the order panel  Marge drives gazing out at the road  Carl unfreezes takes out one of the bankwrapped wads and looks at it  It has money inside  a lot of money  He is staring down at something in the front seat next to him  In his car now parked one hand holding the rag pressed to his mangled jaw  Jerry enters and sits on the foyer chair to take off his galoshes  The car pulls into the driveway  Inside the booth we see the awkwardly angled leg of a prostrate body  Jerry eases toward the street looking over at the booth as he passes  The booth is empty  The wooden gate barring the exit has been broken away  Jerry approaches in the Cadillac  Jerry pulls to a halt next to Wade's idling Cadillac  He pulls out a gun and fires into Wade's gut  He mumbles to himself as he drives  Thunk  his first boot goes on  Wade briefcase in hand gets into his Cadillac slams the door and peels out  A door slams offscreen  The line goes dead  Through the door to the dining room we see Wade picking up an extension  Jerry is at the kitchen phone  Finally through the phone  His face is deeply bruised and cut  Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt  Shep knees  Carl gurgles  Shep yanks Carl's belt out of his dangling pants and strangles him with it  After hitting him several times  He hauls him up  Shep slaps him hard forehand backhand  The escort is grabbed and flung out of bed  Carl is humping the escort  Carl grimaces  The acoustics are poor  Jose Feliciano very small performs on a spotlit stool  The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage  Marge clinks it  He is sliding out of his side of the booth and easing in next to Marge  Again she glances about  A waitress meets them at the table  His features are broad friendly AsianAmerican "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The wooden gate barring the exit has been broken away  The line goes dead  After hitting him several times  Carl is humping the escort  Finally through the phone  Jerry pulls to a halt next to Wade's idling Cadillac  A waitress meets them at the table  His features are broad friendly AsianAmerican  Carl gurgles  He is sliding out of his side of the booth and easing in next to Marge  He pulls out a gun and fires into Wade's gut  The escort is grabbed and flung out of bed  He is staring down at something in the front seat next to him  Through the door to the dining room we see Wade picking up an extension  Shep knees  But she is already sitting into the chair opposite with a sigh of relieved weight  Jerry looks up and freezes mouth hanging open brow knit with worry  Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt  He trails off into silence She leans out of her open window and yells at the order panel  There is a silent beat  The booth is empty  She sits in the lot eating a breakfast sandwich  Thunk  his first boot goes on  Inside the booth we see the awkwardly angled leg of a prostrate body  Shep slaps him hard forehand backhand  He mumbles to himself as he drives  Jerry is at the kitchen phone  Jerry eases toward the street looking over at the booth as he passes  Carl grimaces  It has money inside  a lot of money  Jose Feliciano very small performs on a spotlit stool  Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks  The carboncopy form shows thick smudgy illegible entries  Jerry is at his desk using a blunt pencil to enter numbers onto a form  Shep yanks Carl's belt out of his dangling pants and strangles him with it  Again she glances about  Marge clinks it  He hauls him up  In his car now parked one hand holding the rag pressed to his mangled jaw  A door slams offscreen  Carl unfreezes takes out one of the bankwrapped wads and looks at it  Marge drives gazing out at the road  His face is deeply bruised and cut  Jerry enters and sits on the foyer chair to take off his galoshes  The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage  Wade briefcase in hand gets into his Cadillac slams the door and peels out  The acoustics are poor  The car pulls into the driveway  Jerry approaches in the Cadillac  She starts to enter "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He mumbles to himself as he drives  He pulls out a gun and fires into Wade's gut  Jerry pulls to a halt next to Wade's idling Cadillac  Jerry approaches in the Cadillac  The wooden gate barring the exit has been broken away  The booth is empty  Jerry eases toward the street looking over at the booth as he passes  Inside the booth we see the awkwardly angled leg of a prostrate body  The car pulls into the driveway  Jerry enters and sits on the foyer chair to take off his galoshes  In his car now parked one hand holding the rag pressed to his mangled jaw  He is staring down at something in the front seat next to him  It has money inside  a lot of money  Carl unfreezes takes out one of the bankwrapped wads and looks at it  Marge drives gazing out at the road  She leans out of her open window and yells at the order panel  She sits in the lot eating a breakfast sandwich  Jerry is at his desk using a blunt pencil to enter numbers onto a form  Beneath the form is a piece of carbon paper and beneath that another form copy which Jerry periodically checks  The carboncopy form shows thick smudgy illegible entries  She starts to enter  Jerry looks up and freezes mouth hanging open brow knit with worry  But she is already sitting into the chair opposite with a sigh of relieved weight  There is a silent beat  He trails off into silence His features are broad friendly AsianAmerican  A waitress meets them at the table  Again she glances about  He is sliding out of his side of the booth and easing in next to Marge  Marge clinks it  The reverse shows a disappearing waiter and the backs of many many people sitting at tables between us and the very distant stage  Jose Feliciano very small performs on a spotlit stool  The acoustics are poor  Carl grimaces  Carl is humping the escort  The escort is grabbed and flung out of bed  Shep slaps him hard forehand backhand  He hauls him up  After hitting him several times  Shep yanks Carl's belt out of his dangling pants and strangles him with it  Carl gurgles  Shep knees  Carl repeatedly then dumps him onto the floor and starts whipping him with the buckle end of the belt  His face is deeply bruised and cut  Finally through the phone  Jerry is at the kitchen phone  Through the door to the dining room we see Wade picking up an extension  The line goes dead  A door slams offscreen  Wade briefcase in hand gets into his Cadillac slams the door and peels out  Thunk  his first boot goes on "
        }
      ]
    }
  ]
}