{
  "ground_truth": "Holmes spots a bit of material, a piece of bloodstained wood, a dollop of mortar, and a stain. In his mind's eye, he sees mortar being churned and some spilt. A carpenter cuts his finger, spilling blood. Sacks are used as counterweights and a door handle is disguised as a coat peg. A mechanism turns. The workmen open a bottle of wine and some is spilled, staining the floor. Holmes eyes the coat pegs. He pulls on one of the coat pegs and a secret door opens. Watson draws a sword from a stick and cuts the rope holding the sandbag. The door swings shut behind them. Holmes lights a flaming brand. They look around the secret room and see a printing press and, on a table, sticks of dynamite. Holmes eyes a plaque reading, Imperata. Leading the way with his flaming torch, Holmes heads off down a dark corridor. They go up a flight of stone steps, push a metal grill open, and emerge on a dark street beneath a bridge. They climb up onto the bridge and look out towards the opera house. As they get close to the building, they push their way through crowds outside. Inside, the performance is underway. Sim, Holmes, and Watson enter the opera house through the stage door. As they make their way backstage, they don't notice Moriarty's agent lurking in the shadows. He gets up and, puffing on a dark cigarette, watches them go by before heading off in the opposite direction. Holmes, Watson, and Sim walk past stagehands in the wings. A couple of them try to stop them but they ignore the men's protests. Holmes spots a plaque, Imperata, and thinks back to the dynamite beside the one in the secret room. He imagines a bomb with a timing device beneath the stage. Holmes walks over to one of the stagehands and flings him out of the way. He gestures to Sim, who tosses him a knife. Holmes climbs under the stage and cuts a hole in a sheet of canvas. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing. Holmes is now inside the plinth. Onstage, the Commendatore points a finger at. Holmes peels away a backing cloth from the word Imperata. Inside the plinth, he finds a black chess piece concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box, watching the performance and possibly him, through a pair of opera glasses. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holmes detects a fragment of fabric, a section of bloodstained timber, a dollop of cement, and a blot. In his mind's eye, he perceives cement being churned and some spilled. A carpenter nicks his finger, leaking blood. Sacks are utilized as counterweights and a door handle is camouflaged as a coat peg. A contrivance rotates. The laborers uncork a bottle of wine and some is sloshed, blotting the pavement. Holmes observes the coat pegs. He tugs on one of the coat pegs and a covert door reveals. Watson draws a blade from a stick and severs the cord holding the sandbag. The door swings shut behind them. Holmes ignites a burning torch. They glance around the secret chamber and discern a printing press and, on a table, sticks of dynamite. Holmes notices a plaque stating, Imperata. Leading the route with his blazing torch, Holmes proceeds off down a murky corridor. They ascend a flight of stone steps, shove a metal grill open, and emerge on a shadowy street beneath a viaduct. They clamber up onto the viaduct and gaze out towards the opera house. As they approach the edifice, they forge their path through throngs outside. Inside, the performance is in progress. Sim, Holmes, and Watson enter the opera house through the stage door. As they make their path backstage, they don't perceive Moriarty's operative lurking in the shade. He rises and, puffing on a dark cigarette, observes them pass by before proceeding off in the reverse direction. Holmes, Watson, and Sim stroll past stagehands in the wings. A pair of them attempt to halt them but they disregard the men's objections. Holmes detects a plaque, Imperata, and reflects back to the dynamite beside the one in the secret chamber. He visualizes a bomb with a timing apparatus beneath the stage. Holmes strides over to one of the stagehands and hurls him out of the path. He signals to Sim, who throws him a blade. Holmes clambers under the stage and incises a gap in a sheet of canvas. He glances up and notices the word Imperata is part of the print on which the statue of Commendatore is standing. Holmes is presently inside the plinth. Onstage, the Commendatore gestures a finger at. Holmes strips away a backing cloth from the word Imperata. Inside the plinth, he uncovers a black chess piece concealed in the O. He lifts the chess piece and observes Moriarty seated in a box, observing the performance and possibly him, through a pair of opera glasses. Holmes rends his path out of the rear of the statue of the Commendatore and scurries across the stage to the wings where Sim and Watson are stationed beside a pair of performers in demon costumes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bit of material, a piece of bloodstained wood, a dollop of mortar, and a stain are spotted by Holmes. In his mind's eye, mortar is seen being churned and some is spilt. A carpenter's finger is cut by himself, spilling blood. They use sacks as counterweights and disguise a door handle as a coat peg. A mechanism is turned. A bottle of wine is opened by the workmen and some of it spills, staining the floor. The coat pegs are eyed by Holmes. One of the coat pegs is pulled on by him and a secret door is opened. A sword is drawn by Watson from a stick and he cuts the rope holding the sandbag. The door is shut behind them. A flaming brand is lit by Holmes. They look around the secret room and see a printing press and, on a table, sticks of dynamite. A plaque reading, Imperata, is eyed by Holmes. With his flaming torch, Holmes leads the way down a dark corridor. A flight of stone steps is gone up by them, a metal grill is pushed open, and a dark street beneath a bridge is where they emerge. Onto the bridge, they climb and look out towards the opera house. As the building is approached, they push their way through crowds outside. Inside, the performance is underway. Through the stage door, Sim, Holmes, and Watson enter the opera house. As backstage is made their way through, Moriarty's agent is not noticed lurking in the shadows. He gets up and, puffing on a dark cigarette, watches them go by before heading off in the opposite direction. Stagehands in the wings are walked past by Holmes, Watson, and Sim. A couple of them try to stop them but the men's protests are ignored. A plaque, Imperata, is spotted by Holmes and he thinks back to the dynamite beside it in the secret room. He imagines a bomb with a timing device beneath the stage. One of the stagehands is walked over to by Holmes and flung out of the way. Sim is gestured to by him, who tosses him a knife. Under the stage, Holmes climbs and a hole is cut in a sheet of canvas. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing. The plinth is now where Holmes is inside. Onstage, the Commendatore's finger points at him. The backing cloth from the word Imperata is peeled away by Holmes. Inside the plinth, he finds a black chess piece concealed in the O. The chess piece is picked up by him and Moriarty is seen sitting in a box, watching the performance and possibly him, through a pair of opera glasses. Out of the back of the statue of the Commendatore, Holmes rips his way and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holmes notices a piece of material, a bloodstained wood fragment, mortar, and a stain. He imagines mortar being mixed and spilled, a carpenter cutting a finger, and sacks as counterweights with a disguised door handle. A mechanism turns as workers spill wine, staining the floor. Holmes pulls a coat peg, revealing a secret door. Watson draws a sword and cuts the sandbag rope, closing the door. Holmes lights a torch, and they discover a printing press and dynamite in the secret room. They find a plaque titled Imperata and follow a dark corridor to a street beneath a bridge. They climb onto the bridge and approach the opera house. Entering through the stage door, they pass unnoticed by Moriarty's lurking agent. Stagehands try to stop them, but they continue. Holmes recalls the dynamite and plaque, imagining a bomb under the stage. He asks Sim for a knife, cuts through canvas under the stage, and discovers the word Imperata. Inside the plinth, he finds a black chess piece concealed in the letter O. Noticing Moriarty watching through opera glasses, Holmes breaks out of the statue and joins Watson and Sim beside actors in demon costumes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes identifies material, bloodstained wood, mortar, and a stain. He imagines mortar spilled and a carpenter cutting his finger. Sacks act as counterweights; a door handle resembles a coat peg. A mechanism turns, wine spills, staining the floor. Holmes pulls a coat peg, revealing a secret door. Watson unsheathes a sword to cut a sandbag's rope; the door shuts. Holmes lights a torch. They find a printing press and dynamite, with a plaque reading \"Imperata.\" Holmes leads them down a corridor, up steps, and through a metal grill to emerge on a dark street. They ascend a bridge, approach the opera house, and enter through the stage door. Moriarty's agent observes them unnoticed. They pass stagehands, ignoring protests. Holmes sees the plaque \"Imperata\" and recalls the dynamite. Imagining a bomb under the stage, he pushes a stagehand aside and receives a knife from Sim. Under the stage, Holmes cuts canvas, sees \"Imperata\" on a statue. Inside the plinth, he finds a black chess piece. Holmes sees Moriarty in the audience with opera glasses, then exits the statue and joins Sim and Watson by actors in demon costumes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holmes observes several seemingly ordinary items: a tiny piece of fabric, a small section of wood stained with blood, a bit of mortar, and a noticeable stain on the floor. In his mind's eye, he vividly envisions the scene: mortar being thoroughly mixed and inadvertently spilled. A carpenter, while working, accidentally injures his hand, causing blood to drip onto the material around him. He sees how sacks are ingeniously used as counterweights, while a door handle is cleverly disguised to look like an ordinary coat peg. Suddenly, a mechanism activates and turns. The diligent workmen, needing a break, open a bottle of wine, and in their revelry, some of the wine spills, leaving a stain on the floor. Holmes' sharp gaze fixes on the coat pegs. He decisively pulls one of them, and to his and Watson's astonishment, a secret door quietly swings open. Watson, ready for action, draws a sword cleverly concealed within a walking stick and skillfully slices through the rope holding a sandbag, causing the door to swing shut behind them. Holmes, without hesitation, ignites a flaring brand. As they survey the hidden room, they discover a printing press and, resting ominously on a table, several sticks of dynamite. Holmes notices a plaque with the word \"Imperata.\" Leading the way with his lighted torch, Holmes confidently strides down a darkened corridor. They ascend a flight of stone steps, push open a metal grill, and find themselves emerging onto a shadowy street beneath a bridge. Climbing up onto the bridge, they peer out towards the distant and imposing opera house. As they approach closer to the grand building, they push their way through the bustling crowds gathered outside. Inside, the performance is already in progress. Sim, Holmes, and Watson discreetly enter the opera house through the stage door. In their haste to get backstage, they remain oblivious to Moriarty's agent who lurks in the shadows. The agent rises, puffing thoughtfully on a dark cigarette, and watches them pass by before heading off in the opposite direction. Holmes, Watson, and Sim maneuver past stagehands busy in the wings. A couple of stagehands attempt to stop them, but Holmes and his companions dismiss the protests. Holmes' eyes catch sight of a plaque that reads \"Imperata,\" prompting him to recall the sticks of dynamite he had seen beside a similar plaque in the secret room. He imagines a bomb equipped with a timing mechanism placed stealthily beneath the stage itself. With urgency, Holmes approaches one of the stagehands and brusquely pushes him aside. He signals to Sim, who swiftly tosses him a knife. Holmes deftly climbs beneath the stage and cuts a hole in a sheet of canvas. Looking up, he realizes the word \"Imperata\" is part of the printed design on which the Commendatore statue stands. Holmes is now inside the hollow plinth. Onstage, the Commendatore appears to be pointing a finger. Holmes carefully peels away the backing cloth from the \"Imperata\" print. Inside the plinth, he discovers a black chess piece that had been hidden within the \"O.\" Picking up the chess piece, he notices Moriarty seated in a nearby box, observing the performance—and possibly Holmes himself—through a pair of opera glasses. Holmes tears his way out from behind the statue of the Commendatore and swiftly moves across the stage to the wings, where Sim and Watson are waiting alongside a couple of actors dressed in elaborate demon costumes."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holmes, with his keen and penetrating eyes, observes a collection of what might be considered seemingly ordinary items: a tiny, frayed piece of fabric, a small section of wood that is stained with crimson blood, a bit of dry mortar, and a noticeable dark stain adorning the floor. In his mind's eye, he vividly envisions the entire scene: mortar being thoroughly mixed and then inadvertently spilled across the floor. A diligent carpenter, hard at work, accidentally injures his hand, causing droplets of blood to fall onto the different materials around him. He envisions the ingenious use of sacks as clever counterweights, while a door handle is cunningly disguised to look exactly like an ordinary coat peg. Suddenly, a hidden mechanism activates and quietly turns. The diligent workmen, feeling the need for a brief respite, open a bottle of wine, and in their moments of revelry and relaxation, some of the wine spills, leaving a noticeable stain on the floor. Holmes' sharp, discerning gaze fixes with intensity on the coat pegs. He decisively pulls one of them, and to his and Watson's great astonishment, a secret door quietly and effortlessly swings open. Watson, ever ready for action, draws a cleverly concealed sword, hidden within a walking stick, and skillfully slices through the rope that holds a sandbag, causing the door to close snugly behind them. Holmes, without the slightest hesitation, ignites a flaring brand. As they carefully survey the hidden room, they discover a printing press and, resting ominously on a table, several sticks of dynamite. Holmes's attention is drawn to a plaque bearing the word \"Imperata.\" Leading the way with his lighted torch, Holmes confidently strides down a darkened and narrow corridor. They ascend a flight of cold stone steps, push open a heavy metal grill, and suddenly find themselves emerging onto a shadowy street beneath an imposing bridge. Climbing up onto the bridge, they peer out towards the distant and imposing opera house. As they eagerly approach closer to the grand building, they push their way through the bustling crowds gathered outside. Inside, the performance is already in full swing. Sim, Holmes, and Watson discreetly and quietly enter the opera house through the stage door. In their haste to get backstage, they remain completely oblivious to Moriarty's agent, who lurks with intent in the shadows. The agent watches them pass by before heading stealthily off in the opposite direction, all the while puffing thoughtfully on a dark cigarette. Holmes, Watson, and Sim maneuver past the stagehands, busy and preoccupied in the wings. A couple of stagehands make an attempt to stop them, but Holmes and his companions dismiss the protests effortlessly. Holmes' keen eyes catch sight of a plaque that reads \"Imperata,\" which prompts him to recall the sticks of dynamite he had seen beside a similar plaque in the secret room. He imagines a bomb, perhaps equipped with a cunning timing mechanism, placed stealthily beneath the stage itself. With great urgency, Holmes approaches one of the stagehands and, without ceremony, brusquely pushes him aside. He signals to Sim, who swiftly and accurately tosses him a knife. Holmes deftly climbs beneath the stage and cuts a precise hole in a sheet of canvas. Looking up, he realizes the word \"Imperata\" is an integral part of the printed design on which the impressive Commendatore statue stands. Holmes is now ensconced inside the hollow plinth. Onstage, the Commendatore statue appears to point an accusing finger. Holmes carefully peels away the backing cloth from the \"Imperata\" print. Inside the plinth, he discovers a black chess piece that had been concealed within the letter \"O.\" Picking up the chess piece, he notices Moriarty seated in a nearby box, observing the performance—and possibly Holmes himself—through a pair of opera glasses. Holmes tears his way out from behind the towering statue of the Commendatore and swiftly moves across the stage to the wings, where Sim and Watson are waiting alongside a couple of actors dressed in elaborate and dramatic demon costumes."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holmes keenly observes a small piece of material, a fragment of bloodstained wood, a dollop of mortar, and a stain on the floor. As he examines these clues, his mind races to reconstruct the scene: he envisions mortar being vigorously mixed, with some accidentally spilling onto the ground. He imagines a carpenter working nearby who, while cutting wood, inadvertently slices his finger, causing blood to drip onto the scene. Visualizing further, he sees sacks being repurposed to serve as counterweights, while a door handle cleverly doubles as a coat peg. He envisions a mechanism quietly turning in the background. Meanwhile, in a nearby room, workmen celebrate their progress with a bottle of wine, the bottle tipping slightly and some of its contents spilling onto the floor, leaving a noticeable stain. With this vivid mental picture, Holmes's gaze shifts to the coat pegs on the wall. With a calculated decision, he reaches out, grips one of the coat pegs firmly, and pulls it, triggering the opening of a hidden door. Watson, standing beside him, unsheathes a concealed sword from a walking stick, deftly cutting through the rope securing a heavy sandbag. As the weight is released, the door swings shut behind them with a soft thud. Holmes, unfazed, strikes a match and lights a makeshift torch, casting a flickering glow around the dimly lit secret room. Surveying their hidden surroundings, he and Watson notice a printing press and a table laden with ominous sticks of dynamite. Holmes's sharp eyes catch sight of a plaque inscribed with the word \"Imperata,\" igniting a spark of realization. With unwavering determination, he leads the way down a shadowy corridor, brandishing his flaming torch to light their path. They ascend a flight of worn stone steps, each footfall echoing in the confined space, until they reach a metal grill. Together, they push it open and step out onto a darkened street nestled beneath a bridge. Carefully climbing up onto the bridge, they pause momentarily to take in their surroundings, their gaze drifting towards the distant opera house. As they draw nearer to the building, they navigate through throngs of people gathered outside, the energy of anticipation palpable in the air. Unperturbed by the crowd, they make their way to the stage door of the opera house, slipping inside as the performance unfolds. Unbeknownst to them, Moriarty's agent lurks discreetly in the murky shadows, observing their every move through the haze of his dark cigarette. As Holmes, Watson, and Sim proceed through the backstage area, oblivious to the agent's presence, stagehands bustle about in the wings. Two of the stagehands make half-hearted attempts to stop them but are brushed aside as Holmes charges past, driven by purpose. His eyes alight on another plaque marked \"Imperata,\" evoking memories of the dynamite from the secret room, and he envisions a bomb intricately equipped with a timing device hidden beneath the stage. With urgency propelling him forward, Holmes strides over to one of the stagehands, pushing him aside with little resistance. He signals to Sim, who, understanding the unspoken request, tosses a knife with precision. Catching it deftly, Holmes ducks beneath the stage and slices a clean hole in a sheet of canvas, peering up to discern that the word \"Imperata\" forms part of the print on which the statue of the Commendatore stands. Infiltrating the statue's plinth, Holmes finds himself looking up at the figure of the Commendatore, which eerily points a finger outward. Methodically peeling away the backing cloth from the word \"Imperata,\" Holmes discovers a black chess piece cleverly concealed within the letter 'O.' He picks up the chess piece, his mind immediately connecting it to Moriarty, who sits conspicuously in a box seat, monitoring the entire performance—and possibly Holmes himself—through a pair of opera glasses. With a sense of urgency, Holmes rips his way out of the back of the statue, emerging onto the stage and dashing across its expanse to the wings, where Sim and Watson await him beside two actors clad in elaborate demon costumes."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holmes observes various items, visualizing the sequence of events: a carpenter cuts himself, staining wood with blood, and mortar is spilled during construction. These items, along with disguised mechanisms like a coat peg serving as a door handle, indicate a hidden passage. Holmes pulls a coat peg, revealing a secret door. Watson uses his sword-stick to cut a rope, releasing a sandbag that closes the door behind them. Holmes lights a torch, and they explore a secret room containing a printing press and dynamite, noting a plaque labeled Imperata. Leading with the torch, Holmes guides them through a corridor, ascending a stone staircase to a dark street under a bridge. They climb onto the bridge, moving toward the opera house. Navigating through crowds, they enter via the stage door during a performance. Unobserved by them, Moriarty's agent watches from the shadows and departs. Holmes, Watson, and Sim proceed backstage, ignoring stagehands’ protests. Holmes recalls the Imperata plaque and dynamite, envisioning a bomb under the stage. Confronting a stagehand, Holmes signals Sim for a knife, then cuts into a canvas under the stage. He discovers the word Imperata is part of a print on the Commendatore statue, revealing a concealed chess piece inside the plinth. Observing Moriarty through opera glasses from a box, Holmes emerges from the statue, crossing the stage rapidly to join Sim and Watson in the wings near actors in demon costumes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holmes spots a bit of material, a piece of bloodstained wood, likely an indication of a recent struggle, a dollop of mortar used in construction work, and a stain that suggests someone has been careless or hurried. In his mind's eye, he sees mortar being churned and some spilt, capturing the frenzied pace of the workers. A carpenter, using a well-worn saw, cuts his finger, spilling blood onto the floorboards. Sacks traditionally filled with sand or grain are used as counterweights, and a cleverly disguised door handle functions as a coat peg, a common trick in hidden passages. A mechanism, reminiscent of Victorian engineering, turns. The workmen open a vintage bottle of wine and some is spilled, staining the floor with its deep red hue. Holmes eyes the coat pegs, noticing their slightly irregular placement. He pulls on one of the coat pegs, revealing a secret door, a hallmark of his architectural expertise. Watson, always on alert, draws a sword from a stick, a practice weapon favored by old-world duelists, and cuts the rope holding the sandbag. The door swings shut behind them, echoing in the quiet space. Holmes lights a flaming brand, a crude but effective torch for illumination. They look around the secret room and see a printing press, a relic of the Industrial Revolution, and, on a table, sticks of dynamite, suggesting a plot of destruction. Holmes eyes a plaque reading, Imperata, which hints at a clandestine organization. Leading the way with his flaming torch, Holmes heads off down a dark corridor, a labyrinthine path typical of secret lairs. They go up a flight of stone steps, push a metal grill open, and emerge on a dark street beneath a bridge, a frequent location for clandestine exchanges. They climb up onto the bridge and look out towards the opera house, a grand building famous for its magnificent architecture. As they get close to the building, they push their way through crowds outside, eager patrons dressed in evening attire. Inside, the performance is underway, the acoustics of the opera house resonating with powerful voices. Sim, Holmes, and Watson enter the opera house through the stage door, a narrow entrance used by performers and crew. As they make their way backstage, they don't notice Moriarty's agent lurking in the shadows, a figure shrouded in mystery. He gets up and, puffing on a dark cigarette, likely a foreign blend, watches them go by before heading off in the opposite direction, moving with stealth. Holmes, Watson, and Sim walk past stagehands in the wings, who are busy with their tasks. A couple of them try to stop them but they ignore the men's protests, focused on their urgent mission. Holmes spots a plaque, Imperata, and thinks back to the dynamite beside the one in the secret room, sensing a connection. He imagines a bomb with a timing device beneath the stage, a scene reminiscent of espionage thrillers. Holmes walks over to one of the stagehands and flings him out of the way, urgency driving his actions. He gestures to Sim, who tosses him a knife, a utility tool of precision. Holmes climbs under the stage and cuts a hole in a sheet of canvas, a makeshift barrier. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore, a pivotal figure in the opera, is standing. Holmes is now inside the plinth, the base of the statue. Onstage, the Commendatore points a finger at, a dramatic gesture in the performance. Holmes peels away a backing cloth from the word Imperata, revealing a hidden compartment. Inside the plinth, he finds a black chess piece, symbolizing a strategic move, concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box, watching the performance and possibly him, through a pair of opera glasses, a tool of subtle observation. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes, outfits that add to the night's dramatic tension."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain. In his mind's eye he sees mortar being churned and some spilt. A carpenter cuts his finger spilling blood. Sacks are used as counterweights and a door handle is disguised as a coat peg. A mechanism turns. The workmen open a bottle of wine and some is spilled staining the floor. Holmes eyes the coat pegs. He pulls on one of the coat pegs and a secret door opens. Watson draws a sword from a stick and cuts the rope holding the sandbag. The door swings shut behind them. Holmes lights a flaming brand. They look around the secret room and see a printing press and on a table sticks of dynamite. Holmes eyes a plaque reading Imperata. Leading the way with his flaming torch. Holmes heads off down a dark corridor. They go up a flight of stone steps push a metal grill open and emerge on a dark street beneath a bridge. They climb up onto the bridge and look out towards the opera house. As they get close to the building they push their way through crowds outside. Inside the performance is underway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Sim. Holmes and Watson enter the opera house through the stage door. As they make their way backstage they do not notice Moriarty's agent lurking in the shadows. He gets up and puffing on a dark cigarette watches them go by before heading off in the opposite direction. Holmes. Watson and Sim walk past stagehands in the wings. A couple of them try to stop them but they ignore the men's protests. Holmes spots a plaque Imperata and thinks back to the dynamite beside the one in the secret room. He imagines a bomb with a timing device beneath the stage. Holmes walks over to one of the stagehands and flings him out of the way. He gestures to Sim who tosses him a knife. Holmes climbs under the stage and cuts a hole in a sheet of canvas. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing. Holmes is now inside the plinth. Onstage the Commendatore points a finger at. Holmes peels away a backing cloth from the word Imperata. Inside the plinth he finds a black chess piece concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain. In his mind's eye he sees mortar being churned and some spilt. A carpenter cuts his finger spilling blood. Sacks are used as counterweights and a door handle is disguised as a coat peg. A mechanism turns. The workmen open a bottle of wine and some is spilled staining the floor. Holmes eyes the coat pegs. He pulls on one of the coat pegs and a secret door opens. Watson draws a sword from a stick and cuts the rope holding the sandbag. The door swings shut behind them. Holmes lights a flaming brand. They look around the secret room and see a printing press and on a table sticks of dynamite. Holmes eyes a plaque reading Imperata. Leading the way with his flaming torch. Holmes heads off down a dark corridor. They go up a flight of stone steps push a metal grill open and emerge on a dark street beneath a bridge. They climb up onto the bridge and look out towards the opera house. As they get close to the building they push their way through crowds outside. Inside the performance is underway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Sim. Holmes and Watson enter the opera house through the stage door. As they make their way backstage they do not notice Moriarty's agent lurking in the shadows. He gets up and puffing on a dark cigarette watches them go by before heading off in the opposite direction. Holmes. Watson and Sim walk past stagehands in the wings. A couple of them try to stop them but they ignore the men's protests. Holmes spots a plaque Imperata and thinks back to the dynamite beside the one in the secret room. He imagines a bomb with a timing device beneath the stage. Holmes walks over to one of the stagehands and flings him out of the way. He gestures to Sim who tosses him a knife. Holmes climbs under the stage and cuts a hole in a sheet of canvas. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing. Holmes is now inside the plinth. Onstage the Commendatore points a finger at. Holmes peels away a backing cloth from the word Imperata. Inside the plinth he finds a black chess piece concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain. In his mind's eye he sees mortar being churned and some spilt. A carpenter cuts his finger spilling blood. Sacks are used as counterweights and a door handle is disguised as a coat peg. A mechanism turns. The workmen open a bottle of wine and some is spilled staining the floor. Holmes eyes the coat pegs. He pulls on one of the coat pegs and a secret door opens. Watson draws a sword from a stick and cuts the rope holding the sandbag. The door swings shut behind them. He gestures to Sim who tosses him a knife. Holmes climbs under the stage and cuts a hole in a sheet of canvas. He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing. Holmes is now inside the plinth. Onstage the Commendatore points a finger at. Holmes peels away a backing cloth from the word Imperata. Inside the plinth he finds a black chess piece concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain. In his mind's eye he sees mortar being churned and some spilt. A carpenter cuts his finger spilling blood. Sacks are used as counterweights and a door handle is disguised as a coat peg. Holmes peels away a backing cloth from the word Imperata. Inside the plinth he finds a black chess piece concealed in the O. He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses. Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The penguin notices a shred of paper, a fragment of candy-stained clay, a pinch of flour, and a mark. In its imagination, it visualizes flour being spun and some scattered. A chef slices his thumb, dripping honey. Blankets are used as bookends, and a fountain pen is disguised as an umbrella hook. A gadget spins. The bakers uncork a bottle of juice and some is sloshed, painting the ceiling. The penguin glances at the umbrella hooks. It tugs on one of the umbrella hooks and a secret cabinet swings open. Peabody withdraws an arrow from a cane and severs the string suspending the apple. The cabinet revolves shut behind them. The penguin ignites a glowing lantern. They peer around the hidden chamber and find a typewriter and, on a counter, strips of licorice. The penguin notices a plaque reading, Excelsior. Leading the way with its luminous lamp, the penguin waddles down a dim alleyway. They ascend a flight of wooden ladders, push a wooden hatch open, and appear on a deserted avenue beneath a tunnel. They scramble up onto the tunnel and gaze out towards the library. As they approach the structure, they shove their way through bustling market stalls outside. Inside, the concert is in progress. Gale, the penguin, and Peabody enter the library through the side entrance. As they navigate the backstage corridors, they fail to see Fibonacci’s operative skulking in the corners. He rises and, inhaling from a blue whistle, observes them pass before moving off in a different direction. The penguin, Peabody, and Gale stroll past technicians in the corridors. A pair of them attempt to block their path but they disregard the women’s objections. The penguin observes a plaque, Excelsior, and recalls the licorice beside the one in the hidden chamber. It envisions a device with an alarm system beneath the platform. The penguin strides over to one of the technicians and propels her out of the way. It signals to Gale, who hurls a wrench his way. The penguin crawls under the platform and slices an opening in a piece of burlap. It glances up and perceives the word Excelsior is part of the banner on which the sculpture of Aristotle is perched. The penguin is now within the podium. Onstage, the Aristotle waves a toe at. The penguin strips away a backing cloth from the word Excelsior. Inside the podium, it discovers a white puzzle cube hidden in the E. It grabs the puzzle cube and spots Fibonacci seated in a booth, observing the concert and potentially it, through a pair of binoculars. The penguin tears its way out of the back of the sculpture of Aristotle and scurries across the platform to the corridors where Gale and Peabody are standing next to a duo of performers in angel costumes."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holmes observes clues: bloodstained wood, mortar, and a stain. He visualizes a carpenter's mishap and a hidden mechanism at work. Pulling a disguised coat peg, Holmes opens a secret door. Watson uses a sword to cut a rope, sealing them inside. In the room, they find a printing press and dynamite labeled \"Imperata.\" Holmes leads them to a dark street beneath a bridge, heading to the opera house. Inside, Moriarty's agent secretly observes them. Holmes, Watson, and Sim navigate backstage. Ignoring stagehands, Holmes recalls the dynamite and predicts a bomb with a timer under the stage. He climbs under the stage, discovers the word \"Imperata\" on a plinth, and finds a black chess piece concealed in it. Holmes notices Moriarty watching from a box with opera glasses. Escaping the statue, Holmes reunites with Sim and Watson as they stand among actors dressed as demons."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses Inside the plinth he finds a black chess piece concealed in the O Holmes peels away a backing cloth from the word Imperata Onstage the Commendatore points a finger at Holmes is now inside the plinth He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing Holmes climbs under the stage and cuts a hole in a sheet of canvas He gestures to Sim who tosses him a knife Holmes walks over to one of the stagehands and flings him out of the way He imagines a bomb with a timing device beneath the stage Holmes spots a plaque Imperata and thinks back to the dynamite beside the one in the secret room A couple of them try to stop them but they ignore the men's protests Watson and Sim walk past stagehands in the wings Holmes He gets up and puffing on a dark cigarette watches them go by before heading off in the opposite direction As they make their way backstage they do not notice Moriarty's agent lurking in the shadows Holmes and Watson enter the opera house through the stage door Sim Inside the performance is underway As they get close to the building they push their way through crowds outside They climb up onto the bridge and look out towards the opera house They go up a flight of stone steps push a metal grill open and emerge on a dark street beneath a bridge Holmes heads off down a dark corridor Leading the way with his flaming torch Holmes eyes a plaque reading Imperata They look around the secret room and see a printing press and on a table sticks of dynamite Holmes lights a flaming brand The door swings shut behind them Watson draws a sword from a stick and cuts the rope holding the sandbag He pulls on one of the coat pegs and a secret door opens Holmes eyes the coat pegs The workmen open a bottle of wine and some is spilled staining the floor A mechanism turns Sacks are used as counterweights and a door handle is disguised as a coat peg A carpenter cuts his finger spilling blood In his mind's eye he sees mortar being churned and some spilt Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In his mind's eye he sees mortar being churned and some spilt Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain Sacks are used as counterweights and a door handle is disguised as a coat peg A carpenter cuts his finger spilling blood The workmen open a bottle of wine and some is spilled staining the floor A mechanism turns He pulls on one of the coat pegs and a secret door opens Holmes eyes the coat pegs The door swings shut behind them Watson draws a sword from a stick and cuts the rope holding the sandbag They look around the secret room and see a printing press and on a table sticks of dynamite Holmes lights a flaming brand Leading the way with his flaming torch Holmes eyes a plaque reading Imperata They go up a flight of stone steps push a metal grill open and emerge on a dark street beneath a bridge Holmes heads off down a dark corridor As they get close to the building they push their way through crowds outside They climb up onto the bridge and look out towards the opera house Sim Inside the performance is underway As they make their way backstage they do not notice Moriarty's agent lurking in the shadows Holmes and Watson enter the opera house through the stage door Holmes He gets up and puffing on a dark cigarette watches them go by before heading off in the opposite direction A couple of them try to stop them but they ignore the men's protests Watson and Sim walk past stagehands in the wings He imagines a bomb with a timing device beneath the stage Holmes spots a plaque Imperata and thinks back to the dynamite beside the one in the secret room He gestures to Sim who tosses him a knife Holmes walks over to one of the stagehands and flings him out of the way He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing Holmes climbs under the stage and cuts a hole in a sheet of canvas Onstage the Commendatore points a finger at Holmes is now inside the plinth Inside the plinth he finds a black chess piece concealed in the O Holmes peels away a backing cloth from the word Imperata Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sim Holmes and Watson enter the opera house through the stage door As they make their way backstage they do not notice Moriarty's agent lurking in the shadows He gets up and puffing on a dark cigarette watches them go by before heading off in the opposite direction Holmes Watson and Sim walk past stagehands in the wings A couple of them try to stop them but they ignore the men's protests Holmes spots a plaque Imperata and thinks back to the dynamite beside the one in the secret room He imagines a bomb with a timing device beneath the stage Holmes walks over to one of the stagehands and flings him out of the way He gestures to Sim who tosses him a knife Holmes climbs under the stage and cuts a hole in a sheet of canvas He looks up and sees the word Imperata is part of the print on which the statue of Commendatore is standing Holmes is now inside the plinth Onstage the Commendatore points a finger at Holmes peels away a backing cloth from the word Imperata Inside the plinth he finds a black chess piece concealed in the O He picks the chess piece up and sees Moriarty sitting in a box watching the performance and possibly him through a pair of opera glasses Holmes rips his way out of the back of the statue of the Commendatore and hurries across the stage to the wings where Sim and Watson are waiting beside a couple of actors in demon costumes Holmes spots a bit of material a piece of bloodstained wood a dollop of mortar and a stain In his mind's eye he sees mortar being churned and some spilt A carpenter cuts his finger spilling blood Sacks are used as counterweights and a door handle is disguised as a coat peg A mechanism turns The workmen open a bottle of wine and some is spilled staining the floor Holmes eyes the coat pegs He pulls on one of the coat pegs and a secret door opens Watson draws a sword from a stick and cuts the rope holding the sandbag The door swings shut behind them Holmes lights a flaming brand They look around the secret room and see a printing press and on a table sticks of dynamite Holmes eyes a plaque reading Imperata Leading the way with his flaming torch Holmes heads off down a dark corridor They go up a flight of stone steps push a metal grill open and emerge on a dark street beneath a bridge They climb up onto the bridge and look out towards the opera house As they get close to the building they push their way through crowds outside Inside the performance is underway"
        }
      ]
    }
  ]
}