{
  "ground_truth": "Holmes sees a stack of long-barreled pistols and is handed a magazine to load, but identical thugs come up behind him, one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose, causing his eyes to close as he sinks to the floor. Watson returns to the spot where he left Holmes and finds a note pinned to a crate, reading it and turning it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. Meanwhile, a small glass with liquid is held under Holmes' nose, and he stirs. Watson goes nearer to the tower as Moriarty turns to Holmes. A guard had apprehended Watson, but Moran shot the guard to get an aim on Watson. A meat hook is slammed into Holmes' shoulder, and he's hauled up on a rope. Moriarty lowers a stylus on a gramophone record, holding a telephone in front of the horn speaker, broadcasting the music over a speaker into the yard where Watson cowers in the darkness while Moran keeps a rifle trained from a walkway high up on the tower. Moriarty accompanies the singer, and Holmes, clutching the rope attached to the hook in his shoulder, is swinging about a meter off the floor. Moriarty pushes him, and Moran shoots at Watson, but the bullet ricochets off a metal pole. Moriarty spins Holmes around, and Watson breaks cover as Moran shoots, causing Watson to duck behind a platform. Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform. Holmes spins in the air while Moran takes aim, his shot passing through a narrow gap between pieces of machinery, just missing Watson. Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery, and Moran puts a bullet straight through it. Watson looks around and sees a pair of ear defenders hanging on the wall. Moriarty rolls his eyes wearily and bends over Holmes, gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of machinery, and a cover falls off it, revealing an artillery cannon. Moran retreats, desperately climbing down the tower to escape from the cannon Watson is operating. Watson fires the cannon at the tower, which collapses, smashing through the roof of the building where Holmes and Moriarty are. As the dust settles, Watson sits up on the platform wearing the ear defenders, climbs down from the platform, and runs over to the now ruined building, searching through the debris and finding Holmes half-buried under the rubble.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holmes observes a pile of long-barreled revolvers and is given a periodical to load, but identical ruffians approach from behind him, one seizing the firearm and the other holding a piece of fabric over Holmes' mouth and nose, causing his eyes to shut as he descends to the floor. Watson returns to the location where he left Holmes and discovers a message attached to a crate, reading it and turning it over to see Rene's sketch of a tall spire. He glances up at an illuminated spire nearby and proceeds. Meanwhile, a small glass with liquid is held under Holmes' nose, and he stirs. Watson advances nearer to the spire as Moriarty turns to Holmes. A sentry had detained Watson, but Moran shot the sentry to get an aim on Watson. A meat hook is slammed into Holmes' shoulder, and he's hauled up on a rope. Moriarty lowers a stylus onto a gramophone record, holding a telephone in front of the horn speaker, transmitting the music over a speaker into the yard where Watson cowers in the darkness while Moran keeps a rifle aimed from a walkway high up on the spire. Moriarty accompanies the vocalist, and Holmes, clutching the rope attached to the hook in his shoulder, is swinging about a meter off the floor. Moriarty pushes him, and Moran fires at Watson, but the bullet deflects off a metal pole. Moriarty spins Holmes around, and Watson breaks cover as Moran fires, causing Watson to duck behind a platform. Holmes' cries are audible over the tenor as Watson climbs a ladder on the platform. Holmes spins in the air while Moran takes aim, his shot passing through a narrow gap between pieces of equipment, just missing Watson. Moriarty signals to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the equipment, and Moran puts a bullet straight through it. Watson looks around and sees a pair of ear protectors hanging on the wall. Moriarty rolls his eyes wearily and bends over Holmes, gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of equipment, and a cover falls off it, revealing an artillery cannon. Moran retreats, frantically climbing down the spire to escape from the cannon Watson is operating. Watson fires the cannon at the spire, which collapses, smashing through the roof of the structure where Holmes and Moriarty are. As the dust settles, Watson sits up on the platform wearing the ear protectors, climbs down from the platform, and runs over to the now ruined structure, searching through the wreckage and finding Holmes half-buried under the rubble."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A stack of long-barreled pistols is seen by Holmes, and a magazine is handed to him to load, but he is approached by identical thugs from behind, with one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose, causing his eyes to close as he sinks to the floor. The spot where Holmes was left is returned to by Watson, who finds a note pinned to a crate, reads it, and turns it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. Meanwhile, someone holds a small glass with liquid under Holmes' nose, and he stirs. As Watson goes nearer to the tower, Moriarty turns to Holmes. Watson had been apprehended by a guard, but Moran shot the guard to get an aim on Watson. A meat hook is slammed into Holmes' shoulder, and he's hauled up on a rope. A stylus is lowered by Moriarty on a gramophone record, and a telephone is held by him in front of the horn speaker, broadcasting the music over a speaker into the yard where Watson cowers in the darkness while a rifle is trained by Moran from a walkway high up on the tower. Moriarty accompanies the singer, and Holmes, clutching the rope attached to the hook in his shoulder, is swinging about a meter off the floor. He is pushed by Moriarty, and Moran shoots at Watson, but a metal pole causes the bullet to ricochet. Holmes is spun around by Moriarty, and Watson breaks cover as a shot is fired by Moran, causing Watson to duck behind a platform. Holmes' screams are audible over the tenor as a ladder is climbed by Watson on the platform. While Holmes spins in the air, Moran takes aim, and his shot passes through a narrow gap between pieces of machinery, just missing Watson. Moran is indicated by Moriarty to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery, and a bullet is put straight through it by Moran. A pair of ear defenders is seen by Watson hanging on the wall. Moriarty wearily rolls his eyes and bends over Holmes, gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of machinery, and a cover falls off it, revealing an artillery cannon. Moran retreats, desperately climbing down the tower to escape from the cannon Watson operates. The cannon is fired by Watson at the tower, which collapses, smashing through the roof of the building where Holmes and Moriarty are. As the dust settles, Watson sits up on the platform wearing the ear defenders, climbs down from the platform, and runs over to the now ruined building, searching through the debris and finding Holmes half-buried under the rubble."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holmes sees a stack of pistols and is given a magazine to load. Thugs approach, taking the gun and covering his mouth with a cloth, causing him to collapse. Watson returns to find a note on a crate, with Rene's sketch of a tall tower. He looks up at a nearby lit tower and heads toward it. A glass with liquid revives Holmes, and Watson approaches the tower as Moriarty confronts Holmes. A guard catches Watson, but Moran shoots the guard to target Watson. Holmes is hoisted via a meat hook in his shoulder, swinging off the floor. Moriarty plays music over a gramophone, sending it through a speaker to Watson, while Moran keeps a rifle trained on him. Moran fires at Watson, but the bullet ricochets. Watson hides behind a platform, climbs a ladder, and Holmes spins in the air. Moran's shot narrowly misses Watson. Moriarty signals to lower Holmes as Watson uses his hat to draw fire, and Moran shoots through it. Watson spots ear defenders nearby. Moriarty bends over Holmes, holding the hook in his shoulder and his uninjured arm. Moran sees an artillery cannon, retreats, and descends the tower to escape. Watson operates the cannon, bringing the tower down onto the building where Holmes and Moriarty are. As dust settles, Watson, wearing ear defenders, climbs down, runs to the wreckage, and finds Holmes partly buried."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes finds long-barreled pistols and loads one, but thugs grab it, covering his mouth with a cloth, causing him to faint. Watson returns, finds a note and Rene's sketch of a tower, and spots a nearby lit one. A liquid revives Holmes as Watson approaches the tower. Moriarty confronts Holmes. A guard seizes Watson, but Moran shoots the guard to target him. A hook pierces Holmes' shoulder, lifting him on a rope. Moriarty plays music loudly through a speaker; Watson hides from Moran's rifle. Moriarty and the singer perform. Holmes swings from the rope as Watson dodges Moran's shots. Moran nearly hits Watson, who uses a ladder for cover. Moriarty signals to lower Holmes; Watson uses a hat for protection but loses it to Moran's bullet. Discovering ear defenders, Watson operates a cannon revealed by a fallen cover. Moran flees the collapsing tower as Watson fires, destroying it. Watson finds Holmes buried under the rubble."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holmes discovers a stacked collection of long-barreled pistols and is promptly handed a magazine to load. However, identical-looking thugs silently approach him from behind. One of them seizes the gun from Holmes, while the other presses a piece of cloth firmly over Holmes' mouth and nose. This action causes Holmes' eyes to involuntarily close as he gradually collapses to the floor, unconscious. Meanwhile, Watson returns to the exact spot where he had left Holmes, only to find a note pinned to a nearby crate. Upon reading it, he flips the note over to reveal Rene's drawing, which depicts a tall tower. Glancing upwards, he notices a tower illuminated nearby and decides to head in that direction. In the meantime, a small glass containing liquid is held under Holmes' nose, causing him to stir and regain consciousness. As Watson cautiously approaches the tower, Moriarty turns his attention toward Holmes. Although one guard had previously apprehended Watson, Moran intervenes by shooting the guard, clearing his line of sight to target Watson. Suddenly, a meat hook is brutally slammed into Holmes' shoulder, and he is hoisted into the air via a rope system. Moriarty lowers a stylus onto a gramophone record, using a telephone positioned in front of the horn speaker to broadcast the music loudly over a speaker into the yard below, where Watson cowers in the overwhelming darkness. Meanwhile, Moran maintains a vigilant watch, his rifle trained on the scene from a walkway high above on the tower. Moriarty accompanies the singer vocally, while Holmes clutches the rope that is painfully attached to the hook embedded in his shoulder, causing him to swing precariously about a meter off the ground. Moriarty gives Holmes a push, prompting Moran to fire a shot at Watson, but the bullet ricochets harmlessly off a nearby metal pole. Moriarty spins Holmes around aggressively, while Watson breaks cover as Moran takes another shot, forcing Watson to quickly duck behind a platform for protection. Holmes' cries of pain echo over the tenor's voice as Watson climbs a ladder attached to the platform. As Holmes swings through the air, Moran carefully takes aim, but his shot narrowly passes through a small gap between pieces of machinery, barely missing Watson. Moriarty signals to a henchman to lower Holmes back to the ground. Meanwhile, Watson cleverly holds his hat up to the gap in the machinery, prompting Moran to fire a bullet that pierces straight through it. Watson then looks around, spotting a pair of ear defenders hanging conveniently on the wall. Moriarty rolls his eyes in weary frustration before bending over Holmes, gripping the meat hook embedded in Holmes' shoulder with one hand while holding Holmes' uninjured arm with the other. Moran keeps a vigilant eye on the piece of machinery, and when its cover falls off, it reveals a concealed artillery cannon. Realizing the imminent danger, Moran retreats hastily, scrambling down the tower in a desperate attempt to escape from the cannon that Watson is now operating. Watson fires the cannon at the tower, resulting in its catastrophic collapse as it crashes through the roof of the structure where Holmes and Moriarty are situated. As the dust finally settles, Watson rises from the platform, wearing the protective ear defenders, and hurriedly climbs down, sprinting toward the now-destroyed building. He frantically searches through the debris until he finds Holmes, who is half-buried under the rubble."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holmes makes a discovery of a stacked and organized collection of long-barreled pistols and is immediately handed a magazine to load into one of the weapons. However, without making a sound, a pair of identical-looking thugs stealthily approaches him from behind. In one swift motion, one of the thugs seizes the gun directly from Holmes' grasp, while the other thug presses a piece of cloth firmly over Holmes' mouth and nose, suffocating him. This forceful action causes Holmes' eyes to involuntarily close as he gradually collapses to the floor, rendered unconscious. Meanwhile, Watson returns to the exact location where he had previously left Holmes, only to be confronted by a note that is conspicuously pinned to a nearby crate. Upon reading it, he thoughtfully flips the note over, revealing Rene's drawing, which depicts a tall tower standing prominently. Glancing upwards, he notices a nearby tower illuminated in the distance and makes the decision to head in that direction. In the intervening time, a small glass containing a liquid substance is held under Holmes' nose, which causes him to stir and slowly regain consciousness. As Watson cautiously approaches the towering structure, Moriarty shifts his attention toward Holmes. Although a guard had previously managed to apprehend Watson, Moran intervenes by shooting the guard, thus clearing his line of sight and allowing him to target Watson without obstruction. Abruptly, a meat hook is brutally slammed into Holmes' shoulder, and he is hoisted into the air through a rope system that suspends him above the ground. Moriarty then methodically lowers a stylus onto a gramophone record, employing a telephone positioned directly in front of the horn speaker to broadcast the music loudly over a speaker system into the expansive yard below, where Watson crouches, overwhelmed by the enveloping darkness. Meanwhile, Moran maintains his vigilant watch, his rifle trained on the unfolding scene from a high walkway above on the tower. Moriarty accompanies the singer vocally, while Holmes, in agonizing pain, clutches the rope attached to the unbearably painful hook embedded in his shoulder, causing him to swing precariously about one meter off the ground. Moriarty gives Holmes a forceful push, prompting Moran to take a shot at Watson, but the bullet ricochets harmlessly off a nearby metal pole. Moriarty spins Holmes around aggressively, causing Watson to break cover, as Moran fires another shot, compelling Watson to quickly duck behind a platform for protection. Holmes' cries of anguish echo over the tenor's voice as Watson climbs a ladder that is attached to the platform. As Holmes continues to swing through the air, Moran carefully takes aim, but his shot narrowly passes through a small gap between pieces of machinery, barely missing Watson. Moriarty signals to one of his henchmen, instructing him to lower Holmes back down to the ground. Meanwhile, Watson cleverly holds his hat up to the gap in the machinery, prompting Moran to fire a bullet that pierces straight through it. Watson then looks around the area, spotting a pair of ear defenders hanging conveniently on the wall. Moriarty rolls his eyes in weary frustration before bending over Holmes, firmly gripping the meat hook embedded in Holmes' shoulder with one hand, while holding Holmes' uninjured arm with the other. Moran maintains his vigilant eye on the piece of machinery, and when its cover falls off, it reveals a concealed artillery cannon hidden within. Realizing the imminent danger, Moran retreats hastily, scrambling down the tower in a desperate attempt to escape from the cannon that Watson is now skillfully operating. Watson fires the cannon at the tower, resulting in its catastrophic collapse as it crashes through the roof of the structure where Holmes and Moriarty are situated. As the dust finally settles, Watson rises from the elevated platform, wearing the protective ear defenders, and hurriedly climbs down, sprinting toward the now-destroyed building. He frantically searches through the debris until he finally finds Holmes, who is partially buried under the extensive rubble."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holmes, standing in a dimly lit room, spots a conspicuous stack of long-barreled pistols arranged neatly before him. As he reaches out in curiosity, an individual hands him a magazine with the intent for him to load it. Holmes begins to scrutinize the magazine, but suddenly, identical thugs silently approach him from behind, their footsteps inaudible. One of them swiftly seizes the gun from his grasp, while the other stealthily moves to cover Holmes' mouth and nose with a piece of cloth. The chemical fumes from the cloth begin to invade his senses, overcoming him as his eyelids feel impossibly heavy. Inevitably, his eyes close, and he sinks slowly and helplessly to the floor, consciousness slipping away. Meanwhile, Watson retraces his steps back to the location where he last left Holmes, hoping to reunite with his companion. As he arrives, his eyes catch sight of a peculiar note pinned to a crate. Taking a moment, he carefully reads the note before thoughtfully turning it over, revealing Rene's sketch of a tall tower. This prompts Watson to instinctively glance upwards, his gaze settling on a nearby lit tower, a potential lead, sparking his movement as he sets off purposefully toward it. In the meantime, Holmes begins to stir faintly as a small glass filled with some liquid is held delicately under his nose, the vapors coaxing him back to the edge of awareness. While Watson cautiously approaches the tall tower, Moriarty, with an air of purpose, directs his attention towards Holmes. A guard, in an earlier attempt to intercept Watson, had apprehended him, but the guard was abruptly incapacitated when Moran intervened, skillfully shooting the guard to clear his aim on Watson. Concurrently, a meat hook, in a brutal gesture of restraint, is forcefully embedded into Holmes' shoulder, and he is inexorably hauled up into the air by a taut rope. Moriarty, exuding confidence, methodically lowers a stylus onto a gramophone record, maintaining a firm grip on a telephone positioned in front of the horn speaker. This action broadcasts the haunting strains of music over a speaker into the yard, where Watson, enveloped in darkness, cowers cautiously. Moran, relentlessly focused, keeps his rifle unwaveringly trained from a vantage point high up on the tower walkway. As the music fills the air, Moriarty, manifesting his cunning, accompanies the singer melodiously. Meanwhile, Holmes clutches desperately at the rope attached to the hook lodged painfully in his shoulder, his body swinging precariously about a meter off the floor. Moriarty, with a slight push, sends him oscillating as Moran takes a calculated shot at Watson, the bullet ricocheting harmlessly off a nearby metal pole. Moriarty, enjoying the chaos, spins Holmes around again just as Watson seizes the opportunity to break cover. Moran, quick to react, fires another shot, compelling Watson to adeptly duck behind the safety of a platform. Holmes' cries pierce the air, mingling with the tenor's voice, while Watson, driven by urgency, climbs a ladder on the platform in search of an advantage. Holmes, caught in a dizzying spin in mid-air, can barely focus as Moran expertly recalibrates his aim, his bullet narrowly missing Watson as it sails through a slender gap between pieces of machinery. Moriarty, nonchalant, signals to a nearby henchman to steadily lower Holmes back to the ground. Observing the situation, Watson notices a pair of ear defenders conveniently hanging on the wall and seizes them in a calculated move. Moriarty, exasperated, rolls his eyes in weariness and bends over Holmes, gripping the protruding meat hook with one hand while anchoring Holmes' uninjured arm with the other. Unbeknownst to them, Moran remains vigilant, his gaze fixated on a piece of machinery, until a cover abruptly dislodges from it, unveiling an artillery cannon hidden within. Moran, recognizing the dire threat, retreats hastily, scrambling to climb down the tower in a desperate bid to evade the impending danger posed by the cannon now operated by Watson. Exercising precise control, Watson fires the cannon, directing its formidable force at the tower, causing it to collapse spectacularly, the debris crashing forcefully through the roof of the building where Holmes and Moriarty are situated. As the dust settles and silence ensues, Watson, protected by the ear defenders, sits up on the platform, assesses the situation for a brief moment, then promptly climbs down. He sprints determinedly toward the now ruined building, methodically sifting through the debris until he locates Holmes, partially buried but alive under the rubble, ensuring his survival."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holmes notices a stack of pistols and is handed a magazine to load, but is quickly subdued by identical thugs, sinking to the floor unconscious. Meanwhile, Watson returns and finds a note with Rene's sketch of a tower, prompting him to head toward a nearby lit tower. Holmes is revived with smelling salts as Moriarty turns his attention to him. A guard near Watson is targeted by Moran, who intervenes by shooting the guard to get a clear aim on Watson. Moriarty incorporates a gramophone to provide an ominous soundtrack while Holmes, impaled by a meat hook in his shoulder, swings from a rope. As Moran takes aim at Watson, a bullet narrowly misses him, prompting Watson to take cover and climb a ladder. While Holmes is spun around, Moriarty signals for Holmes to be lowered as Watson cleverly distracts Moran by exposing his hat, causing Moran to shoot through it. Watson notices ear defenders, puts them on, and then commandeers an artillery cannon, firing at the tower. The collapsing tower smashes through the roof of the building housing Holmes and Moriarty. As debris settles, Watson descends from his vantage point, rushes to the wreckage, and finds Holmes partially buried under the rubble."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holmes, renowned for his keen observation skills and analytical mind, sees a stack of long-barreled pistols historically favored for their accuracy and is handed a magazine to load. Suddenly, identical thugs, reminiscent of the notorious criminals from London's underworld, come up behind him, one grabbing the gun and the other holding a piece of cloth soaked in chloroform, a common anesthetic from the 19th century, over Holmes' mouth and nose, causing his eyes to close as he sinks to the floor. Watson, the loyal friend and former army doctor, returns to the spot where he left Holmes and finds a note pinned to a crate, reading it and turning it over to see Rene's sketch of the Eiffel Tower, an iconic symbol of Paris. He glances up at a lit tower nearby, perhaps inspired by the architecture of Gustave Eiffel, and moves off. Meanwhile, a small glass containing smelling salts is held under Holmes' nose, and he stirs. Watson goes nearer to the tower as Moriarty, the criminal mastermind whom Holmes often matches wits with, turns to Holmes. A guard had apprehended Watson, but Colonel Sebastian Moran, Moriarty's right-hand man and a crack shot, shot the guard to get an aim on Watson. A meat hook is slammed into Holmes' shoulder, reminiscent of brutal interrogation techniques, and he's hauled up on a rope. Moriarty lowers a stylus on a gramophone record, an invention by Emile Berliner that revolutionized music playback, holding a telephone in front of the horn speaker, broadcasting the music over a speaker into the yard where Watson cowers in the darkness while Moran keeps a sniper's rifle trained from a walkway high up on the tower. Moriarty accompanies the singer, a nod to his cultured yet sinister nature, and Holmes, clutching the rope attached to the hook in his shoulder, is swinging about a meter off the floor. Moriarty pushes him, and Moran shoots at Watson, but the bullet ricochets off a metal pole, a common hazard in quickly arranged crossfires. Moriarty spins Holmes around, and Watson breaks cover as Moran shoots, causing Watson to duck behind a platform. Holmes' screams are audible over the tenor as Watson, driven by desperation, climbs a ladder on the platform. Holmes spins in the air while Moran, with the precision of a sharpshooter, takes aim, his shot passing through a narrow gap between pieces of machinery, just missing Watson. Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery, and Moran puts a bullet straight through it, showcasing his deadly accuracy. Watson looks around and sees a pair of ear defenders, essential for protecting against the deafening sound of artillery, hanging on the wall. Moriarty, exasperated by the turn of events, rolls his eyes wearily and bends over Holmes, gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of machinery, and a cover falls off it, revealing an artillery cannon, a formidable weapon of warfare. Moran retreats, desperately climbing down the tower to escape from the cannon Watson is operating. Watson fires the cannon at the tower, which collapses like a house of cards, smashing through the roof of the building where Holmes and Moriarty are. As the dust settles, Watson sits up on the platform wearing the ear defenders, climbs down from the platform, and runs over to the now ruined building, searching through the debris and finding Holmes half-buried under the rubble, a testament to their enduring partnership."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor. Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. Meanwhile a small glass with liquid is held under Holmes' nose and he stirs. Watson goes nearer to the tower as Moriarty turns to Holmes. A guard had apprehended Watson but Moran shot the guard to get an aim on Watson. A meat hook is slammed into Holmes' shoulder and he is hauled up on a rope. Moriarty lowers a stylus on a gramophone record holding a telephone in front of the horn. speaker broadcasting the music over a speaker into the yard where Watson cowers in the darkness. while Moran keeps a rifle trained from a walkway high up on the tower. Moriarty accompanies the singer and Holmes clutching the rope attached to the hook in his shoulder is swinging about a meter off the floor. Moriarty pushes him and Moran shoots at Watson but the bullet ricochets off a metal pole. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Moriarty spins Holmes around and Watson breaks cover as Moran shoots causing Watson to duck behind a platform. Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform. Holmes spins in the air while Moran takes aim his shot passing through a narrow gap between pieces of machinery just missing Watson. Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery and Moran puts a bullet straight through it. Watson looks around and sees a pair of ear defenders hanging on the wall. Moriarty rolls his eyes wearily and bends over Holmes gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon. Moran retreats desperately climbing down the tower to escape from the cannon. Watson is operating. Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are. As the dust settles Watson sits up on the platform. wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor. Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. Meanwhile a small glass with liquid is held under Holmes' nose and he stirs. Watson goes nearer to the tower as Moriarty turns to Holmes. A guard had apprehended Watson but Moran shot the guard to get an aim on Watson. A meat hook is slammed into Holmes' shoulder and he is hauled up on a rope. Moriarty lowers a stylus on a gramophone record holding a telephone in front of the horn. speaker broadcasting the music over a speaker into the yard where Watson cowers in the darkness. while Moran keeps a rifle trained from a walkway high up on the tower. Moriarty accompanies the singer and Holmes clutching the rope attached to the hook in his shoulder is swinging about a meter off the floor. Moriarty pushes him and Moran shoots at Watson but the bullet ricochets off a metal pole. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Moriarty spins Holmes around and Watson breaks cover as Moran shoots causing Watson to duck behind a platform. Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform. Holmes spins in the air while Moran takes aim his shot passing through a narrow gap between pieces of machinery just missing Watson. Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery and Moran puts a bullet straight through it. Watson looks around and sees a pair of ear defenders hanging on the wall. Moriarty rolls his eyes wearily and bends over Holmes gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other. Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon. Moran retreats desperately climbing down the tower to escape from the cannon. Watson is operating. Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are. As the dust settles Watson sits up on the platform. wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor. Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. Meanwhile a small glass with liquid is held under Holmes' nose and he stirs. Watson goes nearer to the tower as Moriarty turns to Holmes. A guard had apprehended Watson but Moran shot the guard to get an aim on Watson. Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon. Moran retreats desperately climbing down the tower to escape from the cannon. Watson is operating. Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are. As the dust settles Watson sits up on the platform. wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor. Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower. He glances up at a lit tower nearby and moves off. As the dust settles Watson sits up on the platform. wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Maggie observes a pile of short-handled shovels and is given a map to fold, but twin gardeners approach her, one taking the shovel and the other pressing a piece of bread against Maggie's cheek and ear, causing her face to brighten as she rises to the ceiling. Kelly reappears at the location where she left Maggie and discovers a postcard tacked to a bookshelf, perusing it and flipping it over to see Oliver's doodle of a giant mushroom. She looks up at a dim lantern nearby and hurries away. Meanwhile, a large bucket with sand is waved over Maggie's ear, and she yawns. Kelly strolls closer to the lantern as Trevor turns to Maggie. A sailor had detained Kelly, but Parker hurled the sailor to get a laugh from Kelly. A flower pot is dropped onto Maggie's knee, and she's lifted up on a ladder. Trevor raises a pencil on a typewriter sheet, brandishing a flashlight in front of the book lamp, projecting the words over a screen onto the courtyard where Kelly hides in the shadows while Parker keeps a slingshot aimed from a bridge high up on the lantern. Trevor harmonizes with the musician, and Maggie, gripping the ladder tied to the pot on her knee, is floating about a foot off the ceiling. Trevor shakes her, and Parker throws at Kelly, but the rock bounces off a wooden crate. Trevor twirls Maggie around, and Kelly jumps in the open as Parker throws, causing Kelly to roll behind a shelf. Maggie's shouts are distinct over the soprano as Kelly scales a stairway on the shelf. Maggie twirls in the sky while Parker locks on target, his throw soaring through a tiny crack between pieces of furniture, narrowly missing Kelly. Trevor signals to a sidekick to raise Maggie to the ceiling as Kelly holds her glove up to the gap in the furniture, and Parker sends a rock right through it. Kelly glances around and notices a pair of binoculars hanging on the door. Trevor sighs heavily and leans over Maggie, clenching the flower pot lodged in her knee with one hand and Maggie's untouched leg with the other. Parker examines the piece of furniture, and a lid falls off it, uncovering a water fountain. Parker withdraws, urgently climbing up the lantern to escape from the fountain Kelly is controlling. Kelly activates the fountain at the lantern, which collapses, crashing through the wall of the room where Maggie and Trevor are. As the mist clears, Kelly stands up on the shelf wearing the binoculars, descends from the shelf, and rushes over to the now shattered room, digging through the fragments and discovering Maggie half-hidden under the wreckage."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holmes is incapacitated by thugs and awakens to find himself a captive of Moriarty, while Watson searches for him using a sketch of a nearby tower. Moriarty uses Holmes as bait, broadcasting music while his sniper, Moran, aims at Watson. As Holmes is suspended by a meat hook, Watson dodges Moran's bullets and climbs a platform. Watson cleverly uses an artillery cannon to destroy the tower and building, disrupting Moriarty's plan. After the chaos, he searches the debris and finds Holmes buried but alive."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble As the dust settles Watson sits up on the platform Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are Watson is operating Moran retreats desperately climbing down the tower to escape from the cannon Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon Moriarty rolls his eyes wearily and bends over Holmes gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other Watson looks around and sees a pair of ear defenders hanging on the wall Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery and Moran puts a bullet straight through it Holmes spins in the air while Moran takes aim his shot passing through a narrow gap between pieces of machinery just missing Watson Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform Moriarty spins Holmes around and Watson breaks cover as Moran shoots causing Watson to duck behind a platform Moriarty pushes him and Moran shoots at Watson but the bullet ricochets off a metal pole Moriarty accompanies the singer and Holmes clutching the rope attached to the hook in his shoulder is swinging about a meter off the floor while Moran keeps a rifle trained from a walkway high up on the tower speaker broadcasting the music over a speaker into the yard where Watson cowers in the darkness Moriarty lowers a stylus on a gramophone record holding a telephone in front of the horn A meat hook is slammed into Holmes' shoulder and he is hauled up on a rope A guard had apprehended Watson but Moran shot the guard to get an aim on Watson Watson goes nearer to the tower as Moriarty turns to Holmes Meanwhile a small glass with liquid is held under Holmes' nose and he stirs He glances up at a lit tower nearby and moves off Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor Meanwhile a small glass with liquid is held under Holmes' nose and he stirs He glances up at a lit tower nearby and moves off A guard had apprehended Watson but Moran shot the guard to get an aim on Watson Watson goes nearer to the tower as Moriarty turns to Holmes Moriarty lowers a stylus on a gramophone record holding a telephone in front of the horn A meat hook is slammed into Holmes' shoulder and he is hauled up on a rope while Moran keeps a rifle trained from a walkway high up on the tower speaker broadcasting the music over a speaker into the yard where Watson cowers in the darkness Moriarty pushes him and Moran shoots at Watson but the bullet ricochets off a metal pole Moriarty accompanies the singer and Holmes clutching the rope attached to the hook in his shoulder is swinging about a meter off the floor Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform Moriarty spins Holmes around and Watson breaks cover as Moran shoots causing Watson to duck behind a platform Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery and Moran puts a bullet straight through it Holmes spins in the air while Moran takes aim his shot passing through a narrow gap between pieces of machinery just missing Watson Moriarty rolls his eyes wearily and bends over Holmes gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other Watson looks around and sees a pair of ear defenders hanging on the wall Moran retreats desperately climbing down the tower to escape from the cannon Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are Watson is operating wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble As the dust settles Watson sits up on the platform"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Moriarty spins Holmes around and Watson breaks cover as Moran shoots causing Watson to duck behind a platform Holmes' screams are audible over the tenor as Watson climbs a ladder on the platform Holmes spins in the air while Moran takes aim his shot passing through a narrow gap between pieces of machinery just missing Watson Moriarty indicates to a henchman to lower Holmes to the ground as Watson holds his hat up to the gap in the machinery and Moran puts a bullet straight through it Watson looks around and sees a pair of ear defenders hanging on the wall Moriarty rolls his eyes wearily and bends over Holmes gripping the meat hook embedded in his shoulder with one hand and Holmes' uninjured arm with the other Moran watches the piece of machinery and a cover falls off it revealing an artillery cannon Moran retreats desperately climbing down the tower to escape from the cannon Watson is operating Watson fires the cannon at the tower which collapses smashing through the roof of the building where Holmes and Moriarty are As the dust settles Watson sits up on the platform wearing the ear defenders climbs down from the platform and runs over to the now ruined building searching through the debris and finding Holmes halfburied under the rubble Holmes sees a stack of longbarreled pistols and is handed a magazine to load but identical thugs come up behind him one grabbing the gun and the other holding a piece of cloth over Holmes' mouth and nose causing his eyes to close as he sinks to the floor Watson returns to the spot where he left Holmes and finds a note pinned to a crate reading it and turning it over to see Rene's sketch of a tall tower He glances up at a lit tower nearby and moves off Meanwhile a small glass with liquid is held under Holmes' nose and he stirs Watson goes nearer to the tower as Moriarty turns to Holmes A guard had apprehended Watson but Moran shot the guard to get an aim on Watson A meat hook is slammed into Holmes' shoulder and he is hauled up on a rope Moriarty lowers a stylus on a gramophone record holding a telephone in front of the horn speaker broadcasting the music over a speaker into the yard where Watson cowers in the darkness while Moran keeps a rifle trained from a walkway high up on the tower Moriarty accompanies the singer and Holmes clutching the rope attached to the hook in his shoulder is swinging about a meter off the floor Moriarty pushes him and Moran shoots at Watson but the bullet ricochets off a metal pole"
        }
      ]
    }
  ]
}