{
  "ground_truth": "Holmes is pulled up by Watson, who removes the meat hook from his shoulder, and as Holmes looks up at him, Watson helps him up and supports him as they make their way back across the factory floor, passing several Howitzers ready to be shipped out. They arm themselves, with Watson carrying a machine gun and Holmes a pistol, and Watson leads the way. In the ruins, Moran frees Moriarty from the rubble. Sim spots Holmes and Watson, running ahead of them. Holmes sees some guards, and Watson opens fire, laying down covering fire as Sim and the gypsies lead the way out of the factory. As Watson retreats and reloads, Holmes shoots a guard dead, reloads, and follows the others out into a rail yard, where one of the gypsies is killed by the rough-looking twins. Holmes and Watson return fire, killing them both. The raiders make their way to the perimeter wall of the rail yard and throw a rope over it, but before they can escape, guards spot them and open fire, forcing them to take cover. Watson returns fire with his machine gun, but the guards respond with a heavy-caliber Gatling gun, forcing them behind some crates as a huge artillery piece is turned on them. The shell goes over their heads and blasts a hole in the perimeter wall, and Holmes and the others run for it, out into the woods beyond. In the distance, a railway line runs through the trees with a train approaching. The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down, and as the guards shoot through the trees, others in the rail yard adjust the mortars and open fire. Explosions erupt around Holmes, Watson, and the others as they keep running towards the railway line. Moran, giving chase, picks up a rifle and takes a shot at Watson, clipping his right flank, but he keeps running as bullets rip chunks out of tree trunks. Holmes returns fire with his pistol, hitting a guard in the chest amidst massive explosions, as Sims sprints forward with guards in chase. Moran takes another shot, hitting one of the gypsies, and Sims sees the man go down but keeps running. Little Hansel, a heavy-caliber artillery piece, has a massive shell loaded into its breach, the barrel's elevation is adjusted, a powder charge is loaded, and after final adjustments, the gun crew chief gives the order to fire.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holmes is pulled up by Watson, who removes the meat hook from his shoulder, and as Holmes looks up at him, Watson assists him up and supports him as they make their way back across the mill floor, passing several Howitzers ready to be shipped out. They arm themselves, with Watson carrying a machine gun and Holmes a handgun, and Watson leads the way. In the ruins, Moran liberates Moriarty from the debris. Sim spots Holmes and Watson, running ahead of them. Holmes sees some sentries, and Watson opens fire, laying down covering fire as Sim and the Romani guide the way out of the mill. As Watson retreats and reloads, Holmes shoots a sentry dead, reloads, and follows the others out into a rail yard, where one of the Romani is killed by the rough-looking twins. Holmes and Watson return fire, eliminating them both. The raiders make their way to the perimeter barrier of the rail yard and throw a rope over it, but before they can escape, sentries spot them and open fire, forcing them to take cover. Watson returns fire with his machine gun, but the sentries respond with a heavy-caliber Gatling gun, forcing them behind some crates as a huge ordnance piece is turned on them. The shell goes over their heads and blasts a hole in the perimeter barrier, and Holmes and the others sprint for it, out into the forest beyond. In the distance, a railway line runs through the trees with a locomotive approaching. The captain of the sentries rallies his troops through the breach in the perimeter barrier to pursue them, and as the sentries shoot through the trees, others in the rail yard adjust the mortars and open fire. Detonations erupt around Holmes, Watson, and the others as they keep running towards the railway line. Moran, giving chase, picks up a rifle and takes a shot at Watson, clipping his right flank, but he keeps running as bullets rip chunks out of tree trunks. Holmes returns fire with his handgun, hitting a sentry in the chest amidst massive explosions, as Sims sprints forward with sentries in pursuit. Moran takes another shot, hitting one of the Romani, and Sims sees the man go down but keeps running. Little Hansel, a heavy-caliber ordnance piece, has a massive shell loaded into its breach, the barrel's elevation is adjusted, a powder charge is loaded, and after final adjustments, the gun crew chief gives the order to fire."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Watson pulls up Holmes and removes the meat hook from his shoulder, and as Holmes looks up at him, Watson helps him up and supports him as they make their way back across the factory floor, passing several Howitzers ready to be shipped out. They arm themselves, with a machine gun being carried by Watson and a pistol by Holmes, and the way is led by Watson. Moran frees Moriarty from the rubble in the ruins. Holmes and Watson are spotted by Sim, who runs ahead of them. Some guards are seen by Holmes, and fire is opened by Watson, laying down covering fire as Sim and the gypsies lead the way out of the factory. As Watson retreats and reloads, a guard is shot dead by Holmes, who reloads and follows the others out into a rail yard, where one of the gypsies is killed by the rough-looking twins. Fire is returned by Holmes and Watson, killing them both. The perimeter wall of the rail yard is reached by the raiders, who throw a rope over it, but they are spotted by guards before they can escape, causing them to open fire and forcing the raiders to take cover. Fire is returned by Watson with his machine gun, but a heavy-caliber Gatling gun is used by the guards to respond, forcing them behind some crates as a huge artillery piece is turned on them. A shell goes over their heads and blasts a hole in the perimeter wall, and Holmes and the others run for it, out into the woods beyond. In the distance, a railway line runs through the trees with a train approaching. The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down, and as the guards shoot through the trees, others in the rail yard adjust the mortars and open fire. Explosions erupt around Holmes, Watson, and the others as they keep running towards the railway line. Moran, giving chase, picks up a rifle and shoots at Watson, clipping his right flank, but he keeps running as bullets rip chunks out of tree trunks. Fire is returned by Holmes with his pistol, hitting a guard in the chest amidst massive explosions, as Sims sprints forward with guards in chase. Moran shoots again, hitting one of the gypsies, and Sims sees the man go down but keeps running. Little Hansel, a heavy-caliber artillery piece, has its massive shell loaded into the breach, the barrel's elevation is adjusted, a powder charge is loaded, and after final adjustments, the order to fire is given by the gun crew chief."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holmes is aided by Watson, who pulls the meat hook from his shoulder and supports him as they cross the factory floor, passing Howitzers ready for shipping. They arm themselves, with Watson carrying a machine gun and Holmes a pistol, and Watson leads. In the ruins, Moran frees Moriarty. Sim spots Holmes and Watson and runs ahead. Holmes sees guards, and Watson provides covering fire as Sim and the gypsies lead the escape. Watson retreats, reloads, and Holmes kills a guard before following into the rail yard, where a gypsy is killed by twins. Holmes and Watson return fire, killing the twins. They reach the perimeter wall and throw a rope over it, but guards spot them, forcing them to take cover. Watson fires back, but the guards respond with a Gatling gun, necessitating cover behind crates. An artillery shell explodes a hole in the wall, allowing escape into the woods. A railway line is nearby, and a train is approaching. The captain rallies guards through the breach to pursue, as others adjust mortars and fire. Explosions erupt as Holmes, Watson, and the others head for the railway line. Moran chases them, shooting Watson in the flank, but he continues as bullets hit trees. Holmes fires back, hitting a guard, while Sims runs ahead with guards chasing. Moran shoots a gypsy, and Sims keeps running. Little Hansel, a heavy artillery piece, is prepared and fired."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes, helped by Watson, removes the meat hook from his shoulder. Watson supports Holmes as they cross the factory floor, passing Howitzers ready for shipment. Armed, Watson with a machine gun and Holmes with a pistol, they proceed. In the ruins, Moran frees Moriarty. Sim spots Holmes and Watson and runs ahead. Holmes sees guards; Watson fires, providing cover, as Sim and the gypsies lead the escape. Holmes kills a guard while Watson reloads and they exit to a rail yard, where gypsies are killed by twins. Holmes and Watson kill the twins and reach the perimeter wall. Guards spot and fire at them, forcing cover. Watson shoots back, but a Gatling gun forces them behind crates. A shell from a massive artillery piece breaches the wall, allowing their escape to the woods. A train approaches along a distant railway line. The captain rallies troops through the breach to chase them, as mortars explode around Holmes and Watson. Moran shoots Watson, clipping him, but Watson keeps running. Holmes returns fire, hitting a guard. Sims runs, pursued by guards. Moran wounds a gypsy; Sims keeps running. Little Hansel, a large artillery piece, is prepped and fired."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holmes is abruptly pulled up by Watson, who carefully removes the sharp meat hook from his shoulder. As Holmes raises his gaze towards Watson, his trusted companion, Watson offers him a helping hand, supporting him as they cautiously make their way back across the sprawling factory floor. They pass by several massive Howitzers standing ready to be shipped out for deployment. The duo quickly arm themselves with weapons: Watson takes charge with a formidable machine gun, while Holmes secures a pistol in hand. With Watson leading the way, they proceed with determination. Amidst the remnants and ruins, Moran diligently works to free Moriarty from the heavy rubble. In the midst of this chaotic scenario, Sim spots both Holmes and Watson and swiftly runs ahead of them. Holmes's keen eyes catch sight of some guards, prompting Watson to open fire, providing covering fire while Sim and the gypsies guide them out of the factory. As Watson gradually retreats to reload, Holmes skillfully shoots a guard dead, then reloads his own firearm and follows the group out into the rail yard. Tragically, one of the gypsies falls, killed by the malicious actions of the rough-looking twins. Reacting swiftly, Holmes and Watson return fire with precision, eliminating the twins in swift succession. The raiders then make their way to the perimeter wall of the rail yard, throwing a rope over in a bid for escape. However, before they can successfully flee, alert guards spot them and unleash a barrage of gunfire, forcing them to urgently take cover. Watson responds by firing back with his machine gun, but the opposing guards retaliate with a fearsome heavy-caliber Gatling gun, compelling them to retreat behind some protective crates. As tension mounts, a colossal artillery piece is turned on them. The shell, fired with great force, sails over their heads and creates a substantial breach in the perimeter wall. Seizing the opportunity, Holmes and the others make a desperate run for it, racing out into the expansive woods beyond. In the distance, a railway line cuts through the dense trees, and they notice a train steadily approaching. Meanwhile, the captain of the guards rallies his troops, urging them through the newly created breach in the wall to pursue them. As the guards shoot through the trees, others stationed in the rail yard adjust their mortars and commence firing. Explosions burst around Holmes, Watson, and their group as they persist in running towards the railway line. Moran, relentless in his chase, picks up a rifle and takes a calculated shot at Watson, hitting him on his right flank, yet Watson perseveres, continuing to run despite the bullets that shred chunks from the tree trunks around him. Holmes, maintaining his composure, returns fire with his trusty pistol, striking a guard in the chest amidst the thunderous explosions. Meanwhile, Sim sprints forward with guards in hot pursuit. Moran takes aim once more, this time hitting one of the gypsies, and although Sim witnesses the man fall, he presses on, unwavering in his determination. Little Hansel, an impressive heavy-caliber artillery piece, stands ready as a massive shell is carefully loaded into its breach. The gun's barrel elevation is meticulously adjusted, the powder charge is loaded with precision, and after final checks are made, the gun crew chief gives the decisive order to fire."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holmes is very suddenly and unexpectedly pulled up by the quick action of Watson, who with great care and precision, removes the sharp, dangerous meat hook that had embedded itself into Holmes's shoulder. As Holmes lifts his gaze to meet Watson's eyes, he sees his trusted and loyal companion, Watson, offering him a helping hand. Watson supports Holmes as they both cautiously navigate their way back across the sprawling, expansive factory floor. Along their path, they pass by several massive Howitzers, which stand impressively ready, prepared to be shipped out for imminent deployment. The duo quickly decides to arm themselves with weapons for protection: Watson takes charge, handling a formidable machine gun, while Holmes secures a more manageable pistol in his hand. With Watson confidently leading the way, they move forward with determination. Amidst the scattered remnants and crumbled ruins, Moran is seen diligently working, straining to free Moriarty from beneath the heavy, obstructive rubble. In the midst of this chaotic and frenzied scenario, Sim spots both Holmes and Watson; without delay, he swiftly runs ahead of them. Holmes's keen and observant eyes catch sight of some guards, prompting Watson to open fire, skillfully providing covering fire as Sim and the gypsies guide them out of the factory's confines. As Watson gradually retreats to reload his weapon, Holmes skillfully and accurately shoots a guard dead, reloading his firearm before following the group out into the open rail yard. Tragically, one of the gypsies falls, killed by the malicious actions of the rough-looking, ruthless twins. Reacting with swift efficiency, Holmes and Watson return fire with precision, eliminating the twins in a rapid succession of shots. The raiders then make their harried way to the perimeter wall of the rail yard, throwing a rope over in a desperate bid for escape. However, before they can successfully make their getaway, alert guards spot them and unleash a relentless barrage of gunfire, forcing the group to urgently seek cover. Watson responds by firing back with his machine gun, but the opposing guards retaliate with a fearsome heavy-caliber Gatling gun, compelling them to retreat behind some nearby protective crates. As tension escalates, a colossal, imposing artillery piece is turned on them. The shell, fired with great power and force, sails over their heads, creating a substantial breach in the perimeter wall. Seizing this fleeting opportunity, Holmes and the others make a desperate dash for it, racing out into the expansive, dense woods beyond. In the distance, they notice a railway line cutting through the thick trees, and see a train steadily approaching. Meanwhile, the captain of the guards rallies his troops, urging them through the new breach in the wall to pursue Holmes and his group. As the guards shoot through the trees, others stationed in the rail yard adjust their mortars and commence firing. Explosions burst all around Holmes, Watson, and their group as they persist in their frantic run towards the railway line. Moran, relentless in his chase, picks up a rifle and takes a calculated shot at Watson, hitting him on his right flank, yet Watson perseveres, courageously continuing to run despite the bullets shredding chunks from the tree trunks around him. Holmes, maintaining his cool composure, skillfully returns fire with his trusty pistol, striking a guard in the chest amidst the thunderous explosions echoing through the air. Meanwhile, Sim sprints forward with guards in hot pursuit. Moran takes aim once more, this time hitting one of the gypsies, and although Sim witnesses his comrade fall, he presses on, unwavering in his determination to escape. Little Hansel, an impressive heavy-caliber artillery piece, stands ready as a massive shell is carefully loaded into its breach. The gun's barrel elevation is meticulously adjusted for accuracy, the powder charge is loaded with precision, and after final checks are made, the gun crew chief gives the decisive order to fire."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holmes finds himself being gently hoisted by Watson, who carefully removes the meat hook embedded in his shoulder, easing it out with precision. As Holmes gazes up at Watson, expressing silent gratitude, Watson steadies him, providing physical support as they painstakingly navigate the cluttered factory floor, weaving through rows of Howitzers lined up and ready for shipment. Their senses heightened by urgency, they arm themselves quickly, with Watson selecting a machine gun and Holmes opting for a pistol, both securing their weapons with readiness. Watson takes the lead, guiding them through the chaotic environment. Amid the ruins, Moran painstakingly digs through debris to free a trapped Moriarty from the rubble. Meanwhile, Sim identifies Holmes and Watson, accelerating his pace as he runs ahead, signaling urgency with every step. Holmes, ever observant, spots a group of guards, prompting Watson to unleash a barrage of gunfire, offering suppressive cover. Sim, accompanied by the gypsies, adeptly navigates the path out of the factory. As they maneuver strategically, Watson, maintaining vigilance, reloads his machine gun, while Holmes efficiently dispatches a guard with lethal accuracy before reloading and pursuing the group into the rail yard. Here, a tense standoff unfolds as a gypsy falls, struck down by the brutal twins. Reacting swiftly, Holmes and Watson coordinate their return fire with precision, eliminating both twins. The raiders, driven by a desperate need to escape, reach the rail yard's perimeter wall, swiftly securing a rope over it. Yet, as they brace for their escape, guards discover their presence, triggering a fierce exchange of gunfire. Watson, steadfast and determined, counters with his machine gun but is met with the daunting roar of a heavy-caliber Gatling gun, forcing them to seek shelter behind sturdy crates. In a dramatic turn, a massive artillery piece is trained toward them, its shell whistling overhead and blasting open a gaping exit in the perimeter wall. Seizing this fleeting opportunity, Holmes and his companions dash out, into the comparative safety of the woods beyond. A railway line beckons in the distance, its tracks cutting through the trees with a train approaching, embodying their potential escape. With relentless determination, the captain of the guards rallies his troops, breaching the wall to pursue the fleeing group. Chaos ensues as the guards unleash a hail of bullets through the trees, while others back in the rail yard adjust their mortars and commence firing. Explosions erupt with disorienting intensity around Holmes, Watson, and the others as they sprint towards the salvation of the railway line. Amidst the chaos, Moran seizes a rifle, taking careful aim, managing to graze Watson's right flank, yet Watson, undeterred by the pain, continues his arduous escape, while bullets viciously fragment tree trunks around him. Holmes returns fire with calculated precision from his pistol, striking a guard in the chest amidst the enveloping explosions. Sim, relentless and focused, presses forward, guards hot on his trail. Moran fires once more, hitting a gypsy, causing Sim to momentarily falter at the sight, yet he resolutely continues his run for freedom. Meanwhile, Little Hansel, an imposing artillery piece, undergoes a meticulous loading process; a massive shell is carefully inserted into its breach, its barrel's elevation is precisely adjusted, a potent powder charge is loaded with careful deliberation, and following a series of final adjustments, the gun crew chief resolutely issues the command to fire."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holmes is helped up by Watson, who removes the meat hook from his shoulder and supports him as they navigate the factory floor, passing several Howitzers. They arm themselves, with Watson carrying a machine gun and Holmes a pistol, and proceed with Watson leading. Meanwhile, Moran rescues Moriarty from the rubble. Sim spots Holmes and Watson and runs ahead with them. They encounter guards, and Watson provides covering fire as Sim and the gypsies guide their escape from the factory. During the retreat, Holmes and Watson take down a guard and eventually reach a rail yard, where a gypsy is killed by rough-looking twins. Holmes and Watson retaliate, killing the twins. The group attempts to escape by scaling a perimeter wall, but guards open fire, forcing them into cover. Watson counters with his machine gun, but facing a Gatling gun, they seek refuge behind crates. A shell from an artillery piece creates an escape path in the wall, allowing them to flee into the woods. Pursued by guards shooting through the trees and mortar fire, Holmes, Watson, and their group head toward a railway line. Moran takes a shot, injuring Watson slightly, but he continues running. Holmes returns fire, hitting a guard as explosions occur around them. Moran also manages to hit a gypsy, but Sim continues his escape. In the rail yard, the crew of the artillery piece, Little Hansel, prepares to fire, adjusting its aim and loading a massive shell before receiving the order to fire."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holmes is pulled up by Watson, who carefully removes the meat hook from his shoulder, a gruesome injury sustained during their escape, and as Holmes looks up at him, Watson helps him up and supports him as they make their way back across the factory floor. This factory, buzzing with wartime activity, has several Howitzers, powerful artillery guns, ready to be shipped out to the European front. They arm themselves, with Watson carrying a machine gun, reminiscent of the Maxim gun used in the late 19th century, and Holmes a pistol for close combat, and Watson leads the way. In the ruins, Moran, a notorious marksman known for his skill in the British Army, frees Moriarty from the rubble. Sim, an agile scout familiar with the factory layout, spots Holmes and Watson, running ahead of them. Holmes sees some guards, and Watson opens fire, laying down covering fire as Sim and the gypsies, part of an underground network resisting Moriarty's criminal empire, lead the way out of the factory. As Watson retreats and reloads, Holmes shoots a guard dead, reloads, and follows the others out into a rail yard, a crucial supply hub adjacent to the factory, where one of the gypsies is killed by the rough-looking twins, known enforcers under Moriarty's command. Holmes and Watson return fire, killing them both. The raiders make their way to the perimeter wall of the rail yard and throw a rope over it, but before they can escape, guards spot them and open fire, forcing them to take cover. Watson returns fire with his machine gun, but the guards respond with a heavy-caliber Gatling gun, an intimidating forerunner to modern machine guns, forcing them behind some crates as a huge artillery piece, likely a Howitzer, is turned on them. The shell goes over their heads and blasts a hole in the perimeter wall, and Holmes and the others run for it, out into the woods beyond. In the distance, a railway line runs through the trees with a train approaching, a potential escape route. The captain of the guards, a veteran of many skirmishes, rallies his troops through the breach in the perimeter wall to chase them down, and as the guards shoot through the trees, others in the rail yard adjust the mortars and open fire, employing tactics often used in trench warfare. Explosions erupt around Holmes, Watson, and the others as they keep running towards the railway line. Moran, giving chase, picks up a rifle and takes a shot at Watson, clipping his right flank, but he keeps running as bullets rip chunks out of tree trunks. Holmes returns fire with his pistol, hitting a guard in the chest amidst massive explosions, as Sims sprints forward with guards in chase. Moran takes another shot, hitting one of the gypsies, and Sims sees the man go down but keeps running. Little Hansel, a heavy-caliber artillery piece with a reputation for its devastating impact, has a massive shell loaded into its breach, the barrel's elevation is adjusted, a powder charge is loaded, and after final adjustments, the gun crew chief gives the order to fire, signaling an escalation in their desperate pursuit."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out. They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way. In the ruins Moran frees Moriarty from the rubble. Sim spots Holmes and Watson running ahead of them. Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory. As Watson retreats and reloads Holmes shoots a guard dead reloads and follows the others out into a rail yard where one of the gypsies is killed by the roughlooking twins. Holmes and Watson return fire killing them both. The raiders make their way to the perimeter wall of the rail yard and throw a rope over it but before they can escape guards spot them and open fire forcing them to take cover. Watson returns fire with his machine gun but the guards respond with a heavycaliber Gatling gun forcing them behind some crates. as a huge artillery piece is turned on them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The she will goes over their heads and blasts a hole in the perimeter wall and Holmes and the others run for it out into the woods beyond. In the distance a railway line runs through the trees with a train approaching. The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down and as the guards shoot through the trees others in the rail yard adjust the mortars and open fire. Explosions erupt around Holmes Watson and the others as they keep running towards the railway line. Moran giving chase picks up a rifle and takes a shot at Watson clipping his right flank but he keeps running. as bullets rip chunks out of tree trunks. Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions. as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running. Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach. the barrel's elevation is adjusted. a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out. They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way. In the ruins Moran frees Moriarty from the rubble. Sim spots Holmes and Watson running ahead of them. Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory. As Watson retreats and reloads Holmes shoots a guard dead reloads and follows the others out into a rail yard where one of the gypsies is killed by the roughlooking twins. Holmes and Watson return fire killing them both. The raiders make their way to the perimeter wall of the rail yard and throw a rope over it but before they can escape guards spot them and open fire forcing them to take cover. Watson returns fire with his machine gun but the guards respond with a heavycaliber Gatling gun forcing them behind some crates. as a huge artillery piece is turned on them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The she will goes over their heads and blasts a hole in the perimeter wall and Holmes and the others run for it out into the woods beyond. In the distance a railway line runs through the trees with a train approaching. The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down and as the guards shoot through the trees others in the rail yard adjust the mortars and open fire. Explosions erupt around Holmes Watson and the others as they keep running towards the railway line. Moran giving chase picks up a rifle and takes a shot at Watson clipping his right flank but he keeps running. as bullets rip chunks out of tree trunks. Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions. as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running. Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach. the barrel's elevation is adjusted. a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out. They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way. In the ruins Moran frees Moriarty from the rubble. Sim spots Holmes and Watson running ahead of them. Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory. as bullets rip chunks out of tree trunks. Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions. as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running. Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach. the barrel's elevation is adjusted. a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out. They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way. Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach. the barrel's elevation is adjusted. a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Pickles is whisked away by Socks, who extracts the soda cap from his elbow, and as Pickles glances up at him, Socks elevates him and props him up as they meander back across the garden path, bypassing several violins prepared to be carried off. They equip themselves, with Socks cradling a boomerang and Pickles a snorkel, and Socks guides the path. In the wreckage, Noodles liberates Whiskers from the debris. Blink spots Pickles and Socks, sprinting ahead of them. Pickles notices some owls, and Socks flings spaghetti, setting down a distraction as Blink and the llamas steer the route out of the garden. As Socks retreats and recharges, Pickles tosses a marshmallow skyward, refills, and trails the others out into a carousel lot, where one of the llamas is flattened by the peculiar flamingos. Pickles and Socks reciprocate, flattening them both. The explorers pave their way to the boundary hedge of the carousel lot and toss a ribbon over it, but before their retreat, owls detect them and toss water balloons, prompting them to duck. Socks retaliates with his boomerang, but the owls answer with a gigantic kazoo, driving them behind some pots as a colossal marimba is aimed their way. The note sails over their heads and punctures a gap in the boundary hedge, and Pickles and the others dash for it, out into the forest beyond. In the distance, a hiking trail weaves through the shrubs with a parade advancing. The leader of the owls corrals his crew through the gap in the boundary hedge to pursue them, and as the owls toss confetti through the leaves, others in the carousel lot tweak the tubas and unleash sound waves. Reverberations burst around Pickles, Socks, and the others as they persist running towards the hiking trail. Noodles, in pursuit, grabs a slingshot and lobs a pebble at Socks, grazing his left fin, but he continues galloping as acorns gouge chunks out of bushes. Pickles counters with his snorkel, nudging an owl in the wing amidst grand reverberations, as Blink dashes forward with owls tailing. Noodles slings another pebble, tagging one of the llamas, and Blink observes the creature drop but maintains pace. Tiny Gretel, a gigantic marimba, has a grand xylophone key placed on its surface, its angle is fine-tuned, a tambourine load is inserted, and following final fine-tuning, the music director commands to play."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holmes, aided by Watson, escapes a factory floor after Watson removes a meat hook from Holmes' shoulder. Armed, they navigate through the factory, encountering guard resistance. Moran frees Moriarty, who observes Holmes' and Watson's escape. Sim and the gypsies guide them, while Watson covers with gunfire. As they reach a rail yard, a skirmish with guards results in casualties on both sides. Under heavy Gatling gunfire, the group seeks cover, but a shell creates an escape route through the perimeter wall. Fleeing into the woods, they head for a railway line. Guard captain mobilizes troops, and mortars target Holmes' group. Moran shoots Watson in the flank, but he keeps running amidst chaos. Holmes retaliates, and Sim, pursued by guards, witnesses the death of a gypsy. A massive artillery piece, Little Hansel, is prepped and fired as the chase intensifies."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire the barrel's elevation is adjusted Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions as bullets rip chunks out of tree trunks Moran giving chase picks up a rifle and takes a shot at Watson clipping his right flank but he keeps running Explosions erupt around Holmes Watson and the others as they keep running towards the railway line The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down and as the guards shoot through the trees others in the rail yard adjust the mortars and open fire In the distance a railway line runs through the trees with a train approaching The she will goes over their heads and blasts a hole in the perimeter wall and Holmes and the others run for it out into the woods beyond as a huge artillery piece is turned on them Watson returns fire with his machine gun but the guards respond with a heavycaliber Gatling gun forcing them behind some crates The raiders make their way to the perimeter wall of the rail yard and throw a rope over it but before they can escape guards spot them and open fire forcing them to take cover Holmes and Watson return fire killing them both As Watson retreats and reloads Holmes shoots a guard dead reloads and follows the others out into a rail yard where one of the gypsies is killed by the roughlooking twins Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory Sim spots Holmes and Watson running ahead of them In the ruins Moran frees Moriarty from the rubble They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out Sim spots Holmes and Watson running ahead of them In the ruins Moran frees Moriarty from the rubble As Watson retreats and reloads Holmes shoots a guard dead reloads and follows the others out into a rail yard where one of the gypsies is killed by the roughlooking twins Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory The raiders make their way to the perimeter wall of the rail yard and throw a rope over it but before they can escape guards spot them and open fire forcing them to take cover Holmes and Watson return fire killing them both as a huge artillery piece is turned on them Watson returns fire with his machine gun but the guards respond with a heavycaliber Gatling gun forcing them behind some crates In the distance a railway line runs through the trees with a train approaching The she will goes over their heads and blasts a hole in the perimeter wall and Holmes and the others run for it out into the woods beyond Explosions erupt around Holmes Watson and the others as they keep running towards the railway line The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down and as the guards shoot through the trees others in the rail yard adjust the mortars and open fire as bullets rip chunks out of tree trunks Moran giving chase picks up a rifle and takes a shot at Watson clipping his right flank but he keeps running as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions the barrel's elevation is adjusted Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In the distance a railway line runs through the trees with a train approaching The captain of the guards rallies his troops through the breach in the perimeter wall to chase them down and as the guards shoot through the trees others in the rail yard adjust the mortars and open fire Explosions erupt around Holmes Watson and the others as they keep running towards the railway line Moran giving chase picks up a rifle and takes a shot at Watson clipping his right flank but he keeps running as bullets rip chunks out of tree trunks Holmes returns fire with his pistol hitting a guard in the chest amidst massive explosions as Sims sprints forward with guards in chase Moran takes another shot hitting one of the gypsies and Sims sees the man go down but keeps running Little Hansel a heavycaliber artillery piece has a massive she will loaded into its breach the barrel's elevation is adjusted a powder charge is loaded and after final adjustments the gun crew chief gives the order to fire Holmes is pulled up by Watson who removes the meat hook from his shoulder and as Holmes looks up at him Watson helps him up and supports him as they make their way back across the factory floor passing several Howitzers ready to be shipped out They arm themselves with Watson carrying a machine gun and Holmes a pistol and Watson leads the way In the ruins Moran frees Moriarty from the rubble Sim spots Holmes and Watson running ahead of them Holmes sees some guards and Watson opens fire laying down covering fire as Sim and the gypsies lead the way out of the factory As Watson retreats and reloads Holmes shoots a guard dead reloads and follows the others out into a rail yard where one of the gypsies is killed by the roughlooking twins Holmes and Watson return fire killing them both The raiders make their way to the perimeter wall of the rail yard and throw a rope over it but before they can escape guards spot them and open fire forcing them to take cover Watson returns fire with his machine gun but the guards respond with a heavycaliber Gatling gun forcing them behind some crates as a huge artillery piece is turned on them The she will goes over their heads and blasts a hole in the perimeter wall and Holmes and the others run for it out into the woods beyond"
        }
      ]
    }
  ]
}