{
  "ground_truth": "Watson yanks out the large splinter of wood, and Holmes drinks the contents of the vial Watson handed him. It appears to have no effect, but suddenly, Holmes opens his eyes wide and stares around wildly, then leaps to his feet. Holmes relaxes a little as Watson examines his foot, and Watson smiles wistfully for a moment. Watson tosses down a medical instrument and looks down thoughtfully, exchanging a surprised look with Sim, then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression. In Switzerland, an imposing castle is perched on a mountainside, saddling a massive waterfall. Delegates are arriving at the castle, expanding their back falls, which tumble hundreds of feet vertically down the mountainside. A horse-drawn sleigh arrives with Moriarty aboard, who has an elegant figure with a top hat and overcoat. He gets out of the sleigh and goes into the castle, where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him. Moriarty steps forward. In a ballroom, elegant couples in evening wear or military dress uniform dance across the floor. Holmes, Mycroft, the others, and Watson stand at the edge of the dance floor, all wearing white tie and tails. Samantha is wearing a deep red dress. Holmes holds his hand out, Sim takes it, and they step onto the dance floor, whirling around in circles along with the other couples. Holmes looks a bit out of place, his face unshaven and heavily bruised, as he observes the other people in the room. He notices details like a man's hand resting on the hilt of a sword, a woman's necklace, a man's medals, a military man holding a wine glass, and an eye crossing a white uniform. Holmes scans the people's faces until his eyes settle on a man in a black uniform with a facial scar. Holmes looks thoughtfully at Sim, steers her back over to Watson, and gestures to him. Arm in arm, Watson and Sim take to the dance floor while Holmes works on the man's face, and a man is chloroformed. Watson nods as Holmes walks over to a footman in 18th-century costume with a white parted wig and hands him a letter. The footman nods and takes it as Holmes leaves the ballroom. Watson walks over to Sim and whispers in her ear, and she looks surprised. Meanwhile, Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Watson pulls out the big fragment of timber, and Holmes sips the substance of the flask Watson gave him. It seems to have no impact, but suddenly, Holmes opens his eyes wide and gazes around frantically, then springs to his feet. Holmes calms a bit as Watson inspects his foot, and Watson grins wistfully for a moment. Watson throws down a surgical tool and glances down pensively, exchanging an astonished look with Sim, then observes Holmes for a moment before reclining back against the side of a boxcar with a resigned look. In Switzerland, a formidable fortress is perched on a mountainside, bridging a colossal cascade. Delegates are arriving at the fortress, extending their back falls, which plunge hundreds of feet vertically down the mountainside. A horse-drawn sled arrives with Moriarty aboard, who has a graceful figure with a top hat and overcoat. He gets out of the sled and enters the fortress, where the Maitre D' has a register containing images of all the delegates and recognizes and greets him. Moriarty advances. In a ballroom, graceful pairs in evening attire or military dress uniform glide across the floor. Holmes, Mycroft, the rest, and Watson stand at the margin of the dance floor, all wearing white tie and tails. Samantha is wearing a deep scarlet gown. Holmes extends his hand out, Sim takes it, and they step onto the dance floor, spinning around in circles along with the other pairs. Holmes appears a bit out of place, his face unshaven and heavily bruised, as he observes the other individuals in the room. He notices specifics like a man's hand resting on the hilt of a saber, a woman's necklace, a man's decorations, a military man holding a wine goblet, and an eye crossing a white uniform. Holmes scans the individuals' faces until his eyes settle on a man in a black uniform with a facial scar. Holmes looks pensively at Sim, guides her back over to Watson, and signals to him. Arm in arm, Watson and Sim take to the dance floor while Holmes focuses on the man's visage, and a man is chloroformed. Watson nods as Holmes walks over to a footman in 18th-century attire with a white parted wig and hands him a note. The footman nods and takes it as Holmes exits the ballroom. Watson walks over to Sim and murmurs in her ear, and she looks astonished. Meanwhile, Moriarty converses with a delegate wearing an orange band when the footman approaches him and hands him Holmes' note. Moriarty reads it and glances around in worry."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The large splinter of wood is yanked out by Watson, and the contents of the vial that Watson handed him are drunk by Holmes. No effect appears to take place, but suddenly, Holmes' eyes are opened wide, and he is startled as he stares around wildly, then his feet are leaped to. As Watson examines Holmes' foot, a little bit of relaxation is felt by Holmes, and a wistful smile is given by Watson for a moment. A medical instrument is tossed down by Watson, and his gaze is directed thoughtfully downward. A surprised look is exchanged with Sim, and Holmes is regarded by him for a moment before a resigned expression is leaned back against the side of a boxcar by him. In Switzerland, the mountainside is saddled by an imposing castle, which perches atop a massive waterfall. The castle sees the arrival of delegates, who expand their back falls, tumbling hundreds of feet vertically down the mountainside. A horse-drawn sleigh, with Moriarty aboard, arrives, his elegant figure adorned with a top hat and overcoat. Out of the sleigh, he gets and enters the castle, where a book containing photos of all the delegates is held by the Maitre D', who identifies and welcomes him. Forward steps Moriarty. In a ballroom, across the floor, elegant couples in evening wear or military dress uniform dance. At the edge of the dance floor stand Holmes, Mycroft, the others, and Watson, all attired in white tie and tails. A deep red dress is worn by Samantha. Holmes' hand is held out, Sim takes it, and onto the dance floor they step, whirling around in circles along with the other couples. Holmes, his face unshaven and heavily bruised, appears a bit out of place as he observes the other people in the room. Details like a man's hand resting on the hilt of a sword, a woman's necklace, a man's medals, a military man holding a wine glass, and an eye crossing a white uniform are noticed by him. The people's faces are scanned by Holmes until a man in a black uniform with a facial scar is settled upon by his eyes. Sim is looked at thoughtfully by Holmes, and she is steered back over to Watson by him, who is gestured to. The dance floor is taken to by Watson and Sim, arm in arm, while the man's face is worked on by Holmes, and chloroform is used on a man. As Holmes walks over to a footman in 18th-century costume with a white parted wig, a letter is handed to him by Holmes. A nod is given by the footman as the letter is taken and Holmes leaves the ballroom. Over to Sim walks Watson, and a whisper is given in her ear by him, causing her to look surprised. Meanwhile, with a delegate wearing an orange sash, Moriarty chats when the footman approaches him and Holmes' letter is handed to him. The letter is read by Moriarty, and he looks around in concern."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Watson removes the large wood splinter, and Holmes drinks from the vial Watson handed him. Initially ineffective, the drink soon causes Holmes to leap up with wide eyes. Holmes relaxes slightly as Watson examines his foot and shares a wistful smile. Watson drops a medical tool, exchanges a surprised look with Sim, then leans against a boxcar, resigned. In Switzerland, a castle overlooks a massive waterfall, where delegates arrive, their backs expanding over the falling waters. Moriarty, elegant in a top hat and overcoat, arrives by sleigh and enters the castle, where the Maitre D' identifies and welcomes him using a photo book of delegates. In a ballroom, couples in evening wear or military dress dance. Holmes, Mycroft, others, and Watson stand by, all in white tie and tails, while Samantha wears a deep red dress. Holmes leads Sim onto the dance floor, appearing out of place with an unshaven, bruised face. He observes details like a man's sword hilt and a woman's necklace, then focuses on a scarred man in a black uniform. Holmes returns Sim to Watson, who takes the dance floor with her while Holmes handles the scarred man, eventually chloroforming him. Holmes gives a letter to a footman in an 18th-century costume, who then delivers it to Moriarty, causing concern after he reads it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Watson removes the splinter, and Holmes drinks from the vial Watson gives him. Initially unaffected, Holmes suddenly springs up, calming as Watson examines his foot. Watson exchanges looks with Sim and resigns against a boxcar. In Switzerland, a castle overlooks a waterfall. Delegates arrive, and Moriarty, elegant in a top hat and overcoat, enters the castle, greeted by the Maitre D' with a delegate photo book. In a ballroom, couples in elegant and military dress dance. Holmes, Mycroft, others, and Watson in white tie watch. Samantha wears red. Holmes takes Sim to dance; he appears out of place with an unshaven, bruised face, noting various individuals' details. Holmes focuses on a man with a scar, gestures to Watson, who dances with Sim. Holmes chloroforms a man and gives a letter to a footman. Watson whispers to surprised Sim. Moriarty discusses with a delegate in an orange sash, then reads Holmes' letter from the footman, looking worried."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Watson, with a swift and decisive tug, pulls out the large, troublesome splinter of wood from Holmes, who then proceeds to consume the liquid contents of the vial that Watson had handed to him moments earlier. Initially, the liquid seems to have no discernible impact, but quite suddenly, Holmes’ eyes burst wide open, and he begins to gaze around the room with a wild, frantic intensity, eventually springing up to his feet with great agility. Gradually, Holmes begins to relax a little while Watson carefully examines his foot, offering a brief, wistful smile as he does so. Watson then tosses a medical instrument aside, casting his gaze downward in thoughtful contemplation. As he does, he exchanges a brief, surprised glance with Sim before turning his attention back to Holmes for a moment. He then leans back against the side of a boxcar, adopting an expression of resigned acceptance. \n\nIn Switzerland, there stands an imposing castle, magnificently perched on a rugged mountainside, adjacent to a vast and powerful waterfall. Delegates are steadily arriving at this grand castle. Their expansive, elegant backdrops cascade hundreds of feet down the sheer mountainside. A horse-drawn sleigh arrives with Moriarty aboard. His presence is marked by his elegant figure, clad in both a distinguished top hat and a stylish overcoat. Stepping out from the sleigh, he makes his way into the castle, where he is met by the Maitre D'. The Maitre D' holds a book that contains photographs of all the attending delegates and thus identifies and warmly welcomes Moriarty. With a composed demeanor, Moriarty steps forward into the interior.\n\nIn a splendid ballroom, couples who are elegantly dressed in evening wear or military dress uniform glide gracefully across the dance floor. Holmes, Mycroft, and the others, including Watson, stand at the edge of this bustling dance floor, all impeccably dressed in white tie and tails. Samantha stands out in particular, wearing a deep red dress. Holmes extends his hand, and Sim accepts it, allowing them to step onto the dance floor. They begin to whirl around in graceful circles alongside the other dancing couples. Holmes, with his face unshaven and heavily bruised, looks somewhat out of place amidst the glamorous surroundings, observing the room with a scrutinizing eye. He notices finer details, such as a man's hand resting on the hilt of a sword, a woman's intricate necklace, a man's shining medals, a military figure casually holding a wine glass, and an eye catching a white uniform. Holmes keenly scans the faces of the people present until his gaze fixes upon a man dressed in a black uniform, noticeable by a distinctive facial scar. Holmes then turns to Sim with a thoughtful expression, steering her back over to Watson and gesturing toward him. Arm in arm, Watson and Sim take their place on the dance floor, leaving Holmes free to focus on the situation. He makes his way toward the man with the scar, leading to a man being discreetly chloroformed. Watson gives a nod of understanding as Holmes strides over to a footman dressed in an 18th-century costume, complete with a white, parted wig, and hands him a letter. The footman acknowledges with a nod and takes the letter as Holmes exits the ballroom. Watson approaches Sim and whispers into her ear, prompting a look of surprise from her. Meanwhile, Moriarty is engaged in conversation with a delegate wearing a striking orange sash when the footman approaches him and presents Holmes' letter. Moriarty reads the letter, his face marked by a sudden look of concern as he scans the room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a swift and decisive motion, Watson expertly pulls out the large, troublesome splinter of wood embedded in Holmes. Following this, Holmes proceeds to consume the liquid contents from the vial that Watson had handed to him just moments earlier. Initially, the liquid appears to have no discernible effect on Holmes, but quite suddenly, Holmes' eyes burst wide open with a startling alertness. He begins to gaze around the room with an intense and wild, almost frantic, intensity, eventually springing up to his feet with remarkable agility and energy. As time passes, Holmes gradually begins to relax a little, while Watson carefully examines his foot. Watson offers a brief, wistful smile as he conducts his examination. With a casual flick of the wrist, Watson tosses a medical instrument aside, his gaze shifting downward in thoughtful contemplation. In the midst of this, he exchanges a brief, surprised glance with Sim before turning his attention back to Holmes for a fleeting moment. Watson then leans back against the side of a boxcar, his expression adopting one of resigned acceptance.\n\nIn the majestic and picturesque setting of Switzerland, there stands a formidable and imposing castle, magnificently perched atop a rugged mountainside, positioned directly adjacent to a vast and powerful waterfall. Delegates are steadily arriving at this grand and impressive castle. The expansive and elegant backdrops of the castle cascade hundreds of feet down the sheer mountainside, adding to the grandeur of the scene. A horse-drawn sleigh arrives, carrying none other than Moriarty aboard. Moriarty makes his presence known with his elegant figure, clad in the distinguished attire of a top hat and a stylish overcoat. As he steps out from the sleigh, he confidently makes his way into the castle, where he is promptly met by the attentive Maitre D'. The Maitre D' holds a book that contains photographs of all the attending delegates, enabling him to identify and warmly welcome Moriarty. With a composed and assured demeanor, Moriarty steps forward, entering the castle's interior with purpose.\n\nWithin a splendid and opulent ballroom, couples dressed with elegance in either formal evening wear or military dress uniforms glide gracefully across the polished dance floor. Holmes, Mycroft, and the others, including Watson, stand at the edge of this bustling dance floor, all impeccably dressed in the formal attire of white tie and tails. Among them, Samantha stands out, making a striking impression in a deep red dress. Holmes extends his hand towards Sim, and she graciously accepts it, allowing them to step onto the dance floor together. They begin to whirl around in graceful and fluid circles, moving harmoniously alongside the other dancing couples. Holmes, though unshaven and heavily bruised, looks somewhat out of place amid the glamorous and luxurious surroundings, yet his keen eyes observe the room with a scrutinizing gaze. He takes note of the finer details, such as a man's hand resting confidently on the hilt of a sword, the intricate design of a woman's necklace, the shining medals adorning a man's chest, a military figure casually holding a wine glass, and an eye catching a striking white uniform. Holmes continues to keenly scan the faces of the people present until his gaze finally fixes upon a man dressed in a black uniform, notable for a distinctive facial scar. Holmes then turns to Sim with a thoughtful expression, guiding her back over to Watson and gesturing toward him. Arm in arm, Watson and Sim take their place on the dance floor, leaving Holmes free to focus solely on the situation at hand. He purposefully makes his way toward the man with the scar, which eventually leads to a man being discreetly chloroformed. Watson acknowledges the situation with a nod of understanding as Holmes strides over to a footman. The footman is dressed in an elaborate 18th-century costume, complete with a white, parted wig, and Holmes confidently hands him a letter. The footman nods in acknowledgment and takes the letter as Holmes exits the ballroom. Watson approaches Sim and whispers something into her ear, prompting a look of surprise and unexpected reaction from her. Meanwhile, Moriarty is engaged in a conversation with a delegate who is wearing a striking orange sash when the footman approaches him and presents the letter from Holmes. Moriarty reads the letter, his face becoming marked by a sudden look of concern as his eyes scan the room with heightened awareness."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Watson tightly grips the large splinter of wood, pulling it out with a firm tug, while Holmes takes the small vial from Watson's hand and drinks its contents in a single gulp. Initially, there seems to be no change, but then, in an abrupt shift, Holmes's eyes snap open wide, and he takes a rapid, frantic look around the room. In a swift motion, he jumps to his feet, his demeanor gradually easing as Watson carefully examines his foot for any remaining issues. A wistful smile momentarily graces Watson's face, and he tosses aside a medical instrument, casting his gaze downward in thoughtful contemplation. He then exchanges a surprised glance with Sim, shifts his focus back to Holmes for a brief moment, and finally, with an air of resignation, leans back against the side of a boxcar, settling into a pensive stance. Elsewhere, in Switzerland, a majestic castle stands prominently on a mountainside, positioned alongside a massive, cascading waterfall. Delegates steadily make their way to the castle, their elaborate coats billowing as they walk, with the waterfall tumbling dramatically hundreds of feet down the slope. A traditional horse-drawn sleigh pulls up to the entrance, and Moriarty emerges, exuding elegance in his top hat and overcoat, stepping out and making his way inside the castle. The Maitre D', holding a book filled with photographs of the delegates, identifies Moriarty and warmly welcomes him. Moriarty confidently steps forward into the setting. In the opulent ballroom, couples bedecked in evening wear or military dress uniforms gracefully sway across the dance floor. Holmes, Mycroft, Watson, and the others stand along the perimeter of the floor, each donned in formal white tie and tails, while Samantha captivates in a deep red dress. Holmes extends his hand to Sim, who takes it, and together they begin to glide onto the dance floor, spinning in rhythmic circles among the other couples. Holmes appears slightly out of place, his face unshaven and marked by heavy bruising, as he closely observes those around him. His keen eye catches minute details: a man's hand resting with proprietorial ease on the hilt of a sword, a woman's necklace glinting in the low light, a man's medals pinned to his chest, a military officer holding a wine glass with nonchalant elegance, and an eye that crosses a stark white uniform. Holmes meticulously scans the faces of the guests until his focus locks onto a man clad in a black uniform marked by a distinctive facial scar. Holmes considers this discovery, looks thoughtfully at Sim, and guides her back over to Watson, subtly gesturing towards them. As Watson and Sim pair off, arm in arm, and begin their turn on the dance floor, Holmes stealthily concentrates on the scarred man's face, ensuring his attention remains unnoticed, and a man nearby is efficiently chloroformed. Watson gives an understanding nod as Holmes approaches a footman dressed in an 18th-century costume complete with a white parted wig, handing over a letter with clear instructions. The footman acknowledges with a nod, accepting the letter as Holmes discreetly exits the ballroom. Meanwhile, Watson approaches Sim, leans in to whisper in her ear, and observes as her expression shifts to one of surprise. Concurrently, Moriarty engages in a conversation with a delegate adorned with an orange sash when the footman arrives, delivering Holmes's letter directly to him. Moriarty reads the letter with a growing concern apparent in his demeanor, his eyes darting around the ballroom as he processes the contained message."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Watson removes a large splinter from Holmes, who then drinks the vial's contents handed to him by Watson. Initially, nothing happens, but suddenly Holmes becomes alert and jumps to his feet as Watson examines his foot. Watson smiles briefly and exchanges a look with Sim before leaning back against a boxcar with a resigned expression. In Switzerland, an imposing castle sits atop a mountain beside a massive waterfall, where delegates are arriving. A horse-drawn sleigh brings Moriarty, elegantly dressed in a top hat and overcoat, to the castle. Inside, the Maitre D' identifies and welcomes him from a delegate photo book. In the ballroom, elegant couples in evening wear and military uniforms dance. Holmes, Mycroft, and Watson stand by in white tie and tails, with Samantha in a deep red dress. Holmes and Sim join the dance floor, twirling with the other couples, as Holmes, unshaven and bruised, observes details like swords and medals. He focuses on a man in a black uniform with a facial scar, leads Sim back to Watson, and gestures for them to dance. While Watson and Sim take to the floor, Holmes approaches a servant in 18th-century attire, handing him a letter. The footman nods, and as Holmes exits, Watson whispers something to Sim, surprising her. Meanwhile, Moriarty, conversing with a delegate in an orange sash, receives Holmes' letter from the footman and looks around with concern."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Watson, who had trained in battlefield medicine during his time as a military doctor in Afghanistan, yanks out the large splinter of wood, and Holmes, the renowned detective known for his acute observational skills, drinks the contents of the vial Watson handed him. It appears to have no effect, but suddenly, Holmes opens his eyes wide and stares around wildly, then leaps to his feet. Holmes, ever the master of disguise and deduction, relaxes a little as Watson examines his foot, and Watson smiles wistfully for a moment. Watson tosses down a medical instrument used for extracting foreign objects and looks down thoughtfully, exchanging a surprised look with Sim, a trusted associate of Holmes, then regards Holmes for a moment before leaning back against the side of a boxcar, a common mode of cargo transport across Europe at the time, with a resigned expression.\n\nIn Switzerland, an imposing castle, reminiscent of the medieval Château de Chillon, is perched on a mountainside, saddling a massive waterfall, possibly inspired by the famous Rhine Falls. Delegates are arriving at the castle, expanding their back falls, which tumble hundreds of feet vertically down the mountainside. A horse-drawn sleigh, a popular mode of winter transportation in the Alps, arrives with Moriarty aboard, who has an elegant figure with a top hat, a symbol of 19th-century gentleman fashion, and overcoat. He gets out of the sleigh and goes into the castle, where the Maitre D', responsible for greeting and organizing guests, has a book containing photos of all the delegates and identifies and welcomes him. Moriarty, the arch-nemesis of Holmes known for his criminal genius, steps forward.\n\nIn a ballroom, elegant couples in evening wear or military dress uniform, indicating high society or official functions, dance across the floor. Holmes, Mycroft, his equally brilliant brother who works for the British government, the others, and Watson stand at the edge of the dance floor, all wearing white tie and tails, the epitome of formal attire. Samantha, possibly an ally or acquaintance of the group, is wearing a deep red dress. Holmes holds his hand out, Sim takes it, and they step onto the dance floor, whirling around in circles along with the other couples. Holmes looks a bit out of place, his face unshaven and heavily bruised from likely recent adventures, as he observes the other people in the room. He notices details like a man's hand resting on the hilt of a sword, possibly indicating military or noble status, a woman's necklace, a man's medals, a military man holding a wine glass, and an eye crossing a white uniform. Holmes scans the people's faces until his eyes settle on a man in a black uniform with a facial scar, suggesting a hardened or dangerous character. Holmes looks thoughtfully at Sim, steers her back over to Watson, and gestures to him. Arm in arm, Watson and Sim take to the dance floor while Holmes works on the man's face, employing his skill in disguise, and a man is chloroformed in a swift, secretive action.\n\nWatson, ever pragmatic and supportive of Holmes' plans, nods as Holmes walks over to a footman in 18th-century costume with a white parted wig, akin to those worn by servants in historical European aristocracy, and hands him a letter. The footman nods and takes it as Holmes, ever the master of strategy, leaves the ballroom. Watson walks over to Sim and whispers in her ear, and she looks surprised, possibly by new information or a sudden plan. Meanwhile, Moriarty chats with a delegate wearing an orange sash, which could signify a diplomatic or ceremonial role, when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern, potentially aware that Holmes is once again unraveling his schemes."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him Moriarty steps forward It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet a man in a black uniform with a facial scar Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat Watson walks over to Sim and whispers in her ear and she looks surprised He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him Moriarty steps forward In a ballroom elegant couples in evening wear or military dress uniform dance across the floor Watson nods as Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails a man's medals Samantha is wearing a deep red dress Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression Sim takes it and they step onto the dance floor whirling around in circles along with the other couples Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him Holmes holds his hand out Sim takes it and they step onto the dance floor whirling around in circles along with the other couples Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room He notices details like a man's hand resting on the hilt of a sword a woman's necklace a man's medals a military man holding a wine glass and an eye crossing a white uniform Holmes scans the people's faces until his eyes settle on a man in a black uniform with a facial scar Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him Arm in arm Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed Watson nods as Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter The footman nods and takes it as Holmes leaves the ballroom Watson walks over to Sim and whispers in her ear and she looks surprised Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter a military man holding a wine glass and an eye crossing a white uniform In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed Moriarty reads it and looks around in concern He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him. It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet. Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment. Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression. In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall. Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside. A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat. He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him. Moriarty steps forward. In a ballroom elegant couples in evening wear or military dress uniform dance across the floor. Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails. Samantha is wearing a deep red dress. Holmes holds his hand out. Sim takes it and they step onto the dance floor whirling around in circles along with the other couples. Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. He notices details like a man's hand resting on the hilt of a sword. a woman's necklace. a man's medals. a military man holding a wine glass and an eye crossing a white uniform. Holmes scans the people's faces until his eyes settle on. a man in a black uniform with a facial scar. Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him. Arm in arm. Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed. Watson nods as. Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter. The footman nods and takes it as Holmes leaves the ballroom. Watson walks over to Sim and whispers in her ear and she looks surprised. Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him. It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet. Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment. Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression. In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall. Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside. A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat. He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him. Moriarty steps forward. In a ballroom elegant couples in evening wear or military dress uniform dance across the floor. Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails. Samantha is wearing a deep red dress. Holmes holds his hand out. Sim takes it and they step onto the dance floor whirling around in circles along with the other couples. Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. He notices details like a man's hand resting on the hilt of a sword. a woman's necklace. a man's medals. a military man holding a wine glass and an eye crossing a white uniform. Holmes scans the people's faces until his eyes settle on. a man in a black uniform with a facial scar. Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him. Arm in arm. Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed. Watson nods as. Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter. The footman nods and takes it as Holmes leaves the ballroom. Watson walks over to Sim and whispers in her ear and she looks surprised. Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him. It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet. Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment. Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression. In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall. Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside. A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat. He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him. Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed. Watson nods as. Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter. The footman nods and takes it as Holmes leaves the ballroom. Watson walks over to Sim and whispers in her ear and she looks surprised. Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him. It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet. Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment. Watson walks over to Sim and whispers in her ear and she looks surprised. Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter. Moriarty reads it and looks around in concern."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Johnson yanks out the large splinter of wood, and Parker drinks the contents of the vial Johnson handed him. It appears to have no effect, but suddenly, Parker opens his eyes wide and stares around wildly, then leaps to his feet. Parker relaxes a little as Johnson examines his foot, and Johnson smiles wistfully for a moment. Johnson tosses down a medical instrument and looks down thoughtfully, exchanging a surprised look with Alex, then regards Parker for a moment before leaning back against the side of a boxcar with a resigned expression. In Switzerland, an imposing castle is perched on a mountainside, saddling a massive waterfall. Delegates are arriving at the castle, expanding their back falls, which tumble hundreds of feet vertically down the mountainside. A horse-drawn sleigh arrives with Hathaway aboard, who has an elegant figure with a top hat and overcoat. Hathaway gets out of the sleigh and goes into the castle, where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes Hathaway. Hathaway steps forward. In a ballroom, elegant couples in evening wear or military dress uniform dance across the floor. Parker, Logan, the others, and Johnson stand at the edge of the dance floor, all wearing white tie and tails. Brenda is wearing a deep red dress. Parker holds his hand out, Alex takes it, and they step onto the dance floor, whirling around in circles along with the other couples. Parker looks a bit out of place, his face unshaven and heavily bruised, as he observes the other people in the room. He notices details like a man's hand resting on the hilt of a sword, a woman's necklace, a man's medals, a military man holding a wine glass, and an eye crossing a white uniform. Parker scans the people's faces until his eyes settle on a man in a black uniform with a facial scar. Parker looks thoughtfully at Alex, steers her back over to Johnson, and gestures to him. Arm in arm, Johnson and Alex take to the dance floor while Parker works on the man's face, and a man is chloroformed. Johnson nods as Parker walks over to a footman in 18th-century costume with a white parted wig and hands him a letter. The footman nods and takes it as Parker leaves the ballroom. Johnson walks over to Alex and whispers in her ear, and she looks surprised. Meanwhile, Hathaway chats with a delegate wearing an orange sash when the footman approaches him and hands him Parker's letter. Hathaway reads it and looks around in concern."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Watson yanks out the large thorn of metal, and Holmes drinks the contents of the flask Watson handed him. It appears to have no effect, but suddenly, Holmes opens his eyes wide and stares around wildly, then leaps to his feet. Holmes relaxes a little as Watson examines his arm, and Watson smiles wistfully for a moment. Watson tosses down a notebook and looks down thoughtfully, exchanging a surprised look with Sim, then regards Holmes for a moment before leaning back against the side of a carriage with a resigned expression. In Switzerland, an imposing lighthouse is perched on a hill, saddling a massive forest. Delegates are arriving at the lighthouse, expanding their hiking gear, which tumbles hundreds of feet vertically down the hillside. A steam engine arrives with Moriarty aboard, who has an elegant figure with a bowler hat and scarf. He gets out of the steam engine and goes into the lighthouse, where the Maitre D' has a ledger containing sketches of all the delegates and identifies and welcomes him. Moriarty steps forward. In a dining hall, elegant couples in evening wear or royal dress attire dance across the floor. Holmes, Mycroft, the others, and Watson stand at the edge of the dance floor, all wearing dark suits and bowties. Samantha is wearing a deep emerald dress. Holmes holds his hand out, Sim takes it, and they step onto the dance floor, whirling around in circles along with the other couples. Holmes looks a bit out of place, his face unshaven and heavily bruised, as he observes the other people in the room. He notices details like a man's hand resting on the handle of an umbrella, a woman's brooch, a man's ribbons, a military man holding a champagne flute, and an eyeglass crossing a velvet uniform. Holmes scans the people's faces until his eyes settle on a man in a gray uniform with a facial tattoo. Holmes looks thoughtfully at Sim, steers her back over to Watson, and gestures to him. Arm in arm, Watson and Sim take to the dance floor while Holmes works on the man's face, and a man is tranquilized. Watson nods as Holmes walks over to a bellboy in 17th-century garb with a red feathered hat and hands him a scroll. The bellboy nods and takes it as Holmes leaves the dining hall. Watson walks over to Sim and whispers in her ear, and she looks surprised. Meanwhile, Moriarty chats with a delegate wearing a green sash when the bellboy approaches him and hands him Holmes' scroll. Moriarty reads it and looks around in concern."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Watson pulls out the large splinter of wood, and Holmes sips the contents of the vial Watson handed him. It seems to have no effect, but suddenly, Holmes narrows his eyes and glances around cautiously, then sits down. Holmes frowns slightly as Watson inspects his foot, and Watson chuckles softly for a moment. Watson places down a medical instrument and gazes down pensively, exchanging a surprised look with Sim, then observes Holmes for a moment before slumping against the side of a boxcar with a tired expression. In Switzerland, an imposing castle is nestled on a mountainside, hugging a massive waterfall. Delegates are departing from the castle, folding their back falls, which drape hundreds of feet vertically down the mountainside. A horse-drawn sleigh departs with Moriarty aboard, who has an elegant figure with a top hat and overcoat. He disembarks from the sleigh and strolls into the castle, where the Maitre D' holds a book containing photos of all the delegates and notes and welcomes him. Moriarty steps backward. In a ballroom, elegant couples in evening wear or military dress uniforms wander across the floor. Holmes, Mycroft, the others, and Watson lean at the edge of the dance floor, all wearing white tie and tails. Samantha is wearing a deep red dress. Holmes nods his hand out, Sim grabs it, and they walk onto the dance floor, meandering around in circles along with the other couples. Holmes seems a bit out of place, his face unshaven and heavily bruised, as he gazes at the other people in the room. He spots details like a man's hand resting on the hilt of a sword, a woman's necklace, a man's medals, a military man dropping a wine glass, and a nose brushing a white uniform. Holmes inspects the people's faces until his eyes lock on a man in a black uniform with a facial scar. Holmes glances thoughtfully at Sim, guides her back over to Watson, and waves to him. Arm in arm, Watson and Sim walk to the dance floor while Holmes sketches the man's face, and a man is bathed. Watson nods as Holmes strolls over to a footman in 18th-century costume with a white parted wig and gives him a letter. The footman nods and accepts it as Holmes exits the ballroom. Watson strolls over to Sim and murmurs in her ear, and she looks surprised. Meanwhile, Moriarty converses with a delegate wearing an orange sash when the footman approaches him and delivers Holmes' letter. Moriarty peruses it and glances around in worry."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Clifford yanks out the large fragment of stone, and Hugo drinks the contents of the goblet Clifford handed him. It appears to have no effect, but suddenly, Hugo opens his eyes wide and glances around frantically, then jumps to his feet. Hugo relaxes a little as Clifford examines his elbow, and Clifford smiles dreamily for a moment. Clifford throws down a culinary tool and looks down pensively, exchanging a surprised look with Alex, then regards Hugo for a moment before leaning back against the side of a carriage with a resigned expression. In Austria, an imposing tower is perched on a hillside, saddling a massive river. Tourists are arriving at the tower, expanding their backpacks, which tumble hundreds of feet vertically down the hillside. A steam locomotive arrives with Oliver aboard, who has an elegant figure with a bowler hat and trench coat. He gets out of the locomotive and goes into the tower, where the Concierge has a ledger containing photos of all the tourists and identifies and welcomes him. Oliver steps forward. In a gallery, elegant guests in cocktail attire or naval dress uniform glide across the floor. Hugo, Maxwell, the others, and Clifford stand at the edge of the dance floor, all wearing black tie and tails. Rebecca is wearing a bright blue gown. Hugo holds his hand out, Alex takes it, and they step onto the dance floor, spinning around in circles along with the other guests. Hugo looks a bit out of place, his face unshaven and heavily bruised, as he observes the other people in the room. He notices details like a woman's hand resting on the hilt of a dagger, a man's watch, a woman's earrings, a naval officer holding a champagne glass, and an ear crossing a green uniform. Hugo scans the guests' faces until his eyes settle on a woman in a white uniform with a facial scar. Hugo looks thoughtfully at Alex, steers her back over to Clifford, and gestures to him. Arm in arm, Clifford and Alex take to the dance floor while Hugo works on the woman's face, and a woman is chloroformed. Clifford nods as Hugo walks over to a musician in 19th-century garb with a black powdered wig and hands him a telegram. The musician nods and takes it as Hugo leaves the gallery. Clifford strolled over to Alex and whispers in her ear, and she looks startled. Meanwhile, Oliver chats with a tourist wearing a yellow cloak when the musician approaches him and hands him Hugo's telegram. Oliver reads it and looks around in concern."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rufus pulls out the large splinter of wood, and Marcus sips the contents of the vial Rufus handed him. It appears to have no effect, but suddenly, Marcus closes his eyes slowly and glances around curiously, then slides to his feet. Marcus tenses slightly as Rufus inspects his hand, and Rufus nods thoughtfully for a moment. Rufus drops down a writing utensil and gazes up contemplatively, exchanging an amused look with Sal, then observes Marcus for a moment before slumping back against the side of a wagon with an amused expression. In Norway, an ancient fortress is nestled on a cliffside, overlooking a massive canyon. Tourists are arriving at the fortress, stretching their backpacks, which plummet hundreds of feet vertically down the cliffside. A horse-led cart arrives with Gideon aboard, who has a rugged demeanor with a cowboy hat and trench coat. He climbs out of the cart and strides into the fortress, where the Concierge has a scroll containing sketches of all the tourists and identifies and greets him. Gideon moves forward. In a hall, distinguished guests in casual wear or festive dress code glide across the floor. Marcus, Albert, the others, and Rufus stand at the edge of the floor, all wearing black tie and vests. Olivia is wearing a vibrant blue dress. Marcus offers his hand, Sal takes it, and they drift onto the floor, spinning around in synchronized steps with the other guests. Marcus appears somewhat out of place, his face unshaven and lightly bruised, as he surveys the other people in the room. He notices details like a woman's hand resting on the strap of a bag, a man's bracelet, a woman's earrings, a civilian holding a champagne flute, and an eye inspecting a red outfit. Marcus examines the people's faces until his eyes rest on a woman in a green dress with a facial scar. Marcus glances thoughtfully at Sal, guides her back over to Rufus, and motions to him. Arm in arm, Rufus and Sal glide onto the floor while Marcus studies the woman's demeanor, and a woman is sedated. Rufus acknowledges as Marcus approaches a butler in 18th-century attire with a white powdered wig and hands him a note. The butler nods and accepts it as Marcus exits the hall. Rufus approaches Sal and whispers in her ear, and she looks intrigued. Meanwhile, Gideon chats with a tourist wearing a yellow sash when the butler approaches him and hands him Marcus' note. Gideon reads it and looks around with interest."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Watson pulls out the large chunk of metal, and Holmes sips the contents of the jar Watson gave him. It seems to have no impact, but suddenly, Holmes closes his eyes tightly and glances around frantically, then springs into the air. Holmes calms down a bit as Watson checks his knee, and Watson grins wistfully for a moment. Watson tosses a writing pen aside and gazes down introspectively, sharing a curious look with Sim, then observes Holmes briefly before leaning back against the side of a car with a thoughtful expression. In Switzerland, a grand factory is situated on a cliffside, straddling a mighty river. Delegates are entering the factory, spreading their capes, which glide hundreds of feet horizontally across the cliffside. A steam-powered carriage arrives with Moriarty aboard, who carries an antique cane with a top hat and cloak. He steps out of the carriage and walks into the factory, where the Host has a scroll containing sketches of all the delegates and acknowledges and accepts him. Moriarty moves ahead. In a ballroom, dignified pairs in morning coats or naval attire glide across the floor. Holmes, Mycroft, the rest, and Watson stand at the boundary of the dance floor, all dressed in black tie and suits. Samantha is wearing a bright blue dress. Holmes extends his arm, Sim takes it, and they glide onto the dance floor, spinning around in loops with the other couples. Holmes appears slightly awkward, his face unshaven and heavily marked, as he surveys the other individuals in the room. He notes details like a man's fingers resting on the handle of a cane, a woman's bracelet, a man's badges, a military officer holding a juice glass, and a shadow crossing a blue uniform. Holmes examines the people's expressions until his gaze fixes on a man in a green uniform with a cheek scar. Holmes looks pensively at Sim, guides her back over to Watson, and signals to him. Linked arm in arm, Watson and Sim step onto the dance floor while Holmes works on the man's jacket, and a man is mesmerized. Watson nods as Holmes approaches a server in 17th-century attire with a gray styled wig and hands him a message. The server nods and accepts it as Holmes exits the ballroom. Watson approaches Sim and murmurs in her ear, and she looks amazed. Meanwhile, Moriarty converses with a delegate wearing a purple sash when the server approaches him and delivers Holmes' message. Moriarty reads it and glances around with distress."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Baxter hauls out the massive shard of metal, and Cooper sips the elixir from the flask Baxter offered him. It seems to have no impact, but abruptly, Cooper snaps his fingers open and glares around frantically, then vaults to his elbows. Cooper calms a bit as Baxter scrutinizes his elbow, and Baxter grins nostalgically for a second. Baxter flings aside a gardening tool and glances upwards reflectively, trading a bewildered glance with Sam, then gazes at Cooper for an instant before slouching against the edge of a tractor with a defeated demeanor. In Belgium, a daunting skyscraper is nestled on a cliff, overlooking a colossal canyon. Visitors are arriving at the skyscraper, expanding their umbrellas, which plummet dozens of meters horizontally down the cliff. A camel-pulled carriage arrives with Rodriguez aboard, who has an elegant silhouette with a bowler hat and blazer. He disembarks from the carriage and enters the skyscraper, where the Steward has a scroll containing sketches of all the visitors and recognizes and greets him. Rodriguez advances. In a gallery, graceful pairs in leisurewear or ceremonial gowns glide across the tiles. Cooper, Jared, the others, and Baxter stand by the edge of the tile, all dressed in black tie and jackets. Emily is wearing a vibrant green outfit. Cooper extends his arm, Sam grasps it, and they glide across the tile, spinning around in loops along with the other pairs. Cooper appears somewhat awkward, his chin unshaven and heavily marked, as he scrutinizes the others in the space. He observes details like a child's foot dangling from the loop of a belt, a person's hat, a teacher's spectacles, a caretaker clutching a juice bottle, and an owl fluttering over a yellow mask. Cooper surveys the people's attire until his eyes lock on a child in a blue mask with a hair ribbon. Cooper glances intently at Sam, guides her back over to Baxter, and signals to him. Hand in hand, Baxter and Sam glide onto the tile while Cooper focuses on the child's mask, and a teacher is distracted. Baxter winks as Cooper strolls over to a courier in medieval attire with a red tied scarf and hands him a message. The courier nods and accepts it as Cooper exits the gallery. Baxter approaches Sam and murmurs in her ear, and she appears shocked. Meanwhile, Rodriguez converses with a visitor wearing a purple shawl when the courier nears him and hands him Cooper's message. Rodriguez reads it and glances around in unease."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Watson removes a splinter from Holmes, who drinks a vial's contents and springs to life, surprising Watson and Sim. In Switzerland, delegates arrive at a castle by a waterfall. Moriarty, in a top hat and overcoat, enters the castle and is welcomed by the Maitre D'. Inside a ballroom, elegantly dressed guests dance. Holmes, Mycroft, Watson, and others observe from the sidelines. Holmes, appearing disheveled, dances with Sim but is preoccupied, noticing details about the guests until he focuses on a scarred man in black. He discreetly signals Watson, who dances with Sim, while Holmes approaches a footman, handing him a letter. The footman delivers the letter to Moriarty, who reads it with concern. Meanwhile, Watson whispers to Sim, surprising her, as Moriarty converses with a delegate."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Moriarty reads it and looks around in concern Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter Watson walks over to Sim and whispers in her ear and she looks surprised The footman nods and takes it as Holmes leaves the ballroom Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter Watson nods as Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed Arm in arm Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him a man in a black uniform with a facial scar Holmes scans the people's faces until his eyes settle on a military man holding a wine glass and an eye crossing a white uniform a man's medals a woman's necklace He notices details like a man's hand resting on the hilt of a sword Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room Sim takes it and they step onto the dance floor whirling around in circles along with the other couples Holmes holds his hand out Samantha is wearing a deep red dress Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails In a ballroom elegant couples in evening wear or military dress uniform dance across the floor Moriarty steps forward He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Holmes scans the people's faces until his eyes settle on Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails The footman nods and takes it as Holmes leaves the ballroom Arm in arm A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside Holmes holds his hand out Samantha is wearing a deep red dress He notices details like a man's hand resting on the hilt of a sword In a ballroom elegant couples in evening wear or military dress uniform dance across the floor Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter Moriarty reads it and looks around in concern Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him a woman's necklace Watson walks over to Sim and whispers in her ear and she looks surprised It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet Sim takes it and they step onto the dance floor whirling around in circles along with the other couples a military man holding a wine glass and an eye crossing a white uniform Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment a man's medals Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall Watson nods as He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him Moriarty steps forward Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression a man in a black uniform with a facial scar"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He notices details like a man's hand resting on the hilt of a sword a woman's necklace a man's medals a military man holding a wine glass and an eye crossing a white uniform Holmes scans the people's faces until his eyes settle on a man in a black uniform with a facial scar Holmes looks thoughtfully at Sim steers her back over to Watson and gestures to him Arm in arm Watson and Sim take to the dance floor while Holmes works on the man's face and a man is chloroformed Watson nods as Holmes walks over to a footman in 18thcentury costume with a white parted wig and hands him a letter The footman nods and takes it as Holmes leaves the ballroom Watson walks over to Sim and whispers in her ear and she looks surprised Meanwhile Moriarty chats with a delegate wearing an orange sash when the footman approaches him and hands him Holmes' letter Moriarty reads it and looks around in concern Watson yanks out the large splinter of wood and Holmes drinks the contents of the vial Watson handed him It appears to have no effect but suddenly Holmes opens his eyes wide and stares around wildly then leaps to his feet Holmes relaxes a little as Watson examines his foot and Watson smiles wistfully for a moment Watson tosses down a medical instrument and looks down thoughtfully exchanging a surprised look with Sim then regards Holmes for a moment before leaning back against the side of a boxcar with a resigned expression In Switzerland an imposing castle is perched on a mountainside saddling a massive waterfall Delegates are arriving at the castle expanding their back falls which tumble hundreds of feet vertically down the mountainside A horsedrawn sleigh arrives with Moriarty aboard who has an elegant figure with a top hat and overcoat He gets out of the sleigh and goes into the castle where the Maitre D' has a book containing photos of all the delegates and identifies and welcomes him Moriarty steps forward In a ballroom elegant couples in evening wear or military dress uniform dance across the floor Holmes Mycroft the others and Watson stand at the edge of the dance floor all wearing white tie and tails Samantha is wearing a deep red dress Holmes holds his hand out Sim takes it and they step onto the dance floor whirling around in circles along with the other couples Holmes looks a bit out of place his face unshaven and heavily bruised as he observes the other people in the room"
        }
      ]
    }
  ]
}