{
  "ground_truth": "Watson watches as Moriarty heads off. The photographer. Holmes is outside on a balcony, drinking from a hip flask. The rocking back fall stumble into the darkness nearby. Moriarty comes out and joins him. Moriarty goes to a table and picks up a chess timing clock. He puts the clock on another table beside a chessboard. Holmes takes a seat in front of the board. Moriarty fetches a blanket and puts it around Holmes' shoulders. Moriarty picks up a second blanket and drapes it around his own shoulders. Holmes and Moriarty both smile. Then Moriarty's expression hardens. He starts by moving a white pawn. He sets the time clock. Inside, Watson and Sim move amongst the guests. Outside on the balcony, Holmes advances a second black pawn on the game of chess. Inside, Watson and Sim meet up again. They look over at the delegates. Holmes' knight takes one of Moriarty's pawns. Moriarty advances a bishop. A man smokes a cigar. Sim studies the faces of the potential assassins. A hyperemic needle is concealed inside an especially-adapted Winchester cartridge case. Watson glances around the photographer about to take the delegates' photo. Watson deliberately knocks a tray of drinks out of a footman's hands. As it crashes onto the marble floor, everyone looks around in surprise except one man in the corner. Watson peers at the man's hairline and notes that he drops his cigar. Sim stares at the man as he steps away from the delegate he was talking to. She looks over at Watson, who nods. The man reaches inside his jacket with his left hand just as Sim steps up to him. Another man continues assembling the hyperemic cartridge. He shoves her aside and draws a gun. Watson tackles him as he takes a shot. Mycroft steps forward and his arms ready. Soldiers drag him away. The hyperemic cartridge is loaded into a weapon. As Rene is dragged away, Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane. Something occurs to Watson. He runs out of the ballroom and joins the soldiers guarding Rene. He's collapsed. The soldiers allowed him to tend to Rene who's convulsing on the floor. Watson quickly finds a hyperemic dart lodged in Rene's leg. He pulls it out and tastes the compound it's injected. Moran watches with a smile. Sim runs to Rene. Watson spots Moran leaving. He turns back to Rene who's fading fast. On the balcony. Holmes looks troubled. Unsettled, Holmes sits back in his chair. Moriarty shrugs the blanket off her shoulders and gets up on the table. Holmes removes his blanket and looks at the chessboard. Moriarty feels for his notebook and runs his thumb over the top line in his pocket.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Watson observes as Moriarty departs. The shutterbug. Holmes is outside on a terrace, sipping from a hip canteen. The swaying backward tumble into the obscurity nearby. Moriarty emerges and joins him. Moriarty proceeds to a table and picks up a chess timer. He places the timer on another table next to a chessboard. Holmes sits in front of the board. Moriarty retrieves a coverlet and places it around Holmes' shoulders. Moriarty selects a second coverlet and drapes it around his own shoulders. Holmes and Moriarty both grin. Then Moriarty's demeanor toughens. He begins by shifting a white pawn. He sets the timepiece. Inside, Watson and Sim move among the attendees. Outside on the balcony, Holmes moves forward a second ebony pawn on the game of chess. Inside, Watson and Sim encounter each other again. They gaze at the delegates. Holmes' horse captures one of Moriarty's pawns. Moriarty advances a clergyman. A gentleman smokes a stogie. Sim examines the visages of the possible assassins. A hyperemic syringe is hidden inside an especially-modified Winchester shell casing. Watson glances around the shutterbug about to take the delegates' portrait. Watson intentionally knocks a platter of beverages out of a footman's hands. As it crashes onto the marble floor, everyone looks around in astonishment except one gentleman in the corner. Watson peers at the man's hairline and observes that he drops his stogie. Sim gazes at the man as he moves away from the delegate he was conversing with. She looks over at Watson, who nods. The man reaches inside his jacket with his left hand just as Sim approaches him. Another man continues assembling the hyperemic shell. He pushes her aside and draws a firearm. Watson tackles him as he fires a shot. Mycroft steps forward and his arms ready. Soldiers drag him away. The hyperemic shell is loaded into a weapon. As Rene is dragged away, Moran covertly shoots him with a hyperemic shell fired from a firearm concealed in his cane. Something occurs to Watson. He runs out of the ballroom and joins the soldiers guarding Rene. He's collapsed. The soldiers allowed him to tend to Rene who's convulsing on the floor. Watson quickly discovers a hyperemic dart lodged in Rene's leg. He extracts it and samples the compound it's injected. Moran watches with a grin. Sim runs to Rene. Watson notices Moran departing. He turns back to Rene who's fading quickly. On the balcony. Holmes appears troubled. Disturbed, Holmes reclines back in his chair. Moriarty shrugs the coverlet off his shoulders and rises on the table. Holmes removes his coverlet and gazes at the chessboard. Moriarty feels for his journal and runs his thumb over the upper line in his pocket."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Watson watches as Moriarty is headed off. The photographer. Holmes is outside on a balcony, and a drink is being sipped from a hip flask by him. The rocking back fall stumbles into the darkness nearby. Moriarty comes out and joins him. A chess timing clock is picked up by Moriarty from a table. The clock is placed by him on another table beside a chessboard. A seat is taken by Holmes in front of the board. A blanket is fetched by Moriarty and placed around Holmes' shoulders. A second blanket is picked up by Moriarty and draped around his own shoulders. Both Holmes and Moriarty smile. Then Moriarty's expression hardens. A white pawn is moved by him to start. The time clock is set by him. Inside, Watson and Sim move amongst the guests. Outside on the balcony, a second black pawn is advanced by Holmes on the game of chess. Inside, Watson and Sim meet up again. The delegates are looked over by them. Moriarty's pawn is taken by Holmes' knight. A bishop is advanced by Moriarty. A cigar is smoked by a man. The faces of the potential assassins are studied by Sim. An especially-adapted Winchester cartridge case conceals a hyperemic needle. Watson glances around the photographer who is about to take the delegates' photo. A tray of drinks is deliberately knocked out of a footman's hands by Watson. As it crashes onto the marble floor, everyone is made to look around in surprise except one man in the corner. The man's hairline is peered at by Watson, and he notes that a cigar is dropped by him. Sim stares at the man as a step is taken away from the delegate he was talking to. Watson is looked over by her, and a nod is given by him. Inside his jacket, the man reaches with his left hand just as Sim steps up to him. The hyperemic cartridge is continued to be assembled by another man. She is shoved aside by him, and a gun is drawn. As a shot is taken, Watson tackles him. Mycroft steps forward and his arms are readied. Soldiers drag him away. A weapon is loaded with the hyperemic cartridge. As Rene is dragged away, he is surreptitiously shot by Moran with a hyperemic cartridge fired from a gun hidden in his cane. Something is realized by Watson. Out of the ballroom he runs and joins the soldiers guarding Rene. He's collapsed. The soldiers allow him to tend to Rene who's convulsing on the floor. A hyperemic dart is quickly found by Watson lodged in Rene's leg. It is pulled out by him, and the compound it's injected is tasted. Moran watches with a smile. Rene is run to by Sim. Moran is spotted leaving by Watson. Back to Rene, who's fading fast, he turns. On the balcony, Holmes appears troubled. Unsettled, back in his chair he sits. Moriarty shrugs the blanket off her shoulders and stands up on the table. Holmes removes his blanket and looks at the chessboard. For his notebook, Moriarty feels and runs his thumb over the top line in his pocket."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Watson observes as Moriarty departs, while Holmes drinks from a hip flask on the balcony. Moriarty joins him, retrieves a chess clock, and places it beside the chessboard. Holmes sits, and Moriarty wraps blankets around their shoulders. They smile, but Moriarty's expression hardens as he starts the game by moving a white pawn. Watson and Sim mingle with guests inside. Outside, Holmes moves a black pawn. Watson and Sim reconvene, observing the delegates. Holmes captures a pawn with his knight; Moriarty advances a bishop. A man smokes a cigar, and Sim studies potential assassins' faces. A hyperemic needle is hidden in a modified Winchester cartridge. Watson notices a photographer and deliberately causes a drink spill, drawing surprise from everyone except one man. Watson notes the man's hairline and fallen cigar, then signals Sim. The man reaches inside his jacket; Sim approaches him. Another assembles the hyperemic cartridge and shoves Sim, drawing a gun. Watson tackles him as he fires, and soldiers arrest him. The hyperemic cartridge is discreetly fired at Rene with a cane gun by Moran. Watson realizes something, checks on Rene, and discovers a hyperemic dart in his leg. Moran observes, smiling. Sim rushes to Rene as Watson notices Moran leaving. Watson tends to Rene, who's fading. On the balcony, Holmes appears troubled, shrugs off his blanket, and gazes at the chessboard as Moriarty checks his notebook."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Watson observes Moriarty leaving. Meanwhile, Holmes is drinking from a hip flask on a balcony. Moriarty joins, picks up a chess clock, and places it beside a chessboard. Holmes sits, Moriarty drapes blankets over them, exchanging smiles. Moriarty's smile fades as he starts the game with a white pawn and sets the clock. Inside, Watson and Sim mingle with guests. Holmes moves a black pawn. Watson and Sim regroup, watching delegates. Holmes' knight captures a pawn, and Moriarty advances a bishop. A man smokes a cigar, while Sim scans the crowd for assassins. A hyperemic needle is hidden in a Winchester case. Watson knocks drinks from a footman's tray, startling all but one man who drops his cigar. Watson notes his hairline, and Sim watches the man step away. As he reaches inside his jacket, Sim approaches him. Another man assembles the cartridge, shoves Sim, and draws a gun. Watson tackles him, and soldiers remove him. Rene gets shot with a hyperemic cartridge fired from Moran's cane. Watson rushes to Rene, removing the dart and tasting it. Moran watches smugly. Sim runs to Rene as Watson sees Moran leaving. Holmes appears troubled on the balcony, removing his blanket. Moriarty feels his notebook, running his thumb over it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Watson stands attentively, observing as Moriarty departs the scene. Nearby, the photographer remains focused on his task. Meanwhile, outside on the scenic balcony, Holmes enjoys a quiet moment, sipping from his hip flask. Amidst the serene surroundings, the rhythmic rocking and tumbling into the encroaching darkness occur nearby. Moriarty soon reemerges to join Holmes on the balcony. Surveying the scene, Moriarty proceeds to a table where a chess timing clock awaits. Deliberately, he places the clock strategically on another table that hosts a chessboard, preparing for a game. Holmes seats himself comfortably in a chair in front of the intricate board. Thoughtfully, Moriarty fetches a cozy blanket and gently wraps it around Holmes' shoulders. With equal care, he retrieves a second blanket and envelops his own shoulders warmth. Sharing a moment of camaraderie, Holmes and Moriarty exchange smiles, although Moriarty's expression soon turns serious and focused. He initiates the game, commencing with a calculated move of a white pawn, and promptly sets the time clock to manage the pace of their match. \n\nInside the bustling gathering, Watson and Sim navigate through the mingling guests, moving with purpose. Back on the balcony, Holmes advances a second black pawn on the chessboard, deepening the game. Within the lively interior, Watson reconnects with Sim, and together they cast observant glances at the gathered delegates. On the chessboard, Holmes' knight captures one of Moriarty's pawns. In response, Moriarty advances his bishop with precision. A man leisurely smokes a cigar, blending into the ambiance. Sim carefully studies the faces of those who might be potential assassins, aware of the danger. A hyperemic needle is concealed in a specially adapted Winchester cartridge case, adding to the tension. Watson scrutinizes the photographer, who is preparing to capture an image of the delegates. In a calculated move, Watson intentionally knocks a tray of drinks from a footman's grasp, causing a commotion as it crashes onto the hard marble floor. The sudden noise attracts the attention of all present, except for one man standing quietly in a corner. Watson examines the man's hairline and notices him dropping his cigar. Sim locks eyes on the man as he distances himself from the delegate he was conversing with. She glances at Watson, who subtly nods in acknowledgment. As the man reaches inside his jacket with his left hand, Sim decisively approaches him. Meanwhile, another individual continues methodically assembling the hyperemic cartridge. The man forcefully pushes Sim aside and reveals a gun. Watson reacts swiftly by tackling him as he attempts to fire a shot. Mycroft steps forward, his arms poised and ready to act. Soldiers promptly restrain the man, dragging him away. The hyperemic cartridge finds its place in a weapon, escalating the tension. As Rene is forcibly removed, Moran discreetly targets him with a hyperemic cartridge from a concealed gun hidden within his cane. A realization dawns on Watson, prompting him to dash out of the grand ballroom to join the soldiers stationed nearby, guarding Rene. Rene has collapsed, and the soldiers grant Watson access to tend to him as he convulses on the floor. With urgency, Watson discovers a hyperemic dart embedded in Rene's leg. He extracts it and samples the compound it injected to understand its effect. Moran observes with a concealed smile. Sim rushes to Rene's side as Watson notices Moran departing quietly. Watson refocuses on Rene, who is quickly fading. \n\nBack on the balcony, Holmes's demeanor shifts to one of concern, his thoughts troubled by recent events. Unsettled, Holmes leans back in his chair, contemplating the unfolding situation. Moriarty, decisive, shrugs off the blanket from his shoulders and positions himself on the table. Holmes, mirroring the action, removes his own blanket and turns his attention back to the chessboard, considering his next move. Moriarty, feeling for his trusty notebook, runs his thumb thoughtfully over the familiar top line while it rests securely in his pocket."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Watson, standing with a keen sense of attention, carefully watches as Moriarty makes his departure from the scene. Nearby, the photographer is deeply engrossed in his work, maintaining a steadfast focus on his task. Meanwhile, outside on the charming and beautifully designed balcony, Holmes enjoys a peaceful moment of solitude, sipping leisurely from his hip flask. Amidst these serene and tranquil surroundings, the rhythmic rocking and tumbling into the gradually encroaching darkness continues nearby. Moriarty soon makes his return to join Holmes on the inviting balcony. Surveying the scene with a keen eye, Moriarty makes his way to a table where a chess timing clock awaits his attention. With deliberate intention, he places the clock strategically on another table that is home to a finely crafted chessboard, clearly preparing for an impending game. Holmes seats himself comfortably, settling into a chair positioned in front of the intricately designed board. With a thoughtful demeanor, Moriarty fetches a cozy blanket, gently wrapping it around Holmes' shoulders for added warmth. With equal care and attention, he retrieves a second blanket, enveloping his own shoulders with its comforting warmth. Sharing a moment filled with camaraderie, Holmes and Moriarty exchange warm smiles, although Moriarty's expression soon transforms into one of seriousness and focused intent. He initiates the game by making a calculated move, choosing to advance a white pawn, and promptly sets the timing clock in motion to manage the pace of their intense match.\n\nInside the bustling and lively gathering, Watson and Sim navigate through the mingling guests, moving with a clear sense of purpose. Back on the scenic balcony, Holmes advances a second black pawn on the chessboard, further deepening the intricacies of the game. Within the lively and energetic interior, Watson reconnects with Sim, and together they cast observant, discerning glances at the delegates gathered there. On the chessboard, Holmes' knight captures one of Moriarty's pawns with precision. In response, Moriarty advances his bishop with careful accuracy. A man leisurely smokes a cigar, seamlessly blending into the ambiance of the setting. Sim carefully studies the faces of those who might be potential assassins, fully aware of the lurking danger. A hyperemic needle is concealed within a specially adapted Winchester cartridge case, adding an element of tension to the scene. Watson scrutinizes the photographer, who is diligently preparing to capture an image of the dignified delegates. In a calculated and deliberate move, Watson intentionally knocks a tray of drinks from a footman's grasp, causing a significant commotion as the contents crash onto the hard, cold marble floor. The sudden noise captures the attention of all present, except for one man who stands quietly in a corner. Watson examines the man's hairline and notices him dropping his cigar. Sim locks eyes on the man as he subtly distances himself from the delegate he was conversing with. She glances at Watson, who subtly nods in acknowledgment of her awareness. As the man reaches into his jacket with his left hand, Sim decisively approaches him with intent. Meanwhile, another individual continues methodically assembling the hyperemic cartridge in a calm yet deliberate manner. The man forcefully pushes Sim aside and reveals a gun, escalating the situation with a sudden burst of tension. Watson reacts swiftly, tackling him as he attempts to fire the weapon. Mycroft steps forward confidently, his arms poised and ready to take action. Soldiers quickly restrain the man, forcefully dragging him away to ensure the security of the gathering. The hyperemic cartridge finds its place in a weapon, further escalating the already heightened tension. As Rene is forcibly removed from the scene, Moran discreetly targets him with a hyperemic cartridge from a concealed gun cleverly hidden within his cane. A realization suddenly dawns on Watson, prompting him to dash out of the grand, elegant ballroom to join the soldiers stationed nearby, who are guarding Rene. Rene has collapsed, and the soldiers grant Watson urgent access to tend to him as he convulses violently on the floor. With urgency and determination, Watson discovers a hyperemic dart embedded in Rene's leg. He carefully extracts it and samples the compound it injected with the hope of understanding its potent effect. Moran observes the unfolding scene with a concealed, satisfied smile. Sim rushes to Rene's side as Watson takes note of Moran departing quietly. Watson refocuses his attention on Rene, whose condition is quickly deteriorating.\n\nBack on the balcony, Holmes's demeanor undergoes a noticeable shift to one of concern and worry, his thoughts troubled by the recent unsettling events. Feeling unsettled, Holmes leans back in his chair, lost in contemplation as he considers the unfolding situation. Moriarty, ever decisive, shrugs off the blanket from his shoulders and positions himself on the table with intent. Holmes, mirroring the action, removes his own blanket and turns his full attention back to the chessboard, carefully considering his next move. Moriarty, feeling for his trusty and well-worn notebook, runs his thumb thoughtfully over the familiar top line while it rests securely in his pocket, pondering the complexities of their ongoing match."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Watson stands attentively, observing every movement as Moriarty departs from the scene. Meanwhile, the photographer remains focused on capturing moments. Outside on the balcony, Holmes stands, gazing at his surroundings while intermittently sipping from a hip flask to savor the beverage. Nearby, a gentle rocking causes a back fall, leading to a stumble into the encroaching darkness on the balcony. As Moriarty emerges and approaches Holmes, he heads towards a table where he purposefully picks up a chess timing clock and places it decisively on another table next to a chessboard, setting the stage for the forthcoming game. Holmes approaches the setup, takes a moment to position himself comfortably, and then sits down facing the board, ready for the intellectual duel. Moriarty, attentive to the brisk weather, goes to collect a blanket, which he gently wraps around Holmes' shoulders with a caring gesture. Not forgetting his own comfort, Moriarty picks up a second blanket and wraps it around himself, sharing a mutual acknowledgment with Holmes as both offer a shared, brief smile. The lighthearted moment subsides as Moriarty's expression shifts to one of focus and determination. He initiates the game by decisively moving a white pawn forward, marking the beginning of their strategic encounter, before he methodically sets the time clock to track the progression of their game. As tension subtly builds outside, the scene shifts inside to Watson and Sim who weave through the gathered guests, maintaining a vigilant watch over the social dynamics. Back on the balcony, Holmes, embodying strategic prowess, moves a second black pawn with precise calculation. Rejoining Sim and Watson inside, their paths intersect once more as they cast observant glances towards the delegates, assessing their demeanor. A critical move unfolds outside as Holmes' knight skillfully captures one of Moriarty's pawns, met by Moriarty's strategic advancement of a bishop on the board. Inside, a man casually smokes a cigar, releasing wisps of smoke, while Sim intensively studies the potential assassins' expressions, assessing each face with increased scrutiny. Among these quiet tensions, a hyperemic needle lies hidden within a meticulously adapted Winchester cartridge case, an ominous hint at a hidden threat. Watson, perceptive as ever, scans the room just as the photographer prepares to capture the delegates in their formal stance. In a calculated maneuver, Watson purposefully knocks a tray of drinks from a footman's grasp, causing it to clatter noisily onto the polished marble floor, drawing the attention of everyone except one conspicuous man in the corner. With sharp attention to detail, Watson peers closely at the man's hairline, noting his reaction as he drops his cigar in apparent distraction. Sim, equally observant, focuses intently on the man as he discreetly disengages from the delegate he was conversing with, seeking to carry on unnoticed. With understanding, she exchanges a knowing glance with Watson, who acknowledges with a nod. Just as the man reaches inside his jacket with a swift left hand, Sim strategically intervenes, stepping up to him with intent. Meanwhile, another individual discreetly assembles the hyperemic cartridge, a foreboding development, before the man forcefully pushes Sim aside and draws his weapon. In the ensuing chaos, Watson swiftly tackles the man as he attempts to fire, with Mycroft stepping forward, prepared to act, as soldiers rapidly intervene to drag the assailant away. The hyperemic cartridge, ominously prepared, is loaded into another weapon in the midst of this action. As Rene is forcibly removed, Moran discreetly delivers a shot with a hyperemic cartridge from a surreptitiously concealed gun within his cane. This sudden shift prompts a realization in Watson, spurring him to promptly exit the ballroom. He hastens to join the soldiers guarding Rene, who has collapsed amidst the tumult. The soldiers permit Watson to attend to Rene, who writhes in convulsions on the floor. Quickly assessing the situation, Watson locates a hyperemic dart embedded in Rene's leg, which he promptly removes to inspect. In a moment of quick deduction, he tastes the compound injected into the dart, deciphering its contents. Watching from a distance, Moran observes with satisfaction, a smile hinting at his concealed intentions. Sim rushes urgently to Rene, concern etched on her face. Watson catches sight of Moran making his exit, drawing his attention back to Rene, who is rapidly losing strength. Meanwhile, on the balcony, a troubled expression shadows Holmes' face as he grapples with the unfolding events. Feeling unsettled, Holmes leans back into his chair, processing the gravity of the situation. In a moment of resignation, Moriarty lets the blanket fall from his shoulders and stands up from the table, signifying a shift. Holmes, disentangling himself from his own blanket, turns his focus back to the chessboard, contemplating his next move. Moriarty, in a subtle gesture, reaches for his notebook and runs his thumb thoughtfully over the top line, considering his next strategic maneuver."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Watson observes Moriarty departing while Holmes drinks from a hip flask on a balcony. Moriarty joins him, relocates a chess clock to a board, and drapes blankets around both of their shoulders. They exchange smiles before Moriarty's expression hardens and he begins the chess game by moving a white pawn. Inside, Watson and Sim circulate among the guests. Back outside, Holmes advances a black pawn. Inside again, Watson and Sim regroup and observe the delegates. Holmes captures a pawn with his knight, while Moriarty advances a bishop. Meanwhile, Sim scans potential assassins, noting a hyperemic needle hidden in a Winchester cartridge case. As the photographer prepares to take the delegates' photo, Watson deliberately causes a scene by knocking over a tray of drinks. Everyone turns in surprise except one man, prompting Watson and Sim to focus on him. The man draws a gun just as Sim approaches, leading Watson to tackle him, and soldiers intervene. Amidst the chaos, Moran secretly shoots Rene with a hyperemic cartridge from his cane. Realizing something, Watson rushes to Rene, now convulsing, and removes a hyperemic dart from his leg, tasting the compound. Moran watches with a smile, and as Sim approaches Rene, Watson notices Moran leaving. Meanwhile, on the balcony, Holmes appears troubled as he sits back and contemplates the chessboard while Moriarty removes his blanket and feels his notebook."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Watson watches as Moriarty, the infamous criminal mastermind with a sharp intellect, heads off. The photographer, who was hired by the event planners to capture the evening's proceedings, readies his camera. Holmes is outside on a balcony of the grand Victorian estate, drinking from a hip flask filled with a fine brandy he particularly favors. The rocking back fall stumble into the darkness nearby, perhaps caused by the estate's uneven cobblestones. Moriarty comes out and joins him under the stars. Moriarty goes to a table and picks up a chess timing clock, an antique from the 19th century, valued by collectors. He puts the clock on another intricately carved mahogany table beside a chessboard. Holmes takes a seat in front of the board, preparing to engage in their symbolic intellectual duel. Moriarty fetches a blanket, an heirloom from a Scottish clan, and puts it around Holmes' shoulders. Moriarty picks up a second blanket, also bearing the clan's tartan, and drapes it around his own shoulders. Holmes and Moriarty both smile, sharing a rare moment of camaraderie. Then Moriarty's expression hardens as he becomes serious. He starts by moving a white pawn, adhering to the classic strategy known as the King's Pawn Opening. He sets the time clock. Inside the elegant ballroom, Watson and Sim, his resourceful companion, move amongst the guests dressed in their finest attire. Outside on the balcony, Holmes advances a second black pawn on the chessboard, intricately inlaid with mother-of-pearl. Inside, Watson and Sim meet up again. They look over at the delegates, representatives from countries around the world gathered to discuss peace treaties. Holmes' knight takes one of Moriarty's pawns, strategically leveraging the knight's unique L-shaped movement. Moriarty advances a bishop, a piece named for its mitre shape. A man smokes a cigar, exhaling a cloud of rich, aromatic smoke. Sim studies the faces of the potential assassins, trained to notice even the smallest twitch of unease. A hyperemic needle, a sinister invention used for delivering a potent poison, is concealed inside an especially-adapted Winchester cartridge case, known for its reliability. Watson glances around the photographer about to take the delegates' photo with the vintage camera, its flash powder ready to explode in a burst of light. Watson deliberately knocks a tray of drinks out of a footman's hands, a diversion tactic he learned during his military service. As it crashes onto the marble floor, everyone looks around in surprise except one man in the corner who remains suspiciously calm. Watson peers at the man's hairline, noticing the telltale sign of a disguise just as the man drops his cigar. Sim stares at the man as he steps away from the delegate he was talking to, her instincts honed from years of undercover work. She looks over at Watson, who nods, confirming their shared suspicion. The man reaches inside his jacket with his left hand just as Sim steps up to him, her movements quick and deliberate. Another man continues assembling the hyperemic cartridge, racing against time. He shoves her aside and draws a gun, an old revolver with an ornate grip. Watson tackles him as he takes a shot, using techniques from his boxing days. Mycroft, Holmes' equally brilliant brother, steps forward with his arms ready for action. Soldiers drag him away, maintaining order in the chaos. The hyperemic cartridge is loaded into a weapon, a custom-made contraption. As Rene, the suspect, is dragged away, Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun cleverly hidden in his cane, a weapon of his own design. Something occurs to Watson, a flash of insight. He runs out of the ballroom and joins the soldiers guarding Rene, who's collapsed. The soldiers allow him to tend to Rene, who's convulsing on the floor, the poison taking effect. Watson quickly finds a hyperemic dart lodged in Rene's leg, recognizing the deadly toxin. He pulls it out and tastes the compound it's injected, his medical training kicking in. Moran watches with a smile, confident in his deception. Sim runs to Rene, her concern evident. Watson spots Moran leaving, determined to pursue him. He turns back to Rene, who's fading fast, the clock ticking. On the balcony, Holmes looks troubled, sensing the shifting balance of the evening. Unsettled, Holmes sits back in his chair, contemplating their next move. Moriarty shrugs the blanket off her shoulders and gets up on the table, his eyes glinting with mischief. Holmes removes his blanket and looks at the chessboard, the game mirroring their mental battle. Moriarty feels for his notebook, where he records his meticulous plans, and runs his thumb over the top line in his pocket, reassured by the familiar texture."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Watson watches as Moriarty heads off. The photographer. Holmes is outside on a balcony drinking from a hip flask. The rocking back fall stumble into the darkness nearby. Moriarty comes out and joins him. Moriarty goes to a table and picks up a chess timing clock. He puts the clock on another table beside a chessboard. Holmes takes a seat in front of the board. Moriarty fetches a blanket and puts it around Holmes' shoulders. Moriarty picks up a second blanket and drapes it around his own shoulders. Holmes and Moriarty both smile. Then Moriarty's expression hardens. He starts by moving a white pawn. He sets the time clock. Inside. Watson and Sim move amongst the guests. Outside on the balcony Holmes advances a second black pawn on the game of chess. Inside. Watson and Sim meet up again. They look over at the delegates. Holmes' knight takes one of Moriarty's pawns. Moriarty advances a bishop. A man smokes a cigar. Sim studies the faces of the potential assassins. A hyperemic needle is concealed inside an especiallyadapted Winchester cartridge case. Watson glances around the photographer about to take the delegates' photo. Watson deliberately knocks a tray of drinks out of a footman's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. As it crashes onto the marble floor everyone looks around in surprise except one man in the corner. Watson peers at the man's hairline and notes that he drops his cigar. Sim stares at the man as he steps away from the delegate he was talking to. She looks over at Watson who nods. The man reaches inside his jacket with his left hand just as Sim steps up to him. Another man continues assembling the hyperemic cartridge. He shoves her aside and draws a gun. Watson tackles him as he takes a shot. Mycroft steps forward and his arms ready. Soldiers drag him away. The hyperemic cartridge is loaded into a weapon. As Rene is dragged away Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane. Something occurs to Watson. He runs out of the ballroom and joins the soldiers guarding Rene. He is collapsed. The soldiers allowed him to tend to Rene who is convulsing on the floor. Watson quickly finds a hyperemic dart lodged in Rene's leg. He pulls it out and tastes the compound it is injected. Moran watches with a smile. Sim runs to Rene. Watson spots Moran leaving. He turns back to Rene who is fading fast. On the balcony Holmes looks troubled. Unsettled. Holmes sits back in his chair. Moriarty shrugs the blanket off her shoulders and gets up on the table. Holmes removes his blanket and looks at the chessboard. Moriarty feels for his notebook and runs his thumb over the top line in his pocket."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Watson watches as Moriarty heads off. The photographer. Holmes is outside on a balcony drinking from a hip flask. The rocking back fall stumble into the darkness nearby. Moriarty comes out and joins him. Moriarty goes to a table and picks up a chess timing clock. He puts the clock on another table beside a chessboard. Holmes takes a seat in front of the board. Moriarty fetches a blanket and puts it around Holmes' shoulders. Moriarty picks up a second blanket and drapes it around his own shoulders. Holmes and Moriarty both smile. Then Moriarty's expression hardens. He starts by moving a white pawn. He sets the time clock. Inside. Watson and Sim move amongst the guests. Outside on the balcony Holmes advances a second black pawn on the game of chess. Inside. Watson and Sim meet up again. They look over at the delegates. Holmes' knight takes one of Moriarty's pawns. Moriarty advances a bishop. A man smokes a cigar. Sim studies the faces of the potential assassins. A hyperemic needle is concealed inside an especiallyadapted Winchester cartridge case. Watson glances around the photographer about to take the delegates' photo. Watson deliberately knocks a tray of drinks out of a footman's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. As it crashes onto the marble floor everyone looks around in surprise except one man in the corner. Watson peers at the man's hairline and notes that he drops his cigar. Sim stares at the man as he steps away from the delegate he was talking to. She looks over at Watson who nods. The man reaches inside his jacket with his left hand just as Sim steps up to him. Another man continues assembling the hyperemic cartridge. He shoves her aside and draws a gun. Watson tackles him as he takes a shot. Mycroft steps forward and his arms ready. Soldiers drag him away. The hyperemic cartridge is loaded into a weapon. As Rene is dragged away Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane. Something occurs to Watson. He runs out of the ballroom and joins the soldiers guarding Rene. He is collapsed. The soldiers allowed him to tend to Rene who is convulsing on the floor. Watson quickly finds a hyperemic dart lodged in Rene's leg. He pulls it out and tastes the compound it is injected. Moran watches with a smile. Sim runs to Rene. Watson spots Moran leaving. He turns back to Rene who is fading fast. On the balcony Holmes looks troubled. Unsettled. Holmes sits back in his chair. Moriarty shrugs the blanket off her shoulders and gets up on the table. Holmes removes his blanket and looks at the chessboard. Moriarty feels for his notebook and runs his thumb over the top line in his pocket."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Watson watches as Moriarty heads off. The photographer. Holmes is outside on a balcony drinking from a hip flask. The rocking back fall stumble into the darkness nearby. Moriarty comes out and joins him. Moriarty goes to a table and picks up a chess timing clock. He puts the clock on another table beside a chessboard. Holmes takes a seat in front of the board. Moriarty fetches a blanket and puts it around Holmes' shoulders. Moriarty picks up a second blanket and drapes it around his own shoulders. Holmes and Moriarty both smile. Then Moriarty's expression hardens. He starts by moving a white pawn. He sets the time clock. He is collapsed. The soldiers allowed him to tend to Rene who is convulsing on the floor. Watson quickly finds a hyperemic dart lodged in Rene's leg. He pulls it out and tastes the compound it is injected. Moran watches with a smile. Sim runs to Rene. Watson spots Moran leaving. He turns back to Rene who is fading fast. On the balcony Holmes looks troubled. Unsettled. Holmes sits back in his chair. Moriarty shrugs the blanket off her shoulders and gets up on the table. Holmes removes his blanket and looks at the chessboard. Moriarty feels for his notebook and runs his thumb over the top line in his pocket."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Watson watches as Moriarty heads off. The photographer. Holmes is outside on a balcony drinking from a hip flask. The rocking back fall stumble into the darkness nearby. Moriarty comes out and joins him. On the balcony Holmes looks troubled. Unsettled. Holmes sits back in his chair. Moriarty shrugs the blanket off her shoulders and gets up on the table. Holmes removes his blanket and looks at the chessboard. Moriarty feels for his notebook and runs his thumb over the top line in his pocket."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Garfield observes as Odie wanders away. The painter. Jon is inside on a veranda, sipping from a teacup. The rocking chair tilts over, tumbling into the light nearby. Odie enters and greets him. Odie approaches a countertop and grabs a timer. He places the timer on a different countertop beside a scrabble board. Jon settles in front of the board. Odie retrieves a scarf and drapes it around Jon's neck. Odie grabs another scarf and wraps it around his own neck. Jon and Odie both grin. Then Odie's demeanor shifts. He begins by shifting a red tile. He activates the timer. Inside, Garfield and Liz weave among the attendees. Outside on the veranda, Jon shifts another blue tile in the scrabble game. Inside, Garfield and Liz reunite. They glance at the speakers. Jon's rook captures one of Odie's tiles. Odie shifts a rook. A person chews gum. Liz examines the expressions of the possible traitors. A paperclip is hidden inside a specially-designed pen case. Garfield scans around the painter ready to sketch the speakers. Garfield purposefully bumps a platter of appetizers from a butler's grip. As it clatters onto the wooden floor, everyone turns in confusion except one woman in the corner. Garfield scrutinizes the woman's shoes and observes that she drops her gum. Liz watches the woman as she moves away from the speaker she was chatting with. She glances over at Garfield, who nods. The woman reaches into her purse with her right hand just as Liz approaches her. Another person continues constructing the paperclip case. He pushes her aside and retrieves a flashlight. Garfield tackles him as he makes a flash. Nermal advances with his hands ready. Guards escort him away. The paperclip case is inserted into a gadget. As Binky is led away, Arlene stealthily flashes him with a paperclip case activated from a flashlight concealed in her umbrella. A thought crosses Garfield's mind. He dashes out of the living room and joins the guards watching Binky. He's collapsed. The guards allow him to attend to Binky who's shivering on the ground. Garfield quickly discovers a paperclip lodged in Binky's sock. He extracts it and sniffs the substance it's coated with. Arlene observes with a grin. Liz rushes to Binky. Garfield notices Arlene departing. He turns back to Binky who's weakening rapidly. On the veranda. Jon appears worried. Disconcerted, Jon reclines in his seat. Odie shrugs the scarf off his neck and stands on the countertop. Jon removes his scarf and gazes at the scrabble board. Odie reaches for his diary and rubs his finger over the bottom line in his case."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Watson observes as Moriarty departs. Holmes, drinking on the balcony, is joined by Moriarty, who sets up a chessboard and a timing clock. Both men wrap themselves in blankets and begin a tense game, with Moriarty starting with a white pawn. Inside, Watson and Sim navigate the guests, with Watson knocking over a tray to distract from a potential assassin. Sim confronts the suspect, who draws a gun but is tackled by Watson. Meanwhile, a hyperemic cartridge is secretly loaded into a weapon. Rene, an accomplice, is shot with the dart and collapses. Watson discovers the dart in Rene's leg and identifies the compound. Moran, the shooter, smirks as Watson realizes the plot. On the balcony, Holmes appears troubled, and Moriarty checks his notebook, signifying ongoing tension."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Moriarty feels for his notebook and runs his thumb over the top line in his pocket Holmes removes his blanket and looks at the chessboard Moriarty shrugs the blanket off her shoulders and gets up on the table Holmes sits back in his chair Unsettled On the balcony Holmes looks troubled He turns back to Rene who is fading fast Watson spots Moran leaving Sim runs to Rene Moran watches with a smile He pulls it out and tastes the compound it is injected Watson quickly finds a hyperemic dart lodged in Rene's leg The soldiers allowed him to tend to Rene who is convulsing on the floor He is collapsed He runs out of the ballroom and joins the soldiers guarding Rene Something occurs to Watson As Rene is dragged away Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane The hyperemic cartridge is loaded into a weapon Soldiers drag him away Mycroft steps forward and his arms ready Watson tackles him as he takes a shot He shoves her aside and draws a gun Another man continues assembling the hyperemic cartridge The man reaches inside his jacket with his left hand just as Sim steps up to him She looks over at Watson who nods Sim stares at the man as he steps away from the delegate he was talking to Watson peers at the man's hairline and notes that he drops his cigar As it crashes onto the marble floor everyone looks around in surprise except one man in the corner Watson deliberately knocks a tray of drinks out of a footman's hands Watson glances around the photographer about to take the delegates' photo A hyperemic needle is concealed inside an especiallyadapted Winchester cartridge case Sim studies the faces of the potential assassins A man smokes a cigar Moriarty advances a bishop Holmes' knight takes one of Moriarty's pawns They look over at the delegates Watson and Sim meet up again Inside Outside on the balcony Holmes advances a second black pawn on the game of chess Watson and Sim move amongst the guests Inside He sets the time clock He starts by moving a white pawn Then Moriarty's expression hardens Holmes and Moriarty both smile Moriarty picks up a second blanket and drapes it around his own shoulders Moriarty fetches a blanket and puts it around Holmes' shoulders Holmes takes a seat in front of the board He puts the clock on another table beside a chessboard Moriarty goes to a table and picks up a chess timing clock Moriarty comes out and joins him The rocking back fall stumble into the darkness nearby Holmes is outside on a balcony drinking from a hip flask The photographer Watson watches as Moriarty heads off"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The photographer Watson watches as Moriarty heads off The rocking back fall stumble into the darkness nearby Holmes is outside on a balcony drinking from a hip flask Moriarty goes to a table and picks up a chess timing clock Moriarty comes out and joins him Holmes takes a seat in front of the board He puts the clock on another table beside a chessboard Moriarty picks up a second blanket and drapes it around his own shoulders Moriarty fetches a blanket and puts it around Holmes' shoulders Then Moriarty's expression hardens Holmes and Moriarty both smile He sets the time clock He starts by moving a white pawn Watson and Sim move amongst the guests Inside Inside Outside on the balcony Holmes advances a second black pawn on the game of chess They look over at the delegates Watson and Sim meet up again Moriarty advances a bishop Holmes' knight takes one of Moriarty's pawns Sim studies the faces of the potential assassins A man smokes a cigar Watson glances around the photographer about to take the delegates' photo A hyperemic needle is concealed inside an especiallyadapted Winchester cartridge case As it crashes onto the marble floor everyone looks around in surprise except one man in the corner Watson deliberately knocks a tray of drinks out of a footman's hands Sim stares at the man as he steps away from the delegate he was talking to Watson peers at the man's hairline and notes that he drops his cigar The man reaches inside his jacket with his left hand just as Sim steps up to him She looks over at Watson who nods He shoves her aside and draws a gun Another man continues assembling the hyperemic cartridge Mycroft steps forward and his arms ready Watson tackles him as he takes a shot The hyperemic cartridge is loaded into a weapon Soldiers drag him away Something occurs to Watson As Rene is dragged away Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane He is collapsed He runs out of the ballroom and joins the soldiers guarding Rene Watson quickly finds a hyperemic dart lodged in Rene's leg The soldiers allowed him to tend to Rene who is convulsing on the floor Moran watches with a smile He pulls it out and tastes the compound it is injected Watson spots Moran leaving Sim runs to Rene On the balcony Holmes looks troubled He turns back to Rene who is fading fast Holmes sits back in his chair Unsettled Holmes removes his blanket and looks at the chessboard Moriarty shrugs the blanket off her shoulders and gets up on the table Moriarty feels for his notebook and runs his thumb over the top line in his pocket"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Watson peers at the man's hairline and notes that he drops his cigar Sim stares at the man as he steps away from the delegate he was talking to She looks over at Watson who nods The man reaches inside his jacket with his left hand just as Sim steps up to him Another man continues assembling the hyperemic cartridge He shoves her aside and draws a gun Watson tackles him as he takes a shot Mycroft steps forward and his arms ready Soldiers drag him away The hyperemic cartridge is loaded into a weapon As Rene is dragged away Moran surreptitiously shoots him with a hyperemic cartridge fired from a gun hidden in his cane Something occurs to Watson He runs out of the ballroom and joins the soldiers guarding Rene He is collapsed The soldiers allowed him to tend to Rene who is convulsing on the floor Watson quickly finds a hyperemic dart lodged in Rene's leg He pulls it out and tastes the compound it is injected Moran watches with a smile Sim runs to Rene Watson spots Moran leaving He turns back to Rene who is fading fast On the balcony Holmes looks troubled Unsettled Holmes sits back in his chair Moriarty shrugs the blanket off her shoulders and gets up on the table Holmes removes his blanket and looks at the chessboard Moriarty feels for his notebook and runs his thumb over the top line in his pocket Watson watches as Moriarty heads off The photographer Holmes is outside on a balcony drinking from a hip flask The rocking back fall stumble into the darkness nearby Moriarty comes out and joins him Moriarty goes to a table and picks up a chess timing clock He puts the clock on another table beside a chessboard Holmes takes a seat in front of the board Moriarty fetches a blanket and puts it around Holmes' shoulders Moriarty picks up a second blanket and drapes it around his own shoulders Holmes and Moriarty both smile Then Moriarty's expression hardens He starts by moving a white pawn He sets the time clock Inside Watson and Sim move amongst the guests Outside on the balcony Holmes advances a second black pawn on the game of chess Inside Watson and Sim meet up again They look over at the delegates Holmes' knight takes one of Moriarty's pawns Moriarty advances a bishop A man smokes a cigar Sim studies the faces of the potential assassins A hyperemic needle is concealed inside an especiallyadapted Winchester cartridge case Watson glances around the photographer about to take the delegates' photo Watson deliberately knocks a tray of drinks out of a footman's hands As it crashes onto the marble floor everyone looks around in surprise except one man in the corner"
        }
      ]
    }
  ]
}