{
  "ground_truth": "In his mind, he sees the action about to unfold. The men eye their leader, who makes a cutthroat gesture to them. In his mind, Holmes sees a thug with a pocket watch take out a knuckleduster, a knife being thrust at Holmes, another attacker with a knuckleduster, and a third with a club. The gang's leader has a gun. Holmes opens his eyes and lives the action. A blond thug tosses an apple. Holmes thwarts the knife thrust and spins the thug, forcing the blade into another. He throws the man with the club and snatches the gun from the leader's hand. Holmes catches the apple as it falls and tosses it to the hapless leader. Holmes empties the gun and hands it back. He makes to attack the leader, who shrinks back. Holmes jogs off. On foot, Irene Adler enters the auctioneers, Cromwell and Griff. She hands the package to a mature man, who gives her a letter. The doctor starts to open the package. Irene rises. He holds her back. She sits. Holmes stops a sprung switch. Holmes kisses her and teases the letter from her. The doctor removes a banknote from the package, revealing dynamite. His pipe ignites a tapestry. The auction house clears. Irene heads out. She tries to retrieve the letter. Irene goes. Holmes takes the ticking package from the doctor. He runs to the sarcophagus. The bomb exploded in the closed sarcophagus. The doctor has gone. Outside, the scruffy Holmes draws glances from a well-dressed queue of people. A bearded man in a tweed suit watches him closely. Holmes turns, and the man looks away. Holmes, the back of his Oriental jacket covered in dust from the explosion, spots the doctor slumped against a wall. He feels for a pulse, then notices a tiny dart in the man's thigh. He examines the dart, then turns. The bearded man has disappeared. Holmes places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. Irene Adler is led to a table in the center of the restaurant and sits by a curtain, shielding her from a nearby table. She turns to the waiter. From the table behind the curtain, her tea is poured. The bearded man in the tweed suit watches the speaker. The bearded man clinks a teaspoon against a glass, and all the clientele and staff, with the exception of him and the man behind the curtain, rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes, then glances down at her cup. The man has a rattled face and sports a beard.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In his mind, he perceives the act about to happen. The men regard their chief, who makes a ruthless sign to them. In his mind, Holmes perceives a ruffian with a pocket watch remove a knuckleduster, a dagger being driven at Holmes, another assailant with a knuckleduster, and a third with a club. The gang's chief has a firearm. Holmes opens his eyes and experiences the act. A blond ruffian tosses an apple. Holmes foils the dagger drive and spins the ruffian, forcing the blade into another. He hurls the man with the club and plucks the firearm from the chief's hand. Holmes catches the apple as it descends and tosses it to the helpless chief. Holmes empties the firearm and hands it back. He makes to assault the chief, who shrinks back. Holmes jogs off. On foot, Irene Adler enters the auctioneers, Cromwell and Griff. She hands the parcel to a mature man, who gives her a note. The doctor starts to open the parcel. Irene rises. He holds her back. She sits. Holmes halts a sprung switch. Holmes kisses her and teases the note from her. The doctor removes a banknote from the parcel, uncovering dynamite. His pipe ignites a hanging. The auction house clears. Irene heads out. She tries to retrieve the note. Irene departs. Holmes takes the ticking parcel from the doctor. He runs to the tomb. The bomb detonated in the closed tomb. The doctor has gone. Outside, the scruffy Holmes draws glances from a well-dressed queue of individuals. A bearded man in a tweed suit observes him closely. Holmes turns, and the man looks away. Holmes, the back of his Oriental jacket covered in dust from the detonation, spots the doctor slumped against a wall. He feels for a pulse, then notices a tiny dart in the man's thigh. He scrutinizes the dart, then turns. The bearded man has vanished. Holmes places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. Irene Adler is led to a table in the center of the restaurant and sits by a drape, shielding her from a nearby table. She turns to the server. From the table behind the drape, her tea is poured. The bearded man in the tweed suit watches the speaker. The bearded man clinks a teaspoon against a glass, and all the patrons and staff, with the exception of him and the man behind the drape, rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the drape draws it open. Irene closes her eyes, then glances down at her cup. The man has a troubled face and sports a beard."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In his mind, the action about to unfold is seen by him. Their leader is eyed by the men, who are given a cutthroat gesture by him. In his mind, Holmes sees a knuckleduster being taken out by a thug with a pocket watch, a knife being thrust at him, and another attacker has a knuckleduster, while a third one has a club. A gun is held by the gang's leader. His eyes are opened by Holmes, and the action is lived by him. An apple is tossed by a blond thug. The knife thrust is thwarted by Holmes, and the thug is spun by him, forcing the blade into another. The man with the club is thrown by him, and the gun is snatched from the leader's hand. The apple is caught by Holmes as it falls and is tossed to the hapless leader. The gun is emptied by Holmes and handed back. He makes to attack the leader, who shrinks back. Holmes jogs off. On foot, the auctioneers, Cromwell and Griff, are entered by Irene Adler. A package is handed by her to a mature man, who gives her a letter. The package is started to open by the doctor. Irene rises. She is held back by him. She sits. A sprung switch is stopped by Holmes. She is kissed by Holmes, and the letter is teased from her by him. A banknote is removed by the doctor from the package, revealing dynamite. A tapestry is ignited by his pipe. The auction house is cleared. Irene heads out. She tries to retrieve the letter. She goes. The ticking package is taken by Holmes from the doctor. He runs to the sarcophagus. The bomb explodes in the closed sarcophagus. The doctor had gone. Outside, glances are drawn by the scruffy Holmes from a well-dressed queue of people. He is watched closely by a bearded man in a tweed suit. Holmes turns, and away looks the man. The back of his Oriental jacket, covered in dust from the explosion, is spotted by Holmes, slumped against a wall. He feels for a pulse, then a tiny dart in the man's thigh is noticed by him. The dart is examined by him, then he turns. The bearded man has disappeared. The dart is placed by Holmes in his bag. The ceiling of a grand restaurant is elaborately embossed. Irene Adler is led to a table in the center of the restaurant and sits by a curtain, shielding her from a nearby table. She turns to the waiter. Her tea is poured from the table behind the curtain. The speaker is watched by the bearded man in the tweed suit. A teaspoon is clinked against a glass by the bearded man, and all the clientele and staff, with the exception of him and the man behind the curtain, rise and leave the dining room. Sipping her tea is stopped by Irene, and her anxious glances are cast around as the place empties. The curtain is drawn open by the man behind it. Her eyes are closed by Irene, then her cup is glanced down at by her. The man has a rattled face and sports a beard."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In his mind, Holmes envisions the upcoming action. The men watch their leader make a cutthroat sign. Holmes imagines a thug with a pocket watch wielding a knuckleduster, a knife aimed at him, another thug with a knuckleduster, and a third with a club. The leader is armed with a gun. Holmes opens his eyes and acts. A blond thug tosses an apple. Holmes deflects the knife, spins the thug, directing the blade into another. He disarms the club-wielder and takes the leader's gun. Holmes catches the apple and hands the unloaded gun back. The leader retreats as Holmes advances, then jogs away. Irene Adler enters Cromwell and Griff, hands a package to a man who gives her a letter. The doctor begins opening the package. Irene rises, but he holds her back. Holmes prevents a switch from activating. He kisses Irene and playfully takes the letter. The doctor removes a banknote, revealing dynamite. The ignited tapestry causes evacuation. Irene exits, trying to get the letter, and Holmes takes the ticking package to a sarcophagus, where it explodes. The doctor disappears. Outside, dusty Holmes is observed by a queue. A bearded man in a tweed suit watches him. Holmes checks the slumped doctor for a pulse, finds a tiny dart in his thigh, examines it, and notices the bearded man is gone. Holmes places the dart in his bag. In a grand restaurant, Irene sits at a central table, shielded by a curtain. A bearded man in tweed observes the speaker behind the curtain. He clinks a teaspoon, prompting everyone except him and the man behind the curtain to leave. Irene anxiously stops sipping her tea and looks around as the room empties. The man behind the curtain opens it. Irene closes her eyes, then looks at her cup. The man has a rattled face and a beard."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes envisions a clash: a thug with a pocket watch pulls a knuckleduster, a knife targets Holmes, another brandishes a club, and the leader wields a gun. Holmes acts: he deflects the knife, spins the attacker, disarms the club wielder, and retrieves the gun. He returns the empty gun, confronts the leader, then leaves. Irene Adler enters Cromwell and Griff, trades a package for a letter. The doctor begins to open it; Irene stays seated as a banknote and dynamite are revealed, igniting a tapestry. The auction house clears; she exits, attempts to reclaim the letter. Holmes intercepts the package, detonates it in a sarcophagus, and finds the doctor dead, dart in thigh. The bearded man vanishes. Holmes keeps the dart. In a grand restaurant, Irene sits by a curtain. The bearded man signals the room to empty, leaving only him and the man behind the curtain. Irene stops drinking tea as the room empties. The curtain opens; she closes her eyes, then looks down at her cup. The rattled man has a beard."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Within the depths of his mind, Holmes envisions the impending action about to unfold with striking clarity. The men around him cast their eyes toward their leader, who communicates wordlessly with a decisive cutthroat gesture. In his vivid imagination, Holmes visualizes a thug holding a pocket watch as he brings forth a menacing knuckleduster, a gleaming knife being thrust in Holmes's direction, yet another attacker brandishing a knuckleduster, and a third ominous figure armed with a threatening club. The commanding presence of the gang's leader holds a menacing gun. Holmes snaps his eyes open and is immediately thrust into the midst of the action. A blond thug, with a mischievous air, casually tosses an apple. Holmes expertly counters the impending knife thrust, spinning the thug around so that the blade inadvertently finds another. With swift precision, he propels the man wielding the club across the scene and deftly seizes the gun from the leader's grasp. With perfect timing, Holmes catches the apple mid-descent and nonchalantly tosses it back to the unsuspecting leader. He then empties the gun of its threats and courteously returns it. He prepares to confront the leader with an attack, and the leader, finding himself overwhelmed, shrinks back in apprehension. Holmes, with a confident stride, jogs off into the distance.\n\nMeanwhile, on foot, Irene Adler makes her entrance into the distinguished auctioneers known as Cromwell and Griff. She confidently hands over the package she carries to a seasoned, mature man who, in return, presents her with a letter. As the doctor begins to open the package, Irene rises from her seat. The doctor, in a gesture of caution, holds her back, prompting her to sit once more. Holmes intervenes, stopping a sprung switch from causing harm. He tenderly kisses Irene and, with subtle dexterity, teases the letter from her possession. The doctor proceeds to extract a banknote from the package, only to reveal the ominous presence of dynamite. His smoldering pipe inadvertently ignites a tapestry, causing the auction house to become a scene of urgency as it quickly clears out. Irene, seizing the moment, heads towards the exit, attempting to retrieve the letter. With determination, she departs. Holmes takes decisive action, carrying the ticking package from the doctor and sprinting towards the sarcophagus. The explosion is contained within the confines of the closed sarcophagus. In the aftermath, the doctor has vanished. Outside, the scruffy appearance of Holmes, dusted from the explosion, draws curious glances from a nearby queue of well-dressed individuals. A bearded man clad in a tweed suit observes him attentively. Holmes turns to face him, prompting the man to divert his gaze elsewhere. Holmes, with the back of his Oriental jacket covered in dust from the explosion, spots the doctor slumped against a wall. He checks for a pulse, then notices a tiny dart embedded in the man's thigh. He examines this dart closely before turning around. The bearded man has mysteriously disappeared. Holmes, with methodical care, places the dart into his bag.\n\nThe scene shifts to the ornately embossed ceiling of an exquisitely grand restaurant. Irene Adler is gracefully led to a central table within the restaurant and takes a seat near the curtain, which shields her from the view of a nearby table. She gestures towards the waiter, and from the table concealed behind the curtain, her tea is elegantly poured. The bearded man in the tweed suit continues his watchful surveillance, observing the speaker intently. He lightly taps a teaspoon against his glass, creating a subtle clinking sound, signaling the clientele and staff—except for him and the man behind the curtain—to rise and vacate the dining room discreetly. Irene pauses mid-sip, anxiously surveying her surroundings as the room empties of its occupants. The man behind the curtain deliberately draws it open. Irene closes her eyes momentarily, then lowers her gaze to her cup in contemplation. The man, now visible, sports a rattled, strained expression, accompanied by a distinctive beard."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Within the intricate recesses of his brilliant mind, Holmes conjures a vivid mental picture of the imminent sequence of events, unfolding with striking and almost disconcerting clarity. The men standing in close proximity to him turn their eyes toward their imposing leader, who communicates with them in silence through a decisive, throat-slitting gesture, signifying his authoritative intent. In this vivid realm of imagination, Holmes sees a thug gripping a pocket watch while simultaneously producing a dangerous-looking knuckleduster. He envisions another gleaming knife being menacingly thrust in his own direction, a second attacker brandishing yet another vicious knuckleduster, and a third ominous figure armed with a threatening and weighty club. The dominating presence of the gang leader instills fear as he wields a menacing gun. Reality snaps back as Holmes flings his eyes open, immediately finding himself thrust into the heart of the unfolding drama. A blond thug, with a mischievous air about him, nonchalantly tosses an apple into the air. Holmes, with his characteristic ingenuity, expertly counters the impending knife thrust, deftly spinning the thug around so that the blade inadvertently strikes another thug. With swift precision, he propels the man who wields the club across the scene and deftly seizes the gun directly from the leader's grasp. With impeccable timing, Holmes catches the apple as it descends and casually tosses it back at the unsuspecting leader. He then empties the gun of any impending threats and courteously returns it. Holmes readies himself to confront the leader with an attack, and the leader, suddenly overwhelmed, recoils back in apprehensive retreat. With a self-assured stride, Holmes jogs away from the scene and into the distance.\n\nMeanwhile, making her way on foot, Irene Adler steps into the esteemed establishment of Cromwell and Griff, known for their distinguished auctioneering services. With an air of confidence, she hands over the package she carries to an older, experienced man, who, in return, offers her a letter. As the doctor begins to open the package, Irene rises from her seated position. The doctor, in a cautious gesture, holds her back, prompting her to take her seat once again. Holmes, entering the scene, intervenes just in time to prevent a dangerous switch from causing harm. He tenderly kisses Irene and, with a subtle dexterity, teases the letter from her possession. The doctor continues by extracting a banknote from within the package, only to uncover the sinister presence of dynamite hidden inside. His smoldering pipe inadvertently ignites a nearby tapestry, transforming the auction house into a scene of urgency and chaos as it rapidly clears of its occupants. Seizing the opportunity, Irene makes her way towards the exit, with the intention of retrieving the letter. Resolutely, she departs the scene. Holmes takes decisive action by carrying the ticking package away from the doctor, sprinting towards the safety of a sarcophagus. The imminent explosion is effectively contained within the confines of the closed sarcophagus. In the aftermath, the doctor has mysteriously vanished. Outside, the scruffy appearance of Holmes, now dusted from the blast, captures the curious glances of a nearby queue of impeccably dressed individuals. A bearded man, clad in a classic tweed suit, observes him intently. Holmes turns to face this man, prompting him to quickly divert his gaze elsewhere. With the back of his Oriental jacket covered in dust from the explosion, Holmes spots the doctor slumped against a wall. He checks for a pulse, noticing a tiny dart embedded in the man's thigh. Holmes examines this dart meticulously before turning around, only to find that the bearded man has mysteriously disappeared. With methodical care, Holmes places the dart safely into his bag.\n\nThe scene transitions to the intricately embossed ceiling of a magnificently grand restaurant. Irene Adler is gracefully led to a central table within the sumptuous dining area and takes her seat near a curtain, which discreetly shields her from the view of a nearby table. She gestures towards the attentive waiter, and from the table hidden behind the curtain, her tea is poured with elegant precision. The bearded man in the tweed suit maintains his watchful surveillance, observing the speaker with intense focus. He lightly taps a teaspoon against his glass, creating a subtle clinking sound, signaling the clientele and staff—except for himself and the man behind the curtain—to rise and discreetly vacate the dining room. Irene pauses mid-sip, anxiously surveying her surroundings as the room empties of its other occupants. The man behind the curtain, with deliberate intention, draws it open. Irene momentarily closes her eyes, then lowers her gaze to her cup in thoughtful contemplation. The now-visible man wears a rattled, strained expression, accompanied by his distinctive beard."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In his mind, he vividly envisions the imminent action sequence. The men fixate on their leader, who signals them with a menacing cutthroat gesture, subtly conveying his intentions. In Holmes's imagination, he perceives a thug discreetly pulling out a pocket watch before revealing a knuckleduster, then envisions a menacing knife being thrust directly at him, followed by another assailant brandishing a knuckleduster, and a third armed with a hefty club. The leader of the gang ominously wields a gun. Holmes opens his eyes, transitioning from thought to reality, and braces himself as the action materializes. A blond thug casually tosses an apple through the air. In a swift, calculated move, Holmes deflects the incoming knife thrust, skillfully spinning the assailant around to redirect the blade into another attacker. He deftly throws the man wielding the club aside and simultaneously snatches the gun from the leader's grip. As the apple gracefully descends, Holmes catches it with ease and casually tosses it back to the bewildered leader. He empties the gun of its bullets before nonchalantly handing it back. Preparing to launch an attack at the leader, Holmes observes the man recoil in fear, then promptly jogs away from the scene. Meanwhile, Irene Adler enters the auctioneers' establishment, Cromwell and Griff, on foot. She presents a package to a mature man who reciprocates by handing her a letter. As the doctor begins to open the package, Irene rises instinctively, prompting him to gently restrain her, urging her to remain seated. Holmes intervenes by halting a triggered switch, then plants a kiss on her cheek while deftly extracting the letter from her grasp. The doctor cautiously removes a banknote from the package, inadvertently unveiling dynamite hidden beneath. His smoldering pipe inadvertently ignites a nearby tapestry. Instantly, the auction house erupts into chaos as people scramble to evacuate. Irene makes her way out with urgency, attempting to retrieve the letter in her haste before ultimately departing. Holmes swiftly grabs the ticking package from the doctor's hands and races it to the sarcophagus, ensuring the bomb detonates safely within the enclosed space. After the explosion subsides and the doctor has vanished, Holmes steps outside, his once-pristine Oriental jacket now layered with dust from the explosion, drawing the attention and puzzlement of a well-dressed queue of people. Among the onlookers, a bearded man dressed in a sharp tweed suit scrutinizes him intently. Sensing the surveillance, Holmes turns to make eye contact, causing the man to avert his gaze. Holmes, ever observant, notices the doctor slumped against a wall and quickly checks for a pulse, discovering instead a tiny dart embedded in the man's thigh. Carefully extracting the dart for examination, Holmes turns back to find that the bearded man has mysteriously vanished. He places the dart into his bag for safekeeping. Within the grand, ornately decorated restaurant, Irene Adler is escorted to a prominently placed table shielded by a curtain from an adjacent table. As she settles into her seat, she gestures towards the waiter, who courteously pours her tea from the neighboring table, hidden by the curtain's folds. Meanwhile, the bearded man in the tweed suit watches intently as a speaker's voice sounds through the room. The man discreetly clinks a teaspoon against his glass, a signal that prompts all the patrons and staff, save for himself and the individual behind the curtain, to exit the dining room in an orderly, silent exodus. Irene halts mid-sip and glances around, sensing the abrupt isolation as the room empties. The man behind the curtain draws it open with purpose, revealing himself to Irene, who closes her eyes momentarily before casting her gaze down at her teacup, instinctively processing the tension of the encounter. The man revealed has a distinctively rattled appearance, underscored by a notable beard."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In his mind, Holmes visualizes the impending confrontation: the gang's leader signaling his men, one thug preparing a knuckleduster, another thrusting a knife, a third wielding a club, and the leader armed with a gun. As these visions play out, Holmes opens his eyes to live the action. He swiftly counters the knife attack, redirecting the blade into another thug before disarming and subduing the man with the club. Holmes deftly snatches the gun from the leader, disarms it, and returns it with a dismissive gesture. He then tosses an apple back to the bewildered leader before jogging away.\n\nMeanwhile, Irene Adler enters the auction house and hands a package to an older man, receiving a letter in return. As the doctor begins to open the package, Holmes intercepts a booby trap and retrieves the letter from Irene with a kiss. The package is revealed to contain dynamite, igniting a tapestry and causing an evacuation. Irene departs, attempting to reclaim the letter. As chaos ensues, Holmes secures the ticking package and places it in a sarcophagus, where it explodes safely. Outside, Holmes, covered in dust from the blast, silently assesses the scene. He discovers the doctor unconscious with a tiny dart in his thigh and observes a bearded man in a tweed suit who quickly vanishes. Holmes pockets the dart for further investigation.\n\nLater, in a grand restaurant, Irene Adler is discreetly seated in a central area shielded by a curtain. As the bearded man watches, he signals, causing everyone except himself and a man behind the curtain to vacate the room. Irene, startled as the restaurant empties, is left facing the man behind the curtain, whose presence seems both familiar and menacing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In his mind, he sees the action about to unfold, reminiscent of the strategic scenarios he often encountered in his London cases. The men eye their leader, a notorious figure in the criminal underworld known for his ruthless efficiency, who makes a cutthroat gesture to them, signaling their silent advance. In his mind, Holmes sees a thug with a pocket watch, an item likely stolen from a victim, take out a knuckleduster, a weapon infamous for its brutal impact, a knife being thrust at Holmes, another attacker with a knuckleduster, and a third with a club, a crude yet effective weapon often found among street gangs. The gang's leader has a gun, a rare and prized possession in the criminal circles of Victorian London. Holmes opens his eyes and lives the action, transitioning from visualization to reality in a heartbeat. A blond thug tosses an apple, a movement meant to distract. Holmes thwarts the knife thrust and spins the thug, forcing the blade into another, displaying his signature martial prowess. He throws the man with the club and snatches the gun from the leader's hand, demonstrating his quick reflexes. Holmes catches the apple as it falls and tosses it to the hapless leader. Holmes empties the gun and hands it back, a taunt underscoring his confidence. He makes to attack the leader, who shrinks back, intimidated by Holmes' reputation. Holmes jogs off, his mind already calculating his next move. On foot, Irene Adler, a woman known for outsmarting Holmes himself, enters the auctioneers, Cromwell and Griff, a respected establishment in central London’s antiques district. She hands the package to a mature man, who gives her a letter, likely containing vital information. The doctor starts to open the package, his curiosity piqued by its contents. Irene rises. He holds her back, his caution taking over. She sits. Holmes stops a sprung switch, averting disaster with his keen observation. Holmes kisses her, a gesture both unexpected and distracting, and teases the letter from her. The doctor removes a banknote from the package, revealing dynamite, a dangerously unstable explosive. His pipe ignites a tapestry, setting off a chain of chaos. The auction house clears, chaos ensuing as patrons flee. Irene heads out. She tries to retrieve the letter, recognizing its importance. Irene goes, her departure as mysterious as her arrival. Holmes takes the ticking package from the doctor, his quick thinking crucial. He runs to the sarcophagus, an ancient artifact believed to possess protective magic, which proves a prudent choice of cover. The bomb exploded in the closed sarcophagus, effectively containing the blast. The doctor has gone, vanished in the confusion. Outside, the scruffy Holmes, his appearance more disheveled than usual, draws glances from a well-dressed queue of people, attendees of a nearby theater. A bearded man in a tweed suit watches him closely, a possible agent of a higher power observing from a distance. Holmes turns, and the man looks away, evading direct confrontation. Holmes, the back of his Oriental jacket covered in dust from the explosion, spots the doctor slumped against a wall, his instincts guiding him to the injured man. He feels for a pulse, then notices a tiny dart in the man's thigh, a telltale sign of foul play. He examines the dart, a custom piece likely originating from an exotic locale, then turns. The bearded man has disappeared, leaving only questions in his wake. Holmes places the dart in his bag, adding to his growing collection of clues. The elaborately embossed ceiling of a grand restaurant, decorated in the opulent style of London's high society, looms above. Irene Adler is led to a table in the center of the restaurant and sits by a curtain, shielding her from a nearby table, a strategic position. She turns to the waiter, a discreet nod signaling her readiness. From the table behind the curtain, her tea is poured, a gesture of courtesy masking underlying tension. The bearded man in the tweed suit watches the speaker, his attention unwavering. The bearded man clinks a teaspoon against a glass, and all the clientele and staff, with the exception of him and the man behind the curtain, rise and leave the dining room, a coordinated exit orchestrated with precision. Irene stops sipping her tea and looks anxiously around as the place empties, the silence growing thick with intent. The man behind the curtain draws it open, revealing himself as a key player. Irene closes her eyes, then glances down at her cup, her mind racing with possibilities. The man has a rattled face and sports a beard, his demeanor as unsettling as his appearance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Irene Adler enters the auctioneers Cromwell and Griff In his mind he sees the action about to unfold The men eye their leader who makes a cutthroat gesture to them In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes another attacker with a knuckleduster and a third with a club Irene stops sipping her tea and looks anxiously around as the place empties The gang's leader has a gun Holmes opens his eyes and lives the action A blond thug tosses an apple Holmes thwarts the knife thrust and spins the thug forcing the blade into another He throws the man with the club and snatches the gun from the leader's hand A bearded man in a tweed suit watches him closely Outside the scruffy Holmes jogs off Holmes catches the apple as it falls and tosses it to the hapless leader Holmes empties the gun and hands it back The bearded man in the tweed suit watches the speaker He makes to attack the leader who shrinks back Holmes jogs off On foot Holmes places the dart in his bag Irene Adler enters the auctioneers Cromwell and Griff She hands the package to a mature man who gives her a letter The man behind the curtain draws it open and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room The doctor starts to open the package Irene rises He holds her back She sits Holmes stops a sprung switch Holmes kisses her and teases the letter from her The elaborately embossed ceiling of a grand restaurant The doctor removes a banknote from the package revealing dynamite His pipe ignites a tapestry The bomb exploded in the closed sarcophagus The auction house clears Irene heads out She tries to retrieve the letter Holmes thwarts the knife thrust and spins the thug forcing the blade into another Irene goes Holmes takes the ticking package from the doctor He runs to the sarcophagus In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes The bomb exploded in the closed sarcophagus The doctor has gone Outside the scruffy Holmes stops a sprung switch Holmes draws glances from a welldressed queue of people The doctor removes a banknote from the package revealing dynamite A bearded man in a tweed suit watches him closely On foot The men eye their leader who makes a cutthroat gesture to them Holmes turns and the man looks away The man has a rattled face and sports a beard Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall Irene goes He feels for a pulse then notices a tiny dart in the man's thigh Holmes opens his eyes and lives the action Holmes turns and the man looks away He examines the dart then turns The bearded man has disappeared Holmes places the dart in his bag The elaborately embossed ceiling of a grand restaurant Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table He throws the man with the club and snatches the gun from the leader's hand She turns to the waiter From the table behind the curtain her tea is poured A blond thug tosses an apple He feels for a pulse then notices a tiny dart in the man's thigh The bearded man in the tweed suit watches the speaker The bearded man clinks a teaspoon against a glass Irene rises and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room Irene stops sipping her tea and looks anxiously around as the place empties The man behind the curtain draws it open She hands the package to a mature man who gives her a letter Irene closes her eyes then glances down at her cup The man has a rattled face and sports a beard"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In his mind he sees the action about to unfold. The men eye their leader who makes a cutthroat gesture to them. In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes. another attacker with a knuckleduster and a third with a club. The gang's leader has a gun. Holmes opens his eyes and lives the action. A blond thug tosses an apple. Holmes thwarts the knife thrust and spins the thug forcing the blade into another. He throws the man with the club and snatches the gun from the leader's hand. Holmes catches the apple as it falls and tosses it to the hapless leader. Holmes empties the gun and hands it back. He makes to attack the leader who shrinks back. Holmes jogs off. On foot. Irene Adler enters the auctioneers Cromwell and Griff. She hands the package to a mature man who gives her a letter. The doctor starts to open the package. Irene rises. He holds her back. She sits. Holmes stops a sprung switch. Holmes kisses her and teases the letter from her. The doctor removes a banknote from the package revealing dynamite. His pipe ignites a tapestry. The auction house clears. Irene heads out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. She tries to retrieve the letter. Irene goes. Holmes takes the ticking package from the doctor. He runs to the sarcophagus. The bomb exploded in the closed sarcophagus. The doctor has gone. Outside the scruffy. Holmes draws glances from a welldressed queue of people. A bearded man in a tweed suit watches him closely. Holmes turns and the man looks away. Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall. He feels for a pulse then notices a tiny dart in the man's thigh. He examines the dart then turns. The bearded man has disappeared. Holmes places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table. She turns to the waiter. From the table behind the curtain her tea is poured. The bearded man in the tweed suit watches the speaker. The bearded man clinks a teaspoon against a glass. and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes then glances down at her cup. The man has a rattled face and sports a beard."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In his mind he sees the action about to unfold. The men eye their leader who makes a cutthroat gesture to them. In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes. another attacker with a knuckleduster and a third with a club. The gang's leader has a gun. Holmes opens his eyes and lives the action. A blond thug tosses an apple. Holmes thwarts the knife thrust and spins the thug forcing the blade into another. He throws the man with the club and snatches the gun from the leader's hand. Holmes catches the apple as it falls and tosses it to the hapless leader. Holmes empties the gun and hands it back. He makes to attack the leader who shrinks back. Holmes jogs off. On foot. Irene Adler enters the auctioneers Cromwell and Griff. She hands the package to a mature man who gives her a letter. The doctor starts to open the package. Irene rises. He holds her back. She sits. Holmes stops a sprung switch. Holmes kisses her and teases the letter from her. The doctor removes a banknote from the package revealing dynamite. His pipe ignites a tapestry. The auction house clears. Irene heads out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. She tries to retrieve the letter. Irene goes. Holmes takes the ticking package from the doctor. He runs to the sarcophagus. The bomb exploded in the closed sarcophagus. The doctor has gone. Outside the scruffy. Holmes draws glances from a welldressed queue of people. A bearded man in a tweed suit watches him closely. Holmes turns and the man looks away. Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall. He feels for a pulse then notices a tiny dart in the man's thigh. He examines the dart then turns. The bearded man has disappeared. Holmes places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table. She turns to the waiter. From the table behind the curtain her tea is poured. The bearded man in the tweed suit watches the speaker. The bearded man clinks a teaspoon against a glass. and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes then glances down at her cup. The man has a rattled face and sports a beard."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In his mind he sees the action about to unfold. The men eye their leader who makes a cutthroat gesture to them. In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes. another attacker with a knuckleduster and a third with a club. The gang's leader has a gun. Holmes opens his eyes and lives the action. A blond thug tosses an apple. Holmes thwarts the knife thrust and spins the thug forcing the blade into another. He throws the man with the club and snatches the gun from the leader's hand. Holmes catches the apple as it falls and tosses it to the hapless leader. Holmes empties the gun and hands it back. He makes to attack the leader who shrinks back. Holmes jogs off. The bearded man has disappeared. Holmes places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table. She turns to the waiter. From the table behind the curtain her tea is poured. The bearded man in the tweed suit watches the speaker. The bearded man clinks a teaspoon against a glass. and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes then glances down at her cup. The man has a rattled face and sports a beard."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In his mind he sees the action about to unfold. The men eye their leader who makes a cutthroat gesture to them. In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes. another attacker with a knuckleduster and a third with a club. The gang's leader has a gun. Holmes opens his eyes and lives the action. and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room. Irene stops sipping her tea and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes then glances down at her cup. The man has a rattled face and sports a beard."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In his mind, the cat sees the action about to unfold. The squirrels eye their leader, who makes a cutthroat gesture to them. In his mind, the rabbit sees a thug with a pocket watch take out a knuckleduster, a knife being thrust at the rabbit, another attacker with a knuckleduster, and a third with a club. The gang's leader has a gun. The rabbit opens his eyes and lives the action. A blond squirrel tosses an apple. The rabbit thwarts the knife thrust and spins the squirrel, forcing the blade into another. He throws the turtle with the club and snatches the gun from the leader's hand. The rabbit catches the apple as it falls and tosses it to the hapless leader. The rabbit empties the gun and hands it back. He makes to attack the leader, who shrinks back. The rabbit jogs off. On foot, the giraffe enters the auctioneers, Cromwell and Griff. She hands the package to a mature penguin, who gives her a letter. The parrot starts to open the package. The giraffe rises. He holds her back. She sits. The rabbit stops a sprung switch. The rabbit kisses her and teases the letter from her. The parrot removes a banknote from the package, revealing dynamite. His pipe ignites a tapestry. The auction house clears. The giraffe heads out. She tries to retrieve the letter. The giraffe goes. The rabbit takes the ticking package from the parrot. He runs to the sarcophagus. The bomb exploded in the closed sarcophagus. The parrot has gone. Outside, the scruffy rabbit draws glances from a well-dressed queue of elephants. A bearded camel in a tweed suit watches him closely. The rabbit turns, and the camel looks away. The rabbit, the back of his Oriental jacket covered in dust from the explosion, spots the parrot slumped against a wall. He feels for a pulse, then notices a tiny dart in the parrot's thigh. He examines the dart, then turns. The bearded camel has disappeared. The rabbit places the dart in his bag. The elaborately embossed ceiling of a grand restaurant. The giraffe is led to a table in the center of the restaurant and sits by a curtain, shielding her from a nearby table. She turns to the waiter. From the table behind the curtain, her tea is poured. The bearded camel in the tweed suit watches the speaker. The bearded camel clinks a teaspoon against a glass, and all the clientele and staff, with the exception of him and the llama behind the curtain, rise and leave the dining room. The giraffe stops sipping her tea and looks anxiously around as the place empties. The llama behind the curtain draws it open. The giraffe closes her eyes, then glances down at her cup. The llama has a rattled face and sports a beard."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In his mind, he sees the action about to unfold. The men eye their leader, who makes a throat-slash gesture to them. In his mind, Holmes sees a thug with a sundial take out a frying pan, a spoon being thrust at Holmes, another attacker with a frying pan, and a third with a broom. The gang's leader has a slingshot. Holmes opens his eyes and lives the action. A blond thug tosses a pear. Holmes thwarts the spoon thrust and spins the thug, forcing the spoon into another. He throws the man with the broom and snatches the slingshot from the leader's hand. Holmes catches the pear as it falls and tosses it to the hapless leader. Holmes empties the slingshot and hands it back. He makes to attack the leader, who shrinks back. Holmes jogs off. On foot, Irene Adler enters the cobbler's shop, Cromwell and Griff. She hands the package to a mature man, who gives her a leaflet. The doctor starts to open the package. Irene rises. He holds her back. She sits. Holmes stops a sprung mousetrap. Holmes kisses her and teases the leaflet from her. The doctor removes a playing card from the package, revealing fireworks. His candle ignites a rug. The cobbler's shop clears. Irene heads out. She tries to retrieve the leaflet. Irene goes. Holmes takes the ticking package from the doctor. He runs to the wardrobe. The fireworks exploded in the closed wardrobe. The doctor has gone. Outside, the scruffy Holmes draws glances from a well-dressed queue of people. A bearded man in a tweed scarf watches him closely. Holmes turns, and the man looks away. Holmes, the back of his Oriental scarf covered in dust from the explosion, spots the doctor slumped against a fence. He feels for a pulse, then notices a tiny needle in the man's thigh. He examines the needle, then turns. The bearded man has disappeared. Holmes places the needle in his boot. The elaborately embossed wall of a grand library. Irene Adler is led to a table in the center of the library and sits by a curtain, shielding her from a nearby table. She turns to the librarian. From the table behind the curtain, her coffee is poured. The bearded man in the tweed scarf watches the speaker. The bearded man clinks a spoon against a cup, and all the clientele and staff, with the exception of him and the man behind the curtain, rise and leave the reading room. Irene stops sipping her coffee and looks anxiously around as the place empties. The man behind the curtain draws it open. Irene closes her eyes, then glances down at her saucer. The man has a rattled face and sports a beard."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In his mind, he imagines the action about to emerge. The men glance at their leader, who signals with a nod to them. In his mind, Holmes envisions a thug with a pocket watch pulling out a slingshot, a knife being flung at Holmes, another attacker with a slingshot, and a third with a broom. The gang's leader holds a flashlight. Holmes opens his eyes and experiences the action. A blond thug flips a coin. Holmes dodges the knife throw and twirls the thug, prompting the blade to fly into another. He flips the man with the broom and swipes the flashlight from the leader's hand. Holmes snatches the coin as it spins and tosses it to the bewildered leader. Holmes unloads the flashlight and returns it. He moves to confront the leader, who steps back. Holmes strolls off. On foot, Irene Adler approaches the auctioneers, Cromwell and Griff. She presents the package to a mature man, who hands her a ticket. The doctor prepares to inspect the package. Irene stands. He gestures for her to sit. She complies. Holmes foils a triggered switch. Holmes pecks her cheek and slips the ticket from her. The doctor extracts a feather from the package, exposing confetti. His pipe ignites a drapery. The auction house disperses. Irene departs. She attempts to recover the ticket. Irene exits. Holmes grabs the ticking package from the doctor. He dashes to the sarcophagus. The bomb fizzled in the sealed sarcophagus. The doctor has left. Outside, the scruffy Holmes attracts looks from a well-dressed queue of people. A bearded man in a tweed suit observes him sharply. Holmes pivots, and the man averts his eyes. Holmes, the back of his Oriental jacket sprinkled with dust from the fizzled explosion, notices the doctor slumped against a wall. He checks for a pulse, then detects a tiny dart in the man's thigh. He inspects the dart, then pivots. The bearded man has vanished. Holmes stows the dart in his bag. The intricately decorated ceiling of a grand restaurant. Irene Adler is guided to a table in the center of the restaurant and sits by a curtain, shielding her from a nearby table. She glances at the waiter. From the table behind the curtain, her coffee is poured. The bearded man in the tweed suit listens to the speaker. The bearded man taps a spoon against a glass, and all the patrons and staff, except for him and the man behind the curtain, rise and vacate the dining room. Irene halts sipping her coffee and surveys anxiously as the place empties. The man behind the curtain slides it open. Irene closes her eyes, then peers down at her cup. The man has an uneasy expression and sports a beard."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In its imagination, the paperclip envisions the scene about to unfold. The flowers eye their shepherd, who makes a sweeping gesture to them. In its imagination, the pizza sees a detective with a sundial take out a feather, a sword being thrust at the pizza, another traveler with a feather, and a third with a broom. The flock's shepherd has a trumpet. The pizza opens its eyes and experiences the scene. A red-haired detective tosses an orange. The pizza thwarts the sword thrust and twirls the detective, forcing the blade into another. It throws the poet with the broom and snatches the trumpet from the shepherd's hand. The pizza catches the orange as it falls and tosses it to the distressed shepherd. The pizza empties the trumpet and hands it back. It makes to confront the shepherd, who flinches back. The pizza jogs off. On rollerblades, a performer enters the shoemakers, Atlas and Spruce. She hands the envelope to a youthful horse, who gives her a postcard. The musician starts to unwrap the envelope. The performer rises. The horse holds her back. She sits. The pizza halts a sprung latch. The pizza kisses her and teases the postcard from her. The musician removes a bookmark from the envelope, revealing confetti. Its hat ignites a curtain. The shoe store clears. The performer heads out. She tries to retrieve the postcard. The performer goes. The pizza takes the ticking envelope from the musician. It runs to the fountain. The confetti exploded in the sealed fountain. The musician has vanished. Outside, the tidy pizza draws glances from a shabby line of bicycles. A masked llama in a velvet dress keeps an eye on it closely. The pizza turns, and the llama looks away. The pizza, the hem of its golden cloak covered in glitter from the explosion, spots the musician slumped against a gate. It checks for a heartbeat, then notices a tiny pin in the horse's tail. It examines the pin, then turns. The masked llama has vanished. The pizza places the pin in its pocket. The beautifully painted floor of a grand library. A performer is led to a hammock in the center of the library and sits by a partition, shielding her from a nearby chair. She turns to the gardener. From the hammock behind the partition, her lemonade is poured. The masked llama in the velvet dress watches the radio. The masked llama taps a megaphone against a vase, and all the audience and workers, excluding it and the bear behind the partition, rise and leave the reading room. The performer stops sipping her lemonade and looks nervously around as the place empties. The bear behind the partition draws it open. The performer closes her eyes, then glances down at her glass. The bear has a startled expression and wears a helmet."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In his mind, a squirrel envisions the event about to commence. The birds scrutinize their conductor, who performs a whimsical dance for them. In his mind, Watson observes a juggler with a sundial produce a marionette, a feather being waved at Watson, another performer with a marionette, and a third with a flute. The troupe's conductor has a whistle. Watson shuts his eyes and dreams the event. A red-headed juggler flips a pancake. Watson deflects the feather wave and twirls the juggler, guiding the feather into another. He flips the musician with the flute and retrieves the whistle from the conductor's grip. Watson snares the pancake as it descends and lobs it to the bewildered conductor. Watson unloads the whistle and returns it. He feigns to dance with the conductor, who backs away. Watson strolls off. On foot, Mary Sutherland visits the apothecaries, Barnaby and Fitch. She presents the scroll to a youthful woman, who hands her an envelope. The inventor begins to inspect the scroll. Mary rises. She restrains him. She pauses. Watson halts a bouncing mechanism. Watson embraces her and extracts the envelope from her. The inventor withdraws a playing card from the scroll, revealing fireworks. His spectacles kindle a curtain. The apothecary clears. Mary departs. She attempts to reclaim the envelope. Mary departs. Watson grabs the buzzing scroll from the inventor. He dashes to the sarcophagus. The fireworks detonated in the sealed sarcophagus. The inventor has vanished. Outside, the scruffy Watson draws gazes from a sharply-dressed parade of people. A moustached gentleman in a checkered blazer observes him keenly. Watson pivots, and the gentleman averts his gaze. Watson, the back of his silken robe dusted from the explosion, notices the inventor collapsed against an archway. He searches for a heartbeat, then spots a minuscule petal in the man's knee. He inspects the petal, then turns. The moustached gentleman has vanished. Watson places the petal in his pouch. The intricately adorned ceiling of a lavish bistro. Mary Sutherland is guided to a corner of the bistro and reclines by a screen, partitioning her from a neighboring table. She gestures to the server. From the table behind the screen, her lemonade is served. The moustached gentleman in the checkered blazer observes the performer. The moustached gentleman taps a teaspoon against a plate, and all the diners and servers, excluding him and the person behind the screen, stand and vacate the bistro. Mary ceases sipping her lemonade and peers nervously as the venue empties. The person behind the screen pulls it aside. Mary shuts her eyes, then peers down at her cup. The person has a flustered face and sports a moustache."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In his mind, he sees the spectacle about to commence. The men glance at their leader, who makes a sweeping gesture to them. In his mind, Holmes sees a thug with a wristwatch pull out a rubber chicken, a spoon being pointed at Holmes, another assailant with a rubber chicken, and a third with a spatula. The gang's leader wields a slingshot. Holmes opens his eyes and experiences the spectacle. A blond thug tosses an orange. Holmes intercepts the spoon jab and twirls the thug, guiding the utensil into another. He hurls the man with the spatula and plucks the slingshot from the leader's grasp. Holmes snatches the orange as it drops and lobs it to the bewildered leader. Holmes unloads the slingshot and offers it back. He feigns to confront the leader, who flinches. Holmes sprints off. On foot, Irene Adler enters the florists, Cromwell and Griff. She presents the bouquet to a seasoned man, who hands her a postcard. The doctor begins to unwrap the bouquet. Irene stands. He restrains her. She takes a seat. Holmes halts a descending curtain. Holmes pecks her on the cheek and teases the postcard from her. The doctor extracts a cupcake from the bouquet, revealing fireworks. His matchstick sets a rug ablaze. The florist's shop clears. Irene exits. She attempts to reclaim the postcard. Irene departs. Holmes lifts the ticking bouquet from the doctor. He dashes to the birdcage. The fireworks detonated in the confined birdcage. The doctor has vanished. Outside, the unkempt Holmes draws looks from a finely dressed line of people. A bearded man in a linen suit observes him intently. Holmes pivots, and the man averts his gaze. Holmes, the back of his velvet jacket sprinkled with fluff from the explosion, spots the doctor leaned against a pillar. He checks for a pulse, then spots a tiny leaf on the man's shoe. He scrutinizes the leaf, then turns. The bearded man has vanished. Holmes places the leaf in his pocket. The intricately decorated ceiling of a grand café. Irene Adler is guided to a chair in the center of the café and sits by a curtain, concealing her from a nearby chair. She gestures to the waiter. From the chair behind the curtain, her lemonade is poured. The bearded man in the linen suit listens to the gramophone. The bearded man taps a drumstick against a bowl, and all the patrons and staff, apart from him and the man behind the curtain, rise and vacate the café. Irene ceases sipping her lemonade and glances nervously around as the venue clears. The man behind the curtain opens it wide. Irene shuts her eyes, then peers down at her glass. The man has a startled countenance and sports a mustache."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In her imagination, she envisions the spectacle about to commence. The dogs gaze at their guide, who performs a victorious salute to them. In her imagination, Clara envisions a penguin with a sundial pull out a spade, a spoon being jabbed at Clara, another defender with a spade, and a third with a trumpet. The pack's guide has a balloon. Clara shuts her eyes and experiences the spectacle. A brunette penguin flings a peach. Clara deflects the spoon jab and twirls the penguin, steering the fork into another. She flips the creature with the trumpet and grabs the balloon from the guide's paw. Clara snatches the peach as it descends and flings it to the hapless guide. Clara drains the balloon and offers it back. She aims to tackle the guide, who cowers away. Clara gallops away. On hoof, Lucy Linden enters the florists, O'Brien and Cook. She passes the envelope to a youthful giraffe, who hands her a postcard. The scientist begins to unwrap the envelope. Lucy stands. He restrains her. She perches. Clara halts a bouncing trapdoor. Clara embraces her and coaxes the postcard from her. The scientist extracts a seashell from the envelope, unveiling fireworks. His chisel ignites a portrait. The florist shop evacuates. Lucy makes her exit. She attempts to regain the postcard. Lucy departs. Clara retrieves the ticking envelope from the scientist. She dashes to the gazebo. The fireworks detonated in the sealed gazebo. The scientist has vanished. Outdoors, the tidy Clara attracts stares from a casually-dressed line of creatures. A shaven bear in a leather jacket observes her intently. Clara pivots, and the bear averts its gaze. Clara, the collar of her Hawaiian shirt covered in petals from the blast, notices the scientist slouched against a fence. She checks for a heartbeat, then spots a tiny arrow in the bear's paw. She inspects the arrow, then pivots. The shaven bear has vanished. Clara places the arrow in her basket. The meticulously carved floor of an elegant library. Lucy Linden is led to a shelf in the corner of the library and settles by a zebra, shielding her from a nearby portrait. She turns to the librarian. From the shelf behind the zebra, her smoothie is poured. The shaven bear in the leather jacket observes the poet. The shaven bear taps a drumstick against a plate, and all the patrons and librarians, with the exception of him and the poet behind the zebra, rise and exit the reading room. Lucy halts sipping her smoothie and glances nervously around as the room vacates. The poet behind the zebra parts it open. Lucy shuts her eyes, then lowers her gaze to her glass. The poet has a quivering trunk and supports a mane."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In this intense sequence, Holmes anticipates a violent confrontation with a gang led by a man wielding a gun. As events unfold, he skillfully counters their attacks, disarming the leader and catching a tossed apple. Holmes then jogs away as Irene Adler, entering an auction house, exchanges a package for a letter. Suspense builds as a doctor accidentally ignites a tapestry, causing chaos. Holmes retrieves a ticking package and neutralizes its explosion in a sarcophagus. Outside, Holmes finds the doctor dead with a dart in his thigh, while a bearded man vanishes. Later, in a grand restaurant, Irene sits shielded by a curtain, observing the bearded man in a tweed suit. As clientele abruptly leave, Irene grows anxious. The man behind the curtain reveals himself, and Irene, noticing her tea, reacts with concern."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The man has a rattled face and sports a beard Irene closes her eyes then glances down at her cup The man behind the curtain draws it open Irene stops sipping her tea and looks anxiously around as the place empties and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room The bearded man clinks a teaspoon against a glass The bearded man in the tweed suit watches the speaker From the table behind the curtain her tea is poured She turns to the waiter Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table The elaborately embossed ceiling of a grand restaurant Holmes places the dart in his bag The bearded man has disappeared He examines the dart then turns He feels for a pulse then notices a tiny dart in the man's thigh Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall Holmes turns and the man looks away A bearded man in a tweed suit watches him closely Holmes draws glances from a welldressed queue of people Outside the scruffy The doctor has gone The bomb exploded in the closed sarcophagus He runs to the sarcophagus Holmes takes the ticking package from the doctor Irene goes She tries to retrieve the letter Irene heads out The auction house clears His pipe ignites a tapestry The doctor removes a banknote from the package revealing dynamite Holmes kisses her and teases the letter from her Holmes stops a sprung switch She sits He holds her back Irene rises The doctor starts to open the package She hands the package to a mature man who gives her a letter Irene Adler enters the auctioneers Cromwell and Griff On foot Holmes jogs off He makes to attack the leader who shrinks back Holmes empties the gun and hands it back Holmes catches the apple as it falls and tosses it to the hapless leader He throws the man with the club and snatches the gun from the leader's hand Holmes thwarts the knife thrust and spins the thug forcing the blade into another A blond thug tosses an apple Holmes opens his eyes and lives the action The gang's leader has a gun another attacker with a knuckleduster and a third with a club In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes The men eye their leader who makes a cutthroat gesture to them In his mind he sees the action about to unfold"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Holmes catches the apple as it falls and tosses it to the hapless leader His pipe ignites a tapestry Irene heads out another attacker with a knuckleduster and a third with a club Holmes kisses her and teases the letter from her He examines the dart then turns The doctor starts to open the package The bearded man has disappeared She sits He makes to attack the leader who shrinks back The bearded man clinks a teaspoon against a glass The auction house clears Holmes draws glances from a welldressed queue of people He runs to the sarcophagus The doctor has gone She turns to the waiter The gang's leader has a gun Holmes takes the ticking package from the doctor Holmes empties the gun and hands it back She tries to retrieve the letter Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall In his mind he sees the action about to unfold From the table behind the curtain her tea is poured He holds her back Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table Irene closes her eyes then glances down at her cup Holmes turns and the man looks away Irene stops sipping her tea and looks anxiously around as the place empties The bomb exploded in the closed sarcophagus Holmes stops a sprung switch The doctor removes a banknote from the package revealing dynamite Holmes jogs off The man has a rattled face and sports a beard Outside the scruffy The bearded man in the tweed suit watches the speaker On foot The elaborately embossed ceiling of a grand restaurant The man behind the curtain draws it open In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes Irene goes He feels for a pulse then notices a tiny dart in the man's thigh Holmes opens his eyes and lives the action A bearded man in a tweed suit watches him closely A blond thug tosses an apple He throws the man with the club and snatches the gun from the leader's hand Irene Adler enters the auctioneers Cromwell and Griff She hands the package to a mature man who gives her a letter Irene rises and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room The men eye their leader who makes a cutthroat gesture to them Holmes thwarts the knife thrust and spins the thug forcing the blade into another Holmes places the dart in his bag"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She tries to retrieve the letter Irene goes Holmes takes the ticking package from the doctor He runs to the sarcophagus The bomb exploded in the closed sarcophagus The doctor has gone Outside the scruffy Holmes draws glances from a welldressed queue of people A bearded man in a tweed suit watches him closely Holmes turns and the man looks away Holmes the back of his Oriental jacket covered in dust from the explosion spots the doctor slumped against a wall He feels for a pulse then notices a tiny dart in the man's thigh He examines the dart then turns The bearded man has disappeared Holmes places the dart in his bag The elaborately embossed ceiling of a grand restaurant Irene Adler is led to a table in the center of the restaurant and sits by a curtain shielding her from a nearby table She turns to the waiter From the table behind the curtain her tea is poured The bearded man in the tweed suit watches the speaker The bearded man clinks a teaspoon against a glass and all the clientele and staff with the exception of him and the man behind the curtain rise and leave the dining room Irene stops sipping her tea and looks anxiously around as the place empties The man behind the curtain draws it open Irene closes her eyes then glances down at her cup The man has a rattled face and sports a beard In his mind he sees the action about to unfold The men eye their leader who makes a cutthroat gesture to them In his mind Holmes sees a thug with a pocket watch take out a knuckleduster a knife being thrust at Holmes another attacker with a knuckleduster and a third with a club The gang's leader has a gun Holmes opens his eyes and lives the action A blond thug tosses an apple Holmes thwarts the knife thrust and spins the thug forcing the blade into another He throws the man with the club and snatches the gun from the leader's hand Holmes catches the apple as it falls and tosses it to the hapless leader Holmes empties the gun and hands it back He makes to attack the leader who shrinks back Holmes jogs off On foot Irene Adler enters the auctioneers Cromwell and Griff She hands the package to a mature man who gives her a letter The doctor starts to open the package Irene rises He holds her back She sits Holmes stops a sprung switch Holmes kisses her and teases the letter from her The doctor removes a banknote from the package revealing dynamite His pipe ignites a tapestry The auction house clears Irene heads out"
        }
      ]
    }
  ]
}