{
  "ground_truth": "Holmes pulls him away and whacks him with a curtain rail. As they fight, the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out of the window. The line between him and Holmes is pulled tight, dragging Holmes towards the window. Holmes is wrenched backwards, out of the window. He lands heavily on a barge carrying sand on the canal outside. The Corsac bursts up out of the sand and grabs him. Holmes breaks free and falls onto a lower deck. The Corsac tries to flee, but Holmes yanks him back with the rope connecting them. Men grab them both. The men release Holmes and the Corsac. Holmes grabs a club off one of the men watching and whacks the Corsac in the face. Then he yanks on the rope, pulling the Corsac over. The Corsac gets up again and cuts the rope linking them together. The Corsac starts to climb back up the window they fell from. Sim sees him coming and backs away from the window. One of the spectators urges Holmes on. Holmes shins up a rope hanging from a block-and-tackle on the side of the building. The Corsac gets back inside. Watson collects his winnings from the other players. Holmes smashes through a window and crashes into Watson, scattering all the money. Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim, who runs along the first. The Corsac leaps down onto her floor. Holmes picks himself up and gives chase. Watson notices the other players eyeing his winnings, which are now scattered on the floor. A free-for-all erupts as everyone lunges for the cash. As Watson struggles with the other gamblers, Mycroft leaves the men he was chatting to. The Corsac leaps down some steps and trips Sim up. She rolls out of the fall and draws a knife. The Corsac dodges her attack and punches her in the face. He thumps her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal. Sim gets to her feet, clutching her nose, and turns to Holmes. Dr. Watson arrives, a bit drunk. He falls over. Carruthers looks dubious. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives his car along a narrow road leading to a village. The car pulls up outside the church. Sporting dark glasses and smoking his long pipe, Holmes turns around to a bruised and beaten Watson, who is asleep beside him. He nudges Watson, who stirs but doesn't awake. Holmes gets out of the vehicle, walks round it and shoves Watson again. He still doesn't rouse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holmes tugs him aside and strikes him with a drapery rod. As they brawl, the Corsac fastens a cord to Holmes' strap. Sim boots the Corsac out of the aperture. The cord between him and Holmes is tugged taut, hauling Holmes towards the aperture. Holmes is yanked backwards, out of the aperture. He lands heavily on a barge transporting sand on the waterway outside. The Corsac erupts up out of the sand and clutches him. Holmes breaks free and tumbles onto a lower platform. The Corsac attempts to escape, but Holmes jerks him back with the tether binding them. People seize them both. The people release Holmes and the Corsac. Holmes seizes a bat off one of the people observing and strikes the Corsac in the visage. Then he jerks on the tether, dragging the Corsac over. The Corsac rises again and slices the tether linking them. The Corsac begins to scale back up the aperture they plunged from. Sim perceives him approaching and retreats from the aperture. One of the onlookers encourages Holmes on. Holmes shins up a cord dangling from a block-and-tackle on the flank of the structure. The Corsac gets back inside. Watson gathers his earnings from the other players. Holmes shatters through an aperture and crashes into Watson, scattering all the money. Holmes sits up and observes the Corsac bounding along the second tier gallery above Sim, who sprints along the first. The Corsac vaults down onto her level. Holmes hoists himself up and pursues. Watson notices the other players eyeing his earnings, which are now scattered on the level. A free-for-all erupts as everyone lunges for the cash. As Watson struggles with the other gamblers, Mycroft departs the people he was conversing with. The Corsac vaults down some steps and trips Sim up. She rolls out of the fall and draws a dagger. The Corsac evades her assault and punches her in the visage. He thumps her a second time and is about to strike with his own dagger when Holmes intervenes. He kicks the Corsac out of a portal and into the waterway. Sim gets to her feet, clutching her nose, and turns to Holmes. Dr. Watson arrives, somewhat intoxicated. He tumbles over. Carruthers looks skeptical. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives his automobile along a narrow path leading to a settlement. The automobile pulls up outside the chapel. Sporting dark spectacles and smoking his long pipe, Holmes turns around to a bruised and battered Watson, who is asleep beside him. He nudges Watson, who stirs but doesn't awaken. Holmes gets out of the vehicle, walks round it and shoves Watson again. He still doesn't rouse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Holmes pulls him away and is whacked by him with a curtain rail. As they fight, a line is attached to Holmes' belt by the Corsac. Sim kicks the Corsac out of the window. The line between him and Holmes pulls tight, and Holmes is dragged towards the window. Holmes wrenches himself backwards, out of the window. He lands heavily on a barge carrying sand on the canal outside. The Corsac bursts up out of the sand and is grabbed by him. Holmes breaks free and falls onto a lower deck. An attempt to flee is made by the Corsac, but Holmes yanks him back with the rope connecting them. Men grab them both. Holmes and the Corsac are released by the men. A club is grabbed off one of the men watching, and the Corsac is whacked in the face by Holmes. Then he yanks on the rope, and the Corsac is pulled over by him. The Corsac gets up again and cuts the rope linking them together. The window they fell from is started to be climbed back up by the Corsac. He is seen coming by Sim, who backs away from the window. Holmes is urged on by one of the spectators. A rope hanging from a block-and-tackle on the side of the building is shinned up by Holmes. The Corsac gets back inside. Watson collects his winnings from the other players. Holmes smashes through a window and crashes into Watson, scattering all the money. Holmes sits up and sees the Corsac bounding along the second-floor balcony above Sim, who runs along the first. The floor of Sim is leaped down onto by the Corsac. Holmes picks himself up and chases. The other players are noticed by Watson, who eye his winnings, which are now scattered on the floor. A free-for-all erupts as everyone lunges for the cash. As Watson struggles with the other gamblers, the men Mycroft was chatting to are left by him. Sim is tripped up by the Corsac, who leaps down some steps. She rolls out of the fall and draws a knife. The Corsac dodges her attack and is punched in the face. A second thump is given to her, and a strike with his own knife is about to be made when Holmes intervenes. He kicks the Corsac out of a door and into the canal. Sim gets to her feet, clutches her nose, and turns to Holmes. Dr. Watson arrives, a bit drunk. He falls over. Dubious looks are given by Carruthers. Sim's bag and Rene's letter are retrieved by Holmes. The next day, his car is driven by him along a narrow road leading to a village. The car pulls up outside the church. Sporting dark glasses and smoking his long pipe, Holmes turns around to a bruised and beaten Watson, who is asleep beside him. Watson is nudged by him, who stirs but doesn't awake. Holmes gets out of the vehicle, walks round it and shoves Watson again. He still doesn't rouse."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holmes pulls him away and hits him with a curtain rail. During the fight, the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out the window, pulling Holmes towards it. Holmes is dragged out and lands on a sand barge in the canal. The Corsac emerges from the sand and grabs him. Holmes breaks free, falls to a lower deck, and pulls the Corsac back with the rope. Men grab and release them both. Holmes grabs a club and hits the Corsac, pulling him over. The Corsac cuts the rope and climbs back up the window. Sim backs away as Holmes climbs a rope on the building. The Corsac re-enters, and Watson collects his winnings. Holmes crashes through a window into Watson, scattering money. Holmes sees the Corsac on the second-floor balcony above Sim. The Corsac jumps down, and Holmes chases him. Watson notices others eyeing his scattered winnings, leading to a scramble. As Watson struggles, Mycroft leaves his conversation. The Corsac trips Sim, who rolls and draws a knife. He dodges and punches her, but Holmes intervenes, kicking the Corsac into the canal. Sim stands, clutching her nose, and turns to Holmes. Dr. Watson arrives, drunk, and falls. Carruthers looks skeptical. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives to a village church. Wearing dark glasses and smoking, Holmes turns to a bruised Watson, asleep beside him. He nudges Watson, who stirs but doesn't wake. Holmes exits the car, walks around, and shoves Watson again, but he remains asleep."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes pulls him away and hits him with a curtain rail. During the fight, the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out the window, pulling Holmes towards it. Holmes is dragged out, landing on a sand barge in the canal. The Corsac emerges from the sand, grabbing him. Holmes breaks free, falls to a lower deck, and pulls the Corsac back with the rope. Men grab and release them. Holmes takes a club and hits the Corsac, pulling him over. The Corsac cuts the rope and climbs back up. Sim backs away from the window. Holmes climbs a rope on the building. The Corsac re-enters. Watson collects his winnings. Holmes crashes through a window, scattering money. The Corsac leaps down to Sim's floor. Holmes chases him. A free-for-all erupts over the cash. Watson struggles with gamblers. Mycroft leaves his conversation. The Corsac trips Sim, who draws a knife. He dodges and punches her, but Holmes intervenes, kicking him into the canal. Sim stands, clutching her nose. Dr. Watson arrives, drunk, and falls. Carruthers looks dubious. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives to a village church. Wearing dark glasses and smoking, Holmes nudges a sleeping Watson, who doesn't wake. Holmes exits the car, walks around, and shoves Watson again, but he remains asleep."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holmes swiftly pulls him away and delivers a solid whack with a curtain rail. As the intense fight continues, the Corsac cleverly attaches a line to Holmes' belt. In a decisive move, Sim kicks the Corsac out of the window. The line connecting him to Holmes becomes taut, forcefully dragging Holmes towards the open window. Holmes is abruptly wrenched backwards and is pulled out of the window. He lands heavily on a barge that is carrying a load of sand on the canal outside. Suddenly, the Corsac bursts up from beneath the sand and grabs hold of him. Holmes manages to break free and falls onto a lower deck of the barge. The Corsac attempts to flee, but Holmes quickly yanks him back using the rope that connects them. Men nearby grab hold of both of them. The men then release Holmes and the Corsac. Holmes seizes a club from one of the onlookers and strikes the Corsac in the face. He then pulls on the rope, causing the Corsac to topple over. The Corsac gets back on his feet and cuts the rope that links them together. He starts to climb back up towards the window from which they fell. Sim, seeing him approach, backs away from the window. One of the spectators encourages Holmes to continue. Holmes climbs up a rope that is hanging from a block-and-tackle on the side of the building. Meanwhile, the Corsac manages to get back inside. Watson collects his winnings from the other players. Holmes crashes through a window and collides with Watson, scattering all the money. Holmes sits up and notices the Corsac bounding along the second-floor balcony above Sim, who is running along the first floor. The Corsac leaps down onto her level. Holmes picks himself up and begins to give chase. Watson notices the other players eyeing his scattered winnings, and a chaotic free-for-all erupts as everyone lunges for the cash. As Watson struggles with the other gamblers, Mycroft leaves the men he was chatting with. The Corsac leaps down some steps and trips Sim, causing her to fall. She rolls out of the fall and draws a knife. The Corsac dodges her attack and punches her in the face. He hits her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal. Sim gets to her feet, clutching her nose, and turns to face Holmes. Dr. Watson arrives, appearing a bit drunk, and promptly falls over. Carruthers looks on with a dubious expression. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives his car along a narrow road leading to a quaint village. The car comes to a stop outside the church. Sporting dark glasses and smoking his long pipe, Holmes turns to look at a bruised and beaten Watson, who is asleep beside him. He nudges Watson, who stirs slightly but doesn't fully awaken. Holmes gets out of the vehicle, walks around it, and gives Watson another shove. Watson still doesn't rouse."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holmes swiftly and deftly pulls him away, delivering a solid and resounding whack with a curtain rail. As the intense and fierce fight continues to unfold, the Corsac cleverly and strategically attaches a line to Holmes' belt. In a bold and decisive move, Sim kicks the Corsac out of the window. The line connecting him to Holmes becomes taut and tensioned, forcefully dragging Holmes towards the now open window. Holmes is abruptly wrenched backward and is consequently pulled out of the window, landing quite heavily on a barge that is carrying a significant load of sand on the canal outside. Suddenly, with surprising agility, the Corsac bursts up from beneath the sand and grabs hold of him. Holmes manages to break free from his grip and falls onto a lower deck of the barge. The Corsac attempts to flee the scene, but Holmes quickly and efficiently yanks him back using the rope that connects them. Nearby, several men grab hold of both of them. The men then proceed to release Holmes and the Corsac. Holmes swiftly seizes a club from one of the onlookers and strikes the Corsac in the face. He then pulls on the rope, causing the Corsac to topple over unsteadily. The Corsac quickly regains his footing and cuts the rope that links them together. He starts to climb back up towards the window from which they initially fell. Sim, seeing him approach rapidly, backs away from the window. One of the spectators calls out, encouraging Holmes to continue. Holmes climbs up a rope that is hanging from a block-and-tackle on the side of the building. Meanwhile, the Corsac manages to get back inside the building. Watson, displaying a hint of satisfaction, collects his winnings from the other players. Holmes crashes through a window and collides with Watson, scattering all the money. Holmes sits up and notices the Corsac bounding along the second-floor balcony directly above Sim, who is running along the first floor. The Corsac then leaps down onto her level. Holmes picks himself up and immediately begins to give chase. Watson notices the other players eyeing his scattered winnings, and a chaotic free-for-all erupts as everyone lunges for the cash. As Watson struggles with the eager gamblers, Mycroft leaves the men he was chatting with. The Corsac leaps down some steps and trips Sim, causing her to stumble and fall. She rolls out of the fall and swiftly draws a knife. The Corsac dodges her sharp attack and punches her in the face. He hits her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal with great force. Sim gets to her feet, clutching her nose in pain, and turns to face Holmes. Dr. Watson arrives on the scene, appearing slightly drunk, and promptly falls over unceremoniously. Carruthers looks on with a dubious expression on his face. Holmes retrieves Sim's bag and Rene's letter. The next day, he drives his car along a narrow road leading to a quaint village. The car comes to a stop just outside the church. Sporting dark glasses and smoking his long pipe with his usual air of confidence, Holmes turns to look at a bruised and beaten Watson, who is asleep beside him. He nudges Watson, who stirs slightly but doesn't fully awaken. Holmes gets out of the vehicle, walks around it, and gives Watson another shove, but Watson still doesn't rouse."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holmes swiftly reaches out and pulls him away, then forcefully swings a curtain rail, striking him with precision. As the fight intensifies, the Corsac deftly attaches a line to Holmes' belt, securing it tightly. In a sudden move, Sim kicks the Corsac, sending him tumbling out of the window. The line connecting him to Holmes becomes taut, creating a powerful force that drags Holmes towards the window. With a sudden jolt, Holmes is wrenched backwards and propelled out of the window, landing heavily on a barge filled with sand floating on the canal below. The Corsac, buried beneath the sand, bursts forth and seizes Holmes with a firm grip. Holmes struggles and manages to break free, tumbling onto a lower deck of the barge. As the Corsac attempts to escape, Holmes quickly yanks him back using the rope that still connects them. Men nearby rush in and grab both Holmes and the Corsac, but soon release them. Holmes seizes the opportunity to snatch a club from one of the onlookers and delivers a solid blow to the Corsac's face. He then pulls on the rope, causing the Corsac to topple over. Undeterred, the Corsac rises and swiftly cuts the rope that binds them. He begins to climb back up towards the window from which they fell. Sim, noticing his approach, retreats from the window. A spectator encourages Holmes to continue the pursuit. Holmes agilely climbs a rope hanging from a block-and-tackle on the building's side. Meanwhile, the Corsac manages to get back inside. Watson, observing the scene, collects his winnings from the other players. Holmes crashes through a window, colliding with Watson and scattering the money everywhere. As Holmes sits up, he spots the Corsac bounding along the second-floor balcony above Sim, who is running along the first floor. The Corsac leaps down to her level, prompting Holmes to pick himself up and give chase. Watson, noticing the other players eyeing his scattered winnings, finds himself in the midst of a chaotic scramble for the cash. As Watson grapples with the other gamblers, Mycroft departs from the group of men he was conversing with. The Corsac leaps down a set of steps, causing Sim to trip. She skillfully rolls out of the fall and draws a knife, ready to defend herself. The Corsac dodges her attack and delivers a punch to her face, following up with a second blow. Just as he is about to strike with his own knife, Holmes intervenes, kicking the Corsac out of a door and into the canal. Sim, clutching her nose, gets to her feet and turns to face Holmes. Dr. Watson arrives on the scene, slightly inebriated, and promptly falls over. Carruthers looks on with skepticism. Holmes retrieves Sim's bag and Rene's letter, ensuring their safety. The next day, Holmes drives his car along a narrow road leading to a quaint village. The car comes to a stop outside the church. Sporting dark glasses and smoking his long pipe, Holmes turns to look at a bruised and battered Watson, who is asleep beside him. He nudges Watson, causing him to stir slightly but not fully awaken. Holmes exits the vehicle, walks around it, and gives Watson another shove, but he remains unresponsive."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holmes pulls his opponent away, striking him with a curtain rail. During the fight, the Corsac attaches a line to Holmes' belt, but Sim intervenes, kicking the Corsac out of the window. The line pulls Holmes towards the window, and he is dragged out, landing heavily on a sand barge in the canal. The Corsac emerges from the sand, grabbing Holmes, who breaks free and falls to a lower deck. As the Corsac attempts to flee, Holmes pulls him back with the rope connecting them. Men intervene, briefly detaining both before releasing them. Holmes seizes a club from one of the onlookers and strikes the Corsac, pulling him over with the rope. The Corsac cuts the rope and climbs back up to the window. Sim retreats as the Corsac re-enters the building. Encouraged by a spectator, Holmes climbs a rope on the building's side. Meanwhile, Watson collects his winnings, but chaos ensues as the money scatters. Holmes crashes through a window, colliding with Watson and scattering the cash further. As a free-for-all erupts over the money, Mycroft departs from his conversation. The Corsac trips Sim, who recovers and draws a knife. He dodges her attack, punching her twice before Holmes intervenes, kicking the Corsac into the canal. Sim, clutching her nose, turns to Holmes as a drunken Watson arrives and falls over. Holmes retrieves Sim's bag and Rene's letter. The next day, Holmes drives to a village church with a bruised and sleeping Watson beside him. He attempts to rouse Watson, who stirs but doesn't wake, prompting Holmes to get out and try again."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holmes, known for his unorthodox techniques in detective work, pulls him away and whacks him with a curtain rail torn from the window of the dilapidated building where they had been fighting. As they fight, the Corsac, an elusive and notorious criminal in Europe's underground circles, attaches a line to Holmes' belt. Sim, a skilled acrobat who was part of their team, kicks the Corsac out of the window. The line between him and Holmes is pulled tight, dragging Holmes towards the window, a dramatic maneuver reminiscent of the narrow escapes often seen in circus acts. Holmes is wrenched backwards, out of the window, and he lands heavily on a barge carrying sand, one of many that float along the busy canal route, outside. The Corsac bursts up out of the sand and grabs him like a predator catching its prey. Holmes breaks free, using the self-defense techniques taught to him by a retired soldier, and falls onto a lower deck. The Corsac tries to flee, but Holmes, leveraging his knowledge of knots, yanks him back with the rope connecting them. Men wearing the uniforms of the local dock workers grab them both. The men, recognizing the famed detective whom they'd heard about in the papers, release Holmes and the Corsac. Holmes grabs a club off one of the men watching, a hefty piece of oak often used for self-defense, and whacks the Corsac in the face. Then he yanks on the rope, pulling the Corsac over. The Corsac gets up again and cuts the rope linking them together with a swift slash of his blade. The Corsac starts to climb back up the window they fell from, a feat requiring the strength and agility of a seasoned climber. Sim, seeing him coming and backing away from the window, is used to assessing danger quickly from her years of navigating tricky situations. One of the spectators, a grizzled old sailor, urges Holmes on. Holmes shins up a rope hanging from a block-and-tackle on the side of the building, an apparatus used to hoist goods onto ships. The Corsac gets back inside. Watson collects his winnings from the other players, having ingeniously bet on Holmes' success due to his unshakeable faith in his friend's abilities. Holmes smashes through a window and crashes into Watson, scattering all the money in a scene of chaos. Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim, who runs along the first, adeptly navigating the railing. The Corsac, with the grace of a panther, leaps down onto her floor. Holmes picks himself up and gives chase, determined to apprehend the Corsac. Watson notices the other players eyeing his winnings, which are now scattered on the floor, sparking a frenzied scramble. A free-for-all erupts as everyone lunges for the cash in a chaotic scene reminiscent of a marketplace. As Watson struggles with the other gamblers, Mycroft, Holmes' elder brother who works covertly for the government, leaves the men he was chatting to. The Corsac leaps down some steps and trips Sim up, her training in gymnastics allowing her to roll out of the fall and draw a knife. The Corsac dodges her attack and punches her in the face with the precision of a practiced fighter. He thumps her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal, where the splash echoes down the narrow waterway. Sim gets to her feet, clutching her nose, and turns to Holmes with gratitude for his timely intervention. Dr. Watson arrives, a bit drunk from having celebrated prematurely, and falls over in a less than dignified manner. Carruthers, a member of the local constabulary who'd often assisted Holmes, looks dubious at the unfolding scene. Holmes retrieves Sim's bag and Rene's letter, a crucial piece of correspondence that they had to recover. The next day, he drives his car, a rare and valuable 1910 Renault, along a narrow road leading to a picturesque village nestled in the English countryside. The car pulls up outside the church, its spires visible from miles away. Sporting dark glasses and smoking his long pipe, a signature accessory that became iconic for his character, Holmes turns around to a bruised and beaten Watson, who is asleep beside him, recovering from the previous night's adventure. He nudges Watson, who stirs but doesn't awake, still drowsy from the effects of both the alcohol and the confrontation. Holmes gets out of the vehicle, walks round it and shoves Watson again, hoping to rouse him for their next task. He still doesn't rouse, much to Holmes' exasperation but mild amusement at his friend's resilience."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holmes pulls him away and whacks him with a curtain rail. As they fight the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out of the window. The line between him and Holmes is pulled tight dragging Holmes towards the window. Holmes is wrenched backwards out of the window. He lands heavily on a barge carrying sand on the canal outside. The Corsac bursts up out of the sand and grabs him. Holmes breaks free and falls onto a lower deck. The Corsac tries to flee but Holmes yanks him back with the rope connecting them. Men grab them both. The men release Holmes and the Corsac. Holmes grabs a club off one of the men watching and whacks the Corsac in the face. Then he yanks on the rope pulling the Corsac over. The Corsac gets up again and cuts the rope linking them together. The Corsac starts to climb back up the window they fell from. Sim sees him coming and backs away from the window. One of the spectators urges Holmes on. Holmes shins up a rope hanging from a blockandtackle on the side of the building. The Corsac gets back inside. Watson collects his winnings from the other players. Holmes smashes through a window and crashes into Watson scattering all the money. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim who runs along the first. The Corsac leaps down onto her floor. Holmes picks himself up and gives chase. Watson notices the other players eyeing his winnings which are now scattered on the floor. A freeforall erupts as everyone lunges for the cash. As Watson struggles with the other gamblers Mycroft leaves the men he was chatting to. The Corsac leaps down some steps and trips Sim up. She rolls out of the fall and draws a knife. The Corsac dodges her attack and punches her in the face. He thumps her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal. Sim gets to her feet clutching her nose and turns to Holmes. Dr Watson arrives a bit drunk. He falls over. Carruthers looks dubious. Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church. Sporting dark glasses and smoking his long pipe. Holmes turns around to a bruised and beaten Watson who is asleep beside him. He nudges Watson who stirs but does not awake. Holmes gets out of the vehicle walks round it and shoves Watson again. He still does not rouse."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holmes pulls him away and whacks him with a curtain rail. As they fight the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out of the window. The line between him and Holmes is pulled tight dragging Holmes towards the window. Holmes is wrenched backwards out of the window. He lands heavily on a barge carrying sand on the canal outside. The Corsac bursts up out of the sand and grabs him. Holmes breaks free and falls onto a lower deck. The Corsac tries to flee but Holmes yanks him back with the rope connecting them. Men grab them both. The men release Holmes and the Corsac. Holmes grabs a club off one of the men watching and whacks the Corsac in the face. Then he yanks on the rope pulling the Corsac over. The Corsac gets up again and cuts the rope linking them together. The Corsac starts to climb back up the window they fell from. Sim sees him coming and backs away from the window. One of the spectators urges Holmes on. Holmes shins up a rope hanging from a blockandtackle on the side of the building. The Corsac gets back inside. Watson collects his winnings from the other players. Holmes smashes through a window and crashes into Watson scattering all the money. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim who runs along the first. The Corsac leaps down onto her floor. Holmes picks himself up and gives chase. Watson notices the other players eyeing his winnings which are now scattered on the floor. A freeforall erupts as everyone lunges for the cash. As Watson struggles with the other gamblers Mycroft leaves the men he was chatting to. The Corsac leaps down some steps and trips Sim up. She rolls out of the fall and draws a knife. The Corsac dodges her attack and punches her in the face. He thumps her a second time and is about to strike with his own knife when Holmes intervenes. He kicks the Corsac out of a door and into the canal. Sim gets to her feet clutching her nose and turns to Holmes. Dr Watson arrives a bit drunk. He falls over. Carruthers looks dubious. Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church. Sporting dark glasses and smoking his long pipe. Holmes turns around to a bruised and beaten Watson who is asleep beside him. He nudges Watson who stirs but does not awake. Holmes gets out of the vehicle walks round it and shoves Watson again. He still does not rouse."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holmes pulls him away and whacks him with a curtain rail. As they fight the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out of the window. The line between him and Holmes is pulled tight dragging Holmes towards the window. Holmes is wrenched backwards out of the window. He lands heavily on a barge carrying sand on the canal outside. The Corsac bursts up out of the sand and grabs him. Holmes breaks free and falls onto a lower deck. The Corsac tries to flee but Holmes yanks him back with the rope connecting them. Men grab them both. The men release Holmes and the Corsac. Sim gets to her feet clutching her nose and turns to Holmes. Dr Watson arrives a bit drunk. He falls over. Carruthers looks dubious. Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church. Sporting dark glasses and smoking his long pipe. Holmes turns around to a bruised and beaten Watson who is asleep beside him. He nudges Watson who stirs but does not awake. Holmes gets out of the vehicle walks round it and shoves Watson again. He still does not rouse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holmes pulls him away and whacks him with a curtain rail. As they fight the Corsac attaches a line to Holmes' belt. Sim kicks the Corsac out of the window. The line between him and Holmes is pulled tight dragging Holmes towards the window. Holmes is wrenched backwards out of the window. Holmes turns around to a bruised and beaten Watson who is asleep beside him. He nudges Watson who stirs but does not awake. Holmes gets out of the vehicle walks round it and shoves Watson again. He still does not rouse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Whiskers hauls the rabbit aside and taps the rabbit with a broomstick. As they squabble, the fox fastens a string to Whiskers' hat. Gus nudges the fox off the balcony. The thread between the rabbit and Whiskers is pulled taut, dragging Whiskers towards the balcony. Whiskers is yanked forwards, out of the balcony. Whiskers lands softly on a raft carrying pebbles on the lake nearby. The fox erupts from under the pebbles and snatches the rabbit. Whiskers squirms loose and tumbles onto a lower platform. The fox attempts to escape, but Whiskers pulls the fox back with the cable linking them. Birds seize them both. The birds free Whiskers and the fox. Whiskers grabs a bat from one of the birds observing and slaps the fox in the beak. Then Whiskers tugs on the cable, toppling the fox over. The fox rises again and severs the cable connecting them. The fox starts to scale back up the balcony they descended from. Gus spots the fox approaching and retreats from the balcony. One of the bystanders encourages Whiskers. Whiskers climbs up a vine dangling from a pulley on the facade of the tower. The fox clambers back inside. Fletcher gathers the fox's spoils from the other contestants. Whiskers shatters through a wall and collides into Fletcher, scattering all the treasures. Whiskers sits up and observes the fox pouncing along the third floor ledge above Gus, who maneuvers along the second. The fox jumps down onto Gus's path. Whiskers rises and pursues. Fletcher notices the other contestants eyeing the treasures, which are now dispersed on the path. A melee breaks out as everyone dives for the riches. As Fletcher wrestles with the other gamblers, Hector departs from the owls he was gossiping with. The fox vaults down some stairs and stumbles Gus. Gus tumbles out of the spin and unsheathes a sword. The fox evades Gus's strike and jabs Gus in the leg. The fox nudges Gus a second time and is about to slash with the fox's own sword when Whiskers interrupts. Whiskers shoves the fox out of a hatch and into the lake. Gus regains footing, holding the leg, and turns to Whiskers. Dr. Fletcher arrives, slightly tipsy. Fletcher topples over. Roderick looks skeptical. Whiskers retrieves Gus's satchel and Quentin's map. The following morning, Whiskers rides a horse along a winding trail leading to a hamlet. The horse halts outside the tavern. Donning a floppy hat and munching a carrot, Whiskers spins around to a drowsy and injured Fletcher, who slumbers alongside. Whiskers nudges Fletcher, who stirs but doesn't awaken. Whiskers dismounts, circles the horse and prods Fletcher again. Fletcher still doesn't rouse."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holmes battles the Corsac, who attaches a line to Holmes' belt. Sim kicks the Corsac out of the window, pulling Holmes outside, where he lands on a sand barge. The Corsac attacks, but Holmes breaks free, dragging the Corsac back with a rope. After a struggle, the Corsac severs the rope and climbs back inside. Holmes follows, bursting through a window and scattering Watson's winnings. As the Corsac chases Sim, a brawl breaks out over the spilled cash. Holmes finally intervenes, kicking the Corsac into the canal. Sim, injured, acknowledges Holmes as Watson drunkenly arrives. The next day, Holmes retrieves Sim's bag and drives to a village church with a bruised, sleeping Watson."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Holmes gets out of the vehicle walks round it and shoves Watson again He still doesn't rouse He nudges Watson who stirs but doesn't awake  Holmes turns around to a bruised and beaten Watson who is asleep beside him  Sporting dark glasses and smoking his long pipe  Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church  Carruthers looks dubious  He falls over  Dr Watson arrives a bit drunk  Sim gets to her feet clutching her nose and turns to Holmes  He kicks the Corsac out of a door and into the canal  He thumps her a second time and is about to strike with his own knife when Holmes intervenes  The Corsac dodges her attack and punches her in the face  She rolls out of the fall and draws a knife  The Corsac leaps down some steps and trips Sim up  As Watson struggles with the other gamblers Mycroft leaves the men he was chatting to  A freeforall erupts as everyone lunges for the cash  Watson notices the other players eyeing his winnings which are now scattered on the floor  Holmes picks himself up and gives chase  The Corsac leaps down onto her floor  Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim who runs along the first  Holmes smashes through a window and crashes into Watson scattering all the money  Watson collects his winnings from the other players  The Corsac gets back inside  Holmes shins up a rope hanging from a blockandtackle on the side of the building  One of the spectators urges Holmes on  Sim sees him coming and backs away from the window  The Corsac starts to climb back up the window they fell from  The Corsac gets up again and cuts the rope linking them together  Then he yanks on the rope pulling the Corsac over  Holmes grabs a club off one of the men watching and whacks the Corsac in the face  The men release Holmes and the Corsac  Men grab them both  The Corsac tries to flee but Holmes yanks him back with the rope connecting them  Holmes breaks free and falls onto a lower deck  The Corsac bursts up out of the sand and grabs him  He lands heavily on a barge carrying sand on the canal outside  Holmes is wrenched backwards out of the window  The line between him and Holmes is pulled tight dragging Holmes towards the window  Sim kicks the Corsac out of the window  As they fight the Corsac attaches a line to Holmes' belt  Holmes pulls him away and whacks him with a curtain rail "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As they fight the Corsac attaches a line to Holmes' belt Holmes pulls him away and whacks him with a curtain rail The line between him and Holmes is pulled tight dragging Holmes towards the window Sim kicks the Corsac out of the window He lands heavily on a barge carrying sand on the canal outside Holmes is wrenched backwards out of the window Holmes breaks free and falls onto a lower deck The Corsac bursts up out of the sand and grabs him Men grab them both The Corsac tries to flee but Holmes yanks him back with the rope connecting them Holmes grabs a club off one of the men watching and whacks the Corsac in the face The men release Holmes and the Corsac The Corsac gets up again and cuts the rope linking them together Then he yanks on the rope pulling the Corsac over Sim sees him coming and backs away from the window The Corsac starts to climb back up the window they fell from Holmes shins up a rope hanging from a blockandtackle on the side of the building One of the spectators urges Holmes on Watson collects his winnings from the other players The Corsac gets back inside Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim who runs along the first Holmes smashes through a window and crashes into Watson scattering all the money Holmes picks himself up and gives chase The Corsac leaps down onto her floor A freeforall erupts as everyone lunges for the cash Watson notices the other players eyeing his winnings which are now scattered on the floor The Corsac leaps down some steps and trips Sim up As Watson struggles with the other gamblers Mycroft leaves the men he was chatting to The Corsac dodges her attack and punches her in the face She rolls out of the fall and draws a knife He kicks the Corsac out of a door and into the canal He thumps her a second time and is about to strike with his own knife when Holmes intervenes Dr Watson arrives a bit drunk Sim gets to her feet clutching her nose and turns to Holmes Carruthers looks dubious He falls over Sporting dark glasses and smoking his long pipe Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church He nudges Watson who stirs but does not awake Holmes turns around to a bruised and beaten Watson who is asleep beside him He still does not rouse Holmes gets out of the vehicle walks round it and shoves Watson again"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Holmes sits up and sees the Corsac bounding along the second floor balcony above Sim who runs along the first  The Corsac leaps down onto her floor  Holmes picks himself up and gives chase  Watson notices the other players eyeing his winnings which are now scattered on the floor  A freeforall erupts as everyone lunges for the cash  As Watson struggles with the other gamblers Mycroft leaves the men he was chatting to  The Corsac leaps down some steps and trips Sim up  She rolls out of the fall and draws a knife  The Corsac dodges her attack and punches her in the face  He thumps her a second time and is about to strike with his own knife when Holmes intervenes  He kicks the Corsac out of a door and into the canal  Sim gets to her feet clutching her nose and turns to Holmes  Dr Watson arrives a bit drunk  He falls over  Carruthers looks dubious  Holmes retrieves Sim's bag and Rene's letter The next day he drives his car along a narrow road leading to a village The car pulls up outside the church  Sporting dark glasses and smoking his long pipe  Holmes turns around to a bruised and beaten Watson who is asleep beside him  He nudges Watson who stirs but doesn't awake  Holmes gets out of the vehicle walks round it and shoves Watson again He still doesn't rouse Holmes pulls him away and whacks him with a curtain rail  As they fight the Corsac attaches a line to Holmes' belt  Sim kicks the Corsac out of the window  The line between him and Holmes is pulled tight dragging Holmes towards the window  Holmes is wrenched backwards out of the window  He lands heavily on a barge carrying sand on the canal outside  The Corsac bursts up out of the sand and grabs him  Holmes breaks free and falls onto a lower deck  The Corsac tries to flee but Holmes yanks him back with the rope connecting them  Men grab them both  The men release Holmes and the Corsac  Holmes grabs a club off one of the men watching and whacks the Corsac in the face  Then he yanks on the rope pulling the Corsac over  The Corsac gets up again and cuts the rope linking them together  The Corsac starts to climb back up the window they fell from  Sim sees him coming and backs away from the window  One of the spectators urges Holmes on  Holmes shins up a rope hanging from a blockandtackle on the side of the building  The Corsac gets back inside  Watson collects his winnings from the other players  Holmes smashes through a window and crashes into Watson scattering all the money "
        }
      ]
    }
  ]
}