{
  "ground_truth": "Holmes spots two pipers outside the church and gestures for them to play. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket. Watson clings to it, so Holmes yanks it from his grasp. A couple of empty bottles fall out of the car as Watson struggles out of it. As Holmes tries to tidy him up, the sleeve of Watson's jacket rips off. Holmes tosses it into the car. Watson eyes him wearily, and Holmes nods. They clasp hands, and Holmes leads a shambling Watson towards the church. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet, including Mrs. Hudson, who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A spruced-up Watson is standing beside him. Holmes quickly adjusts Watson's tie and buttonhole, before Watson lifts the bride's veil. She smiles up at him and sees he's sporting a black eye and generally looks knocked about. She looks over at Holmes, who winks reassuringly. Watson places the ring on his new wife's finger, and they share a kiss. Holmes looks down thoughtfully. As Watson and his bride leave the church, they walk beneath the raised swords of several guardsmen. Standing alone by the latched gate of the churchyard, Holmes applauds. Holmes disappears through the gate and cranks his car's engine into life. Moriarty's bearded agent is leaning against the side of the car. The agent rolls a cigarette. The agent steps aside and Holmes pulls away in a cloud of smoke. Kings College, Cambridge. Puffing on his pipe, Holmes makes his way across a quadrangle and goes into a building. Holmes walks into a room where a gramophone is playing. Moriarty and another man, Matthew, are there. Moriarty looks round at him. As Moriarty sits at his desk and signs the book, Holmes walks behind him and looks at a blackboard covered in calculations. Moriarty looks up. Holmes spots a book by the blackboard. Holmes sees a dying plant nearby. Moriarty hands the signed asteroid book back to Holmes. They shake hands. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene. Irene's tea was poisoned. He shows Holmes her bloodstained handkerchief. Moriarty sits at a chessboard and picks up the black queen. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the chessboard. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the chessboard. He moves the black queen. Watson and his wife, Mary, are at the station. They make their way to a waiting train. Watson notices some soldiers.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holmes detects two musicians outside the chapel and signals for them to perform. Watson awakes with a horrified expression. Holmes begins tugging at a jacket Watson is using as a cover. Watson grips onto it, so Holmes wrenches it from his hold. A pair of vacant bottles tumble out of the vehicle as Watson struggles out of it. As Holmes attempts to groom him, the sleeve of Watson's coat tears off. Holmes flings it into the vehicle. Watson observes him tiredly, and Holmes nods. They clasp hands, and Holmes guides a staggering Watson towards the chapel. The attendees are in their positions as the bride makes her way up the aisle. Everyone rises to their feet, including Mrs. Hudson, who taps a dozing Holmes on the shoulder. He awakens and stands to his feet. A polished Watson is standing beside him. Holmes swiftly adjusts Watson's tie and boutonniere, before Watson lifts the bride's veil. She smiles at him and notices he's bearing a black eye and generally appears battered. She glances over at Holmes, who winks encouragingly. Watson places the ring on his new wife's finger, and they share a kiss. Holmes gazes down pensively. As Watson and his bride exit the chapel, they walk beneath the raised blades of several guardsmen. Standing alone by the latched gate of the churchyard, Holmes applauds. Holmes vanishes through the gate and starts his vehicle's engine into life. Moriarty's bearded emissary is leaning against the side of the vehicle. The emissary rolls a cigarette. The emissary steps aside and Holmes departs in a cloud of smoke. Kings College, Cambridge. Puffing on his pipe, Holmes makes his way across a courtyard and enters a building. Holmes strides into a room where a phonograph is playing. Moriarty and another man, Matthew, are present. Moriarty glances round at him. As Moriarty sits at his desk and signs the tome, Holmes walks behind him and looks at a chalkboard covered in computations. Moriarty glances up. Holmes detects a tome by the chalkboard. Holmes spots a withering plant nearby. Moriarty hands the signed asteroid tome back to Holmes. They shake hands. Holmes steps away and examines the signature. Moriarty stands up. A flashback to Irene. Irene's tea was tainted. He shows Holmes her bloodstained handkerchief. Moriarty sits at a chessboard and lifts the black queen. Holmes gazes down pensively. He picks up Irene's handkerchief from the chessboard. Holmes glowers at him then makes to depart. Moriarty watches after Holmes then redirects his attention back to the chessboard. He shifts the black queen. Watson and his spouse, Mary, are at the depot. They make their way to a waiting train. Watson notices some soldiers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Two pipers are spotted by Holmes outside the church, and they are gestured to play by him. An appalled expression is awakened on Watson's face. A coat being used as a blanket by Watson is started to be pulled at by Holmes. It is clung to by Watson, so the coat is yanked from his grasp by Holmes. A couple of empty bottles are caused to fall out of the car as Watson struggles out of it. As Holmes is trying to tidy him up, Watson's jacket sleeve is ripped off. It is tossed into the car by Holmes. Holmes is eyed wearily by Watson, and he is nodded at. Their hands are clasped, and a shambling Watson is led towards the church by Holmes. Their places are taken by the guests as the bride is making her way up the aisle. Their feet are gotten to by everyone, including Mrs. Hudson, who taps a slumbering Holmes on the shoulder. He is brought to and rises to his feet. Beside him is standing a spruced-up Watson. Watson's tie and buttonhole are quickly adjusted by Holmes, before the bride's veil is lifted by Watson. A smile is given up to him by her, and a black eye and a generally knocked-about look are seen on him. Holmes is looked over at by her, who winks reassuringly. The ring is placed on his new wife's finger by Watson, and a kiss is shared by them. Thoughtfully, Holmes looks down. As the church is left by Watson and his bride, they walk beneath the raised swords of several guardsmen. Alone by the latched gate of the churchyard stands Holmes, applauding. Through the gate, Holmes disappears and his car's engine is cranked into life by him. Against the side of the car leans Moriarty's bearded agent. A cigarette is rolled by the agent. The agent steps aside, and in a cloud of smoke, Holmes pulls away. At Kings College, Cambridge, puffing on his pipe, Holmes makes his way across a quadrangle and into a building goes him. Into a room where a gramophone is playing walks Holmes. Moriarty and another man, Matthew, are there. Moriarty, looking round at him, sits at his desk and signs the book while Holmes is walked behind him, looking at a blackboard covered in calculations. Moriarty looks up. By the blackboard, a book is spotted by Holmes. Nearby, a dying plant is seen by Holmes. The signed asteroid book is handed back to Holmes by Moriarty. Their hands are shaken. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene happens. Irene has her tea poisoned. Holmes is shown her bloodstained handkerchief. At a chessboard, Moriarty sits and picks up the black queen. Thoughtfully, Holmes looks down. From the chessboard, Irene's handkerchief is picked up by him. Holmes glares at him then makes to go. After Holmes, Moriarty stares, then his attention is turned back to the chessboard. The black queen is moved by him. At the station are Watson and his wife, Mary. Their way is made to a waiting train by them. Some soldiers are noticed by Watson."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holmes spots two pipers outside the church and signals them to play. Watson wakes with a horrified look as Holmes pulls at a coat he's using as a blanket. Watson resists, but Holmes yanks it away, sending empty bottles tumbling from the car. While tidying Watson, Holmes accidentally rips off his sleeve and tosses it back in. Watson eyes him warily; Holmes nods. They clasp hands, and Holmes leads a staggering Watson to the church. Guests are seated as the bride walks up the aisle. Everyone rises, including Mrs. Hudson, who rouses Holmes. He stands beside a cleaned-up Watson, quickly adjusting his tie and buttonhole. Watson lifts the bride’s veil; she smiles, noticing his black eye. She glances at Holmes, who winks. Watson places the ring and they kiss. Holmes looks on pensively. As the couple exits under raised swords, Holmes applauds alone by the churchyard gate. He disappears through it and starts his car. Moriarty’s bearded agent leans nearby, rolls a cigarette, then steps aside as Holmes drives off. At Kings College, Cambridge, Holmes smokes his pipe, crosses a quadrangle, and enters a building. Inside, a gramophone plays as he meets Moriarty and Matthew. Moriarty signs a book; Holmes examines a blackboard with calculations and a dying plant. Moriarty returns the signed asteroid book, and they shake hands. Holmes inspects the signature. A flashback reveals Irene’s poisoned tea and bloodied handkerchief. Moriarty picks up the black queen on a chessboard. Holmes, holding Irene’s handkerchief, glares and turns to leave. Moriarty watches him go, then resumes his game. Meanwhile, Watson and Mary arrive at the station and head to their train. Watson notices some soldiers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holmes gestures to two pipers outside the church to play. Watson wakes up, appalled, as Holmes pulls a coat from him, causing empty bottles to fall from the car. Holmes tidies Watson, ripping his jacket sleeve, which he tosses into the car. They clasp hands, and Holmes leads Watson to the church. Guests stand as the bride walks up the aisle. Mrs. Hudson wakes Holmes, who stands beside a spruced-up Watson. Holmes adjusts Watson's tie before he lifts the bride's veil. She smiles, noticing his black eye, and looks at Holmes, who winks. Watson places the ring on her finger, and they kiss. Holmes applauds as they leave under raised swords. Holmes starts his car, where Moriarty's agent leans, smoking. The agent steps aside, and Holmes drives off. At Kings College, Cambridge, Holmes enters a building, finding Moriarty and Matthew. Moriarty signs a book, and Holmes notices a blackboard and a dying plant. Moriarty returns the signed book, and they shake hands. A flashback shows Irene's poisoned tea and bloodstained handkerchief. Moriarty sits at a chessboard, picking up the black queen. Holmes glares, picks up Irene's handkerchief, and leaves. Moriarty watches him go, then moves the black queen. Watson and Mary head to a train, noticing soldiers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holmes, with his keen eye for detail, notices two pipers standing just outside the church and signals to them with a gesture, encouraging them to begin playing their instruments. Meanwhile, Watson awakens with a look of shock and dismay on his face. Holmes, ever the practical one, starts tugging at a coat that Watson is using as a makeshift blanket. Watson, however, holds onto it tightly, prompting Holmes to give it a firm yank, pulling it from Watson's grasp. As Watson struggles to extricate himself from the car, a couple of empty bottles tumble out, clattering to the ground. In an attempt to tidy Watson up, Holmes inadvertently tears the sleeve off Watson's jacket and casually tosses it back into the car. Watson, with a weary expression, looks at Holmes, who responds with a nod of understanding. They clasp hands in a gesture of camaraderie, and Holmes guides a somewhat disheveled Watson towards the church. Inside, the guests are already seated, and the bride is gracefully making her way up the aisle. As she approaches, everyone rises to their feet, including Mrs. Hudson, who gently taps a dozing Holmes on the shoulder to wake him. He quickly comes to and stands up. Beside him, Watson, now looking more presentable, stands ready. Holmes swiftly adjusts Watson's tie and buttonhole, ensuring everything is in place, before Watson lifts the bride's veil. She gazes up at him with a smile, noticing his black eye and generally roughed-up appearance. Her eyes shift to Holmes, who gives her a reassuring wink. Watson then places the ring on his new wife's finger, and they share a tender kiss. Holmes looks down, lost in thought. As Watson and his bride exit the church, they walk beneath the raised swords of several guardsmen, a traditional and honorable gesture. Standing alone by the latched gate of the churchyard, Holmes applauds their union. He then quietly slips through the gate and starts his car's engine. Nearby, Moriarty's bearded agent leans casually against the side of the car, rolling a cigarette. The agent steps aside, allowing Holmes to drive away, leaving a cloud of smoke in his wake. At Kings College, Cambridge, Holmes, with his pipe in hand, makes his way across a quadrangle and enters a building. Inside, he walks into a room where a gramophone is playing. Moriarty and another man, Matthew, are present. Moriarty turns to look at Holmes. As Moriarty sits at his desk, signing a book, Holmes moves behind him, observing a blackboard filled with complex calculations. Moriarty glances up. Holmes notices a book by the blackboard and a nearby plant that appears to be dying. Moriarty hands the signed asteroid book back to Holmes, and they shake hands. Holmes steps back, examining the signature. Moriarty rises from his seat. A flashback reveals Irene, whose tea was poisoned. Moriarty shows Holmes her bloodstained handkerchief. Moriarty then sits at a chessboard, picking up the black queen. Holmes looks down, deep in thought, and picks up Irene's handkerchief from the chessboard. He glares at Moriarty before turning to leave. Moriarty watches Holmes go, then refocuses on the chessboard, moving the black queen. Meanwhile, Watson and his wife, Mary, are at the station, making their way to a waiting train. Watson takes note of some soldiers nearby."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holmes, possessing an exceptionally keen eye for even the most minute detail, notices two pipers who are positioned just outside the church gates. He signals to them with a distinct gesture, encouraging and prompting them to begin playing their melodious instruments. Meanwhile, Watson stirs from his slumber with a look of sheer shock and dismay evident on his face. Holmes, ever the practical and efficient one, starts tugging insistently at a coat that Watson has been using as a makeshift blanket. Watson, however, clings onto it tightly, prompting Holmes to exert a firm yank, managing to pull it decisively from Watson's grasp. As Watson struggles to extricate himself from the confines of the car, a couple of empty bottles tumble out, clattering noisily onto the ground. In a well-meaning attempt to tidy Watson up, Holmes inadvertently tears the sleeve right off Watson's jacket and casually tosses the torn fabric back into the car. Watson, wearing a weary expression, looks over at Holmes, who responds with a nod full of understanding and empathy. They clasp hands in a gesture of camaraderie and friendship, as Holmes steers a somewhat disheveled Watson toward the welcoming entrance of the church. Inside, within the church's walls, the guests are already comfortably seated, and the radiant bride is gracefully making her way up the aisle. As she approaches, everyone rises to their feet in unison, including Mrs. Hudson, who gently taps a dozing Holmes on the shoulder, bringing him back to alertness. He quickly comes to his senses and stands up. Beside him, Watson, now looking significantly more presentable, stands ready and poised. Holmes swiftly adjusts Watson's tie and buttonhole, ensuring everything is in perfect place, before Watson gently lifts the bride's delicate veil. She gazes up at him with a warm smile, noticing his black eye and generally roughed-up appearance. Her eyes then shift to meet Holmes's, who gives her a reassuring and confident wink. Watson then carefully places the ring on his new wife's finger, and they share a tender, heartfelt kiss. Holmes looks down, momentarily lost in deep thought. As Watson and his beautiful bride exit the church, they walk beneath the raised swords of several guardsmen, performing a traditional and honorable gesture. Standing alone by the latched gate of the churchyard, Holmes applauds their union. He then quietly and discreetly slips through the gate and starts the engine of his car. Nearby, Moriarty's bearded agent leans casually against the side of the car, nonchalantly rolling a cigarette. The agent steps aside, granting Holmes the path to drive away, leaving behind a cloud of smoke in his wake. At Kings College in Cambridge, pipe in hand, Holmes makes his way across a picturesque quadrangle and enters a stately building. Inside, he walks into a room where the soft sounds of a gramophone are playing. Moriarty and another man, Matthew, are already present. Moriarty turns his gaze to look at Holmes. As Moriarty sits at his desk, signing a book, Holmes moves behind him, observing a blackboard filled with intricate and complex calculations. Moriarty glances up at Holmes. Holmes notices a book by the blackboard and a nearby plant that appears to be lifeless and dying. Moriarty hands the signed asteroid book back to Holmes, and they shake hands firmly. Holmes steps back, intently examining the signature. Moriarty rises from his seat. A flashback reveals Irene, whose tea was maliciously poisoned. Moriarty shows Holmes her bloodstained handkerchief. Moriarty then sits at a chessboard, thoughtfully picking up the black queen. Holmes looks down, deep in contemplation, and picks up Irene's handkerchief from the chessboard. He glares at Moriarty before turning to leave. Moriarty watches Holmes go, then refocuses his attention on the chessboard, moving the black queen with deliberation. Meanwhile, Watson and his wife, Mary, find themselves at the bustling station, making their way to a waiting train. Watson takes note of some soldiers nearby, observing them with a sense of curiosity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holmes, standing outside the church, notices two pipers and signals them with a gesture to begin playing their instruments. Meanwhile, Watson awakens with a look of shock and dismay on his face. Holmes, seeing Watson using a coat as a makeshift blanket, begins to tug at it. Watson, reluctant to give it up, holds on tightly, but Holmes gives a firm yank, pulling it from Watson's grasp. As Watson struggles to extricate himself from the car, a couple of empty bottles tumble out, clattering to the ground. Holmes attempts to tidy Watson's disheveled appearance, but in the process, the sleeve of Watson's jacket tears off. Without hesitation, Holmes tosses the torn sleeve back into the car. Watson, looking at Holmes with weary eyes, receives a nod of acknowledgment. They clasp hands in a moment of camaraderie, and Holmes guides a stumbling Watson towards the church. Inside, the guests are already seated, and the bride begins her walk up the aisle. As everyone rises to their feet, Mrs. Hudson gently taps a dozing Holmes on the shoulder, rousing him to stand. Beside him, Watson, now looking more presentable, stands ready. Holmes quickly makes final adjustments to Watson's tie and buttonhole. Watson then lifts the bride's veil, revealing her smiling face, though she notices his black eye and generally battered appearance. She glances at Holmes, who offers a reassuring wink. Watson places the wedding ring on his new wife's finger, and they share a tender kiss. Holmes, observing the scene, looks down in contemplation. As the newlyweds exit the church, they pass beneath the ceremonial arch of raised swords held by several guardsmen. Holmes, standing alone by the churchyard gate, applauds their departure. He then slips through the gate and starts his car, cranking the engine to life. Nearby, Moriarty's bearded agent leans casually against the car, rolling a cigarette. The agent steps aside as Holmes drives away, leaving a cloud of smoke in his wake. At Kings College, Cambridge, Holmes, with his pipe in hand, crosses a quadrangle and enters a building. Inside, he walks into a room where a gramophone is playing, and finds Moriarty and another man, Matthew, present. Moriarty turns to acknowledge Holmes. As Moriarty sits at his desk to sign a book, Holmes moves behind him, examining a blackboard filled with complex calculations. Moriarty glances up, and Holmes notices a book by the blackboard and a nearby dying plant. Moriarty hands the signed asteroid book back to Holmes, and they exchange a handshake. Holmes steps back, inspecting the signature. Moriarty rises from his seat, triggering a flashback to Irene, whose tea was poisoned. Moriarty shows Holmes her bloodstained handkerchief. Moriarty then sits at a chessboard, picking up the black queen. Holmes, deep in thought, picks up Irene's handkerchief from the chessboard, glaring at Moriarty before turning to leave. Moriarty watches Holmes depart, then refocuses on the chessboard, moving the black queen. Meanwhile, Watson and his wife, Mary, are at the station, making their way to a waiting train. Watson takes note of some soldiers nearby."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holmes gestures for two pipers outside the church to play, waking Watson with an appalled expression. Holmes pulls a coat from Watson, causing empty bottles to fall as Watson exits the car. While tidying Watson, Holmes accidentally rips off a jacket sleeve and tosses it aside. They clasp hands, and Holmes leads a disheveled Watson toward the church. Inside, guests rise as the bride walks up the aisle. Mrs. Hudson taps a slumbering Holmes, who stands beside a spruced-up Watson. Holmes adjusts Watson's tie and buttonhole before Watson lifts the bride's veil, revealing his black eye. She smiles, glancing at Holmes, who winks reassuringly. Watson places the ring on her finger, and they kiss. Holmes watches thoughtfully. As the couple exits the church under raised swords, Holmes applauds from the gate, then starts his car. Moriarty's agent, leaning against the car, steps aside as Holmes drives off in a cloud of smoke.\n\nAt Kings College, Cambridge, Holmes, puffing on his pipe, enters a building and finds Moriarty and Matthew in a room with a gramophone playing. Moriarty signs a book at his desk while Holmes examines a blackboard of calculations and a nearby book. Moriarty returns the signed book, and they shake hands. Holmes recalls Irene's poisoned tea and her bloodstained handkerchief. Moriarty, at a chessboard, picks up the black queen as Holmes glares and prepares to leave. Moriarty watches Holmes depart, then resumes his focus on the chessboard, moving the black queen. Meanwhile, Watson and his wife, Mary, arrive at a station and head toward a waiting train, noticing some soldiers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holmes, known for his keen observational skills, spots two pipers outside the church and gestures for them to play, adding a traditional celebratory air with their bagpipes, an instrument often used in ceremonial occasions in Scotland. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket, the coat itself a high-quality garment from a London tailor. Watson clings to it, so Holmes yanks it from his grasp. A couple of empty champagne bottles, remnants of the previous night's bachelor party, fall out of the car as Watson struggles out of it. As Holmes tries to tidy him up, the sleeve of Watson's jacket, a favorite piece he's worn for many adventures, rips off. Holmes tosses it into the car. Watson eyes him wearily, and Holmes nods. They clasp hands, and Holmes leads a shambling Watson towards the historic stone church, a popular wedding venue for its beautiful stained glass. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet, including Mrs. Hudson, Holmes and Watson's long-suffering landlady who has seen them through many escapades, who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A spruced-up Watson, well-liked by his peers, is standing beside him. Holmes quickly adjusts Watson's tie and buttonhole, before Watson lifts the bride's veil. She smiles up at him and sees he's sporting a black eye, the result of a recent brawl, and generally looks knocked about. She looks over at Holmes, who winks reassuringly. Watson places the ring on his new wife's finger, a ring with a delicate sapphire, and they share a kiss. Holmes looks down thoughtfully. As Watson and his bride leave the church, they walk beneath the raised swords of several guardsmen, a traditional military send-off for officers. Standing alone by the latched gate of the churchyard, Holmes applauds. Holmes disappears through the gate and cranks his vintage car's engine into life. Moriarty's bearded agent, known for his espionage skills, is leaning against the side of the car. The agent rolls a cigarette, exuding an air of casual menace. The agent steps aside and Holmes pulls away in a cloud of smoke. At Kings College, Cambridge, one of the most prestigious universities in the world, puffing on his pipe, Holmes makes his way across a quadrangle and goes into a building. Holmes walks into a room where a gramophone is playing an old classical record. Moriarty, a criminal genius and Holmes's arch-nemesis, and another man, Matthew, are there. Moriarty, with his usual calculating demeanor, looks round at him. As Moriarty sits at his desk and signs the book, Holmes walks behind him and looks at a blackboard covered in calculations related to celestial mechanics. Moriarty looks up. Holmes spots a book by the blackboard, a rare first edition on astronomy. Holmes sees a dying plant nearby, indicative of the neglected state of Moriarty's scholarly interests. Moriarty hands the signed asteroid book back to Holmes. They shake hands. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene, Holmes's former love interest whose intelligence matched his own. Irene's tea was poisoned, a sinister act of retribution. He shows Holmes her bloodstained handkerchief, a stark symbol of her untimely death. Moriarty sits at a chessboard and picks up the black queen, a piece often symbolizing strategic power plays. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the chessboard. Holmes glares at him then makes to go. Moriarty stares after Holmes, his mind working on his next move, then turns his attention back to the chessboard. He moves the black queen. Watson and his wife, Mary, are at the station, a bustling hub connecting various parts of the country. They make their way to a waiting train. Watson notices some soldiers, perhaps on their way to their next posting, reminding him of his own military past."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Holmes spots two pipers outside the church and gestures for them to play  Watson awakes with an appalled expression  Holmes starts pulling at a coat  Watson is using as a blanket  Watson clings to it so Holmes yanks it from his grasp  A couple of empty bottles fall out of the car as Watson struggles out of it  As Holmes tries to tidy him up the sleeve of Watson's jacket rips off  Standing alone by the latched gate of the churchyard  Holmes applauds  Holmes disappears through the gate and cranks his car's engine into life  Moriarty's bearded agent is leaning against the side of the car  The agent rolls a cigarette  The agent steps aside and Holmes pulls away in a cloud of smoke  Kings College Cambridge  Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building  Holmes walks into a room where a gramophone is playing  Moriarty and another man Matthew are there  Moriarty looks round at him  As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations  Moriarty looks up  Holmes spots a book by the blackboard  Holmes sees a dying plant nearby  Moriarty hands the signed asteroid book back to Holmes  They shake hands  Holmes steps away and looks at the signature  Moriarty gets up  A flashback to Irene  Irene's tea was poisoned  He shows Holmes her bloodstained handkerchief  Moriarty sits at a chessboard and picks up the black queen  Holmes looks down thoughtfully  He picks up Irene's handkerchief from the chessboard  Holmes glares at him then makes to go  Holmes tosses it into the car  Watson eyes him wearily and Holmes nods  They clasp hands and Holmes leads a shambling Watson towards the church  The guests are in their places as the bride makes her way up the aisle  Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder  He comes to and rises to his feet  A sprucedup Watson is standing beside him  Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil  She smiles up at him and sees he's sporting a black eye and generally looks knocked about  She looks over at Holmes who winks reassuringly  Watson places the ring on his new wife's finger and they share a kiss  Holmes looks down thoughtfully  As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen  Standing alone by the latched gate of the churchyard  Holmes applauds  Holmes disappears through the gate and cranks his car's engine into life  Moriarty's bearded agent is leaning against the side of the car  The agent rolls a cigarette  The agent steps aside and Holmes pulls away in a cloud of smoke  Kings College Cambridge  Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building  Holmes walks into a room where a gramophone is playing  Moriarty and another man Matthew are there  Moriarty looks round at him  As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations  Moriarty looks up  Holmes spots a book by the blackboard  Holmes sees a dying plant nearby  Moriarty hands the signed asteroid book back to Holmes  They shake hands  Holmes steps away and looks at the signature  Moriarty gets up  A flashback to Irene  Irene's tea was poisoned  He shows Holmes her bloodstained handkerchief  Moriarty sits at a chessboard and picks up the black queen  Holmes looks down thoughtfully  He picks up Irene's handkerchief from the chessboard  Holmes glares at him then makes to go  Moriarty stares after Holmes then turns his attention back to the chessboard  He moves the black queen  Watson and his wife Mary are at the station  They make their way to a waiting train  Watson notices some soldiers"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Holmes spots two pipers outside the church and gestures for them to play. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket. Watson clings to it so Holmes yanks it from his grasp. A couple of empty bottles fall out of the car as Watson struggles out of it. As Holmes tries to tidy him up the sleeve of Watson's jacket rips off. Holmes tosses it into the car. Watson eyes him wearily and Holmes nods. They clasp hands and Holmes leads a shambling Watson towards the church. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A sprucedup Watson is standing beside him. Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil. She smiles up at him and sees he is sporting a black eye and generally looks knocked about. She looks over at Holmes who winks reassuringly. Watson places the ring on his new wife's finger and they share a kiss. Holmes looks down thoughtfully. As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen. Standing alone by the latched gate of the churchyard. Holmes applauds. Holmes disappears through the gate and cranks his car's engine into life. Moriarty's bearded agent is leaning against the side of the car. The agent rolls a cigarette. The agent steps aside and Holmes pulls away in a cloud of smoke. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Kings College Cambridge. Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building. Holmes walks into a room where a gramophone is playing. Moriarty and another man Matthew are there. Moriarty looks round at him. As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations. Moriarty looks up. Holmes spots a book by the blackboard. Holmes sees a dying plant nearby. Moriarty hands the signed asteroid book back to Holmes. They shake hands. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene. Irene's tea was poisoned. He shows Holmes her bloodstained handkerchief. Moriarty sits at a chessboard and picks up the black queen. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the chessboard. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the chessboard. He moves the black queen. Watson and his wife Mary are at the station. They make their way to a waiting train. Watson notices some soldiers."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Holmes spots two pipers outside the church and gestures for them to play. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket. Watson clings to it so Holmes yanks it from his grasp. A couple of empty bottles fall out of the car as Watson struggles out of it. As Holmes tries to tidy him up the sleeve of Watson's jacket rips off. Holmes tosses it into the car. Watson eyes him wearily and Holmes nods. They clasp hands and Holmes leads a shambling Watson towards the church. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A sprucedup Watson is standing beside him. Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil. She smiles up at him and sees he is sporting a black eye and generally looks knocked about. She looks over at Holmes who winks reassuringly. Watson places the ring on his new wife's finger and they share a kiss. Holmes looks down thoughtfully. As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen. Standing alone by the latched gate of the churchyard. Holmes applauds. Holmes disappears through the gate and cranks his car's engine into life. Moriarty's bearded agent is leaning against the side of the car. The agent rolls a cigarette. The agent steps aside and Holmes pulls away in a cloud of smoke. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Kings College Cambridge. Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building. Holmes walks into a room where a gramophone is playing. Moriarty and another man Matthew are there. Moriarty looks round at him. As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations. Moriarty looks up. Holmes spots a book by the blackboard. Holmes sees a dying plant nearby. Moriarty hands the signed asteroid book back to Holmes. They shake hands. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene. Irene's tea was poisoned. He shows Holmes her bloodstained handkerchief. Moriarty sits at a chessboard and picks up the black queen. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the chessboard. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the chessboard. He moves the black queen. Watson and his wife Mary are at the station. They make their way to a waiting train. Watson notices some soldiers."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Holmes spots two pipers outside the church and gestures for them to play. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket. Watson clings to it so Holmes yanks it from his grasp. A couple of empty bottles fall out of the car as Watson struggles out of it. As Holmes tries to tidy him up the sleeve of Watson's jacket rips off. Holmes tosses it into the car. Watson eyes him wearily and Holmes nods. They clasp hands and Holmes leads a shambling Watson towards the church. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A sprucedup Watson is standing beside him. A flashback to Irene. Irene's tea was poisoned. He shows Holmes her bloodstained handkerchief. Moriarty sits at a chessboard and picks up the black queen. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the chessboard. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the chessboard. He moves the black queen. Watson and his wife Mary are at the station. They make their way to a waiting train. Watson notices some soldiers."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Holmes spots two pipers outside the church and gestures for them to play. Watson awakes with an appalled expression. Holmes starts pulling at a coat Watson is using as a blanket. Watson clings to it so Holmes yanks it from his grasp. A couple of empty bottles fall out of the car as Watson struggles out of it. Moriarty stares after Holmes then turns his attention back to the chessboard. He moves the black queen. Watson and his wife Mary are at the station. They make their way to a waiting train. Watson notices some soldiers."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A squirrel spots two pipers outside the church and gestures for them to play. A rabbit awakes with an appalled expression. The squirrel starts pulling at a coat the rabbit is using as a blanket. The rabbit clings to it, so the squirrel yanks it from the rabbit's grasp. A couple of empty bottles fall out of the car as the rabbit struggles out of it. As the squirrel tries to tidy the rabbit up, the sleeve of the rabbit's jacket rips off. The squirrel tosses it into the car. The rabbit eyes the squirrel wearily, and the squirrel nods. They clasp hands, and the squirrel leads a shambling rabbit towards the church. The guests are in their places as the bride makes her way up the aisle. Everyone gets to their feet, including a hedgehog, who taps a slumbering squirrel on the shoulder. It comes to and rises to its feet. A spruced-up rabbit is standing beside it. The squirrel quickly adjusts the rabbit's tie and buttonhole before the rabbit lifts the bride's veil. She smiles up at the rabbit and sees it's sporting a black eye and generally looks knocked about. She looks over at the squirrel, which winks reassuringly. The rabbit places the ring on its new wife's finger, and they share a kiss. The squirrel looks down thoughtfully. As the rabbit and its bride leave the church, they walk beneath the raised swords of several guardsmen. Standing alone by the latched gate of the churchyard, the squirrel applauds. The squirrel disappears through the gate and cranks its car's engine into life. A badger's bearded agent is leaning against the side of the car. The agent rolls a cigarette. The agent steps aside, and the squirrel pulls away in a cloud of smoke. Kings College, Cambridge. Puffing on its pipe, the squirrel makes its way across a quadrangle and goes into a building. The squirrel walks into a room where a gramophone is playing. A badger and another man, Matthew, are there. The badger looks round at the squirrel. As the badger sits at its desk and signs the book, the squirrel walks behind it and looks at a blackboard covered in calculations. The badger looks up. The squirrel spots a book by the blackboard. The squirrel sees a dying plant nearby. The badger hands the signed asteroid book back to the squirrel. They shake hands. The squirrel steps away and looks at the signature. The badger gets up. A flashback to Irene. Irene's tea was poisoned. A fox shows the squirrel her bloodstained handkerchief. The badger sits at a chessboard and picks up the black queen. The squirrel looks down thoughtfully. It picks up Irene's handkerchief from the chessboard. The squirrel glares at the badger, then makes to go. The badger stares after the squirrel, then turns its attention back to the chessboard. It moves the black queen. An owl and its spouse, Mary, are at the station. They make their way to a waiting train. The owl notices some soldiers."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Holmes spots two drummers outside the museum and gestures for them to perform. Watson awakes with an appalled expression. Holmes starts pulling at a scarf Watson is using as a pillow. Watson clings to it, so Holmes yanks it from his grasp. A couple of empty cups fall out of the boat as Watson struggles out of it. As Holmes tries to tidy him up, the hem of Watson's trousers rips off. Holmes tosses it into the boat. Watson eyes him wearily, and Holmes nods. They clasp hands, and Holmes leads a shambling Watson towards the museum. The audience is in their places as the artist makes her way up the gallery. Everyone gets to their feet, including Mrs. Hudson, who taps a slumbering Holmes on the shoulder. He comes to and rises to his feet. A spruced-up Watson is standing beside him. Holmes quickly adjusts Watson's collar and boutonniere, before Watson lifts the artist's canvas. She smiles up at him and sees he's sporting a bandage and generally looks roughed up. She looks over at Holmes, who winks reassuringly. Watson places the frame on his new piece of art, and they share a nod. Holmes looks down thoughtfully. As Watson and the artist leave the museum, they walk beneath the raised paintbrushes of several artists. Standing alone by the latched gate of the garden, Holmes applauds. Holmes disappears through the gate and cranks his motorcycle's engine into life. Moriarty's bearded agent is leaning against the side of the motorcycle. The agent rolls a cigar. The agent steps aside and Holmes pulls away in a cloud of dust. Oxford University, London. Puffing on his cigar, Holmes makes his way across a courtyard and goes into a library. Holmes walks into a room where a record player is playing. Moriarty and another man, Matthew, are there. Moriarty looks round at him. As Moriarty sits at his table and signs the letter, Holmes walks behind him and looks at a chalkboard covered in drawings. Moriarty looks up. Holmes spots a journal by the chalkboard. Holmes sees a wilting flower nearby. Moriarty hands the signed comet journal back to Holmes. They shake hands. Holmes steps away and looks at the signature. Moriarty gets up. A flashback to Irene. Irene's wine was poisoned. He shows Holmes her torn handkerchief. Moriarty sits at a checkers board and picks up the red king. Holmes looks down thoughtfully. He picks up Irene's handkerchief from the checkers board. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the checkers board. He moves the red king. Watson and his wife, Mary, are at the harbor. They make their way to a waiting ship. Watson notices some sailors."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Holmes observes two pipers outside the church and signals for them to rest. Watson awakes with a delighted expression. Holmes starts waving a coat Watson is using as a pillow. Watson holds on to it, so Holmes gently retrieves it from his grasp. A couple of empty bottles roll out of the car as Watson stretches out of it. As Holmes tries to organize him, the sleeve of Watson's jacket slides off. Holmes places it into the car. Watson looks at him curiously, and Holmes nods. They shake hands, and Holmes directs a stumbling Watson towards the church. The guests are in their places as the bride dances her way up the aisle. Everyone sits down, including Mrs. Hudson, who nudges a dozing Holmes on the shoulder. He springs to and jumps to his feet. A polished Watson is standing beside him. Holmes gently straightens Watson's tie and buttonhole, before Watson uncovers the bride's veil. She laughs up at him and notices he's wearing a black eye and generally appears roughed up. She glances over at Holmes, who grins reassuringly. Watson places the ring on his new wife's finger, and they share a laugh. Holmes gazes down pensively. As Watson and his bride exit the church, they walk beneath the hanging flags of several guardsmen. Standing alone by the locked gate of the churchyard, Holmes cheers. Holmes sneaks through the gate and nudges his car's engine into motion. Moriarty's bearded agent is leaning against the side of the car. The agent lights a cigar. The agent steps aside and Holmes zooms away in a gust of wind. Kings College, Cambridge. Chewing on his pipe, Holmes strolls across a quadrangle and enters a building. Holmes steps into a room where a gramophone is humming. Moriarty and another man, Matthew, are present. Moriarty glances round at him. As Moriarty sits at his desk and marks the book, Holmes circles behind him and peers at a blackboard covered in illustrations. Moriarty glances up. Holmes notices a book by the blackboard. Holmes spots a thriving plant nearby. Moriarty passes the marked asteroid book back to Holmes. They nod heads. Holmes steps aside and examines the signature. Moriarty rises. A flashback to Irene. Irene's tea was forgotten. He shows Holmes her clean handkerchief. Moriarty sits at a chessboard and holds the black pawn. Holmes gazes down introspectively. He picks up Irene's handkerchief from the chessboard. Holmes frowns at him then turns to leave. Moriarty peers after Holmes then shifts his focus back to the chessboard. He moves the black pawn. Watson and his wife, Mary, are at the station. They stroll their way to a waiting train. Watson identifies some soldiers."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Whiskers spots two flamingos outside the bakery and gestures for them to dance. Quill awakes with a delighted expression. Whiskers starts pulling at a scarf Quill is using as a pillow. Quill clings to it, so Whiskers yanks it from his grasp. A couple of empty cups fall out of the canoe as Quill struggles out of it. As Whiskers tries to tidy him up, the hem of Quill's toga rips off. Whiskers tosses it into the canoe. Quill eyes him wearily, and Whiskers nods. They clasp paws, and Whiskers leads a shuffling Quill towards the bakery. The musicians are in their places as the baker makes her way up the riverbank. Everyone gets to their knees, including Mrs. Sparrow, who taps a slumbering Whiskers on the hat. He comes to and rises to his paws. A polished-up Quill is standing beside him. Whiskers quickly adjusts Quill's brooch and shoelace, before Quill lifts the baker's bonnet. She smiles up at him and sees he's sporting a blue eye and generally looks patched up. She looks over at Whiskers, who winks reassuringly. Quill places the pebble on his new wife's palm, and they share a hug. Whiskers looks down thoughtfully. As Quill and his baker leave the bakery, they walk beneath the raised lanterns of several jesters. Standing alone by the locked shed of the bakery yard, Whiskers applauds. Whiskers disappears through the gate and cranks his skateboard's engine into life. Dalrymple's feathered guard is leaning against the side of the skateboard. The guard lights a candle. The guard steps aside and Whiskers pulls away in a sprinkle of dust. Oxford Library, Oxford. Puffing on his flute, Whiskers makes his way across a courtyard and goes into a shed. Whiskers walks into a chamber where a record player is playing. Dalrymple and another lad, Monty, are there. Dalrymple looks round at him. As Dalrymple sits at his desk and signs the scroll, Whiskers walks behind him and looks at a whiteboard covered in paintings. Dalrymple looks up. Whiskers spots a scroll by the whiteboard. Whiskers sees a wilting flower nearby. Dalrymple hands the signed comet scroll back to Whiskers. They shake paws. Whiskers steps away and looks at the autograph. Dalrymple gets up. A flashback to Iris. Iris's juice was poisoned. He shows Whiskers her stained mitten. Dalrymple sits at a card table and picks up the red ace. Whiskers looks down thoughtfully. He picks up Iris's mitten from the card table. Whiskers glares at him then makes to go. Dalrymple stares after Whiskers then turns his attention back to the card table. He moves the red ace. Quill and his partner, Daisy, are at the meadow. They make their way to a waiting sled. Quill notices some dancers."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Marksman observes three drummers outside the library and signals for them to paint. Gregson dozes with a puzzled expression. Marksman begins dancing around a blanket Gregson is using as a coat. Gregson grabs it, so Marksman snatches it from under his arm. A trio of stray cats leap out of the truck as Gregson trips out of it. As Marksman attempts to brush him off, the pocket of Gregson's trousers tears off. Marksman flings it into the truck. Gregson glares at him reluctantly, and Marksman chuckles. They shake elbows, and Marksman guides a stumbling Gregson towards the library. The staff are in their places as the groom makes his way up the hallway. Everyone gets to their knees, including Mrs. Hudson, who elbows a snoring Marksman on the arm. He rouses and climbs to his toes. A cleaned-up Gregson is dancing beside him. Marksman swiftly tweaks Gregson's collar and boutonniere, before Gregson lowers the groom's hat. He grins up at him and notices he's sporting a scratched lip and generally looks battered around. He glances over at Marksman, who grins encouragingly. Gregson places the crown on his new groom's head, and they share a laugh. Marksman gazes upward thoughtfully. As Gregson and his groom exit the library, they stroll beneath the twirling flags of several musicians. Standing solo by the closed door of the library yard, Marksman cheers. Marksman vanishes through the door and pedals his bike's pedals into motion. Irene's cloaked ally is resting against the side of the bike. The ally puffs a cigar. The ally steps backward and Marksman glides away in a flurry of dust. Harvard University, Boston. Snapping his suspenders, Marksman makes his way across a courtyard and enters a hall. Marksman steps into a chamber where a television is buzzing. Irene and another woman, Emily, are there. Irene looks around at him. As Irene sits at her table and scribbles the parchment, Marksman creeps beside her and gazes at a blackboard covered in maps. Irene peers up. Marksman glimpses a journal by the blackboard. Marksman notices a wilting shrub nearby. Irene hands the scribbled comet journal back to Marksman. They exchange bows. Marksman strolls away and examines the scribbles. Irene stands up. A flashback to Moriarty. Moriarty's coffee was swapped. She reveals to Marksman his waterlogged monocle. Irene sits at a poker table and lifts the white rook. Marksman gazes upward thoughtfully. He retrieves Irene's monocle from the poker table. Marksman frowns at her then turns to exit. Irene watches Marksman depart then shifts her focus back to the poker table. She moves the white rook. Gregson and his friend, Harry, are at the harbor. They drift their way to an awaiting boat. Gregson observes some sailors."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Holmes spots two jugglers outside the bakery and gestures for them to dance. Watson awakes with an amused expression. Holmes starts tickling at a pillow Watson is using as a cushion. Watson clings to it, so Holmes pries it from his grip. A couple of empty cans topple out of the carriage as Watson tumbles out of it. As Holmes tries to mend him up, the pocket of Watson's trousers tears off. Holmes flings it into the carriage. Watson eyes him curiously, and Holmes nods. They clasp hands, and Holmes leads a staggering Watson toward the bakery. The guests are in their places as the bride makes her way up the staircase. Everyone gets to their feet, including Mrs. Hudson, who taps a napping Holmes on the elbow. He comes to and rises to his feet. A polished-up Watson is standing beside him. Holmes quickly straightens Watson's scarf and boutonniere, before Watson lifts the bride's hat. She smiles up at him and sees he's sporting a bruised cheek and generally looks roughed up. She looks over at Holmes, who winks reassuringly. Watson places the bracelet on his new wife's wrist, and they share a hug. Holmes looks down thoughtfully. As Watson and his bride leave the bakery, they walk beneath the raised umbrellas of several guardsmen. Standing alone by the latched fence of the bakery yard, Holmes applauds. Holmes disappears through the fence and pedals his bicycle into motion. Moriarty's bearded agent is leaning against the side of the bicycle. The agent lights a match. The agent steps aside and Holmes scoots away in a trail of dust. Kings College, Cambridge. Sipping on his flask, Holmes makes his way across a courtyard and goes into a building. Holmes walks into a room where a projector is running. Moriarty and another man, Matthew, are there. Moriarty glances round at him. As Moriarty sits at his desk and doodles on the napkin, Holmes walks behind him and looks at a corkboard covered in doodles. Moriarty looks up. Holmes spots a notebook by the corkboard. Holmes sees a vibrant flower nearby. Moriarty hands the doodled-on napkin back to Holmes. They shake hands. Holmes steps away and looks at the illustration. Moriarty gets up. A flashback to Irene. Irene's cake was poisoned. He shows Holmes her cracked teacup. Moriarty sits at a dartboard and picks up the black dart. Holmes looks down thoughtfully. He picks up Irene's teacup from the dartboard. Holmes glares at him then makes to go. Moriarty stares after Holmes then turns his attention back to the dartboard. He throws the black dart. Watson and his wife, Mary, are at the harbor. They make their way to a waiting boat. Watson notices some fishermen."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sprinkles notices two dancers beside the bakery and signals for them to juggle. Curly awakens with a delighted expression. Sprinkles begins twirling a hat that Curly is using as a pillow. Curly grips it, so Sprinkles flings it from his clutch. A pair of marbles tumble out of the wagon as Curly stumbles out of it. As Sprinkles attempts to clean him up, the hem of Curly's robe snaps off. Sprinkles flings it into the wagon. Curly gazes at him eagerly, and Sprinkles winks. They shake heads, and Sprinkles drags a skipping Curly towards the bakery. The visitors are at their tables as the chef makes her way up the staircase. Everyone jumps to their knees, including Mrs. Rag, who taps a snoring Sprinkles on the heel. He jumps up and floats to his hands. A polished-up Curly is lounging beside him. Sprinkles hastily fixes Curly's hat and boutonniere, before Curly twirls the chef's scarf. She beams down at him and notices he's flaunting a blue nose and generally seems dressed up. She glances over at Sprinkles, who coughs encouragingly. Curly places the bracelet on his old chef's ear, and they share a laugh. Sprinkles glances up thoughtfully. As Curly and his chef exit the bakery, they dance beside the lowered flags of several schoolteachers. Standing together by the locked door of the bakery, Sprinkles claps. Sprinkles vanishes through the door and kicks his boat's engine into silence. Blackbeard's tired messenger is reclining against the back of the boat. The messenger sniffs a flower. The messenger slips away and Sprinkles drifts away in a cloud of bubbles. Ocean College, Oxford. Whistling on his flute, Sprinkles skips his way towards a fountain and heads into a garden. Sprinkles skips into a barn where a radio is humming. Blackbeard and another gentleman, Felix, are sitting. Blackbeard glances up at him. As Blackbeard stands on his bench and smiles at the ceiling, Sprinkles hops above him and gazes at a billboard decorated in doodles. Blackbeard glances down. Sprinkles notices a newspaper by the billboard. Sprinkles sees a blooming sunflower nearby. Blackbeard hands the stamped rocket newspaper back to Sprinkles. They wave feet. Sprinkles hops near and nods at the autograph. Blackbeard hops in. A flash forward to Gloria. Gloria's coffee was sweetened. She hands Sprinkles his embroidered napkin. Blackbeard stands on a checkerboard and nudges the red pawn. Sprinkles looks up eagerly. He grabs Gloria's napkin from the checkerboard. Sprinkles grins at him then turns to skip. Blackbeard gawks after Sprinkles then turns his thoughts back to the checkerboard. He pushes the red pawn. Curly and his partner, Daisy, are at the park. They dance their path to a waiting bus. Curly notices some dancers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holmes gestures for pipers outside a church to play as Watson wakes up in disarray. Holmes takes a coat from Watson, revealing empty bottles, and tidies him up, though the sleeve rips. They head to the church, where the bride walks up the aisle. Holmes wakes from a nap when Mrs. Hudson taps him. He fixes Watson's tie and buttonhole before Watson lifts the bride's veil, revealing a beaten appearance. She smiles, and they kiss after Watson places a ring on her finger. Watson and his wife leave under guardsmen's swords, with Holmes applauding. Holmes then leaves, encountering Moriarty's agent by his car. At King's College, Cambridge, Holmes enters a room where Moriarty and Matthew are. Moriarty signs a book for Holmes, and they shake hands. Holmes notices a blackboard with calculations and a dying plant. Moriarty shows Holmes evidence of Irene's poisoning and moves a chess piece as Holmes picks up her handkerchief and leaves. Watson and Mary proceed to a train station, noticing some soldiers."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Watson notices some soldiers They make their way to a waiting train  Watson and his wife Mary are at the station  He moves the black queen  Moriarty stares after Holmes then turns his attention back to the chessboard  Holmes glares at him then makes to go  He picks up Irene's handkerchief from the chessboard  Holmes looks down thoughtfully  Moriarty sits at a chessboard and picks up the black queen  He shows Holmes her bloodstained handkerchief  Irene's tea was poisoned  A flashback to Irene  Moriarty gets up  Holmes steps away and looks at the signature  They shake hands  Moriarty hands the signed asteroid book back to Holmes  Holmes sees a dying plant nearby  Holmes spots a book by the blackboard  Moriarty looks up  As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations  Moriarty looks round at him  Moriarty and another man Matthew are there  Holmes walks into a room where a gramophone is playing  Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building  Kings College Cambridge  The agent steps aside and Holmes pulls away in a cloud of smoke  The agent rolls a cigarette  Moriarty's bearded agent is leaning against the side of the car  Holmes disappears through the gate and cranks his car's engine into life  Holmes applauds  Standing alone by the latched gate of the churchyard  As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen  Holmes looks down thoughtfully  Watson places the ring on his new wife's finger and they share a kiss  She looks over at Holmes who winks reassuringly  She smiles up at him and sees he's sporting a black eye and generally looks knocked about  Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil  A sprucedup Watson is standing beside him  He comes to and rises to his feet  Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder  The guests are in their places as the bride makes her way up the aisle  They clasp hands and Holmes leads a shambling Watson towards the church  Watson eyes him wearily and Holmes nods  Holmes tosses it into the car  As Holmes tries to tidy him up the sleeve of Watson's jacket rips off  A couple of empty bottles fall out of the car as Watson struggles out of it  Watson clings to it so Holmes yanks it from his grasp  Watson is using as a blanket  Holmes starts pulling at a coat  Watson awakes with an appalled expression  Holmes spots two pipers outside the church and gestures for them to play "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Moriarty looks round at him  Holmes disappears through the gate and cranks his car's engine into life  A sprucedup Watson is standing beside him  They clasp hands and Holmes leads a shambling Watson towards the church  As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen  Holmes walks into a room where a gramophone is playing  Watson awakes with an appalled expression  Holmes spots two pipers outside the church and gestures for them to play  She smiles up at him and sees he's sporting a black eye and generally looks knocked about  Watson is using as a blanket  Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building  The guests are in their places as the bride makes her way up the aisle  Holmes steps away and looks at the signature  Holmes applauds  She looks over at Holmes who winks reassuringly  Watson and his wife Mary are at the station  He moves the black queen  Watson places the ring on his new wife's finger and they share a kiss  Watson notices some soldiers He shows Holmes her bloodstained handkerchief  They make their way to a waiting train  As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations  Moriarty sits at a chessboard and picks up the black queen  The agent steps aside and Holmes pulls away in a cloud of smoke  Holmes spots a book by the blackboard  Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder  Kings College Cambridge  Standing alone by the latched gate of the churchyard  Moriarty looks up  Watson eyes him wearily and Holmes nods  Moriarty gets up  As Holmes tries to tidy him up the sleeve of Watson's jacket rips off  He picks up Irene's handkerchief from the chessboard  Holmes glares at him then makes to go  Holmes looks down thoughtfully  Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil  Holmes starts pulling at a coat  Watson clings to it so Holmes yanks it from his grasp  He comes to and rises to his feet  They shake hands  Moriarty's bearded agent is leaning against the side of the car  A flashback to Irene  Irene's tea was poisoned  Holmes looks down thoughtfully  Moriarty hands the signed asteroid book back to Holmes  A couple of empty bottles fall out of the car as Watson struggles out of it  The agent rolls a cigarette  Holmes tosses it into the car  Holmes sees a dying plant nearby  Moriarty and another man Matthew are there  Moriarty stares after Holmes then turns his attention back to the chessboard "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kings College Cambridge  Puffing on his pipe Holmes makes his way across a quadrangle and goes into a building  Holmes walks into a room where a gramophone is playing  Moriarty and another man Matthew are there  Moriarty looks round at him  As Moriarty sits at his desk and signs the book Holmes walks behind him and looks at a blackboard covered in calculations  Moriarty looks up  Holmes spots a book by the blackboard  Holmes sees a dying plant nearby  Moriarty hands the signed asteroid book back to Holmes  They shake hands  Holmes steps away and looks at the signature  Moriarty gets up  A flashback to Irene  Irene's tea was poisoned  He shows Holmes her bloodstained handkerchief  Moriarty sits at a chessboard and picks up the black queen  Holmes looks down thoughtfully  He picks up Irene's handkerchief from the chessboard  Holmes glares at him then makes to go  Moriarty stares after Holmes then turns his attention back to the chessboard  He moves the black queen  Watson and his wife Mary are at the station  They make their way to a waiting train  Watson notices some soldiers Holmes spots two pipers outside the church and gestures for them to play  Watson awakes with an appalled expression  Holmes starts pulling at a coat  Watson is using as a blanket  Watson clings to it so Holmes yanks it from his grasp  A couple of empty bottles fall out of the car as Watson struggles out of it  As Holmes tries to tidy him up the sleeve of Watson's jacket rips off  Holmes tosses it into the car  Watson eyes him wearily and Holmes nods  They clasp hands and Holmes leads a shambling Watson towards the church  The guests are in their places as the bride makes her way up the aisle  Everyone gets to their feet including Mrs Hudson who taps a slumbering Holmes on the shoulder  He comes to and rises to his feet  A sprucedup Watson is standing beside him  Holmes quickly adjusts Watson's tie and buttonhole before Watson lifts the bride's veil  She smiles up at him and sees he's sporting a black eye and generally looks knocked about  She looks over at Holmes who winks reassuringly  Watson places the ring on his new wife's finger and they share a kiss  Holmes looks down thoughtfully  As Watson and his bride leave the church they walk beneath the raised swords of several guardsmen  Standing alone by the latched gate of the churchyard  Holmes applauds  Holmes disappears through the gate and cranks his car's engine into life  Moriarty's bearded agent is leaning against the side of the car  The agent rolls a cigarette  The agent steps aside and Holmes pulls away in a cloud of smoke "
        }
      ]
    }
  ]
}