{
  "ground_truth": "The man heads off as bearded, middle-aged Meinhard gets out of a carriage outside of the Addrelle de Fleuve, with a rough looking bloke hovering nearby with another identical man, keeping an eye on Meinhard. At a gypsy camp in the countryside, men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes, who appears to be asleep. A gypsy man indicates a bearded man holding a goose, and the gypsies surround Holmes and Watson, who smile politely. The man takes it, then Watson knocks him cold, causing the atmosphere to become more strained. A man opens his jacket, revealing a knife, and Sim pushes through the crowd with her bag, which the gypsies have taken off Holmes. The man Watson punched watches as they eat a meal, with Watson looking up from his bowl and frowning while Holmes glares at him. Sim hands the drawings to the gypsy man, who passes them to Holmes, and Holmes licks the red stain before turning conspiratorially to Watson. Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside, with Sim joining in too, while Holmes watches and twitches his shoulders in time with the music. At the castle home of Mycroft Holmes, Mary walks into a study and finds him completely naked. She takes the telegram and goes as Carruthers goes, while Stanley, the dithering ancient butler, turns around. Under a leaden sky in Paris, a carriage with Imperata stenciled on the side pulls up on a side street, and Sim, Holmes, and Watson are ushered from it into a building where they pass two men wheeling a coat-of-arms shaped cake on a trolley. They are led into a busy kitchen, making their way past chefs working at worktops until they are stopped and searched by another man. Holmes notes an empty baking tray, some royal icing in gold leaf laurels, a shield, and a newspaper on a worktop before he, Sim, and Watson are ushered down some stairs to emerge in a basement room where a man, Ravache, sits at a table with his back to them, eating. Watson sniffs a piece of paper as Holmes and Sims sit down. Ravache takes a gulp of red wine, wipes his mouth with a napkin, sips his wine, and then shoots himself in the head. Upstairs in the kitchen, his colleagues hear the shot and run off to investigate while Holmes gets to his feet, and Watson fires warning shots up the stairs as Holmes stares into an alcove.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The gentleman departs as whiskered, middle-aged Meinhard disembarks from a coach outside of the Addrelle de Fleuve, with a rugged appearing fellow lingering adjacent with another indistinguishable gentleman, observing Meinhard. At a Romani encampment in the rural area, gentlemen rehearse their equestrian abilities as Holmes and Watson arrive at the periphery of the encampment in an open coach. A gentleman approaches to grasp their horse while Watson calls over to a cluster of gentlemen and prods Holmes, who seems to be dozing. A Romani gentleman indicates a whiskered gentleman clutching a goose, and the Romani encircle Holmes and Watson, who grin courteously. The gentleman seizes it, then Watson clobbers him unconscious, causing the environment to become more tense. A gentleman opens his coat, revealing a dagger, and Sim pushes through the throng with her satchel, which the Romani have removed from Holmes. The gentleman Watson struck observes as they consume a repast, with Watson glancing up from his bowl and scowling while Holmes scowls at him. Sim hands the illustrations to the Romani gentleman, who passes them to Holmes, and Holmes tastes the scarlet blot before turning conspiratorially to Watson. Holmes sips from a proffered bottle as Watson rises and cavorts energetically with a Romani outside, with Sim participating too, while Holmes observes and jerks his shoulders in synchrony with the melody. At the castle residence of Mycroft Holmes, Mary enters a study and discovers him entirely unclothed. She takes the telegram and departs as Carruthers leaves, while Stanley, the dithering ancient butler, pivots around. Beneath a heavy sky in Paris, a coach with Imperata stenciled on the flank pulls up on a lateral street, and Sim, Holmes, and Watson are escorted from it into a structure where they pass two gentlemen wheeling a coat-of-arms shaped confection on a trolley. They are led into a bustling kitchen, navigating past chefs laboring at counters until they are halted and searched by another gentleman. Holmes observes a vacant baking tray, some regal icing in gold leaf laurels, a shield, and a periodical on a counter before he, Sim, and Watson are conducted down some stairs to appear in a sublevel chamber where a gentleman, Ravache, sits at a table with his back to them, dining. Watson inhales a slip of paper as Holmes and Sims take a seat. Ravache takes a draught of crimson wine, wipes his mouth with a serviette, sips his wine, and then shoots himself in the head. Upstairs in the kitchen, his associates hear the discharge and run off to investigate while Holmes stands, and Watson fires cautionary shots up the stairs as Holmes gazes into a niche."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The man is headed off as bearded, middle-aged Meinhard is gotten out of a carriage outside of the Addrelle de Fleuve, with a rough-looking bloke hovered nearby with another identical man, keeping an eye on Meinhard. At a gypsy camp in the countryside, horse riding skills are practiced by men as Holmes and Watson are driven up on the outskirts of the camp in an open carriage. Their horse is held by a man who comes over while Watson calls over to a group of men and nudges Holmes, who is appeared to be asleep. A bearded man holding a goose is indicated by a gypsy man, and Holmes and Watson are surrounded by the gypsies, who smile politely. The man takes it, then he is knocked cold by Watson, causing the atmosphere to become more strained. A jacket is opened by a man, revealing a knife, and Sim pushes through the crowd with her bag, which has been taken off Holmes by the gypsies. The meal is watched by the man Watson punched as it is eaten by them, with Watson looking up from his bowl and frowning while Holmes glares at him. The drawings are handed to the gypsy man by Sim, who passes them to Holmes, and the red stain is licked by Holmes before he turns conspiratorially to Watson. Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside, with Sim joining in too, while Holmes watches and twitches his shoulders in time with the music. At the castle home of Mycroft Holmes, Mary walks into a study and finds him completely naked. The telegram is taken by her and she goes as Carruthers goes, while Stanley, the dithering ancient butler, turns around. Under a leaden sky in Paris, a carriage with Imperata stenciled on the side is pulled up on a side street, and Sim, Holmes, and Watson are ushered from it into a building where they pass two men wheeling a coat-of-arms shaped cake on a trolley. They are led into a busy kitchen, making their way past chefs working at worktops until another man stops and searches them. Holmes notes an empty baking tray, some royal icing in gold leaf laurels, a shield, and a newspaper on a worktop before he, Sim, and Watson are ushered down some stairs to emerge in a basement room where Ravache, a man, sits at a table with his back to them, eating. A piece of paper is sniffed by Watson as Holmes and Sims sit down. Ravache takes a gulp of red wine, wipes his mouth with a napkin, sips his wine, and then shoots himself in the head. Upstairs in the kitchen, the shot is heard by his colleagues and they run off to investigate while Holmes gets to his feet, and warning shots are fired up the stairs by Watson as Holmes stares into an alcove."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Bearded, middle-aged Meinhard exits a carriage near Addrelle de Fleuve, observed by a rough onlooker and his twin. At a gypsy camp, men practice horse riding as Holmes and Watson arrive by open carriage. Watson calls to men and nudges a sleeping Holmes. A gypsy man gestures to another with a goose, and Holmes and Watson are encircled by smiling gypsies. Watson knocks out the man with the goose, straining the atmosphere. Another man reveals a knife, and Sim pushes through the crowd with her bag taken by the gypsies. Watson looks up from his meal, frowning at Holmes who glares back. Sim gives drawings to a gypsy, who passes them to Holmes. Holmes licks a red stain and turns to Watson. Holmes drinks from a bottle as Watson dances with a gypsy outside, joined by Sim, with Holmes tapping to the music. At Mycroft Holmes' castle, Mary finds him naked in his study, takes a telegram, and leaves as Stanley, the ancient butler, turns. Under a gray Paris sky, a carriage labeled Imperata stops, and Sim, Holmes, and Watson are ushered into a building, passing two men with a cake. They move through a kitchen, past chefs, and are searched. Holmes notices an empty baking tray, gold leaf icing, a shield, and a newspaper before being led to a basement. There, Ravache sits eating at a table. Watson sniffs paper as Holmes and Sim sit. Ravache drinks wine, wipes his mouth, then shoots himself. Upstairs, colleagues hear and rush to the scene as Holmes stands amid the chaos, with Watson firing warning shots."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bearded, middle-aged Meinhard exits a carriage at Addrelle de Fleuve, observed by two rough-looking men. At a gypsy camp, men practice horse riding as Holmes and Watson arrive in a carriage. Watson awakens Holmes, and a bearded gypsy with a goose approaches. Tension rises when Watson knocks a man out, prompting another to reveal a knife. Sim retrieves her bag from the gypsies, and Watson frowns at Holmes during their meal. Sim hands drawings to Holmes, who tastes a red stain before sharing with Watson. Holmes drinks while Watson and Sim dance energetically with the gypsies. At Mycroft Holmes's castle, Mary encounters him naked, collects a telegram, and leaves. In Paris, under a gloomy sky, a carriage marked Imperata delivers Sim, Holmes, and Watson to a building where they pass a coat-of-arms-shaped cake. In the kitchen, they are searched, then taken downstairs. Holmes observes an empty baking tray and newspaper as a man named Ravache, who sits in a basement room, shoots himself after drinking wine. His colleagues hear the shot and investigate while Watson fires warning shots upstairs, and Holmes peers into an alcove."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The man steps away as the bearded, middle-aged figure of Meinhard steps down from a carriage that has stopped outside the Addrelle de Fleuve. Nearby, a rough-looking fellow hovers cautiously, keeping company with another man who looks exactly like him, both of them vigilantly watching Meinhard's movements. Meanwhile, at a lively gypsy camp set amidst the expansive countryside, men are actively engaged in practicing their horse riding skills. It is at this point that Holmes and Watson arrive, driving up to the outskirts of the bustling camp in an open carriage. As they come to a stop, a helpful man steps forward to hold their horse steady. Watson calls out to a group of men, simultaneously giving Holmes a gentle nudge, as Holmes seems to have dozed off. A gypsy man gestures toward a bearded man clutching a goose, and soon after, the gypsy folk encircle Holmes and Watson, who return their attention with polite smiles. The man accepts the goose, and then Watson unexpectedly delivers a punch, knocking him unconscious, which causes the atmosphere to grow tense and uneasy. One man reveals a knife from inside his jacket, but then Sim pushes her way through the gathering crowd with her bag, which the gypsies have taken from Holmes. The gypsy who Watson struck keeps a close eye on them as they settle down to have a meal. Watson looks up from his bowl with a frown, casting a disapproving glance at Holmes, who returns the look with a glare. Sim proceeds to hand over some drawings to the gypsy man, who then passes them along to Holmes. In response, Holmes licks a red stain on the paper before turning to Watson with a conspiratorial look on his face. Holmes takes a swig from a bottle offered to him while Watson gets to his feet and bursts into a lively dance with a gypsy outside, with Sim joining in on the dance as well, while Holmes observes, shaking his shoulders to the rhythm of the music. Over at the grand castle residence of Mycroft Holmes, Mary enters a study and is quite surprised to find Mycroft completely unclothed. She retrieves the telegram, leaves the room, and as she goes, Carruthers departs as well, while Stanley, the doddering ancient butler, turns on his heel. Meanwhile, under a heavy, gray sky in the city of Paris, a carriage marked with the word Imperata on its side comes to a stop on a side street. Sim, Holmes, and Watson are promptly ushered from it into a building where they pass by two men transporting a cake in the shape of a coat-of-arms on a trolley. They are led into a bustling kitchen, making their way past chefs industriously working at their stations, until they are halted and subjected to a search by another man. Holmes takes note of an empty baking tray adorned with royal icing in gold leaf laurels, a shield, and a newspaper placed on a worktop before he, Sim, and Watson are directed down a stairway, emerging into a basement room where they find a man named Ravache seated at a table with his back turned to them, engrossed in eating. Watson takes a sniff of a piece of paper as Holmes and Sim sit themselves down. Ravache drinks a mouthful of red wine, wipes his mouth with a napkin, takes another sip, and suddenly shoots himself in the head. Upstairs, in the bustling kitchen, his coworkers hear the sound of the shot and rush off to investigate the disturbance, while Holmes rises to his feet, and Watson fires a series of warning shots up the stairs as Holmes gazes intently into an alcove nearby."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The man takes a step back as the bearded, middle-aged figure of Meinhard carefully descends from a carriage that has come to a stop outside the illustrious establishment of Addrelle de Fleuve. Nearby, a rough-looking fellow hovers with caution, staying close to another man who looks strikingly identical to him; both of them remain watchfully observant of Meinhard’s every movement. Meanwhile, at a lively and bustling gypsy encampment set amidst the vast, rolling countryside, men are actively and energetically engaged in honing their horse-riding skills. It is precisely at this moment that Holmes and Watson make their arrival, driving up to the outskirts of the bustling and vibrant camp in an open carriage. As they come to a stop, a helpful man steps forward promptly to hold their horse steady and secure. Watson calls out animatedly to a group of men, and at the same time, he gives Holmes a gentle nudge because Holmes seems to have dozed off into a light slumber. A gypsy man gestures toward a bearded individual who is clutching a goose, and soon after, the gypsy folk form a circle around Holmes and Watson, who in return, acknowledge them with polite, courteous smiles. The man graciously accepts the goose, but then, quite unexpectedly, Watson delivers a sudden punch, rendering him unconscious, suddenly causing the atmosphere in the camp to grow tense and palpably uneasy. One man, in response, reveals a sharp knife from inside his jacket, but then, Sim pushes her way assertively through the gathering crowd with her bag, which the gypsies have taken from Holmes. The gypsy who Watson struck maintains a keen and watchful eye on them as they begin to settle down to enjoy a meal. Watson looks up from his bowl with a frown etched on his face, casting a disapproving glance at Holmes, who returns the look with a rather menacing glare. Sim proceeds to hand over some detailed drawings to the gypsy man, who then passes them along to Holmes. In response, Holmes licks a red stain on the paper thoughtfully before turning to Watson with a conspiratorial look gleaming in his eyes. Holmes then takes a generous swig from a bottle offered to him, while Watson gets to his feet and enthusiastically bursts into a lively dance with a gypsy outside. Sim, full of spirit, joins in on the dance as well, while Holmes quietly observes, subtly shaking his shoulders to the infectious rhythm of the music. Over at the grand, opulent castle residence of Mycroft Holmes, Mary steps into the study and is quite taken aback to find Mycroft completely unclothed. She retrieves the telegram, leaves the room, and as she goes, Carruthers departs as well, while Stanley, the doddering ancient butler, turns briskly on his heel. Meanwhile, under a heavy, gray expanse of sky in the bustling city of Paris, a carriage marked with the word \"Imperata\" on its side comes to a halt on a side street. Sim, Holmes, and Watson are promptly ushered out from it and into a building where they pass by two men transporting a cake crafted in the grand shape of a coat-of-arms on a trolley. They make their way into a bustling, busy kitchen, maneuvering past chefs industriously working at their various stations, until they are halted and subjected to a meticulous search by another man. Holmes, with his keen eye for detail, takes note of an empty baking tray adorned with intricate royal icing in gold leaf laurels, a shield, and a newspaper placed on a worktop before he, Sim, and Watson are directed down a dimly lit stairway, emerging into a basement room where they find a man named Ravache seated at a table with his back turned to them, deeply engrossed in eating. Watson takes a curious sniff of a piece of paper as Holmes and Sim sit themselves down. Ravache drinks a mouthful of robust red wine, wipes his mouth carefully with a napkin, takes another deliberate sip, and then suddenly, without warning, shoots himself in the head. Upstairs, in the bustling, frantic kitchen, his coworkers hear the sound of the shot, prompting them to rush off in haste to investigate the alarming disturbance, while Holmes rises to his feet, and Watson fires a series of warning shots up the stairs as Holmes gazes intently into an intriguing alcove nearby."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The man proceeds on his way as the bearded, middle-aged Meinhard steps down from a carriage parked outside the Addrelle de Fleuve. Nearby, a rough-looking man stands watch with another identical man, both keeping a close eye on Meinhard's movements. In the countryside at a gypsy camp, several men focus intently on honing their horse riding skills while Holmes and Watson approach the camp's perimeter in an open carriage. As they arrive, a man steps forward to take hold of their horse, ensuring it remains steady. Watson calls out to a group of men, simultaneously giving Holmes a gentle nudge to rouse him from apparent slumber. A gypsy man draws attention to another bearded man clutching a goose, and soon the gypsies form a circle around Holmes and Watson, who respond with polite smiles despite the encroaching crowd. The bearded man accepts the goose, but Watson suddenly knocks him out cold, causing the atmosphere to shift and become tense. In the midst of the commotion, a man reveals a knife from inside his jacket. Sim manages to push through the crowd, retrieving her bag that the gypsies had taken from Holmes. The man whom Watson struck watches intently as Holmes and Watson sit down for a meal. Watson looks up from his bowl with a frown, meeting Holmes's displeased glare. Sim hands a set of drawings to the gypsy man, who promptly passes them to Holmes. Examining the drawings, Holmes tastes a red stain on them and then turns to Watson with a conspiratorial look. Accepting a bottle offered by the gypsies, Holmes takes a drink before observing with twitching shoulders as Watson energetically dances with a gypsy outside, soon joined by Sim. Meanwhile, at the castle residence of Mycroft Holmes, Mary enters a study only to find Mycroft completely naked. She collects a telegram and departs, almost colliding with Carruthers as the dithering ancient butler, Stanley, turns around. Amidst the gloomy skies of Paris, a carriage marked with \"Imperata\" arrives on a side street. Sim, Holmes, and Watson alight from it and are swiftly ushered into a building. Inside, they pass by two men maneuvering a trolley with a cake shaped like a coat-of-arms. Navigating through a bustling kitchen, they weave past chefs diligently working at their stations until their progress is halted by another man who conducts a search. During the pause, Holmes's keen eyes note an array of items—a vacant baking tray, gold leaf laurel-decorated royal icing, a shield, and a newspaper—scattered across a worktop. Subsequently, Holmes, Sim, and Watson are directed down a staircase leading them into a basement room. Here, they find a man named Ravache seated with his back to them, engrossed in his meal. Watson inhales the scent of a piece of paper while Holmes and Sim take a seat. Without warning, Ravache gulps down some red wine, wipes his mouth with a napkin, takes another sip, and abruptly shoots himself in the head. Upstairs, the sound of the shot prompts his colleagues to abandon their tasks and rush to investigate. In response, Holmes stands up, and Watson fires warning shots up the stairs while Holmes remains transfixed, staring into an alcove."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Meinhard exits a carriage at Addrelle de Fleuve, observed by two rough-looking men. Meanwhile, at a countryside gypsy camp, as Holmes and Watson arrive in an open carriage, a gypsy man restrains their horse. Watson awakens Holmes and joins a group, as the gypsies eye them cautiously. After a confrontation where Watson knocks out a man holding a goose, tension rises until Sim retrieves Holmes's bag from the gypsies. During a meal, Watson frowns at Holmes, who exchanges confidential information with him after receiving drawings from Sim, and sampling a red stain. Holmes then drinks while Watson dances energetically with Sim and the gypsies, as Holmes watches in rhythm with the music. Later, at Mycroft Holmes's castle, Mary enters a study to find Mycroft naked; she discreetly collects a telegram before leaving. In Paris, under a gloomy sky, Sim, Holmes, and Watson are escorted from a carriage marked \"Imperata\" into a bustling kitchen, bypassing chefs to be searched. Holmes observes various items before they are led to a basement where Ravache, seated at a table, abruptly shoots himself after drinking wine. Alarmed by the gunshot, kitchen workers rush to investigate, while Holmes stands, and Watson fires shots upward as Holmes examines an alcove."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The man heads off as bearded, middle-aged Meinhard gets out of a carriage outside of the Addrelle de Fleuve, an exclusive riverside hotel known for its opulent architecture, with a rough-looking bloke hovering nearby with another identical man, twin brothers known in the area for their imposing presence, keeping an eye on Meinhard. At a gypsy camp in the countryside, a traditional Romani settlement where cultural skills are passed down through generations, men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson, the famed doctor and chronicler of their adventures, calls over to a group of men and nudges Holmes, who appears to be asleep. A gypsy man indicates a bearded man holding a goose, a common livestock animal in these camps, and the gypsies surround Holmes and Watson, who smile politely. The man takes it, then Watson knocks him cold with a deft punch, causing the atmosphere to become more strained. A man opens his jacket, revealing a knife, a customary means of self-defense in these transient communities, and Sim, a companion known for her resourcefulness, pushes through the crowd with her bag, which the gypsies have taken off Holmes. The man Watson punched watches as they eat a meal of traditional Romani stew, with Watson looking up from his bowl and frowning while Holmes glares at him. Sim hands the drawings to the gypsy man, who passes them to Holmes, and Holmes licks the red stain, deducing it to be harmless, before turning conspiratorially to Watson. Holmes drinks from a proffered bottle of homemade wine as Watson gets up and dances energetically with a gypsy outside, with Sim joining in too, while Holmes watches and twitches his shoulders in time with the lively music. At the castle home of Mycroft Holmes, an influential government official known for his intellect, Mary walks into a study and finds him completely naked. She takes the telegram urgently relaying vital information and goes as Carruthers, Mycroft's trusted aide, goes, while Stanley, the dithering ancient butler, turns around. Under a leaden sky in Paris, a city renowned for its art and culture, a carriage with Imperata stenciled on the side, indicating a prestigious catering company, pulls up on a side street, and Sim, Holmes, and Watson are ushered from it into a building where they pass two men wheeling a coat-of-arms shaped cake, an intricately designed centerpiece for a banquet, on a trolley. They are led into a busy kitchen, making their way past chefs working at worktops laden with luxurious ingredients until they are stopped and searched by another man. Holmes notes an empty baking tray, some royal icing in gold leaf laurels, a shield, likely part of the cake decoration, and a newspaper on a worktop before he, Sim, and Watson are ushered down some stairs to emerge in a basement room where a man, Ravache, a notorious figure with rumored underworld connections, sits at a table with his back to them, eating. Watson sniffs a piece of paper imbued with a peculiar scent as Holmes and Sims sit down. Ravache takes a gulp of red wine, wipes his mouth with a napkin, sips his wine, and then shockingly shoots himself in the head. Upstairs in the kitchen, his colleagues hear the shot and run off to investigate while Holmes gets to his feet, and Watson fires warning shots up the stairs as Holmes stares into an alcove, perhaps piecing together an emerging pattern of evidence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard. At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep. A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely. The man takes it then Watson knocks him cold causing the atmosphere to become more strained. A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off. Holmes. The man Watson punched watches as they eat a meal with Watson looking up from his bowl and frowning while Holmes glares at him. Sim hands the drawings to the gypsy man who passes them to Holmes and Holmes licks the red stain before turning conspiratorially to Watson. Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside with Sim joining in too while Holmes watches and twitches his shoulders in time with the music. At the castle home of Mycroft Holmes Mary walks into a study and finds him completely naked. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. She takes the telegram and goes as Carruthers goes while Stanley the dithering ancient butler turns around. Under a leaden sky in Paris a carriage with Imperata stenciled on the side pulls up on a side street and Sim. Holmes and Watson are ushered from it into a building where they pass two men wheeling a coatofarms shaped cake on a trolley. They are led into a busy kitchen making their way past chefs working at worktops until they are stopped and searched by another man. Holmes notes an empty baking tray some royal icing in gold leaf laurels a shield and a newspaper on a worktop before he. Sim and Watson are ushered down some stairs to emerge in a basement room where a man Ravache sits at a table with his back to them eating. Watson sniffs a piece of paper. as Holmes and Sims sit down. Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head. Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs. as Holmes stares into an alcove."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard. At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep. A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely. The man takes it then Watson knocks him cold causing the atmosphere to become more strained. A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off. Holmes. The man Watson punched watches as they eat a meal with Watson looking up from his bowl and frowning while Holmes glares at him. Sim hands the drawings to the gypsy man who passes them to Holmes and Holmes licks the red stain before turning conspiratorially to Watson. Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside with Sim joining in too while Holmes watches and twitches his shoulders in time with the music. At the castle home of Mycroft Holmes Mary walks into a study and finds him completely naked. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. She takes the telegram and goes as Carruthers goes while Stanley the dithering ancient butler turns around. Under a leaden sky in Paris a carriage with Imperata stenciled on the side pulls up on a side street and Sim. Holmes and Watson are ushered from it into a building where they pass two men wheeling a coatofarms shaped cake on a trolley. They are led into a busy kitchen making their way past chefs working at worktops until they are stopped and searched by another man. Holmes notes an empty baking tray some royal icing in gold leaf laurels a shield and a newspaper on a worktop before he. Sim and Watson are ushered down some stairs to emerge in a basement room where a man Ravache sits at a table with his back to them eating. Watson sniffs a piece of paper. as Holmes and Sims sit down. Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head. Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs. as Holmes stares into an alcove."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard. At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep. A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely. The man takes it then Watson knocks him cold causing the atmosphere to become more strained. A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off. Watson sniffs a piece of paper. as Holmes and Sims sit down. Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head. Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs. as Holmes stares into an alcove."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard. At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage. A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep. Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs. as Holmes stares into an alcove."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The parrot soars off as feathered, juvenile Olivier leaps out of a canoe beside the Montague du Jardin, with a sleek feline prowling nearby with another similar bird, observing Olivier. At a clown festival in the mountains, animals juggle their blueberries as Robinson and Friday float up to the margins of the fair in an enclosed sleigh. A bear waddles over to stroke their dragon while Friday sings to a cluster of cats and pokes Robinson, who seems to be daydreaming. A juggler signals a feathered clown holding a violin, and the performers encircle Robinson and Friday, who grin awkwardly. The bear hugs it, then Friday tickles him unconscious, causing the ambiance to become more jubilant. A dolphin flaps its fin, revealing a spoon, and Verity glides through the throng with her drum, which the performers have plucked from Robinson. The bear Friday tickled watches as they twirl a scarf, with Friday glancing at his mask and giggling while Robinson scowls at him. Verity offers the paintings to the juggler, who hands them to Robinson, and Robinson tastes the blue smear before whispering secretly to Friday. Robinson sips from a presented vessel as Friday leaps up and spins exuberantly with a juggler on a snowboard, with Verity hopping in too, while Robinson observes and bobs his antennæ in rhythm with the tune. At the manor abode of Percival Robinson, Susan marches into a library and finds him fully dressed. She grabs the necklace and exits as Mortimer departs, while Gerald, the bumbling youthful assistant, spins around. Beneath a sunny sky in Florence, a sleigh with Ponderosa painted on the side halts on an alley, and Verity, Robinson, and Friday are escorted from it into a garden where they pass two foxes pushing a music-note shaped harp on a skateboard. They are led into a tranquil greenhouse, making their way past botanists working at tables until they are halted and embraced by another dolphin. Robinson observes a full seed packet, some golden petals in silver leaf laurels, a tapestry, and a scroll on a table before he, Verity, and Friday are escorted down some ladders to appear in a sublevel chamber where a cat, Boniface, lounges on a hammock with his face to them, sketching. Friday sniffs a leaflet as Robinson and Verity recline. Boniface takes a lick of green tea, pats his nose with a scarf, sips his tea, and then serenades himself with laughter. Aboveground in the greenhouse, his pals hear the echo and skip off to explore while Robinson gets to his paws, and Friday throws confetti up the ladders as Robinson stares into a crevice."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Meinhard, a bearded middle-aged man, arrives at the Addrelle de Fleuve, watched by two rough-looking men. At a gypsy camp, Holmes and Watson arrive and are surrounded by gypsies, leading to a tense encounter when Watson knocks a man unconscious. Sim, a woman with them, retrieves drawings and hands them to Holmes. Later, Holmes drinks while Watson dances with the gypsies. At Mycroft Holmes's castle, Mary finds him naked and takes a telegram. In Paris, Sim, Holmes, and Watson are led into a building, passing through a kitchen to a basement where they meet Ravache, who unexpectedly shoots himself. As his colleagues rush to investigate, Watson fires warning shots, and Holmes focuses on an alcove."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as Holmes stares into an alcove Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head as Holmes and Sims sit down Watson sniffs a piece of paper Sim and Watson are ushered down some stairs to emerge in a basement room where a man Ravache sits at a table with his back to them eating Holmes notes an empty baking tray some royal icing in gold leaf laurels a shield and a newspaper on a worktop before he They are led into a busy kitchen making their way past chefs working at worktops until they are stopped and searched by another man Holmes and Watson are ushered from it into a building where they pass two men wheeling a coatofarms shaped cake on a trolley Under a leaden sky in Paris a carriage with Imperata stenciled on the side pulls up on a side street and Sim She takes the telegram and goes as Carruthers goes while Stanley the dithering ancient butler turns around At the castle home of Mycroft Holmes Mary walks into a study and finds him completely naked Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside with Sim joining in too while Holmes watches and twitches his shoulders in time with the music Sim hands the drawings to the gypsy man who passes them to Holmes and Holmes licks the red stain before turning conspiratorially to Watson The man Watson punched watches as they eat a meal with Watson looking up from his bowl and frowning while Holmes glares at him Holmes A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off The man takes it then Watson knocks him cold causing the atmosphere to become more strained A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off The man takes it then Watson knocks him cold causing the atmosphere to become more strained The man Watson punched watches as they eat a meal with Watson looking up from his bowl and frowning while Holmes glares at him Holmes Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside with Sim joining in too while Holmes watches and twitches his shoulders in time with the music Sim hands the drawings to the gypsy man who passes them to Holmes and Holmes licks the red stain before turning conspiratorially to Watson She takes the telegram and goes as Carruthers goes while Stanley the dithering ancient butler turns around At the castle home of Mycroft Holmes Mary walks into a study and finds him completely naked Holmes and Watson are ushered from it into a building where they pass two men wheeling a coatofarms shaped cake on a trolley Under a leaden sky in Paris a carriage with Imperata stenciled on the side pulls up on a side street and Sim Holmes notes an empty baking tray some royal icing in gold leaf laurels a shield and a newspaper on a worktop before he They are led into a busy kitchen making their way past chefs working at worktops until they are stopped and searched by another man Watson sniffs a piece of paper Sim and Watson are ushered down some stairs to emerge in a basement room where a man Ravache sits at a table with his back to them eating Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head as Holmes and Sims sit down as Holmes stares into an alcove Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She takes the telegram and goes as Carruthers goes while Stanley the dithering ancient butler turns around Under a leaden sky in Paris a carriage with Imperata stenciled on the side pulls up on a side street and Sim Holmes and Watson are ushered from it into a building where they pass two men wheeling a coatofarms shaped cake on a trolley They are led into a busy kitchen making their way past chefs working at worktops until they are stopped and searched by another man Holmes notes an empty baking tray some royal icing in gold leaf laurels a shield and a newspaper on a worktop before he Sim and Watson are ushered down some stairs to emerge in a basement room where a man Ravache sits at a table with his back to them eating Watson sniffs a piece of paper as Holmes and Sims sit down Ravache takes a gulp of red wine wipes his mouth with a napkin sips his wine and then shoots himself in the head Upstairs in the kitchen his colleagues hear the shot and run off to investigate while Holmes gets to his feet and Watson fires warning shots up the stairs as Holmes stares into an alcove The man heads off as bearded middleaged Meinhard gets out of a carriage outside of the Addrelle de Fleuve with a rough looking bloke hovering nearby with another identical man keeping an eye on Meinhard At a gypsy camp in the countryside men practice their horse riding skills as Holmes and Watson drive up on the outskirts of the camp in an open carriage A man comes over to hold their horse while Watson calls over to a group of men and nudges Holmes who appears to be asleep A gypsy man indicates a bearded man holding a goose and the gypsies surround Holmes and Watson who smile politely The man takes it then Watson knocks him cold causing the atmosphere to become more strained A man opens his jacket revealing a knife and Sim pushes through the crowd with her bag which the gypsies have taken off Holmes The man Watson punched watches as they eat a meal with Watson looking up from his bowl and frowning while Holmes glares at him Sim hands the drawings to the gypsy man who passes them to Holmes and Holmes licks the red stain before turning conspiratorially to Watson Holmes drinks from a proffered bottle as Watson gets up and dances energetically with a gypsy outside with Sim joining in too while Holmes watches and twitches his shoulders in time with the music At the castle home of Mycroft Holmes Mary walks into a study and finds him completely naked"
        }
      ]
    }
  ]
}