{
  "ground_truth": "He opens a box of chocolates and holds it out for the nurse, who shakes her head, a bit apprehensive about this strange man next to her. Forrest eats a chocolate as he looks down at the nurse's shoes, and the black woman stares at Forrest as he looks down at his own shoes. Forrest closes his eyes tightly, just as a little boy closes his eyes tightly; it is young Forrest as he sits in a doctor's office. Forrest has been fitted with orthopedic shoes and metal leg braces, and the doctor sets Forrest down on his feet. Forrest walks around stiffly as his mother, Mrs. Gump, watches him clank around the room awkwardly. Forrest walks foreground past the doctor and Mrs. Gump, and a loud thud is heard as, outside, Forrest falls. Mrs. Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother. A black and white photo of General Nathan Bedford Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb, including his horse. The General rides off, followed by a large group of Klan members dressed in full uniform. Mrs. Gump and Forrest walk across the street, and Forrest stops suddenly as his brace gets stuck, caught in a gutter grate. Mrs. Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch. Mrs. Gump and Forrest walk along the sidewalk past the two old men, with Mrs. Gump holding tightly onto Forrest's hand, and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway. Mrs. Gump leads Forrest to the porch and bends down to look him in the eye. The principal sighs and then stands up as Forrest sits outside the principal's office and waits. The principal stands in front of Mrs. Gump while Forrest, sitting left, listens and sits outside the principal's office. Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside. Forrest sits on the swing as the grunts continue, and the principal steps out of the Gump House, wiping sweat from his face. Forrest is sitting on the porch, and the principal wipes the sweat from his neck, then looks back at Forrest, who grunts, imitating him. Embarrassed, the principal turns and walks away. Forrest lies down on his bed and looks up, as a cab driver closes the trunk of the car while two women walk toward the house. A milkman steps down from the porch, and a man with a cane steps to the left across the hall.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He unseals a carton of confections and extends it out for the caregiver, who shakes her head, a bit hesitant about this peculiar man beside her. Forrest consumes a confection as he gazes down at the caregiver's footwear, and the ebony woman gazes at Forrest as he gazes down at his own footwear. Forrest shuts his eyes tightly, just as a young boy shuts his eyes tightly; it is juvenile Forrest as he perches in a physician's office. Forrest has been equipped with orthopedic footwear and metallic leg supports, and the physician sets Forrest down on his feet. Forrest ambles around rigidly as his mother, Mrs. Gump, observes him clank around the chamber awkwardly. Forrest ambles foreground past the physician and Mrs. Gump, and a loud crash is heard as, outside, Forrest tumbles. Mrs. Gump and young Forrest stroll across the avenue with Forrest ambling rigidly beside his mother. An ebony and white photograph of General Nathan Bedford Forrest transitions into live motion as the General dons a hooded sheet over his head and is in complete Ku Klux Klan attire, including his steed. The General rides off, followed by a vast assembly of Klan members attired in complete uniform. Mrs. Gump and Forrest stroll across the avenue, and Forrest halts suddenly as his support becomes stuck, ensnared in a trench grate. Mrs. Gump bends down and attempts to liberate Forrest while two elderly cronies recline in front of a barber shop and observe. Mrs. Gump and Forrest stroll along the walkway past the two elderly men, with Mrs. Gump clutching tightly onto Forrest's hand, and they stroll along a dirt lane where a line of mailboxes stands to the left before strolling along the Gump Boarding House drive. Mrs. Gump guides Forrest to the veranda and bends down to gaze him in the eye. The superintendent exhales and then stands up as Forrest perches outside the superintendent's office and waits. The superintendent stands in front of Mrs. Gump while Forrest, sitting left, listens and perches outside the superintendent's office. Loud primal male grunts are heard emanating from within the domicile as Forrest perches on a swing outside. Forrest perches on the swing as the grunts persist, and the superintendent steps out of the Gump House, mopping perspiration from his visage. Forrest is sitting on the veranda, and the superintendent mops the perspiration from his neck, then gazes back at Forrest, who grunts, mimicking him. Abashed, the superintendent turns and ambles away. Forrest reclines on his mattress and gazes up, as a cab driver shuts the trunk of the vehicle while two women stroll toward the domicile. A milkman steps down from the veranda, and a man with a cane steps to the left across the corridor."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A box of chocolates is opened by him and held out for the nurse, who shakes her head, a bit apprehensive about this strange man next to her. A chocolate is eaten by Forrest as he looks down at the nurse's shoes, and the black woman stares at him as he looks down at his own shoes. Forrest's eyes are closed tightly by him, just as a little boy closes his eyes tightly; it is young Forrest as he sits in a doctor's office. Orthopedic shoes and metal leg braces have been fitted on Forrest, and he is set down on his feet by the doctor. Stiffly, Forrest walks around as his mother, Mrs. Gump, watches him clank around the room awkwardly. Forrest walks foreground past the doctor and Mrs. Gump, and he is heard with a loud thud as, outside, he falls. Across the street, Mrs. Gump and young Forrest walk with him walking stiffly next to his mother. A black and white photo of General Nathan Bedford Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb, including his horse. The General rides off, and a large group of Klan members dressed in full uniform follows him. Mrs. Gump and Forrest walk across the street, and he stops suddenly as his brace gets stuck, caught in a gutter grate. Mrs. Gump bends down and tries to free him while two old cronies sit in front of a barber shop and watch. Mrs. Gump and Forrest walk along the sidewalk past the two old men, with her holding tightly onto his hand, and they walk along a dirt road where a row of mailboxes stands to the left before they walk along the Gump Boarding House driveway. Mrs. Gump leads Forrest to the porch and bends down to look him in the eye. The principal sighs and then stands up while Forrest sits outside the principal's office and waits. In front of Mrs. Gump, the principal stands while Forrest, sitting left, listens and sits outside the principal's office. Loud organic male grunts come from inside the house as Forrest sits on a swing outside. Forrest sits on the swing as the grunts continue, and the principal steps out of the Gump House, wiping sweat from his face. Forrest is sitting on the porch when the principal wipes the sweat from his neck, then looks back at Forrest, who grunts, imitating him. Embarrassed, the principal turns and walks away. Forrest lies down on his bed and looks up, as the trunk of the car is closed by a cab driver while two women walk toward the house. The porch is stepped down from by a milkman, and across the hall, a man with a cane steps to the left."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Forrest offers chocolates to a nurse, who declines, wary of the stranger. He eats a chocolate and looks at her shoes, then his own, recalling young Forrest in a doctor's office fitted with braces. His mother, Mrs. Gump, watches him walk awkwardly, and as they cross a street, his brace gets stuck. Mrs. Gump frees him while onlookers watch. They pass mailboxes and walk home. On the porch, Forrest waits outside the principal's office, hearing grunts from inside, and observes the principal leaving, perspiring. Embarrassed, the principal walks away as Forrest imitates his grunt. Forrest lies in bed, and outside, a cab driver and two women approach, as a milkman and a man with a cane cross paths."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He opens a chocolate box for the nurse, who hesitates. Forrest eats a chocolate, gazing at the nurse's and then his own shoes. Closing his eyes, Forrest recalls being fitted with orthopedic shoes and braces in a doctor's office. He walks stiffly as Mrs. Gump watches, falls outside, and then walks beside her across the street. A photo of General Nathan Bedford Forrest transitions to him in Klan garb, riding off with others. Forrest's brace gets stuck in a gutter. Mrs. Gump frees him, and they pass two old men outside a barbershop, then proceed to their house. On the porch, Mrs. Gump speaks to Forrest. In the principal's office, Forrest sits outside. Loud grunts come from inside as Forrest waits on a swing. The principal exits, sweating, and Forrest imitates his grunts. Embarrassed, the principal leaves. Forrest lies in bed as a cab driver closes a trunk, two women approach the house, a milkman exits, and a man with a cane moves across the hall."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He opens up a box filled with assorted chocolates and generously offers it to the nurse beside him, who shakes her head in refusal, appearing somewhat apprehensive and unsure about this peculiar man seated next to her. Forrest then selects one piece of chocolate from the box and eats it, all the while casting his gaze downwards toward the nurse's shoes. Meanwhile, the black woman at a distance directs her stare towards Forrest, who continues looking down, now at his own shoes. With determination, Forrest closes his eyes tightly, mirroring the way a young boy might squeeze his eyes shut; it is, in fact, young Forrest, who is now seated in a doctor's office. During this visit, Forrest has been fitted with orthopedic shoes and metal leg braces, and the doctor gently places Forrest on his feet. As Forrest begins to walk, his movements are rigid, and his steps are clumsy, as his mother, Mrs. Gump, observes him clanking awkwardly around the room. Forrest proceeds to walk across the foreground past both the doctor and Mrs. Gump, and a sudden loud thud echoes as, outside, Forrest experiences a fall. Mrs. Gump and young Forrest then proceed to walk across the street, with Forrest moving stiffly alongside his mother. A black and white photograph of General Nathan Bedford Forrest suddenly transitions into live-action footage where the General is seen putting on a hooded sheet over his head, completing his full Ku Klux Klan attire, which includes dressing his horse. The General then rides off, leading a large group of Klan members, all clad in full regalia. Meanwhile, Mrs. Gump and Forrest make their way across the street, but Forrest abruptly halts as his brace becomes stuck and caught in a gutter grate. Mrs. Gump bends down in an effort to free Forrest while two elderly cronies sit in front of a barber shop, watching the scene unfold. With determination, Mrs. Gump and Forrest finally continue walking along the sidewalk, passing by the two old men, and Mrs. Gump is seen holding tightly onto Forrest's hand. Together, they walk along a dirt road where a row of mailboxes stands to their left, before continuing along the driveway leading to the Gump Boarding House. Upon reaching the porch, Mrs. Gump bends down to look Forrest directly in the eye. The principal, with a sigh, then stands up as Forrest waits calmly outside the principal's office. The principal stands in front of Mrs. Gump while Forrest, sitting to the left, listens attentively as he waits outside the office. Loud, organic male grunts emanate from within the house, echoing as Forrest sits on a swing outside. As the grunting continues, Forrest remains on the swing, and the principal emerges from the Gump House, wiping beads of sweat from his face. Forrest, still sitting on the porch, observes as the principal wipes sweat from his neck and then glances back at Forrest, who grunts in imitation of him. Embarrassed by the situation, the principal promptly turns and walks away. Forrest then lies down on his bed, looking upward, just as a cab driver firmly closes the trunk of his car while two women approach the house. A milkman steps down from the porch, and a man with a cane moves to the left, crossing the hall."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He carefully opens up a box that is filled to the brim with a variety of assorted chocolates and, with a generous gesture, offers this delightful assortment to the nurse seated beside him. However, she simply shakes her head in polite refusal, appearing somewhat apprehensive and unsure about this peculiar man who sits next to her. Forrest then takes it upon himself to select one piece of chocolate from the box, popping it into his mouth with a sense of purpose, all the while casting his gaze downward toward the nurse's shoes. Simultaneously, the black woman, standing at a distance, directs her curious stare towards Forrest, who continues to fix his eyes downward, now at his own shoes. With a resolute sense of determination, Forrest closes his eyes tightly, much like a young boy clenching his eyes shut in a moment of anxiety; it is, in fact, young Forrest, now seated in a doctor's office. During this particular visit, Forrest has been fitted with orthopedic shoes accompanied by metal leg braces, and the doctor gently places Forrest on his feet with care. As Forrest begins to take a few steps, his movements are noticeably rigid, and his steps are awkwardly clumsy, while his mother, Mrs. Gump, watches over him, observing him clank awkwardly around the room. Forrest proceeds to walk across the foreground, passing by both the doctor and Mrs. Gump, and a sudden loud thud echoes through the space as, outside the office, Forrest takes a tumble. Mrs. Gump and young Forrest then continue their walk across the street, with Forrest moving in a stiff manner alongside his attentive mother. A black and white photograph of General Nathan Bedford Forrest abruptly transitions into live-action footage where the General is seen donning a hooded sheet over his head, completing his full Ku Klux Klan attire, which includes dressing his horse. The General then gallops off confidently, leading a sizable group of Klan members, all fully clad in their own regalia. In the meantime, Mrs. Gump and Forrest make their way across the street carefully, but Forrest comes to an abrupt halt as his brace becomes stuck and caught in a gutter grate. Mrs. Gump bends down with determination in an effort to free Forrest while two elderly cronies sit in front of a barber shop, watching the scene unfold with mild curiosity. With determination, Mrs. Gump and Forrest finally manage to continue walking along the sidewalk, passing by the two old men, and Mrs. Gump is seen holding tightly onto Forrest's hand for support. Together, they walk along a dirt road where a row of mailboxes stands to their left, before continuing along the driveway that leads to the Gump Boarding House. Upon reaching the porch of their home, Mrs. Gump bends down to look Forrest directly in the eye, offering reassurance. The principal, letting out a sigh, then stands up as Forrest waits calmly outside the principal's office. The principal positions himself in front of Mrs. Gump while Forrest, sitting quietly to the left, listens attentively while waiting outside the office door. Loud, organic male grunts emanate from within the house, echoing through the walls, as Forrest sits patiently on a swing outside. As the grunting continues, Forrest remains on the swing, and the principal emerges from the Gump House, visibly wiping beads of sweat from his face. Forrest, still seated on the porch, observes the principal's attempts to cool down by wiping sweat from his neck and then glances back at Forrest, who amusingly grunts in imitation of him. Embarrassed by the situation, the principal promptly turns on his heel and walks away briskly. Forrest then lies down on his bed, staring upward in contemplation, just as a cab driver firmly closes the trunk of his vehicle while two women approach the house in anticipation. A milkman steps down carefully from the porch, and a man with a cane moves deliberately to the left, crossing the hallway with determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He opens the box of chocolates with deliberate care, revealing their tempting assortment, and then extends it invitingly towards the nurse. She hesitates, her initial curiosity turning to apprehension as she evaluates the intentions of the unfamiliar man beside her. Forrest, undeterred by her reluctance, selects a chocolate with a casual ease and pops it into his mouth, savoring its sweetness, while his gaze drifts downwards, momentarily fixating on the nurse's shoes. The black woman nearby fixes her eyes on Forrest, observing his unselfconscious inspection before following his gaze to his own shoes. With a sudden intensity, Forrest squeezes his eyes shut tightly, reminiscent of a young boy attempting to shut out the world. Transitioning back in time, this young Forrest finds himself sitting in a doctor's office, where he's been outfitted with cumbersome orthopedic shoes and metal leg braces. The doctor, having completed his work, carefully stands Forrest upright on his feet. As young Forrest begins to navigate the room, his movements are awkward and stiff, the metal braces clanking with each uncertain step, under the watchful eyes of his mother, Mrs. Gump. He ventures forward, focusing on putting one foot in front of the other, walking past the doctor and Mrs. Gump. Suddenly, a resounding thud echoes through the air, marking the moment Forrest loses his footing and falls just outside. Mrs. Gump guides young Forrest across the street, with his steps noticeably rigid beside her steady presence. Meanwhile, a black and white photograph of General Nathan Bedford Forrest animates into life, depicting the General as he cloaks himself with a hooded sheet, fully donned in the infamous Ku Klux Klan attire, complete with his horse. In a chilling display, the General gallops away, leading a sizable assembly of Klan members, all clad in their emblematic uniforms. Back in the present, Mrs. Gump and Forrest continue their crossing, abruptly halting when Forrest's brace snags on a gutter grate. With a sense of urgency, Mrs. Gump leans down to disentangle him, observed by two old cronies lounging in front of a barber shop, amused spectators to the scene. Freed at last, Mrs. Gump grips Forrest's hand firmly, guiding him along the sidewalk past the onlookers. Their path leads them onto a dirt road, bordered by a line of mailboxes to their left, before they make their way up the driveway to the Gump Boarding House. On the porch, Mrs. Gump meets Forrest's eyes, bending to offer him her encouragement. Inside, Forrest sits patiently outside the principal's office, his youthful energy contained as the principal, with a resigned sigh, stands to address Mrs. Gump. Seated at the periphery, Forrest listens intently as the adults converse. His attention wanders to the sounds of loud, organic male grunts emanating from within the house, which persist as he remains on the swing outside. Soon, the principal exits the Gump House, discreetly wiping sweat from his face, only to catch Forrest mimicking his grunts, an innocent reflection that leaves the principal flustered. Embarrassed, he abruptly departs. In the quiet aftermath, Forrest reclines on his bed, staring up contemplatively, disconnected from the scene outside where a cab driver busily shuts the trunk of his vehicle, and two women stride purposefully towards the house. Nearby, a milkman concludes his delivery, stepping down from the porch, as a man with a cane makes his way methodically across the hall to the left."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Forrest offers a box of chocolates to a nearby nurse, who declines with suspicion. As he eats a chocolate, Forrest briefly examines both his and the nurse’s shoes. Closing his eyes, he reflects on his childhood, recalling being fitted with orthopedic shoes and metal leg braces in a doctor's office. He awkwardly walks around as his mother, Mrs. Gump, observes, leading to him falling outside. Mrs. Gump then accompanies young Forrest across the street, where his brace becomes stuck in a gutter. She frees him while two men watch, and they proceed past a barber shop, along a road with mailboxes, and up the Gump Boarding House driveway. On the porch, Mrs. Gump reassures Forrest by looking him in the eye. Meanwhile, at school, a principal engages with Mrs. Gump as Forrest waits outside. Organic male grunts from the house reach Forrest, who sits on a swing. The principal exits, reacting awkwardly when Forrest mimics him. Forrest later lies on his bed, observing the happenings outside: a cab driver closes a trunk, two women head to the house, and a milkman and a man with a cane pass by on the porch."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He opens a box of chocolates from the famous local confectionery, known for its rich and delectable treats, and holds it out for the nurse, who shakes her head, a bit apprehensive about this strange man next to her. Forrest, who has a penchant for sweets, eats a chocolate as he looks down at the nurse's shoes, sensible footwear common among healthcare professionals for their long shifts, and the black woman stares at Forrest as he looks down at his own shoes. Forrest closes his eyes tightly, just as a little boy closes his eyes tightly; it is young Forrest as he sits in a doctor's office, a place that always intimidated him due to frequent visits. Forrest has been fitted with orthopedic shoes and metal leg braces, a medical intervention of the 1950s for his condition, and the doctor sets Forrest down on his feet. Forrest walks around stiffly as his mother, Mrs. Gump, watches him clank around the room awkwardly. Forrest walks foreground past the doctor and Mrs. Gump, and a loud thud is heard as, outside, Forrest falls due to the unfamiliar weight of his braces. Mrs. Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother. A black and white photo of General Nathan Bedford Forrest, a controversial figure known as one of the original leaders of the Ku Klux Klan, turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb, including his horse. The General rides off, followed by a large group of Klan members dressed in full uniform that symbolizes their sinister purpose. Mrs. Gump and Forrest walk across the street, and Forrest stops suddenly as his brace gets stuck, caught in a gutter grate that was often a hazard for pedestrians. Mrs. Gump bends down and tries to free Forrest while two old cronies, who pass their days observing the street, sit in front of a barber shop and watch. Mrs. Gump and Forrest walk along the sidewalk past the two old men, with Mrs. Gump holding tightly onto Forrest's hand, and they walk along a dirt road where a row of mailboxes, which serve as the community's primary communication link, stands to the left before walking along the Gump Boarding House driveway. Mrs. Gump leads Forrest to the porch and bends down to look him in the eye. The principal sighs, accustomed to such meetings to discuss Forrest's unique challenges, and then stands up as Forrest sits outside the principal's office and waits. The principal stands in front of Mrs. Gump while Forrest, sitting left, listens and sits outside the principal's office. Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside, a favorite pastime of his for thinking. Forrest sits on the swing as the grunts continue, and the principal steps out of the Gump House, wiping sweat from his face, evidence of the intense discussion. Forrest is sitting on the porch, and the principal wipes the sweat from his neck, then looks back at Forrest, who grunts, imitating him in naive curiosity. Embarrassed, the principal turns and walks away. Forrest lies down on his bed and looks up, as a cab driver closes the trunk of the car while two women walk toward the house, likely the latest boarders at the Gump Boarding House. A milkman steps down from the porch, an image of a bygone era of daily home deliveries, and a man with a cane, indicative of age or injury, steps to the left across the hall."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her. Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes. Forrest closes his eyes tightly just as a little boy closes his eyes tightly. it is young Forrest as he sits in a doctor's office. Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet. Forrest walks around stiffly as his mother. Mrs Gump watches him clank around the room awkwardly. Forrest walks foreground past the doctor and Mrs Gump and a loud thud is heard as outside Forrest falls. Mrs Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother. A black and white photo of General Nathan Bedford. Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb including his horse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The General rides off followed by a large group of Klan members dressed in full uniform. Mrs Gump and Forrest walk across the street and Forrest stops suddenly as his brace gets stuck caught in a gutter grate. Mrs Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch Mrs Gump and Forrest walk along the sidewalk past the two old men with Mrs Gump holding tightly onto Forrest's hand and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway. Mrs Gump leads Forrest to the porch and bends down to look him in the eye. The principal sighs and then stands up as Forrest sits outside the principal's office and waits. The principal stands in front of Mrs Gump while Forrest sitting left listens and sits outside the principal's office. Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside. Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face. Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed. the principal turns and walks away. Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house. A milkman steps down from the porch and a man with a cane steps to the left across the hall."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her. Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes. Forrest closes his eyes tightly just as a little boy closes his eyes tightly. it is young Forrest as he sits in a doctor's office. Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet. Forrest walks around stiffly as his mother. Mrs Gump watches him clank around the room awkwardly. Forrest walks foreground past the doctor and Mrs Gump and a loud thud is heard as outside Forrest falls. Mrs Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother. A black and white photo of General Nathan Bedford. Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb including his horse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The General rides off followed by a large group of Klan members dressed in full uniform. Mrs Gump and Forrest walk across the street and Forrest stops suddenly as his brace gets stuck caught in a gutter grate. Mrs Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch Mrs Gump and Forrest walk along the sidewalk past the two old men with Mrs Gump holding tightly onto Forrest's hand and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway. Mrs Gump leads Forrest to the porch and bends down to look him in the eye. The principal sighs and then stands up as Forrest sits outside the principal's office and waits. The principal stands in front of Mrs Gump while Forrest sitting left listens and sits outside the principal's office. Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside. Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face. Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed. the principal turns and walks away. Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house. A milkman steps down from the porch and a man with a cane steps to the left across the hall."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her. Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes. Forrest closes his eyes tightly just as a little boy closes his eyes tightly. it is young Forrest as he sits in a doctor's office. Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet. Forrest walks around stiffly as his mother. Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside. Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face. Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed. the principal turns and walks away. Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house. A milkman steps down from the porch and a man with a cane steps to the left across the hall."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her. Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes. the principal turns and walks away. Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house. A milkman steps down from the porch and a man with a cane steps to the left across the hall."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl unfolds a map of candies and offers it to the teacher, who waves her wings, a bit skeptical about this peculiar bird beside her. Felix devours a marshmallow as he gazes down at the teacher's necklace, and the gray pigeon glares at Felix as he gazes down at his own necklace. Felix shuts his beak tightly, just as a small kitten shuts its beak tightly; it is young Felix as he lounges in a wizard's library. Felix has been fitted with magical slippers and enchanted wing covers, and the wizard places Felix down on his paws. Felix flutters around energetically as his caretaker, Mrs. Chipmunk, observes him cavort around the chamber clumsily. Felix flutters forward past the wizard and Mrs. Chipmunk, and a loud crash occurs as, outside, Felix tumbles. Mrs. Chipmunk and young Felix waddle across the forest with Felix fluttering energetically next to his caretaker. A sepia-toned painting of Admiral Archibald Redwood transforms into vibrant motion as the Admiral dons a feathered cape over his head and is in full masquerade regalia, including his griffin. The Admiral glides away, followed by a large band of masqueraders dressed in full costume. Mrs. Chipmunk and Felix waddle across the forest, and Felix halts abruptly as his slipper gets trapped, caught in a thorny bush. Mrs. Chipmunk kneels down and attempts to liberate Felix while two ancient tortoises rest beside a bakery and observe. Mrs. Chipmunk and Felix waddle along the cobblestones past the two ancient tortoises, with Mrs. Chipmunk holding firmly onto Felix's wing, and they traverse along a sandy path where a cluster of sunflowers stands to the right before skipping along the Chipmunk Boarding Hollow entryway. Mrs. Chipmunk guides Felix to the threshold and kneels down to gaze him in the eye. The headmaster groans and then stretches up as Felix perches outside the headmaster's chamber and waits. The headmaster stands beside Mrs. Chipmunk while Felix, perched left, eavesdrops and perches outside the headmaster's chamber. Loud mechanical rumbles are heard emanating from within the cave as Felix perches on a hammock outside. Felix perches on the hammock as the rumbles persist, and the headmaster glides out of the Chipmunk Hollow, dabbing oil from his wings. Felix is perched on the threshold, and the headmaster dabs the oil from his feathers, then glances back at Felix, who rumbles, mimicking him. Flustered, the headmaster turns and glides away. Felix curls up on his perch and glances up, as a sailor latches the lid of the wagon while two pixies flutter toward the hollow. A postman swings down from the threshold, and a knight with a staff strides to the right across the corridor."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest offers a box of chocolates to a nurse, who declines, appearing wary of him. Forrest eats a chocolate while observing the nurse's shoes, then reminisces about his childhood. Young Forrest is fitted with orthopedic shoes and leg braces, walking awkwardly as his mother, Mrs. Gump, watches. They cross a street where Forrest's brace gets stuck in a gutter, and Mrs. Gump helps him free it. They pass by two men outside a barber shop and continue to the Gump Boarding House. Forrest waits outside the principal's office, hearing sounds inside. The principal emerges, wipes sweat from his face, and Forrest mimics him. Embarrassed, the principal leaves. Forrest lies in bed, watching various people come and go from the house."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A milkman steps down from the porch and a man with a cane steps to the left across the hall Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house the principal turns and walks away Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside The principal stands in front of Mrs Gump while Forrest sitting left listens and sits outside the principal's office The principal sighs and then stands up as Forrest sits outside the principal's office and waits Mrs Gump leads Forrest to the porch and bends down to look him in the eye Mrs Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch Mrs Gump and Forrest walk along the sidewalk past the two old men with Mrs Gump holding tightly onto Forrest's hand and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway Mrs Gump and Forrest walk across the street and Forrest stops suddenly as his brace gets stuck caught in a gutter grate The General rides off followed by a large group of Klan members dressed in full uniform Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb including his horse A black and white photo of General Nathan Bedford Mrs Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother Forrest walks foreground past the doctor and Mrs Gump and a loud thud is heard as outside Forrest falls Mrs Gump watches him clank around the room awkwardly Forrest walks around stiffly as his mother Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet it is young Forrest as he sits in a doctor's office Forrest closes his eyes tightly just as a little boy closes his eyes tightly Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her it is young Forrest as he sits in a doctor's office Forrest closes his eyes tightly just as a little boy closes his eyes tightly Forrest walks around stiffly as his mother Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet Forrest walks foreground past the doctor and Mrs Gump and a loud thud is heard as outside Forrest falls Mrs Gump watches him clank around the room awkwardly A black and white photo of General Nathan Bedford Mrs Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother The General rides off followed by a large group of Klan members dressed in full uniform Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb including his horse Mrs Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch Mrs Gump and Forrest walk along the sidewalk past the two old men with Mrs Gump holding tightly onto Forrest's hand and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway Mrs Gump and Forrest walk across the street and Forrest stops suddenly as his brace gets stuck caught in a gutter grate The principal sighs and then stands up as Forrest sits outside the principal's office and waits Mrs Gump leads Forrest to the porch and bends down to look him in the eye Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside The principal stands in front of Mrs Gump while Forrest sitting left listens and sits outside the principal's office Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house the principal turns and walks away A milkman steps down from the porch and a man with a cane steps to the left across the hall"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mrs Gump and Forrest walk across the street and Forrest stops suddenly as his brace gets stuck caught in a gutter grate Mrs Gump bends down and tries to free Forrest while two old cronies sit in front of a barber shop and watch Mrs Gump and Forrest walk along the sidewalk past the two old men with Mrs Gump holding tightly onto Forrest's hand and they walk along a dirt road where a row of mailboxes stands to the left before walking along the Gump Boarding House driveway Mrs Gump leads Forrest to the porch and bends down to look him in the eye The principal sighs and then stands up as Forrest sits outside the principal's office and waits The principal stands in front of Mrs Gump while Forrest sitting left listens and sits outside the principal's office Loud organic male grunts are heard coming from inside the house as Forrest sits on a swing outside Forrest sits on the swing as the grunts continue and the principal steps out of the Gump House wiping sweat from his face Forrest is sitting on the porch and the principal wipes the sweat from his neck then looks back at Forrest who grunts imitating him Embarrassed the principal turns and walks away Forrest lies down on his bed and looks up as a cab driver closes the trunk of the car while two women walk toward the house A milkman steps down from the porch and a man with a cane steps to the left across the hall He opens a box of chocolates and holds it out for the nurse who shakes her head a bit apprehensive about this strange man next to her Forrest eats a chocolate as he looks down at the nurse's shoes and the black woman stares at Forrest as he looks down at his own shoes Forrest closes his eyes tightly just as a little boy closes his eyes tightly it is young Forrest as he sits in a doctor's office Forrest has been fitted with orthopedic shoes and metal leg braces and the doctor sets Forrest down on his feet Forrest walks around stiffly as his mother Mrs Gump watches him clank around the room awkwardly Forrest walks foreground past the doctor and Mrs Gump and a loud thud is heard as outside Forrest falls Mrs Gump and young Forrest walk across the street with Forrest walking stiffly next to his mother A black and white photo of General Nathan Bedford Forrest turns into live action as the General dons a hooded sheet over his head and is in full Ku Klux Klan garb including his horse The General rides off followed by a large group of Klan members dressed in full uniform"
        }
      ]
    }
  ]
}