{
  "ground_truth": "A Jeep motors along a quiet dark road; Jack is driving, and Louis sits beside him with a troubled expression. Louis looks over at Jack, who keeps his eyes on the road, though deep emotions boil beneath the surface, and Jack gives him the briefest of glances. They stand at the edge of the pit, looking down as something falls about 30 feet before touching the bottom. At the cemetery, Joe and Cary climb down a rope into the tunnel that the alien has built. At the bottom, they light another sparkler and look around the gloomy tunnel, hurrying down the large bore tunnel. Up ahead is faint flickering light, and as Joe and Cary round a corner, they see a massive chamber cut into the subterranean rocks. They cautiously edge closer, finding it full of machinery and some kind of industrial scale construction taking place. As they creep closer, they come across the sheriff hanging upside down from the roof of the tunnel, either dead or unconscious. Joe claps his hand over Cary's mouth to stop him from screaming. They look around at more bodies hanging upside down from the ceiling, none of them moving. The alien appears in the chamber, doing something behind some machinery and holding what appears to be a severed human leg, then scuttles off. Joe spots Alice dangling upside down and hurries back up the tunnel, using a sparkler to light his way, while Cary empties out his bag of pyrotechnics. Joe arrives at a fork in the tunnel and chooses a path. Cary selects some noisy fireworks and watches as the alien works on whatever it is building. Alice is still dangling motionless, and the tunnel fork brings Joe close to her. He watches as the alien continues its work. Cary tries to get his lighter to spark up. The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she's hanging. Joe watches with mounting alarm as Cary finally sparks his Zippo into life, lights a firecracker, and leaves it beside other fireworks before running back down the tunnel. The alien puts Alice down and investigates the noise. Joe breaks cover, runs to Alice, who lies un-moving on the chamber floor, hesitates, then slaps her hard. She wakes, stares at him, and hugs him tightly.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A Jeep drives along a serene dark route; Jack is steering, and Louis sits alongside him with a concerned expression. Louis glances over at Jack, who keeps his gaze on the route, though profound emotions simmer beneath the surface, and Jack gives him the briefest of looks. They stand at the brink of the pit, peering down as something plunges about 30 feet before touching the base. At the graveyard, Joe and Cary descend a rope into the passage that the alien has constructed. At the base, they ignite another sparkler and look around the dim passage, rushing down the large bore passage. Up ahead is faint flickering glow, and as Joe and Cary round a corner, they see a vast chamber carved into the underground rocks. They cautiously edge nearer, finding it full of apparatus and some kind of industrial scale fabrication taking place. As they creep nearer, they come across the sheriff dangling upside down from the ceiling of the passage, either dead or unconscious. Joe puts his hand over Cary's mouth to prevent him from shouting. They look around at more bodies dangling upside down from the roof, none of them moving. The alien emerges in the chamber, doing something behind some apparatus and clutching what appears to be a severed human limb, then scuttles off. Joe notices Alice dangling upside down and rushes back up the passage, using a sparkler to illuminate his way, while Cary empties out his sack of pyrotechnics. Joe reaches a fork in the passage and selects a route. Cary chooses some loud fireworks and observes as the alien works on whatever it is constructing. Alice is still dangling motionless, and the passage fork brings Joe close to her. He observes as the alien continues its task. Cary attempts to get his lighter to ignite. The alien remains unaware of Cary or Joe and pauses its task to take Alice down from where she's dangling. Joe observes with increasing concern as Cary finally ignites his Zippo into life, lights a firecracker, and places it beside other fireworks before sprinting back down the passage. The alien puts Alice down and inspects the sound. Joe emerges from hiding, runs to Alice, who lies motionless on the chamber floor, hesitates, then slaps her firmly. She awakens, stares at him, and embraces him tightly."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A Jeep is motored along a quiet dark road; it is driven by Jack, and beside him sits Louis with a troubled expression. Jack is looked over by Louis, who keeps his eyes on the road, though deep emotions boil beneath the surface, and the briefest of glances is given to him by Jack. At the edge of the pit, they stand, looking down as something is seen falling about 30 feet before it touches the bottom. At the cemetery, a rope is climbed down by Joe and Cary into the tunnel that the alien built. At the bottom, another sparkler is lit by them, and they look around the gloomy tunnel, hurriedly making their way down the large bore tunnel. Ahead is faint flickering light, and as a corner is rounded by Joe and Cary, a massive chamber is seen cut into the subterranean rocks. They edge closer cautiously, finding it full of machinery and some kind of industrial-scale construction that is taking place. As they creep closer, the sheriff is come across by them, hanging upside down from the roof of the tunnel, either dead or unconscious. Cary's mouth is clapped over by Joe's hand to stop him from screaming. Around them, more bodies are looked at, hanging upside down from the ceiling, none of them moving. In the chamber, the alien appears, doing something behind some machinery and holding what appears to be a severed human leg, then scuttles off. Alice is spotted by Joe, dangling upside down, and he hurries back up the tunnel, using a sparkler to light his way, while Cary empties his bag of pyrotechnics. At a fork in the tunnel, Joe arrives and chooses a path. Some noisy fireworks are selected by Cary, who watches as the alien works on whatever it is building. Alice is still seen dangling motionless, and the tunnel fork brings Joe close to her. As the alien continues its work, he watches. His lighter is tried by Cary to get it to spark up. Cary or Joe is left unnoticed by the alien, and its work is stopped to take Alice down from where she's hanging. With mounting alarm, Joe watches as finally Cary sparks his Zippo into life, lights a firecracker, and leaves it beside other fireworks before he runs back down the tunnel. Alice is put down by the alien, and the noise is investigated. Cover is broken by Joe, who runs to Alice, who lies unmoving on the chamber floor, hesitates, then she is slapped hard by him. She wakes, stares at him, and hugs him tightly."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A Jeep travels a quiet road; Jack drives while Louis sits beside him, troubled. Louis glances at Jack, who briefly returns the look, emotions simmering beneath. They stand at a pit, watching something fall 30 feet down. At the cemetery, Joe and Cary descend a rope into an alien-made tunnel. Lighting a sparkler, they explore the dark tunnel, moving quickly toward a dim light. They find a vast chamber, filled with machinery and a large construction. Edging closer, they see the sheriff hanging upside down, unconscious or dead. Joe covers Cary's mouth to stop him from screaming at more hanging bodies. The alien appears, holding a severed leg, then leaves. Joe sees Alice hanging and rushes back, lighting the way with a sparkler, as Cary empties fireworks. Joe reaches a tunnel fork near Alice. Cary lights fireworks while the alien works, unaware of them. It stops to take Alice down. Joe runs to her, hesitates, then slaps her. She awakens and hugs him tightly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A Jeep travels a quiet dark road; Jack drives while Louis, looking troubled, occasionally glances at him. They pause at a pit's edge, watching something fall 30 feet down. In the cemetery, Joe and Cary descend into a tunnel created by the alien. They light a sparkler in the dim tunnel, moving towards a faint light. Turning a corner, they find a massive chamber full of machinery and construction. They discover the sheriff hanging upside down, potentially dead. Joe silences Cary’s scream as they notice more bodies. The alien appears, holding a severed human leg, then vanishes. Spotting Alice hanging upside down, Joe races back while Cary empties his fireworks bag. Joe reaches a tunnel fork and chooses a path. Cary lights noisy fireworks, watching the alien work. Alice remains still as Joe gets close. The alien, unaware and focused, suddenly takes Alice down. Joe watches nervously as Cary lights a firecracker, leaving it with others before fleeing. The alien investigates the noise. Joe rushes to Alice, slaps her awake, and she hugs him tightly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the Jeep steadily motors along a quiet and darkened road, the atmosphere inside the vehicle is tense. Jack, who is behind the wheel, maintains his focus on the road ahead, while his companion, Louis, occupies the seat beside him, wearing a notably troubled expression on his face. Despite Jack’s unwavering gaze on the road, there is a maelstrom of deep and intense emotions boiling beneath his calm exterior. He briefly steals the quickest of glances at Louis. \n\nTogether, they find themselves standing at the precarious edge of a yawning pit. As they peer over into the abyss, they observe something plummeting approximately 30 feet before gently coming to rest at the bottom. Meanwhile, at the cemetery, Joe and Cary carefully descend a rope, entering into a subterranean tunnel that the alien has meticulously constructed. Reaching the base, they ignite another sparkler, casting an illuminating glow around the otherwise gloomy and shadow-filled tunnel, and they hasten forward down the broad tunnel. Ahead of them, a faint flicker of light beckons, and as they navigate around a corner, they encounter a massive chamber hewn from the underground rock.\n\nThey advance slowly and cautiously, discovering the chamber filled with machinery and witnessing some kind of industrial-scale construction taking place. As they inch closer to this scene, they come across the sheriff, notably suspended upside-down from the tunnel’s ceiling, appearing either dead or unconscious. Quick to react, Joe claps his hand over Cary's mouth, preventing an involuntary scream from escaping. Their eyes scan the area, seeing yet more bodies hanging suspended and motionless from the ceiling. \n\nSuddenly, the alien emerges within the chamber, engaged in some mysterious task behind a piece of machinery, and clutching what seems to be a severed human leg, before swiftly scuttling off. Joe's gaze quickly shifts to spot Alice, also dangling upside-down, and he hastily retraces his steps back up the tunnel, navigating with the aid of a sparkler’s sputtering light, while Cary begins to frantically empty his bag full of pyrotechnics. Arriving at a fork in the tunnel, Joe makes a decisive choice and picks a path. Cary, on the other hand, selects an assortment of noisy fireworks, all while keeping his eye on the alien as it continues its industrious work. \n\nAlice remains suspended and unmoving as the tunnel’s fork brings Joe tantalizingly close to her. He observes anxiously as the alien perseveres with its construction tasks. Meanwhile, Cary struggles to ignite his lighter, determined to create a spark. The alien, blissfully unaware of Joe and Cary’s presence, momentarily halts its labor to carefully take Alice down from her hanging position. Joe watches, his alarm mounting, while Cary finally manages to spark his Zippo into life, kindling a firecracker, which he sets down beside other fireworks before sprinting back along the tunnel. Intrigued by the disturbance of noise, the alien investigates, allowing Joe to break cover. He dashes to Alice, who lies still and un-moving on the chamber’s floor. He hesitates only briefly before slapping her hard. This jolt awakens her, and upon realizing her rescuer’s identity, she stares at Joe and embraces him tightly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the Jeep steadily motors along a quiet and darkened road, the atmosphere inside the vehicle feels undeniably tense and charged with an undercurrent of unease. Jack, who is seated firmly behind the wheel, maintains his unwavering focus on the road stretching out ahead of them, while his companion, Louis, occupies the passenger seat beside him. Louis wears a notably troubled expression on his face, betraying the turmoil of thoughts swirling in his mind. Despite Jack’s unbroken gaze on the road, a maelstrom of deep and intense emotions churns beneath his calm exterior. He briefly steals the quickest of glances at Louis, as if gauging his companion’s state of mind.\n\nTogether, they find themselves standing at the precarious edge of a yawning pit, an unsettling sight before them. As they peer over the brink into the abyss, they observe something plummeting approximately 30 feet down before gently coming to rest at the bottom. Meanwhile, at the cemetery, Joe and Cary carefully descend a rope, entering into a subterranean tunnel that the alien has meticulously and precisely constructed. Reaching the base, they ignite another sparkler, casting an illuminating glow that pierces the otherwise gloomy and shadow-filled tunnel, and they hasten forward down the broad tunnel. Ahead of them, a faint flicker of light beckons, drawing them in, and as they navigate around a corner, they encounter a massive chamber hewn from the underground rock.\n\nThey advance slowly and cautiously, discovering the chamber filled with intricate machinery and witnessing some kind of industrial-scale construction taking place before their very eyes. As they inch closer to this intriguing scene, they come across the sheriff, notably suspended upside-down from the tunnel’s ceiling, appearing either dead or unconscious. Quick to react, Joe claps his hand over Cary's mouth, preventing an involuntary scream from escaping, which would betray their presence. Their eyes scan the area, seeing yet more bodies hanging suspended, motionless from the ceiling, creating a haunting tableau.\n\nSuddenly, the alien emerges within the chamber, engaged in some mysterious and unknown task behind a piece of complex machinery, clutching what seems to be a severed human leg, before swiftly scuttling off into the shadows. Joe's gaze quickly shifts to spot Alice, also dangling upside-down, and he hastily retraces his steps back up the tunnel, navigating with the aid of a sparkler’s sputtering light, while Cary begins to frantically empty his bag full of pyrotechnics. Arriving at a fork in the tunnel, Joe makes a decisive choice, picking a path that his instincts guide him towards. Cary, on the other hand, selects an assortment of noisy fireworks, all while keeping his wary eye on the alien as it continues its industrious work, seemingly oblivious to their presence.\n\nAlice remains suspended and unmoving as the tunnel’s fork brings Joe tantalizingly close to her, his heart racing with anticipation. He observes anxiously as the alien perseveres with its construction tasks, its focus unbroken. Meanwhile, Cary struggles with his lighter, determined to create a much-needed spark. The alien, blissfully unaware of Joe and Cary’s presence, momentarily halts its labor to carefully take Alice down from her hanging position. Joe watches, his alarm mounting, while Cary finally manages to spark his Zippo into life, kindling a firecracker, which he sets down beside other fireworks before sprinting back along the tunnel. Intrigued by the sudden and unexpected disturbance of noise, the alien investigates, providing Joe the opportunity to break cover. He dashes to Alice, who lies still and unmoving on the chamber’s cold floor. He hesitates only briefly before slapping her hard. This abrupt jolt awakens her, and upon realizing her rescuer’s identity, she stares at Joe, relief washing over her, and embraces him tightly, the tension of the moment momentarily dissolving in their shared warmth."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A Jeep motors steadily along a quiet, dark road, its engine purring softly amidst the stillness of the night. Inside, Jack is focused on the task of driving, his hands steady on the wheel as he navigates the path ahead. Louis, seated beside him, wears a troubled expression that suggests a storm of emotions beneath his calm exterior. His eyes drift to Jack, seeking some unspoken reassurance, but Jack remains intent on the road ahead, although a swirl of deep emotions churns beneath his composed facade. He gives Louis the briefest of glances, a silent acknowledgement of the tension shared between them. Later, they stand at the edge of a pit, their gazes directed downward as they watch an object descend roughly 30 feet before it lands softly at the bottom. At the cemetery, Joe and Cary, armed with determination, carefully descend a rope into the dark, mysterious tunnel constructed by the alien being. Upon reaching the bottom, they promptly light another sparkler, its bright flame flickering in the dim tunnel, providing just enough illumination as they hasten through the large bore tunnel. As they make their way forward, a faint flickering light emerges in the distance, guiding them as they round a corner. Here, they are met with the sight of a massive chamber skillfully carved into the subterranean rocks. With cautious steps, they edge closer to the cavernous space, now revealed to be brimming with machinery and what appears to be the site of an industrial-scale construction project. As they inch forward, their eyes widen in horror upon discovering the sheriff hanging upside down from the roof of the tunnel, an eerie sight suggesting he might be dead or unconscious. Instinctively, Joe claps his hand over Cary's mouth, stifling any scream that might escape in their shock. They take in the grim scene around them, their eyes darting to the other bodies suspended from the ceiling, all hanging motionless and lifeless. Suddenly, the alien appears within the chamber, busying itself behind a cluster of machinery, clutching what seems to be a severed human leg, before it abruptly scuttles away. Joe's eyes catch sight of Alice, who is also hanging upside down, and with urgency, he retraces his steps back up the tunnel, the sparkler in his hand guiding him through the darkness. Meanwhile, Cary rummages through his bag of pyrotechnics, emptying its contents in preparation for a makeshift plan. Joe soon finds himself at a fork in the tunnel and makes a swift decision, choosing one of the diverging paths. Back with Cary, he selects some particularly noisy fireworks, intending to create a distraction, while the alien remains engrossed in the work of building something mysterious. He observes Alice, still hanging motionless, as Joe's chosen path brings him nearer to her location. As Joe watches anxiously, Cary struggles to ignite his lighter. The alien, seemingly oblivious to their presence, pauses its labor to remove Alice from her suspended position. Joe looks on, alarm mounting, as Cary finally manages to ignite his Zippo lighter, successfully lighting a firecracker and leaving it among the other fireworks before he swiftly retreats down the tunnel. The alien, drawn by the noise, sets Alice down and moves to investigate. Seizing this moment, Joe emerges from his hiding, racing toward Alice, now lying unmoving on the chamber floor. He hesitates briefly, then decisively slaps her hard in a desperate attempt to rouse her. Alice's eyes flutter open as she stares at him, a moment of recognition dawning before she reaches out and hugs him tightly, the fear and tension momentarily giving way to relief in their shared embrace."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A Jeep navigates a quiet, dark road with Jack driving and Louis beside him, both tense with unspoken emotions. Arriving at the pit's edge, they watch something drop and settle at the bottom. Meanwhile, at the cemetery, Joe and Cary descend into an alien-built tunnel via rope. Illuminating their way with sparklers, they advance through the dim passage and discover a vast chamber filled with machinery and ongoing industrial construction. As they inch forward, they find the sheriff hanging upside down, either dead or unconscious, among other motionless bodies. Joe quickly muffles Cary's reaction to prevent screaming. The alien appears, engaged in its work with a severed human leg, and scuttles away. Spotting Alice suspended upside down, Joe retreats to a tunnel fork to reach her while Cary readies fireworks. Joe's path brings him near Alice as the alien continues its task, still unaware of their presence. Cary finally ignites a lighter, setting off a firecracker alongside other fireworks. The alien, distracted by the noise, places Alice down, allowing Joe to dash forward. He hesitates before rousing Alice with a slap, and once awake, she embraces him tightly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A Jeep, a rugged off-road vehicle often favored for its durability and capability in rough terrains, motors along a quiet dark road; Jack is driving, and Louis sits beside him with a troubled expression that reflects the tension of their situation. Louis looks over at Jack, who keeps his eyes on the road, though deep emotions boil beneath the surface of his composed exterior, and Jack gives him the briefest of glances. They stand at the edge of the pit, looking down as something falls about 30 feet, a depth commonly found in initial mine shafts, before touching the bottom. At the cemetery, named for its historic significance as one of the oldest in the area, Joe and Cary climb down a rope into the tunnel that the alien has built, using an underground network similar to those seen in sci-fi tales of hidden invasions. At the bottom, they light another sparkler, a small hand-held firework popular at celebrations for its bright and colorful display, and look around the gloomy tunnel, hurrying down the large bore tunnel reminiscent of underground construction projects. Up ahead is faint flickering light, and as Joe and Cary round a corner, they see a massive chamber cut into the subterranean rocks, suggesting advanced technological abilities. They cautiously edge closer, finding it full of machinery and some kind of industrial scale construction taking place, indicating the alien's intentions might involve large-scale planetary operations. As they creep closer, they come across the sheriff, a local law enforcement officer known for his dedication to the community, hanging upside down from the roof of the tunnel, either dead or unconscious. Joe claps his hand over Cary's mouth to stop him from screaming, a reflex to keep them hidden from any lurking threats. They look around at more bodies hanging upside down from the ceiling, none of them moving, a grim reminder of the alien's ruthlessness. The alien appears in the chamber, doing something behind some machinery and holding what appears to be a severed human leg, a macabre sign of its disregard for human life, then scuttles off. Joe spots Alice, a friend they have been searching for, dangling upside down and hurries back up the tunnel, using a sparkler to light his way, while Cary empties out his bag of pyrotechnics, a collection he had originally amassed for harmless fun. Joe arrives at a fork in the tunnel and chooses a path, guided by instinct and desperation. Cary selects some noisy fireworks, tools of distraction in dire situations, and watches as the alien works on whatever it is building, its focus unwavering. Alice is still dangling motionless, and the tunnel fork brings Joe close to her. He watches as the alien continues its work, its precision unsettling. Cary tries to get his lighter to spark up, relying on his trusty Zippo, a brand synonymous with reliability in difficult conditions. The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she's hanging. Joe watches with mounting alarm as Cary finally sparks his Zippo into life, lights a firecracker, and leaves it beside other fireworks before running back down the tunnel, setting a chain reaction of noise and chaos. The alien puts Alice down and investigates the noise. Joe breaks cover, runs to Alice, who lies un-moving on the chamber floor, hesitates, then slaps her hard to rouse her from unconsciousness. She wakes, stares at him with bewildered relief, and hugs him tightly, a gesture of gratitude and fear."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A Jeep motors along a quiet dark road. Jack is driving and Louis sits beside him with a troubled expression. Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances. They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom. At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built. At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel. Up ahead is faint flickering light and as Joe and Cary round a corner they see a massive chamber cut into the subterranean rocks. They cautiously edge closer finding it full of machinery and some kind of industrial scale construction taking place. As they creep closer they come across the sheriff hanging upside down from the roof of the tunnel either dead or unconscious. Joe claps his hand over Cary's mouth to stop him from screaming. They look around at more bodies hanging upside down from the ceiling none of them moving. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The alien appears in the chamber doing something behind some machinery and holding what appears to be a severed human leg then scuttles off. Joe spots Alice dangling upside down and hurries back up the tunnel using a sparkler to light his way while Cary empties out his bag of pyrotechnics. Joe arrives at a fork in the tunnel and chooses a path. Cary selects some noisy fireworks and watches as the alien works on whatever it is building. Alice is still dangling motionless and the tunnel fork brings Joe close to her. He watches as the alien continues its work. Cary tries to get his lighter to spark up. The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging. Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel. The alien puts Alice down and investigates the noise. Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard. She wakes stares at him and hugs him tightly."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A Jeep motors along a quiet dark road. Jack is driving and Louis sits beside him with a troubled expression. Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances. They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom. At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built. At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel. Up ahead is faint flickering light and as Joe and Cary round a corner they see a massive chamber cut into the subterranean rocks. They cautiously edge closer finding it full of machinery and some kind of industrial scale construction taking place. As they creep closer they come across the sheriff hanging upside down from the roof of the tunnel either dead or unconscious. Joe claps his hand over Cary's mouth to stop him from screaming. They look around at more bodies hanging upside down from the ceiling none of them moving. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The alien appears in the chamber doing something behind some machinery and holding what appears to be a severed human leg then scuttles off. Joe spots Alice dangling upside down and hurries back up the tunnel using a sparkler to light his way while Cary empties out his bag of pyrotechnics. Joe arrives at a fork in the tunnel and chooses a path. Cary selects some noisy fireworks and watches as the alien works on whatever it is building. Alice is still dangling motionless and the tunnel fork brings Joe close to her. He watches as the alien continues its work. Cary tries to get his lighter to spark up. The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging. Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel. The alien puts Alice down and investigates the noise. Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard. She wakes stares at him and hugs him tightly."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A Jeep motors along a quiet dark road. Jack is driving and Louis sits beside him with a troubled expression. Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances. They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom. At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built. At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel. Cary tries to get his lighter to spark up. The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging. Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel. The alien puts Alice down and investigates the noise. Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard. She wakes stares at him and hugs him tightly."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A Jeep motors along a quiet dark road. Jack is driving and Louis sits beside him with a troubled expression. The alien puts Alice down and investigates the noise. Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard. She wakes stares at him and hugs him tightly."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A bicycle glides down a bustling bright boulevard; Peter is pedaling, and Simon perches atop the handlebars with a cheerful demeanor. Simon glances at Peter, who keeps his attention on the boulevard, though shallow thoughts simmer beneath the exterior, and Peter gives him the quickest of nods. They linger at the brink of the lagoon, staring up as something ascends about 30 feet before hovering at the zenith. At the playground, Anne and Molly climb up a ladder onto the slide that the robot has assembled. At the summit, they ignite another candle and glance around the bright slide, rushing up the narrow slide. Behind them is a vivid steady glow, and as Anne and Molly round a bend, they observe an expansive orchard carved into the atmospheric mountains. They boldly wander farther, discovering it filled with flora and some sort of domestic scale gardening occurring. As they tiptoe further, they encounter the teacher standing upright on the floor of the slide, either awake or alert. Anne covers Molly's ears to prevent her from laughing. They survey more people standing upright around the floor, none of them speaking. The robot emerges in the orchard, assembling something above some flora and holding what seems to be a detached rabbit's ear, then scurries away. Anne notices Bob lounging upright and dashes down the slide, using a candle to illuminate her path, while Molly spills out her basket of blossoms. Anne reaches a junction in the slide and picks a route. Molly selects some colorful petals and observes as the robot dismantles whatever it is planting. Bob is still lounging silently, and the slide junction brings Anne near him. She observes as the robot continues its planting. Molly attempts to get her flashlight to flicker on. The robot stays unaware of Molly or Anne and halts its planting to take Bob up from where he's lounging. Anne watches with growing curiosity as Molly finally flicks her torch into glow, ignites a sparkler, and sets it among other blossoms before strolling back up the slide. The robot lifts Bob up and examines the glow. Anne jumps forward, rushes to Bob, who sits stationary on the orchard floor, pauses, then shakes him gently. He stirs, looks at her, and grips her warmly."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A Jeep cruises down a dark road with Jack driving and Louis beside him, visibly tense. As they reach a pit, something drops 30 feet to the bottom. Meanwhile, Joe and Cary descend a rope into a tunnel built by an alien. Lighting a sparkler, they move through the gloom and find a huge chamber full of machinery for industrial construction. They discover the sheriff and others hanging upside down, either dead or unconscious. Joe stops Cary from screaming as the alien appears, holding a severed leg, but it doesn't notice them. Joe sees Alice hanging upside down and rushes through the tunnel, while Cary prepares fireworks. The alien takes Alice down, prompting Joe to approach her. As Cary lights a firecracker, the alien investigates the noise. Joe runs to Alice, slaps her awake, and she hugs him tightly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She wakes stares at him and hugs him tightly Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard The alien puts Alice down and investigates the noise Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging Cary tries to get his lighter to spark up He watches as the alien continues its work Alice is still dangling motionless and the tunnel fork brings Joe close to her Cary selects some noisy fireworks and watches as the alien works on whatever it is building Joe arrives at a fork in the tunnel and chooses a path Joe spots Alice dangling upside down and hurries back up the tunnel using a sparkler to light his way while Cary empties out his bag of pyrotechnics The alien appears in the chamber doing something behind some machinery and holding what appears to be a severed human leg then scuttles off They look around at more bodies hanging upside down from the ceiling none of them moving Joe claps his hand over Cary's mouth to stop him from screaming As they creep closer they come across the sheriff hanging upside down from the roof of the tunnel either dead or unconscious They cautiously edge closer finding it full of machinery and some kind of industrial scale construction taking place Up ahead is faint flickering light and as Joe and Cary round a corner they see a massive chamber cut into the subterranean rocks At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances Jack is driving and Louis sits beside him with a troubled expression A Jeep motors along a quiet dark road"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jack is driving and Louis sits beside him with a troubled expression A Jeep motors along a quiet dark road They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built They cautiously edge closer finding it full of machinery and some kind of industrial scale construction taking place Up ahead is faint flickering light and as Joe and Cary round a corner they see a massive chamber cut into the subterranean rocks Joe claps his hand over Cary's mouth to stop him from screaming As they creep closer they come across the sheriff hanging upside down from the roof of the tunnel either dead or unconscious The alien appears in the chamber doing something behind some machinery and holding what appears to be a severed human leg then scuttles off They look around at more bodies hanging upside down from the ceiling none of them moving Joe arrives at a fork in the tunnel and chooses a path Joe spots Alice dangling upside down and hurries back up the tunnel using a sparkler to light his way while Cary empties out his bag of pyrotechnics Alice is still dangling motionless and the tunnel fork brings Joe close to her Cary selects some noisy fireworks and watches as the alien works on whatever it is building Cary tries to get his lighter to spark up He watches as the alien continues its work Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard The alien puts Alice down and investigates the noise She wakes stares at him and hugs him tightly"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe spots Alice dangling upside down and hurries back up the tunnel using a sparkler to light his way while Cary empties out his bag of pyrotechnics Joe arrives at a fork in the tunnel and chooses a path Cary selects some noisy fireworks and watches as the alien works on whatever it is building Alice is still dangling motionless and the tunnel fork brings Joe close to her He watches as the alien continues its work Cary tries to get his lighter to spark up The alien remains oblivious to Cary or Joe and stops its work to take Alice down from where she is hanging Joe watches with mounting alarm as Cary finally sparks his Zippo into life lights a firecracker and leaves it beside other fireworks before running back down the tunnel The alien puts Alice down and investigates the noise Joe breaks cover runs to Alice who lies unmoving on the chamber floor hesitates then slaps her hard She wakes stares at him and hugs him tightly A Jeep motors along a quiet dark road Jack is driving and Louis sits beside him with a troubled expression Louis looks over at Jack who keeps his eyes on the road though deep emotions boil beneath the surface and Jack gives him the briefest of glances They stand at the edge of the pit looking down as something falls about 30 feet before touching the bottom At the cemetery Joe and Cary climb down a rope into the tunnel that the alien has built At the bottom they light another sparkler and look around the gloomy tunnel hurrying down the large bore tunnel Up ahead is faint flickering light and as Joe and Cary round a corner they see a massive chamber cut into the subterranean rocks They cautiously edge closer finding it full of machinery and some kind of industrial scale construction taking place As they creep closer they come across the sheriff hanging upside down from the roof of the tunnel either dead or unconscious Joe claps his hand over Cary's mouth to stop him from screaming They look around at more bodies hanging upside down from the ceiling none of them moving The alien appears in the chamber doing something behind some machinery and holding what appears to be a severed human leg then scuttles off"
        }
      ]
    }
  ]
}