{
  "ground_truth": "Joe, Alice, and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the ever-growing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up, and Joe sees his dad and Louis get out of it. Jack looks up at the water tower, then spots Joe. Joe nudges Alice, who looks around and sees her dad with Jack. The dads walk towards them, and Joe and Alice go to meet them. Jack cups Joe's face in his hands, then hugs him tightly; their faces are tense with a mixture of emotion and relief. Eyes closed, they hold each other tight. Alice looks over at her father as he steps up to her. They regard each other for a moment, then hug. Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it. The creature steps into the now fully formed spaceship it's created on top of the water tower, and the door closes behind it. The spaceship powers up, and several arms on it rotate. Many bright lights on the arms shine out. Joe separates from his father and is just in time to grab his mother's locket, which is being drawn towards the tower. It hangs in the air, pulled by an invisible force. The locket clicks open, revealing the picture inside, which is of Joe's mother holding him as a baby. Joe lets go of the locket's chain, and it floats up towards the water tower. Joe and the others watch as the locket sticks to the side of the tower. Suddenly, the tower explodes in a shower of water, deluging the street below. The spaceship, which resembles the canopy of a palm tree, lifts into the air. The water tower collapses and crashes down into the street, scattering soldiers standing there and crushing their vehicles. Joe, Alice, Louis, and Jack watch as the spacecraft gains altitude in a blaze of bright lights. Hobbling through town, Charles and Martin sit sailing up into the night sky. Still stoned in his car, Donny slumbers on as the spaceship flies by, its lights reflected in his windshield. As they watch it recede into the distance, Joe and Alice hold hands. Smiles spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually, it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor. Martin arrives as the detective and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on. Preston, as the President, makes a call.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Joe, Alice, and Cary lift themselves up and observe as a constant flow of metallic fragments and components move upward towards the water tower and merge into the ever-expanding structure atop it. Alice grins as the enormous formation begins to assume configuration. A Jeep rolls up, and Joe notices his father and Louis exit it. Jack glances up at the water tower, then identifies Joe. Joe nudges Alice, who glances around and identifies her father with Jack. The fathers stroll towards them, and Joe and Alice move to encounter them. Jack cups Joe's head in his palms, then embraces him firmly; their countenances are strained with a blend of sentiment and consolation. Eyes shut, they clutch each other firmly. Alice gazes over at her father as he steps up to her. They observe each other for a moment, then embrace. Joe looks over Jack's shoulder at the water tower and notices the extraterrestrial scaling it. The being steps into the now completely formed spacecraft it’s constructed atop the water tower, and the portal closes behind it. The spaceship activates, and several appendages on it revolve. Numerous brilliant lights on the appendages illuminate outward. Joe detaches from his father and is just in time to seize his mother's pendant, which is being drawn towards the tower. It dangles in the air, pulled by an unseen force. The pendant clicks open, unveiling the image inside, which is of Joe's mother holding him as an infant. Joe releases the pendant's chain, and it ascends towards the water tower. Joe and the others observe as the pendant adheres to the side of the tower. Abruptly, the tower detonates in a cascade of water, flooding the avenue below. The spacecraft, which resembles the crown of a palm tree, ascends into the air. The water tower collapses and crashes down into the street, scattering troops stationed there and crushing their transports. Joe, Alice, Louis, and Jack observe as the spacecraft gains elevation in a blaze of brilliant lights. Limping through town, Charles and Martin sit soaring up into the nocturnal sky. Still intoxicated in his automobile, Donny slumbers on as the spacecraft flies past, its lights mirrored in his windshield. As they observe it diminish into the distance, Joe and Alice clasp hands. Smiles spread across their visages. The spacecraft becomes a speck of radiance high up in the sky. Gradually, it becomes a pinpoint and then vanishes altogether. A chalk outline of a body is sketched on the floor. Martin arrives as the detective and converses with a witness at Romero Chemicals. Martin rises and places his hat on. Preston, as the President, makes a call."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Joe, Alice, and Cary pick themselves up and watch as a steady stream of metallic bits and pieces is streamed up towards the water tower, melding into the ever-growing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up, and his dad and Louis are seen by Joe to get out of it. Jack looks up at the water tower, then spots Joe. Alice is nudged by Joe, who looks around and sees her dad with Jack. The dads walk towards them, and Joe and Alice go to meet them. Joe's face is cupped by Jack’s hands, then he hugs him tightly; their faces are tense with a mixture of emotion and relief. Eyes closed, they hold each other tight. Alice looks over at her father as he steps up to her. They regard each other for a moment, then they are hugged. Over Jack's shoulder, Joe looks at the water tower and sees the alien climbing up it. The creature steps into the fully formed spaceship it's created on top of the water tower, and it closes the door behind it. The spaceship powers up, and several arms on it rotate. Many bright lights on the arms are shone out. Joe separates from his father and is just in time to grab his mother's locket, which is being drawn towards the tower. It hangs in the air, pulled by an invisible force. The locket clicks open, revealing the picture inside, which shows Joe's mother holding him as a baby. The locket's chain is let go by Joe, and it floats up towards the water tower. Joe and the others watch as the locket is stuck to the side of the tower. Suddenly, in a shower of water, the tower explodes, deluging the street below. The spaceship, resembling the canopy of a palm tree, is lifted into the air. The water tower collapses and crashes down into the street, scattering soldiers who stand there and crushing their vehicles. Joe, Alice, Louis, and Jack watch as the spacecraft gains altitude in a blaze of bright lights. Hobbling through town, Charles and Martin sit sailing up into the night sky. Still stoned in his car, Donny is slumbering on as the spaceship flies by, its lights reflected in his windshield. As they watch it recede into the distance, Joe and Alice hold hands. Smiles are spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually, it becomes a pinpoint and then dies away altogether. Someone draws a chalk outline of a body on the floor. The detective arrives as Martin and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on. A call is made by Preston, as the President."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Joe, Alice, and Cary rise and watch metallic pieces stream toward the water tower, merging into a growing structure. Alice smiles as it takes shape. A Jeep arrives with Joe's dad, Jack, and Louis. Jack spots Joe, and they hug tightly, relieved. Alice hugs her father after a moment of shared understanding. Joe sees an alien climb into its newly formed spaceship on the tower, its doors closing. The spaceship activates, lights shining as rotating arms move. Joe grabs his mother's locket as it's pulled toward the tower. The locket opens, revealing a picture of Joe and his mother, then floats to the tower and sticks to its side. Suddenly, the tower explodes in water, deluging the street. The spaceship, palm tree-like, lifts off, collapsing the tower and scattering soldiers and vehicles. Joe, Alice, Louis, and Jack watch the craft ascend brightly. Charles and Martin watch it from town, while Donny sleeps in his car, its lights reflecting on his windshield. As the ship recedes, Joe and Alice hold hands, smiling. The spacecraft becomes a distant dot, then disappears. A chalk outline marks a body. Martin arrives at Romero Chemicals, speaking with a witness. Preston, as the President, makes a call."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Joe, Alice, and Cary rise and watch metallic fragments ascend to the water tower, forming a structure. Alice smiles as it takes shape. A Jeep arrives, and Joe's dad and Louis emerge. Jack spots Joe and they reunite emotionally. Alice hugs her father. Joe sees an alien enter the completed spaceship atop the tower. The ship activates with rotating arms and bright lights. Joe catches his mother's locket, which floats to the tower, revealing her picture inside. It sticks to the tower, which then explodes, flooding the street. The spaceship, palm tree-like, ascends, collapsing the tower and scattering soldiers and vehicles. Joe, Alice, Louis, and Jack watch it ascend in bright lights. Charles and Martin see it soaring and Donny, asleep, misses its reflection. Joe and Alice hold hands, smiling as the ship becomes a distant dot. A chalk body outline is seen. Martin, with the detective, talks to a witness at Romero Chemicals. Preston, as the President, makes a call."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Joe, Alice, and Cary slowly pick themselves up, dusting off the debris from the recent chaos. They pause for a moment, captivated as they observe a continuous, unbroken stream of metallic bits and pieces that steadily drift upwards towards the towering water tower. These pieces elegantly meld into the ever-growing, intricate structure taking shape on top of it. Alice cannot help but smile as the massive structure begins to take on its final form right before their eyes. Just then, a Jeep drives up, and Joe instantly recognizes his dad and Louis as they step out of the vehicle. With a look of surprise and relief, Jack gazes up at the water tower before his eyes land on Joe. Feeling a nudge from Joe, Alice turns to see her own dad approaching with Jack. The two fathers make their way towards the group, and Joe and Alice move to meet them halfway. Jack affectionately cups Joe's face in his hands, then pulls him into a tight, heartfelt embrace; both of their faces reflect a tense mixture of overwhelming emotion and profound relief. With their eyes closed, they cling to each other as if to make up for lost time. Meanwhile, Alice glances over at her father as he approaches her, and after a moment of silent understanding, they too share a warm hug. Over Jack's shoulder, Joe's eyes drift back to the water tower just in time to witness the alien creature scaling its height. The creature seamlessly enters the newly completed spaceship it has meticulously assembled atop the water tower, and the entrance door closes securely behind it. As the spaceship powers up, several mechanical arms extend from it, spinning gracefully, while a multitude of bright lights shimmer from the arms, casting a glow all around. Joe, sensing the moment, breaks away from his father just in time to catch his mother's cherished locket, which is being irresistibly drawn towards the tower by some invisible force. The locket hovers in the air, its chain dangling, as it clicks open to reveal the treasured picture inside—a snapshot of Joe's mother lovingly holding him as a baby. In a poignant gesture, Joe releases the chain, allowing the locket to float freely towards the towering structure. He and the others watch intently as the locket adheres to the side of the tower. Suddenly, with a dramatic explosion, the tower bursts into a shower of cascading water, drenching the street below. The spaceship, resembling the leafy canopy of a palm tree, gracefully ascends into the sky. The collapsing water tower crashes down with a thunderous roar, scattering the soldiers positioned below and crushing their vehicles. Joe, Alice, Louis, and Jack stand transfixed, watching as the spacecraft rises through the sky in a blaze of vibrant lights. Meanwhile, hobbling through the town, Charles and Martin find themselves awestruck as the object sails up into the starlit night. Obliviously stoned in his car, Donny remains in deep slumber as the spaceship speeds by, its brilliant lights casting reflections on his windshield. As the group watches it gradually vanish into the distance, Joe and Alice instinctively reach for each other's hands. A sense of peace and hope washes over them as smiles spread across their faces. The spacecraft shrinks into a tiny dot of light in the vast sky above, slowly diminishing to a pinpoint before disappearing entirely from view. In the aftermath, a faint chalk outline of a body is drawn on the cold, hard floor. Martin arrives to play the role of detective, engaging in conversation with a witness at Romero Chemicals. Rising to his feet, Martin dons his hat with a sense of purpose. Elsewhere, Preston, taking on the role of the President, makes an important phone call."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Joe, Alice, and Cary, with great care and deliberation, slowly begin to lift themselves up from the ground, each of them brushing off the dust and debris that clings to their clothes from the recent chaos. They take a moment to pause, their attention completely captivated as they watch an uninterrupted, continuous stream of metallic fragments and bits. These pieces drift steadily, ascending upwards towards the towering water tower in a mesmerizing dance. They weave together beautifully, melding seamlessly into the ever-growing, intricate structure that is steadily taking form on top of the towering edifice. Alice cannot help but feel a joyful smile spread across her face as she observes the massive structure beginning to take on its final shape right before their eyes. At that very moment, a Jeep makes its way towards them, and Joe immediately recognizes his father and Louis as they step gracefully out of the vehicle. With an expression that conveys a mix of surprise and relief, Jack gazes up at the water tower before his eyes finally settle on Joe. Feeling a gentle nudge from Joe, Alice turns to see her own father approaching alongside Jack. The two fathers walk steadily towards the group, and Joe and Alice instinctively move forward to meet them halfway. Jack tenderly cups Joe's face in his hands, pulling him into a tight, heartfelt embrace. Their faces display a tense yet profound blend of overwhelming emotion and profound relief. With their eyes gently closed, they hold each other as though trying to make up for all the time they had missed. Meanwhile, Alice glances over at her father as he nears her, and after a moment of silent, mutual understanding, they too share a warm, comforting hug. Meanwhile, over Jack's shoulder, Joe's eyes drift back towards the water tower just in time to witness the alien creature scaling its formidable height. The creature slips seamlessly into the newly completed spaceship that it has meticulously assembled atop the water tower, and the entrance door closes securely behind it, sealing it inside. As the spaceship powers up, several mechanical arms extend elegantly from it, spinning gracefully, while an array of bright, shimmering lights emanates from the arms, casting a radiant glow all around. Sensing the significance of the moment, Joe breaks away from his father just in time to catch sight of his mother's cherished locket, irresistibly drawn towards the tower by some unseen force. The locket hovers gently in the air, its chain dangling as it clicks open to reveal the treasured picture inside—a snapshot captured in time of Joe's mother lovingly holding him as an infant. In a poignant and heartfelt gesture, Joe releases the chain, allowing the locket to float freely towards the towering structure. He and the others watch intently as the locket gently adheres to the side of the tower. Suddenly, with a dramatic, thunderous explosion, the tower erupts into a spectacular shower of cascading water, drenching the street below in its deluge. The spaceship, resembling the leafy, graceful canopy of a palm tree, rises gracefully into the sky. The collapsing water tower crashes down with a resounding roar, scattering the soldiers positioned below and incapacitating their vehicles. Joe, Alice, Louis, and Jack remain transfixed, their eyes glued to the scene as the spacecraft ascends through the sky in a brilliant blaze of vibrant lights. Meanwhile, hobbling through the town, Charles and Martin find themselves utterly awestruck as the magnificent object sails upward into the starlit night sky. Obliviously stoned in his car, Donny remains in deep slumber as the spaceship speeds by, its brilliant lights casting dazzling reflections on his windshield. As the group continues to watch, eyes fixed on the diminishing spectacle, Joe and Alice instinctively reach for each other's hands. A profound sense of peace and hope washes over them, spreading warm smiles across their faces. The spacecraft gradually shrinks into a tiny dot of light in the vast expanse above, slowly diminishing to a minute pinpoint before disappearing entirely from view. In the aftermath of these remarkable events, a faint chalk outline of a body is carefully drawn on the cold, hard floor. Martin arrives, stepping into the role of detective, engaging thoughtfully in conversation with a witness at Romero Chemicals. Rising to his feet with determination, Martin dons his hat with a renewed sense of purpose. Elsewhere, Preston, assuming the role of the President, makes an important phone call."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Joe, Alice, and Cary slowly pick themselves up from the ground, brushing off any dirt or debris from their clothes, and then shift their gaze upward to witness a mesmerizing spectacle: a steady stream of metallic bits and pieces rises gracefully, almost defying gravity, towards the water tower's zenith, where they seamlessly meld into the ever-growing structure that crowns it. Enthralled by the sight, Alice's face breaks into a smile as the vast, intricate structure begins to take shape before their eyes. The quiet is momentarily disrupted as the unmistakable rumble of a Jeep approaching catches Joe's attention; he turns to see his dad and Louis stepping out of the vehicle. Jack, once out of the Jeep, casts a quick glance up at the water tower, his eyes widening in awe, before they lock onto Joe's, sparking a silent but profound recognition. Joe feels a surge of emotion and instinctively nudges Alice to share the moment, prompting her to swivel her head around just in time to spot her own dad standing beside Jack. With an almost tacit agreement, the two fathers stride purposefully towards their children, while Joe and Alice move forward eagerly to meet them midway. As soon as they are within reach, Jack cups Joe's face tenderly in his hands, momentarily searching his eyes, before pulling him into a tight, engulfing hug; both of their faces are visibly tense, displaying a multitude of emotions interwoven with palpable relief. With their eyes closed, they cling to each other with a fervent embrace, as if trying to assure themselves that everything is finally alright. Meanwhile, Alice diverts her gaze towards her father who has just arrived by her side; they share a brief, but deeply meaningful exchange of expressions before closing the distance between them with a warm, heartfelt hug. In the midst of this reunion, Joe, over Jack's shoulder, catches sight of the alien nimbly climbing up the water tower. The creature moves with a purpose and steps into the now fully formed spaceship that it has meticulously created on top of the tower, prompting the door to silently seal shut behind it. The spaceship, now a complete entity, hums with life as it powers up, its various arms initiating a synchronized rotation. These arms emit multiple bright lights that beam outwards in radiant displays. Sensing something amiss, Joe gently separates from his father, his attention drawn to his mother's cherished locket, which is being mysteriously pulled towards the tower. It hangs suspended in the air, compelled by an invisible force that refuses to relent. The locket clicks open of its own accord, revealing a poignant photo inside—it is of Joe's mother, holding him lovingly as an infant. With a sense of resignation yet understanding, Joe releases the locket's chain, watching it float effortlessly upward, eventually adhering to the side of the tower. Suddenly, without warning, the entire tower erupts in a colossal explosion, sending a deluge of water cascading down, engulfing the street below in torrents. From the chaos, the spaceship, an ingenious construction resembling the canopy of a palm tree, begins its ascent, gently lifting into the air. As it rises, the water tower succumbs to the explosive forces, collapsing into the street with a thunderous crash that scatters soldiers in its path and demolishes their vehicles. Amidst the unfolding spectacle, Joe, Alice, Louis, and Jack stand together, transfixed, as the spacecraft ascends higher, enveloped in its dazzling display of bright lights. Meanwhile, elsewhere in town, Charles and Martin, despite hobbling from their escapades, find themselves marveling at the sight, as the craft sails majestically into the night sky. Oblivious to the world above, Donny remains slumbering in his car, still stoned, with his consciousness distant and detached even as the spaceship's lights cast reflections upon his windshield. As the shimmering craft continues its journey, fading into the vastness, Joe and Alice turn to each other, their hands instinctively finding one another's, their fingers interlocking with a natural ease. The stress and tension dissipate, replaced by smiles that gradually spread across their faces, conveying a shared sense of wonder and relief. As they watch, the spacecraft diminishes to a mere dot of light high in the sky, becoming smaller still until it is nothing more than a pinpoint before disappearing entirely from view. Meanwhile, a different scene unfolds as a chalk outline of a body is meticulously drawn on the floor elsewhere, marking the setting of a different story. Martin, ever the dedicated detective, arrives on scene at Romero Chemicals, engaging in earnest conversation with a witness there. Subsequently, Martin rises, concluding his inquiries, and places his hat firmly atop his head in a gesture of readiness to uncover further truths. In another series of events, Preston, assuming the role of President, initiates a call, setting into motion actions that are as yet untold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Joe, Alice, and Cary lift themselves up and watch as metallic bits meld into an evolving structure atop the water tower, forming a vast shape. As Alice smiles at its emergence, a Jeep arrives with Joe's dad, Jack, and Louis. The two fathers, spotting their children, walk toward them. Joe and Alice meet them halfway; Jack embraces Joe tightly, both filled with relief, while Alice hugs her father after a moment's regard. Joe glances at the water tower, observing an alien enter the newly formed spaceship, which closes up and powers on, with rotating arms shining bright lights. As Joe steps back from his father, he grabs his mother's locket, drawn toward the tower by an invisible force. The locket opens to reveal a picture of Joe with his mother. Letting go, Joe watches it attach to the tower, which then explodes in water, flooding the street. The palm-tree-like spaceship lifts into the air as the collapsing water tower crushes vehicles below. Joe, Alice, Louis, and Jack watch it ascend, its bright lights illuminating the night. Meanwhile, Charles and Martin hobble through town, and Donny dozes in his car, oblivious as the spaceship reflects in his windshield. Hand in hand, Joe and Alice watch it become a distant dot, sharing smiles as it disappears. Elsewhere, a chalk outline indicates a crime scene where Martin arrives to converse with a witness at Romero Chemicals, while Preston, as the President, makes a call."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Joe, Alice, and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower, a structure commonly used to store water for municipal or agricultural use, and meld into the ever-growing structure on top of it. Alice smiles as the vast structure begins to take shape, resembling something futuristic and otherworldly. A Jeep, a popular rugged off-road vehicle, drives up, and Joe sees his dad and Louis get out of it. Jack looks up at the water tower, then spots Joe. Joe nudges Alice, who looks around and sees her dad with Jack, a man who has been a key figure in the town's community for years. The dads walk towards them, and Joe and Alice go to meet them. Jack cups Joe's face in his hands, then hugs him tightly; their faces are tense with a mixture of emotion and relief, suggesting the intensity of recent events. Eyes closed, they hold each other tight. Alice looks over at her father as he steps up to her. They regard each other for a moment, then hug, sharing a bond strengthened by the crisis. Joe looks over Jack's shoulder at the water tower and sees the alien, a being from another planet whose arrival has sparked much concern, climbing up it. The creature steps into the now fully formed spaceship it's created on top of the water tower, and the door closes behind it. The spaceship powers up, and several arms on it rotate, part of a sophisticated technology far beyond human capabilities. Many bright lights on the arms shine out. Joe separates from his father and is just in time to grab his mother's locket, which is being drawn towards the tower, a memento that holds precious memories of his late mother. It hangs in the air, pulled by an invisible force. The locket clicks open, revealing the picture inside, which is of Joe's mother holding him as a baby, a moment frozen in time. Joe lets go of the locket's chain, and it floats up towards the water tower. Joe and the others watch as the locket sticks to the side of the tower. Suddenly, the tower explodes in a shower of water, deluging the street below. The spaceship, which resembles the canopy of a palm tree, lifts into the air. The water tower collapses and crashes down into the street, scattering soldiers, part of a military contingent tasked with securing the area, standing there and crushing their vehicles. Joe, Alice, Louis, and Jack watch as the spacecraft gains altitude in a blaze of bright lights. Hobbling through town, Charles and Martin sit sailing up into the night sky. Still stoned in his car, Donny slumbers on as the spaceship flies by, its lights reflected in his windshield, unaware of the dramatic events unfolding. As they watch it recede into the distance, Joe and Alice hold hands. Smiles spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually, it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor, a grim reminder of a past incident. Martin arrives as the detective, a role he has played with dedication for years, and talks to a witness at Romero Chemicals, a local factory rumored to have ties to secretive activities. Martin gets up and puts his hat on, ready to get back to work. Preston, as the President, makes a call, addressing matters of national importance now that the extraterrestrial encounter has concluded."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up and Joe sees his dad and Louis get out of it. Jack looks up at the water tower then spots Joe. Joe nudges Alice who looks around and sees her dad with Jack. The dads walk towards them and Joe and Alice go to meet them. Jack cups Joe's face in his hands then hugs him tightly. their faces are tense with a mixture of emotion and relief. Eyes closed they hold each other tight. Alice looks over at her father as he steps up to her. They regard each other for a moment then hug. Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it. The creature steps into the now fully formed spaceship. it is created on top of the water tower and the door closes behind it. The spaceship powers up and several arms on it rotate. Many bright lights on the arms shine out. Joe separates from his father and is just in time to grab his mother's locket which is being drawn towards the tower. It hangs in the air pulled by an invisible force. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The locket clicks open revealing the picture inside which is of Joe's mother holding him as a baby. Joe let us go of the locket's chain and it floats up towards the water tower. Joe and the others watch as the locket sticks to the side of the tower. Suddenly the tower explodes in a shower of water deluging the street below. The spaceship which resembles the canopy of a palm tree lifts into the air. The water tower collapses and crashes down into the street scattering soldiers standing there and crushing their vehicles. Joe Alice Louis and Jack watch as the spacecraft gains altitude in a blaze of bright lights. Hobbling through town Charles and Martin sit sailing up into the night sky. Still stoned in his car. Donny slumbers on as the spaceship flies by its lights reflected in his windshield. As they watch it recede into the distance. Joe and Alice hold hands. Smiles spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor. Martin arrives as the detective and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on Preston as the President makes a call."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up and Joe sees his dad and Louis get out of it. Jack looks up at the water tower then spots Joe. Joe nudges Alice who looks around and sees her dad with Jack. The dads walk towards them and Joe and Alice go to meet them. Jack cups Joe's face in his hands then hugs him tightly. their faces are tense with a mixture of emotion and relief. Eyes closed they hold each other tight. Alice looks over at her father as he steps up to her. They regard each other for a moment then hug. Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it. The creature steps into the now fully formed spaceship. it is created on top of the water tower and the door closes behind it. The spaceship powers up and several arms on it rotate. Many bright lights on the arms shine out. Joe separates from his father and is just in time to grab his mother's locket which is being drawn towards the tower. It hangs in the air pulled by an invisible force. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The locket clicks open revealing the picture inside which is of Joe's mother holding him as a baby. Joe let us go of the locket's chain and it floats up towards the water tower. Joe and the others watch as the locket sticks to the side of the tower. Suddenly the tower explodes in a shower of water deluging the street below. The spaceship which resembles the canopy of a palm tree lifts into the air. The water tower collapses and crashes down into the street scattering soldiers standing there and crushing their vehicles. Joe Alice Louis and Jack watch as the spacecraft gains altitude in a blaze of bright lights. Hobbling through town Charles and Martin sit sailing up into the night sky. Still stoned in his car. Donny slumbers on as the spaceship flies by its lights reflected in his windshield. As they watch it recede into the distance. Joe and Alice hold hands. Smiles spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor. Martin arrives as the detective and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on Preston as the President makes a call."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up and Joe sees his dad and Louis get out of it. Jack looks up at the water tower then spots Joe. Joe nudges Alice who looks around and sees her dad with Jack. The dads walk towards them and Joe and Alice go to meet them. Jack cups Joe's face in his hands then hugs him tightly. their faces are tense with a mixture of emotion and relief. Eyes closed they hold each other tight. Donny slumbers on as the spaceship flies by its lights reflected in his windshield. As they watch it recede into the distance. Joe and Alice hold hands. Smiles spread across their faces. The spacecraft becomes a dot of light high up in the sky. Gradually it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor. Martin arrives as the detective and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on Preston as the President makes a call."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it. Alice smiles as the vast structure begins to take shape. A Jeep drives up and Joe sees his dad and Louis get out of it. Jack looks up at the water tower then spots Joe. Gradually it becomes a pinpoint and then dies away altogether. A chalk outline of a body is drawn on the floor. Martin arrives as the detective and talks to a witness at Romero Chemicals. Martin gets up and puts his hat on Preston as the President makes a call."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Greg, Flora, and Benny dust themselves off and observe as a swirling stream of paper fragments and debris drift down towards the lighthouse and merge into the steadily diminishing edifice beneath it. Flora grins as the modest edifice starts to dissolve. A bicycle rides over, and Greg notices his uncle and Sam hop off of it. Oliver glances down at the lighthouse, then spots Greg. Greg taps Flora, who glances upward and sees her uncle with Oliver. The uncles run away from them, and Greg and Flora rush to evade them. Oliver pats Greg's back with his elbows, then shakes him loosely; their hands are calm with a mixture of boredom and excitement. Eyes open, they release each other gently. Flora glances away from her uncle as he kneels next to her. They ignore each other for a second, then nod. Greg stares down Oliver's waist at the lighthouse and sees the fish crawling under it. The animal burrows out of the now completely destroyed boat it's demolished beneath the lighthouse, and the hatch opens in front of it. The boat shuts down, and several propellers on it stop. Many dim shadows on the propellers flicker in. Greg detaches from his uncle and is just in time to lose his brother's keychain, which is being pushed away from the lighthouse. It lies on the ground, pushed by an invisible breeze. The keychain snaps closed, concealing the image inside, which is of Greg's brother pushing him as a toddler. Greg catches the keychain's loop, and it sinks down towards the lighthouse. Greg and the rest gaze as the keychain adheres to the base of the lighthouse. Abruptly, the lighthouse implodes in a mist of dust, trailing the skies above. The boat, which mimics the trunk of a sequoia, descends into the earth. The lighthouse stands and rises up from the earth, gathering mice hiding there and lifting their bicycles. Greg, Flora, Sam, and Oliver gaze as the rowboat loses altitude in a sphere of dim shadows. Sliding into the jungle, Andy and Henry lean biking down from the morning ground. Still awake on his sofa, Larry snores on as the boat crawls past, its shadows hidden by his glasses. As they listen to it approach from the past, Greg and Flora push palms. Tears smear across their faces. The rowboat transforms into a splash of shadow deep beneath the earth. Eventually, it transforms into a smudge and then grows closer entirely. A hopscotch diagram of a star is etched on the ceiling. Henry departs as the doctor and sings to a firefighter at Leon Motors. Henry kneels and removes his coat. Susan, as the Pope, receives a letter."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joe, Alice, and Cary watch as metallic bits form a structure atop a water tower. A Jeep brings Joe's dad, Jack, who reunites emotionally with Joe and Alice with her father. They see an alien climb into the now complete spaceship atop the tower. Joe retrieves his mother's locket as it floats toward the structure, revealing a photo of his mother. The tower explodes, and the spaceship ascends, scattering soldiers below. Joe, Alice, and others watch as the spacecraft, resembling a palm tree canopy, vanishes into the sky. Joe and Alice hold hands, smiling as it disappears. Meanwhile, Martin interacts with a detective at Romero Chemicals, and Preston makes a call as the President."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Martin gets up and puts his hat on Preston as the President makes a call Martin arrives as the detective and talks to a witness at Romero Chemicals A chalk outline of a body is drawn on the floor Gradually it becomes a pinpoint and then dies away altogether The spacecraft becomes a dot of light high up in the sky Smiles spread across their faces Joe and Alice hold hands As they watch it recede into the distance Donny slumbers on as the spaceship flies by its lights reflected in his windshield Still stoned in his car Hobbling through town Charles and Martin sit sailing up into the night sky Joe Alice Louis and Jack watch as the spacecraft gains altitude in a blaze of bright lights The water tower collapses and crashes down into the street scattering soldiers standing there and crushing their vehicles The spaceship which resembles the canopy of a palm tree lifts into the air Suddenly the tower explodes in a shower of water deluging the street below Joe and the others watch as the locket sticks to the side of the tower Joe let us go of the locket's chain and it floats up towards the water tower The locket clicks open revealing the picture inside which is of Joe's mother holding him as a baby It hangs in the air pulled by an invisible force Joe separates from his father and is just in time to grab his mother's locket which is being drawn towards the tower Many bright lights on the arms shine out The spaceship powers up and several arms on it rotate it is created on top of the water tower and the door closes behind it The creature steps into the now fully formed spaceship Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it They regard each other for a moment then hug Alice looks over at her father as he steps up to her Eyes closed they hold each other tight their faces are tense with a mixture of emotion and relief Jack cups Joe's face in his hands then hugs him tightly The dads walk towards them and Joe and Alice go to meet them Joe nudges Alice who looks around and sees her dad with Jack Jack looks up at the water tower then spots Joe A Jeep drives up and Joe sees his dad and Louis get out of it Alice smiles as the vast structure begins to take shape Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Alice smiles as the vast structure begins to take shape Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it Jack looks up at the water tower then spots Joe A Jeep drives up and Joe sees his dad and Louis get out of it The dads walk towards them and Joe and Alice go to meet them Joe nudges Alice who looks around and sees her dad with Jack their faces are tense with a mixture of emotion and relief Jack cups Joe's face in his hands then hugs him tightly Alice looks over at her father as he steps up to her Eyes closed they hold each other tight Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it They regard each other for a moment then hug it is created on top of the water tower and the door closes behind it The creature steps into the now fully formed spaceship Many bright lights on the arms shine out The spaceship powers up and several arms on it rotate It hangs in the air pulled by an invisible force Joe separates from his father and is just in time to grab his mother's locket which is being drawn towards the tower Joe let us go of the locket's chain and it floats up towards the water tower The locket clicks open revealing the picture inside which is of Joe's mother holding him as a baby Suddenly the tower explodes in a shower of water deluging the street below Joe and the others watch as the locket sticks to the side of the tower The water tower collapses and crashes down into the street scattering soldiers standing there and crushing their vehicles The spaceship which resembles the canopy of a palm tree lifts into the air Hobbling through town Charles and Martin sit sailing up into the night sky Joe Alice Louis and Jack watch as the spacecraft gains altitude in a blaze of bright lights Donny slumbers on as the spaceship flies by its lights reflected in his windshield Still stoned in his car Joe and Alice hold hands As they watch it recede into the distance The spacecraft becomes a dot of light high up in the sky Smiles spread across their faces A chalk outline of a body is drawn on the floor Gradually it becomes a pinpoint and then dies away altogether Martin gets up and puts his hat on Preston as the President makes a call Martin arrives as the detective and talks to a witness at Romero Chemicals"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The locket clicks open revealing the picture inside which is of Joe's mother holding him as a baby Joe let us go of the locket's chain and it floats up towards the water tower Joe and the others watch as the locket sticks to the side of the tower Suddenly the tower explodes in a shower of water deluging the street below The spaceship which resembles the canopy of a palm tree lifts into the air The water tower collapses and crashes down into the street scattering soldiers standing there and crushing their vehicles Joe Alice Louis and Jack watch as the spacecraft gains altitude in a blaze of bright lights Hobbling through town Charles and Martin sit sailing up into the night sky Still stoned in his car Donny slumbers on as the spaceship flies by its lights reflected in his windshield As they watch it recede into the distance Joe and Alice hold hands Smiles spread across their faces The spacecraft becomes a dot of light high up in the sky Gradually it becomes a pinpoint and then dies away altogether A chalk outline of a body is drawn on the floor Martin arrives as the detective and talks to a witness at Romero Chemicals Martin gets up and puts his hat on Preston as the President makes a call Joe Alice and Cary pick themselves up and watch as a steady stream of metallic bits and pieces stream up towards the water tower and meld into the evergrowing structure on top of it Alice smiles as the vast structure begins to take shape A Jeep drives up and Joe sees his dad and Louis get out of it Jack looks up at the water tower then spots Joe Joe nudges Alice who looks around and sees her dad with Jack The dads walk towards them and Joe and Alice go to meet them Jack cups Joe's face in his hands then hugs him tightly their faces are tense with a mixture of emotion and relief Eyes closed they hold each other tight Alice looks over at her father as he steps up to her They regard each other for a moment then hug Joe looks over Jack's shoulder at the water tower and sees the alien climbing up it The creature steps into the now fully formed spaceship it is created on top of the water tower and the door closes behind it The spaceship powers up and several arms on it rotate Many bright lights on the arms shine out Joe separates from his father and is just in time to grab his mother's locket which is being drawn towards the tower It hangs in the air pulled by an invisible force"
        }
      ]
    }
  ]
}