{
  "ground_truth": "At 12:02 PM, Joe sits in his bedroom painting a model monster. Joe and his friends have gathered on a grassy bank, and the yellow Coupe that had pulled up outside the house for the wake draws up, driven by a teenage blonde girl, Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond, while Joe gives Jack a cool, unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball. Jack notices Joe holding a locket in his left hand. Alice turns away moodily and shakes her head, glaring at him and considering. Joe grins and offers Alice a candy, delighted when she takes it. She glances at him in the rearview mirror, causing his smile to slip. The car pulls up outside an isolated railway station, and the kids get out. Joe does Alice's makeup, gently sponging it on. She ties her hair back from her face, and Joe continues applying the makeup. He stops and stares at her, uncertain of how to respond when she dabs makeup onto her eyelids. Cary's fireworks go off, and Alice's eyes fill with un-shed tears, spellbinding Joe with her performance. Playing the detective, Martin stares at Alice, who slips out of character, causing Martin to wipe a tear. Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble. The camera is loaded and, as the train approaches, they prepare to film. Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train. The vehicles collide, knocking the camera over as the freight train barrels through the station and derails. Alice stares at it as the tracks careen through the station building, smashing it to matchwood. Electrical explosions go off around the station, sending trucks hurtling through the air. The kids flee through the debris as explosions mushroom around them, with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris, a piece of which is flung into the air, but he sees a warning sign on it before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a carriage lying on its side, which is then racked by a series of explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At 12:02 PM, Joe perches in his chamber painting a replica monster. Joe and his companions have assembled on a verdant bank, and the yellow Coupe that had drawn up outside the dwelling for the wake draws up, piloted by a teenage blonde girl, Alice. Jack appears slightly confused by Joe's response and contemplates how to reply, while Joe gives Jack a cool, doubtful look before returning his focus to the brochure showcasing images of boys having a wonderful time playing baseball. Jack observes Joe clutching a locket in his left hand. Alice turns away moodily and shakes her head, glaring at him and pondering. Joe grins and offers Alice a sweet, delighted when she takes it. She glances at him in the rearview mirror, causing his smile to fade. The automobile arrives outside an isolated railway station, and the kids exit. Joe does Alice's cosmetics, gently sponging it on. She ties her hair back from her face, and Joe continues applying the cosmetics. He halts and gazes at her, uncertain of how to respond when she dabs cosmetics onto her eyelids. Cary's fireworks explode, and Alice's eyes fill with un-shed tears, mesmerizing Joe with her performance. Playing the investigator, Martin gazes at Alice, who slips out of persona, causing Martin to wipe a tear. Charles dashes across the station platform and looks at an approaching train while the boys break into a panic and scramble. The camera is loaded and, as the train approaches, they prepare to film. Joe and Preston beam until Joe sees a pickup pull onto the rails ahead of the train. The vehicles collide, knocking the camera over as the freight train barrels through the station and derails. Alice stares at it as the tracks careen through the station building, smashing it to matchwood. Electrical detonations go off around the station, sending trucks hurtling through the air. The kids flee through the wreckage as explosions mushroom around them, with more trucks and carriages colliding. A tanker is hurled through the air and detonates upon striking the ground. Joe sprints past the flaming wreckage, a piece of which is flung into the air, but he sees a warning sign on it before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a carriage lying on its side, which is then racked by a series of detonations. Joe clasps the locket tightly in his left hand as he watches a detonation toss a fragment of the carriage high into the air."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At 12:02 PM, a model monster is being painted by Joe in his bedroom. A grassy bank has been gathered on by Joe and his friends, and a teenage blonde girl, Alice, drives the yellow Coupe that pulls up outside the house for the wake. Joe's reply slightly disorients Jack, and Jack considers how to respond while a cool, unconvinced look is given by Joe before his attention is returned to the pamphlet featuring pictures of boys having a fantastic time playing baseball. Joe is noticed by Jack holding a locket in his left hand. Alice turns away moodily and shakes her head, glaring at him and considering. A candy is offered to Alice by Joe, who is delighted when it is taken by her. She glances at him in the rearview mirror, causing his smile to slip. An isolated railway station is pulled up outside by the car, and the kids get out. Alice's makeup is done by Joe, who gently sponges it on. Her hair is tied back from her face by her, and Joe continues applying the makeup. He stops and stares at her, uncertain of how to respond when makeup is dabbed onto her eyelids by her. Cary sets off fireworks, and Alice's eyes fill with un-shed tears, spellbinding Joe with her performance. Playing the detective, Alice is stared at by Martin, who slips out of character, causing Martin to wipe a tear. The station platform is run across by Charles, who looks at an approaching train while a panic is broken into by the boys, who scramble. The camera is loaded by them, and, as the train approaches, filming is prepared. Joe and Preston smile until a pickup is seen by Joe pulling onto the tracks ahead of the train. The vehicles collide, knocking the camera over as the freight train barrels through the station and is derailed. It is stared at by Alice as the tracks careen through the station building, smashing it to matchwood. Electrical explosions go off around the station, sending trucks hurtling through the air. The debris is fled through by the kids as explosions mushroom around them, with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris, a piece of which is flung into the air, but a warning sign is seen on it by him before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a carriage lying on its side, which is then racked by a series of explosions. The locket is clasped tightly by Joe in his left hand as an explosion is watched by him that tosses a chunk of the carriage high into the air."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At 12:02 PM, Joe paints a model monster in his bedroom. Joe and his friends gather on a grassy bank as a yellow Coupe, driven by teenage blonde Alice, arrives for the wake. Jack, disoriented by Joe's reply, ponders his response while Joe returns to a pamphlet of boys playing baseball. Jack notices Joe holding a locket. Alice moodily turns away, shakes her head, and glares. Joe grins, offering her candy, pleased when she accepts. She glances at him in the rearview mirror, causing his smile to fade. The car stops at an isolated railway station, and the kids exit. Joe applies Alice's makeup, pausing as she dabs her eyelids. Cary's fireworks ignite, and Alice's tear-filled eyes captivate Joe. Martin, playing detective, watches Alice, who breaks character, making Martin wipe a tear. Charles runs across the platform, spotting an approaching train, causing panic. As the train nears, they prepare to film. Joe and Preston smile until a pickup pulls onto the tracks, colliding with the train, derailing it. Alice watches as the train smashes the station. Explosions send trucks flying, and the kids flee through debris. A tanker explodes, and Joe runs past flaming wreckage, seeing a warning sign before a massive explosion throws him down. He rises, sees a carriage explode, and clasps the locket as debris flies."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At 12:02 PM, Joe paints a model monster in his bedroom. Joe and friends gather on a grassy bank as Alice, a teenage blonde, drives a yellow Coupe for the wake. Jack looks disoriented by Joe's reply, while Joe returns to a pamphlet of boys playing baseball, holding a locket. Alice moodily turns away, but Joe offers her candy, which she accepts, causing his smile to slip. The car stops at an isolated railway station, and the kids exit. Joe applies Alice's makeup, and she ties her hair back. Cary's fireworks go off, and Alice's tearful performance captivates Joe. Martin, playing detective, stares at Alice, who breaks character, making Martin wipe a tear. Charles runs to the platform as a train approaches, causing panic. They prepare to film, but a pickup pulls onto the tracks, colliding with the train, derailing it. Alice watches as the station is destroyed, and electrical explosions send trucks flying. The kids flee as explosions and debris surround them. Joe runs past flaming debris, sees a warning sign, and a massive explosion throws him down. He rises, sees a carriage explode, and clasps the locket as debris flies."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "At precisely 12:02 PM, Joe finds himself seated comfortably in his bedroom, deeply engrossed in the meticulous task of painting a model monster. Meanwhile, Joe and his group of friends have gathered together on a lush, grassy bank. The yellow Coupe, which had previously pulled up outside the house for the wake, now draws up once more, driven by a teenage blonde girl named Alice. Jack appears slightly disoriented by Joe's response and takes a moment to ponder how best to reply, while Joe, with a cool and unconvinced expression, directs a look at Jack before shifting his focus back to a pamphlet. This pamphlet is filled with vibrant pictures of boys having an absolutely fantastic time playing baseball. Jack's attention is caught by the sight of Joe holding a locket in his left hand. Alice, in a moody manner, turns away and shakes her head, glaring at him while deep in thought. Joe, with a grin, offers Alice a piece of candy, feeling delighted when she accepts it. She then glances at him through the rearview mirror, causing his smile to falter slightly. The car eventually pulls up outside an isolated railway station, and the kids proceed to get out. Joe takes on the task of doing Alice's makeup, gently sponging it onto her face. She ties her hair back from her face, allowing Joe to continue applying the makeup with care. He pauses and stares at her, feeling uncertain about how to respond when she dabs makeup onto her eyelids. Suddenly, Cary's fireworks go off, and Alice's eyes fill with un-shed tears, captivating Joe with her spellbinding performance. Playing the role of a detective, Martin stares intently at Alice, who momentarily slips out of character, causing Martin to wipe away a tear. Charles dashes across the station platform, casting a look at an approaching train, while the boys break into a panic and scramble. The camera is loaded, and as the train draws nearer, they prepare to film. Joe and Preston exchange smiles until Joe notices a pickup truck pulling onto the tracks ahead of the train. The vehicles collide with a tremendous impact, knocking the camera over as the freight train barrels through the station and derails. Alice stares in shock as the tracks careen through the station building, reducing it to matchwood. Electrical explosions erupt around the station, sending trucks hurtling through the air. The kids flee through the chaotic debris as explosions mushroom around them, with more trucks and carriages colliding violently. A tanker is thrown through the air and explodes upon hitting the ground with a deafening roar. Joe runs past the flaming debris, a piece of which is flung into the air, but he manages to catch sight of a warning sign on it before a massive explosion erupts, throwing him forcefully to the ground. He looks up, gets to his feet, and gazes at a carriage lying on its side, which is then racked by a series of powerful explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a large chunk of the carriage high into the air."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "At exactly 12:02 PM, Joe finds himself sitting comfortably in the familiar confines of his bedroom. He is deeply engrossed in the intricate and painstaking task of painting a detailed model monster. Meanwhile, Joe, along with his group of close friends, has gathered together on a lush, green, grassy bank nearby. The yellow Coupe, which had previously pulled up outside their house for the wake, has now drawn up once more. This time, it is being driven by a teenage blonde girl named Alice. Jack appears to be slightly disoriented by Joe's response and takes a moment to contemplate how best to reply, while Joe, with a cool, unconvinced expression, directs a look at Jack. He then shifts his focus back to a pamphlet that is filled with vibrant and lively pictures of boys having an absolutely fantastic time playing baseball. Jack's attention is caught by the sight of Joe holding a small locket in his left hand. In a moody manner, Alice turns away, shaking her head as she glares at him, deep in thought. Joe, with a broad grin, offers Alice a piece of candy, feeling genuinely delighted when she accepts it graciously. She then glances at him through the rearview mirror, causing his confident smile to falter slightly. The car eventually pulls up outside an isolated railway station, and the kids proceed to get out of it. Joe takes on the responsible task of doing Alice's makeup, gently and carefully sponging it onto her face. She ties her hair back from her face, allowing Joe to continue applying her makeup with great care and attention. He pauses, staring at her, feeling uncertain about how to respond when she carefully dabs makeup onto her eyelids. Suddenly, Cary's fireworks go off, and Alice's eyes fill with un-shed tears, captivating Joe with her spellbinding performance. Playing the role of a detective, Martin stares intently at Alice, who momentarily slips out of character, causing Martin to wipe away a tear from his eye. Charles dashes across the station platform, casting a look at an approaching train, while the boys break into a panic, scrambling in different directions. The camera is loaded, and as the train draws nearer, they prepare to film the unfolding events. Joe and Preston exchange knowing smiles until Joe notices a pickup truck pulling onto the tracks directly ahead of the oncoming train. The vehicles collide with a tremendous and thunderous impact, knocking the camera over as the powerful freight train barrels through the station and derails. Alice stares in utter shock as the tracks careen through the station building, reducing it to mere matchwood. Electrical explosions erupt all around the station, sending trucks hurtling through the air in all directions. The kids flee through the chaotic debris as explosions mushroom around them, with additional trucks and carriages colliding violently. A tanker is thrown high through the air and explodes upon hitting the ground with a deafening roar. Joe runs past the flaming debris, a piece of which is flung into the air, but he manages to catch sight of a warning sign on it before a massive explosion erupts, throwing him forcefully to the ground. He looks up, gets to his feet, and gazes at a carriage lying on its side, which is then racked by a series of powerful explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a large chunk of the carriage high into the air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At precisely 12:02 PM, Joe is seated in his bedroom, fully immersed in the meticulous task of painting a model monster, his focus unwavering as he carefully applies each stroke of paint. Meanwhile, Joe and his friends have congregated on a grassy bank, their attention momentarily diverted as a yellow Coupe, which had previously pulled up outside the house for the wake, arrives, driven by a teenage blonde girl named Alice. Jack, standing nearby, appears slightly disoriented by Joe's response, his mind racing as he contemplates how best to reply, while Joe, maintaining a cool and unconvinced demeanor, shifts his focus back to a pamphlet that captures his interest with its images of boys enjoying a fantastic time playing baseball. As Jack observes, he notices Joe clutching a locket in his left hand, a detail that adds to the complexity of the moment. Alice, feeling moody, turns away and shakes her head, her eyes narrowing into a glare as she contemplates the situation. In an attempt to lighten the mood, Joe grins and extends a candy to Alice, his delight evident when she accepts it. Her glance in the rearview mirror catches his eye, causing his smile to falter slightly. The car eventually comes to a stop outside an isolated railway station, prompting the kids to exit the vehicle. Joe takes on the task of doing Alice's makeup, gently sponging it onto her face with careful precision. As she ties her hair back, Joe continues the application, his concentration momentarily broken as he pauses to stare at her, unsure of how to react when she applies makeup to her eyelids. Suddenly, Cary's fireworks ignite, and Alice's eyes brim with un-shed tears, captivating Joe with the intensity of her performance. Playing the role of a detective, Martin fixes his gaze on Alice, but she slips out of character, prompting Martin to discreetly wipe away a tear. Meanwhile, Charles dashes across the station platform, his eyes fixed on an approaching train, while the boys, gripped by panic, scramble in response. The camera is loaded, and as the train draws nearer, they ready themselves to capture the moment on film. Joe and Preston exchange smiles, but Joe's expression shifts to one of alarm as he spots a pickup truck pulling onto the tracks ahead of the train. The ensuing collision sends the camera tumbling as the freight train barrels through the station, ultimately derailing with catastrophic force. Alice stands transfixed, watching as the tracks tear through the station building, reducing it to matchwood. Electrical explosions erupt around the station, propelling trucks into the air with violent force. Amidst the chaos, the kids flee through the debris, dodging explosions that mushroom around them, while more trucks and carriages collide in a cacophony of destruction. A tanker is launched into the air, exploding upon impact with the ground. Joe races past the flaming wreckage, narrowly avoiding a piece of debris that is hurled skyward, his attention momentarily captured by a warning sign on it before a massive explosion erupts, sending him sprawling to the ground. Dazed, he looks up, regains his footing, and surveys the scene, his eyes drawn to a carriage lying on its side, which is then rocked by a series of explosions. Clutching the locket tightly in his left hand, Joe watches as an explosion propels a chunk of the carriage high into the air, the chaos unfolding around him in a relentless display of destruction."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At 12:02 PM, Joe is in his bedroom painting a model monster. Later, he and his friends gather on a grassy bank as a yellow Coupe, driven by a teenage blonde girl named Alice, arrives for the wake. Joe exchanges a cool, unconvinced look with Jack, who is momentarily disoriented by Joe's response, before Joe returns his focus to a pamphlet about boys playing baseball. Jack notices Joe holding a locket. Alice, feeling moody, turns away and shakes her head, but Joe grins and offers her a candy, which she accepts, causing his smile to falter when she glances at him in the rearview mirror. The group arrives at an isolated railway station, where Joe applies makeup to Alice, who ties her hair back. As Joe continues, he is captivated by her performance when Cary's fireworks go off, filling Alice's eyes with un-shed tears. Martin, playing detective, watches Alice, who briefly breaks character, prompting him to wipe a tear. Meanwhile, Charles runs across the platform, noticing an approaching train, which sends the boys into a panic as they scramble to prepare the camera for filming. Joe and Preston smile until a pickup truck pulls onto the tracks, colliding with the train and causing the camera to topple as the freight train derails. Alice watches in shock as the train smashes through the station, triggering electrical explosions and sending trucks flying. The kids flee through the chaos, dodging debris and explosions, as a tanker is launched into the air and explodes. Joe runs past the flaming wreckage, noticing a warning sign on a piece of debris before a massive explosion throws him to the ground. He gets up and sees a carriage on its side, which is then rocked by further explosions. Clutching the locket tightly, Joe watches as a chunk of the carriage is hurled into the air by another explosion."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At 12:02 PM, Joe sits in his bedroom painting a model monster, which is part of a collectible series famous among hobbyists for its intricate detail. Joe and his friends have gathered on a grassy bank near the old bridge, a local landmark often used by teens as a hangout spot, and the yellow Coupe that had pulled up outside the house for the wake draws up, driven by a teenage blonde girl, Alice, known for her striking resemblance to a classic film star. Jack looks slightly disoriented by Joe's reply and considers how to respond, while Joe gives Jack a cool, unconvinced look before returning his attention to the pamphlet, which features pictures of boys having a fantastic time playing baseball in the idyllic summer fields of the Midwest. Jack notices Joe holding a locket in his left hand, a silver heirloom passed down from his grandmother. Alice turns away moodily and shakes her head, glaring at him and considering, perhaps remembering the argument they had earlier in the week. Joe grins and offers Alice a candy, delighted when she takes it, a sign of their reconciled friendship. She glances at him in the rearview mirror, causing his smile to slip as he wonders about her sudden change in mood. The car pulls up outside an isolated railway station, a relic from the early 20th century no longer in regular use, and the kids get out. Joe does Alice's makeup, gently sponging it on in preparation for their amateur film project, a mystery thriller inspired by the great noir films of the 1940s. She ties her hair back from her face, revealing the subtle freckles she often hides, and Joe continues applying the makeup. He stops and stares at her, uncertain of how to respond when she dabs makeup onto her eyelids, a technique she learned from a popular online tutorial. Cary's fireworks go off, their colorful explosions echoing through the valley, and Alice's eyes fill with un-shed tears, spellbinding Joe with her performance which far exceeds their expectations for the scene. Playing the detective, Martin stares at Alice, who slips out of character, causing Martin to wipe a tear as he appreciates the raw emotion of the moment. Charles runs across the station platform and looks at an approaching train, one of the few freight services that still uses these tracks, while the boys break into a panic and scramble. The camera is loaded and, as the train approaches, they prepare to film, capturing the action for their movie. Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train, a reckless driver ignoring the warning signals. The vehicles collide, knocking the camera over as the freight train barrels through the station and derails, creating a scene more dramatic than they could have imagined. Alice stares at it as the tracks careen through the station building, smashing it to matchwood, the old structure unable to withstand the force. Electrical explosions go off around the station, sending trucks hurtling through the air like toys. The kids flee through the debris as explosions mushroom around them, with more trucks and carriages colliding in a cacophony of destruction. A tanker is thrown through the air and explodes upon hitting the ground, its contents igniting in a fireball. Joe runs past the flaming debris, a piece of which is flung into the air, but he sees a warning sign on it, indicating hazardous materials, before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a carriage lying on its side, which is then racked by a series of explosions, a reminder of the danger they've narrowly escaped. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air, its sentimental value grounding him amidst the chaos."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "At 1202 PM Joe sits in his bedroom painting a model monster  Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice  Jack looks slightly disoriented by Joe's reply and considers how to respond  She ties her hair back from her face and Joe continues applying the makeup  He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids  Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance  Playing  the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear  Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble  The camera is loaded and as the train approaches they prepare to film  Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train  The vehicles collide knocking the camera over as the freight train barrels through the station and derails  Alice stares at it as the tracks careen through the station building smashing it to matchwood  Electrical explosions go off around the station sending trucks hurtling through the air  The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding  A tanker is thrown through the air and explodes upon hitting the ground  while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball  Jack notices Joe holding a locket in his left hand  Alice turns away moodily and shakes her head glaring at him and considering  Joe grins and offers Alice a candy delighted when she takes it  She glances at him in the rearview mirror causing his smile to slip  The car pulls up outside an isolated railway station and the kids get out  Joe does Alice's makeup gently sponging it on  She ties her hair back from her face and Joe continues applying the makeup  He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids  Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance  Playing  the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear  Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble  The camera is loaded and as the train approaches they prepare to film  Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train  The vehicles collide knocking the camera over as the freight train barrels through the station and derails  Alice stares at it as the tracks careen through the station building smashing it to matchwood  Electrical explosions go off around the station sending trucks hurtling through the air  The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding  A tanker is thrown through the air and explodes upon hitting the ground  Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground  He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions  Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At 1202 PM Joe sits in his bedroom painting a model monster. Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond. while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball. Jack notices Joe holding a locket in his left hand. Alice turns away moodily and shakes her head glaring at him and considering. Joe grins and offers Alice a candy delighted when she takes it. She glances at him in the rearview mirror causing his smile to slip. The car pulls up outside an isolated railway station and the kids get out. Joe does Alice's makeup gently sponging it on. She ties her hair back from her face and Joe continues applying the makeup. He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids. Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Playing. the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear. Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble. The camera is loaded and as the train approaches they prepare to film. Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train. The vehicles collide knocking the camera over as the freight train barrels through the station and derails. Alice stares at it as the tracks careen through the station building smashing it to matchwood. Electrical explosions go off around the station sending trucks hurtling through the air. The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground. He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At 1202 PM Joe sits in his bedroom painting a model monster. Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond. while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball. Jack notices Joe holding a locket in his left hand. Alice turns away moodily and shakes her head glaring at him and considering. Joe grins and offers Alice a candy delighted when she takes it. She glances at him in the rearview mirror causing his smile to slip. The car pulls up outside an isolated railway station and the kids get out. Joe does Alice's makeup gently sponging it on. She ties her hair back from her face and Joe continues applying the makeup. He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids. Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Playing. the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear. Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble. The camera is loaded and as the train approaches they prepare to film. Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train. The vehicles collide knocking the camera over as the freight train barrels through the station and derails. Alice stares at it as the tracks careen through the station building smashing it to matchwood. Electrical explosions go off around the station sending trucks hurtling through the air. The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground. He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At 1202 PM Joe sits in his bedroom painting a model monster. Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond. while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball. Jack notices Joe holding a locket in his left hand. Alice turns away moodily and shakes her head glaring at him and considering. Joe grins and offers Alice a candy delighted when she takes it. Electrical explosions go off around the station sending trucks hurtling through the air. The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground. He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At 1202 PM Joe sits in his bedroom painting a model monster. Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond. Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground. He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions. Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At 12:02 PM, a giraffe sits in his bedroom painting a model monster. A giraffe and his friends have gathered on a grassy bank, and the yellow Coupe that had pulled up outside the house for the wake draws up, driven by a teenage blonde girl, a penguin. A shark looks slightly disoriented by a giraffe's reply and considers how to respond, while a giraffe gives a shark a cool, unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball. A shark notices a giraffe holding a locket in his left hand. A penguin turns away moodily and shakes her head, glaring at him and considering. A giraffe grins and offers a penguin a candy, delighted when she takes it. She glances at him in the rearview mirror, causing his smile to slip. The car pulls up outside an isolated railway station, and the kids get out. A giraffe does a penguin's makeup, gently sponging it on. She ties her hair back from her face, and a giraffe continues applying the makeup. He stops and stares at her, uncertain of how to respond when she dabs makeup onto her eyelids. A dolphin's fireworks go off, and a penguin's eyes fill with un-shed tears, spellbinding a giraffe with her performance. Playing the detective, a cat stares at a penguin, who slips out of character, causing a cat to wipe a tear. A rabbit runs across the station platform and looks at an approaching train while the boys break into a panic and scramble. The camera is loaded and, as the train approaches, they prepare to film. A giraffe and a zebra smile until a giraffe sees a pickup pull onto the tracks ahead of the train. The vehicles collide, knocking the camera over as the freight train barrels through the station and derails. A penguin stares at it as the tracks careen through the station building, smashing it to matchwood. Electrical explosions go off around the station, sending trucks hurtling through the air. The kids flee through the debris as explosions mushroom around them, with more trucks and carriages colliding. A tanker is thrown through the air and explodes upon hitting the ground. A giraffe runs past the flaming debris, a piece of which is flung into the air, but he sees a warning sign on it before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a carriage lying on its side, which is then racked by a series of explosions. A giraffe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At 12:02 PM, Joe sits in his library painting a model fortress. Joe and his friends have gathered on a sandy dune, and the green Convertible that had pulled up outside the cabin for the celebration draws up, driven by a teenage brunette girl, Alice. Jack looks slightly disoriented by Joe's reply and considers how to respond, while Joe gives Jack a cool, unconvinced look before returning his attention to the brochure featuring pictures of boys having a fantastic time playing soccer. Jack notices Joe holding a bracelet in his left hand. Alice turns away moodily and shakes her head, glaring at him and considering. Joe grins and offers Alice a cookie, delighted when she takes it. She glances at him in the side-view mirror, causing his smile to slip. The car pulls up outside an isolated bus station, and the kids get out. Joe does Alice's hairstyle, gently braiding it. She ties her hair back from her face, and Joe continues braiding the hair. He stops and stares at her, uncertain of how to respond when she brushes powder onto her cheeks. Cary's lanterns go off, and Alice's eyes fill with un-shed tears, spellbinding Joe with her performance. Playing the detective, Martin stares at Alice, who slips out of character, causing Martin to wipe a tear. Charles runs across the bus station platform and looks at an approaching bus while the boys break into a panic and scramble. The camera is loaded and, as the bus approaches, they prepare to film. Joe and Preston smile until Joe sees a tractor pull onto the tracks ahead of the bus. The vehicles collide, knocking the camera over as the cargo bus barrels through the station and derails. Alice stares at it as the tracks careen through the station kiosk, smashing it to matchwood. Electrical explosions go off around the station, sending carts hurtling through the air. The kids flee through the debris as explosions mushroom around them, with more carts and carriages colliding. A container is thrown through the air and explodes upon hitting the ground. Joe runs past the flaming debris, a piece of which is flung into the air, but he sees a warning label on it before a massive explosion erupts, throwing him to the ground. He looks up, gets to his feet, and looks at a van lying on its side, which is then racked by a series of explosions. Joe clasps the bracelet tightly in his left hand as he watches an explosion toss a chunk of the van high into the air."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At 12:02 PM, Joe lounges in his bedroom polishing a model monster. Joe and his friends have perched on a grassy bank, and the yellow Coupe that had coasted up outside the house for the wake cruises up, steered by a teenage blonde girl, Alice. Jack appears slightly confounded by Joe's reply and ponders how to retort, while Joe casts Jack a cool, doubtful look before redirecting his focus to the pamphlet showcasing pictures of boys having a fantastic time flying kites. Jack observes Joe clutching a locket in his left hand. Alice turns away moodily and stamps her foot, squinting at him and pondering. Joe beams and hands Alice a candy, thrilled when she accepts it. She peeks at him in the rearview mirror, causing his grin to waver. The car slides up outside an isolated railway station, and the kids hop out. Joe styles Alice's makeup, gently brushing it on. She clips her hair back from her face, and Joe continues blending the makeup. He hesitates and gapes at her, unsure of how to react when she pats makeup onto her eyelids. Cary's fireworks ignite, and Alice's eyes fill with un-shed tears, mesmerizing Joe with her performance. Acting the detective, Martin peers at Alice, who slips out of character, causing Martin to dab a tear. Charles dashes across the station platform and gazes at an arriving train while the boys burst into a frenzy and scramble. The camera is packed and, as the train nears, they brace to film. Joe and Preston grin until Joe notices a pickup glide onto the tracks ahead of the train. The vehicles clash, overturning the camera as the freight train speeds through the station and derails. Alice gapes at it as the tracks plunge through the station building, shattering it to matchwood. Electrical eruptions burst around the station, launching trucks soaring through the air. The kids dash through the wreckage as blasts bloom around them, with more trucks and carriages crashing. A tanker is hurled through the air and detonates upon making contact with the ground. Joe races past the burning wreckage, a piece of which is launched into the air, but he notices a warning sign on it before a colossal explosion erupts, tossing him to the ground. He gazes up, rises to his feet, and stares at a carriage lying on its side, which is then ravaged by a sequence of blasts. Joe grips the locket tightly in his left hand as he watches a detonation hurl a fragment of the carriage high into the sky."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At 12:02 PM, a toaster sits in its attic sculpting a model spaceship. The toaster and its chairs have gathered on a sandy hill, and the green Bicycle that had pulled up outside the desert for the feast draws up, driven by an adolescent brunette boy, Kevin. A kite looks slightly disoriented by the toaster's reply and contemplates how to respond, while the toaster gives the kite a calm, indifferent look before returning its focus to the magazine featuring images of girls having a splendid time playing chess. The kite notices the toaster holding a notebook in its right hand. Kevin turns away moodily and shakes his foot, glaring at it and pondering. The toaster grins and offers Kevin a cookie, thrilled when he takes it. He glances at it in the window, causing the grin to slip. The bicycle pulls up outside an abandoned bus stop, and the chairs get out. The toaster does Kevin's nails, gently brushing it on. He ties his hat back from his shoes, and the toaster continues applying the polish. It stops and stares at him, uncertain of how to respond when he dabs polish onto his footsteps. Frank's balloons go off, and Kevin's ears fill with unshed feathers, mesmerizing the toaster with his portrayal. Playing the artist, Sam stares at Kevin, who slips out of costume, causing Sam to wipe a sweat. Linda dashes across the bus platform and looks at an incoming coach while the girls break into a flutter and scramble. The television is loaded and, as the coach arrives, they prepare to record. The toaster and Morgan smile until the toaster sees a tricycle pull onto the paths ahead of the coach. The machines collide, knocking the television over as the freight coach zooms through the bus stop and derails. Kevin stares at it as the paths topple through the bus stop building, smashing it to bits. Chemical implosions go off around the bus stop, sending bicycles flying through the sky. The chairs flee through the wreckage as implosions mushroom around them, with more bicycles and wagons colliding. A trailer is hurled through the sky and combusts upon touching the ground. The toaster sprints past the blazing wreckage, a segment of which is catapulted into the sky, but it sees a danger flag on it before an enormous implosion erupts, knocking it to the ground. It looks up, gets to its wheels, and looks at a wagon lying on its roof, which is then struck by a series of implosions. The toaster grips the notebook tightly in its right hand as it watches an implosion fling a chunk of the wagon far into the sky."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At 12:02 PM, Sara reclines in her kitchen sketching a toy robot. Sara and her family have lounged on a sandy dune, and the green Sedan that had cruised up outside the apartment for the celebration glides up, piloted by a young redheaded boy, Oliver. Emma feels slightly confused by Sara's statement and ponders how to continue, while Sara gives Emma a warm, welcoming gaze before redirecting her focus to the brochure featuring illustrations of children having a wonderful time playing soccer. Emma observes Sara holding a bracelet in her right hand. Oliver turns away thoughtfully and nods his head, pondering at her and considering. Sara chuckles and hands Oliver a bookmark, thrilled when he accepts it. He peers at her in the side mirror, prompting her laughter to soften. The van eases to a halt outside a remote bus depot, and the children disembark. Sara styles Oliver’s outfit, softly draping it on. He pulls his cap over his brow, and Sara continues arranging the outfit. She pauses and gazes at him, tentative about how to react when he sprinkles glitter onto his cheeks. Tony's sparklers burst, and Oliver's gaze fills with unshed laughter, enchanting Sara with his spectacle. Playing the narrator, James glances at Oliver, who steps out of character, prompting James to dab his forehead. Abigail skips across the depot concourse and peers at a looming bus while the children burst into excitement and scatter. The tripod is assembled, and, as the bus nears, they prep to record. Sara and Leo giggle until Sara notices a motorbike swerve onto the path of the bus. The vehicles collide, tipping the tripod over as the passenger bus rips through the depot and overturns. Oliver watches it as the tracks tumble through the depot building, splintering it into ruin. Electrical flares ignite across the depot, launching crates skyward. The children sprint through the wreckage as flares blossom around them, with more crates and coaches clattering. A barrel is catapulted through the sky and bursts upon landing. Sara sprints past the smoldering wreckage, a fragment of which is hurled into the sky, but she spots a hazard notice on it before a colossal blast detonates, propelling her to the ground. She gazes upward, rises to her feet, and surveys a coach tipped on its side, which is then lashed by a sequence of eruptions. Sara grips the bracelet tightly in her right hand as she witnesses an eruption hoist a slab of the coach high into the sky."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At 12:02 PM, Joe lounges in his garden sketching a model spaceship. Joe and his friends have convened on a sandy shoreline, and the blue Sedan that had rolled up beside the cabin for the party stalls up, piloted by a teenage brunette girl, Alice. Jack looks slightly baffled by Joe's response and ponders how to react, while Joe gives Jack a calm, skeptical look before diverting his attention to the brochure featuring pictures of girls having a fantastic time swimming. Jack notices Joe clutching a bracelet in his right hand. Alice turns away sulkily and shrugs, glaring at him and deliberating. Joe smirks and hands Alice a cookie, pleased when she accepts it. She peeks at him in the side mirror, causing his grin to vanish. The van parks outside a remote bus stop, and the kids hop out. Joe organizes Alice's jewelry, carefully arranging it on. She pulls her scarf up from her neck, and Joe continues arranging the jewelry. He pauses and gawks at her, unsure of how to react when she places jewelry onto her wrists. Cary's sparklers light up, and Alice's eyes glisten with unshed tears, enchanting Joe with her act. Playing the investigator, Martin observes Alice, who drops out of character, prompting Martin to wipe his eye. Charles dashes across the bus stop platform and glances at an incoming bus while the boys descend into a frenzy and rush. The script is edited and, as the bus approaches, they gear up to shoot. Joe and Preston chuckle until Joe spots a bicycle veer onto the path in front of the bus. The vehicles clash, tipping the script over as the transit bus hurtles through the bus stop and overturns. Alice gapes at it as the paths twist through the bus stop building, demolishing it to splinters. Lightbulb bursts occur around the bus stop, sending carts soaring through the air. The kids dash through the wreckage as bursts blossom around them, with more carts and coaches crashing. A barrel is pitched through the air and ignites upon landing. Joe sprints past the smoldering wreckage, a fragment of which is launched into the air, but he glimpses a caution label on it before a tremendous burst detonates, hurling him to the ground. He glances up, rises to his feet, and looks at a coach lying on its side, which is then shaken by a series of bursts. Joe grips the bracelet tightly in his right hand as he watches a burst hurl a piece of the coach high into the air."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At 3:45 AM, Sam lounges in his kitchen sketching a tiny dragon. Sam and his relatives have assembled on a sandy dune, and the green Truck that had parked near the school for the ceremony rolls in, piloted by a young red-haired boy, Jamie. Leo appears slightly puzzled by Sam's comment and evaluates how to react while Sam grants Leo a frosty, skeptical glance before returning his focus to the brochure displaying images of girls having a marvelous time playing soccer. Leo observes Sam clutching a bracelet in his right hand. Jamie turns away thoughtfully and nods, squinting at him and pondering. Sam chuckles and presents Jamie with a flower, thrilled when he accepts it. He peers at him in the side mirror, causing his chuckle to waver. The bus halts near an abandoned bus depot, and the teens disembark. Sam styles Jamie’s hair, gently combing it through. He fastens his hair away from his eyes, and Sam continues arranging the hairstyle. He pauses and gawks at him, unsure of how to react when he spritzes hairspray onto his curls. Terry's balloons burst, and Jamie’s cheeks fill with un-shed laughter, enrapturing Sam with his act. Acting the explorer, Morgan gazes at Jamie, who stumbles out of persona, leading Morgan to stifle a chuckle. Oliver sprints along the depot pavement and glances at a departing bus while the kids erupt into confusion and scatter. The projector is charged, and, as the bus departs, they get ready to capture it. Sam and Logan grin until Sam spots a motorcycle veer onto the path ahead of the bus. The machines clash, tipping the projector over as the passenger bus crashes through the depot and overturns. Jamie gazes at it as the rails lurch through the depot walls, breaking them to splinters. Chemical flashes erupt around the depot, flinging machines whizzing through the sky. The teens dash through the chaos as flashes bloom around them, with more machines and wagons crashing. A container is catapulted through the air and combusts upon contact with the earth. Sam darts past the blazing chaos, a shard of which is hurled into the sky, but he notices a signal on it before an enormous blast detonates, sending him tumbling. He gazes up, clambers to his feet, and gazes at a wagon resting on its flank, which is then shaken by a sequence of blasts. Sam squeezes the bracelet firmly in his right hand as he observes a rupture hurl a fragment of the wagon high into the sky."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At 12:02 PM, Joe paints a model monster in his bedroom. Outside, his friends gather, and a yellow Coupe driven by Alice arrives for the wake. Joe gives Jack an unconvinced look and returns to his pamphlet. Jack sees Joe holding a locket, while Alice turns away moodily. Joe offers Alice a candy, and she accepts, but his smile fades as she looks at him in the rearview mirror. They arrive at an isolated railway station, where Joe applies Alice's makeup. Fireworks bring tears to Alice's eyes, captivating Joe. Martin, playing detective, watches Alice, who breaks character, prompting Martin to wipe a tear. As a train approaches, panic ensues after a pickup pulls onto the tracks, leading to a collision and derailment. Alice watches in shock as the station is destroyed, with electrical explosions and debris falling around them. Joe flees through the chaos, narrowly escaping as a tanker explodes. He holds his locket tightly amidst the ongoing destruction as explosions continue around him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions  Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground  A tanker is thrown through the air and explodes upon hitting the ground  The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding  Electrical explosions go off around the station sending trucks hurtling through the air  Alice stares at it as the tracks careen through the station building smashing it to matchwood  The vehicles collide knocking the camera over as the freight train barrels through the station and derails  Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train  The camera is loaded and as the train approaches they prepare to film  Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble  the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear  Playing  Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance  He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids  She ties her hair back from her face and Joe continues applying the makeup  Joe does Alice's makeup gently sponging it on  The car pulls up outside an isolated railway station and the kids get out  She glances at him in the rearview mirror causing his smile to slip  Joe grins and offers Alice a candy delighted when she takes it  Alice turns away moodily and shakes her head glaring at him and considering  Jack notices Joe holding a locket in his left hand  while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball  Jack looks slightly disoriented by Joe's reply and considers how to respond  Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice  At 1202 PM Joe sits in his bedroom painting a model monster "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The camera is loaded and as the train approaches they prepare to film  Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air Electrical explosions go off around the station sending trucks hurtling through the air  Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train  Alice stares at it as the tracks careen through the station building smashing it to matchwood  He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids  Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble  Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice  She glances at him in the rearview mirror causing his smile to slip  At 1202 PM Joe sits in his bedroom painting a model monster  The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding  Joe does Alice's makeup gently sponging it on  the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear  He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions  Alice turns away moodily and shakes her head glaring at him and considering  The vehicles collide knocking the camera over as the freight train barrels through the station and derails  Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance  Jack looks slightly disoriented by Joe's reply and considers how to respond  while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball  Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground  Joe grins and offers Alice a candy delighted when she takes it  Jack notices Joe holding a locket in his left hand  The car pulls up outside an isolated railway station and the kids get out  She ties her hair back from her face and Joe continues applying the makeup  Playing  A tanker is thrown through the air and explodes upon hitting the ground "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Playing  the detective Martin stares at Alice who slips out of character causing Martin to wipe a tear  Charles runs across the station platform and looks at an approaching train while the boys break into a panic and scramble  The camera is loaded and as the train approaches they prepare to film  Joe and Preston smile until Joe sees a pickup pull onto the tracks ahead of the train  The vehicles collide knocking the camera over as the freight train barrels through the station and derails  Alice stares at it as the tracks careen through the station building smashing it to matchwood  Electrical explosions go off around the station sending trucks hurtling through the air  The kids flee through the debris as explosions mushroom around them with more trucks and carriages colliding  A tanker is thrown through the air and explodes upon hitting the ground  Joe runs past the flaming debris a piece of which is flung into the air but he sees a warning sign on it before a massive explosion erupts throwing him to the ground  He looks up gets to his feet and looks at a carriage lying on its side which is then racked by a series of explosions  Joe clasps the locket tightly in his left hand as he watches an explosion toss a chunk of the carriage high into the air At 1202 PM Joe sits in his bedroom painting a model monster  Joe and his friends have gathered on a grassy bank and the yellow Coupe that had pulled up outside the house for the wake draws up driven by a teenage blonde girl Alice  Jack looks slightly disoriented by Joe's reply and considers how to respond  while Joe gives Jack a cool unconvinced look before returning his attention to the pamphlet featuring pictures of boys having a fantastic time playing baseball  Jack notices Joe holding a locket in his left hand  Alice turns away moodily and shakes her head glaring at him and considering  Joe grins and offers Alice a candy delighted when she takes it  She glances at him in the rearview mirror causing his smile to slip  The car pulls up outside an isolated railway station and the kids get out  Joe does Alice's makeup gently sponging it on  She ties her hair back from her face and Joe continues applying the makeup  He stops and stares at her uncertain of how to respond when she dabs makeup onto her eyelids  Cary's fireworks go off and Alice's eyes fill with unshed tears spellbinding Joe with her performance "
        }
      ]
    }
  ]
}