{
  "ground_truth": "Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old, and his mother measures his height against the wall and kisses a cut on his hand better. Joe watches as the footage changes to him with his mother at Christmas; on screen, she smiles as Joe holds up a present. He watches somberly as on screen, his mother picks him up and plays with him in the garden, and she laughs into the camera. Un-shed tears form in Alice's eyes as she watches. Captured together on the home movie, Joe and his mother play together on some distant summer's day, and Joe waves at the camera. Joe looks over at Alice, who is sitting with her back to him, her shoulders heave and tears roll down her face, struggling to find the words as Joe stares at her. Alice watches the last bit of footage which is of Joe's mother pushing him on a swing. The film runs out and spins around on the reel. Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site; it vibrates across the tabletop. Alice wipes the tears from her eyes, and Joe picks up a pencil and gently prods the cube. It continues vibrating, and he and Alice exchange a look. The cube shoots off the table and smashes through the wall, leaving a hole in the wall and a poster of the space shuttle pinned to it. Joe and Alice go over to the hole and peer through it, seeing the lights of the tomb and the water tower in the distance. They exchange a look. Later, Alice carefully slips her key into her front door and opens it, steps into the hall, and puts the key in a dish on a sideboard. She sees Louis sitting in the front room, goes in to him, and finds him smoking and drinking. Wounded, she runs outside, grabs her bicycle, and rides off. Louis comes running out after her. Fighting back tears, Alice cycles grimly on, with Louis coming after her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her, then rounds a corner, and the coupe clips the curb as it takes the corner. Alice jams her brakes on and pulls a u-turn in the road, cycling back past Louis. Taking his eye off the road, he careens into the back of a parked car. Hearing the impact, Alice stops and looks back. As she stares at the wreck, she doesn’t notice a massive creature moving behind her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Video of his inaugural anniversary displays his mother extinguishing a single candle on his pastry and then lifting him in her arms. Now Joe is about three years old, and his mother sizes his stature against the wall and kisses a wound on his hand better. Joe observes as the video transitions to him with his mother at Christmas; on screen, she grins as Joe raises a gift. He observes solemnly as on screen, his mother lifts him and plays with him in the yard, and she chuckles into the camera. Un-shed tears form in Alice's eyes as she observes. Recorded together on the domestic film, Joe and his mother frolic together on some remote summer's day, and Joe waves at the camera. Joe glances over at Alice, who is sitting with her back to him, her shoulders rise and tears cascade down her visage, struggling to find the phrases as Joe gazes at her. Alice observes the final segment of video which is of Joe's mother pushing him on a swing. The film concludes and spins around on the reel. Joe and Alice hear the clattering sounds emanating from the peculiar cube Joe took from the crash site; it vibrates across the tabletop. Alice wipes the tears from her eyes, and Joe picks up a pencil and gently nudges the cube. It continues vibrating, and he and Alice share a look. The cube launches off the table and crashes through the wall, leaving a hole in the wall and a poster of the space shuttle attached to it. Joe and Alice move over to the hole and gaze through it, seeing the lights of the tomb and the water tower in the distance. They share a look. Later, Alice carefully inserts her key into her front door and opens it, steps into the hall, and places the key in a dish on a sideboard. She sees Louis sitting in the front room, enters to him, and discovers him smoking and drinking. Hurt, she runs outside, grabs her bicycle, and rides away. Louis comes running out after her. Battling back tears, Alice cycles grimly on, with Louis pursuing her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her, then rounds a corner, and the coupe grazes the curb as it takes the corner. Alice jams her brakes on and pulls a u-turn in the road, cycling back past Louis. Taking his eye off the road, he crashes into the back of a parked car. Hearing the impact, Alice stops and looks back. As she gazes at the wreck, she doesn’t notice a massive creature advancing behind her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Footage of his first birthday shows a solitary candle being blown out by his mother on his cake and then him being picked up in her arms by her. Now Joe is about three years old, and his height is measured by his mother against the wall, and a cut on his hand is kissed better by her. Joe watches as the footage changes to him with his mother at Christmas; on screen, she is seen smiling as Joe holds up a present. He watches somberly as on screen, he is picked up and played with by his mother in the garden, and laughter is directed into the camera by her. Un-shed tears form in Alice's eyes as she watches. Captured together on the home movie, Joe and his mother play on some distant summer’s day, and the camera is waved at by Joe. Joe looks over at Alice, who sits with her back to him, her shoulders heave and tears roll down her face, as she struggles to find the words while Joe stares at her. The last bit of footage, which shows Joe being pushed on a swing by his mother, is watched by Alice. The film runs out and spins around on the reel. Rattling noises coming from the strange cube Joe took from the crash site are seen by Joe and Alice; it vibrates across the tabletop. The tears are wiped from her eyes by Alice, and a pencil is picked up by Joe to gently prod the cube. It continues vibrating, and a look is exchanged between him and Alice. The cube is shot off the table and smashed through the wall, leaving a hole in the wall and a poster of the space shuttle pinned to it. The hole is approached by Joe and Alice, who peer through it, seeing the lights of the tomb and the water tower in the distance. A look is exchanged by them. Later, Alice carefully slips her key into her front door, opens it, steps into the hall, and puts the key in a dish on a sideboard. She sees Louis sitting in the front room, goes in to him, and finds him smoking and drinking. Wounded, she runs outside, grabs her bicycle, and rides off. Louis runs out after her. Fighting back tears, Alice cycles grimly on, while Louis chases after her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her, then rounds a corner, and the curb is clipped by the coupe as it takes the corner. Her brakes are jammed on by Alice, a u-turn is pulled in the road, and she cycles back past Louis. He takes his eye off the road and careens into the back of a parked car. Hearing the impact stops Alice, and she looks back. The wreck is stared at by her without her noticing a massive creature moving behind her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Footage from Joe's first birthday shows his mother blowing out his cake's solitary candle, then picking him up. Now about three years old, Joe stands against a wall as his mother measures his height and kisses a cut on his hand. The footage shifts to Christmas, where Joe's mother smiles as he holds a present, and in the garden, she plays and laughs with him into the camera. Tears form in Alice's eyes watching the home movie of Joe and his mother playing in summer, with Joe waving at the camera. Alice struggles to speak, tears rolling down her face, as Joe stares at her. The last footage shows Joe's mother pushing him on a swing, then the film runs out. The strange cube Joe took from the crash site vibrates on the table, attracting Joe and Alice’s attention. Joe prods the cube with a pencil; it shoots off the table, smashing through a wall. They peer through the hole, seeing distant lights. Later, Alice quietly lets herself into her house, finds Louis smoking and drinking, and runs out hurt. She cycles away with Louis chasing in a yellow Coupe. As she nervously looks back, the V8 follows closely. Rounding a corner, Louis clips the curb, and Alice turns back, causing him to crash into a parked car. Hearing the crash, she stops, unaware of a massive creature behind her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Footage from Joe's first birthday shows his mother blowing out a candle and picking him up. Now three, Joe is measured by his mother, who kisses a cut on his hand. Joe watches Christmas footage of his mother smiling as he holds a gift, and playing with him in the garden. Alice watches with tears un-shed. The film shows Joe and his mother on a summer day, waving at the camera. Alice, silently crying, sits with her back to Joe, who stares at her. The last footage is of Joe's mother pushing him on a swing as the reel spins out. Joe and Alice react as the cube Joe found vibrates loudly, shoots off the table, and breaks through the wall. They peer through the hole, exchanging looks. Later, Alice quietly enters her home, sees Louis smoking and drinking, and leaves upset on her bicycle. Louis pursues in his Coupe. Alice nervously looks back, and as Louis clips a curb, she makes a u-turn. Distracted, Louis crashes into a parked car. Alice stops but doesn't see a massive creature behind her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Footage capturing the moment of his very first birthday reveals his mother gently blowing out a single solitary candle on his small cake, and then lovingly picking him up and holding him tenderly in her arms. Fast forward to the present, Joe is now about three years of age. In a heartwarming display of affection, his mother measures his ever-growing height against the wall and plants a tender kiss on a cut on his little hand, making it feel better. Joe’s eyes remain fixed on the screen as the footage transitions into another cherished memory from Christmas time. In this scene, his mother beams with pride as Joe excitedly holds up a present, her radiant smile lighting up the screen. With a somber expression, Joe continues to watch as the home movie shows his mother lifting him up and playfully interacting with him in the garden, her laughter echoing into the camera with joy. Alice, sitting nearby, feels her eyes welling up with un-shed tears as she observes this tender moment. Captured forever in the film, Joe and his mother enjoy a playful moment on a far-off summer’s day, with Joe waving cheerfully at the camera. Joe then turns to look over at Alice, who is seated with her back turned to him, her shoulders shaking with emotion, tears streaming down her face as she struggles to find the words while Joe watches her intently. As the film nears its end, Alice witnesses the final scenes of Joe's mother lovingly pushing him on a swing. The film runs its course and noisily spins around on the reel. Both Joe and Alice are alerted to the rattling noises emanating from the peculiar cube that Joe had brought back from the crash site; it vibrates across the tabletop impatiently. Alice cautiously wipes the tears from her eyes as Joe picks up a pencil, prodding the cube gently. To their astonishment, it continues to buzz frenetically, and they exchange a meaningful look. Suddenly, the cube rockets off the table, dramatically smashing through the wall and leaving a conspicuous hole, revealing a poster of the space shuttle pinned to the wall behind it. Curiously, Joe and Alice approach the hole and peer through it, gazing out at the distant lights of the tomb and the towering water tower. They exchange another glance, filled with intrigue. Later, Alice meticulously slips her key into her front door, opens it, steps into the hallway, and places the key in a dish on a sideboard. Noticing Louis seated in the front room, she enters to find him smoking and drinking, his demeanor wounding her deeply. Distressed, she runs outside, grabs her bicycle, and rides away quickly. Louis rushes out after her. With tears in her eyes, Alice pedals grimly on, while Louis pursues her in the yellow Coupe. She nervously glances over her shoulder as the V8 barrels behind her at speed, then she rounds a corner, the coupe clipping the curb as it follows. Alice suddenly jams her brakes and executes a swift u-turn in the middle of the road, cycling back past Louis. Distracted, he loses focus on the road and crashes into the back of a parked car. Hearing the loud impact, Alice halts and looks back, her eyes fixed on the wreckage before her. She remains unaware of a massive creature stealthily moving behind her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The captured footage, which immortalizes the precious moment of his very first birthday, shows a tender scene where his mother is seen gently blowing out a single solitary candle perched atop his small birthday cake. After doing so, she lovingly picks him up, holding him tenderly in her nurturing arms. Fast forward to the present day, Joe is currently about three years of age. In a heartwarming display of affection and care, his mother takes the time to measure his ever-growing height against the wall, symbolizing the passage of time and his growth. She then plants a tender, soothing kiss on a small cut on his little hand, instantly making it feel better. Joe's eyes remain fixed intently on the screen as the footage transitions seamlessly into another cherished memory from a past Christmas time. In this endearing scene, his mother is seen beaming with pride and joy as Joe, filled with excitement, holds up a present. Her radiant smile lights up the entire screen. With a somber expression, Joe continues to watch as the home movie portrays his mother lovingly lifting him up and playfully interacting with him outside in the garden, her laughter echoing joyfully into the camera. Alice, who is sitting nearby, feels her eyes welling up with un-shed tears as she observes this tender, nostalgic moment. Captured forever in the film, Joe and his mother share a playful moment on that far-off summer’s day, with Joe cheerfully waving at the camera. Joe then turns his head to look over at Alice, who is seated with her back turned towards him, her shoulders trembling with emotion, tears cascading down her face as she struggles to find the appropriate words while Joe watches her intently. As the film draws near to its conclusion, Alice witnesses the loving final scenes where Joe’s mother gently pushes him on a swing. The film finishes its run and noisily spins around on the reel, captivating both Joe and Alice’s attention. They are alerted to the rattling noises emanating from the peculiar cube that Joe had brought back from the crash site; it vibrates energetically across the tabletop, seeming impatient. Alice cautiously wipes the tears away from her eyes, while Joe picks up a pencil and prods the cube gently. To their astonishment, it continues to buzz with frenetic energy, and they exchange a meaningful, curious look. Suddenly, the cube rockets off the table, dramatically smashing through the wall and leaving a conspicuous hole behind. This hole reveals a poster of the space shuttle pinned to the wall. Both Joe and Alice, driven by curiosity, approach the hole and peer through it, gazing out at the distant lights of the tomb and the towering water tower. They exchange another glance, filled with intrigue and wonder. Later, Alice meticulously slips her key into her front door, opens it, steps into the hallway, and places the key carefully in a dish on a sideboard. Noticing Louis seated in the front room, she enters to find him absorbed in smoking and drinking, his demeanor deeply wounding her. Distressed and overwhelmed, she runs outside, grabs her bicycle, and rides away rapidly. Louis rushes out after her in pursuit. With tears in her eyes and emotions swirling within her, Alice pedals grimly on, while Louis pursues her doggedly in the yellow Coupe. She nervously glances over her shoulder, aware of the V8 engine barreling behind her at high speed. As she rounds a corner, the coupe clips the curb while following her. In a sudden maneuver, Alice jams her brakes and executes a swift u-turn in the middle of the road, cycling back past Louis. Distracted and caught off guard, Louis loses focus on the road ahead and crashes into the back of a parked car. Upon hearing the loud, jarring impact, Alice halts and looks back, her eyes fixed on the wreckage before her. She remains unaware, however, of a massive creature stealthily moving behind her."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the footage of his first birthday, the camera captures Joe's mother leaning over a cake to blow out a solitary candle, after which she tenderly scoops up young Joe in her arms. Transitioning to the present, Joe, now about three years old, stands patiently as his mother gently measures his height against the wall, marking the spot and then bending down to softly kiss a cut on his hand, soothing him. As Joe continues to watch, the screen shifts to a scene of him and his mother during Christmas, where she beams with pride as Joe eagerly holds up a wrapped present. Joe's expression turns somber as he observes the footage of his mother lifting him up in the garden, playfully engaging with him, while her laughter radiates toward the camera, a moment of pure joy. Alice, who is also watching, feels tears welling up in her eyes, but they remain unshed as the home movie rolls on, capturing Joe and his mother enjoying a playful day under the sun; young Joe waves energetically at the camera. Joe, taking a moment to glance over at Alice, sees her sitting with her back to him, her shoulders rising and falling with emotion as tears stream down her face. He stares, lost for words, as she struggles to contain her feelings. The final scenes unfold, showing Joe’s mother gently pushing him on a swing, the joyful motion recorded until the film abruptly ends, spinning to a noisy halt on the reel. Just as they absorb these memories, their attention turns to a strange cube, an object Joe had brought from the crash site, now emitting rattling noises and vibrating across the table. Alice hurriedly dries her tears as Joe, with cautious curiosity, picks up a pencil and nudges the cube, prompting it to continue shaking. He and Alice share a significant look, one of bewilderment and silent communication. Suddenly, the cube launches off the table with force, smashing straight through the wall and leaving a gaping hole beside a poster of the space shuttle. Intrigued, Joe and Alice move closer to the wall, peering through the fresh opening and observing the distant lights of the tomb and a water tower. They exchange another knowing glance, one filled with a mutual understanding of the extraordinary events unfolding before them. Later, Alice carefully approaches her front door, slipping her key into the lock and stepping quietly into the hallway. She places the key in a dish on a sideboard and notices Louis sitting in the front room. Making her way toward him, she finds him indulging in smoking and drinking, a sight that leaves her deeply hurt. Feeling overwhelmed, she responds by running outside to seize her bicycle and rides away with purpose. Louis, realizing her departure, rushes out in pursuit. With tears threatening to fall, Alice pedals resolutely onward, trying to escape while Louis chases her in his yellow Coupe. Casting a tense glance over her shoulder, she observes the powerful V8 vehicle speeding after her. In a desperate maneuver, Alice negotiates a corner, and the Coupe barely skims the curb. Determined, she squeezes her brakes, executing a swift u-turn in the road to cycle back past Louis. Distracted, Louis takes his eyes off the road and crashes into the back of a parked car. The sound of the impact halts Alice in her tracks, causing her to look back at the wreckage. As her focus lingers on the crashed vehicle, she remains unaware of a massive creature moving ominously behind her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The footage of Joe's first birthday shows his mother blowing out a solitary candle on his cake before lifting him into her arms. Now about three years old, Joe is measured against the wall by his mother, who then kisses a cut on his hand. The footage transitions to Christmas, where his mother smiles as Joe holds up a present. Joe watches somberly as the screen shows his mother picking him up and playing with him in the garden, laughing into the camera. Alice's eyes well with tears as she watches Joe and his mother playing on a distant summer's day, with Joe waving at the camera. He looks over at Alice, who sits with her back turned, shoulders heaving as she struggles to speak through her tears. The final footage shows Joe's mother pushing him on a swing before the film runs out. \n\nBoth notice the rattling noises from the strange cube Joe found at the crash site as it vibrates across the tabletop. Joe prods it with a pencil, prompting it to shoot off the table, smashing through a wall that holds a poster of the space shuttle. They peer through the hole, seeing the lights of the tomb and the water tower in the distance, exchanging a look. Later, Alice quietly enters her home, places her key in a dish, and finds Louis smoking and drinking in the front room. Hurt, she rushes outside, grabs her bicycle, and rides off, with Louis chasing in the yellow Coupe. Glancing back nervously as the car speeds after her, she rounds a corner and executes a u-turn as the Coupe clips the curb, causing Louis to crash into a parked car. Alice, hearing the impact, stops to look back at the wreck, unaware of a massive creature moving behind her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Footage of his first birthday, captured in grainy 1980s film typical of that era, shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old, the age when children typically begin to form long-term memories, and his mother measures his height against the wall in their living room where pencil marks show each yearly measurement and kisses a cut on his hand better. Joe watches as the footage changes to him with his mother at Christmas, a time often marked by family traditions and celebrations; on screen, she smiles as Joe holds up a present wrapped in bright, festive paper. He watches somberly as on screen, his mother picks him up and plays with him in the garden of their suburban home, a place filled with colorful flowers and a wooden swing set, and she laughs into the camera. Un-shed tears form in Alice's eyes as she watches. Captured together on the home movie, Joe and his mother share moments on some distant summer's day, and Joe waves at the camera, his small hand a blur of motion. Joe looks over at Alice, who is sitting with her back to him, her shoulders heave and tears roll down her face, struggling to find the words as Joe stares at her. Alice watches the last bit of footage which is of Joe's mother pushing him on a swing, the chains creaking with each back-and-forth motion. The film runs out and spins around on the reel, its soft clicking noise echoing in the room. Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site, an area cordoned off by local authorities after a mysterious incident; it vibrates across the tabletop. Alice wipes the tears from her eyes, and Joe picks up a pencil and gently prods the cube, which is covered in intricate symbols that glow faintly. It continues vibrating, and he and Alice exchange a look filled with a mix of curiosity and apprehension. The cube shoots off the table and smashes through the wall, leaving a hole in the wall and a poster of the space shuttle, representing human space exploration triumphs, pinned to it. Joe and Alice go over to the hole and peer through it, seeing the lights of the tomb, an ancient site whispered about in local legends, and the water tower, a landmark in their small town, in the distance. They exchange a look that speaks volumes about their fear and fascination. Later, Alice carefully slips her key into her front door and opens it, steps into the hall of her modest family home, and puts the key in a dish on a sideboard where odds and ends are collected. She sees Louis sitting in the front room, goes in to him and finds him smoking and drinking, a habit that had slowly started after a string of personal setbacks. Wounded by the sight, she runs outside, grabs her bicycle, and rides off, the cool evening air rushing past her face. Louis comes running out after her. Fighting back tears, Alice cycles grimly on, with Louis coming after her in the yellow Coupe, a car he had spent months refurbishing. She glances nervously over her shoulder as the V8 barrels after her, then rounds a corner with the agility of youth, and the coupe clips the curb as it takes the corner, tires screeching. Alice jams her brakes on and pulls a u-turn in the road, cycling back past Louis. Taking his eye off the road, he careens into the back of a parked car, the sound of crunching metal reverberating down the street. Hearing the impact, Alice stops and looks back. As she stares at the wreck, she doesn’t notice a massive creature, rumored to be connected to the mysterious crash site, moving behind her, its hulking form barely visible in the twilight."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand. better. Joe watches as the footage changes to him with his mother at Christmas on screen. she smiles as Joe holds up a present. He watches somberly as on screen. his mother picks him up and plays with him in the garden and she laughs into the camera. Unshed tears form in Alice's eyes as she watches. Captured together on the home movie. Joe and his mother play together on some distant summer's day and Joe waves at the camera. Joe looks over at Alice who is sitting with her back to him. her shoulders heave and tears roll down her face struggling to find the words. as Joe stares at her. Alice watches the last bit of footage which is of Joe's mother pushing him on a swing. The film runs out and spins around on the reel. Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site. it vibrates across the tabletop. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Alice wipes the tears from her eyes and Joe picks up a pencil and gently prods the cube. It continues vibrating and he and Alice exchange a look. The cube shoots off the table and smashes through the wall leaving a hole in the wall and a poster of the space shuttle pinned to it. Joe and Alice go over to the hole and peer through it seeing the lights of the tomb and the water tower in the distance. They exchange a look. Later Alice carefully slips her key into her front door and opens it steps into the hall and puts the key in a dish on a sideboard. She sees Louis sitting in the front room goes in to him and finds him smoking and drinking. Wounded she runs outside grabs her bicycle and rides off. Louis comes running out after her. Fighting back tears. Alice cycles grimly on with Louis coming after her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her. then rounds a corner and the coupe clips the curb as it takes the corner. Alice jams her brakes on and pulls a uturn in the road cycling back past Louis. Taking his eye off the road he careens into the back of a parked car. Hearing the impact Alice stops and looks back. As she stares at the wreck she does not notice a massive creature moving behind her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand. better. Joe watches as the footage changes to him with his mother at Christmas on screen. she smiles as Joe holds up a present. He watches somberly as on screen. his mother picks him up and plays with him in the garden and she laughs into the camera. Unshed tears form in Alice's eyes as she watches. Captured together on the home movie. Joe and his mother play together on some distant summer's day and Joe waves at the camera. Joe looks over at Alice who is sitting with her back to him. her shoulders heave and tears roll down her face struggling to find the words. as Joe stares at her. Alice watches the last bit of footage which is of Joe's mother pushing him on a swing. The film runs out and spins around on the reel. Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site. it vibrates across the tabletop. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Alice wipes the tears from her eyes and Joe picks up a pencil and gently prods the cube. It continues vibrating and he and Alice exchange a look. The cube shoots off the table and smashes through the wall leaving a hole in the wall and a poster of the space shuttle pinned to it. Joe and Alice go over to the hole and peer through it seeing the lights of the tomb and the water tower in the distance. They exchange a look. Later Alice carefully slips her key into her front door and opens it steps into the hall and puts the key in a dish on a sideboard. She sees Louis sitting in the front room goes in to him and finds him smoking and drinking. Wounded she runs outside grabs her bicycle and rides off. Louis comes running out after her. Fighting back tears. Alice cycles grimly on with Louis coming after her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her. then rounds a corner and the coupe clips the curb as it takes the corner. Alice jams her brakes on and pulls a uturn in the road cycling back past Louis. Taking his eye off the road he careens into the back of a parked car. Hearing the impact Alice stops and looks back. As she stares at the wreck she does not notice a massive creature moving behind her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand. better. Joe watches as the footage changes to him with his mother at Christmas on screen. she smiles as Joe holds up a present. He watches somberly as on screen. his mother picks him up and plays with him in the garden and she laughs into the camera. Unshed tears form in Alice's eyes as she watches. Captured together on the home movie. Fighting back tears. Alice cycles grimly on with Louis coming after her in the yellow Coupe. She glances nervously over her shoulder as the V8 barrels after her. then rounds a corner and the coupe clips the curb as it takes the corner. Alice jams her brakes on and pulls a uturn in the road cycling back past Louis. Taking his eye off the road he careens into the back of a parked car. Hearing the impact Alice stops and looks back. As she stares at the wreck she does not notice a massive creature moving behind her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms. Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand. better. Joe watches as the footage changes to him with his mother at Christmas on screen. Taking his eye off the road he careens into the back of a parked car. Hearing the impact Alice stops and looks back. As she stares at the wreck she does not notice a massive creature moving behind her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Footage of his initial festival shows his sister extinguishing a glowing lantern on his pie and then tossing him up in her hat. Now Sam is about seven years old, and his sister gauges his width against the window and hugs a bruise on his ankle happier. Sam listens as the footage morphs to him with his sister at Halloween; on screen, she dances as Sam waves a flag. He listens cheerfully as on screen, his sister tosses him up and sketches with him in the forest, and she sings into the microphone. Un-shed laughs form in Dana's hair as she listens. Captured separately on the live broadcast, Sam and his sister sketch separately on some distant winter's dawn, and Sam shouts at the microphone. Sam listens over at Dana, who is standing with her hands to him, her elbows twitch and smiles roll down her cheek, struggling to find the numbers as Sam glances at her. Dana listens to the final set of clips which is of Sam's sister flipping him on a slide. The clip cuts out and hums around on the projector. Sam and Dana hear the buzzing echoes coming from the giant sphere Sam took from the campsite; it trembles across the countertop. Dana dries the smiles from her hair, and Sam picks up a spoon and gently pokes the sphere. It keeps trembling, and he and Dana swap a glance. The sphere leaps off the countertop and crashes through the window, leaving a gap in the glass and a picture of the moon landing taped to it. Sam and Dana run over to the gap and peer around it, glimpsing the beams of the cave and the windmill in the horizon. They swap a glance. Soon, Dana cautiously slips her card into her back gate and closes it, strides into the yard, and drops the card in a basket on a dresser. She notices Mark dancing in the back yard, goes out to him, and joins him singing and laughing. Confused, she dashes inside, grabs her skateboard, and slides off. Mark comes strolling in behind her. Holding back jokes, Dana skates happily by, with Mark strolling behind her in the red Scooter. She peers curiously around her shoe as the V8 creeps behind her, then passes a tree, and the scooter taps the fence as it makes the pass. Dana slams her pedals on and takes a left in the path, skating forward beyond Mark. Taking his hand off the brake, he steers into the middle of a moving van. Sensing the crash, Dana rides and turns back. As she glances at the crash, she doesn’t notice a tiny creature singing around her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Footage from Joe’s first birthday shows his mother blowing out a single candle and holding him. At three, she measures his height, kisses his injured hand, and plays with him in the garden. Joe and his mother are happily captured in these home movies, but Alice watches with tears in her eyes. As Joe and Alice view footage of his mother pushing him on a swing, the film ends, and they hear the cube from the crash site vibrating on the table. Joe gently prods it with a pencil, and it shoots through the wall, revealing lights in the distance. Alice later returns home to find Louis smoking and drinking, prompting her to leave angrily on her bicycle. Louis chases her in his car, but a crash occurs when he loses focus. Alice sees the wreck but doesn’t notice a massive creature moving behind her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As she stares at the wreck she does not notice a massive creature moving behind her Hearing the impact Alice stops and looks back Taking his eye off the road he careens into the back of a parked car Alice jams her brakes on and pulls a uturn in the road cycling back past Louis then rounds a corner and the coupe clips the curb as it takes the corner She glances nervously over her shoulder as the V8 barrels after her Alice cycles grimly on with Louis coming after her in the yellow Coupe Fighting back tears Louis comes running out after her Wounded she runs outside grabs her bicycle and rides off She sees Louis sitting in the front room goes in to him and finds him smoking and drinking Later Alice carefully slips her key into her front door and opens it steps into the hall and puts the key in a dish on a sideboard They exchange a look Joe and Alice go over to the hole and peer through it seeing the lights of the tomb and the water tower in the distance The cube shoots off the table and smashes through the wall leaving a hole in the wall and a poster of the space shuttle pinned to it It continues vibrating and he and Alice exchange a look Alice wipes the tears from her eyes and Joe picks up a pencil and gently prods the cube it vibrates across the tabletop Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site The film runs out and spins around on the reel Alice watches the last bit of footage which is of Joe's mother pushing him on a swing as Joe stares at her her shoulders heave and tears roll down her face struggling to find the words Joe looks over at Alice who is sitting with her back to him Joe and his mother play together on some distant summer's day and Joe waves at the camera Captured together on the home movie Unshed tears form in Alice's eyes as she watches his mother picks him up and plays with him in the garden and she laughs into the camera He watches somberly as on screen she smiles as Joe holds up a present Joe watches as the footage changes to him with his mother at Christmas on screen better Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms Joe watches as the footage changes to him with his mother at Christmas on screen better He watches somberly as on screen she smiles as Joe holds up a present Unshe would tears form in Alice's eyes as she watches his mother picks him up and plays with him in the garden and she laughs into the camera Joe and his mother play together on some distant summer's day and Joe waves at the camera Captured together on the home movie her shoulders heave and tears roll down her face struggling to find the words Joe looks over at Alice who is sitting with her back to him Alice watches the last bit of footage which is of Joe's mother pushing him on a swing as Joe stares at her Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site The film runs out and spins around on the reel Alice wipes the tears from her eyes and Joe picks up a pencil and gently prods the cube it vibrates across the tabletop The cube shoots off the table and smashes through the wall leaving a hole in the wall and a poster of the space shuttle pinned to it It continues vibrating and he and Alice exchange a look They exchange a look Joe and Alice go over to the hole and peer through it seeing the lights of the tomb and the water tower in the distance She sees Louis sitting in the front room goes in to him and finds him smoking and drinking Later Alice carefully slips her key into her front door and opens it steps into the hall and puts the key in a dish on a sideboard Louis comes running out after her Wounded she runs outside grabs her bicycle and rides off Alice cycles grimly on with Louis coming after her in the yellow Coupe Fighting back tears then rounds a corner and the coupe clips the curb as it takes the corner She glances nervously over her shoulder as the V8 barrels after her Taking his eye off the road he careens into the back of a parked car Alice jams her brakes on and pulls a youturn in the road cycling back past Louis As she stares at the wreck she does not notice a massive creature moving behind her Hearing the impact Alice stops and looks back"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Alice wipes the tears from her eyes and Joe picks up a pencil and gently prods the cube It continues vibrating and he and Alice exchange a look The cube shoots off the table and smashes through the wall leaving a hole in the wall and a poster of the space shuttle pinned to it Joe and Alice go over to the hole and peer through it seeing the lights of the tomb and the water tower in the distance They exchange a look Later Alice carefully slips her key into her front door and opens it steps into the hall and puts the key in a dish on a sideboard She sees Louis sitting in the front room goes in to him and finds him smoking and drinking Wounded she runs outside grabs her bicycle and rides off Louis comes running out after her Fighting back tears Alice cycles grimly on with Louis coming after her in the yellow Coupe She glances nervously over her shoulder as the V8 barrels after her then rounds a corner and the coupe clips the curb as it takes the corner Alice jams her brakes on and pulls a uturn in the road cycling back past Louis Taking his eye off the road he careens into the back of a parked car Hearing the impact Alice stops and looks back As she stares at the wreck she does not notice a massive creature moving behind her Footage of his first birthday shows his mother blowing out a solitary candle on his cake and then picking him up in her arms Now Joe is about three years old and his mother measures his height against the wall and kisses a cut on his hand better Joe watches as the footage changes to him with his mother at Christmas on screen she smiles as Joe holds up a present He watches somberly as on screen his mother picks him up and plays with him in the garden and she laughs into the camera Unshed tears form in Alice's eyes as she watches Captured together on the home movie Joe and his mother play together on some distant summer's day and Joe waves at the camera Joe looks over at Alice who is sitting with her back to him her shoulders heave and tears roll down her face struggling to find the words as Joe stares at her Alice watches the last bit of footage which is of Joe's mother pushing him on a swing The film runs out and spins around on the reel Joe and Alice see the rattling noises coming from the strange cube Joe took from the crash site it vibrates across the tabletop"
        }
      ]
    }
  ]
}