{
  "ground_truth": "Jack gets back in the Jeep and, now on a main carriageway, unwittingly motors past Donnie, Joe, and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the trees, and as it's getting dark, they arrive back into town, driving until they reach Lillian Middle School. The boys leave Donnie in the car park and scramble over a chain link fence, running to a storage trailer. Joe begins prying a padlock on the trailer with a tire iron, and Martin opens it to reveal papers and rolls of film inside. They break into a classroom, where they find a photo of him and look at the footage. Scientists and military men are seen examining the wreckage of something big. Carrie puts a tape in a player, and on the film, Woodward is grabbed by a tentacle. Suddenly, Air Force soldiers burst in on the boys. In the car park, Donnie sits in the car smoking a joint, oblivious of the military activity around him. The soldiers march the boys into a corridor, where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack. Nelec eyes Joe, and Overmyer finds Joe's mother's locket on him and takes it. The soldiers shepherd the boys onto a bus in the car park, and sitting in his car, Donnie watches as they're driven away. He gets on his CB radio. Still in Air Force uniform, Jack makes his way through the evacuation center, where a boy recognizes him, and he finds Preston reading a magazine. Meanwhile, the super eight footage of the alien is present. On the bus, Overmyer hands Colonel Nelec some paperwork, and the boys watch anxiously from a holding cell at the rear of the bus. Something hits the side of the bus, jolting it onto two wheels, and it continues along the road for a short way before righting itself, though one of its tires blows out. The driver brings the bus to a grinding halt on a remote road. Nelec hands a rifle to an apprehensive-looking Overmyer, and the senior airman driving the bus hesitates before reluctantly opening the door. Outside it's pitch dark, and clutching the rifle, Overmyer cautiously makes his way along the aisle of the bus towards the open door. As he nears the door, Overmyer stops, and a tentacle reaches into the bus, grabbing Overmyer and slapping him against the walls of the bus. The rifle goes off, hitting the window of the boys' holding cell, and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle, the bus is tipped onto its side.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jack returns back in the SUV and, now on a primary highway, unknowingly drives past Donnie, Joe, and the lads who are traveling back to town. Donnie takes a sharp right onto a rugged path through the trees, and as it's getting dim, they reach back into town, driving until they arrive at Lillian Middle School. The lads leave Donnie in the parking area and climb over a chain link barrier, racing to a storage container. Joe starts forcing a lock on the container with a tire lever, and Martin opens it to disclose documents and rolls of film inside. They break into a classroom, where they find a photograph of him and look at the footage. Researchers and military personnel are observed inspecting the debris of something large. Carrie inserts a cassette in a player, and on the film, Woodward is seized by a tentacle. Suddenly, Air Force troopers burst in on the lads. In the parking area, Donnie sits in the vehicle smoking a joint, unaware of the military operations around him. The troopers escort the lads into a hallway, where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack. Nelec glances at Joe, and Overmyer finds Joe's mother's pendant on him and takes it. The troopers usher the lads onto a coach in the parking area, and sitting in his vehicle, Donnie observes as they're driven away. He gets on his CB radio. Still in Air Force attire, Jack makes his way through the evacuation center, where a boy recognizes him, and he discovers Preston perusing a magazine. Meanwhile, the super eight footage of the extraterrestrial is visible. On the coach, Overmyer hands Colonel Nelec some documentation, and the lads watch nervously from a detention cell at the rear of the coach. Something hits the side of the coach, jolting it onto two wheels, and it continues along the road for a brief distance before righting itself, though one of its tires bursts. The chauffeur brings the coach to a grinding stop on a remote path. Nelec hands a firearm to an uneasy-looking Overmyer, and the senior airman driving the coach hesitates before reluctantly opening the door. Outside it's pitch dark, and clutching the firearm, Overmyer cautiously makes his way along the aisle of the coach towards the open door. As he nears the door, Overmyer halts, and a tentacle reaches into the coach, seizing Overmyer and slamming him against the walls of the coach. The firearm discharges, striking the window of the lads' detention cell, and Overmyer is dragged outside. Martin retches as the senior airman restarts the coach's motor and it lurches into life. As he stomps on the accelerator, the coach is tipped onto its side."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jack gets back in the Jeep and, now on a main carriageway, unwittingly motors past Donnie, Joe, and the boys, who are driving back to town. A sharp right is taken by Donnie onto a rough track through the trees, and as it's getting dark, they arrive back into town, driving until Lillian Middle School is reached by them. Donnie is left in the car park by the boys, and a chain link fence is scrambled over by them, running to a storage trailer. A padlock on the trailer is pried by Joe with a tire iron, and it is opened by Martin to reveal papers and rolls of film inside. They break into a classroom, find a photo of him, and look at the footage. Scientists and military men examine the wreckage of something big. A tape is put in a player by Carrie, and on the film, a tentacle grabs Woodward. Suddenly, the boys are burst in on by Air Force soldiers. Sitting in the car, Donnie smokes a joint, oblivious of the military activity around him in the car park. The boys are marched by the soldiers into a corridor, where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack. Joe is eyed by Nelec, and Joe's mother's locket is found on him by Overmyer and taken. The boys are shepherded onto a bus in the car park by the soldiers, and sitting in his car, Donnie watches as they're driven away. He gets on his CB radio. Still in Air Force uniform, Jack makes his way through the evacuation center, and a boy recognizes him, finding Preston reading a magazine. Meanwhile, the super eight footage of the alien is present. On the bus, Colonel Nelec receives some paperwork from Overmyer, and the boys watch anxiously from a holding cell at the rear of the bus. Something hits the side of the bus, jolting it onto two wheels, and it continues along the road for a short way before righting itself, though one of its tires blows out. The driver brings the bus to a grinding halt on a remote road. A rifle is handed to an apprehensive-looking Overmyer by Nelec, and the senior airman driving the bus hesitates before reluctantly opening the door. Outside, it's pitch dark, and clutching the rifle, Overmyer cautiously makes his way along the aisle of the bus towards the open door. As the door is neared by him, Overmyer stops, and the bus is reached into by a tentacle, grabbing Overmyer and slapping him against the walls of the bus. The window of the boys' holding cell is hit by the rifle as it goes off, and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. The throttle is stamped on by him, and the bus is tipped onto its side."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jack gets back in the Jeep and unknowingly drives past Donnie, Joe, and the boys heading back to town. Donnie turns sharply onto a rough track through the trees. As darkness falls, they arrive at Lillian Middle School. The boys leave Donnie in the parking lot and climb a chain link fence to a storage trailer. Joe pries open a padlock with a tire iron, revealing papers and film. Inside a classroom, they find a photo and view footage of scientists and military examining large wreckage. Carrie plays a tape showing Woodward grabbed by a tentacle, and Air Force soldiers suddenly appear. In the parking lot, unaware of this, Donnie smokes a joint. Soldiers lead the boys down a corridor, where Colonel Nelec finds Carrie's explosives. Nelec notices Joe, and Overmyer takes Joe's mother's locket. Soldiers escort the boys onto a bus, and Donnie, in his car, observes them being driven away, then uses his CB radio. Meanwhile, Jack, in Air Force uniform, walks through the evacuation center, and a boy recognizes him. He spots Preston reading. On the bus, Overmyer gives Nelec paperwork as the boys watch from their holding cell. A hit jolts the bus onto two wheels before it rights itself, but a tire blows out. The driver halts it on a remote road. Nelec hands a nervous Overmyer a rifle. The airman driving hesitantly opens the door. Outside is pitch dark, and Overmyer cautiously approaches the open door. A tentacle grabs him, slamming him against the bus walls. The rifle discharges, hitting the boys' window, and Overmyer is dragged outside. Martin vomits as the airman restarts the bus, only for it to tip onto its side."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jack drives past Donnie, Joe, and the boys on the main road as they return to town. Donnie takes a sharp right onto a rough track, and in the dark, they reach Lillian Middle School. The boys leave Donnie in the parking lot, climb a fence, and run to a storage trailer. Joe pries open the padlock, and Martin reveals papers and film inside. They break into a classroom, find a photo and footage of scientists and military examining wreckage. Carrie plays a film showing Woodward grabbed by a tentacle. Air Force soldiers burst in, and Donnie, smoking in the car, is oblivious. Soldiers march the boys out, and Colonel Nelec finds Carrie's explosives in a sack. Nelec eyes Joe, and Overmyer takes Joe's mother's locket. Soldiers put the boys on a bus. Donnie sees this and uses his CB radio. In uniform, Jack goes through the evacuation center, finds Preston, and super eight footage of the alien. On the bus, Overmyer gives Nelec paperwork. The boys watch anxiously as something hits the bus, tipping it. The driver stops on a remote road. Nelec gives a rifle to Overmyer, who hesitantly opens the door. In the dark, Overmyer nears the door when a tentacle grabs and drags him out. The rifle fires, hitting the cell window. Martin vomits, and the bus is tipped onto its side as the airman restarts it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jack, having returned to his trusty Jeep, finds himself back on the main carriageway. Unbeknownst to him, he inadvertently drives past Donnie, Joe, and their group of friends, who are making their own journey back toward the bustling town. As Donnie navigates their vehicle, he abruptly veers onto a rugged and uneven track that winds its way through a dense cluster of trees. The dimming light of dusk envelops them as they finally arrive back in town, continuing their drive until they reach the familiar sight of Lillian Middle School. Upon reaching the school, the boys exit the vehicle, leaving Donnie behind in the car park. They clamber over a chain link fence with haste, making their way toward a seemingly innocuous storage trailer. Joe begins to forcibly pry at the trailer's padlock using a tire iron, and once Martin manages to open it, a cache of papers and rolls of film is revealed within.\n\nTheir intrigue piqued, they break into a nearby classroom, where they discover a photograph of him and begin scrutinizing the footage. The images on the film show scientists and military personnel meticulously examining the wreckage of an enormous object. Carrie, taking initiative, inserts a tape into a player, and the film depicts Woodward being seized by a menacing tentacle. Suddenly, a contingent of Air Force soldiers barges in on the unsuspecting boys. Meanwhile, in the car park, Donnie remains seated in the vehicle, casually smoking a joint, completely oblivious to the escalating military commotion occurring around him. The soldiers escort the boys into a corridor where they encounter Colonel Nelec, who spots Carrie's explosives tucked inside a rock sack. With a scrutinizing gaze, Nelec focuses on Joe, while Overmyer finds and confiscates Joe's mother's cherished locket. The soldiers then usher the boys onto a bus waiting in the car park, and from his vantage point in the car, Donnie observes as the bus drives away. He promptly picks up his CB radio.\n\nIn the meantime, still donned in his Air Force uniform, Jack makes his way through the increasingly busy evacuation center. There, a young boy recognizes him, and he soon finds Preston engrossed in a magazine. Concurrently, the super eight footage featuring the alien remains present. On the bus, Overmyer hands Colonel Nelec a set of paperwork, as the boys cast anxious glances from within the confines of a holding cell located at the bus's rear. Abruptly, something slams into the side of the bus, causing it to teeter precariously on two wheels for a short distance before regaining its balance, though a tire bursts in the process. Undeterred, the driver brings the vehicle to a grinding halt on a secluded stretch of road.\n\nNelec hands a rifle to Overmyer, who appears visibly apprehensive, and the senior airman at the wheel hesitantly opens the bus door. Outside, the night is pitch dark, and clenching the rifle tightly, Overmyer cautiously proceeds along the aisle toward the open door. Nearing the exit, Overmyer halts as a tentacle suddenly reaches into the bus, seizing him and slamming him forcefully against the bus walls. In the chaos, the rifle discharges, shattering the window of the boys' holding cell, and Overmyer is dragged outside. The distress causes Martin to vomit as the senior airman urgently restarts the bus's engine. The moment the engine roars back to life, he slams down on the throttle, only for the bus to tilt over onto its side in the ensuing turmoil."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jack, after making his return to his reliable and trusty Jeep, finds himself back on the main carriageway, the familiar road stretching out before him. Unbeknownst to Jack, he inadvertently drives past Donnie, Joe, and their group of friends, who are making their own journey back in the direction of the bustling town. As Donnie carefully navigates their vehicle, he suddenly turns sharply onto a rugged and uneven track that winds its way through a dense cluster of trees, the branches forming a canopy overhead. In the dimming light of dusk, the shadows stretch long and envelop them as they finally arrive back in town, continuing their drive until they reach the familiar sight of Lillian Middle School. Upon reaching the school, the boys make a swift exit from the vehicle, leaving Donnie behind in the quiet car park. They clamber over a chain-link fence with haste and urgency, making their way toward a seemingly innocuous storage trailer. Joe then begins to forcibly pry at the trailer's padlock using a tire iron, and once Martin manages to open it, a hidden cache of papers and rolls of film is revealed within.\n\nWith their curiosity thoroughly piqued, they decide to break into a nearby classroom, where they come across a photograph of him and begin scrutinizing the footage. The images on the film show scientists and military personnel meticulously examining the wreckage of an enormous object. Carrie, taking the initiative, inserts a tape into a player, and the film depicts Woodward being seized by a menacing tentacle. Suddenly, a contingent of Air Force soldiers barges into the room, surprising the unsuspecting boys. Meanwhile, back in the car park, Donnie remains seated in the vehicle, casually smoking a joint, completely oblivious to the escalating military commotion occurring all around him. The soldiers proceed to escort the boys into a nearby corridor, where they encounter Colonel Nelec, who quickly spots Carrie's explosives tucked inside a rock sack. With a scrutinizing and intense gaze, Nelec focuses on Joe, while Overmyer finds and confiscates Joe's mother's cherished locket. The soldiers then usher the boys onto a bus waiting in the car park, and from his vantage point in the car, Donnie observes as the bus drives away. He promptly picks up his CB radio, sensing the need to report or communicate the unfolding events.\n\nIn the meantime, still donned in his crisp Air Force uniform, Jack makes his way through the increasingly busy evacuation center. There, a young boy recognizes him, and he soon finds Preston engrossed in a magazine, seemingly oblivious to the unfolding chaos. Concurrently, the super eight footage featuring the alien remains present, adding to the sense of mystery. On the bus, Overmyer hands Colonel Nelec a set of paperwork, as the boys cast nervous and anxious glances from within the confines of a holding cell located at the bus's rear. Abruptly, something slams forcefully into the side of the bus, causing it to teeter precariously on two wheels for a short distance before finally regaining its balance, though a tire bursts in the process. Undeterred, the driver manages to bring the vehicle to a grinding halt on a secluded stretch of road, gravel crunching beneath the tires.\n\nNelec then hands a rifle to Overmyer, who appears visibly apprehensive, and the senior airman at the wheel hesitantly opens the bus door. Outside, the night is pitch dark, the sky an inky black curtain, and clenching the rifle tightly, Overmyer cautiously proceeds along the aisle toward the open door. Nearing the exit, Overmyer halts as a tentacle suddenly reaches into the bus, seizing him and slamming him forcefully against the bus walls. In the ensuing chaos, the rifle discharges, shattering the window of the boys' holding cell, and Overmyer is dragged outside. The distress causes Martin to vomit, his stomach churning, as the senior airman urgently restarts the bus's engine. The moment the engine roars back to life, he slams down on the throttle, only for the bus to tip over onto its side in the ensuing turmoil, the vehicle coming to a rest with a heavy thud."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jack settles himself back into the Jeep, adjusting his position for comfort and taking a moment to ensure the gear is set before smoothly merging onto the main carriageway. Unbeknownst to him, he drives past Donnie, Joe, and the boys, who are also making their way back to town. As they continue on their route, Donnie abruptly steers the vehicle to the right, maneuvering sharply onto a rough track lined with trees. The dimming light of dusk envelops them, and they soon find themselves back in town, persistently driving until they reach their destination at Lillian Middle School. Once there, they come to a halt in the car park, and the boys quickly spill out of the vehicle, leaving Donnie behind. They urgently scramble over the chain-link fence, racing across the grounds to reach a storage trailer. Joe steps forward with a tire iron, intent on prying the padlock, while Martin joins him, helping to open the trailer door wide to reveal a treasure trove of papers and rolls of film inside. Their mission advances as they break into a classroom, where they immediately spot a photo and begin examining the footage, revealing scientists and military personnel engrossed in the analysis of a massive wreckage. Carrie picks up a tape and places it into a player, letting the film unfold to show Woodward being seized by a tentacle. The atmosphere abruptly shatters as Air Force soldiers storm into the room, catching the boys off guard. Meanwhile, Donnie remains in the car park, blissfully unaware of the unfolding events, as he sits in the car, casually smoking a joint, oblivious to the military operation encircling him. The soldiers usher the boys into a corridor, where Colonel Nelec approaches with keen interest, discovering Carrie's explosives hidden in a rock sack. Nelec's gaze travels to Joe, who remains still as Overmyer retrieves Joe's mother's locket. The soldiers steer the boys toward the car park, directing them onto a waiting bus, while Donnie observes from his car, then decides to engage his CB radio, choosing to get involved in his way. Jack, still clad in his Air Force attire, navigates through the bustling evacuation center, where a boy's recognition momentarily pauses his progress, until he spots Preston absorbed in a magazine. Nearby, the super eight footage of the alien remains present, adding to the ominous undercurrents. Inside the bus, Overmyer dutifully hands Colonel Nelec some paperwork, though the boys, seated anxiously in a holding cell at the rear, remain on edge. Suddenly, a forceful impact against the side of the bus jolts it upwards, precariously tipping it onto two wheels before it manages to stabilize, although not without the price of a blown tire. The driver expertly brings the bus to a definitive halt on a deserted road, with remote stillness surrounding them. Nelec, with intense deliberation, hands a rifle to Overmyer, who appears uneasy but accepts it. The senior airman driving hesitates momentarily before resolving to open the bus door. Outside, enveloped by the deep darkness of night, Overmyer grips the rifle tightly as he cautiously makes his way along the aisle toward the open door. Just as he reaches it, Overmyer halts in his tracks, only to be met by a tentacle bursting into the bus, which quickly wraps around him, forcefully slamming him against the bus walls. The rifle discharges, shattering the window of the boys' holding cell, and Overmyer is violently yanked outside. The scene proves too much for Martin, who succumbs to nausea, while the senior airman, regaining his composure, restarts the bus's engine, causing it to lurch back into a fitful motion. As he attempts to accelerate, the bus is suddenly tipped over onto its side, bringing their journey to an abrupt, unnerving halt."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jack unknowingly drives past Donnie, Joe, and the boys on a main road as they head back to town. Donnie takes a rough track through the trees, and they reach Lillian Middle School at dusk. The boys leave Donnie in the parking lot, scale a chain-link fence, and run to a storage trailer. Joe pries open a padlock with a tire iron, and Martin reveals papers and rolls of film inside. They break into a classroom, find a photo of him, and review footage showing scientists and military personnel examining wreckage. Carrie plays a tape revealing Woodward being grabbed by a tentacle. Air Force soldiers suddenly burst in on the boys. In the parking lot, Donnie, unaware of the military presence, smokes a joint. The soldiers escort the boys to a corridor, where Colonel Nelec finds Carrie's explosives in a sack. Nelec notices Joe, and Overmyer confiscates Joe's mother's locket. The soldiers lead the boys to a bus in the parking lot, and Donnie observes them being driven away and uses his CB radio. Jack, in Air Force uniform, navigates through the evacuation center, where a boy recognizes him, and finds Preston reading a magazine, while the super eight footage of the alien is shown. On the bus, Overmyer gives paperwork to Colonel Nelec, and the boys anxiously watch from a holding cell. Something strikes the bus, tilting it onto two wheels before it rights itself, though a tire blows out. The driver brings the bus to a halt on a remote road. Nelec hands a rifle to Overmyer, who hesitantly approaches the open door. In darkness, Overmyer, clutching the rifle, cautiously moves along the aisle. Nearing the door, a tentacle grabs Overmyer, slams him against the bus walls, and drags him outside as his rifle discharges, hitting the holding cell window. Martin vomits as the senior airman restarts the bus, but as he accelerates, the bus is tipped over."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jack gets back in the Jeep, a rugged vehicle known for its off-road capabilities, and, now on a main carriageway that serves as a primary route through the area, unwittingly motors past Donnie, Joe, and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the dense forest surrounding the town, and as it's getting dark, they arrive back into town, driving until they reach Lillian Middle School, a local educational institution named after the town's founder. The boys leave Donnie in the dimly lit car park and scramble over a chain-link fence, running to a storage trailer, commonly used by schools for excess equipment storage. Joe begins prying a padlock on the trailer with a tire iron, a tool typically used for changing tires, and Martin opens it to reveal papers and rolls of film inside. These films are likely records of significant events captured on super eight cameras, popular in earlier decades for amateur filmmakers. They break into a classroom, where they find a photo of him and look at the footage. Scientists and military men, who are often involved in investigating unexplained phenomena, are seen examining the wreckage of something big. Carrie puts a tape in a player, and on the film, Woodward is grabbed by a tentacle, suggesting an encounter with an extraterrestrial entity. Suddenly, Air Force soldiers, part of a highly trained military branch, burst in on the boys. In the car park, Donnie sits in the car smoking a joint, oblivious of the military activity around him, a common trope highlighting a character's detachment from serious events. The soldiers march the boys into a corridor, where Colonel Nelec, a high-ranking officer known for his strict demeanor, approaches them and finds Carrie's explosives in a rock sack, an unusual place for such dangerous items. Nelec eyes Joe, and Overmyer finds Joe's mother's locket on him and takes it, a personal item that holds sentimental value for Joe. The soldiers shepherd the boys onto a bus in the car park, and sitting in his car, Donnie watches as they're driven away, not fully understanding the gravity of the situation. He gets on his CB radio, a communication device often used by truckers and hobbyists. Still in Air Force uniform, Jack makes his way through the evacuation center, a temporary facility set up during emergencies, where a boy recognizes him, and he finds Preston reading a magazine, perhaps an attempt to distract himself from the chaos. Meanwhile, the super eight footage of the alien is present, providing rare visual evidence of the encounter. On the bus, Overmyer hands Colonel Nelec some paperwork, likely related to the investigation, and the boys watch anxiously from a holding cell at the rear of the bus. Something hits the side of the bus, jolting it onto two wheels, and it continues along the road for a short way before righting itself, though one of its tires blows out, indicating a severe impact. The driver brings the bus to a grinding halt on a remote road, where few would venture at night. Nelec hands a rifle to an apprehensive-looking Overmyer, highlighting the escalating danger, and the senior airman driving the bus hesitates before reluctantly opening the door to face whatever is outside. Outside it's pitch dark, and clutching the rifle, Overmyer cautiously makes his way along the aisle of the bus towards the open door. As he nears the door, Overmyer stops, and a tentacle reaches into the bus, grabbing Overmyer and slapping him against the walls of the bus with immense force. The rifle goes off, hitting the window of the boys' holding cell, and Overmyer is dragged outside, illustrating the creature's power. Martin vomits, overwhelmed by the terror and chaos, as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle, determined to escape, the bus is tipped onto its side by the unknown attacker."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School. The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer. Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside. They break into a classroom where they find a photo of him and look at the footage. Scientists and military men are seen examining the wreckage of something big. Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle. Suddenly Air Force soldiers burst in on the boys. In the car park Donnie sits in the car smoking a joint oblivious of the military activity around him. The soldiers march the boys into a corridor where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack. Nelec eyes Joe and Overmyer finds Joe's mother's locket on him and takes it. The soldiers shepherd the boys onto a bus in the car park and sitting in his car. Donnie watches as they are driven away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He gets on his CB radio. Still in Air Force uniform Jack makes his way through the evacuation center where a boy recognizes him and he finds Preston reading a magazine. Meanwhile the super eight footage of the alien is present. On the bus Overmyer hands Colonel Nelec some paperwork and the boys watch anxiously from a holding cell at the rear of the bus. Something hits the side of the bus jolting it onto two wheels and it continues along the road for a short way before righting itself though one of its tires blows out. The driver brings the bus to a grinding halt on a remote road. Nelec hands a rifle to an apprehensivelooking Overmyer and the senior airman driving the bus hesitates before reluctantly opening the door. Outside it is pitch dark and clutching the rifle. Overmyer cautiously makes his way along the aisle of the bus towards the open door. As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus. The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle the bus is tipped onto its side."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School. The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer. Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside. They break into a classroom where they find a photo of him and look at the footage. Scientists and military men are seen examining the wreckage of something big. Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle. Suddenly Air Force soldiers burst in on the boys. In the car park Donnie sits in the car smoking a joint oblivious of the military activity around him. The soldiers march the boys into a corridor where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack. Nelec eyes Joe and Overmyer finds Joe's mother's locket on him and takes it. The soldiers shepherd the boys onto a bus in the car park and sitting in his car. Donnie watches as they are driven away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He gets on his CB radio. Still in Air Force uniform Jack makes his way through the evacuation center where a boy recognizes him and he finds Preston reading a magazine. Meanwhile the super eight footage of the alien is present. On the bus Overmyer hands Colonel Nelec some paperwork and the boys watch anxiously from a holding cell at the rear of the bus. Something hits the side of the bus jolting it onto two wheels and it continues along the road for a short way before righting itself though one of its tires blows out. The driver brings the bus to a grinding halt on a remote road. Nelec hands a rifle to an apprehensivelooking Overmyer and the senior airman driving the bus hesitates before reluctantly opening the door. Outside it is pitch dark and clutching the rifle. Overmyer cautiously makes his way along the aisle of the bus towards the open door. As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus. The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle the bus is tipped onto its side."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School. The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer. Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside. They break into a classroom where they find a photo of him and look at the footage. Scientists and military men are seen examining the wreckage of something big. Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle. Outside it is pitch dark and clutching the rifle. Overmyer cautiously makes his way along the aisle of the bus towards the open door. As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus. The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle the bus is tipped onto its side."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town. Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School. The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer. The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside. Martin vomits as the senior airman restarts the bus's engine and it lurches into life. As he stamps on the throttle the bus is tipped onto its side."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Bob slides into the canoe and, now on a rural river, unknowingly sails past Sally, Fred, and the mice who are paddling back to the city. Sally veers left onto a slippery slope through the bushes, and as it's nearing dawn, they glide back into the city, gliding until they reach Maple Elementary School. The mice leave Sally in the picnic area and crawl under a rope bridge, sprinting to a storage barn. Fred starts yanking at a doorknob on the barn with a crowbar, and Alex unseals it to unveil boxes and stacks of cloth inside. They sneak into a gymnasium, where they discover a sketch of her and gaze at the drawings. Astronomers and fishermen are spotted analyzing the remains of something massive. Lucy puts a record in a player, and on the images, Wilson is bitten by a claw. Suddenly, Navy sailors burst in on the mice. In the picnic area, Sally lies in the hammock knitting a scarf, unaware of the sailor operations nearby. The sailors herd the mice into a tunnel, where Commander Blake approaches them and discovers Lucy's fireworks in a burlap bag. Blake observes Fred, and Thompson uncovers Fred's father's compass on him and pockets it. The sailors usher the mice onto a train in the picnic area, and lounging in her hammock, Sally observes as they're carried away. She climbs onto her CB radio. Still in sailor attire, Bob strolls through the relocation center, where a cat identifies him, and he encounters Toby painting a sketch. Meanwhile, the super eight film of the monster is visible. On the train, Thompson hands Commander Blake some sketches, and the mice observe nervously from a storage crate at the back of the train. Something slams the side of the train, tilting it onto two tracks, and it proceeds along the rails for a short distance before stabilizing itself, though one of its axles snaps. The operator halts the train with a screech on a deserted track. Blake hands a slingshot to a nervous Thompson, and the senior sailor steering the train pauses before hesitantly unlocking the gate. Outside it's moonless and clutching the slingshot, Thompson gingerly advances along the aisle of the train towards the open gate. As he approaches the gate, Thompson halts, and a claw reaches into the train, seizing Thompson and bouncing him against the ceilings of the train. The slingshot discharges, hitting the glass of the mice's storage crate, and Thompson is yanked outside. Alex retches as the senior sailor reignites the train's engine and it jolts into motion. As he presses on the pedal, the train is shoved onto its roof."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack unknowingly drives past Donnie, Joe, and the boys as they head back to town, eventually reaching Lillian Middle School. The boys sneak to a storage trailer, break in, and find papers and film. Inside a classroom, they view footage showing scientists and military examining a wreckage and Woodward being grabbed by a tentacle. Suddenly, Air Force soldiers capture the boys, while Donnie remains unaware in the parking lot. Colonel Nelec finds Carrie's explosives and Joe's mother's locket. The soldiers load the boys onto a bus, which Donnie observes before contacting someone via CB radio. Meanwhile, Jack navigates an evacuation center and notices the alien footage. On the bus, after Nelec receives paperwork, a tentacle attacks, sending the bus onto two wheels before a tire blows out. The driver halts on a remote road, and Overmyer exits with a rifle but is grabbed by a tentacle. The chaos causes a shot to shatter the boys' cell window. Martin vomits, and the bus is tipped onto its side as the airman restarts it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As he stamps on the throttle the bus is tipped onto its side Martin vomits as the senior airman restarts the bus's engine and it lurches into life The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus Overmyer cautiously makes his way along the aisle of the bus towards the open door Outside it is pitch dark and clutching the rifle Nelec hands a rifle to an apprehensivelooking Overmyer and the senior airman driving the bus hesitates before reluctantly opening the door The driver brings the bus to a grinding halt on a remote road Something hits the side of the bus jolting it onto two wheels and it continues along the road for a short way before righting itself though one of its tires blows out On the bus Overmyer hands Colonel Nelec some paperwork and the boys watch anxiously from a holding cell at the rear of the bus Meanwhile the super eight footage of the alien is present Still in Air Force uniform Jack makes his way through the evacuation center where a boy recognizes him and he finds Preston reading a magazine He gets on his CB radio Donnie watches as they are driven away The soldiers shepherd the boys onto a bus in the car park and sitting in his car Nelec eyes Joe and Overmyer finds Joe's mother's locket on him and takes it The soldiers march the boys into a corridor where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack In the car park Donnie sits in the car smoking a joint oblivious of the military activity around him Suddenly Air Force soldiers burst in on the boys Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle Scientists and military men are seen examining the wreckage of something big They break into a classroom where they find a photo of him and look at the footage Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer Scientists and military men are seen examining the wreckage of something big They break into a classroom where they find a photo of him and look at the footage Suddenly Air Force soldiers burst in on the boys Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle The soldiers march the boys into a corridor where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack In the car park Donnie sits in the car smoking a joint oblivious of the military activity around him The soldiers shepherd the boys onto a bus in the car park and sitting in his car Nelec eyes Joe and Overmyer finds Joe's mother's locket on him and takes it He gets on his CB radio Donnie watches as they are driven away Meanwhile the super eight footage of the alien is present Still in Air Force uniform Jack makes his way through the evacuation center where a boy recognizes him and he finds Preston reading a magazine Something hits the side of the bus jolting it onto two wheels and it continues along the road for a short way before righting itself though one of its tires blows out On the bus Overmyer hands Colonel Nelec some paperwork and the boys watch anxiously from a holding cell at the rear of the bus Nelec hands a rifle to an apprehensivelooking Overmyer and the senior airman driving the bus hesitates before reluctantly opening the door The driver brings the bus to a grinding halt on a remote road Overmyer cautiously makes his way along the aisle of the bus towards the open door Outside it is pitch dark and clutching the rifle The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus As he stamps on the throttle the bus is tipped onto its side Martin vomits as the senior airman restarts the bus's engine and it lurches into life"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He gets on his CB radio Still in Air Force uniform Jack makes his way through the evacuation center where a boy recognizes him and he finds Preston reading a magazine Meanwhile the super eight footage of the alien is present On the bus Overmyer hands Colonel Nelec some paperwork and the boys watch anxiously from a holding cell at the rear of the bus Something hits the side of the bus jolting it onto two wheels and it continues along the road for a short way before righting itself though one of its tires blows out The driver brings the bus to a grinding halt on a remote road Nelec hands a rifle to an apprehensivelooking Overmyer and the senior airman driving the bus hesitates before reluctantly opening the door Outside it is pitch dark and clutching the rifle Overmyer cautiously makes his way along the aisle of the bus towards the open door As he nears the door Overmyer stops and a tentacle reaches into the bus grabbing Overmyer and slapping him against the walls of the bus The rifle goes off hitting the window of the boys' holding cell and Overmyer is dragged outside Martin vomits as the senior airman restarts the bus's engine and it lurches into life As he stamps on the throttle the bus is tipped onto its side Jack gets back in the Jeep and now on a main carriageway unwittingly motors past Donnie Joe and the boys who are driving back to town Donnie takes a sharp right onto a rough track through the trees and as it is getting dark they arrive back into town driving until they reach Lillian Middle School The boys leave Donnie in the car park and scramble over a chain link fence running to a storage trailer Joe begins prying a padlock on the trailer with a tire iron and Martin opens it to reveal papers and rolls of film inside They break into a classroom where they find a photo of him and look at the footage Scientists and military men are seen examining the wreckage of something big Carrie puts a tape in a player and on the film Woodward is grabbed by a tentacle Suddenly Air Force soldiers burst in on the boys In the car park Donnie sits in the car smoking a joint oblivious of the military activity around him The soldiers march the boys into a corridor where Colonel Nelec approaches them and finds Carrie's explosives in a rock sack Nelec eyes Joe and Overmyer finds Joe's mother's locket on him and takes it The soldiers shepherd the boys onto a bus in the car park and sitting in his car Donnie watches as they are driven away"
        }
      ]
    }
  ]
}