{
  "ground_truth": "David watches her with a mesmerized expression, as Elise wraps her arms around a male dancer's necks and he lifts her. As they rotate together, Elise spreads her legs gracefully. The dancer sets her down, then lifts her by the waist. Two others join him, taking Elise's hands as the center dancer lowers her, then raises her again. Thompson steps up behind David. Turning, David glares at him. David gives him a sidelong look. Thompson's eyes remain on the dancers. David glances at the stage. David's brow creases. He looks squarely at Thompson, but the adjustment officer's gaze remains on the performance. David returns his eyes to the stage, where a dancer tosses Elise into the arms of another. She extends her arms and legs as he spins her. Thompson steps away, his eyes still focused on the dancers. With a puzzled frown, David watches the adjustment officer stop in the studio's doorway. Thompson gazes at the performance, and David follows his eyes back to the stage. Elise bends forward, sweeping her legs straight up into the air behind her. As a male dancer tosses her, Thompson gives a nod and Elise falls. Her face contorts in pain. As David rushes toward the stage, a male dancer picks Elise up and carries her off the platform. He scurries out of the studio with David jogging after them. Thompson turns away from the scene, his face pinched, and strolls through a doorway. Later, Elise rests her head on David's shoulder as they ride in the back of a cab. They pull up to a hospital, and David carries Elise inside. Now still in costume, Elise wears a protective lead apron around her waist as she lies on an X-ray table. An X-ray machine hovers above her feet, aligning a cross-haired light pattern with her ankle. Meanwhile, David sits in a waiting room, his head bowed and his eyes closed. He massages the bridge of his nose with his fingers. Thompson appears in front of him. David punches him in the face. As Thompson stumbles back, two men in the waiting room rise, their eyes on David. Thompson straightens his fedora. Meanwhile, a doctor checks X-rays. With a stern look, Thompson turns away. As he leaves, he tips his hat at one of the men in the waiting room. David stares after him, his chest heaving. He lowers himself back into his chair and bows his head. Later, he stands beside Elise's bed in the emergency room. He touches her bandaged ankle, which rests on two pillows. He wraps his arms around her, squeezing his eyes shut as they hug. With a woeful expression, he opens his eyes and shifts them thoughtfully.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David observes her with a transfixed demeanor, as Elise enfolds her limbs around a male performer's neck and he elevates her. As they revolve together, Elise extends her legs elegantly. The performer places her down, then hoists her by the torso. Two others join him, grasping Elise's hands as the central performer lowers her, then elevates her anew. Thompson advances behind David. Revolving, David scowls at him. David casts him an indirect glance. Thompson's gaze remains on the performers. David peers at the stage. David's brow furrows. He looks directly at Thompson, but the adjustment officer's stare remains on the exhibition. David redirects his gaze to the stage, where a performer flings Elise into the embrace of another. She stretches her arms and legs as he twirls her. Thompson withdraws, his gaze still concentrated on the performers. With a bewildered grimace, David observes the adjustment officer pause in the studio's threshold. Thompson watches the exhibition, and David follows his gaze back to the stage. Elise inclines forward, sweeping her legs straight upward into the air behind her. As a male performer flings her, Thompson gives a nod and Elise descends. Her visage contorts in agony. As David dashes toward the stage, a male performer picks Elise up and conveys her off the platform. He hurries out of the studio with David trotting after them. Thompson turns away from the spectacle, his visage pinched, and saunters through an entryway. Later, Elise rests her head on David's shoulder as they ride in the rear of a taxi. They arrive at a hospital, and David carries Elise inside. Now still in attire, Elise wears a protective lead apron around her torso as she reclines on an X-ray table. An X-ray device hovers above her feet, aligning a cross-haired light pattern with her ankle. Meanwhile, David sits in a waiting room, his head bowed and his eyes shut. He kneads the bridge of his nose with his digits. Thompson materializes in front of him. David strikes him in the visage. As Thompson reels back, two men in the waiting room rise, their gaze on David. Thompson straightens his fedora. Meanwhile, a physician examines X-rays. With a severe look, Thompson turns away. As he departs, he tips his hat at one of the men in the waiting room. David gazes after him, his chest heaving. He lowers himself back into his chair and bows his head. Later, he stands beside Elise's bed in the emergency room. He touches her bandaged ankle, which rests on two cushions. He envelops his arms around her, squeezing his eyes shut as they embrace. With a sorrowful expression, he opens his eyes and shifts them pensively."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Her mesmerized expression was watched by David, as a male dancer's necks were wrapped around by Elise's arms and she was lifted by him. As they were rotated together, her legs were spread gracefully by Elise. She was set down by the dancer, then she was lifted by the waist. He was joined by two others, taking her hands as the center dancer lowered her, then raised her again. Behind David, Thompson steps up. Turning, a glare was given to him by David. A sidelong look is given to Thompson by David. The dancers remain in Thompson's eyes. At the stage, David glances. His brow creases. Thompson's gaze remains on the performance, though he is looked at squarely by David. His eyes return to the stage, where Elise is tossed into the arms of another dancer by a dancer. Her arms and legs are extended as she is spun. Away steps Thompson, still focused on the dancers. With a puzzled frown, the adjustment officer is watched by David as he stops in the studio's doorway. At the performance, Thompson gazes, and his eyes are followed back to the stage by David. Forward bends Elise, sweeping up into the air behind her are her legs. As she is tossed by a male dancer, a nod is given by Thompson and she falls. Her face contorts in pain. Toward the stage, David rushes, and Elise is picked up and carried off the platform by a male dancer. Out of the studio, he scurries with David jogging after them. Away from the scene, Thompson turns, his face pinched, and a doorway is strolled through by him. Later, on David's shoulder, her head rests as they are in the back of a cab. They are pulled up to a hospital, and Elise is carried inside by David. Now still in costume, around her waist, a protective lead apron is worn by Elise as she lies on an X-ray table. Above her feet, an X-ray machine hovers, with her ankle an aligning cross-haired light pattern. Meanwhile, in a waiting room, his head is bowed, and his eyes are closed by David. The bridge of his nose is massaged with his fingers. In front of him, Thompson appears. He punches Thompson in the face. As he stumbles back, two men rise in the waiting room, their eyes on David. His fedora is straightened by Thompson. Meanwhile, X-rays are checked by a doctor. Sternly, Thompson turns away. As he leaves, his hat is tipped at one of the men in the waiting room. After him, David stares, his chest heaving. Back into his chair, he lowers himself and his head is bowed. Later, beside Elise's bed in the emergency room, he stands. Her bandaged ankle is touched by him, resting on two pillows. Her is wrapped around by his arms, squeezing his eyes shut as they hug. With an expression woeful, his eyes are opened and thoughtfully shifted by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David watches mesmerized as Elise wraps her arms around a male dancer's neck, and he lifts her. As they rotate, Elise spreads her legs gracefully. The dancer sets her down, then lifts her by the waist. Two others join, taking Elise's hands as the center dancer lowers and raises her again. Thompson steps behind David, who glares at him. David glances at the stage, his brow creasing, but Thompson's gaze remains on the performance. A dancer tosses Elise to another, who spins her. Thompson steps away, still focused on the dancers. Puzzled, David watches Thompson stop in the doorway. Elise bends forward, sweeping her legs up. As a dancer tosses her, Thompson nods, and Elise falls, her face contorted in pain. David rushes to the stage as a dancer carries Elise off. He follows them out of the studio. Thompson turns away, his face pinched, and exits. Later, Elise rests her head on David's shoulder in a cab. They arrive at a hospital, and David carries her inside. Elise, still in costume, lies on an X-ray table with a protective apron around her waist. An X-ray machine aligns a light pattern with her ankle. David sits in the waiting room, head bowed, eyes closed, massaging his nose. Thompson appears, and David punches him. As Thompson stumbles, two men rise, watching David. Thompson straightens his fedora and leaves, tipping his hat at one man. David stares after him, chest heaving, then sits and bows his head. Later, he stands by Elise's bed in the emergency room, touching her bandaged ankle. He hugs her tightly, eyes shut, then opens them with a woeful expression."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David watches mesmerized as Elise wraps her arms around a dancer's neck, who lifts her. As they rotate, Elise spreads her legs gracefully. The dancer sets her down, lifts her by the waist, and two others join, taking her hands. Thompson steps behind David, who glares at him. David glances at the stage, his brow creasing, but Thompson's gaze remains on the performance. A dancer tosses Elise to another, who spins her. Thompson steps away, still focused on the dancers. David watches Thompson stop in the doorway, puzzled. Elise bends forward, legs up, and a dancer tosses her. Thompson nods as Elise falls, her face contorted in pain. David rushes to the stage as a dancer carries Elise off. David follows them out, while Thompson turns away, pinched-faced. Later, Elise rests on David's shoulder in a cab to the hospital. David carries her inside, where she lies on an X-ray table, a lead apron around her waist. David waits, head bowed, eyes closed, massaging his nose. Thompson appears, and David punches him. Two men rise, watching. Thompson straightens his fedora, and a doctor checks X-rays. Thompson leaves, tipping his hat. David stares after him, chest heaving, then sits, head bowed. Later, he stands by Elise's bed, touching her bandaged ankle. He hugs her, eyes shut, then opens them woefully, shifting his gaze thoughtfully."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David watches her with a mesmerized expression, his eyes fixed intently on Elise as she gracefully wraps her arms around the necks of a male dancer. With a fluid motion, he lifts her effortlessly. As they rotate together in perfect harmony, Elise spreads her legs with an elegant grace. The dancer gently sets her down, only to lift her again, this time by the waist. Two other dancers join him, taking Elise's hands as the central dancer lowers her gracefully, then raises her once more. Thompson steps up quietly behind David. Turning sharply, David glares at him with a piercing look. David gives him a sidelong glance, but Thompson's eyes remain steadfastly on the dancers. David shifts his gaze back to the stage, his brow creasing with concern. He looks squarely at Thompson, but the adjustment officer's unwavering gaze remains fixed on the performance. David returns his eyes to the stage, where a dancer skillfully tosses Elise into the waiting arms of another. She extends her arms and legs beautifully as he spins her around. Thompson steps away, his eyes still focused intently on the dancers. With a puzzled frown, David watches the adjustment officer stop in the studio's doorway. Thompson continues to gaze at the performance, and David follows his eyes back to the stage. Elise bends forward, sweeping her legs straight up into the air behind her with precision. As a male dancer tosses her, Thompson gives a subtle nod, and Elise falls. Her face contorts in pain. As David rushes toward the stage, a male dancer quickly picks Elise up and carries her off the platform. He scurries out of the studio with David jogging closely after them. Thompson turns away from the scene, his face pinched with emotion, and strolls through a doorway. Later, Elise rests her head gently on David's shoulder as they ride in the back of a cab. They pull up to a hospital, and David carefully carries Elise inside. Now still in costume, Elise wears a protective lead apron around her waist as she lies on an X-ray table. An X-ray machine hovers above her feet, aligning a cross-haired light pattern precisely with her injured ankle. Meanwhile, David sits in a waiting room, his head bowed and his eyes closed in deep thought. He massages the bridge of his nose with his fingers, trying to ease his tension. Thompson appears in front of him unexpectedly. David, filled with anger, punches him in the face. As Thompson stumbles back, two men in the waiting room rise, their eyes fixed on David. Thompson straightens his fedora with a composed demeanor. Meanwhile, a doctor checks the X-rays with a focused expression. With a stern look, Thompson turns away. As he leaves, he tips his hat at one of the men in the waiting room. David stares after him, his chest heaving with emotion. He lowers himself back into his chair and bows his head in contemplation. Later, he stands beside Elise's bed in the emergency room. He gently touches her bandaged ankle, which rests on two pillows for support. He wraps his arms around her, squeezing his eyes shut as they embrace. With a woeful expression, he opens his eyes and shifts them thoughtfully, lost in his own reflections."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David, with a mesmerized expression etched on his face, watches her intently. His eyes are riveted to Elise as she caresses the necks of a male dancer with her graceful arms. With a smooth and fluid motion, he lifts her effortlessly into the air. As they rotate together in perfect, synchronized harmony, Elise spreads her legs with elegant grace. The dancer gently sets her back down, only to once again lift her, this time by her waist. Two other dancers join in, taking Elise's hands as the central dancer lowers her gracefully, then raises her up once more. Thompson quietly steps up behind David. As if sensing his presence, David turns sharply, shooting him a piercing glare. Though David gives him a sidelong glance, Thompson's eyes remain steadfastly focused on the dancers. David shifts his gaze back to the stage, his brow furrowed with concern. He looks squarely at Thompson, yet the adjustment officer's unwavering gaze stays fixed on the unfolding performance. David turns his eyes back to the stage, where a dancer skillfully tosses Elise into another's waiting arms. She extends her arms and legs beautifully as he spins her around with practiced precision. Thompson steps away, his eyes still intently focused on the dancers. With a puzzled frown, David watches the adjustment officer pause in the studio's doorway. Thompson continues to gaze at the performance, and David, compelled by curiosity, follows his eyes back to the stage. Elise bends forward, sweeping her legs straight up into the air behind her with precise movement. As a male dancer tosses her, Thompson gives a subtle nod, and Elise suddenly falls. Her face twists with pain. David, overwhelmed with concern, rushes toward the stage as a male dancer quickly picks Elise up and carries her off the platform. He scurries out of the studio with David jogging closely after them. Thompson turns away from the scene, his face pinched with emotion, and strolls calmly through a doorway. Later, Elise rests her head gently on David's shoulder as they ride in the back of a cab. They arrive at a hospital, and David carries Elise inside with utmost care. Still in costume, Elise now wears a protective lead apron around her waist as she lies on an X-ray table. An X-ray machine hovers above her feet, aligning a cross-haired light pattern precisely with her injured ankle. Meanwhile, David sits quietly in a waiting room, his head bowed and his eyes closed in deep thought. He massages the bridge of his nose with his fingers, attempting to ease the tension building within him. Thompson appears unexpectedly in front of him. Filled with anger, David impulsively punches him in the face. As Thompson stumbles back, two men in the waiting room rise, their eyes fixed on David with surprise. Thompson straightens his fedora with a calm demeanor. Meanwhile, a doctor examines the X-rays with a focused expression. With a stern look, Thompson turns away, and as he leaves, he tips his hat at one of the men in the waiting room. David stares after him, his chest heaving with emotion. He lowers himself back into his chair, bowing his head in contemplative thought. Later, he stands beside Elise's bed in the emergency room. With gentle care, he touches her bandaged ankle, which rests on two pillows for support. He wraps his arms around her, squeezing his eyes shut as they embrace. With a woeful expression, he opens his eyes and shifts them thoughtfully, lost in his own introspective reflections."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David watches her with a mesmerized expression, his eyes fixed on Elise as she gracefully wraps her arms around a male dancer's neck, allowing him to lift her effortlessly. As they begin to rotate together, Elise elegantly spreads her legs, creating a captivating visual. The dancer then gently sets her down before lifting her again, this time by the waist, showcasing their seamless coordination. Two other dancers join in, each taking one of Elise's hands as the central dancer lowers her gracefully, only to raise her once more in a fluid motion. Meanwhile, Thompson steps up behind David, prompting David to turn and glare at him with a sidelong look, though Thompson's eyes remain glued to the dancers on stage. David's gaze shifts back to the stage, his brow creasing with concern as he looks squarely at Thompson, but the adjustment officer's focus remains unwavering on the performance. David returns his attention to the stage just in time to see a dancer toss Elise into the arms of another, where she extends her arms and legs beautifully as he spins her around. Thompson steps away, his eyes still locked on the dancers, leaving David with a puzzled frown as he watches the adjustment officer stop in the studio's doorway. Thompson continues to gaze at the performance, and David follows his line of sight back to the stage, where Elise bends forward, sweeping her legs straight up into the air behind her. As a male dancer tosses her, Thompson gives a nod, and Elise falls, her face contorting in pain. David immediately rushes toward the stage, his heart racing, as a male dancer quickly picks Elise up and carries her off the platform. David scurries out of the studio, jogging after them with urgency. Thompson, his face pinched with emotion, turns away from the scene and strolls through a doorway. Later, in the back of a cab, Elise rests her head on David's shoulder, seeking comfort as they pull up to a hospital. David carefully carries Elise inside, her costume still on, and she is soon lying on an X-ray table with a protective lead apron around her waist. An X-ray machine hovers above her feet, aligning a cross-haired light pattern with her injured ankle. Meanwhile, David sits in the waiting room, his head bowed and eyes closed, massaging the bridge of his nose with his fingers in an attempt to relieve his stress. Thompson appears in front of him, and without hesitation, David punches him in the face. As Thompson stumbles back, two men in the waiting room rise, their eyes fixed on David. Thompson straightens his fedora with composure, while a doctor checks the X-rays. With a stern look, Thompson turns away, tipping his hat at one of the men in the waiting room as he leaves. David stares after him, his chest heaving with emotion, before lowering himself back into his chair and bowing his head in contemplation. Later, he stands beside Elise's bed in the emergency room, gently touching her bandaged ankle, which rests on two pillows for support. He wraps his arms around her, squeezing his eyes shut as they embrace, and with a woeful expression, he opens his eyes, shifting them thoughtfully as he processes the events that have unfolded."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David watches mesmerized as Elise performs with a male dancer, who lifts and rotates her gracefully. As the dance continues, two more dancers join, assisting in her movements. Thompson approaches David, who briefly glares at him before returning his focus to the stage. Despite David's attempts to engage, Thompson remains fixated on the performance. The dance intensifies, culminating in Elise being tossed and falling painfully. David rushes to the stage as a dancer carries Elise off, with David following closely. Thompson, unfazed, exits through a doorway. Later, in a cab, Elise rests on David's shoulder as they head to a hospital. There, Elise, still in costume, undergoes an X-ray for her injured ankle. Meanwhile, David waits anxiously, massaging his nose. When Thompson appears, David punches him, causing a stir in the waiting room. Thompson adjusts his fedora and leaves after acknowledging another man. David, breathing heavily, returns to his seat. Later, he stands by Elise's hospital bed, gently touching her bandaged ankle. They embrace tightly, and David, with a woeful expression, opens his eyes and gazes thoughtfully."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David watches her with a mesmerized expression, as Elise, a principal dancer with the renowned city ballet company, wraps her arms around a male dancer's neck and he lifts her. As they rotate together, Elise spreads her legs gracefully, a move known as a grand jeté. The dancer sets her down, then lifts her by the waist, showcasing their strength and coordination. Two others join him, taking Elise's hands as the center dancer lowers her, then raises her again, performing an intricate lift sequence. Thompson, a stoic adjustment officer responsible for overseeing performers' adherence to safety protocols, steps up behind David. Turning, David glares at him, aware of Thompson’s role in monitoring the production. David gives him a sidelong look. Thompson's eyes remain on the dancers, scrutinizing their every move. David glances at the stage, a historic venue renowned for its acoustics and grandeur. David's brow creases. He looks squarely at Thompson, but the adjustment officer's gaze remains on the performance, unfazed by David's attention. David returns his eyes to the stage, where a dancer tosses Elise into the arms of another, a daring maneuver that requires precise timing. She extends her arms and legs as he spins her, creating a mesmerizing spectacle. Thompson steps away, his eyes still focused on the dancers. With a puzzled frown, David watches the adjustment officer stop in the studio's doorway. Thompson gazes at the performance, and David follows his eyes back to the stage. Elise bends forward, sweeping her legs straight up into the air behind her in a fluid arabesque. As a male dancer tosses her, Thompson gives a nod, signaling approval despite the risky move, and Elise falls. Her face contorts in pain, indicating a potential injury. As David rushes toward the stage, a male dancer picks Elise up and carries her off the platform, navigating through the backstage area. He scurries out of the studio with David jogging after them. Thompson turns away from the scene, his face pinched, and strolls through a doorway, a known exit leading to the administrative offices. Later, Elise rests her head on David's shoulder as they ride in the back of a cab en route to the nearest hospital. They pull up to a hospital, and David carries Elise inside, her costume drawing curious glances. Now still in costume, Elise wears a protective lead apron around her waist as she lies on an X-ray table in the radiology department, crucial for diagnosing her injury. An X-ray machine hovers above her feet, aligning a cross-haired light pattern with her ankle, which suspected to be fractured during the performance. Meanwhile, David sits in a waiting room, his head bowed and his eyes closed, overwhelmed by concern. He massages the bridge of his nose with his fingers. Thompson appears in front of him unexpectedly. David punches him in the face, fueled by frustration and blame. As Thompson stumbles back, two men in the waiting room rise, their eyes on David, ready to intervene. Thompson straightens his fedora, a signature accessory of his, maintaining his composure. Meanwhile, a doctor checks X-rays, preparing to discuss the findings. With a stern look, Thompson turns away, perhaps realizing the gravity of the situation. As he leaves, he tips his hat at one of the men in the waiting room, acknowledging their silent support. David stares after him, his chest heaving with mixed emotions. He lowers himself back into his chair and bows his head, feeling the weight of the evening’s events. Later, he stands beside Elise's bed in the emergency room, anxiously waiting for news. He touches her bandaged ankle, which rests on two pillows for elevation, crucial for reducing swelling. He wraps his arms around her, squeezing his eyes shut as they hug, sharing a moment of intimacy amidst the chaos. With a woeful expression, he opens his eyes and shifts them thoughtfully, contemplating the repercussions of the injury on Elise's promising career."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her. As they rotate together Elise spreads her legs gracefully. The dancer sets her down then lifts her by the waist. Two others join him taking Elise's hands as the center dancer lowers her then raises her again. Thompson steps up behind David. Turning David glares at him. David gives him a sidelong look. Thompson's eyes remain on the dancers. David glances at the stage. David's brow creases. He looks squarely at Thompson but the adjustment officer's gaze remains on the performance. David returns his eyes to the stage where a dancer tosses Elise into the arms of another. She extends her arms and legs as he spins her. Thompson steps away his eyes still focused on the dancers. With a puzzled frown David watches the adjustment officer stop in the studio's doorway. Thompson gazes at the performance and David follows his eyes back to the stage. Elise bends forward sweeping her legs straight up into the air behind her. As a male dancer tosses her Thompson gives a nod and Elise falls. Her face contorts in pain. As David rushes toward the stage a male dancer picks Elise up and carries her off the platform. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He scurries out of the studio with David jogging after them. Thompson turns away from the scene his face pinched and strolls through a doorway. Later Elise rests her head on David's shoulder as they ride in the back of a cab. They pull up to a hospital and David carries Elise inside. Now still in costume Elise wears a protective lead apron around her waist as she lies on an Xray table. An Xray machine hovers above her feet aligning a crosshaired light pattern with her ankle. Meanwhile David sits in a waiting room his head bowed and his eyes closed. He massages the bridge of his nose with his fingers. Thompson appears in front of him. David punches him in the face. As Thompson stumbles back two men in the waiting room rise their eyes on David. Thompson straightens his fedora. Meanwhile a doctor checks Xrays. With a stern look Thompson turns away. As he leaves he tips his hat at one of the men in the waiting room. David stares after him his chest heaving. He lowers himself back into his chair and bows his head. Later he stands beside Elise's bed in the emergency room. He touches her bandaged ankle which rests on two pillows. He wraps his arms around her squeezing his eyes shut as they hug. With a woeful expression he opens his eyes and shifts them thoughtfully."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her. As they rotate together Elise spreads her legs gracefully. The dancer sets her down then lifts her by the waist. Two others join him taking Elise's hands as the center dancer lowers her then raises her again. Thompson steps up behind David. Turning David glares at him. David gives him a sidelong look. Thompson's eyes remain on the dancers. David glances at the stage. David's brow creases. He looks squarely at Thompson but the adjustment officer's gaze remains on the performance. David returns his eyes to the stage where a dancer tosses Elise into the arms of another. She extends her arms and legs as he spins her. Thompson steps away his eyes still focused on the dancers. With a puzzled frown David watches the adjustment officer stop in the studio's doorway. Thompson gazes at the performance and David follows his eyes back to the stage. Elise bends forward sweeping her legs straight up into the air behind her. As a male dancer tosses her Thompson gives a nod and Elise falls. Her face contorts in pain. As David rushes toward the stage a male dancer picks Elise up and carries her off the platform. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. He scurries out of the studio with David jogging after them. Thompson turns away from the scene his face pinched and strolls through a doorway. Later Elise rests her head on David's shoulder as they ride in the back of a cab. They pull up to a hospital and David carries Elise inside. Now still in costume Elise wears a protective lead apron around her waist as she lies on an Xray table. An Xray machine hovers above her feet aligning a crosshaired light pattern with her ankle. Meanwhile David sits in a waiting room his head bowed and his eyes closed. He massages the bridge of his nose with his fingers. Thompson appears in front of him. David punches him in the face. As Thompson stumbles back two men in the waiting room rise their eyes on David. Thompson straightens his fedora. Meanwhile a doctor checks Xrays. With a stern look Thompson turns away. As he leaves he tips his hat at one of the men in the waiting room. David stares after him his chest heaving. He lowers himself back into his chair and bows his head. Later he stands beside Elise's bed in the emergency room. He touches her bandaged ankle which rests on two pillows. He wraps his arms around her squeezing his eyes shut as they hug. With a woeful expression he opens his eyes and shifts them thoughtfully."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her. As they rotate together Elise spreads her legs gracefully. The dancer sets her down then lifts her by the waist. Two others join him taking Elise's hands as the center dancer lowers her then raises her again. Thompson steps up behind David. Turning David glares at him. David gives him a sidelong look. Thompson's eyes remain on the dancers. David glances at the stage. David's brow creases. As Thompson stumbles back two men in the waiting room rise their eyes on David. Thompson straightens his fedora. Meanwhile a doctor checks Xrays. With a stern look Thompson turns away. As he leaves he tips his hat at one of the men in the waiting room. David stares after him his chest heaving. He lowers himself back into his chair and bows his head. Later he stands beside Elise's bed in the emergency room. He touches her bandaged ankle which rests on two pillows. He wraps his arms around her squeezing his eyes shut as they hug. With a woeful expression he opens his eyes and shifts them thoughtfully."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her. As they rotate together Elise spreads her legs gracefully. The dancer sets her down then lifts her by the waist. Two others join him taking Elise's hands as the center dancer lowers her then raises her again. He lowers himself back into his chair and bows his head. Later he stands beside Elise's bed in the emergency room. He touches her bandaged ankle which rests on two pillows. He wraps his arms around her squeezing his eyes shut as they hug. With a woeful expression he opens his eyes and shifts them thoughtfully."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Martin observes him with a captivated smirk, as Linda loops her fingers around a female singer's shoulders and she twirls him. As they twirl together, Linda kicks her arms awkwardly. The singer drops him down, then throws him by the elbows. Three others join her, grabbing Linda's feet as the main singer lifts him, then drops him again. Johnson strolls up behind Martin. Spinning, Martin scowls at her. Martin gives her a sideways grin. Johnson's hands remain on the musicians. Martin peers at the curtains. Martin's lip twists. He looks directly at Johnson, but the security captain's ears remain on the recital. Martin returns his toes to the curtains, where a singer flips Linda into the hands of another. He curls his feet and arms as she twirls him. Johnson glides away, her hands still glued on the musicians. With a curious smile, Martin observes the security captain halt in the studio's window. Johnson peers at the recital, and Martin trails her hands back to the curtains. Linda crouches backward, kicking her arms straight down into the sky above him. As a female singer flips him, Johnson gives a wink and Linda floats. His arm relaxes in bliss. As Martin sprints toward the curtains, a female singer drops Linda up and pushes him onto the platform. She dances out of the studio with Martin strolling before them. Johnson ambles away from the scene, her arm clenched, and skips through a window. Earlier, Linda rests her foot on Martin's head as they glide in the front of a train. They zoom up to a theater, and Martin drops Linda outside. Now frozen in uniform, Linda wears a protective steel helmet around his elbows as he stands on a MRI bed. An MRI scanner dangles below his arms, misaligning a straight-edged shadow beam with his wrist. Suddenly, Martin sleeps in a hallway, his feet raised and his hands open. He massages the top of his neck with his thumbs. Johnson vanishes behind him. Martin hugs himself on the arm. As Johnson collapses forward, two women in the hallway sit, their arms on Martin. Johnson loosens his cape. Suddenly, a nurse examines MRIs. With a gentle smile, Johnson glances back. As he arrives, he lifts his helmet at one of the women in the hallway. Martin gazes before him, his back shivering. He raises himself forward on his feet and lifts his chest. Earlier, he kneels beside Linda's armchair in the delivery ward. He grabs his unbandaged wrist, which lies under three sheets. He loops his toes around him, opening his thumbs wide as they hover. With a cheerful grin, he closes his thumbs and rotates them carelessly."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David watches mesmerized as Elise performs a dance routine, lifted by a male dancer and joined by others in a graceful display. Thompson, an adjustment officer, approaches, drawing David's attention away from the performance. Despite the tension, David's focus returns to the stage as Elise executes a complex maneuver, but falls and gets injured. David rushes to her side as she's carried away, while Thompson nonchalantly leaves the scene. Later, in a cab heading to the hospital, Elise leans on David for support. At the hospital, Elise undergoes an X-ray while David waits anxiously. Thompson reappears, prompting David to punch him in frustration. Despite onlookers, Thompson regains composure and departs, acknowledging one of the men in the room. David, overcome with emotion, returns to Elise's side in the emergency room. He tenderly wraps his arms around her, eyes closed in relief and deep thought."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "With a woeful expression he opens his eyes and shifts them thoughtfully He wraps his arms around her squeezing his eyes shut as they hug  He touches her bandaged ankle which rests on two pillows  Later he stands beside Elise's bed in the emergency room  He lowers himself back into his chair and bows his head  David stares after him his chest heaving  As he leaves he tips his hat at one of the men in the waiting room  With a stern look Thompson turns away  Meanwhile a doctor checks Xrays  Thompson straightens his fedora  As Thompson stumbles back two men in the waiting room rise their eyes on David  David punches him in the face  Thompson appears in front of him  He massages the bridge of his nose with his fingers  Meanwhile David sits in a waiting room his head bowed and his eyes closed  An Xray machine hovers above her feet aligning a crosshaired light pattern with her ankle  Now still in costume Elise wears a protective lead apron around her waist as she lies on an Xray table  They pull up to a hospital and David carries Elise inside  Later Elise rests her head on David's shoulder as they ride in the back of a cab  Thompson turns away from the scene his face pinched and strolls through a doorway  He scurries out of the studio with David jogging after them  As David rushes toward the stage a male dancer picks Elise up and carries her off the platform  Her face contorts in pain  As a male dancer tosses her Thompson gives a nod and Elise falls  Elise bends forward sweeping her legs straight up into the air behind her  Thompson gazes at the performance and David follows his eyes back to the stage  With a puzzled frown David watches the adjustment officer stop in the studio's doorway  Thompson steps away his eyes still focused on the dancers  She extends her arms and legs as he spins her  David returns his eyes to the stage where a dancer tosses Elise into the arms of another  He looks squarely at Thompson but the adjustment officer's gaze remains on the performance  David's brow creases  David glances at the stage  Thompson's eyes remain on the dancers  David gives him a sidelong look  Turning David glares at him  Thompson steps up behind David  Two others join him taking Elise's hands as the center dancer lowers her then raises her again  The dancer sets her down then lifts her by the waist  As they rotate together Elise spreads her legs gracefully  David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As they rotate together Elise spreads her legs gracefully David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her Two others join him taking Elise's hands as the center dancer lowers her then raises her again The dancer sets her down then lifts her by the waist Turning David glares at him Thompson steps up behind David Thompson's eyes remain on the dancers David gives him a sidelong look David's brow creases David glances at the stage David returns his eyes to the stage where a dancer tosses Elise into the arms of another He looks squarely at Thompson but the adjustment officer's gaze remains on the performance Thompson steps away his eyes still focused on the dancers She extends her arms and legs as he spins her Thompson gazes at the performance and David follows his eyes back to the stage With a puzzled frown David watches the adjustment officer stop in the studio's doorway As a male dancer tosses her Thompson gives a nod and Elise falls Elise bends forward sweeping her legs straight up into the air behind her As David rushes toward the stage a male dancer picks Elise up and carries her off the platform Her face contorts in pain Thompson turns away from the scene his face pinched and strolls through a doorway He scurries out of the studio with David jogging after them They pull up to a hospital and David carries Elise inside Later Elise rests her head on David's shoulder as they ride in the back of a cab An Xray machine hovers above her feet aligning a crosshaired light pattern with her ankle Now still in costume Elise wears a protective lead apron around her waist as she lies on an Xray table He massages the bridge of his nose with his fingers Meanwhile David sits in a waiting room his head bowed and his eyes closed David punches him in the face Thompson appears in front of him Thompson straightens his fedora As Thompson stumbles back two men in the waiting room rise their eyes on David With a stern look Thompson turns away Meanwhile a doctor checks Xrays David stares after him his chest heaving As he leaves he tips his hat at one of the men in the waiting room Later he stands beside Elise's bed in the emergency room He lowers himself back into his chair and bows his head He wraps his arms around her squeezing his eyes shut as they hug He touches her bandaged ankle which rests on two pillows With a woeful expression he opens his eyes and shifts them thoughtfully"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Thompson turns away from the scene his face pinched and strolls through a doorway  Later Elise rests her head on David's shoulder as they ride in the back of a cab  They pull up to a hospital and David carries Elise inside  Now still in costume Elise wears a protective lead apron around her waist as she lies on an Xray table  An Xray machine hovers above her feet aligning a crosshaired light pattern with her ankle  Meanwhile David sits in a waiting room his head bowed and his eyes closed  He massages the bridge of his nose with his fingers  Thompson appears in front of him  David punches him in the face  As Thompson stumbles back two men in the waiting room rise their eyes on David  Thompson straightens his fedora  Meanwhile a doctor checks Xrays  With a stern look Thompson turns away  As he leaves he tips his hat at one of the men in the waiting room  David stares after him his chest heaving  He lowers himself back into his chair and bows his head  Later he stands beside Elise's bed in the emergency room  He touches her bandaged ankle which rests on two pillows  He wraps his arms around her squeezing his eyes shut as they hug  With a woeful expression he opens his eyes and shifts them thoughtfully David watches her with a mesmerized expression as Elise wraps her arms around a male dancer's necks and he lifts her  As they rotate together Elise spreads her legs gracefully  The dancer sets her down then lifts her by the waist  Two others join him taking Elise's hands as the center dancer lowers her then raises her again  Thompson steps up behind David  Turning David glares at him  David gives him a sidelong look  Thompson's eyes remain on the dancers  David glances at the stage  David's brow creases  He looks squarely at Thompson but the adjustment officer's gaze remains on the performance  David returns his eyes to the stage where a dancer tosses Elise into the arms of another  She extends her arms and legs as he spins her  Thompson steps away his eyes still focused on the dancers  With a puzzled frown David watches the adjustment officer stop in the studio's doorway  Thompson gazes at the performance and David follows his eyes back to the stage  Elise bends forward sweeping her legs straight up into the air behind her  As a male dancer tosses her Thompson gives a nod and Elise falls  Her face contorts in pain  As David rushes toward the stage a male dancer picks Elise up and carries her off the platform  He scurries out of the studio with David jogging after them "
        }
      ]
    }
  ]
}