{
  "ground_truth": "He holds her for another moment, then pulls away and glances at her. He forces a faint smile. Elise gives him a tender look. He turns away, and she watches him with concerned eyes. As he trudges out of the emergency room, a discouraged expression crosses her face. Exiting the ER, David walks down a corridor, his pained eyes staring straight ahead. A view from behind shows his lone form filing down the long hospital hallway. Now in a vast hallway lined with marble, Richardson joins Harry at a window overlooking New York City. Harry's gaze stays trained ahead. Meanwhile, Elise sits alone in the hospital waiting room. She blinks back tears, then shakes her head. Now a friend pushes Elise in a wheelchair. They head out. Harry gives him a skeptical look. Richardson puts on his fedora, gives Harry a pat on the arm, and walks off, leaving the younger officer alone at the window of the mid-century high-rise. Eleven months later, now on a sunny farm, David walks a green pasture. Later, in front of a barn and silos, he addresses a crowd. Sitting in a campaign bus, Charlie and an aide watch a news report on the vehicle's TV. Charlie heads outside. As David greets his supporters, the campaign chairman sits on a picnic table and reads a newspaper. He browses a page, folds it up, and frowns thoughtfully to himself. As voters disperse, David joins him. Charlie holds out the newspaper. An arts section feature shows photos of Elise, one dancing, the other with a bow. David stares at the photo, his brow cinched. As he leaves, Charlie gazes after him with pursed lips. Seated outside a waterfront warehouse, he wears a sober frown. Now under a dusky sky, David walks across a deserted shipping dock. He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge, gazing toward the low sun. In her apartment, Elise sits at the foot of her bed, eyeing a document. She sets it aside, then lifts her troubled gaze. Now David approaches the ragged bar. As David disappears inside, Harry emerges from a neighboring door. Inside, David sits forlornly at the bar. The bartender hands him a slip of paper. David stares after her, then reads the note. At dusk, under pouring rain, he holds his jacket over his head as he runs along a dock to a warehouse. In the evening, he leans on the wall, waiting. Harry arrives in a fedora and trench coat, sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath. He gives a grave shake of the head, then takes a seat on a stack of shipping pallets.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He grips her for another instant, then pulls away and looks at her. He forces a faint grin. Elise gives him a gentle glance. He turns away, and she observes him with worried eyes. As he plods out of the emergency ward, a disheartened expression crosses her face. Leaving the ER, David strolls down a passage, his anguished eyes staring directly ahead. A scene from behind shows his solitary figure filing down the extended hospital corridor. Now in an expansive corridor lined with marble, Richardson joins Harry at a window overseeing New York City. Harry's stare stays focused ahead. Meanwhile, Elise sits solitary in the hospital waiting area. She blinks back sobs, then shakes her head. Now a companion pushes Elise in a wheelchair. They head out. Harry gives him a dubious glance. Richardson dons his fedora, gives Harry a pat on the limb, and walks off, leaving the youthful officer solitary at the window of the mid-century high-rise. Eleven months later, now on a bright farm, David strolls a verdant meadow. Later, in front of a stable and silos, he addresses a throng. Sitting in a campaign coach, Charlie and an aide watch a news broadcast on the vehicle's TV. Charlie heads outside. As David welcomes his supporters, the campaign director sits on a picnic bench and reads a journal. He scans a page, folds it up, and frowns pensively to himself. As voters scatter, David joins him. Charlie holds out the journal. An arts section feature shows photographs of Elise, one performing, the other with a bow. David stares at the picture, his brow furrowed. As he leaves, Charlie gazes after him with pursed lips. Seated outside a waterfront depot, he wears a somber frown. Now under a dusky sky, David strolls across a deserted shipping pier. He carelessly drags his feet through a large glossy puddle and pauses at the pier's edge, gazing toward the low sun. In her apartment, Elise sits at the foot of her bed, eyeing a document. She sets it aside, then lifts her troubled gaze. Now David approaches the tattered tavern. As David vanishes inside, Harry emerges from a neighboring door. Inside, David sits despondently at the tavern. The bartender hands him a slip of paper. David stares after her, then reads the note. At twilight, under pouring rain, he holds his jacket over his head as he sprints along a pier to a depot. In the evening, he leans on the partition, waiting. Harry arrives in a fedora and raincoat, sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a profound breath. He gives a serious shake of the head, then takes a seat on a stack of shipping pallets."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Her moment is held by him, then she is pulled away from and glanced at by him. A faint smile is forced by him. A tender look is given to him by Elise. He is turned away from, and he is watched by her with concerned eyes. As the emergency room is trudged out of by him, her face is crossed by a discouraged expression. Exiting the ER, a corridor is walked down by David, his pained eyes are stared straight ahead by him. A view from behind shows him filing his lone form down the long hospital hallway. Now in a vast hallway lined with marble, Richardson joins Harry at a window that overlooks New York City. Harry stays trained on the view ahead. Meanwhile, Elise is sitting alone in the hospital waiting room. Tears are blinked back by her, then she shakes her head. Now Elise is pushed by a friend in a wheelchair. They head out. A skeptical look is given to him by Harry. Richardson puts on his fedora, pats Harry on the arm, and walks off, leaving the younger officer alone at the window of the mid-century high-rise. Eleven months later, now on a sunny farm, a green pasture is walked by David. Later, in front of a barn and silos, a crowd is addressed by him. Sitting in a campaign bus, a news report is watched by Charlie and an aide on the vehicle's TV. Charlie heads outside. As his supporters are greeted by David, the campaign chairman sits on a picnic table and reads a newspaper. A page is browsed by him, it is folded up, and he frowns thoughtfully to himself. As the voters disperse, he is joined by David. The newspaper is held out to him by Charlie. An arts section feature shows photos of Elise, one dancing, the other with a bow. The photo is stared at by David, his brow is cinched. As he leaves, Charlie gazes after him with pursed lips. Seated outside a waterfront warehouse, a sober frown is worn by him. Now under a dusky sky, a deserted shipping dock is walked across by David. He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge, gazing toward the low sun. In her apartment, the foot of her bed is sat at by Elise, a document is eyed by her. It is set aside, then her troubled gaze is lifted. Now the ragged bar is approached by David. As David disappears inside, Harry emerges from a neighboring door. Inside, the bar is sat forlornly at by David. A slip of paper is handed to him by the bartender. After her, David stares, then the note is read by him. At dusk, under pouring rain, his jacket is held over his head by him as he runs along a dock to a warehouse. In the evening, the wall is leaned on by him, waiting. Harry arrives in a fedora and trench coat, sheltered by an umbrella from the rain. David is joined by him. His gaze is lowered by Harry, and a deep breath is taken by him. A grave shake of the head is given by him, then a seat is taken on a stack of shipping pallets."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He holds her for a moment, then pulls away and glances at Elise, forcing a faint smile. She gives him a tender look, watching him with concern as he leaves the ER with a discouraged face. David walks down a hospital corridor, his pained eyes fixed ahead. In a vast marble hallway, Richardson joins Harry at a window overlooking New York City, while Elise sits alone in the hospital, blinking back tears. A friend wheels her out. Harry gives Richardson a skeptical look as Richardson departs, leaving the younger officer alone in the mid-century high-rise. Eleven months later, on a sunny farm, David walks a green pasture and addresses a crowd by a barn. In a campaign bus, Charlie and an aide watch a news report. David greets supporters as the campaign chairman reads a newspaper, noticing an arts feature with photos of Elise dancing and holding a bow. David's brow furrows at the photo, and Charlie watches him leave with pursed lips. Outside a waterfront warehouse, David wears a sober frown. Under a dusky sky, he walks across a deserted shipping dock, carelessly tracking his feet through a puddle and gazing at the sun. In her apartment, Elise eyes a document, sets it aside, and lifts her troubled gaze. David approaches a ragged bar, disappearing inside as Harry emerges from a neighboring door. Inside, David sits forlornly at the bar; the bartender hands him a note. At dusk, in pouring rain, he runs along a dock to a warehouse, waits in the evening, and is joined by Harry in a fedora and trench coat. Harry lowers his gaze, takes a deep breath, and gravely shakes his head, then sits on shipping pallets."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He holds her briefly, then forces a faint smile before turning away. Elise watches with concern as he leaves the ER, her face discouraged. David, alone in a long hospital corridor, appears pained. In a marble hall, Richardson joins Harry at a window overlooking New York City, while Elise sits in the waiting room, blinking back tears. A friend wheels Elise out. Harry skeptically observes Richardson, who pats Harry's arm before leaving him alone. Eleven months later, on a sunny farm, David speaks to a crowd. In a campaign bus, Charlie watches news on TV, then heads outside. As David greets supporters, the campaign chair reads a newspaper at a picnic table, then offers it to David, showing photos of Elise. David is troubled by the image. Charlie watches David leave, wearing a sober frown. At dusk on a deserted dock, David walks through a puddle, stopping to gaze at the sun. Elise, in her apartment, sets a document aside and looks up, worried. David approaches a bar where Harry exits. Inside, David sits at the bar, receiving a note from the bartender. In the evening, during rain, David runs to a warehouse, waiting outside. Harry arrives with an umbrella, joins David, and gravely shakes his head, then sits on shipping pallets."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He holds her close for another fleeting moment, then gently pulls away and glances at her with a mixture of emotions. Struggling to muster a semblance of positivity, he forces a faint smile to appear on his lips. Elise responds with a tender and understanding look in her eyes. As he turns his back on her, she watches him with eyes filled with deep concern. He trudges out of the emergency room, the weight of the world visible on his shoulders, and a discouraged expression briefly crosses her face as she watches him go. Once he is outside the ER, David walks down a corridor, his eyes filled with pain, staring intently straight ahead. From behind, the view captures his solitary form as he files down the long, echoing hospital hallway. In a vast expanse lined with gleaming marble, Richardson joins Harry at a window, which offers a breathtaking view overlooking New York City. Harry's unwavering gaze remains fixed straight ahead. Meanwhile, Elise finds herself sitting alone in the quiet hospital waiting room. Blinking back tears, she shakes her head in an attempt to compose herself. A friend soon arrives and assists by pushing Elise along in a wheelchair, and together they head out. Harry gives him a skeptical look as Richardson places his fedora neatly atop his head, gives Harry a reassuring pat on the arm, and walks away, leaving the younger officer alone at the window of the imposing mid-century high-rise. Eleven months later, in a striking contrast to the previous scene, now under the bright expanse of a sunny farm, David walks across a verdant green pasture. Later, positioned in front of a rustic barn and towering silos, he addresses a gathered crowd. Seated inside a bustling campaign bus, Charlie and an aide are engrossed in watching a news report on the vehicle's small TV screen. Charlie soon heads outside to join the activity. As David warmly greets his enthusiastic supporters, the campaign chairman sits nearby on a sturdy picnic table, engrossed in reading a newspaper. He casually browses through a page, then folds it up with a thoughtful frown etched on his face. As the crowd of voters begins to disperse, David joins him, and Charlie offers the newspaper to David. A feature in the arts section prominently displays photos of Elise, one capturing her in the grace of dance and the other with a poised bow. David stares intently at the photo, his brow furrowing in deep thought. As he makes his departure, Charlie gazes after him with pursed lips, contemplating the implications. Seated outside a waterfront warehouse, he wears a somber expression, the weight of recent events clearly visible. Now, under a sky tinged with the colors of dusk, David walks across an empty shipping dock. He carelessly drags his feet through a large, glassy puddle, creating ripples as he stops at the very edge of the dock, gazing toward the setting sun. In the solitude of her apartment, Elise sits at the foot of her bed, scrutinizing a document. She sets it aside, lifting her troubled gaze toward the unknown future. Now, David approaches the ragged bar with a heavy heart. As David disappears inside, Harry emerges from a neighboring door, his presence marked by a careful watchfulness. Inside the dimly lit bar, David sits forlornly, lost in thought. The bartender hands him a small slip of paper, a mysterious communication that captures his attention. David stares after her for a moment, then turns his focus to the note and begins to read. At dusk, under a relentless downpour, he holds his jacket desperately over his head as he runs along a dock towards a warehouse. Later in the evening, he leans wearily on the wall, waiting in anticipation. Harry arrives clad in a fedora and trench coat, effectively sheltered from the rain by a sturdy umbrella. He joins David and lowers his gaze, taking a deep, fortifying breath. With a grave shake of his head, he takes a seat on a stack of shipping pallets, signifying the weight of the news he bears."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He holds her tenderly and closely for another fleeting moment, then, with a gentle motion, pulls away and looks at her with a complex amalgamation of emotions swirling in his eyes. Struggling internally to summon a semblance of positivity in the midst of the situation, he forces a faint, albeit strained, smile to slowly appear on his lips. Elise responds to this attempt with a tender, deeply understanding look in her eyes, conveying her empathy. As he finally turns his back on her, she watches him depart with eyes filled with deep and genuine concern. He trudges heavily out of the bustling emergency room, the weight of the world seeming painfully visible on his shoulders, and a discouraged, momentary expression briefly crosses her face as her gaze follows him. Once he steps outside the ER, David walks down a seemingly endless corridor, his eyes filled with an unmistakable pain, and he stares intently straight ahead. From behind, the view captures his solitary form as he files down the long, echoing, and almost eerily quiet hospital hallway. In this vast expanse, elegantly lined with gleaming marble, Richardson joins Harry at a window, which offers a grand and breathtaking view overlooking the sprawling cityscape of New York City. Harry's unwavering, steady gaze remains fixed straight ahead. Meanwhile, Elise finds herself sitting alone in the silent and somber hospital waiting room. Blinking back her tears, she shakes her head gently in an earnest attempt to compose herself. A supportive friend soon arrives and kindly assists by pushing Elise along in a wheelchair, and together they make their way out. Harry gives him a skeptical, questioning look as Richardson places his stylish fedora neatly atop his head, gives Harry a reassuring pat on the arm, and walks away, leaving the younger officer standing alone at the window of the imposing mid-century high-rise building. Eleven months later, in a striking contrast to the previous somber scene, now under the bright, wide expanse of a sunny farm, David walks steadily across a verdant and lush green pasture. Later, positioned prominently in front of a rustic barn and towering silos, he confidently addresses a gathered crowd. Seated inside a bustling campaign bus, Charlie and an aide are deeply engrossed in watching a news report on the vehicle's small but functional TV screen. Charlie soon decides to head outside to join the lively activity. As David warmly greets his enthusiastic supporters, the campaign chairman sits nearby on a sturdy picnic table, engrossed in reading a newspaper. He casually browses through a page, then folds it up with a thoughtful and contemplative frown etched on his face. As the crowd of eager voters begins to gradually disperse, David joins him, and Charlie thoughtfully offers the newspaper to David. A feature in the arts section prominently displays striking photos of Elise, one capturing her in the graceful beauty of dance, and the other with a poised and elegant bow. David stares intently at the photo, his brow furrowing in deep, contemplative thought. As he makes his unhurried departure, Charlie gazes after him with pursed lips, contemplating the implications of the moment. Seated outside a waterfront warehouse, he wears a somber expression, the weight of recent events clearly visible in his posture. Now, under a sky beautifully tinged with the vibrant colors of dusk, David walks across an empty, desolate shipping dock. He carelessly drags his feet through a large, glassy puddle, creating ripples as he stops at the very edge of the dock, gazing contemplatively toward the setting sun. In the solitude of her apartment, Elise sits quietly at the foot of her bed, scrutinizing a document with intense focus. She sets it aside gently, lifting her troubled gaze toward the yet-unknown future. Now, David approaches the ragged, weather-worn bar with a heavy heart. As David disappears inside, Harry emerges from a neighboring door, his presence marked by a careful, watchful vigilance. Inside the dimly lit and somewhat somber bar, David sits forlornly, lost deeply in his thoughts. The bartender approaches and hands him a small slip of paper, a mysterious communication that immediately captures his attention. David stares after her for a contemplative moment, then turns his focus to the note and begins to read. At dusk, under a relentless and pouring downpour, he desperately holds his jacket over his head as he runs along a dock towards a looming warehouse. Later in the evening, he leans wearily against the wall, waiting with a sense of anticipation. Harry arrives, clad in a fedora and trench coat, effectively sheltered from the rain by a sturdy umbrella. He joins David, lowering his gaze as he takes a deep, fortifying breath. With a grave and consequential shake of his head, he takes a seat on a stack of weathered shipping pallets, signifying the heaviness of the news he bears."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He holds her for another moment, feeling the warmth and comfort of the embrace, then slowly pulls away, creating a small distance between them, and glances at her face to catch her expression. He forces a faint smile, attempting to convey reassurance despite the emotional weight in his eyes. Elise returns his gaze with a tender look, her eyes soft with empathy and understanding. Turning away from her, he takes a step back, and she watches him leave, her eyes filled with concern and unease. As he begins to trudge out of the emergency room, his feet dragging heavily on the linoleum floor, a discouraged expression flits across her face, reflecting her inner turmoil. Exiting the ER, David walks down a corridor, his pained eyes staring straight ahead, seemingly unaware of his surroundings. The camera captures a view from behind, emphasizing his solitary figure as he makes his way down the long hospital hallway. Transitioning into a vast hallway lined with marble, Richardson joins Harry at a large window that offers an expansive view of New York City. Harry’s gaze remains fixed straight ahead, seemingly lost in thought. Meanwhile, Elise sits alone in the hospital waiting room, her posture slumped with exhaustion. She blinks back tears that threaten to spill over, then shakes her head slightly as if to shake off despair. A friend approaches and gently pushes Elise in a wheelchair, guiding her through the bustling hospital environment as they head out. Harry casts a skeptical look in Richardson's direction. Richardson, with a casual air, places his fedora on his head, pats Harry encouragingly on the arm, and walks off, leaving the younger officer to contemplate alone at the window of the mid-century high-rise. Eleven months later, set against the backdrop of a sunny farm, David walks through a lush green pasture, his steps deliberate and reflective. Later, standing in front of a rustic barn and towering silos, he addresses a crowd, his voice carrying over the open space as he engages with his audience. Inside a campaign bus, Charlie and an aide intently watch a news report playing on the vehicle’s TV, analyzing the unfolding events. Charlie, feeling compelled, heads outside to join the fray. As David energetically greets his supporters, the campaign chairman perches on a picnic table, engrossed in a newspaper. He carefully browses the page, his eyes scanning for information, then folds it up with precision, a thoughtful frown playing on his lips as he contemplates its contents. As the voters begin to disperse, David strides over to join the chairman, who holds out the newspaper with a sense of urgency. An arts section feature captures David’s attention, displaying photos of Elise, one dynamic image of her dancing and another poised with a bow. David stares at the photos, his brow knit in concentration and introspection. As he turns to leave, Charlie watches him go, his lips pursed in contemplation. Seated outside a waterfront warehouse, David wears a sober frown, lost in thought. Under a dusky sky, he walks across a deserted shipping dock, his steps echoing in the silence. Carelessly, he tracks his feet through a large glassy puddle, the water rippling in his wake, before stopping at the dock’s edge to gaze into the low sun, contemplating the horizon. In her apartment, Elise sits at the foot of her bed, her eyes scanning a document. She sets it aside with a resigned gesture, lifting her troubled gaze to the empty room. David approaches a ragged bar, his steps purposeful yet hesitant. As David disappears inside, Harry emerges from a neighboring door, taking in the scene with a discerning eye. Inside, David sits forlornly at the bar, absorbed in his thoughts. The bartender approaches and hands him a slip of paper, a silent exchange that holds untold significance. David stares after the bartender, then shifts his focus to the note, reading its contents with intent. At dusk, under a sky heavy with pouring rain, he holds his jacket over his head, trying to shield himself as he runs along a dock towards a dimly lit warehouse. In the evening, he leans against the wall, waiting patiently and feeling the passage of time. Harry arrives, his silhouette framed by a fedora and trench coat, sheltered from the rain by an umbrella. He steps up to join David, lowering his gaze and taking a deep, reflective breath. A grave shake of the head follows, communicating unspoken words and emotions, before he takes a seat on a stack of shipping pallets, settling into a contemplative silence beside David."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David holds Elise briefly before pulling away and giving her a faint smile, which she acknowledges with a tender look. As he leaves the emergency room with a heavy heart, Elise watches him, her concern evident. He walks through the hospital corridor, lost in thought, and later joins Harry by a window overlooking New York City. Meanwhile, Elise, alone in the waiting room, fights back tears before a friend assists her in a wheelchair to leave. Richardson, after a brief exchange with Harry, departs, leaving Harry by the window.\n\nEleven months later, on a sunny farm, David addresses a crowd in front of a barn and silos during a campaign event. Inside a campaign bus, Charlie and an aide watch a news report. Charlie steps outside and observes David interacting with supporters. The campaign chairman, seated on a picnic table, reads a newspaper and, after noting a feature on Elise in the arts section, shares it with David, who stares at her photo, deep in thought. As David leaves, Charlie looks on, contemplating.\n\nLater, David is found at a waterfront warehouse, under a dusky sky, walking across a deserted shipping dock. He pauses at the dock's edge, gazing at the sunset, while Elise, in her apartment, sets aside a document, reflecting on her troubles. David enters a nearby bar while Harry emerges next door. Inside, David reads a note handed by the bartender. At dusk, he heads to a warehouse under pouring rain, waiting for Harry, who arrives in a fedora and trench coat, sheltered by an umbrella. Harry joins David, expresses regret, and sits on a stack of pallets, signaling the gravity of their situation."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He holds her for another moment, then pulls away and glances at her, his eyes reflecting the intense pressure of their difficult situation. He forces a faint smile, hoping to reassure her. Elise gives him a tender look, trying to convey her unwavering support. He turns away, and she watches him with concerned eyes. As he trudges out of the emergency room, where endless stories of hope and heartbreak unfold daily, a discouraged expression crosses her face. Exiting the ER, David walks down a corridor, his pained eyes staring straight ahead, likely pondering the weight of his responsibilities. A view from behind shows his lone form filing down the long hospital hallway, which seems to stretch into infinity, amplifying his isolation. \n\nNow in a vast hallway lined with marble, a symbol of the building's historical grandeur, Richardson joins Harry at a window overlooking New York City, a skyline renowned for its towering skyscrapers and relentless energy. Harry's gaze stays trained ahead, seemingly searching for clarity amid the urban sprawl. Meanwhile, Elise sits alone in the hospital waiting room, the quiet hum of activity around her a stark contrast to her internal turmoil. She blinks back tears, then shakes her head, steeling herself against the overwhelming emotions. Now a friend pushes Elise in a wheelchair, a necessity after her recent surgery. They head out. \n\nHarry gives him a skeptical look, questioning the plan's feasibility. Richardson puts on his fedora, reminiscent of a bygone era, gives Harry a pat on the arm, and walks off, leaving the younger officer alone at the window of the mid-century high-rise, a building that once symbolized innovation. Eleven months later, now on a sunny farm known for its organic produce, David walks a green pasture, finding solace in the simplicity of rural life. Later, in front of a barn and silos, traditional symbols of agricultural abundance, he addresses a crowd. Sitting in a campaign bus, equipped with the latest technology for his political tour, Charlie and an aide watch a news report on the vehicle's TV. Charlie heads outside, eager to discuss strategy. \n\nAs David greets his supporters, the campaign chairman sits on a picnic table and reads a newspaper, a relic in the digital age. He browses a page, folds it up, and frowns thoughtfully to himself, pondering the implications of the headlines. As voters disperse, David joins him. Charlie holds out the newspaper. An arts section feature shows photos of Elise, one dancing, the other with a bow, highlighting her multifaceted talent and dedication to her craft. David stares at the photo, his brow cinched, as memories flood back. As he leaves, Charlie gazes after him with pursed lips, sensing David's internal conflict. \n\nSeated outside a waterfront warehouse, he wears a sober frown, contemplating the decisions that led him here. Now under a dusky sky, David walks across a deserted shipping dock, a place usually buzzing with activity during the day. He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge, gazing toward the low sun that casts long shadows over the water. In her apartment, Elise sits at the foot of her bed, eyeing a document, potentially life-changing, with uncertainty. She sets it aside, then lifts her troubled gaze, deep in thought.\n\nNow David approaches the ragged bar, known locally for its strong drinks and hushed conversations. As David disappears inside, Harry emerges from a neighboring door, having gathered vital information. Inside, David sits forlornly at the bar, the dim lighting matching his mood. The bartender hands him a slip of paper, discreetly passing along important information. David stares after her, then reads the note, his expression shifting as he absorbs the new details. At dusk, under pouring rain that seems to mirror his inner turmoil, he holds his jacket over his head as he runs along a dock to a warehouse, a place of clandestine meetings. In the evening, he leans on the wall, waiting with mounting impatience. Harry arrives in a fedora and trench coat, dressed for discreet surveillance, sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath, bracing himself for what must be said. He gives a grave shake of the head, then takes a seat on a stack of shipping pallets, ready to divulge what he's learned."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He holds her for another moment then pulls away and glances at her. He forces a faint smile. Elise gives him a tender look. He turns away and she watches him with concerned eyes. As he trudges out of the emergency room a discouraged expression crosses her face. Exiting the ER. David walks down a corridor his pained eyes staring straight ahead. A view from behind shows his lone form filing down the long hospital hallway. Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City. Harry's gaze stays trained ahead. Meanwhile Elise sits alone in the hospital waiting room. She blinks back tears then shakes her head. Now a friend pushes Elise in a wheelchair. They head out. Harry gives him a skeptical look. Richardson puts on his fedora gives Harry a pat on the arm and walks off leaving the younger officer alone at the window of the midcentury highrise. Eleven months later now on a sunny farm David walks a green pasture. Later in front of a barn and silos he addresses a crowd. Sitting in a campaign bus Charlie and an aide watch a news report on the vehicle's TV. Charlie heads outside. As David greets his supporters the campaign chairman sits on a picnic table and reads a newspaper. He browses a page folds it up and frowns thoughtfully to himself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. As voters disperse David joins him. Charlie holds out the newspaper. An arts section feature shows photos of Elise one dancing the other with a bow. David stares at the photo his brow cinched. As he leaves Charlie gazes after him with pursed lips. Seated outside a waterfront warehouse he wears a sober frown. Now under a dusky sky. David walks across a deserted shipping dock. He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge gazing toward the low sun. In her apartment Elise sits at the foot of her bed eyeing a document. She sets it aside then lifts her troubled gaze. Now David approaches the ragged bar. As David disappears inside Harry emerges from a neighboring door. Inside David sits forlornly at the bar. The bartender hands him a slip of paper. David stares after her then reads the note. At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse. In the evening he leans on the wall waiting. Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath. He gives a grave shake of the head then takes a seat on a stack of shipping pallets."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He holds her for another moment then pulls away and glances at her. He forces a faint smile. Elise gives him a tender look. He turns away and she watches him with concerned eyes. As he trudges out of the emergency room a discouraged expression crosses her face. Exiting the ER. David walks down a corridor his pained eyes staring straight ahead. A view from behind shows his lone form filing down the long hospital hallway. Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City. Harry's gaze stays trained ahead. Meanwhile Elise sits alone in the hospital waiting room. She blinks back tears then shakes her head. Now a friend pushes Elise in a wheelchair. They head out. Harry gives him a skeptical look. Richardson puts on his fedora gives Harry a pat on the arm and walks off leaving the younger officer alone at the window of the midcentury highrise. Eleven months later now on a sunny farm David walks a green pasture. Later in front of a barn and silos he addresses a crowd. Sitting in a campaign bus Charlie and an aide watch a news report on the vehicle's TV. Charlie heads outside. As David greets his supporters the campaign chairman sits on a picnic table and reads a newspaper. He browses a page folds it up and frowns thoughtfully to himself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. As voters disperse David joins him. Charlie holds out the newspaper. An arts section feature shows photos of Elise one dancing the other with a bow. David stares at the photo his brow cinched. As he leaves Charlie gazes after him with pursed lips. Seated outside a waterfront warehouse he wears a sober frown. Now under a dusky sky. David walks across a deserted shipping dock. He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge gazing toward the low sun. In her apartment Elise sits at the foot of her bed eyeing a document. She sets it aside then lifts her troubled gaze. Now David approaches the ragged bar. As David disappears inside Harry emerges from a neighboring door. Inside David sits forlornly at the bar. The bartender hands him a slip of paper. David stares after her then reads the note. At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse. In the evening he leans on the wall waiting. Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath. He gives a grave shake of the head then takes a seat on a stack of shipping pallets."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He holds her for another moment then pulls away and glances at her. He forces a faint smile. Elise gives him a tender look. He turns away and she watches him with concerned eyes. As he trudges out of the emergency room a discouraged expression crosses her face. Exiting the ER. David walks down a corridor his pained eyes staring straight ahead. A view from behind shows his lone form filing down the long hospital hallway. Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City. Harry's gaze stays trained ahead. Meanwhile Elise sits alone in the hospital waiting room. Now David approaches the ragged bar. As David disappears inside Harry emerges from a neighboring door. Inside David sits forlornly at the bar. The bartender hands him a slip of paper. David stares after her then reads the note. At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse. In the evening he leans on the wall waiting. Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath. He gives a grave shake of the head then takes a seat on a stack of shipping pallets."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He holds her for another moment then pulls away and glances at her. He forces a faint smile. Elise gives him a tender look. He turns away and she watches him with concerned eyes. As he trudges out of the emergency room a discouraged expression crosses her face. Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella. He joins David. Harry lowers his gaze and takes a deep breath. He gives a grave shake of the head then takes a seat on a stack of shipping pallets."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The eagle perches near the cactus for another moment, then leaps away and flutters at the cactus. The eagle flashes a faint frown. Joanna sends the eagle a boisterous smirk. The eagle pivots away, and the cactus examines the eagle with amused lenses. As the eagle tiptoes out of the bakery, a cheerful feeling crosses the cactus's face. Departing the bakery, Thomas floats through a corridor, his happy lenses studying leftward. A view from above shows his paired form floating down the short meadow walkway. Now in a petite room lined with feathers, Anderson confronts Lucy at a window overlooking Las Vegas. Lucy's stare remains tilting backward. Meanwhile, Joanna lounges with bears in the park watching space. She yawns gently, then taps her toes. Now a companion swings Joanna in a hammock. They wander in. Lucy sends the eagle a proud frown. Anderson removes his helmet, gives Lucy a tap on the shoulder, and drifts off, leaving the older gardener with flowers at the edge of the old-century dormitory. Eighteen days earlier, now on a snowy mountain, Thomas flies a dark canyon. Later, behind a forest and hills, he addresses a parade. Standing on a cruise ship, Betty and a chef read an advertisement in the vessel’s brochure. Betty wanders below deck. As Thomas greets his bakers, the fashion designer stands on a swing set and sketches a recipe. He marks a line, crumples it up, and grins joyfully to himself. As artists gather, Thomas faces him. Betty holds out the recipe. A puzzle book entry sketches maps of Joanna, one diving, the other with a pen. Thomas glances at the sketch, his lips open. As he vanishes, Betty stares after him with wide eyes. Sitting inside a mountain cave, she wears a vibrant grin. Now under a starry horizon, Thomas floats through a populated wheat field. He cautiously carries his wings through a tiny swirling whirlwind and lands at the corner's ridge, soaring over the tall clouds. In his studio, Joanna lounges at the edge of a sofa, squinting at a postcard. She tosses it aside, then drops her curious stare. Now Thomas approaches the crimson gate. As Thomas slips outside, Lucy appears from a distant tent. Inside, Thomas lounges merrily on the ledge. The driver hands him a piece of wood. Thomas glances after them, then studies the carving. At dawn, under gentle snow, he drapes his scarf over his arms as he strolls along a path to a library. In the morning, he kneels on the floor, pondering. Lucy arrives in a helmet and raincoat, shielded from the snow by a parasol. She faces Thomas. Lucy lifts her smile and exhales a deep laugh. She gives a bright nod of the ears, then rises to a stage of gym mats."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David and Elise share a tender moment in the hospital before he leaves with a pained expression. Alone, Elise struggles with her emotions. Meanwhile, David appears eleven months later on a farm, speaking to a crowd during a campaign. As he reviews a newspaper with his campaign chairman Charlie, he is struck by a photo of Elise in the arts section, prompting introspection. Later, David walks across a deserted dock under a dusky sky. Elise, in her apartment, contemplates a document with a troubled expression. David visits a bar and receives a note, which he reads before running through the rain to a warehouse at dusk. There, he waits until Harry arrives, and the two share a silent, grave exchange, with Harry shaking his head before sitting on a stack of pallets."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He gives a grave shake of the head then takes a seat on a stack of shipping pallets Harry lowers his gaze and takes a deep breath He joins David Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella In the evening he leans on the wall waiting At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse David stares after her then reads the note The bartender hands him a slip of paper Inside David sits forlornly at the bar As David disappears inside Harry emerges from a neighboring door Now David approaches the ragged bar She sets it aside then lifts her troubled gaze In her apartment Elise sits at the foot of her bed eyeing a document He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge gazing toward the low sun David walks across a deserted shipping dock Now under a dusky sky Seated outside a waterfront warehouse he wears a sober frown As he leaves Charlie gazes after him with pursed lips David stares at the photo his brow cinched An arts section feature shows photos of Elise one dancing the other with a bow Charlie holds out the newspaper As voters disperse David joins him He browses a page folds it up and frowns thoughtfully to himself As David greets his supporters the campaign chairman sits on a picnic table and reads a newspaper Charlie heads outside Sitting in a campaign bus Charlie and an aide watch a news report on the vehicle's TV Later in front of a barn and silos he addresses a crowd Eleven months later now on a sunny farm David walks a green pasture Richardson puts on his fedora gives Harry a pat on the arm and walks off leaving the younger officer alone at the window of the midcentury highrise Harry gives him a skeptical look They head out Now a friend pushes Elise in a wheelchair She blinks back tears then shakes her head Meanwhile Elise sits alone in the hospital waiting room Harry's gaze stays trained ahead Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City A view from behind shows his lone form filing down the long hospital hallway David walks down a corridor his pained eyes staring straight ahead Exiting the ER As he trudges out of the emergency room a discouraged expression crosses her face He turns away and she watches him with concerned eyes Elise gives him a tender look He forces a faint smile He holds her for another moment then pulls away and glances at her"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He forces a faint smile He holds her for another moment then pulls away and glances at her He turns away and she watches him with concerned eyes Elise gives him a tender look Exiting the ER As he trudges out of the emergency room a discouraged expression crosses her face A view from behind shows his lone form filing down the long hospital hallway David walks down a corridor his pained eyes staring straight ahead Harry's gaze stays trained ahead Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City She blinks back tears then shakes her head Meanwhile Elise sits alone in the hospital waiting room They head out Now a friend pushes Elise in a wheelchair Richardson puts on his fedora gives Harry a pat on the arm and walks off leaving the younger officer alone at the window of the midcentury highrise Harry gives him a skeptical look Later in front of a barn and silos he addresses a crowd Eleven months later now on a sunny farm David walks a green pasture Charlie heads outside Sitting in a campaign bus Charlie and an aide watch a news report on the vehicle's TV He browses a page folds it up and frowns thoughtfully to himself As David greets his supporters the campaign chairman sits on a picnic table and reads a newspaper Charlie holds out the newspaper As voters disperse David joins him David stares at the photo his brow cinched An arts section feature shows photos of Elise one dancing the other with a bow Seated outside a waterfront warehouse he wears a sober frown As he leaves Charlie gazes after him with pursed lips David walks across a deserted shipping dock Now under a dusky sky In her apartment Elise sits at the foot of her bed eyeing a document He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge gazing toward the low sun Now David approaches the ragged bar She sets it aside then lifts her troubled gaze Inside David sits forlornly at the bar As David disappears inside Harry emerges from a neighboring door David stares after her then reads the note The bartender hands him a slip of paper In the evening he leans on the wall waiting At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse He joins David Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella He gives a grave shake of the head then takes a seat on a stack of shipping pallets Harry lowers his gaze and takes a deep breath"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As voters disperse David joins him Charlie holds out the newspaper An arts section feature shows photos of Elise one dancing the other with a bow David stares at the photo his brow cinched As he leaves Charlie gazes after him with pursed lips Seated outside a waterfront warehouse he wears a sober frown Now under a dusky sky David walks across a deserted shipping dock He carelessly tracks his feet through a large glassy puddle and stops at the dock's edge gazing toward the low sun In her apartment Elise sits at the foot of her bed eyeing a document She sets it aside then lifts her troubled gaze Now David approaches the ragged bar As David disappears inside Harry emerges from a neighboring door Inside David sits forlornly at the bar The bartender hands him a slip of paper David stares after her then reads the note At dusk under pouring rain he holds his jacket over his head as he runs along a dock to a warehouse In the evening he leans on the wall waiting Harry arrives in a fedora and trench coat sheltered from the rain by an umbrella He joins David Harry lowers his gaze and takes a deep breath He gives a grave shake of the head then takes a seat on a stack of shipping pallets He holds her for another moment then pulls away and glances at her He forces a faint smile Elise gives him a tender look He turns away and she watches him with concerned eyes As he trudges out of the emergency room a discouraged expression crosses her face Exiting the ER David walks down a corridor his pained eyes staring straight ahead A view from behind shows his lone form filing down the long hospital hallway Now in a vast hallway lined with marble Richardson joins Harry at a window overlooking New York City Harry's gaze stays trained ahead Meanwhile Elise sits alone in the hospital waiting room She blinks back tears then shakes her head Now a friend pushes Elise in a wheelchair They head out Harry gives him a skeptical look Richardson puts on his fedora gives Harry a pat on the arm and walks off leaving the younger officer alone at the window of the midcentury highrise Eleven months later now on a sunny farm David walks a green pasture Later in front of a barn and silos he addresses a crowd Sitting in a campaign bus Charlie and an aide watch a news report on the vehicle's TV Charlie heads outside As David greets his supporters the campaign chairman sits on a picnic table and reads a newspaper He browses a page folds it up and frowns thoughtfully to himself"
        }
      ]
    }
  ]
}