{
  "ground_truth": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street. Fording through it, he leads Elise out onto a grassy island. Looking up, she sees the Statue of Liberty towering above. David spots a pair of doors, crosses to them, and faces Elise. Elise's eyes pool with tears. She hangs her head and then takes in David's earnest expression. A tear rolls down her cheek. She swallows and nods bravely. Elise goes to him and takes his hand. They face a set of double doors. David takes hold of the right hand knob. They turn the knobs, and the doors open to a long hallway with a polished marble floor. As they enter, the doors shut behind them. On the street, Thompson and his aide gawk. Their plan book shows David and Elise's pathway has united, and intermittent red dots flash in a column. At the bureau, Harry reads the same in his plan book. With a grave look, he steps away. David and Elise push open a pair of doors and enter the bureau reading room. David knocks a staffer out of the way. Leaving Elise behind him, he shoves another. They race along a walkway bordering the room. David finds a door, and they hurry through. Thompson and his staff enter the reading room. Bureau members stare as they march down the center aisle. Meanwhile, David and Elise hurry up a palatial spiral staircase. In the reading room, Thompson leads his team to the peripheral walkway, then the door. David glances upward. The flights of stairs seem to continue infinitely. Now in a white marble hall. The staffer holds out a large manila envelope. Harry grimly takes it, heads back down the hall, and turns out of view. Now a black-garbed intervention team passes through a columned archway. Thompson and his staff jog up the spiraling stairway. At a landing, he slides open a door of bronze bars. Now David and Elise reach a hallway. He takes her hand, and they hurry on. David peers over his shoulder. They reach a door, glance about, and go through. In a green-carpeted office, a bookish receptionist looks up. The two intruders run through a series of identical offices. David offers a staffer a cordial wave as he and Elise proceed through the offices. Now the black-clad intervention team marches into a records archive where rows of bookcases shelve white-spine volumes. David and Elise arrive in another identical records room. Reaching the far end, they find two intervention teams approaching. David leads Elise through more of the bafflingly connected records rooms. Finding a dark green door framed in green marble, he desperately yanks it open.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text using synonyms where possible:\n\nDavid pauses an approaching automobile by raising a hand and draws Elise securely across the road. Wading through it, he guides Elise out onto a verdant isle. Gazing upwards, she notices the Statue of Liberty looming overhead. David notices a couple of portals, traverses to them, and confronts Elise. Elise's eyes fill with tears. She lowers her head and then absorbs David's sincere visage. A droplet rolls down her face. She gulps and nods courageously. Elise goes to him and grasps his hand. They face a pair of double portals. David grips the right-hand handle. They rotate the handles, and the portals swing open to a lengthy corridor with a glossy marble floor. As they enter, the portals close behind them. On the street, Thompson and his aide gape. Their scheme book reveals David and Elise's route has merged, and sporadic crimson dots blink in a column. At the agency, Harry perceives the same in his scheme book. With a solemn expression, he steps aside. David and Elise thrust open a couple of portals and enter the agency reading area. David knocks a worker out of the path. Leaving Elise behind him, he pushes another. They sprint along a pathway bordering the area. David locates a portal, and they hasten through. Thompson and his team enter the reading area. Agency members observe as they stride down the central aisle. Meanwhile, David and Elise rush up a grand spiral staircase. In the reading area, Thompson leads his crew to the outer pathway, then the portal. David glances upward. The flights of stairs seem to continue endlessly. Now in a white marble corridor. The worker extends a large manila packet. Harry somberly takes it, heads back down the corridor, and turns out of sight. Now a black-attired intervention team passes through a columned arch. Thompson and his team jog up the winding stairway. At a landing, he slides open a portal of bronze bars. Now David and Elise reach a corridor. He grasps her hand, and they hurry onward. David glances over his shoulder. They reach a portal, glance around, and go through. In a green-carpeted office, a scholarly receptionist looks up. The two intruders dash through a series of identical offices. David offers a worker a polite wave as he and Elise proceed through the offices. Now the black-clad intervention team marches into a records vault where rows of bookcases store white-spine tomes. David and Elise arrive in another identical records chamber. Reaching the far extremity, they encounter two intervention teams approaching. David leads Elise through more of the perplexingly linked records chambers. Discovering a dark green portal framed in green marble, he frantically yanks it open."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "David halts an oncoming car by a hand being held up by him, and Elise is pulled safely across the street by him. They are led by David out onto a grassy island after fording through it. The Statue of Liberty is seen towering above by her when she looks up. A pair of doors is spotted by David, and he crosses to them, facing Elise. Tears pool in Elise's eyes. Her head is hung by her, and then David's earnest expression is taken in by her. A tear is rolled down her cheek. A swallow is made by her, and she bravely nods. David is gone to by Elise, and his hand is taken by her. A set of double doors is faced by them. The right-hand knob is taken hold of by David. The knobs are turned by them, and a long hallway with a polished marble floor appears as the doors are opened. As they enter, the doors are shut behind them. On the street, Thompson and his aide gawk. Their plan book, showing David and Elise's pathways uniting and intermittent red dots flashing in a column, is revealed by them. At the bureau, the same is read by Harry in his plan book. With a grave look, he steps away. A pair of doors is pushed open by David and Elise, and the bureau reading room is entered by them. A staffer is knocked out of the way by David. Another is shoved by him, leaving Elise behind. Along a walkway bordering the room, they race. A door is found by David, and they hurry through. The reading room is entered by Thompson and his staff. As they march down the center aisle, bureau members stare. Meanwhile, a palatial spiral staircase is hurried up by David and Elise. In the reading room, Thompson leads his team to the peripheral walkway, then the door. Upward, David glances. The flights of stairs seem to continue infinitely. Now, a white marble hall is occupied by them. A large manila envelope is held out by the staffer, and it is grimly taken by Harry, who heads back down the hall and turns out of view. Now, through a columned archway, a black-garbed intervention team passes. The spiraling stairway is jogged up by Thompson and his staff. At a landing, a door of bronze bars is slid open by him. Now, a hallway is reached by David and Elise. Her hand is taken by him, and they hurry on. Over his shoulder, David peers. A door is reached by them, glanced about, and gone through. In a green-carpeted office, the bookish receptionist looks up. Through a series of identical offices, the two intruders run. A cordial wave is offered to a staffer by David as he and Elise proceed through the offices. Now, a records archive is marched into by the black-clad intervention team, where rows of bookcases shelve white-spine volumes. Another identical records room is arrived at by David and Elise. At the far end, two intervention teams are found approaching. Elise is led by David through more of the bafflingly connected records rooms. A dark green door framed in green marble is yanked open desperately by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David stops a car with his hand and guides Elise safely across the street to a grassy island, where the Statue of Liberty looms above. Spotting doors, he leads Elise there. Her eyes fill with tears, but she nods bravely and takes his hand. They open the double doors, revealing a marble-floored hallway. As they enter, the doors close behind. Thompson and his aide are surprised as their plan book shows David and Elise's paths united with flashing red dots. Harry sees the same and steps away gravely. In the bureau reading room, David knocks a staffer aside and races with Elise along a walkway. They find a door and hurry through. Thompson and his team enter, observed by bureau members. David and Elise ascend a palatial spiral staircase. Thompson's team follows up the stairs. In a white marble hall, Harry receives a large envelope and leaves. A black-garbed intervention team passes through an archway, pursuing David and Elise. They open a door on a landing and continue. In a green-carpeted office, a receptionist watches as they run through a series of identical offices. David waves cordially to a staffer as they pass. The intervention team enters a records archive. David and Elise, facing intervention teams in another records room, find a dark green door framed in green marble and desperately pull it open."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David stops a car with a hand signal and guides Elise across the street to a grassy island, where they see the Statue of Liberty. David finds doors, and Elise, tearing up, bravely nods. Holding hands, they open the doors to a long marble hallway. Outside, Thompson and an aide see David and Elise's path merging in their plan book; Harry at the bureau sees the same. David and Elise enter the bureau reading room, pushing through staff. Thompson's team enters, prompting stares. David and Elise race up a spiral staircase; Thompson's team follows. They reach a white marble hall. A staffer gives Harry a large envelope. An intervention team enters. David and Elise continue, hurrying through offices. They reach a records archive, navigating through rooms and intervention teams. At last, David yanks open a green marble-framed door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David brings the fast-approaching car to a halt simply by holding up his hand, effectively stopping it in its tracks, and quickly pulls Elise safely across the bustling street. Navigating through the urban chaos, he guides Elise to a grassy island of calm in the midst of the city. As Elise looks up, her eyes widen, taking in the iconic sight of the Statue of Liberty majestically towering above them. Meanwhile, David notices a pair of doors nearby, and with determination, crosses over to them, turning to face Elise. Her eyes are full, pooling with tears as she drops her head in a moment of vulnerability before lifting it to meet David’s earnest, sincere gaze. One tear escapes, rolling down her cheek, as she swallows hard and bravely nods in affirmation. Elise approaches David, reaching out to take his hand in hers. Together, they stand facing a set of grand double doors. David extends his hand to grasp the knob on the right, and with a concerted effort, they turn the knobs simultaneously. The doors swing open, revealing a long hallway with a floor of polished marble. As they step inside, the doors quietly close behind them, sealing them from the world outside. Back on the street, Thompson and his aide stand, mouths agape. Their plan book now indicates that David and Elise's paths have converged, with intermittent red dots flashing up in a linear column. At the bureau, Harry observes the same alignment in his plan book, and with a serious expression, he turns away. David and Elise push open another set of doors, entering the bureau's reading room. In their haste, David inadvertently knocks a staffer aside, leaving Elise momentarily behind him. He shoves another out of their path as they sprint along a walkway that skirts the room. David spots yet another door, and together they hurry through it. Meanwhile, Thompson and his team enter the reading room. The bureau members inside look on, astonished, as Thompson leads his team down the central aisle. At the same time, David and Elise are racing up a grand, palatial spiral staircase. In the reading room, Thompson directs his team towards the peripheral walkway and onward to the door. David glances upwards, noting with some trepidation how the flights of stairs seem to stretch on infinitely. As they reach a white marble hall, a staffer offers a large manila envelope. Harry, looking grim, takes it before heading back down the hall and disappearing from sight. Now, a black-clad intervention team swiftly moves through a columned archway. Thompson and his staff begin jogging up the spiraling stairway. At a landing, Thompson deftly slides open a door made of bronze bars. Meanwhile, David and Elise enter a hallway. He firmly grips her hand, and together they hurry forward. David casts a cautious glance over his shoulder. They reach another door, discreetly look around, and slip through it. Inside a green-carpeted office, a studious receptionist glances up. The pair of intruders runs through a succession of identical offices. David, ever courteous, gives a staffer a friendly wave as he and Elise proceed. Soon, the black-garbed intervention team files into a records archive where orderly rows of bookcases hold countless white-spine volumes. David and Elise arrive in yet another identical records room. At the room’s far end, they find two intervention teams advancing towards them. With urgency, David leads Elise through additional interconnected records rooms. Finally, they spot a dark green door, framed by green marble, and David, filled with desperation, yanks it open."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David expertly halts the swiftly approaching car by raising his hand, causing it to come to an immediate stop right in its tracks, allowing him to swiftly and safely pull Elise across the bustling and chaotic street. As they navigate through the urban commotion and chaos surrounding them, David guides Elise to a small, grassy island of tranquility amidst the vibrant and dynamic city. As Elise raises her eyes, they widen with wonder, taking in the iconic and awe-inspiring sight of the Statue of Liberty majestically towering above them in all its grandeur. Meanwhile, David's attention is drawn to a pair of doors situated nearby. With a sense of determination and purpose, he makes his way over to these doors and then turns to face Elise. Her eyes are filled with emotion, pooled with unshed tears, as she lowers her head in a moment of vulnerability before lifting it to meet David’s earnest and sincere gaze. A single tear escapes, gently rolling down her cheek, as she swallows hard and bravely nods in affirmation. Elise steps forward towards David, reaching out with grace to take his hand in her own. Together, they stand side by side, facing an imposing set of grand double doors. David extends his hand confidently to grasp the knob on the right, and with concerted effort and unity, they turn both knobs simultaneously. The massive doors swing open, revealing a long corridor with a floor gleaming with polished marble. As they step purposefully inside, the doors quietly close behind them, sealing them away from the world outside.\n\nBack on the busy street, Thompson and his aide stand frozen, their mouths agape in disbelief. Their plan book now indicates that David and Elise’s paths have indeed converged, with intermittent red dots flashing ominously up in a linear column. At the bureau, Harry observes the same alignment depicted in his plan book, and with a serious expression, he turns away to contemplate their next move. David and Elise push open yet another set of imposing doors, entering the bureau’s esteemed reading room. In their haste and urgency, David inadvertently knocks a staffer aside, leaving Elise temporarily behind him. He hurriedly shoves another out of their path as they sprint with purpose along a walkway that skirts the room. David quickly spots yet another door up ahead, and together they hurry through it with determination. Meanwhile, Thompson and his team make their entrance into the reading room, and the bureau members inside look on, astonished and wide-eyed, as Thompson leads his team down the central aisle with purpose. At the same time, David and Elise are racing up a grand, palatial spiral staircase, their footsteps echoing in the vast space. In the reading room below, Thompson directs his team towards the peripheral walkway and onward to the door in pursuit. David glances upwards nervously, noting with some trepidation how the flights of stairs seem to stretch on infinitely into the distance. As they reach a white marble hall, a staffer approaches and offers a large manila envelope. Harry, looking grim and resolute, takes it before heading back down the hall and eventually disappearing from sight. Now, a black-clad intervention team swiftly moves through a columned archway, adding to the tension. Thompson and his staff begin jogging up the spiraling stairway with determination and urgency. At a landing, Thompson deftly slides open a door made of imposing bronze bars. Meanwhile, David and Elise enter a long hallway. He firmly grips her hand, and together they hurry forward with urgency. David casts a cautious glance over his shoulder, ensuring they are not being followed. They reach another door, discreetly looking around before slipping through it. Inside a green-carpeted office, a studious receptionist glances up in surprise. The pair of intruders, undeterred, runs through a succession of identical offices. David, ever courteous despite the circumstances, gives a staffer a friendly wave as he and Elise proceed onward with determination. Soon, the black-garbed intervention team files into a records archive where orderly rows of bookcases hold countless white-spined volumes, adding to the sense of urgency. David and Elise arrive in yet another identically structured records room. At the room’s far end, they find two intervention teams advancing towards them with intent. With a sense of urgency and resolve, David leads Elise through additional interconnected records rooms. Finally, they spot a dark green door, framed by elegant green marble, and David, filled with both desperation and determination, yanks it open with force."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David stands firm and raises his hand to halt an oncoming car, creating a safe passage across the street for Elise. As they ford through the street together, David guides Elise onto a grassy island, ensuring she is secure. Once on the island, Elise lifts her gaze to take in the imposing sight of the Statue of Liberty towering above them. David, focused on their plan, spots a pair of doors and purposefully crosses over to them, turning to face Elise. Her eyes fill with tears, and she lowers her head momentarily, then looks up to see David's earnest expression. A tear escapes down her cheek as she swallows hard and nods with a brave resolve. Elise moves toward David, taking his hand in hers. Together, they stand before the set of double doors, with David reaching out to grasp the right-hand knob. They simultaneously turn the knobs, and the doors swing open to reveal a long hallway with a polished marble floor. The pair steps inside, and as they do, the doors close behind them with a definitive thud. Out on the street, Thompson and his aide watch in astonishment. Their plan book now indicates that David and Elise's paths have merged, displaying intermittent flashing red dots in a column. Over at the bureau, Harry sees the same alignment in his plan book, and with a somber expression, he steps away. Meanwhile, David and Elise push open another pair of doors, entering the bureau reading room. In the urgency of the moment, David knocks a staffer aside and, leaving Elise in his wake, shoves another out of their path. They sprint along a walkway that skirts the room. David quickly identifies a door, and they rush through it without hesitation. Thompson and his staff make their entrance into the reading room, while bureau members watch intently as they stride down the central aisle. Meanwhile, David and Elise hasten up a grand spiral staircase. Back in the reading room, Thompson directs his team to the peripheral walkway and then toward the door. As David glances upward, the staircase seems to stretch indefinitely into the heights. Now in a pristine white marble hall, a staffer extends a large manila envelope toward Harry, who takes it with a grim air and heads back down the hall, vanishing from sight. Simultaneously, a black-garbed intervention team moves through a columned archway as Thompson and his staff pick up their pace on the spiraling stairway. At a landing, Thompson forcefully slides open a door made of bronze bars. David and Elise, having reached a new hallway, grasp each other's hand once more and hurry forward. David casts a quick look over his shoulder, ensuring they aren't being followed too closely. They come upon a door, exchange a glance, and push through it, finding themselves in a green-carpeted office where a bookish receptionist looks up in surprise. The two intruders rush through a sequence of nearly identical offices, with David offering a cordial wave to a staffer in passing as they continue. Meanwhile, the intervention team clad in black enters a records archive, surrounded by rows upon rows of bookcases holding white-spine volumes. David and Elise soon arrive in another identical records room, only to find two intervention teams converging on their position. David, determined to evade capture, leads Elise through more of the confusingly interconnected records rooms. At last, spotting a dark green door set within a frame of green marble, David urgently pulls it open, seeking their next move."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David stops an oncoming car with a raised hand, escorts Elise across the street onto a grassy island, and they both take in the looming Statue of Liberty. Spotting a pair of doors, David leads Elise to them, where she tearfully acknowledges his earnestness and holds his hand. They open the doors to a long, marble-floored hallway, entering as the doors close behind them. Outside, Thompson and his aide note their united path in a plan book, which Harry reads gravely at the bureau. \n\nDavid and Elise burst into the bureau reading room, with David knocking aside staff as they race along the walkway. They find a door and rush through it, while Thompson and his team pursue them down the center aisle, heading to the peripheral walkway and door. Ascending a spiraling staircase, David sees the seemingly endless flights above. Meanwhile, Harry receives a large envelope in a white marble hall, takes it, and disappears from view as a black-clad intervention team enters. As Thompson and his team ascend the stairway, David and Elise reach a hallway, hurry through a door, and navigate a green-carpeted office, passing a receptionist and running through identical offices, with David offering a cordial wave to a staffer. \n\nThe intervention team enters a records archive with rows of white-spined volumes. David and Elise maneuver through more records rooms, avoiding incoming intervention teams, and finally arrive at a green-marble-framed dark green door that David desperately pulls open."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street, reminiscent of the training given to traffic wardens in busy urban areas. Fording through it, he leads Elise out onto a grassy island, a term often used for a refuge island in pedestrian zones, providing a safe spot amidst traffic. Looking up, she sees the Statue of Liberty towering above, the iconic symbol of freedom and democracy in New York Harbor. David spots a pair of doors, reminiscent of the grand entrances often seen in historic government buildings, crosses to them, and faces Elise. Elise's eyes pool with tears. She hangs her head and then takes in David's earnest expression, much like a character in a dramatic film scene. A tear rolls down her cheek. She swallows and nods bravely, the way a soldier might before heading into battle. Elise goes to him and takes his hand. They face a set of double doors, similar to those found in grand theaters. David takes hold of the right-hand knob, made of polished brass, and turns it open. They turn the knobs, and the doors open to a long hallway with a polished marble floor, recalling the opulence of a classic European palace. As they enter, the doors shut behind them with the weighty finality of a bank vault. On the street, Thompson and his aide gawk with expressions of disbelief, akin to spies realizing their mission has been compromised. Their plan book shows David and Elise's pathway has united, and intermittent red dots flash in a column, much like a GPS tracker used in high-security operations. At the bureau, Harry reads the same in his plan book. With a grave look, he steps away, knowing the importance of their union. David and Elise push open a pair of doors and enter the bureau reading room, filled with shelves resembling an ancient library. David knocks a staffer out of the way with the urgency of a man pursued. Leaving Elise behind him, he shoves another, feeling the adrenaline rush of a high-stakes chase. They race along a walkway bordering the room, similar to the galleries of a historic courthouse. David finds a door, and they hurry through. Thompson and his staff enter the reading room, their presence as commanding as a military squad. Bureau members stare as they march down the center aisle, the way spectators might in a theater. Meanwhile, David and Elise hurry up a palatial spiral staircase, reminiscent of those in a grand chateau. In the reading room, Thompson leads his team to the peripheral walkway, then the door, with the precision of a well-rehearsed drill. David glances upward. The flights of stairs seem to continue infinitely, evoking the endless staircases in optical illusion art. Now in a white marble hall, the staffer holds out a large manila envelope, often used in delivering crucial documents. Harry grimly takes it, heads back down the hall, and turns out of view, like a messenger with dire news. Now a black-garbed intervention team passes through a columned archway, reminiscent of elite special forces. Thompson and his staff jog up the spiraling stairway, their steps echoing the urgency of an emergency response. At a landing, he slides open a door of bronze bars, like the gates of a secure vault. Now David and Elise reach a hallway. He takes her hand, and they hurry on, moving with the determination of fugitives seeking freedom. David peers over his shoulder. They reach a door, glance about, and go through, entering a green-carpeted office, an architectural touch often found in prestigious institutions. A bookish receptionist looks up, startled, like a proctor in a silent library. The two intruders run through a series of identical offices, reminiscent of a labyrinth. David offers a staffer a cordial wave as he and Elise proceed through the offices, a gesture of civility amidst chaos. Now the black-clad intervention team marches into a records archive where rows of bookcases shelve white-spine volumes, akin to a national archive. David and Elise arrive in another identical records room. Reaching the far end, they find two intervention teams approaching, as if trapped in a strategic pincer movement. David leads Elise through more of the bafflingly connected records rooms, akin to corridors of a government labyrinth. Finding a dark green door framed in green marble, he desperately yanks it open, like an escape hatch in an espionage thriller."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street. Fording through it he leads Elise out onto a grassy island. Looking up she sees the Statue of Liberty towering above. David spots a pair of doors crosses to them and faces Elise. Elise's eyes pool with tears. She hangs her head and then takes in David's earnest expression. A tear rolls down her cheek. She swallows and nods bravely. Elise goes to him and takes his hand. They face a set of double doors. David takes hold of the right hand knob. They turn the knobs and the doors open to a long hallway with a polished marble floor. As they enter the doors shut behind them. On the street Thompson and his aide gawk. Their plan book shows. David and Elise's pathway has united and intermittent red dots flash in a column. At the bureau Harry reads the same in his plan book. With a grave look he steps away. David and Elise push open a pair of doors and enter the bureau reading room. David knocks a staffer out of the way. Leaving Elise behind him he shoves another. They race along a walkway bordering the room. David finds a door and they hurry through. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Thompson and his staff enter the reading room. Bureau members stare as they march down the center aisle. Meanwhile David and Elise hurry up a palatial spiral staircase. In the reading room Thompson leads his team to the peripheral walkway then the door. David glances upward. The flights of stairs seem to continue infinitely. Now in a white marble hall. The staffer holds out a large manila envelope. Harry grimly takes it heads back down the hall and turns out of view. Now a blackgarbed intervention team passes through a columned archway. Thompson and his staff jog up the spiraling stairway. At a landing he slides open a door of bronze bars. Now David and Elise reach a hallway. He takes her hand and they hurry on. David peers over his shoulder. They reach a door glance about and go through. In a greencarpeted office a bookish receptionist looks up. The two intruders run through a series of identical offices. David offers a staffer a cordial wave as he and Elise proceed through the offices. Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes. David and Elise arrive in another identical records room. Reaching the far end they find two intervention teams approaching. David leads Elise through more of the bafflingly connected records rooms. Finding a dark green door framed in green marble he desperately yanks it open."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street. Fording through it he leads Elise out onto a grassy island. Looking up she sees the Statue of Liberty towering above. David spots a pair of doors crosses to them and faces Elise. Elise's eyes pool with tears. She hangs her head and then takes in David's earnest expression. A tear rolls down her cheek. She swallows and nods bravely. Elise goes to him and takes his hand. They face a set of double doors. David takes hold of the right hand knob. They turn the knobs and the doors open to a long hallway with a polished marble floor. As they enter the doors shut behind them. On the street Thompson and his aide gawk. Their plan book shows. David and Elise's pathway has united and intermittent red dots flash in a column. At the bureau Harry reads the same in his plan book. With a grave look he steps away. David and Elise push open a pair of doors and enter the bureau reading room. David knocks a staffer out of the way. Leaving Elise behind him he shoves another. They race along a walkway bordering the room. David finds a door and they hurry through. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Thompson and his staff enter the reading room. Bureau members stare as they march down the center aisle. Meanwhile David and Elise hurry up a palatial spiral staircase. In the reading room Thompson leads his team to the peripheral walkway then the door. David glances upward. The flights of stairs seem to continue infinitely. Now in a white marble hall. The staffer holds out a large manila envelope. Harry grimly takes it heads back down the hall and turns out of view. Now a blackgarbed intervention team passes through a columned archway. Thompson and his staff jog up the spiraling stairway. At a landing he slides open a door of bronze bars. Now David and Elise reach a hallway. He takes her hand and they hurry on. David peers over his shoulder. They reach a door glance about and go through. In a greencarpeted office a bookish receptionist looks up. The two intruders run through a series of identical offices. David offers a staffer a cordial wave as he and Elise proceed through the offices. Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes. David and Elise arrive in another identical records room. Reaching the far end they find two intervention teams approaching. David leads Elise through more of the bafflingly connected records rooms. Finding a dark green door framed in green marble he desperately yanks it open."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street. Fording through it he leads Elise out onto a grassy island. Looking up she sees the Statue of Liberty towering above. David spots a pair of doors crosses to them and faces Elise. Elise's eyes pool with tears. She hangs her head and then takes in David's earnest expression. A tear rolls down her cheek. She swallows and nods bravely. Elise goes to him and takes his hand. They face a set of double doors. David takes hold of the right hand knob. They turn the knobs and the doors open to a long hallway with a polished marble floor. Now David and Elise reach a hallway. He takes her hand and they hurry on. David peers over his shoulder. They reach a door glance about and go through. In a greencarpeted office a bookish receptionist looks up. The two intruders run through a series of identical offices. David offers a staffer a cordial wave as he and Elise proceed through the offices. Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes. David and Elise arrive in another identical records room. Reaching the far end they find two intervention teams approaching. David leads Elise through more of the bafflingly connected records rooms. Finding a dark green door framed in green marble he desperately yanks it open."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "David halts an oncoming car by holding up a hand and pulls Elise safely across the street. Fording through it he leads Elise out onto a grassy island. Looking up she sees the Statue of Liberty towering above. David spots a pair of doors crosses to them and faces Elise. Elise's eyes pool with tears. Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes. David and Elise arrive in another identical records room. Reaching the far end they find two intervention teams approaching. David leads Elise through more of the bafflingly connected records rooms. Finding a dark green door framed in green marble he desperately yanks it open."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Lily stops an approaching motorcycle by waving a clipboard and drags Jack carefully over the rooftop. Floating on it, she escorts Jack onto a sandy peninsula. Glancing down, he notices the Eiffel Tower leaning below. Lily observes a group of windows, strolls toward them, and confronts Jack. Jack's eyebrows flood with rain. He raises his chin and then absorbs Lily's solemn demeanor. A raindrop slides across his forehead. He inhales deeply and grins boldly. Jack goes to her and grabs her umbrella. They approach a series of single windows. Lily grabs hold of the left curtain rod. They twist the rods, and the windows reveal a short corridor with a tiled wooden ceiling. As they exit, the windows close ahead of them. On the rooftop, Benson and his colleague blink. Their game plan shows Jack and Lily's route has diverged, and random blue stars blink in a row. At the station, Clara sees the same in her game plan. With a serious expression, she strolls away. Jack and Lily slide apart a group of windows and exit the station gathering space. Jack nudges a librarian aside. Guiding Lily in front of him, he nudges another. They dash along a bridge skirting the space. Jack discovers a window, and they slip through. Benson and his group enter the gathering space. Station members gawk as they parade along the side lane. Meanwhile, Jack and Lily dash down a cramped metallic ramp. In the gathering space, Benson directs his crew to the central bridge, then the window. Jack glances downward. The rows of windows seem to close endlessly. Now in a black wooden room. The librarian holds out a tiny red folder. Clara happily grabs it, heads up the room, and disappears from sight. Now a white-robed observation team slips through a wooden archway. Benson and his crew sprint down the winding ramp. At a platform, he swings open a window of silver mesh. Now Jack and Lily reach a tunnel. He grabs her arm, and they hustle forward. Jack glances under his feet. They reach a window, look inside, and pass through. In a blue-tiled cubicle, a tech-savvy cashier glances up. The two observers dash through a series of similar cubicles. Jack tips a librarian a gracious nod as he and Lily wander through the cubicles. Now the white-cloaked observation team strides into a document vault where stacks of bookcases store black-binder tomes. Jack and Lily enter another similar document chamber. Reaching the near end, they encounter four observation teams nearing. Jack guides Lily through more of the confusingly linked document chambers. Discovering a light pink window bordered in pink metal, she eagerly pulls it shut."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David stops a car to safely guide Elise across the street, leading her to a grassy island near the Statue of Liberty. Spotting doors, they open them to find a marble hallway, and the doors close behind them. Thompson and his aide realize David and Elise's paths have merged, indicated by flashing red dots in their plan book. At the bureau, Harry solemnly notes the same. David and Elise push through to the bureau reading room, knocking staff aside as they race along a walkway. Thompson and his staff enter the room, following David and Elise up a spiral staircase. David notices the seemingly endless stairs. In a marble hall, Harry takes a large envelope and departs. A black-garbed team enters. Thompson and his team pursue up the stairs. David and Elise reach a hallway, holding hands, and hurry through a green-carpeted office, passing a receptionist and staffer while navigating identical offices. They encounter two intervention teams in a records room and continue moving through connected rooms. David desperately opens a dark green door framed in marble."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finding a dark green door framed in green marble he desperately yanks it open David leads Elise through more of the bafflingly connected records rooms Reaching the far end they find two intervention teams approaching David and Elise arrive in another identical records room Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes David offers a staffer a cordial wave as he and Elise proceed through the offices The two intruders run through a series of identical offices In a greencarpeted office a bookish receptionist looks up They reach a door glance about and go through David peers over his shoulder He takes her hand and they hurry on Now David and Elise reach a hallway At a landing he slides open a door of bronze bars Thompson and his staff jog up the spiraling stairway Now a blackgarbed intervention team passes through a columned archway Harry grimly takes it heads back down the hall and turns out of view The staffer holds out a large manila envelope Now in a white marble hall The flights of stairs seem to continue infinitely David glances upward In the reading room Thompson leads his team to the peripheral walkway then the door Meanwhile David and Elise hurry up a palatial spiral staircase Bureau members stare as they march down the center aisle Thompson and his staff enter the reading room David finds a door and they hurry through They race along a walkway bordering the room Leaving Elise behind him he shoves another David knocks a staffer out of the way David and Elise push open a pair of doors and enter the bureau reading room With a grave look he steps away At the bureau Harry reads the same in his plan book David and Elise's pathway has united and intermittent red dots flash in a column Their plan book shows On the street Thompson and his aide gawk As they enter the doors shut behind them They turn the knobs and the doors open to a long hallway with a polished marble floor David takes hold of the right hand knob They face a set of double doors Elise goes to him and takes his hand She swallows and nods bravely A tear rolls down her cheek She hangs her head and then takes in David's earnest expression Elise's eyes pool with tears David spots a pair of doors crosses to them and faces Elise Looking up she sees the Statue of Liberty towering above Fording through it he leads Elise out onto a grassy island David halts an oncoming car by holding up a hand and pulls Elise safely across the street"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Fording through it he leads Elise out onto a grassy island David halts an oncoming car by holding up a hand and pulls Elise safely across the street David spots a pair of doors crosses to them and faces Elise Looking up she sees the Statue of Liberty towering above She hangs her head and then takes in David's earnest expression Elise's eyes pool with tears She swallows and nods bravely A tear rolls down her cheek They face a set of double doors Elise goes to him and takes his hand They turn the knobs and the doors open to a long hallway with a polished marble floor David takes hold of the right hand knob On the street Thompson and his aide gawk As they enter the doors shut behind them David and Elise's pathway has united and intermittent red dots flash in a column Their plan book shows With a grave look he steps away At the bureau Harry reads the same in his plan book David knocks a staffer out of the way David and Elise push open a pair of doors and enter the bureau reading room They race along a walkway bordering the room Leaving Elise behind him he shoves another Thompson and his staff enter the reading room David finds a door and they hurry through Meanwhile David and Elise hurry up a palatial spiral staircase Bureau members stare as they march down the center aisle David glances upward In the reading room Thompson leads his team to the peripheral walkway then the door Now in a white marble hall The flights of stairs seem to continue infinitely Harry grimly takes it heads back down the hall and turns out of view The staffer holds out a large manila envelope Thompson and his staff jog up the spiraling stairway Now a blackgarbed intervention team passes through a columned archway Now David and Elise reach a hallway At a landing he slides open a door of bronze bars David peers over his shoulder He takes her hand and they hurry on In a greencarpeted office a bookish receptionist looks up They reach a door glance about and go through David offers a staffer a cordial wave as he and Elise proceed through the offices The two intruders run through a series of identical offices David and Elise arrive in another identical records room Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes David leads Elise through more of the bafflingly connected records rooms Reaching the far end they find two intervention teams approaching Finding a dark green door framed in green marble he desperately yanks it open"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bureau members stare as they march down the center aisle Meanwhile David and Elise hurry up a palatial spiral staircase In the reading room Thompson leads his team to the peripheral walkway then the door David glances upward The flights of stairs seem to continue infinitely Now in a white marble hall The staffer holds out a large manila envelope Harry grimly takes it heads back down the hall and turns out of view Now a blackgarbed intervention team passes through a columned archway Thompson and his staff jog up the spiraling stairway At a landing he slides open a door of bronze bars Now David and Elise reach a hallway He takes her hand and they hurry on David peers over his shoulder They reach a door glance about and go through In a greencarpeted office a bookish receptionist looks up The two intruders run through a series of identical offices David offers a staffer a cordial wave as he and Elise proceed through the offices Now the blackclad intervention team marches into a records archive where rows of bookcases shelve whitespine volumes David and Elise arrive in another identical records room Reaching the far end they find two intervention teams approaching David leads Elise through more of the bafflingly connected records rooms Finding a dark green door framed in green marble he desperately yanks it open David halts an oncoming car by holding up a hand and pulls Elise safely across the street Fording through it he leads Elise out onto a grassy island Looking up she sees the Statue of Liberty towering above David spots a pair of doors crosses to them and faces Elise Elise's eyes pool with tears She hangs her head and then takes in David's earnest expression A tear rolls down her cheek She swallows and nods bravely Elise goes to him and takes his hand They face a set of double doors David takes hold of the right hand knob They turn the knobs and the doors open to a long hallway with a polished marble floor As they enter the doors shut behind them On the street Thompson and his aide gawk Their plan book shows David and Elise's pathway has united and intermittent red dots flash in a column At the bureau Harry reads the same in his plan book With a grave look he steps away David and Elise push open a pair of doors and enter the bureau reading room David knocks a staffer out of the way Leaving Elise behind him he shoves another They race along a walkway bordering the room David finds a door and they hurry through Thompson and his staff enter the reading room"
        }
      ]
    }
  ]
}