{
  "ground_truth": "She grips two high heels, a coat, and an open champagne bottle which she sets on the counter. Her unblinking eyes stay on him. The woman sits on the counter. David straightens, his gaze fascinated. As David faintly nods, the smiling woman shakes her head. Their amused smiles relax as their stare lingers. David breaks the gaze. The two strangers gaze at each other, and then converge abruptly in a deep kiss, caressing each other passionately. As their kiss ends, their faces still hover close. A second onrush of kissing overtakes them. The woman jogs out barefoot. Charlie smiles. David follows her. She peers back. Two men approach. She loosens his tie. She hurries off. Now in the ballroom. Backstage Charlie and other aides applaud. David peers at his supporters, then briefly bows his head. He glances back stage. He holds up a shoe. Numerous flashbulbs pop. Now dark clouds drift over Manhattan. On a pleasant city street, largely devoid of activity. A shiny black town car stops by Madison Square Park. A rear passenger door opens. The oldest member of the mysterious four-man team from the rooftop gets out of the car in his fedora and overcoat. He confidently enters the park. Farther along, the mustached stranger sits on a bench. The older superior sits beside him. His superior walks away. The mustached subordinate peers after his boss with a faint smile. Across from the park, a well-kept residential building shows beyond a few trees. Inside David sleeps. He wakes and turns off his alarm clock, which reads six o'clock. Later, David sips coffee. Later, David carries a to-go cup of coffee as he crosses a park. As David and his fan go their separate ways, the mustached stranger remains on his park bench, his head bowed and his fedora brim tilted to shade his face. David hurries across a street. A clock on the side of a building reads 7:05. Sunlight glows through a tree's branches, bathing the stranger's face. He awakes. Blinking, he glances around, then pulls out his hardcover book and checks a bookmarked page. He jumps to his feet, spotting David, who boards a bus. The stranger races after it. David notices him through a bus window. The stranger keeps sprinting, as David looks for a place to sit. He smiles. The lovely woman from the election night sleeps with her head leaned against a window. As David takes the seat beside her, she stirs. David checks out her thighs and miniskirt. She notices him and beams. Outside, the mustached stranger still sprints after the bus. She stares at him. David grabs his phone. A car speeds past the running stranger. The bus pulls up to a stop.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She clutches two stilettoes, a jacket, and an open bubbly bottle which she places on the countertop. Her unwavering gaze remains on him. The lady perches on the countertop. David adjusts, his look captivated. As David slightly inclines, the grinning lady nods negatively. Their entertained grins ease as their look persists. David severs the look. The two outsiders gaze at each other, and then unite suddenly in a profound embrace, fondling each other intensely. As their embrace concludes, their faces still hang near. A subsequent surge of embracing overtakes them. The lady runs out unshod. Charlie grins. David trails her. She glances back. Two males approach. She loosens his necktie. She rushes off. Now in the dance hall. Behind the scenes Charlie and other assistants cheer. David glances at his backers, then momentarily inclines his head. He glimpses backstage. He lifts a footwear. Many flashbulbs burst. Now dark skies drift over Manhattan. On a delightful urban avenue, largely empty of activity. A glossy ebony sedan halts by Madison Square Park. A rear passenger door opens. The eldest member of the enigmatic four-man squad from the rooftop gets out of the sedan in his hat and overgarment. He self-assuredly enters the park. Further along, the whiskered outsider sits on a bench. The older superior sits beside him. His superior strolls away. The whiskered subordinate glances after his employer with a slight grin. Opposite the park, a well-maintained residence building appears beyond a few trees. Inside David slumbers. He awakens and switches off his alarm clock, which displays six o'clock. Later, David sips espresso. Later, David carries a takeaway cup of espresso as he traverses a park. As David and his admirer go their separate directions, the whiskered outsider remains on his park bench, his head inclined and his hat brim slanted to shade his visage. David hastens across a street. A timepiece on the side of a structure shows 7:05. Sunlight glistens through a tree's limbs, bathing the outsider’s visage. He awakens. Blinking, he glances around, then pulls out his hardcover tome and checks a bookmarked leaf. He leaps to his feet, identifying David, who boards a coach. The outsider races after it. David notices him through a coach pane. The outsider keeps sprinting, as David searches for a spot to perch. He grins. The beautiful lady from the election night slumbers with her head inclined against a pane. As David takes the spot beside her, she stirs. David examines her thighs and miniskirt. She notices him and smiles. Outside, the whiskered outsider still sprints after the coach. She gazes at him. David grips his phone. A vehicle accelerates past the running outsider. The coach halts at a station."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Two high heels, a coat, and an open champagne bottle are gripped by her and set on the counter. He is watched by her unblinking eyes. The counter is sat on by the woman. David is fascinated as he straightens his gaze. As the woman smiles and shakes her head, a faint nod is given by David. Their amused smiles are relaxed as their stare is lingered on. The gaze is broken by David. Each other is gazed at by the two strangers, and then they abruptly converge in a deep kiss, passionately caressing each other. As their kiss ends, their faces still hover close. They are overtaken by a second onrush of kissing. Out she jogs barefoot. A smile is given by Charlie. She is followed by David. Back she peers. Two men approach. His tie is loosened by her. Off she hurries. Now the ballroom is entered. Backstage, Charlie and other aides applaud. David's supporters are peer at, and then he briefly bows his head. The backstage is glanced back at by him. A shoe is held up by him. Flashbulbs pop numerous times. Now Manhattan is drifted over by dark clouds. A pleasant city street is largely devoid of activity. By Madison Square Park, a shiny black town car is stopped. A rear passenger door is opened. Getting out of the car, the oldest member of the mysterious four-man team from the rooftop wears a fedora and overcoat. The park is confidently entered by him. The mustached stranger sits farther along on a bench. The older superior sits beside him. Away, his superior walks. After his boss, the mustached subordinate peers with a faint smile. Beyond a few trees, a well-kept residential building is shown across from the park. Inside, David sleeps. The alarm clock, which reads six o'clock, is turned off by him when he wakes. Later, coffee is sipped by David. Later, a to-go cup of coffee is carried by David as a park is crossed. As David and his fan go their separate ways, the mustached stranger remains on his park bench, his head bowed and his fedora brim tilted to shade his face. Across a street, David hurries. On the side of a building, a clock reads 7:05. Through a tree's branches, sunlight glows, bathing the stranger's face. He is awakened. Blinking, around he glances, then a hardcover book is pulled out and a bookmarked page is checked. Jumping to his feet, David is spotted boarding a bus. After it, the stranger races. Through a bus window, David notices him. The stranger keeps sprinting, as a place to sit is looked for by David. A smile is given by him. With her head leaned against a window, the lovely woman from the election night sleeps. As the seat beside her is taken by David, she stirs. Her thighs and miniskirt are checked out by David. Him is noticed by her, and a beam is given. Outside, the bus is still sprinted after by the mustached stranger. At him, she stares. His phone is grabbed by David. Past the running stranger, a car speeds. The bus is pulled up to a stop."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She grips high heels, a coat, and a champagne bottle, placing them on the counter. Her eyes remain on him. She sits on the counter as David, fascinated, straightens. David nods, the woman shakes her head, their smiles relax, and they hold the gaze. David looks away, then they kiss deeply. After, their faces stay close before a second kiss. The woman runs out barefoot; Charlie smiles as David follows. She glances back, loosens his tie, and hurries off. In the ballroom, Charlie and aides applaud. David looks at supporters and bows. He holds up a shoe as flashbulbs pop. Dark clouds cover Manhattan. On a quiet street, a black town car stops at Madison Square Park. An older member of the rooftop team emerges confidently. A mustached stranger sits on a bench. His superior sits beside him, then leaves. The stranger smiles faintly. Across the park, a residential building is visible. David wakes at six o'clock, sips coffee, and crosses a park. The mustached stranger remains with his head bowed. David hurries across a street; a clock reads 7:05. Sunlight glows on the stranger's face; he wakes and spots David boarding a bus. The stranger races after it as David smiles. The election night woman sleeps on the bus; David sits beside her. She notices and smiles at him. The stranger chases the bus as David grabs his phone. A car speeds by the stranger as the bus stops."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gripping high heels, a coat, and champagne, she sets them on the counter, watching him. She sits on the counter as David straightens, fascinated. When he nods, she shakes her head, and they exchange amused smiles. Their gaze lingers until David breaks it. They then converge in a deep kiss, caressing passionately. Afterward, with faces close, they kiss again. She runs out barefoot, Charlie smiles, and David follows. She glances back, loosens his tie, and hurries off. In the ballroom, Charlie and aides applaud as David looks at his supporters and briefly bows. He holds a shoe as flashbulbs pop. Dark clouds drift over Manhattan on a quiet street. A black town car stops by Madison Square Park, and the oldest rooftop team member exits confidently in a fedora and coat, entering the park. The mustached man sits on a bench. His superior joins and then leaves him, and he smiles faintly afterward. Across the park, a residential building stands. Inside, David wakes at six, later sipping coffee. As he crosses the park with a to-go cup, the mustached man sits on a bench, head bowed, fedora shading his face. David hurries across the street under sunlight as the stranger awakens and spots him boarding a bus, chasing after it. David notices the pursuit through a window and smiles. The woman from election night sleeps as David sits beside her, checking her thighs and skirt. She notices him and smiles; the mustached man still chases the bus, and she stares at him. David grabs his phone as a car speeds past the running stranger, and the bus stops."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Clutching a pair of elegant high heels, a stylish coat, and a half-open champagne bottle, she places them with deliberate care on the countertop in front of her. Her eyes, unwavering and intense, remain fixed on him with an almost magnetic pull. With a graceful motion, the woman settles herself comfortably on the counter. David stands up straighter, his eyes locked on her, captivated by her presence. As he nods subtly, the woman, still smiling, shakes her head in gentle disagreement. Their smiles reflect shared amusement and gradually soften, yet their eyes continue to hold each other in an unbroken gaze. It is David who finally looks away from their shared stare. The two individuals, strangers not long ago, exchange glances that electrify the moment and then, drawn by an irresistible force, they meet in an unexpectedly deep, passionate kiss, embracing each other with fervent intensity. As their initial kiss comes to an end, their faces remain close, hovering in proximity. A renewed urge sweeps over them, leading to another surge of intense kissing. The woman then dashes out of the room, leaving her high heels behind, her bare feet hitting the floor as she exits. Charlie observes the scene with a smile. David promptly follows her, and she glances back over her shoulder. Two men soon approach, and she deftly loosens David's tie before hurrying away. She soon finds herself in the grand ballroom. Backstage, Charlie and his fellow aides start applauding. David casts a glance at the supporters gathered around him, momentarily lowering his head in acknowledgment. He turns to look back at the backstage area. Triumphantly, he raises a single shoe into the air as the bright flashes of numerous cameras pop repeatedly. Outside, dark clouds slowly drift across the skyline of Manhattan. The city streets, mostly quiet and void of activity, offer a tranquil scene as a sleek, shiny black town car comes to a stop beside Madison Square Park. The rear passenger door swings open, and the eldest member of a mysterious four-man team, previously seen on the rooftop, steps out of the vehicle, dressed in a classic fedora and overcoat. With an air of confidence, he strides into the park. A little way ahead, a mustached stranger occupies a bench. The older man takes a seat next to him. After a brief moment, the superior gets up and walks away, leaving the mustached subordinate to watch him depart with a faint, knowing smile. Across from the park, a well-maintained residential building is partially visible through a few leafy trees. Inside one of its apartments, David lies asleep. He gradually awakens and reaches over to turn off his alarm clock, which reads exactly six o'clock. Later, David leisurely sips coffee. At another moment, David carries a convenient to-go cup of coffee with him as he makes his way across a park. As David and an admirer part ways, the mustached stranger remains seated on his park bench, his head lowered and the brim of his fedora shading his face. David rushes across a busy street while a clock mounted on the side of a building displays the time as 7:05. Sunlight pours through the branches of a nearby tree, casting a warm glow over the stranger's face. He awakens drowsily, blinking as he surveys his surroundings before pulling out a hardcover book to check a bookmarked page. With a sudden burst of energy, he leaps to his feet, spotting David as he boards a bus. The stranger races after it with determination. David catches sight of him through the window of the bus. The stranger keeps sprinting, while inside the bus, David searches for an available seat, smiling to himself. Meanwhile, the lovely woman from the night of the election slumbers with her head gently resting against the window. As David takes the seat beside her, she stirs to wakefulness. David observes her, glancing at her thighs and the stylish miniskirt she wears. She notices his attention and smiles warmly in response. Outside, the mustached stranger is still running hard to catch up with the bus. She gazes at him from within the bus. David reaches for his phone. A car zips past the determined, running stranger as the bus pulls up to its next stop."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Clutching a pair of elegant high heels in one hand, a stylish coat draped over her arm, and holding a half-open champagne bottle with a poised grip, she carefully places these items with deliberate, almost ritualistic care on the countertop in front of her. Her eyes, unwavering and remarkably intense, seem to hold an almost magnetic pull as they remain steadily fixed on him. With a grace that flows naturally, the woman settles herself comfortably upon the counter. David, in response, stands a bit taller, his gaze firmly locked onto her, captivated and entirely drawn in by her commanding presence. He nods subtly, acknowledging her, and the woman, all the while maintaining her smile, gently shakes her head in soft disagreement. Their smiles, reflecting a shared amusement, gradually soften, yet their eyes continue their unbroken, electrifying gaze. Ultimately, it is David who breaks their mutual stare, looking away. These two individuals, who were mere strangers not long ago, exchange glances that electrify the moment. Then, succumbing to an irresistible force between them, they meet in an unexpectedly deep, passionate kiss, embracing each other with fervent intensity that was unsuspected. As their initial kiss comes to its natural end, their faces remain tantalizingly close, hovering in proximity. A renewed wave of desire sweeps over them, leading to another surge of intense kissing. The woman then dashes out of the room, leaving her elegant high heels behind, her bare feet hitting the floor with quick, soft thuds as she exits. Charlie, observing the scene from a distance, smiles knowingly. David does not hesitate to follow her, and she glances back over her shoulder. As David approaches, two men make their way toward the couple, and the woman deftly loosens David's tie before hurrying away playfully. She soon finds herself stepping into the grand ballroom. Backstage, Charlie and his fellow aides commence enthusiastic applause. David casts a sweeping glance over the gathered supporters around him, momentarily lowering his head in acknowledgement of their support. He turns to look back at the backstage area. In a triumphant gesture, he raises one of the abandoned high heels into the air as the bright, flashing lights of numerous cameras pop repeatedly, capturing the moment. Outside, dark clouds slowly drift across the iconic skyline of Manhattan. The city streets are mostly quiet, void of bustling activity, offering a tranquil, serene scene. A sleek, shiny black town car comes silently to a stop beside Madison Square Park. The rear passenger door swings open, and the eldest member of a previously seen, mysterious four-man team steps out of the vehicle, exuding an aura of mystery with his classic fedora and overcoat. With an air of self-assured confidence, he strides purposefully into the park. A little way ahead, a mustached stranger is seated on a bench. The older man takes a seat next to him. After a brief exchange, the superior rises and walks away, leaving the mustached subordinate to watch him depart with a faint, knowing smile playing on his lips. Across from the park, a well-maintained residential building is partially visible through the leafy canopy of trees. Inside one of the apartments, David lies asleep. He gradually awakens and reaches over to turn off his alarm clock, which displays exactly six o'clock. Later, David leisurely sits, sipping a steaming cup of coffee. At another moment, David carries a convenient to-go cup of coffee with him as he makes his way across the park, the aroma accompanying him. As David and an admirer part ways, the mustached stranger remains seated on his park bench, his head lowered, the brim of his fedora shading his face from the sunlight. David rushes across a busy street, while a prominent clock mounted on the side of a nearby building displays the time as 7:05. Sunlight pours through the branches of a nearby tree, casting a warm, golden glow over the stranger's face. He awakens drowsily, blinking as he surveys his surroundings, and then he reaches into his bag to pull out a hardcover book to check a bookmarked page. With a sudden burst of energy, he leaps to his feet, spotting David just as he boards a bus. The stranger races after it with clear determination. David catches sight of him through the window of the bus, watching his pursuit. The stranger continues sprinting, while inside the bus, David searches for an available seat, smiling to himself at the unfolding spectacle. Meanwhile, the lovely woman from the exciting night of the election slumbers peacefully, her head gently resting against the window. As David takes the seat beside her, she stirs and awakens from her restful sleep. David observes her, glancing appreciatively at her thighs and the stylish miniskirt she wears. She notices his attention and responds with a warm, inviting smile. Outside, the mustached stranger is still running determinedly, trying to catch up with the moving bus. She gazes at him from within the bus, intrigued. David reaches for his phone as a car zips past the determined runner, just as the bus approaches its next stop, ready to continue its journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She tightly grips two high heels in one hand, a coat draped over her arm, and balances an open champagne bottle in the other, which she gently sets on the counter, her unblinking eyes locked onto him with unwavering intensity. The woman gracefully lifts herself onto the counter, settling there with poised confidence, while David straightens his posture, his gaze fixated and intrigued by her every move. As David softly nods, acknowledging her presence, the woman, maintaining a playful demeanor, shakes her head, her smile broadening. Their amused smiles gradually soften, relaxing into an expression of comfort as they hold each other's gaze for what seems like an eternity. Eventually, David breaks the connection, glancing away momentarily. In that brief pause, the two strangers find themselves drawn towards each other instinctively, quickly converging in an abrupt and deep kiss, their hands exploring each other with passionate intensity. As their lips part, the space between their faces remains minimal, as if reluctant to separate. But almost immediately, they are swept up again in a second surge of kissing, their connection as fervent as before. Concluding this encounter, the woman, now barefoot, jogs out with a sense of urgency, leaving behind an aura of mystery that makes Charlie smile subtly. With a determined look, David follows her briskly, catching her eye as she glances back, a silent communication passing between them. As two men approach their path, the woman deftly loosens David's tie before hurrying off again, adding a sense of intrigue to the unfolding scene. The setting changes to a grand ballroom, where backstage, Charlie and his fellow aides burst into applause, witnessing an unseen triumph. David stands before his supporters, taking a moment to take in the applause, he bows his head briefly in gratitude, then casts a quick glance backstage. In an unguarded moment, he holds up a shoe, the action punctuated by the dazzling pop of numerous flashbulbs capturing the moment. Meanwhile, outside, dark clouds drift ominously over Manhattan, casting a moody atmosphere over a pleasant city street that is largely devoid of activity. Suddenly, a shiny black town car arrives, halting by the side of Madison Square Park. A rear passenger door opens smoothly, revealing the eldest member of the elusive four-man team from the rooftop. Adorned in a fedora and overcoat, he steps out with unwavering confidence and strides purposefully into the park. Further along the pathway, a mustached stranger reclines thoughtfully on a bench, taking in the surroundings with an observant eye as the older superior approaches and sits beside him momentarily. After a brief exchange, the older superior rises and walks away, leaving the mustached subordinate to peer after him, a faint, enigmatic smile playing on his lips. Across from the park, a well-maintained residential building stands prominently, partially obscured by a cluster of trees. Inside, David lies sleeping in peaceful repose. As the morning light seeps into his room, he awakes, reaching over to switch off his alarm clock, which reads six o'clock. A slice of time passes, and David is seen sipping coffee, savoring the comforting warmth and flavor. Later, he carries a to-go cup of coffee, briskly crossing a sunlit park as if to commence a new day. As David and an admiring fan part ways at a fork in the pathway, the mustached stranger remains seated on his park bench, his head bowed, with the brim of his fedora tilted to shield his face from the sun. David quickens his pace, hustling across a busy street, where a clock mounted on a nearby building indicates the time as 7:05. As he moves swiftly, sunlight filters through the branches of a nearby tree, casting a golden hue over the stranger's face, gently rousing him from his rest. He blinks, momentarily disoriented, then quickly gathers his wits about him, pulling a hardcover book from his side to check a bookmarked page. With a sudden burst of urgency, he jumps to his feet upon spotting David in the distance, who is about to board a bus. Sensing a need to act quickly, the stranger races to catch up with the retreating bus. Meanwhile, David, now aboard, notices the man through the window and continues to look for a place to sit, a subtle smile forming on his lips as he reflects on the morning's unfolding events. His gaze then falls upon the lovely woman from the election night, who sleeps peacefully beside a window, her head leaned gently against the glass. As David takes the seat next to her, she stirs slightly, the motion prompting David to admire the elegance of her thighs and the chic cut of her miniskirt. She soon becomes aware of his presence, meeting his eyes with a radiant smile that lights up her entire face. Outside the bus, the mustached stranger maintains his determined sprint in pursuit, never losing sight of his target. She watches the running man with growing curiosity. Sensing the urgency, David retrieves his phone as a car speeds past the persistent stranger. In a synchronized sequence, the bus begins to decelerate, preparing to pull up to the next stop, setting the stage for the next chapter of their intertwined story."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She places two high heels, a coat, and an open champagne bottle on the counter, keeping her eyes on him. Sitting on the counter, she shares a lingering, amused gaze with David, who returns it with fascination until he breaks it. They share a passionate kiss that deepens until they part slightly, only to embrace once more. She then jogs out barefoot, prompting a smile from Charlie, while David follows her. As she loosens his tie and hurries away, they arrive at the ballroom where Charlie and other aides applaud backstage. David acknowledges his supporters with a brief bow before holding up a shoe to a flurry of flashbulbs. Meanwhile, dark clouds drift over a quiet Manhattan street where a shiny black town car stops by Madison Square Park. The oldest member of a four-man team exits confidently and enters the park to meet a mustached stranger on a bench. After a brief exchange, the superior leaves, and the subordinate watches him depart with a faint smile. Across the park, David wakes in a well-kept residential building, turns off his alarm at six o'clock, and later crosses a park with his coffee. As he parts ways with a fan, the mustached stranger remains on the bench. David hurries across the street, passing a clock that reads 7:05. The stranger awakens to sunlight, checks his book, and races after a bus as David boards it and finds a seat beside a lovely woman from election night. They exchange smiles and glances while the stranger continues to sprint after the bus, undeterred by passing cars."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She grips two high heels, a coat, and an open champagne bottle which she sets on the counter of the lavish apartment in the city known for its upscale parties and gatherings. Her unblinking eyes stay on him with an intensity matching those high-stakes nights. The woman sits on the counter, a gesture casual yet deliberate. David straightens, his gaze fascinated by her poise. As David faintly nods, the smiling woman, whose confidence suggests familiarity with the glamorous social scene, shakes her head. Their amused smiles relax as their stare lingers, a silent dance of understanding. David breaks the gaze, a subtle shift in their moment. The two strangers gaze at each other, and then converge abruptly in a deep kiss, caressing each other passionately, as if lost in a world of their own making. As their kiss ends, their faces still hover close, a pause before another connection. A second onrush of kissing overtakes them, an irresistible pull. The woman jogs out barefoot, a whimsical departure from their intense moment. Charlie, a friend known for his reliable sense of humor, smiles. David follows her, his curiosity piqued. She peers back, an invitation in her eyes. Two men approach, perhaps friends or rivals. She loosens his tie, a playful act of intimacy. She hurries off, leaving a trail of intrigue. Now in the ballroom, where the air buzzes with anticipation and celebration. Backstage Charlie and other aides applaud, acknowledging a victory or a performance well-delivered. David peers at his supporters, then briefly bows his head, a gesture of humility. He glances backstage, seeking affirmation. He holds up a shoe, an unexpected symbol or perhaps a moment of levity. Numerous flashbulbs pop, capturing the scene for posterity. Now dark clouds drift over Manhattan, the ever-bustling city known for its iconic skyline and relentless pace. On a pleasant city street, largely devoid of activity, a rare moment of quiet in the urban sprawl. A shiny black town car stops by Madison Square Park, a historic green space in the heart of the city. A rear passenger door opens. The oldest member of the mysterious four-man team from the rooftop, known among them as the strategist for his seasoned insights, gets out of the car in his fedora and overcoat. He confidently enters the park, a man with a mission. Farther along, the mustached stranger sits on a bench, a regular haunt for reflecting and watching the world pass by. The older superior sits beside him, a mentor to the younger man. His superior walks away, a silent dismissal or trust in the task at hand. The mustached subordinate peers after his boss with a faint smile, a signal of loyalty. Across from the park, a well-kept residential building shows beyond a few trees, a reminder of the city's blend of nature and structure. Inside David sleeps, a reprieve before the inevitable rush of the day. He wakes and turns off his alarm clock, which reads six o'clock, the start of another busy morning. Later, David sips coffee, the morning ritual that fuels countless New Yorkers. Later, David carries a to-go cup of coffee as he crosses a park, integrating himself into the city's morning rhythm. As David and his fan go their separate ways, the mustached stranger remains on his park bench, his head bowed and his fedora brim tilted to shade his face from the rising sun. David hurries across a street, weaving through the morning commuters. A clock on the side of a building reads 7:05, a reminder of the time-driven nature of city life. Sunlight glows through a tree's branches, bathing the stranger's face in early light. He awakes, invigorated by the fresh air. Blinking, he glances around, then pulls out his hardcover book, a literary escape, and checks a bookmarked page, perhaps marking a significant insight. He jumps to his feet, spotting David, who boards a bus, the quintessential urban mode of transport. The stranger races after it, determined not to lose sight of him. David notices him through a bus window, a fleeting moment of recognition. The stranger keeps sprinting, as David looks for a place to sit, navigating the crowded aisles. He smiles, his attention captured by the lovely woman from the election night, who sleeps with her head leaned against a window, a picture of serenity amidst the chaos. As David takes the seat beside her, she stirs, waking into their shared story. David checks out her thighs and miniskirt, a moment of appreciation or attraction. She notices him and beams, their connection rekindled. Outside, the mustached stranger still sprints after the bus, relentless in his pursuit. She stares at him, curiosity piqued. David grabs his phone, a modern lifeline. A car speeds past the running stranger, a reminder of the city's relentless pace. The bus pulls up to a stop, another pause in their intertwined journeys."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She grips two high heels a coat and an open champagne bottle which she sets on the counter. Her unblinking eyes stay on him. The woman sits on the counter. David straightens his gaze fascinated. As David faintly nods the smiling woman shakes her head. Their amused smiles relax as their stare lingers. David breaks the gaze. The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately. As their kiss ends their faces still hover close. A second onrush of kissing overtakes them. The woman jogs out barefoot. Charlie smiles. David follows her. She peers back. Two men approach. She loosens his tie. She hurries off. Now in the ballroom. Backstage Charlie and other aides applaud. David peers at his supporters then briefly bows his head. He glances back stage. He holds up a shoe. Numerous flashbulbs pop. Now dark clouds drift over Manhattan. On a pleasant city street largely devoid of activity. A shiny black town car stops by Madison Square Park. A rear passenger door opens. The oldest member of the mysterious fourman team from the rooftop gets out of the car in his fedora and overcoat. He confidently enters the park. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Farther along the mustached stranger sits on a bench. The older superior sits beside him. His superior walks away. The mustached subordinate peers after his boss with a faint smile. Across from the park a wellkept residential building shows beyond a few trees. Inside David sleeps. He wakes and turns off his alarm clock which reads six of the clock. Later David sips coffee. Later David carries a togo cup of coffee as he crosses a park. As David and his fan go their separate ways the mustached stranger remains on his park bench his head bowed and his fedora brim tilted to shade his face. David hurries across a street. A clock on the side of a building reads 705. Sunlight glows through a tree's branches bathing the stranger's face. He awakes. Blinking he glances around then pulls out his hardcover book and checks a bookmarked page. He jumps to his feet spotting David who boards a bus. The stranger races after it. David notices him through a bus window. The stranger keeps sprinting as David looks for a place to sit. He smiles. The lovely woman from the election night sleeps with her head leaned against a window. As David takes the seat beside her she stirs. David checks out her thighs and miniskirt. She notices him and beams. Outside the mustached stranger still sprints after the bus. She stares at him. David grabs his phone. A car speeds past the running stranger. The bus pulls up to a stop."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She grips two high heels a coat and an open champagne bottle which she sets on the counter. Her unblinking eyes stay on him. The woman sits on the counter. David straightens his gaze fascinated. As David faintly nods the smiling woman shakes her head. Their amused smiles relax as their stare lingers. David breaks the gaze. The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately. As their kiss ends their faces still hover close. A second onrush of kissing overtakes them. The woman jogs out barefoot. Charlie smiles. David follows her. She peers back. Two men approach. She loosens his tie. She hurries off. Now in the ballroom. Backstage Charlie and other aides applaud. David peers at his supporters then briefly bows his head. He glances back stage. He holds up a shoe. Numerous flashbulbs pop. Now dark clouds drift over Manhattan. On a pleasant city street largely devoid of activity. A shiny black town car stops by Madison Square Park. A rear passenger door opens. The oldest member of the mysterious fourman team from the rooftop gets out of the car in his fedora and overcoat. He confidently enters the park. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Farther along the mustached stranger sits on a bench. The older superior sits beside him. His superior walks away. The mustached subordinate peers after his boss with a faint smile. Across from the park a wellkept residential building shows beyond a few trees. Inside David sleeps. He wakes and turns off his alarm clock which reads six of the clock. Later David sips coffee. Later David carries a togo cup of coffee as he crosses a park. As David and his fan go their separate ways the mustached stranger remains on his park bench his head bowed and his fedora brim tilted to shade his face. David hurries across a street. A clock on the side of a building reads 705. Sunlight glows through a tree's branches bathing the stranger's face. He awakes. Blinking he glances around then pulls out his hardcover book and checks a bookmarked page. He jumps to his feet spotting David who boards a bus. The stranger races after it. David notices him through a bus window. The stranger keeps sprinting as David looks for a place to sit. He smiles. The lovely woman from the election night sleeps with her head leaned against a window. As David takes the seat beside her she stirs. David checks out her thighs and miniskirt. She notices him and beams. Outside the mustached stranger still sprints after the bus. She stares at him. David grabs his phone. A car speeds past the running stranger. The bus pulls up to a stop."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She grips two high heels a coat and an open champagne bottle which she sets on the counter. Her unblinking eyes stay on him. The woman sits on the counter. David straightens his gaze fascinated. As David faintly nods the smiling woman shakes her head. Their amused smiles relax as their stare lingers. David breaks the gaze. The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately. As their kiss ends their faces still hover close. A second onrush of kissing overtakes them. The woman jogs out barefoot. Charlie smiles. David follows her. She peers back. Two men approach. He jumps to his feet spotting David who boards a bus. The stranger races after it. David notices him through a bus window. The stranger keeps sprinting as David looks for a place to sit. He smiles. The lovely woman from the election night sleeps with her head leaned against a window. As David takes the seat beside her she stirs. David checks out her thighs and miniskirt. She notices him and beams. Outside the mustached stranger still sprints after the bus. She stares at him. David grabs his phone. A car speeds past the running stranger. The bus pulls up to a stop."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She grips two high heels a coat and an open champagne bottle which she sets on the counter. Her unblinking eyes stay on him. The woman sits on the counter. David straightens his gaze fascinated. As David faintly nods the smiling woman shakes her head. Their amused smiles relax as their stare lingers. She notices him and beams. Outside the mustached stranger still sprints after the bus. She stares at him. David grabs his phone. A car speeds past the running stranger. The bus pulls up to a stop."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The detective clutches two umbrellas, a scarf, and an unopened milk carton which she places on the table. Her blinking eyes stay on the rabbit. The artist stands on the table. Sarah slouches, her gaze perplexed. As Sarah quickly blinks, the grinning artist claps her hands. Their puzzled frowns tense as their glance drifts. Sarah breaks the glance. The two acquaintances blink at each other, and then diverge abruptly in a shallow hug, patting each other awkwardly. As their hug ends, their elbows still hover close. A second wave of hugging surprises them. The artist runs out on tiptoes. Michael frowns. Sarah follows the artist. She gazes ahead. Two cats sprint. She tightens his belt. She strolls off. Now in the library. Upstairs Michael and other penguins cheer. Sarah stares at her fans, then swiftly nods her chin. She glances upstairs. She waves a glove. Numerous raindrops fall. Now bright stars gleam over Sydney. On a cloudy mountain peak, hardly filled with hikers. A dusty green pickup truck speeds past Oxford Circus. A front passenger door closes. The youngest member of the colorful eight-woman crew from the cathedral leaps into the truck in her beret and tracksuit. She impatiently exits the trail. Closer by, the bearded traveler leans on a rock. The younger assistant stands behind him. Her colleague skips away. The bearded colleague gazes at her friend with a broad smile. Opposite the mountain, a neglected commercial factory looms above many bushes. Outside Sarah meditates. She sleeps and turns on her lamp, which shows twelve o'clock. Soon, Sarah gulps water. Soon, Sarah sips a mug of water as she leaves a museum. As Sarah and her companion go their solitary directions, the bearded traveler snoozes on his rock, his shoulders hunched and his beanie brim lifted to expose his face. Sarah strolls beneath a bridge. A thermometer on the top of a skyscraper reads 3:15. Moonlight fades across a river's rapids, cooling the traveler's hands. She dozes off. Smiling, she glances upwards, then pulls out her digital watch and sets a reminder. She floats to her knees, spotting Sarah, who climbs over a stile. The traveler rushes after it. Sarah observes her through a stile's bars. The traveler continues jogging, as Sarah searches for a bench to occupy. She chuckles. The grumpy man from the parade evening meditates with his chin raised against a ledge. As Sarah misses the spot beside him, he stirs. Sarah admires his shoulders and overalls. He hears her and frowns. Inside, the bearded traveler still jogs past the stile. He looks away. Sarah clutches her book. A motorcycle rushes around the jogging traveler. The stile halts at a crossroad."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The woman sets her high heels, coat, and champagne bottle on a counter, fixating on David. They exchange amused smiles, leading to a passionate kiss. She leaves barefoot; David follows. At a ballroom, David acknowledges his supporters and holds up a shoe amid flashing cameras. Dark clouds hang over Manhattan. A black town car stops by Madison Square Park, and the eldest of a mysterious team exits and enters the park. The mustached man, sitting on a bench, watches his superior depart. David wakes at 6:00, drinks coffee, and crosses a park as a clock strikes 7:05. Sunlight hits the mustached stranger, who races after a bus carrying David. Onboard, David notices the lovely woman from election night. She awakens when David sits beside her. Outside, the mustached stranger chases the bus, but a car speeds by as it stops."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The bus pulls up to a stop A car speeds past the running stranger David grabs his phone She stares at him Outside the mustached stranger still sprints after the bus She notices him and beams David checks out her thighs and miniskirt As David takes the seat beside her she stirs The lovely woman from the election night sleeps with her head leaned against a window He smiles The stranger keeps sprinting as David looks for a place to sit David notices him through a bus window The stranger races after it He jumps to his feet spotting David who boards a bus Blinking he glances around then pulls out his hardcover book and checks a bookmarked page He awakes Sunlight glows through a tree's branches bathing the stranger's face A clock on the side of a building reads 705 David hurries across a street As David and his fan go their separate ways the mustached stranger remains on his park bench his head bowed and his fedora brim tilted to shade his face Later David carries a togo cup of coffee as he crosses a park Later David sips coffee He wakes and turns off his alarm clock which reads six of the clock Inside David sleeps Across from the park a wellkept residential building shows beyond a few trees The mustached subordinate peers after his boss with a faint smile His superior walks away The older superior sits beside him Farther along the mustached stranger sits on a bench He confidently enters the park The oldest member of the mysterious fourman team from the rooftop gets out of the car in his fedora and overcoat A rear passenger door opens A shiny black town car stops by Madison Square Park On a pleasant city street largely devoid of activity Now dark clouds drift over Manhattan Numerous flashbulbs pop He holds up a shoe He glances back stage David peers at his supporters then briefly bows his head Backstage Charlie and other aides applaud Now in the ballroom She hurries off She loosens his tie Two men approach She peers back David follows her Charlie smiles The woman jogs out barefoot A second onrush of kissing overtakes them As their kiss ends their faces still hover close The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately David breaks the gaze Their amused smiles relax as their stare lingers As David faintly nods the smiling woman shakes her head David straightens his gaze fascinated The woman sits on the counter Her unblinking eyes stay on him She grips two high heels a coat and an open champagne bottle which she sets on the counter"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Her unblinking eyes stay on him She grips two high heels a coat and an open champagne bottle which she sets on the counter David straightens his gaze fascinated The woman sits on the counter Their amused smiles relax as their stare lingers As David faintly nods the smiling woman shakes her head The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately David breaks the gaze A second onrush of kissing overtakes them As their kiss ends their faces still hover close Charlie smiles The woman jogs out barefoot She peers back David follows her She loosens his tie Two men approach Now in the ballroom She hurries off David peers at his supporters then briefly bows his head Backstage Charlie and other aides applaud He holds up a shoe He glances back stage Now dark clouds drift over Manhattan Numerous flashbulbs pop A shiny black town car stops by Madison Square Park On a pleasant city street largely devoid of activity The oldest member of the mysterious fourman team from the rooftop gets out of the car in his fedora and overcoat A rear passenger door opens Farther along the mustached stranger sits on a bench He confidently enters the park His superior walks away The older superior sits beside him Across from the park a wellkept residential building shows beyond a few trees The mustached subordinate peers after his boss with a faint smile He wakes and turns off his alarm clock which reads six of the clock Inside David sleeps Later David carries a togo cup of coffee as he crosses a park Later David sips coffee David hurries across a street As David and his fan go their separate ways the mustached stranger remains on his park bench his head bowed and his fedora brim tilted to shade his face Sunlight glows through a tree's branches bathing the stranger's face A clock on the side of a building reads 705 Blinking he glances around then pulls out his hardcover book and checks a bookmarked page He awakes The stranger races after it He jumps to his feet spotting David who boards a bus The stranger keeps sprinting as David looks for a place to sit David notices him through a bus window The lovely woman from the election night sleeps with her head leaned against a window He smiles David checks out her thighs and miniskirt As David takes the seat beside her she stirs Outside the mustached stranger still sprints after the bus She notices him and beams David grabs his phone She stares at him The bus pulls up to a stop A car speeds past the running stranger"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Farther along the mustached stranger sits on a bench The older superior sits beside him His superior walks away The mustached subordinate peers after his boss with a faint smile Across from the park a wellkept residential building shows beyond a few trees Inside David sleeps He wakes and turns off his alarm clock which reads six of the clock Later David sips coffee Later David carries a togo cup of coffee as he crosses a park As David and his fan go their separate ways the mustached stranger remains on his park bench his head bowed and his fedora brim tilted to shade his face David hurries across a street A clock on the side of a building reads 705 Sunlight glows through a tree's branches bathing the stranger's face He awakes Blinking he glances around then pulls out his hardcover book and checks a bookmarked page He jumps to his feet spotting David who boards a bus The stranger races after it David notices him through a bus window The stranger keeps sprinting as David looks for a place to sit He smiles The lovely woman from the election night sleeps with her head leaned against a window As David takes the seat beside her she stirs David checks out her thighs and miniskirt She notices him and beams Outside the mustached stranger still sprints after the bus She stares at him David grabs his phone A car speeds past the running stranger The bus pulls up to a stop She grips two high heels a coat and an open champagne bottle which she sets on the counter Her unblinking eyes stay on him The woman sits on the counter David straightens his gaze fascinated As David faintly nods the smiling woman shakes her head Their amused smiles relax as their stare lingers David breaks the gaze The two strangers gaze at each other and then converge abruptly in a deep kiss caressing each other passionately As their kiss ends their faces still hover close A second onrush of kissing overtakes them The woman jogs out barefoot Charlie smiles David follows her She peers back Two men approach She loosens his tie She hurries off Now in the ballroom Backstage Charlie and other aides applaud David peers at his supporters then briefly bows his head He glances back stage He holds up a shoe Numerous flashbulbs pop Now dark clouds drift over Manhattan On a pleasant city street largely devoid of activity A shiny black town car stops by Madison Square Park A rear passenger door opens The oldest member of the mysterious fourman team from the rooftop gets out of the car in his fedora and overcoat He confidently enters the park"
        }
      ]
    }
  ]
}