{
  "ground_truth": "A group of wounded soldiers hang out in the hospital, recuperating. Forrest turns the TV off and is hit on the back of the head by a ping-pong ball, so he shakes his head. The wounded ping-pong player hands Forrest a paddle, and they step toward the ping-pong table. The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball. The player tosses the ball down onto the table, and Forrest begins to hit the ball back to the other player. Forrest hits ping-pong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself. Forrest hits two balls at a time against the opposite side of the table while Lt. Dan stares out the window. Forrest lies in his bed asleep, then a hand reaches and grabs him. Lt. Dan pulls Forrest to the floor, holds him down, looks at him, lets go, and rolls away. Lt. Dan sits up as Forrest looks at him, and later Forrest plays ping-pong by himself when an officer walks up to him, holding up an envelope. Forrest steps up to Lt. Dan's bed and stops in mid-sentence as he looks down to see a heavily bandaged soldier with bloodstains lying there. Forrest turns and looks at the nurse. The television reveals Forrest being awarded the Medal of Honor by President Johnson, with color footage showing President Johnson placing the award around Forrest's neck, shaking his hand, leaning, and whispering into Forrest's ear. The television then shows Forrest dropping his pants, bending over, and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles. Three men in a barber shop look up in disbelief, and Mrs. Gump looks up in shock. Hilary leads a line of vets toward a large anti-Vietnam War rally and pulls Forrest up onto the stage; the other vets follow and push Forrest toward the microphones. Abbie raises his fist as the crowd cheers wildly, and Forrest looks at the crowd as he speaks. A policeman sneaks over to the audio circuit board and pulls the patch cords out, so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman, rushes over to the audio board, pushes the policeman away, and grabs his nightstick. Another protester grabs the policeman and pulls him away as Isabel, Hilary, and another protester try to plug the tangled mess of wires back into the audio board.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A cluster of injured troops hang out in the infirmary, recovering. Forrest switches the television off and is tapped on the rear of the head by a ping-pong sphere, so he shakes his head. The injured ping-pong participant hands Forrest a bat, and they step toward the ping-pong table. The participant holds the sphere up and swings it back and forth as Forrest keeps his eyes on the sphere. The participant tosses the sphere down onto the table, and Forrest begins to strike the sphere back to the other participant. Forrest strikes ping-pong spheres that land in a bedpan positioned on a seat as a cluster of injured troops sit and watch him play solo. Forrest strikes two spheres simultaneously against the opposing side of the table while Lt. Dan gazes out the window. Forrest lies in his cot slumbering, then a hand reaches and seizes him. Lt. Dan drags Forrest to the ground, restrains him, observes him, releases him, and rolls away. Lt. Dan sits up as Forrest observes him, and later Forrest plays ping-pong solo when an officer approaches him, holding up a package. Forrest steps up to Lt. Dan's cot and stops in mid-phrase as he looks down to see a heavily bandaged troop with bloodstains lying there. Forrest turns and gazes at the nurse. The television reveals Forrest being awarded the Medal of Honor by President Johnson, with color footage showing President Johnson placing the award around Forrest's neck, shaking his hand, leaning, and whispering into Forrest's ear. The television then shows Forrest dropping his trousers, bending over, and showing the bullet injury on his bare buttocks as President Johnson gazes down and smiles. Three men in a barber shop gaze up in disbelief, and Mrs. Gump gazes up in shock. Hilary leads a line of veterans toward a large anti-Vietnam War assembly and pulls Forrest up onto the platform; the other veterans follow and push Forrest toward the microphones. Abbie raises his fist as the crowd applauds wildly, and Forrest gazes at the crowd as he speaks. A policeman sneaks over to the audio circuit board and pulls the patch cords out, so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman, rushes over to the audio board, pushes the policeman away, and seizes his nightstick. Another demonstrator seizes the policeman and pulls him away as Isabel, Hilary, and another demonstrator try to plug the tangled mess of wires back into the audio board."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A group of wounded soldiers is recuperating in the hospital, hanging out. The TV is turned off by Forrest, and a ping-pong ball hits him on the back of the head, so his head is shaken by him. Forrest is handed a paddle by the wounded ping-pong player, and they step toward the ping-pong table. The ball is held up and moved back and forth by the player as the ball is kept under Forrest's eyes. The ball is tossed down onto the table by the player, and the ball is hit back to the other player by Forrest. Ping-pong balls are hit by Forrest that land in a bedpan positioned on a chair as he is watched by a group of wounded soldiers playing by himself. Two balls at a time are hit by Forrest against the opposite side of the table while Lt. Dan stares out the window. Forrest is asleep in his bed, then a hand reaches and grabs him. Forrest is pulled to the floor by Lt. Dan, held down, looked at, released, and Lt. Dan rolls away. Forrest looks at Lt. Dan as he sits up, and later, ping-pong is played by Forrest by himself when an officer walks up to him, holding up an envelope. Forrest steps up to Lt. Dan's bed and is stopped in mid-sentence as he looks down to see a heavily bandaged soldier with bloodstains lying there. The nurse is looked at by Forrest after he turns. The television reveals the Medal of Honor being awarded to Forrest by President Johnson, with color footage showing President Johnson placing the award around Forrest's neck, shaking his hand, leaning, and whispering into Forrest's ear. Forrest then drops his pants, bends over, and shows the bullet wound on his bare buttocks as President Johnson looks down and smiles, which is shown by the television. Three men in a barber shop look up in disbelief, and Mrs. Gump is looked up at in shock. A line of vets is led toward a large anti-Vietnam War rally by Hilary, and Forrest is pulled up onto the stage; the other vets follow and push Forrest toward the microphones. The crowd cheers wildly as Abbie raises his fist, and the crowd is looked at by Forrest as he speaks. The audio circuit board is sneaked over to by a policeman, and the patch cords are pulled out by him, so the microphone is continued to be spoken into by Forrest even though no one can hear him. The policeman is noticed by Hilary, the audio board is rushed over to by her, the policeman is pushed away, and his nightstick is grabbed by her. Another protester grabs the policeman and pulls him away as Isabel, Hilary, and another protester try to plug the tangled mess of wires back into the audio board."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A group of injured soldiers relax in the hospital, recovering. Forrest turns off the TV and is hit on the head by a ping-pong ball. A wounded player gives Forrest a paddle, and they approach the table. The player moves the ball, and Forrest focuses on it. The game begins, with Forrest hitting balls into a bedpan as soldiers watch. He plays alone, hitting two balls while Lt. Dan gazes out the window. Later, Lt. Dan pulls Forrest from his bed, holds him down, then releases him and rolls away. Forrest plays ping-pong solo as an officer approaches with an envelope. Forrest stops mid-sentence at Lt. Dan's bed, seeing a heavily bandaged soldier. The TV shows Forrest receiving the Medal of Honor from President Johnson, including Johnson whispering to Forrest and Forrest showing his bullet wound. Three barbershop patrons and Mrs. Gump react in disbelief. Hilary leads vets to an anti-Vietnam War rally, pulling Forrest on stage. The crowd cheers as Forrest speaks into a non-functional microphone, thanks to a policeman pulling cords. Hilary notices, confronts the officer, and another protester helps fix the wires."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Wounded soldiers recuperate in a hospital. Forrest turns off the TV and gets hit by a ping-pong ball, so he gets a paddle and plays. Forrest practices alone, hitting balls into a bedpan while Lt. Dan watches. Forrest sleeps but is grabbed by Lt. Dan, who lets go and rolls away. Forrest plays ping-pong alone until an officer gives him an envelope. He stops by Lt. Dan's bed, seeing a bandaged soldier, then looks to a nurse. The TV shows Forrest receiving the Medal of Honor from President Johnson, who shakes his hand and whispers to him. Forrest drops his pants, showing his wound to Johnson, who smiles. People react in disbelief. Hilary leads vets to an anti-war rally, pulling Forrest onto the stage. Abbie raises his fist as the crowd cheers, but a policeman disrupts the audio. Hilary intervenes, and protesters try to reconnect the wires."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the bustling and often chaotic environment of the hospital, a group of soldiers, each bearing various wounds from their service, spend their time recuperating and recovering. Meanwhile, Forrest, seeking a moment of respite, decides to turn off the TV. Just as he does so, unexpectedly, a ping-pong ball makes contact with the back of his head, prompting him to give a quick shake of his head in reaction. The soldier responsible for the stray ping-pong ball then hands Forrest a paddle, an unspoken invitation to engage in a game. Together, they move towards the ping-pong table, prepared for a friendly match. The player lifts the ball, moving it deliberately back and forth, while Forrest remains focused, his eyes fixed intently on the ball's movements. With a flick of the wrist, the player sends the ball bouncing onto the table, and Forrest begins to skillfully volley it back, engaging the other player in an energetic back-and-forth.\n\nAs the game progresses, Forrest demonstrates remarkable agility, landing ping-pong balls into a bedpan strategically positioned on a chair. Observing this solo display of skill, a group of wounded soldiers sits, captivated by his prowess. In a display of impressive coordination, Forrest manages to hit two balls simultaneously against the far side of the table. Meanwhile, Lieutenant Dan, lost in his thoughts, gazes out the window, seemingly detached from the lively scene behind him.\n\nLater, Forrest finds himself lying in bed, deeply asleep. That tranquility is abruptly interrupted when a hand reaches out and firmly pulls him from his slumber. It is Lt. Dan, who hauls Forrest to the floor, pinning him down momentarily. Lt. Dan scrutinizes him with a penetrating gaze before releasing him and rolling away. As the night progresses, Lt. Dan sits up, his gaze meeting Forrest’s, and this silent exchange lingers in the air. Not long after, Forrest once again finds himself practicing ping-pong alone, when an officer approaches, an envelope in hand. Forrest, curious, steps up to Lt. Dan’s bed, only to be momentarily halted mid-sentence. Before him lies a soldier heavily bandaged, with visible bloodstains, a stark reminder of the war’s toll. Turning away from Lt. Dan, Forrest looks toward the nurse for some unspoken understanding.\n\nOn television, a momentous event unfolds as Forrest is awarded the Medal of Honor by none other than President Johnson. The vibrant color footage captures the President placing the prestigious award around Forrest's neck, warmly shaking his hand, and leaning in to whisper something into his ear. This poignant scene shifts dramatically as the television then depicts Forrest unabashedly dropping his pants, bending over, and revealing a bullet wound on his bare buttocks to President Johnson, who looks on with an amused smile. At this sight, three men in a barber shop glance up in disbelief, while Mrs. Gump is visibly shocked.\n\nElsewhere, Hilary leads a procession of veterans toward a massive anti-Vietnam War rally, a gathering teeming with passionate activism. With an assertive yank, she pulls Forrest up onto the stage, where he is joined by other veterans who usher him toward the microphones. Abbie, one of the protesters, raises his fist defiantly as the crowd erupts into wild cheers. As Forrest addresses the crowd, his words unfortunately go unheard; a policeman has stealthily disconnected the audio circuit board by pulling out the patch cords. Undeterred, Forrest continues speaking, oblivious to the fact that his voice doesn't reach the audience. Hilary, alert and quick to act, notices this disruption and dashes over to confront the policeman. She pushes him away from the audio board and boldly grabs his nightstick. Another protester seizes the opportunity to drag the policeman away, allowing Isabel, Hilary, and another protester to frantically work together to restore the audio by plugging the tangled web of wires back into the board."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the bustling and often chaotic environment of the hospital, where the atmosphere is filled with the sounds of activity, a group of soldiers, each bearing various wounds from their brave service, spend their days and nights in the challenging process of recuperating and recovering. Meanwhile, Forrest, seeking a brief moment of respite from the surrounding hustle, makes the decision to turn off the TV, hoping for a bit of peace. Just as he does so, quite unexpectedly, a ping-pong ball makes sudden contact with the back of his head, prompting him to give a quick shake of his head in reaction to the surprising impact. The soldier responsible for the stray ping-pong ball then approaches Forrest and hands him a paddle, essentially extending an unspoken invitation to engage in a game. Accepting the offer, they move together towards the ping-pong table, prepared for a friendly yet competitive match. The player lifts the ball, moving it deliberately back and forth in his hand, while Forrest remains focused, his eyes fixed intently on the ball’s movements. With a flick of his wrist, the player deftly sends the ball bouncing onto the table, and Forrest begins to skillfully volley it back, engaging the other player in an energetic and lively back-and-forth exchange.\n\nAs the game progresses further, Forrest demonstrates remarkable agility, landing ping-pong balls with precision into a bedpan strategically positioned on a chair. Observing this impressive solo display of skill, a group of wounded soldiers sits nearby, captivated and mesmerized by his prowess. In a dazzling display of coordination, Forrest manages to hit two balls simultaneously against the far side of the table, showing his exceptional talent. Meanwhile, Lieutenant Dan, seemingly lost in his own thoughts, gazes out the window, appearing detached from the lively and animated scene behind him.\n\nLater in the evening, Forrest finds himself lying in bed, deeply and peacefully asleep. That tranquility is abruptly interrupted when a hand reaches out and firmly pulls him from his slumber. It is Lt. Dan, who hauls Forrest to the floor, pinning him down momentarily with a swift and determined motion. Lt. Dan then scrutinizes him with a penetrating and intense gaze before releasing him and rolling away. As the night progresses, Lt. Dan sits up, his gaze meeting Forrest’s, and this silent exchange lingers in the air, filled with unspoken understanding and emotion. Not long after, Forrest once again finds himself practicing ping-pong alone, when an officer approaches, holding an envelope in hand. Forrest, curious and intrigued, steps up to Lt. Dan’s bed, only to be momentarily halted mid-sentence. Before him lies a soldier heavily bandaged, with visible bloodstains, serving as a stark reminder of the war’s relentless toll. Turning away from Lt. Dan, Forrest looks toward the nurse for some unspoken understanding and reassurance.\n\nOn television, a momentous and significant event unfolds as Forrest is awarded the prestigious Medal of Honor by none other than President Johnson. The vibrant color footage captures the President placing the esteemed award around Forrest's neck, warmly shaking his hand, and leaning in to whisper something into his ear. This poignant scene shifts dramatically as the television then depicts Forrest unabashedly dropping his pants, bending over, and revealing a bullet wound on his bare buttocks to President Johnson, who looks on with an amused smile. At this unexpected sight, three men in a nearby barber shop glance up in disbelief, while Mrs. Gump is visibly shocked and taken aback.\n\nElsewhere, Hilary leads a procession of veterans toward a massive anti-Vietnam War rally, a gathering teeming with passionate activism and fervent energy. With an assertive yank, she pulls Forrest up onto the stage, where he is joined by other veterans who usher him toward the microphones. Abbie, one of the outspoken protesters, raises his fist defiantly as the crowd erupts into wild cheers and applause. As Forrest addresses the crowd, his words unfortunately go unheard; a policeman has stealthily disconnected the audio circuit board by pulling out the patch cords. Undeterred and unfazed, Forrest continues speaking, oblivious to the fact that his voice doesn't reach the eager audience. Hilary, alert and quick to act, notices this disruption and immediately dashes over to confront the policeman. She pushes him away from the audio board and boldly grabs his nightstick, taking decisive action. Another protester seizes the opportunity to drag the policeman away, allowing Isabel, Hilary, and another protester to frantically work together to restore the audio by plugging the tangled web of wires back into the board, re-establishing the connection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A group of wounded soldiers gather casually in the hospital, each one in various stages of recuperation, their spirits buoyed by each other's company. Amidst this scene, Forrest reaches over to the television set, turning it off with a deliberate motion, only to be unexpectedly tapped on the back of his head by a stray ping-pong ball, prompting him to give his head a quick shake in response. The wounded ping-pong player, who sent the ball astray, approaches Forrest with an extended hand, offering him a paddle. Accepting the paddle, Forrest and the player make their way toward the ping-pong table. The player, ready to serve, holds the ball aloft, moving it back and forth with a steady hand as Forrest maintains his focus on the ball's motion. With a swift toss, the player sends the ball bouncing on the table, and Forrest promptly engages, skillfully returning the ball to the other side. Forrest shows his growing prowess by hitting ping-pong balls that land precisely in a bedpan strategically placed on a chair, all while a group of wounded soldiers watches him in admiration as he continues to play solo. Elevating his game, Forrest manages to hit two balls at once against the opposite side of the table, whereas nearby, Lt. Dan finds himself gazing pensively out the window. As night falls, Forrest lies in his bed, sound asleep, only to be jolted awake when a hand suddenly reaches out and grasps him. It's Lt. Dan who pulls Forrest to the floor, using his grip to hold him down momentarily before locking eyes with him, letting go, and then rolling away. The tension diffuses as Lt. Dan sits up, with Forrest looking at him inquisitively. Later, Forrest, now alone, resumes his ping-pong practice when an officer strides over, presenting an envelope with significance in his posture. Forrest’s next steps lead him to Lt. Dan's bedside, where he halts mid-sentence, taken aback by the sight of a heavily bandaged soldier, bloodstains stark against the white bandages. In search of clarity, Forrest turns his gaze toward the nurse. Meanwhile, the television captures a momentous occasion, showing Forrest being awarded the Medal of Honor by President Johnson, vivid color footage depicting the President ceremoniously placing the medal around Forrest's neck, warmly shaking his hand, and leaning in to whisper in Forrest's ear a private exchange. The scene shifts as the television plays a lighter, more surprising moment, showing Forrest dropping his pants and bending over, revealing the bullet wound on his bare buttocks while President Johnson looks down, amused, with a smile. Watching this broadcast, three men in a barber shop glance up, their disbelief etched into their expressions, while Mrs. Gump, recognizing her son’s antics, looks up, her face mirroring shock and pride. In a stark contrast, Hilary leads a line of veterans marching determinedly toward a significant anti-Vietnam War rally, pulling Forrest onto the stage, which nods with the weight of anticipation. The other vets follow suit, ushering Forrest toward the microphones as Abbie raises his fist in solidarity, igniting the crowd's roar of cheers. Forrest stands before the mass, speaking earnestly, unaware a policeman stealthily approaches the audio circuit board, disconnecting the patch cords, rendering Forrest's voice silent to the eager audience. Hilary, quick to spot the disruption, rushes to the audio board and forcefully shoves the policeman aside, seizing his nightstick in defense. Amid the chaos, another protester intervenes, pulling the policeman away to maintain order as Isabel, Hilary, and another protester work frantically to untangle the wires and restore Forrest's voice to the crowd."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A group of wounded soldiers recuperates in the hospital, where Forrest turns off the TV and is hit on the head by a ping-pong ball. A fellow patient gives him a paddle, and they move to the ping-pong table, where Forrest focuses on the ball and begins playing. As other soldiers watch, Forrest skillfully hits balls into a bedpan and even plays with two balls at a time while Lt. Dan looks out the window. Later, Lt. Dan wakes Forrest abruptly, dragging him to the floor before rolling away. Later on, Forrest plays ping-pong solo when an officer approaches with an envelope. Forrest is interrupted as he visits Lt. Dan's bed, noticing a bandaged soldier with bloodstains. Meanwhile, the TV shows Forrest receiving the Medal of Honor from President Johnson, who whispers to him and smiles as Forrest humorously reveals his bullet wound. This astonishes viewers in a barbershop, including Mrs. Gump. Hilary then leads veterans, including Forrest, to an anti-Vietnam War rally, pulling them onto the stage. As Forrest speaks, a policeman sabotages the audio, but Hilary and other protesters restore the sound system while Forrest continues, unaware, until the audience hears him again."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A group of wounded soldiers, recovering from battles fought in the jungles of Vietnam, hang out in the hospital, recuperating. Forrest, a former soldier himself who recently returned from service, turns the TV off and is hit on the back of the head by a ping-pong ball, a popular pastime among soldiers for its competitive and stress-relieving aspects, so he shakes his head. The wounded ping-pong player, hailing from a small town known for its regional tournaments, hands Forrest a paddle, and they step toward the ping-pong table. The player, showcasing skills honed during downtime in military camps, holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball. The player tosses the ball down onto the table, and Forrest, who first picked up the sport during his service overseas, begins to hit the ball back to the other player. Forrest hits ping-pong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself. Forrest hits two balls at a time against the opposite side of the table while Lt. Dan, a decorated officer who lost his legs in the war, stares out the window, perhaps lost in thoughts about the life that could have been. Forrest lies in his bed asleep, then a hand reaches and grabs him. Lt. Dan, struggling with his transition to civilian life, pulls Forrest to the floor, holds him down, looks at him, lets go, and rolls away, demonstrating the challenges faced by veterans dealing with post-traumatic stress. Lt. Dan sits up as Forrest looks at him, and later Forrest plays ping-pong by himself when an officer, tasked with delivering important communications, walks up to him, holding up an envelope. Forrest steps up to Lt. Dan's bed and stops in mid-sentence as he looks down to see a heavily bandaged soldier with bloodstains lying there, a stark reminder of the severe injuries sustained in combat. Forrest turns and looks at the nurse, whose compassion and dedication provide comfort amidst the chaos. The television reveals Forrest being awarded the Medal of Honor by President Johnson, acknowledging his bravery and service to the nation, with color footage showing President Johnson placing the award around Forrest's neck, shaking his hand, leaning, and whispering into Forrest's ear with gratitude. The television then shows Forrest dropping his pants, bending over, and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles, a moment that quickly became a humorous anecdote in military circles. Three men in a barber shop, gathering for their regular trims and conversations, look up in disbelief, and Mrs. Gump, proud yet worried about her son's adventures, looks up in shock. Hilary, a passionate activist deeply involved in the anti-war movement, leads a line of vets toward a large anti-Vietnam War rally and pulls Forrest up onto the stage; the other vets, united by their shared experiences, follow and push Forrest toward the microphones. Abbie, renowned for his fiery speeches and rebellious spirit, raises his fist as the crowd cheers wildly, and Forrest looks at the crowd as he speaks. A policeman, intent on maintaining order during the volatile demonstration, sneaks over to the audio circuit board and pulls the patch cords out, so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman, rushes over to the audio board, pushes the policeman away, and grabs his nightstick. Another protester grabs the policeman and pulls him away as Isabel, Hilary, and another protester, determined to make their voices heard, try to plug the tangled mess of wires back into the audio board."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A group of wounded soldiers hang out in the hospital recuperating. Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head. The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table. The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball. The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player. Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself. Forrest hits two balls at a time against the opposite side of the table while Lt Dan stares out the window. Forrest lies in his bed asleep then a hand reaches and grabs him. Lt Dan pulls Forrest to the floor holds him down looks at him let us go and rolls away. Lt Dan sits up as Forrest looks at him and later Forrest plays pingpong by himself when an officer walks up to him holding up an envelope. Forrest steps up to Lt Dan's bed and stops in midsentence as he looks down to see a heavily bandaged soldier with bloodstains lying there. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Forrest turns and looks at the nurse. The television reveals Forrest being awarded the Medal of Honor by President Johnson with color footage showing President Johnson placing the award around Forrest's neck shaking his hand leaning and whispering into Forrest's ear. The television then shows Forrest dropping his pants bending over and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles. Three men in a barber shop look up in disbelief and Mrs Gump looks up in shock. Hilary leads a line of vets toward a large antiVietnam War rally and pulls Forrest up onto the stage. the other vets follow and push Forrest toward the microphones. Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks. A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick. Another protester grabs the policeman and pulls him away as Isabel. Hilary and another protester try to plug the tangled mess of wires back into the audio board."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A group of wounded soldiers hang out in the hospital recuperating. Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head. The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table. The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball. The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player. Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself. Forrest hits two balls at a time against the opposite side of the table while Lt Dan stares out the window. Forrest lies in his bed asleep then a hand reaches and grabs him. Lt Dan pulls Forrest to the floor holds him down looks at him let us go and rolls away. Lt Dan sits up as Forrest looks at him and later Forrest plays pingpong by himself when an officer walks up to him holding up an envelope. Forrest steps up to Lt Dan's bed and stops in midsentence as he looks down to see a heavily bandaged soldier with bloodstains lying there. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Forrest turns and looks at the nurse. The television reveals Forrest being awarded the Medal of Honor by President Johnson with color footage showing President Johnson placing the award around Forrest's neck shaking his hand leaning and whispering into Forrest's ear. The television then shows Forrest dropping his pants bending over and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles. Three men in a barber shop look up in disbelief and Mrs Gump looks up in shock. Hilary leads a line of vets toward a large antiVietnam War rally and pulls Forrest up onto the stage. the other vets follow and push Forrest toward the microphones. Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks. A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick. Another protester grabs the policeman and pulls him away as Isabel. Hilary and another protester try to plug the tangled mess of wires back into the audio board."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A group of wounded soldiers hang out in the hospital recuperating. Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head. The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table. The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball. The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player. Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself. Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks. A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him. Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick. Another protester grabs the policeman and pulls him away as Isabel. Hilary and another protester try to plug the tangled mess of wires back into the audio board."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A group of wounded soldiers hang out in the hospital recuperating. Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head. The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table. Another protester grabs the policeman and pulls him away as Isabel. Hilary and another protester try to plug the tangled mess of wires back into the audio board."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A band of wandering astronomers lounge in the library, researching. Samantha opens the laptop and is nudged on the shoulder by a paper airplane, so she tilts her head. The confused kite-flyer gives Samantha a string, and they drift toward the kite field. The flyer raises the kite up and swings it side to side as Samantha fixes her gaze on the kite. The flyer releases the kite onto the field, and Samantha starts to glide the kite around with the puzzled flyer. Samantha sends kites landing in a saucepan placed on a bicycle as a band of wandering astronomers recline and observe her glide solo. Samantha glides twin kites simultaneously against the distant side of the field while Dr. Talbot gazes at the sky. Samantha sits in her hammock awake, then a foot reaches and nudges her. Dr. Talbot pulls Samantha to the road, keeps her steady, stares at her, releases her, and strolls away. Dr. Talbot stands up as Samantha glances at her, and later Samantha glides kites alone when a sailor strolls up to her, raising a parcel. Samantha steps up to Dr. Talbot’s hammock and halts mid-laugh as she peers down to find a heavily smudged botanist with ink splotches lying there. Samantha pivots and gazes at the teacher. The film displays Samantha being gifted the Golden Compass by Principal Lewis, with monochrome footage showing Principal Lewis draping the medal around Samantha’s neck, shaking her hand, leaning, and humming into Samantha's ear. The film then depicts Samantha dropping her hat, bowing forward, and displaying a tattoo on her bare shoulder as Principal Lewis glances down and grins. Three women in a bakery glance up in surprise, and Aunt Martha stares up in awe. Jeremy guides a line of botanists toward a large pro-astronomy festival and pulls Samantha up onto the platform; the other botanists follow and nudge Samantha toward the podium. Oliver raises his hand as the audience applauds eagerly, and Samantha views the audience as she communicates. A janitor creeps over to the sound system and disconnects the cables, so Samantha continues to communicate into the podium despite being unheard. Jeremy observes the janitor, dashes over to the sound system, shoves the janitor aside, and snatches his broom. Another observer seizes the janitor and drags him away as Clara, Jeremy, and another observer strive to reconnect the jumble of cords into the sound system."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Wounded soldiers are recuperating in a hospital where Forrest receives a ping-pong paddle from a fellow patient. He quickly engages in a game, capturing the attention of onlookers, including Lt. Dan. Later, as Forrest sleeps, Lt. Dan suddenly pulls him to the floor and then rolls away, leaving Forrest confused. An officer delivers an envelope to Forrest, who visits Lt. Dan's bed, seeing a heavily bandaged comrade. The TV highlights Forrest receiving the Medal of Honor from President Johnson, who whispers to him and, amused, reacts to Forrest revealing his bullet wound. Onlookers, including Mrs. Gump, are stunned by the footage. Later, at an anti-Vietnam War rally, Hilary brings Forrest on stage to address the crowd. As he speaks, a policeman disrupts the audio, but Hilary and others confront him, working to restore sound amidst the chaos."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hilary and another protester try to plug the tangled mess of wires back into the audio board Another protester grabs the policeman and pulls him away as Isabel Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks the other vets follow and push Forrest toward the microphones Hilary leads a line of vets toward a large antiVietnam War rally and pulls Forrest up onto the stage Three men in a barber shop look up in disbelief and Mrs Gump looks up in shock The television then shows Forrest dropping his pants bending over and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles The television reveals Forrest being awarded the Medal of Honor by President Johnson with color footage showing President Johnson placing the award around Forrest's neck shaking his hand leaning and whispering into Forrest's ear Forrest turns and looks at the nurse Forrest steps up to Lt Dan's bed and stops in midsentence as he looks down to see a heavily bandaged soldier with bloodstains lying there Lt Dan sits up as Forrest looks at him and later Forrest plays pingpong by himself when an officer walks up to him holding up an envelope Lt Dan pulls Forrest to the floor holds him down looks at him let us go and rolls away Forrest lies in his bed asleep then a hand reaches and grabs him Forrest hits two balls at a time against the opposite side of the table while Lt Dan stares out the window Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head A group of wounded soldiers hang out in the hospital recuperating"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head A group of wounded soldiers hang out in the hospital recuperating The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player Forrest lies in his bed asleep then a hand reaches and grabs him Forrest hits two balls at a time against the opposite side of the table while Lt Dan stares out the window Lt Dan sits up as Forrest looks at him and later Forrest plays pingpong by himself when an officer walks up to him holding up an envelope Lt Dan pulls Forrest to the floor holds him down looks at him let us go and rolls away Forrest turns and looks at the nurse Forrest steps up to Lt Dan's bed and stops in midsentence as he looks down to see a heavily bandaged soldier with bloodstains lying there The television then shows Forrest dropping his pants bending over and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles The television reveals Forrest being awarded the Medal of Honor by President Johnson with color footage showing President Johnson placing the award around Forrest's neck shaking his hand leaning and whispering into Forrest's ear Hilary leads a line of vets toward a large antiVietnam War rally and pulls Forrest up onto the stage Three men in a barber shop look up in disbelief and Mrs Gump looks up in shock Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks the other vets follow and push Forrest toward the microphones Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him Hilary and another protester try to plug the tangled mess of wires back into the audio board Another protester grabs the policeman and pulls him away as Isabel"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Forrest turns and looks at the nurse The television reveals Forrest being awarded the Medal of Honor by President Johnson with color footage showing President Johnson placing the award around Forrest's neck shaking his hand leaning and whispering into Forrest's ear The television then shows Forrest dropping his pants bending over and showing the bullet wound on his bare buttocks as President Johnson looks down and smiles Three men in a barber shop look up in disbelief and Mrs Gump looks up in shock Hilary leads a line of vets toward a large antiVietnam War rally and pulls Forrest up onto the stage the other vets follow and push Forrest toward the microphones Abbie raises his fist as the crowd cheers wildly and Forrest looks at the crowd as he speaks A policeman sneaks over to the audio circuit board and pulls the patch cords out so Forrest continues to speak into the microphone even though no one can hear him Hilary notices the policeman rushes over to the audio board pushes the policeman away and grabs his nightstick Another protester grabs the policeman and pulls him away as Isabel Hilary and another protester try to plug the tangled mess of wires back into the audio board A group of wounded soldiers hang out in the hospital recuperating Forrest turns the TV off and is hit on the back of the head by a pingpong ball so he shakes his head The wounded pingpong player hands Forrest a paddle and they step toward the pingpong table The player holds the ball up and moves it back and forth as Forrest keeps his eyes on the ball The player tosses the ball down onto the table and Forrest begins to hit the ball back to the other player Forrest hits pingpong balls that land in a bedpan positioned on a chair as a group of wounded soldiers sit and watch him play by himself Forrest hits two balls at a time against the opposite side of the table while Lt Dan stares out the window Forrest lies in his bed asleep then a hand reaches and grabs him Lt Dan pulls Forrest to the floor holds him down looks at him let us go and rolls away Lt Dan sits up as Forrest looks at him and later Forrest plays pingpong by himself when an officer walks up to him holding up an envelope Forrest steps up to Lt Dan's bed and stops in midsentence as he looks down to see a heavily bandaged soldier with bloodstains lying there"
        }
      ]
    }
  ]
}