{
  "ground_truth": "Turning the corner, David runs down another street and catches up to Elise as she makes another turn on foot. She stops, grins, squirms, takes a breath, and eyes him. Meanwhile, a man runs down a corridor; it's the boyish officer. He opens a door marked Mr. Richardson and finds the veteran officer at his desk. The messenger shows a map book, and the officer grabs his brown fedora. In the hall, he passes Harry, who doffs his hat, and the boyish officer, now sporting his own hat, follows Richardson through a door. They arrive in a cafe co-room and see David and Elise. The boyish officer checks his map book, and a host seats them. His book shows pulsing red dots. Outside, David glances aside, and at their outdoor table, Elise smiles to herself and peeks at David. The officers share a table as David glances around while a server fills his water glass. Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area, where the aide checks his map book, and a red inflection point pulses larger. Charlie and a third officer arrive, and Charlie pays the check. Elise grins at David, while Richardson and his aide look on. As David and Elise go to kiss, Richardson triggers a text to Charlie, whose interjection prevents the kiss. David nods amiably and gives Elise a long kiss on the cheek, and a relieved Richardson bows his head as she nods, smiling radiantly. Later, by the Brooklyn Bridge, David exits a Town Car and shakes many hands, then takes the podium before a crowd of hundreds. The gathering overlooks the East River, and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake. David peers across the river to Pier 17. In a quaint eclectic apartment, Elise puts on a hoodie and picks up her cell, reading a text message that rehearsal is back at Cedar Lake, not Pier 17. David's senate race gathering wraps up, and he spies Richardson in a window. Both Adjustment officers duck out of sight, and David frowns at the Pier 17 structures across the river while Richardson pouts. David stares at the now empty window. A large water taxi crosses the river, and David rides aboard it as the skipper pilots it to the pier. David hurries onto the platform and up some stairs, following a covered walkway alongside a commercially refurbished warehouse. Finding a studio door chain-locked, he makes a call on his cell, but his phone reads disconnected, call failed, searching for signal. With a determined gaze, David jogs off the pier as Richardson and his aide observe. The officers follow David in the map book, and David rounds a corner, coming face to face with the two officers.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Turning the bend, David sprints down another road and overtakes Elise as she takes another twist on foot. She halts, beams, squirms, takes a breath, and gazes at him. Meanwhile, a gentleman dashes down a hallway; it's the youthful officer. He opens a door labeled Mr. Richardson and encounters the seasoned officer at his desk. The courier displays a atlas, and the officer snatches his tan trilby. In the passageway, he crosses paths with Harry, who tips his hat, and the youthful officer, now wearing his own hat, follows Richardson through a door. They arrive in a cafe anteroom and perceive David and Elise. The youthful officer inspects his atlas, and a host seats them. His atlas shows throbbing crimson dots. Outside, David glances aside, and at their outdoor table, Elise smiles to herself and peeks at David. The officers occupy a table as David glances around while a server fills his water goblet. Richardson and his aide follow a pathway to a spot overlooking the outdoor dining area, where the aide inspects his atlas, and a red inflection point throbs larger. Charlie and a third officer appear, and Charlie settles the bill. Elise beams at David, while Richardson and his aide observe. As David and Elise go to kiss, Richardson sends a text to Charlie, whose interruption forestalls the kiss. David nods affably and gives Elise a lengthy peck on the cheek, and a relieved Richardson inclines his head as she nods, smiling brightly. Later, by the Brooklyn Bridge, David exits a Town Car and shakes many hands, then takes the dais before a crowd of hundreds. The assembly overlooks the East River, and Richardson's aide receives a text that the practice has been shifted back to Cedar Lake. David gazes across the river to Pier 17. In a quaint eclectic apartment, Elise puts on a hoodie and picks up her mobile, reading a text that practice is back at Cedar Lake, not Pier 17. David's senate race assembly concludes, and he glimpses Richardson in a window. Both Adjustment officers disappear from sight, and David frowns at the Pier 17 structures across the river while Richardson pouts. David stares at the now vacant window. A large water ferry crosses the river, and David rides aboard it as the captain navigates it to the pier. David hastens onto the platform and up some stairs, following a covered walkway alongside a commercially renovated warehouse. Finding a studio door chained-locked, he makes a call on his mobile, but his device reads disconnected, call failed, searching for signal. With a resolute stare, David jogs off the pier as Richardson and his aide watch. The officers track David in the atlas, and David rounds a corner, coming face to face with the two officers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Turning the corner, another street is run down by David, and Elise is caught up to as another turn is made by her on foot. She stops, grins, squirms, takes a breath, and eyes him. Meanwhile, a corridor is run down by a man; it's the boyish officer. A door marked Mr. Richardson is opened by him, and the veteran officer is found at his desk. A map book is shown by the messenger, and the brown fedora is grabbed by the officer. In the hall, Harry is passed by him, who doffs his hat, and Richardson is followed through a door by the boyish officer, now sporting his own hat. A cafe co-room is arrived at by them, and David and Elise are seen. His map book is checked by the boyish officer, and they are seated by a host. Pulsing red dots are shown in his book. Outside, a glance is made aside by David, and Elise smiles to herself and peeks at David at their outdoor table. A table is shared by the officers as David glances around while his water glass is filled by a server. Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area, where the map book is checked by the aide, and a red inflection point pulses larger. Charlie and a third officer arrive, and the check is paid by Charlie. A grin is given to David by Elise, while Richardson and his aide look on. As David and Elise go to kiss, a text is triggered to Charlie by Richardson, whose interjection prevents the kiss. A nod is given amiably by David, and Elise is given a long kiss on the cheek, and a relieved Richardson bows his head as she smiles radiantly and nods. Later, by the Brooklyn Bridge, a Town Car is exited by David, and many hands are shaken by him, then the podium is taken by him before a crowd of hundreds. The East River is overlooked by the gathering, and a text is received by Richardson's aide that the rehearsal has been moved back to Cedar Lake. The river is peered across by David to Pier 17. In a quaint eclectic apartment, a hoodie is put on by Elise, and her cell is picked up, reading a text message that rehearsal is back at Cedar Lake, not Pier 17. David's senate race gathering is wrapped up, and Richardson is spied in a window by him. Both Adjustment officers duck out of sight, and the Pier 17 structures across the river are frowned at by David while Richardson pouts. The now empty window is stared at by David. A large water taxi crosses the river, and it is piloted to the pier by the skipper as David rides aboard it. The platform is hurried onto by David and up some stairs, following a covered walkway alongside a commercially refurbished warehouse. A studio door is found chain-locked by him, and a call is made on his cell, but disconnected, call failed, searching for signal is read by his phone. With a determined gaze, the pier is jogged off by David as Richardson and his aide observe. David is followed in the map book by the officers, and David rounds a corner, coming face to face with the two officers."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Turning the corner, David races down another street, catching up to Elise as she turns. She stops, grins, squirms, breathes, and eyes him. Meanwhile, a man runs through a corridor; it's the youthful officer. He enters a door labeled Mr. Richardson, finding the veteran officer at his desk. The messenger shows a map book, prompting the officer to grab his brown fedora. In the hallway, he passes Harry, who doffs his hat, and the young officer, now with his own hat, follows Richardson through a door. They reach a cafe co-room and spot David and Elise. The young officer checks his map book, and a host seats them. His book displays pulsing red dots. Outside, David glances aside, while at their table, Elise smiles and peeks at him. The officers share a table as a server fills David's glass. Richardson and his aide proceed along a walkway overlooking the dining area, where the aide checks the map book, noting a larger red inflection point. Charlie and a third officer arrive, with Charlie paying the bill. Elise grins at David, while Richardson and his aide observe. As David and Elise lean in to kiss, Richardson texts Charlie, whose interruption stops them. David nods amicably, kissing Elise's cheek, as a relieved Richardson bows his head, and Elise smiles radiantly. Later, near the Brooklyn Bridge, David exits a Town Car, shakes hands, and addresses a crowd by the East River. Richardson's aide receives a text noting the rehearsal is back at Cedar Lake. David peers across the river to Pier 17. In her eclectic apartment, Elise dons a hoodie and checks her cell, reading that rehearsal is at Cedar Lake, not Pier 17. David's senate race gathering wraps up, and he spots Richardson in a window. Both Adjustment officers duck, and David frowns at Pier 17 across the river while Richardson pouts. David stares at the empty window. A large water taxi crosses the river, and David boards it as the skipper pilots to the pier. David hurries onto the platform, climbing stairs along a refurbished warehouse walkway. Finding a chain-locked studio door, he calls on his cell, but it reads disconnected, call failed. Determined, David jogs off the pier, observed by Richardson and his aide. The officers follow David in the map book as he rounds a corner, confronting the two officers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Turning the corner, David races down another street, catching up to Elise. She stops, smiles, squirms, breathes, and looks at him. A boyish officer runs down a corridor to Mr. Richardson's office, showing him a map book. They don hats and head to a cafe co-room, spotting David and Elise. The officer checks the map book, revealing pulsing red dots, as a host seats them. David glances at Elise, who smiles to herself. The officers watch them from a walkway, observing pulsing red points. Charlie and a third officer arrive, with Charlie settling the check. As David and Elise almost kiss, Richardson texts Charlie, preventing it. David nods and kisses Elise on the cheek, with Richardson relieved. By the Brooklyn Bridge, David exits a Town Car, shakes hands, and addresses a crowd, overlooking the East River. Richardson's aide receives a text about a rehearsal change to Cedar Lake. At her apartment, Elise reads the same text. David ends his senate race gathering, spotting Richardson, who ducks from sight. David frowns at Pier 17 while Richardson pouts. Riding a water taxi, David reaches the pier, hurrying to a studio with a locked door. His cell fails to connect as he jogs off the pier. Richardson and his aide track him, and David encounters the officers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he swiftly turns the corner with purpose and determination, David sprints down yet another bustling street, his eyes fixed on Elise, who is making a sharp turn as she continues on foot. She eventually comes to a halt, wearing a grin on her face, shifting uncomfortably as she catches her breath, and locks eyes with him. Meanwhile, in a parallel scene, a man hurries down a long corridor; it's none other than the young, boyish officer. He flings open a door marked with the name Mr. Richardson and discovers the seasoned veteran officer seated at his desk, engrossed in his work. The messenger reveals a map book to the officer, who immediately grabs his trusty brown fedora, ready for action. In the hallway, he encounters Harry, who respectfully doffs his hat, while the boyish officer, now wearing his own hat, trails Richardson through another door. Together, they find themselves entering a shared cafe room where they spot David and Elise. The boyish officer opens his map book, scanning it closely, just as a host arrives to seat them graciously. The book displays pulsing red dots, indicating significant activity. Outside, David momentarily glances sideways, and at their outdoor table, Elise smiles quietly to herself, stealing a peek at David. The officers are seated at a nearby table as David looks around cautiously, while a server diligently fills his water glass. Richardson, accompanied by his aide, traverses a walkway leading to a vantage point that overlooks the outdoor dining area. Here, the aide checks his map book once more, noticing a red inflection point that pulsates even more prominently. Charlie and a third officer make their appearance, and Charlie promptly handles the check. Elise beams at David with warmth as Richardson and his aide look on attentively. Just as David and Elise are about to share a kiss, Richardson swiftly sends a text to Charlie, whose timely interjection interrupts the moment. David responds with a congenial nod and instead gives Elise a prolonged, affectionate kiss on the cheek. A visibly relieved Richardson bows his head slightly as Elise acknowledges with a radiant smile. Later, in the iconic setting near the Brooklyn Bridge, David steps out of a Town Car and warmly shakes hands with numerous individuals before confidently approaching the podium, preparing to address a crowd of hundreds. The assemblage overlooks the scenic East River, and Richardson's aide receives a text notifying him that the rehearsal has been rescheduled to Cedar Lake. David glances across the river towards Pier 17 thoughtfully. In her charming and uniquely decorated apartment, Elise dons a hoodie and picks up her cell phone, reading a text message that rehearsal is now back at Cedar Lake, rather than Pier 17. As David's senate campaign gathering concludes, he catches a glimpse of Richardson in a window, prompting both Adjustment officers to discreetly slip out of view. David's gaze shifts to the Pier 17 structures across the river, a hint of perplexity on his face, while Richardson appears disheartened. David continues to stare at the window, now empty. A large water taxi glides across the river, and David is aboard, as the skipper expertly navigates it to the pier. With urgency, David makes his way onto the platform and ascends some stairs, following a covered walkway that runs alongside a commercially renovated warehouse. Discovering that the studio door is chain-locked, he attempts to make a call on his cell, only to see the message: disconnected, call failed, searching for signal. His expression resolute, David jogs away from the pier, all the while observed by Richardson and his aide. The attentive officers track David's movements using the map book, and David rounds a corner, suddenly coming face to face with the two officers."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he seamlessly and confidently turns the corner with a sense of purpose and unwavering determination, David energetically sprints down yet another bustling, crowded street, his eyes intensely fixed on Elise, who is making a sharp, rapid turn as she continues on foot. She eventually comes to a halt, wearing a broad grin on her face, shifting uncomfortably while she catches her breath, and then locks eyes with him. Meanwhile, in a parallel scene unfolding at the same time, a man hurries down a long, seemingly endless corridor; it's none other than the young, boyish officer. He flings open a door prominently marked with the name Mr. Richardson, discovering the seasoned veteran officer seated at his desk, completely engrossed and absorbed in his work. The messenger reveals a map book to the officer, who immediately grabs his trusty brown fedora, signaling his readiness for action. In the hallway, he encounters Harry, who respectfully doffs his hat, while the boyish officer, now wearing his own hat, trails Richardson through another door. Together, they find themselves entering a shared cafe room where they spot David and Elise. The boyish officer opens his map book, scanning it closely, just as a host arrives to graciously seat them. The book displays pulsing red dots, indicating significant and noteworthy activity. Outside, David momentarily glances sideways, and at their outdoor table, Elise smiles quietly to herself, stealing a tender peek at David. The officers are seated at a nearby table as David looks around cautiously, while a diligent server fills his water glass with attentive care. Richardson, accompanied by his aide, traverses a walkway leading to a vantage point that overlooks the outdoor dining area. Here, the aide checks his map book once more, noticing a red inflection point that pulsates even more prominently. Charlie and a third officer make their appearance, and Charlie promptly handles the check. Elise beams at David with genuine warmth as Richardson and his aide look on attentively. Just as David and Elise are about to share a romantic kiss, Richardson swiftly sends a text to Charlie, whose timely interjection interrupts the moment. David responds with a congenial nod and instead gives Elise a prolonged, affectionate kiss on the cheek. A visibly relieved Richardson bows his head slightly as Elise acknowledges with a radiant and grateful smile. Later, in the iconic, picturesque setting near the Brooklyn Bridge, David steps out of a Town Car and warmly shakes hands with numerous individuals before confidently approaching the podium, preparing to address a crowd of hundreds. The assemblage overlooks the scenic, flowing East River, and Richardson's aide receives a text notifying him that the rehearsal has been rescheduled to Cedar Lake. David, standing thoughtfully, glances across the river towards Pier 17. In her charming and uniquely decorated apartment, Elise dons a hoodie and picks up her cell phone, reading a text message that rehearsal is now back at Cedar Lake, rather than Pier 17. As David's senate campaign gathering concludes, he catches a glimpse of Richardson in a window, prompting both Adjustment officers to discreetly slip out of view. David's gaze shifts to the Pier 17 structures across the river, a hint of perplexity on his face, while Richardson appears disheartened. David continues to stare at the now empty window. A large water taxi glides across the river, and David is aboard, as the skipper expertly navigates it to the pier. With urgency, David makes his way onto the platform and ascends some stairs, following a covered walkway running alongside a commercially renovated warehouse. Discovering that the studio door is chain-locked, he attempts to make a call on his cell, only to see the message: disconnected, call failed, searching for signal. His expression resolute, David jogs away from the pier, all the while observed by Richardson and his aide. The attentive officers track David's movements using the map book, and David rounds a corner, suddenly coming face to face with the two officers."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As David turns the corner with urgency, he sprints down the length of another street, quickening his pace to close the gap between himself and Elise, who is also moving briskly on foot. As she reaches a turning point herself, Elise halts her steps momentarily, allowing a grin to form on her lips. She squirms slightly, takes a deep, calming breath, and focuses her gaze on David. Concurrently, a man, determined and swift, dashes down a corridor; this man is the boyish officer. He reaches a door with a label identifying it as Mr. Richardson's office, opens it, and steps inside to find the veteran officer seated diligently at his desk. The boyish officer presents a book filled with maps, prompting Richardson to reach for his distinguished brown fedora. As they move into the hallway, Richardson encounters Harry, offering a polite nod as Harry briefly removes his hat in acknowledgment. The young officer, now adorning his own hat, trails behind Richardson as they exit through another door. Upon arriving in a shared area of a cafe, they spot David and Elise already present. The boyish officer consults his map book, which reveals pulsating red indicators, while a host approaches to seat them. Outside, David diverts his gaze momentarily, as Elise, seated at their outdoor table, subtly smiles to herself and steals a glance at David. Nearby, the officers settle themselves at their own table as David allows his eyes to wander, observing his surroundings, while a server attentively pours water into his glass. Richardson and his aide proceed along a walkway until they find a vantage point overlooking the outdoor cafe area, prompting the aide to refer back to his map book, where a red inflection point noticeably enlarges. At this moment, Charlie and another officer make their appearance, with Charlie handling the payment for their check. As Elise beams at David, Richardson and his aide watch intently. Just as David and Elise lean in toward each other for a kiss, Richardson tactically sends a text message to Charlie, who subsequently interrupts in time to prevent the kiss. In acceptance, David offers an amiable nod and instead delivers a long, affectionate kiss on Elise's cheek, prompting a relieved Richardson to lower his head, while Elise, glowing with happiness, nods back at David. Subsequently, with the iconic Brooklyn Bridge as the backdrop, David steps gracefully out of a Town Car, extending warm handshakes to numerous individuals before ascending the podium to address a crowd of hundreds gathered nearby. Overlooking the East River is this significant assembly, during which Richardson's aide receives a text notification indicating that the rehearsal location has shifted back to Cedar Lake. From his vantage point, David gazes across the river, directing his sight toward Pier 17. Meanwhile, in an eclectic and charming apartment, Elise slips into a hoodie and retrieves her cell phone, reading the text that informs her the rehearsal has been rescheduled to Cedar Lake instead of Pier 17. As David's senate race event comes to a close, he spots Richardson lurking at a window, prompting both Adjustment officers to discreetly withdraw from view. David, in turn, casts a contemplative look toward the structures at Pier 17 across the river while Richardson, feeling thwarted, responds with a pout. David continues to fix his eyes on the now-vacated window. A large water taxi traverses the river, and David finds himself aboard, as the skipper skillfully navigates the vessel toward the pier. Once docked, David hastily disembarks onto the platform, ascends a set of stairs, and follows a covered walkway parallel to a commercially refurbished warehouse. On reaching the studio door, he discovers it secured with a chain lock, prompting him to dial on his cell phone, only to be met with a display message indicating disconnection, call failure, and a futile search for signal. With resolve etched across his face, David departs the pier with a jog as Richardson and his aide monitor his movements. The officers keenly track David via the map book, and when David rounds a corner, he finds himself confronted directly by the two officers."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David rounds the corner and runs down another street, catching up with Elise as she turns. She grins, catches her breath, and locks eyes with him. Meanwhile, a boyish officer hurries down a corridor and enters Mr. Richardson's office, showing him a map book. Richardson grabs his fedora, and they pass Harry in the hall before arriving in a cafe where they find David and Elise. The boyish officer checks the map book displaying pulsing red dots, as a host seats them. Outside, David glances, while Elise smiles and sneaks a peek at him. The officers sit at a nearby table, and Richardson monitors the scene while a server fills David's water glass. Richardson and his aide move to a spot overlooking the dining area, checking the map book as a red inflection point grows. Charlie and a third officer join them briefly. As David and Elise lean in for a kiss, Richardson's text to Charlie interrupts, prompting a cheek kiss instead. A relieved Richardson bows as Elise smiles. Later, by the Brooklyn Bridge, David exits a Town Car, greets attendees, and addresses a crowd. Overlooking the East River, Richardson's aide gets a text about the rehearsal change to Cedar Lake. David notices Richardson in a window across the river, but the officers disappear from view, leaving David frowning at Pier 17. A water taxi carries David across the river, where he hurries up the stairs of a refurbished warehouse. Finding the studio door chain-locked, he attempts a call but faces connectivity issues. With determination, David jogs off the pier as Richardson and his aide track him. Turning a corner, David confronts both officers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Turning the corner of Manhattan's bustling streets, David runs down another street and catches up to Elise as she makes another turn on foot. She stops, grins, squirms, takes a breath, and eyes him with a mischievous glint. Meanwhile, a man, identifiable by his distinct uniform, runs down a corridor; it's the boyish officer, part of a specialized unit tasked with maintaining the balance of fate. He opens a door marked Mr. Richardson, revealing the veteran officer, known for his strategic brilliance, at his desk. The messenger shows a map book, a crucial tool displaying significant locational data, and the officer grabs his brown fedora, a nod to classic detective attire. In the hall, he passes Harry, an old friend from their academy days, who doffs his hat, and the boyish officer, now sporting his own hat that signifies his rank, follows Richardson through a door. They arrive in a bustling cafe co-room and see David and Elise, whose presence could alter the course of events. The boyish officer checks his map book, which now shows pulsing red dots indicating significant activity, and a host, accustomed to such visitors, seats them. His book shows pulsing red dots signaling the need for intervention. Outside, David glances aside at the vibrant street scene, and at their outdoor table, Elise smiles to herself, a sign of contentment, and peeks at David. The officers share a table as David glances around, aware of his surroundings, while a server fills his water glass with precision. Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area, where the aide checks his map book, and a red inflection point, predicting potential disruptions, pulses larger. Charlie and a third officer arrive, and Charlie, meticulous about protocol, pays the check. Elise grins at David, while Richardson and his aide, wary yet hopeful, look on. As David and Elise go to kiss, Richardson triggers a text to Charlie, whose well-timed interjection prevents the kiss from altering timelines. David nods amiably, respecting the moment's gravity, and gives Elise a long kiss on the cheek, and a relieved Richardson bows his head as she nods, smiling radiantly, unaware of the larger implications. Later, by the iconic Brooklyn Bridge, a symbol of New York City's resilience, David exits a Town Car, a vehicle reserved for important figures, and shakes many hands, then takes the podium before a crowd of hundreds gathered for his crucial senate race event. The gathering overlooks the East River, a historic waterway, and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake, a known rehearsal space for significant events. David peers across the river to Pier 17, a newly developed leisure hub. In a quaint eclectic apartment, reflecting her artistic lifestyle, Elise puts on a hoodie and picks up her cell, reading a text message that rehearsal is back at Cedar Lake, not Pier 17. David's senate race gathering wraps up, and he spies Richardson in a window of a nearby building. Both Adjustment officers duck out of sight, blending into the city's fabric, and David frowns at the Pier 17 structures across the river, part of the iconic South Street Seaport, while Richardson pouts, contemplating their next move. David stares at the now empty window, pondering his path. A large water taxi, a common mode of transport on the East River, crosses the river, and David rides aboard it as the skipper, a seasoned navigator, pilots it to the pier. David hurries onto the platform and up some stairs, following a covered walkway alongside a commercially refurbished warehouse, a stark reminder of the city's ongoing transformation. Finding a studio door chain-locked, he makes a call on his cell, but his phone reads disconnected, call failed, searching for signal, indicating a deliberate disruption. With a determined gaze, David jogs off the pier as Richardson and his aide, ever vigilant, observe. The officers follow David's movements in the map book, a tool designed to maintain destiny's course, and David rounds a corner, coming face to face with the two guardians of fate."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot. She stops grins squirms takes a breath and eyes him. Meanwhile a man runs down a corridor it is the boyish officer. He opens a door marked Mr Richardson and finds the veteran officer at his desk. The messenger shows a map book and the officer grabs his brown fedora. In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door. They arrive in a cafe coroom and see David and Elise. The boyish officer checks his map book and a host seats them. His book shows pulsing red dots. Outside David glances aside and at their outdoor table. Elise smiles to herself and peeks at David. The officers share a table as David glances around while a server fills his water glass. Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area where the aide checks his map book and a red inflection point pulses larger. Charlie and a third officer arrive and Charlie pays the check. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Elise grins at David while Richardson and his aide look on. As David and Elise go to kiss Richardson triggers a text to Charlie whose interjection prevents the kiss. David nods amiably and gives Elise a long kiss on the cheek and a relieved Richardson bows his head as she nods smiling radiantly. Later by the Brooklyn Bridge David exits a Town Car and shakes many hands then takes the podium before a crowd of hundreds. The gathering overlooks the East River and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake. David peers across the river to Pier 17. In a quaint eclectic apartment Elise puts on a hoodie and picks up her cell reading a text message that rehearsal is back at Cedar Lake not Pier 17. David's senate race gathering wraps up and he spies Richardson in a window. Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts. David stares at the now empty window. A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier. David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse. Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal. With a determined gaze David jogs off the pier as Richardson and his aide observe. The officers follow David in the map book and David rounds a corner coming face to face with the two officers."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot. She stops grins squirms takes a breath and eyes him. Meanwhile a man runs down a corridor it is the boyish officer. He opens a door marked Mr Richardson and finds the veteran officer at his desk. The messenger shows a map book and the officer grabs his brown fedora. In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door. They arrive in a cafe coroom and see David and Elise. The boyish officer checks his map book and a host seats them. His book shows pulsing red dots. Outside David glances aside and at their outdoor table. Elise smiles to herself and peeks at David. The officers share a table as David glances around while a server fills his water glass. Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area where the aide checks his map book and a red inflection point pulses larger. Charlie and a third officer arrive and Charlie pays the check. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Elise grins at David while Richardson and his aide look on. As David and Elise go to kiss Richardson triggers a text to Charlie whose interjection prevents the kiss. David nods amiably and gives Elise a long kiss on the cheek and a relieved Richardson bows his head as she nods smiling radiantly. Later by the Brooklyn Bridge David exits a Town Car and shakes many hands then takes the podium before a crowd of hundreds. The gathering overlooks the East River and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake. David peers across the river to Pier 17. In a quaint eclectic apartment Elise puts on a hoodie and picks up her cell reading a text message that rehearsal is back at Cedar Lake not Pier 17. David's senate race gathering wraps up and he spies Richardson in a window. Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts. David stares at the now empty window. A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier. David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse. Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal. With a determined gaze David jogs off the pier as Richardson and his aide observe. The officers follow David in the map book and David rounds a corner coming face to face with the two officers."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot. She stops grins squirms takes a breath and eyes him. Meanwhile a man runs down a corridor it is the boyish officer. He opens a door marked Mr Richardson and finds the veteran officer at his desk. The messenger shows a map book and the officer grabs his brown fedora. In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door. They arrive in a cafe coroom and see David and Elise. David's senate race gathering wraps up and he spies Richardson in a window. Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts. David stares at the now empty window. A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier. David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse. Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal. With a determined gaze David jogs off the pier as Richardson and his aide observe. The officers follow David in the map book and David rounds a corner coming face to face with the two officers."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot. She stops grins squirms takes a breath and eyes him. Meanwhile a man runs down a corridor it is the boyish officer. Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal. With a determined gaze David jogs off the pier as Richardson and his aide observe. The officers follow David in the map book and David rounds a corner coming face to face with the two officers."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Dodging the lamppost, Francesca hops up a staircase and overtakes Leonard as he navigates another staircase via unicycle. He halts, gestures, bounces, inhales, and spies her. Nearby, a woman jumps up a ladder; it's the youthful professor. She shuts a window labeled Mrs. Thompson and greets the novice professor at her easel. The courier presents an atlas, and the professor snatches her yellow umbrella. In the tunnel, she crosses paths with Mikey, who lifts his scarf, and the youthful professor, now clutching her own scarf, shadows Thompson through a window. They enter a park atrium and spot Francesca and Leonard. The youthful professor consults her atlas, and a gardener ushers them in. Her atlas displays glowing green triangles. Indoors, Francesca scans upward, and at their fireside booth, Leonard cheerfully nudges her and peers at Francesca. The professors occupy a booth as Francesca observes quietly while a barista tops off her teacup. Thompson and her assistant meander down a stairwell to a ledge overlooking the cozy seating area, where the assistant studies her atlas, and a green turning point glows brighter. Kim and a fourth professor arrive, and Kim clears the invoice. Leonard winks at Francesca, while Thompson and her assistant watch closely. As Leonard and Francesca prepare to hug, Thompson activates a signal to Kim, whose remark interrupts the hug. Francesca shrugs playfully and plants a brief peck on Leonard's forehead, and a contented Thompson closes her eyes as he shrugs, grinning widely. Sometime later, near the Golden Gate Bridge, Francesca steps out of a limousine and waves at several faces, then climbs the stage facing a crowd of thousands. The audience faces the Hudson River, and Thompson's assistant receives an alert that practice has been transferred forward to Crystal Lake. Francesca gazes over to Dock 29. In a charming rustic loft, Leonard dons a jacket and lifts his tablet, seeing a message that practice is forward to Crystal Lake, not Dock 29. Francesca's gubernatorial event concludes, and she spots Thompson in a balcony. Both Correction professors slip into shadows, and Francesca scowls at the Dock 29 buildings across the river while Thompson sulks. Francesca gawks at the now vacant balcony. A massive ferry glides along the river, and Francesca stands aboard it as the captain maneuvers it to the dock. Francesca dashes onto the gangway and up some ladders, chasing a glassed pathway beside a commercially updated barn. Reaching a gallery door padlocked, she sends a text on her tablet, but her device displays no service, message undelivered, searching for network. With purposeful intent, Francesca sprints off the dock as Thompson and her assistant observe. The professors track Francesca in the atlas, and Francesca veers into an alley, confronting the two professors."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David chases Elise down the street until she stops and looks at him. Meanwhile, a boyish officer informs a veteran officer, Richardson, and they follow David and Elise to a café. The officers use a map book with pulsing red dots to track them. As David and Elise lean in to kiss, Richardson sends a text to prevent it. David instead kisses Elise on the cheek, relieving Richardson. Later, David exits a Town Car near the Brooklyn Bridge and addresses a large crowd, while Richardson's aide receives a text about a rehearsal change. Elise gets the same message at her apartment. After David's event, he spots Richardson and another officer but they disappear. David takes a water taxi to Pier 17, where he finds a locked studio door and can't make a call due to signal issues. Determined, he leaves the pier as Richardson and his aide watch, tracking him via the map book. David encounters the officers after rounding a corner."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The officers follow David in the map book and David rounds a corner coming face to face with the two officers With a determined gaze David jogs off the pier as Richardson and his aide observe Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier David stares at the now empty window Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts David's senate race gathering wraps up and he spies Richardson in a window In a quaint eclectic apartment Elise puts on a hoodie and picks up her cell reading a text message that rehearsal is back at Cedar Lake not Pier 17 David peers across the river to Pier 17 The gathering overlooks the East River and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake Later by the Brooklyn Bridge David exits a Town Car and shakes many hands then takes the podium before a crowd of hundreds David nods amiably and gives Elise a long kiss on the cheek and a relieved Richardson bows his head as she nods smiling radiantly As David and Elise go to kiss Richardson triggers a text to Charlie whose interjection prevents the kiss Elise grins at David while Richardson and his aide look on Charlie and a third officer arrive and Charlie pays the check Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area where the aide checks his map book and a red inflection point pulses larger The officers share a table as David glances around while a server fills his water glass Elise smiles to herself and peeks at David Outside David glances aside and at their outdoor table His book shows pulsing red dots The boyish officer checks his map book and a host seats them They arrive in a cafe coroom and see David and Elise In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door The messenger shows a map book and the officer grabs his brown fedora He opens a door marked Mr Richardson and finds the veteran officer at his desk Meanwhile a man runs down a corridor it is the boyish officer She stops grins squirms takes a breath and eyes him Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She stops grins squirms takes a breath and eyes him Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot He opens a door marked Mr Richardson and finds the veteran officer at his desk Meanwhile a man runs down a corridor it is the boyish officer In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door The messenger shows a map book and the officer grabs his brown fedora The boyish officer checks his map book and a host seats them They arrive in a cafe coroom and see David and Elise Outside David glances aside and at their outdoor table His book shows pulsing red dots The officers share a table as David glances around while a server fills his water glass Elise smiles to herself and peeks at David Charlie and a third officer arrive and Charlie pays the check Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area where the aide checks his map book and a red inflection point pulses larger As David and Elise go to kiss Richardson triggers a text to Charlie whose interjection prevents the kiss Elise grins at David while Richardson and his aide look on Later by the Brooklyn Bridge David exits a Town Car and shakes many hands then takes the podium before a crowd of hundreds David nods amiably and gives Elise a long kiss on the cheek and a relieved Richardson bows his head as she nods smiling radiantly David peers across the river to Pier 17 The gathering overlooks the East River and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake David's senate race gathering wraps up and he spies Richardson in a window In a quaint eclectic apartment Elise puts on a hoodie and picks up her cell reading a text message that rehearsal is back at Cedar Lake not Pier 17 David stares at the now empty window Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier With a determined gaze David jogs off the pier as Richardson and his aide observe Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal The officers follow David in the map book and David rounds a corner coming face to face with the two officers"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As David and Elise go to kiss Richardson triggers a text to Charlie whose interjection prevents the kiss David nods amiably and gives Elise a long kiss on the cheek and a relieved Richardson bows his head as she nods smiling radiantly Later by the Brooklyn Bridge David exits a Town Car and shakes many hands then takes the podium before a crowd of hundreds The gathering overlooks the East River and Richardson's aide gets a text that the rehearsal has been moved back to Cedar Lake David peers across the river to Pier 17 In a quaint eclectic apartment Elise puts on a hoodie and picks up her cell reading a text message that rehearsal is back at Cedar Lake not Pier 17 David's senate race gathering wraps up and he spies Richardson in a window Both Adjustment officers duck out of sight and David frowns at the Pier 17 structures across the river while Richardson pouts David stares at the now empty window A large water taxi crosses the river and David rides aboard it as the skipper pilots it to the pier David hurries onto the platform and up some stairs following a covered walkway alongside a commercially refurbished warehouse Finding a studio door chainlocked he makes a call on his cell but his phone reads disconnected call failed searching for signal With a determined gaze David jogs off the pier as Richardson and his aide observe The officers follow David in the map book and David rounds a corner coming face to face with the two officers Turning the corner David runs down another street and catches up to Elise as she makes another turn on foot She stops grins squirms takes a breath and eyes him Meanwhile a man runs down a corridor it is the boyish officer He opens a door marked Mr Richardson and finds the veteran officer at his desk The messenger shows a map book and the officer grabs his brown fedora In the hall he passes Harry who doffs his hat and the boyish officer now sporting his own hat follows Richardson through a door They arrive in a cafe coroom and see David and Elise The boyish officer checks his map book and a host seats them His book shows pulsing red dots Outside David glances aside and at their outdoor table Elise smiles to herself and peeks at David The officers share a table as David glances around while a server fills his water glass Richardson and his aide follow a walkway to a spot overlooking the outdoor dining area where the aide checks his map book and a red inflection point pulses larger Charlie and a third officer arrive and Charlie pays the check Elise grins at David while Richardson and his aide look on"
        }
      ]
    }
  ]
}