{
  "ground_truth": "David walks on, and they accompany him. David eyes the boyish officer who promptly closes his map book, and under David’s unwavering gaze, Richardson frowns a little. David crosses the street to a bistro, while the boyish aide checks his book. The Adjustment officers watch David stride briskly outside. Now, David stands by the curb and hails an approaching cab, but its roof light switches to off duty as it drives by. David tries again, but a mini-van taxi ignores him. David jogs out into the opposite lane, waving high for another cab that passes him up. Richardson and his aide stand casually by as David jogs away, and they swap a thoughtful look. In his dress shoes, David sprints after a cab, and as the cabbie waves and slows, a sedan crashes into his passenger side. David runs over to the damaged cars, glances to the sedan driver who checks the bloody-faced cabbie, and then checks on the other driver. David makes a call and goes to another cop, but the rebuffed cop looks to Richardson, then walks away. They both look aside, but find no one. David strides off, leaving an ambulance and a squad car behind. He checks his watch, takes a few more brisk steps, then breaks into a run. A taxi stops, and as they near a traffic light, it changes from green to red, and the surrounding cars stop. A man and a woman in the crosswalk scurry out of their way. David sees Richardson and his aide emerge from a door, and the taxi leaves the Adjustment Bureau servants behind. In a pub, the officers detour through a side door which ports them to a street, and the hostess hurries after them, but finds only a coat closet. The Bureau officers try a residential door, but find Central Park on the other side. They race up the steps of a townhouse, and as David's cab cruises through another intersection, the Bureau officers run through an art gallery, bumping a bystander. Heading outside, they see David exit the cab and enter a building. Richardson's hat blows off, and as Richardson enters, David opens a door and sees Elise executing a graceful sidestep. Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone. As Richardson walks off, David's gaze returns to Elise, who partners with a man holding her waist in one hand. Elise balances on one foot, bends over, and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge, Elise rolls fluidly over his back. David enters the studio, and outside, Richardson walks beside a marble facade, pulls open a brass lobby door, and disappears into a midcentury high-rise, its windows' numbers in the hundreds ascending into the sky, story after story after story.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David strolls on, and they escort him. David observes the youthful officer who promptly shuts his chart book, and under David’s unwavering stare, Richardson scowls a bit. David traverses the avenue to a café, while the youthful aide checks his book. The Adjustment officers watch David stride briskly outside. Now, David stands by the edge and signals an approaching taxi, but its roof light switches to unavailable as it drives by. David attempts again, but a mini-van cab disregards him. David jogs out into the opposite lane, waving high for another cab that bypasses him. Richardson and his aide stand casually by as David jogs away, and they exchange a thoughtful glance. In his dress shoes, David dashes after a cab, and as the cabbie waves and slows, a sedan collides into his passenger side. David runs over to the damaged vehicles, glances at the sedan driver who checks the bloody-faced cabbie, and then checks on the other driver. David makes a call and approaches another officer, but the rejected officer looks to Richardson, then walks away. They both look aside, but find no one. David strides off, leaving an ambulance and a patrol car behind. He checks his watch, takes a few more brisk steps, then breaks into a run. A taxi stops, and as they near a traffic signal, it changes from green to red, and the surrounding cars halt. A man and a woman in the crosswalk hurry out of their way. David sees Richardson and his aide emerge from a door, and the taxi leaves the Adjustment Bureau agents behind. In a tavern, the officers detour through a side door which transports them to a street, and the hostess rushes after them, but finds only a coat closet. The Bureau officers try a residential door, but discover Central Park on the other side. They race up the steps of a townhouse, and as David's cab cruises through another intersection, the Bureau officers dash through an art gallery, bumping a bystander. Heading outside, they see David exit the cab and enter a building. Richardson's hat blows off, and as Richardson enters, David opens a door and sees Elise executing a graceful sidestep. Richardson catches his breath and makes eye contact with David as the youthful aide hands him a cellphone. As Richardson walks off, David's gaze returns to Elise, who partners with a man holding her waist in one hand. Elise steadies on one foot, leans over, and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge, Elise rolls fluidly over his back. David enters the studio, and outside, Richardson walks beside a marble facade, pulls open a brass lobby door, and vanishes into a midcentury high-rise, its windows' numbers in the hundreds ascending into the sky, story after story after story."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "David is walked on by them, and he is accompanied by them. The boyish officer is eyed by David, who promptly closes his map book, and under David's unwavering gaze, a little frown is given by Richardson. The street is crossed by David to a bistro, while his book is checked by the boyish aide. David is watched by the Adjustment officers as he strides briskly outside. Now, the curb is stood by David and an approaching cab is hailed by him, but the roof light switches to off duty by it as it is driven by. Another attempt is made by David, but he is ignored by a mini-van taxi. The opposite lane is jogged into by David, waving high for another cab that passes him up. Richardson and his aide stand casually by as David jogs away, and a thoughtful look is swapped by them. In his dress shoes, a cab is sprinted after by David, and as the cabbie waves and slows, a sedan is crashed into his passenger side. The damaged cars are run over to by David, and a glance is given to the sedan driver who checks the bloody-faced cabbie, and then the other driver is checked on by him. A call is made by David and another cop is approached by him, but Richardson is looked to by the rebuffed cop, then he walks away. They both look aside, but no one is found by them. The ambulance and a squad car are left behind by David as he strides off. His watch is checked, a few more brisk steps are taken by him, then he breaks into a run. A taxi is stopped, and as a traffic light is neared by them, it changes from green to red, and the surrounding cars are stopped. A man and a woman in the crosswalk scurry out of the way. Richardson and his aide are seen by David as they emerge from a door, and the Adjustment Bureau servants are left behind by the taxi. In a pub, a side door is detoured through by the officers which ports them to a street, and the hostess hurries after them, but only a coat closet is found. A residential door is tried by the Bureau officers, but Central Park is found on the other side. The steps of a townhouse are raced up by them, and as another intersection is cruised through by David's cab, they run through an art gallery, bumping a bystander. Outside is headed by them, and David is seen exiting the cab and entering a building. Richardson's hat blows off, and as Richardson enters, a door is opened by David and Elise is seen executing a graceful sidestep. Richardson catches his breath and David is made eye contact with as the boyish aide hands him a cellphone. As he walks off, David returns his gaze to Elise, who is partnered with a man holding her waist in one hand. She balances on one foot, bends over, and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge, she rolls fluidly over his back. The studio is entered by David, and outside, Richardson walks beside a marble facade, a brass lobby door is pulled open by him, and he disappears into a midcentury high-rise, its windows' numbers ascending into the sky, story after story after story."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David proceeds, accompanied by others, and notices a boyish officer closing his map book as Richardson frowns under David’s gaze. David crosses to a bistro; the aide checks his book. The Adjustment officers watch David briskly stride outside. David stands by the curb, hailing a cab, but its light turns off, ignoring him. Attempting again, a mini-van taxi bypasses him. David jogs into the opposite lane, waving at another cab that also ignores him. Richardson and his aide exchange a thoughtful look as David sprints after a cab. The cab stops, but a sedan crashes into its side. David rushes to the scene, sees the cabbie with a bloody face, checks on both drivers, calls for help, and approaches another cop who, glancing at Richardson, walks away. David leaves behind an ambulance and squad car, glances at his watch, and begins running. A taxi stops, and near a traffic light that turns from green to red, surrounding cars halt. A man and woman scurry in the crosswalk as Richardson and his aide appear, left behind by David's taxi. In a pub, officers use a side door leading to a street, and a hostess finds only a coat closet. They try a residential door, entering Central Park. Racing up townhouse steps, they run through an art gallery, bumping a bystander. Outside, they spot David exiting a cab and entering a building. Richardson's hat blows off as he enters a door where David sees Elise sidestep gracefully. Richardson catches his breath, the aide hands him a cellphone, and he moves off. David looks at Elise, partnered with a man, balancing, bending, and fluttering her foot. As the dancer lunges, Elise rolls over his back. David enters the studio, while outside, Richardson walks by a marble facade, opens a brass door, and vanishes into a high-rise with ascending numbers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David walks on with them, eyeing the boyish officer who closes his map book as Richardson frowns. David goes to a bistro, while the aide checks his book. The Adjustment officers watch David swiftly outside. David hails a cab, but it declines. Another cab ignores him, and he jogs into the lane, waving for a passing cab. Richardson and his aide exchange a look as David jogs away. In dress shoes, David sprints after a cab, but a sedan crashes into it. David checks on the drivers, calls, and approaches a cop who, after conferring with Richardson, dismisses him. David leaves an ambulance and squad car, checks his watch, and runs. A taxi stops, and cars halt at a red light. A couple scurries past. David sees Richardson and the aide emerge; the taxi leaves them behind. In a pub, the officers find a coat closet. Trying another door, they find Central Park. They race up townhouse steps as David’s cab crosses an intersection. The officers run through an art gallery, bumping someone. Outside, David exits the cab and enters a building. Richardson enters as David sees Elise sidestep gracefully. Richardson, handed a cellphone by the aide, walks off. David focuses on Elise balancing on one foot before fluidly rolling over a dancer's back. David enters the studio, while Richardson disappears into a high-rise, its windows numbered into the sky."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David continues on his path, and his companions follow along with him. As David scrutinizes the youthful officer, the latter promptly closes his map book, and under the unyielding scrutiny of David’s gaze, Richardson frowns slightly. David crosses the street to make his way toward a nearby bistro, while the youthful aide takes another look into his book. The Adjustment Bureau officers observe as David strides briskly outside. Now, standing by the curb, David attempts to hail a coming cab, but the vehicle’s roof light switches to \"off duty\" as it passes by. Undeterred, David tries again, but this time a mini-van taxi also disregards his gesture. He jogs into the lane opposite his current position, raising his arm high in a wave, yet another cab passes him without stopping. Meanwhile, Richardson and his aide stand with a nonchalant air as David jogs away, sharing a thoughtful exchange of looks. In his polished dress shoes, David sprints after one of the cabs, and just as the cabbie waves and begins to slow down, a sedan crashes into the side where the passengers would sit. David quickly runs over to the cars involved in the collision, casting a glance at the sedan driver who is now checking on the cabbie, whose face is marked with blood, before turning his attention to the other driver. David proceeds to make a phone call and approaches another police officer, but this officer, after being approached, looks back to Richardson and then turns away, choosing to walk off. Both Richardson and his aide look around them, finding no one in particular. David strides away with determination, leaving behind an ambulance and a squad car at the chaotic scene. Checking his watch, he takes a few more brisk steps before breaking into a full run. A waiting taxi finally comes to a stop for him, and as they near a traffic light, it changes suddenly from green to red, causing the cars around them to come to a halt. A man and a woman in the crosswalk hurry out of their path. David notices Richardson and his aide emerging from a doorway, but the taxi speeds away, leaving the Adjustment Bureau officers behind in the dust. Inside a pub, the officers take a detour through a side door that unexpectedly transports them to a different street entirely, and a hostess chases after them, only to find herself facing a coat closet. The Bureau officers attempt to go through a residential door, only to find Central Park sprawling on the other side. They race up the steps of a nearby townhouse, and as David's taxi cruises through yet another intersection, the Bureau officers dash through an art gallery, colliding with a bystander in their haste. Once outside again, they spot David exiting the cab and entering a building. Richardson’s hat is blown off by the wind, and as he makes his entrance, David opens another door to find Elise, who is executing an elegant sidestep. Richardson catches his breath and meets David's eyes as the youthful aide hands him a cellphone. As Richardson walks away, David's gaze returns to Elise, who is partnered with a man holding her waist in one hand. Elise balances gracefully on one foot, bends over with poise, and briefly lifts her other foot high behind her. As the male dancer performs a deep, stepping lunge, Elise rolls fluidly over his back. David steps into the studio, while outside, Richardson walks beside a stately marble facade, pulling open a brass lobby door and vanishing into a midcentury high-rise, its numbered windows ascending, floor after floor, reaching up toward the sky."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David continues along his chosen path, and his companions dutifully follow along with him. As David scrutinizes the youthful officer with a focused intensity, the officer promptly closes his map book, and under the unwavering and penetrating scrutiny of David’s gaze, Richardson frowns slightly, as if in response to some unspoken challenge. David then crosses the street with purpose to make his way toward a nearby bistro, while the youthful aide takes another cursory look into his book. The Adjustment Bureau officers observe intently as David strides briskly outside, exuding a confident air. Now, standing by the edge of the curb, David attempts to hail a coming cab, but frustratingly, the vehicle’s roof light switches to \"off duty\" as it passes by, ignoring him. Undeterred by this setback, David tries again, but this time a mini-van taxi also disregards his hopeful gesture. He jogs into the lane opposite his current position, raising his arm high in a wave, yet another cab passes him without stopping or acknowledging his presence. Meanwhile, Richardson and his aide maintain a nonchalant demeanor as they stand watching David jog away, sharing a thoughtful, knowing exchange of looks. In his polished dress shoes, David sprints after one of the cabs, and just as the cabbie waves and begins to slow down, a sedan unexpectedly crashes into the side where the passengers would sit. David quickly runs over to the cars involved in the collision, casting a glance at the sedan driver who is now checking on the cabbie, whose face is visibly marked with blood, before David turns his attention to the other driver involved in the mishap. David proceeds to make a crucial phone call and approaches another police officer nearby, but this officer, after being approached, looks back to Richardson and then pointedly turns away, choosing instead to walk off, ignoring David’s attempt to engage. Both Richardson and his aide look around them, finding no one in particular of interest or concern. David strides away with determination and urgency, leaving behind the unfolding chaotic scene with an ambulance and a squad car at the ready. Checking his watch with a sense of time pressing upon him, he takes a few more brisk steps before breaking into a full, determined run. A waiting taxi finally comes to a stop for him, and as they near a traffic light, it changes suddenly from green to red, causing all the surrounding cars to come to a sudden halt. A man and a woman in the crosswalk hurry out of their path with quickened steps. David notices Richardson and his aide emerging from a nearby doorway, but the taxi speeds away, leaving the Adjustment Bureau officers behind in the dust. Inside a pub, the officers take an unexpected detour through a side door that surprisingly transports them to a different street entirely, and a hostess chases after them, only to find herself bewildered and facing a coat closet instead of the bustling street. The Bureau officers attempt to go through a residential door, only to find themselves in Central Park sprawling on the other side. They race up the steps of a nearby townhouse with urgency, and as David's taxi cruises through yet another intersection, the Bureau officers dash through an art gallery, colliding with an unsuspecting bystander in their haste to catch up. Once outside again, they spot David exiting the cab and entering a building with purpose. Richardson’s hat is caught by a gust of wind and blown off, and as he makes his entrance into the building, David opens another door to find Elise, who is executing an elegant sidestep with grace. Richardson catches his breath upon entering and meets David's eyes as the youthful aide, with a sense of importance, hands him a cellphone. As Richardson walks away with a sense of focus, David's gaze returns to Elise, who is partnered with a man holding her waist securely in one hand. Elise balances gracefully on one foot, bends over with poise and control, and briefly lifts her other foot high behind her in a display of fluid movement. As the male dancer performs a deep, stepping lunge, Elise rolls fluidly over his back with effortless elegance. David steps into the studio, observing the scene, while outside, Richardson walks beside a stately, impressive marble facade, pulling open a brass-accented lobby door and vanishing into a midcentury high-rise, its numbered windows ascending, floor after floor, reaching up toward the expansive sky above."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David continues walking along the street, while those accompanying him match his pace, their footsteps resonating in unison with his. His gaze lands on a boyish officer, prompting the officer to hurriedly close his map book, the subtle snap of the cover breaking the air. Under the intensity of David’s unyielding stare, Officer Richardson allows a faint frown to creases his features. Observing his surroundings with sharp precision, David decides to cross the street, making his way towards a quaint bistro, while simultaneously, the boyish aide meticulously scans his book as if searching for hidden answers. The Adjustment officers, their eyes trained on David, watch him as he briskly navigates the exterior world. Arriving at the curb, David turns his attention skyward, raising his arm to hail an oncoming cab. Just as it nears, its roof light flickers, cruelly switching to off duty, and it speeds past, leaving David momentarily stranded. Undeterred, David tries once more, but a mini-van taxi ignores his plea, accelerating away without a backward glance. Refusing to accept defeat, David jogs out into the opposite lane, frantically waving his hand high above his head in hopes of attracting another cab, but it too bypasses him, indifferent to his urgency. Richardson and his aide, standing nonchalantly to the side, exchange a contemplative glance as David jogs away, their expressions a silent commentary on his futile efforts. Undaunted, David, now in his dress shoes which were not designed for such endeavors, breaks into a sprint, chasing after yet another cab. As his extended hand catches the cabbie’s attention, the driver acknowledges him with a wave, slowing down to accommodate him, when suddenly, a sedan collides violently into the cab’s passenger side, the sound reverberating through the street. David, witnessing the crash, races over to the scene, his concern split between the sedan driver, who is attending to the bloodied cabbie, and the other driver, assessing their conditions with a quick but caring glance. With urgency, David pulls out his phone to make a critical call, then approaches another police officer for assistance. However, this cop, upon noticing Richardson, swiftly dismisses David’s request and turns away, leaving David with no option but to watch him retreat. In a moment of frustration and desperation, David scans the vicinity, finding no allies among the indifferent passersby. Resolute, he strides away from the scene, an ambulance and squad car now fading into the distance behind him, their flashing lights a diminishing beacon of the chaos left in his wake. Checking his watch for precious lost time, David takes a few purposeful steps forward before breaking into a determined run once more. A taxi, responding to his urgency, halts his flight as David gratefully climbs in. As they approach a traffic light, it shifts from green to red, bringing surrounding vehicles to a halt, while a couple in the crosswalk quickens their pace to clear the road. David spots Richardson and his aide emerging through a doorway, their presence a looming reminder of the pursuit, but the taxi, unrelenting, speeds away from the Adjustment Bureau servants, leaving them behind. In a sudden shift of scene, the officers veer through a pub’s side door, intending to make their exit through what they expect to be another path, only for the hostess to chase after them in confusion, arriving at a coat closet instead of the anticipated exit. Undeterred, the Bureau officers attempt a residential door next, only to find themselves at the entry of Central Park, its path stretching before them in unexpected greenery. Racing up the steps of a nearby townhouse, they pursue their target with relentless vigor. Meanwhile, as David’s cab smoothly navigates through another intersection, the Bureau officers charge through an art gallery, their haste causing them to collide with a bystander, though their focus remains unbroken. Emerging into the open air, they catch sight of David exiting the cab and slipping into a building before they give chase. The wind conspires against Richardson, snatching his hat from his head as he enters, while David opens a door and glimpses Elise executing an elegant sidestep, her form poised and agile. Richardson, catching his breath from the relentless pursuit, locks eyes with David momentarily, as the boyish aide steps forward to hand Richardson a cellphone. With a nod of understanding, Richardson turns and walks off, leaving David to refocus his attention on Elise, who partners with a man, their chemistry palpable as he holds her waist with one gentle hand. Elise, balancing delicately on one foot, gracefully bends over, allowing her other foot to flutter momentarily in the air behind her. As her male dance partner performs a deep stepping lunge, Elise rolls over his back with seamless fluidity, her movements a captivating dance of trust and artistry. Stepping into the studio, David absorbs the scene unfolding before him, while outside, Richardson strides confidently beside a marble facade, pulling open the brass door of a midcentury high-rise, slipping away into the towering structure where the windows’ numbers ascend indefinitely into the sky, each story stacked upon the last, reaching ever upwards."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David walks on, with the officers following him. He notices the boyish officer who closes his map book under David’s unwavering gaze, causing Richardson to frown slightly. David crosses the street to a bistro while the aide checks his book, and the officers watch as David briskly moves outside. Attempting to hail a cab, David is ignored multiple times, prompting him to jog into the opposite lane where he sprints after another cab. As it slows for him, a sedan crashes into its passenger side. David assesses the situation at the crash site, checks on the drivers, makes a call, and approaches another cop who, after a glance at Richardson, walks away. Leaving the scene with an ambulance and a squad car behind, David checks his watch, picks up his pace into a run, and manages to catch a taxi. \n\nAs they approach a traffic light, it turns red, causing surrounding cars to stop and forcing pedestrians to hurry out of their path. David notices Richardson and his aide emerging from a door, but the taxi leaves them behind. In a pub, the officers detour through a side door that leads them to another street. A hostess follows but only finds a coat closet. The officers try another door, opening it to Central Park on the other side, and race through various locations to catch up with David, who exits his cab and enters a building. Richardson's hat blows off as he enters, and David spots Elise performing a dance move. \n\nAs Richardson catches his breath and receives a cellphone from his aide, he makes eye contact with David. David's focus shifts back to Elise, who is dancing with a partner. She balances gracefully and executes fluid movements with her partner. David enters the studio, while outside, Richardson moves beside a marble facade, enters a high-rise building, and disappears as the windows' numbers ascend story after story."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David walks on through the bustling city, and they accompany him. David eyes the boyish officer who promptly closes his map book, an essential tool for navigating the city's complex streets, and under David’s unwavering gaze, Richardson frowns a little, unsure of David's intentions. David crosses the street to a bistro known for its artisanal coffee and fresh pastries, while the boyish aide checks his book. The Adjustment officers, members of a mysterious organization controlling fate, watch David stride briskly outside. Now, David stands by the curb and hails an approaching cab, its yellow paint a familiar sight in New York City, but its roof light switches to off duty as it drives by. David tries again, but a mini-van taxi, often used for group rides, ignores him. David jogs out into the opposite lane, waving high for another cab that passes him up in the constant urban rush. Richardson and his aide stand casually by as David jogs away, and they swap a thoughtful look, reflecting on the curious turn of events. In his dress shoes, David sprints after a cab, and as the cabbie, accustomed to the competitive city streets, waves and slows, a sedan crashes into his passenger side. David runs over to the damaged cars, glances to the sedan driver who checks the bloody-faced cabbie, involved in a common but chaotic city accident, and then checks on the other driver. David makes a call, his voice urgent and insistent, and goes to another cop, but the rebuffed cop looks to Richardson, then walks away, clearly under some influence. They both look aside, but find no one, sensing an invisible presence. David strides off, leaving an ambulance and a squad car behind, the scene now swarming with emergency services. He checks his watch, a gift from his father, takes a few more brisk steps, then breaks into a run. A taxi stops, and as they near a traffic light, it changes from green to red, and the surrounding cars, part of the never-ending city traffic, stop. A man and a woman in the crosswalk scurry out of their way, aware of the taxi's urgent pace. David sees Richardson and his aide emerge from a door, an unnoticed portal within the city, and the taxi leaves the Adjustment Bureau servants behind. In a pub, the officers detour through a side door which ports them to a street, an unusual shortcut that defies normal geography, and the hostess hurries after them, but finds only a coat closet. The Bureau officers try a residential door, opening into Central Park's vast greenery on the other side. They race up the steps of a townhouse, and as David's cab cruises through another intersection, the Bureau officers run through an art gallery, bumping a bystander admiring contemporary pieces. Heading outside, they see David exit the cab and enter a building. Richardson's hat, a symbol of his authority, blows off, and as Richardson enters, David opens a door and sees Elise executing a graceful sidestep, her dance training evident in her fluid movements. Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone, a device connected to the Bureau's intricate network. As Richardson walks off, David's gaze returns to Elise, who partners with a man holding her waist in one hand, the two dancers moving in harmony. Elise balances on one foot, bends over, and briefly flutters her other foot high behind her, showcasing a classic ballet move. As the male dancer dips in a far stepping lunge, Elise rolls fluidly over his back, their practiced routine mesmerizing. David enters the studio, drawn by Elise's presence, and outside, Richardson walks beside a marble facade, pulls open a brass lobby door, and disappears into a midcentury high-rise, its windows' numbers in the hundreds ascending into the sky, story after story after story, the building a testament to the city's towering ambition."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "David walks on and they accompany him. David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little. David crosses the street to a bistro while the boyish aide checks his book. The Adjustment officers watch David stride briskly outside. Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by. David tries again but a minivan taxi ignores him. David jogs out into the opposite lane waving high for another cab that passes him up. Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look. In his dress shoes David sprints after a cab and as the cabbie waves and slows a sedan crashes into his passenger side. David runs over to the damaged cars glances to the sedan driver who checks the bloodyfaced cabbie and then checks on the other driver. David makes a call and goes to another cop but the rebuffed cop looks to Richardson then walks away. They both look aside but find no one. David strides off leaving an ambulance and a squad car behind. He checks his watch takes a few more brisk steps then breaks into a run. A taxi stops and as they near a traffic light it changes from green to red and the surrounding cars stop. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. A man and a woman in the crosswalk scurry out of their way. David sees Richardson and his aide emerge from a door and the taxi leaves the Adjustment Bureau servants behind. In a pub the officers detour through a side door which ports them to a street and the hostess hurries after them but finds only a coat closet. The Bureau officers try a residential door but find Central Park on the other side. They race up the steps of a townhouse and as David's cab cruises through another intersection the Bureau officers run through an art gallery bumping a bystander. Heading outside they see David exit the cab and enter a building. Richardson's hat blows off and as Richardson enters David opens a door and sees Elise executing a graceful sidestep. Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone. As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand. Elise balances on one foot bends over and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back. David enters the studio. and outside. Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky. story after story after story."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "David walks on and they accompany him. David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little. David crosses the street to a bistro while the boyish aide checks his book. The Adjustment officers watch David stride briskly outside. Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by. David tries again but a minivan taxi ignores him. David jogs out into the opposite lane waving high for another cab that passes him up. Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look. In his dress shoes David sprints after a cab and as the cabbie waves and slows a sedan crashes into his passenger side. David runs over to the damaged cars glances to the sedan driver who checks the bloodyfaced cabbie and then checks on the other driver. David makes a call and goes to another cop but the rebuffed cop looks to Richardson then walks away. They both look aside but find no one. David strides off leaving an ambulance and a squad car behind. He checks his watch takes a few more brisk steps then breaks into a run. A taxi stops and as they near a traffic light it changes from green to red and the surrounding cars stop. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. A man and a woman in the crosswalk scurry out of their way. David sees Richardson and his aide emerge from a door and the taxi leaves the Adjustment Bureau servants behind. In a pub the officers detour through a side door which ports them to a street and the hostess hurries after them but finds only a coat closet. The Bureau officers try a residential door but find Central Park on the other side. They race up the steps of a townhouse and as David's cab cruises through another intersection the Bureau officers run through an art gallery bumping a bystander. Heading outside they see David exit the cab and enter a building. Richardson's hat blows off and as Richardson enters David opens a door and sees Elise executing a graceful sidestep. Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone. As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand. Elise balances on one foot bends over and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back. David enters the studio. and outside. Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky. story after story after story."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "David walks on and they accompany him. David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little. David crosses the street to a bistro while the boyish aide checks his book. The Adjustment officers watch David stride briskly outside. Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by. David tries again but a minivan taxi ignores him. David jogs out into the opposite lane waving high for another cab that passes him up. Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look. As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand. Elise balances on one foot bends over and briefly flutters her other foot high behind her. As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back. David enters the studio. and outside. Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky. story after story after story."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "David walks on and they accompany him. David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little. David crosses the street to a bistro while the boyish aide checks his book. and outside. Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky. story after story after story."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barry skips along, and the birds join him. Barry notices the elderly librarian who promptly closes his sketchbook, and under Barry’s unwavering gaze, Thompson smiles a bit. Barry crosses the bridge to a bakery, while the elderly assistant checks his sketchpad. The Observation gardeners watch Barry skip leisurely inside. Now, Barry stands by the fountain and waves to a departing boat, but its sail switches to catch wind as it sails away. Barry attempts again, but a bicycle courier ignores him. Barry darts into the nearby field, waving widely for another boat that glides past him. Thompson and his assistant stand thoughtfully by as Barry darts away, and they exchange an amused look. In his sandals, Barry dashes after a carriage, and as the coachman waves and hesitates, a cart crashes into its wheel. Barry rushes over to the damaged vehicles, glances to the cart driver who checks the dazed coachman, and then checks on the other rider. Barry sends a letter and approaches another ranger, but the indifferent ranger looks to Thompson, then strolls away. They both look aside, but find nothing. Barry skips off, leaving a fire truck and a patrol car behind. He checks his sundial, takes a few more tranquil paces, then bursts into a sprint. A rickshaw stops, and as they near an oak tree, it changes from red to yellow, and the surrounding pedestrians pause. A juggler and a mime in the crosswalk hurry out of their path. Barry spots Thompson and his assistant appear from a portal, and the rickshaw leaves the Observation Guild gardeners behind. In a tea house, the gardeners detour through a trapdoor which leads them to a meadow, and the bartender scurries after them, but finds only a broom closet. The Guild gardeners try a mansion door, but find Hyde Park on the other side. They race up the slope of a hilltop, and as Barry's rickshaw coasts through another meadow, the Guild gardeners dart through a museum, brushing a tourist. Heading outdoors, they see Barry disembark the rickshaw and enter an auditorium. Thompson's scarf blows away, and as Thompson steps inside, Barry opens a curtain and sees Nora performing a graceful spin. Thompson catches his breath and makes eye contact with Barry as the elderly assistant hands him a radio. As Thompson strolls off, Barry’s attention returns to Nora, who waltzes with a gentleman holding her hand in one arm. Nora balances on one toe, leans forward, and briefly stretches her other leg high behind her. As the male dancer bends in a low-moving arc, Nora rolls fluidly over his shoulder. Barry enters the theater, and outside, Thompson walks beside a granite statue, pushes open an iron gate, and vanishes into a modern skyscraper, its rooms' numbers in the thousands reaching into the heavens, layer after layer after layer."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David and the Adjustment Bureau officers engage in a tense sequence as David attempts to hail a cab, repeatedly ignored by passing taxis. The officers observe him, exchanging thoughtful looks. David chases down a cab, which is hit by a sedan. After checking on the involved drivers, David is dismissed by a cop who acknowledges Richardson before leaving. As David hurries away, an ambulance and squad car arrive. He catches a taxi, but as it stops at a red light, he notices Richardson and the aide emerging from a door. The Bureau officers use a pub's side door to access different locations, eventually finding Central Park. They continue their pursuit through a townhouse and art gallery, trying to catch David as he enters a building where Elise dances gracefully with a partner. Richardson makes eye contact with David before walking off. As David focuses on Elise, Richardson disappears into a midcentury high-rise."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "story after story after story Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky and outside David enters the studio As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back Elise balances on one foot bends over and briefly flutters her other foot high behind her As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone Richardson's hat blows off and as Richardson enters David opens a door and sees Elise executing a graceful sidestep Heading outside they see David exit the cab and enter a building They race up the steps of a townhouse and as David's cab cruises through another intersection the Bureau officers run through an art gallery bumping a bystander The Bureau officers try a residential door but find Central Park on the other side In a pub the officers detour through a side door which ports them to a street and the hostess hurries after them but finds only a coat closet David sees Richardson and his aide emerge from a door and the taxi leaves the Adjustment Bureau servants behind A man and a woman in the crosswalk scurry out of their way A taxi stops and as they near a traffic light it changes from green to red and the surrounding cars stop He checks his watch takes a few more brisk steps then breaks into a run David strides off leaving an ambulance and a squad car behind They both look aside but find no one David makes a call and goes to another cop but the rebuffed cop looks to Richardson then walks away David runs over to the damaged cars glances to the sedan driver who checks the bloodyfaced cabbie and then checks on the other driver In his dress shoes David sprints after a cab and as the cabbie waves and slows a sedan crashes into his passenger side Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look David jogs out into the opposite lane waving high for another cab that passes him up David tries again but a minivan taxi ignores him Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by The Adjustment officers watch David stride briskly outside David crosses the street to a bistro while the boyish aide checks his book David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little David walks on and they accompany him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little David walks on and they accompany him The Adjustment officers watch David stride briskly outside David crosses the street to a bistro while the boyish aide checks his book David tries again but a minivan taxi ignores him Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look David jogs out into the opposite lane waving high for another cab that passes him up David runs over to the damaged cars glances to the sedan driver who checks the bloodyfaced cabbie and then checks on the other driver In his dress shoes David sprints after a cab and as the cabbie waves and slows a sedan crashes into his passenger side They both look aside but find no one David makes a call and goes to another cop but the rebuffed cop looks to Richardson then walks away He checks his watch takes a few more brisk steps then breaks into a run David strides off leaving an ambulance and a squad car behind A man and a woman in the crosswalk scurry out of their way A taxi stops and as they near a traffic light it changes from green to red and the surrounding cars stop In a pub the officers detour through a side door which ports them to a street and the hostess hurries after them but finds only a coat closet David sees Richardson and his aide emerge from a door and the taxi leaves the Adjustment Bureau servants behind They race up the steps of a townhouse and as David's cab cruises through another intersection the Bureau officers run through an art gallery bumping a bystander The Bureau officers try a residential door but find Central Park on the other side Richardson's hat blows off and as Richardson enters David opens a door and sees Elise executing a graceful sidestep Heading outside they see David exit the cab and enter a building As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back Elise balances on one foot bends over and briefly flutters her other foot high behind her and outside David enters the studio story after story after story Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A man and a woman in the crosswalk scurry out of their way David sees Richardson and his aide emerge from a door and the taxi leaves the Adjustment Bureau servants behind In a pub the officers detour through a side door which ports them to a street and the hostess hurries after them but finds only a coat closet The Bureau officers try a residential door but find Central Park on the other side They race up the steps of a townhouse and as David's cab cruises through another intersection the Bureau officers run through an art gallery bumping a bystander Heading outside they see David exit the cab and enter a building Richardson's hat blows off and as Richardson enters David opens a door and sees Elise executing a graceful sidestep Richardson catches his breath and makes eye contact with David as the boyish aide hands him a cellphone As Richardson walks off David's gaze returns to Elise who partners with a man holding her waist in one hand Elise balances on one foot bends over and briefly flutters her other foot high behind her As the male dancer dips in a far stepping lunge Elise rolls fluidly over his back David enters the studio and outside Richardson walks beside a marble facade pulls open a brass lobby door and disappears into a midcentury highrise its windows' numbers in the hundreds ascending into the sky story after story after story David walks on and they accompany him David eyes the boyish officer who promptly closes his map book and under David’s unwavering gaze Richardson frowns a little David crosses the street to a bistro while the boyish aide checks his book The Adjustment officers watch David stride briskly outside Now David stands by the curb and hails an approaching cab but its roof light switches to off duty as it drives by David tries again but a minivan taxi ignores him David jogs out into the opposite lane waving high for another cab that passes him up Richardson and his aide stand casually by as David jogs away and they swap a thoughtful look In his dress shoes David sprints after a cab and as the cabbie waves and slows a sedan crashes into his passenger side David runs over to the damaged cars glances to the sedan driver who checks the bloodyfaced cabbie and then checks on the other driver David makes a call and goes to another cop but the rebuffed cop looks to Richardson then walks away They both look aside but find no one David strides off leaving an ambulance and a squad car behind He checks his watch takes a few more brisk steps then breaks into a run A taxi stops and as they near a traffic light it changes from green to red and the surrounding cars stop"
        }
      ]
    }
  ]
}