{
  "ground_truth": "As he passed his door's room, the old man calls out to him. Grainy footage of him getting zapped. Benjamin stares at doors who looks around thoughtfully. Benjamin walks on up the corridor. He stops outside the door to his room and stands looking pensive. It's dark as Benjamin walks up outside Thomas's house and knocks on the door. A servant walks to the front door, pulling up his braces. The servant opens the door and directs Benjamin up the stairs. Benjamin opens the door of Thomas's room and goes inside. Thomas is asleep in bed. Benjamin gently shakes him. As the very first rays of dawn light creep across the sky, Thomas's car pulls up outside the country house. The chauffeur and Benjamin get out of the car. As Benjamin walks around the vehicle, the chauffeur helps Thomas out of the car. With the sky tinged orange, Benjamin wheels Thomas along in a wheelchair. They come to a halt. The chauffeur waits in the car and pulls his cap over his eyes. In front of the lake house, Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake. He carefully sets Thomas down and lowers him onto a wooden seat. Benjamin pats Thomas on the shoulder and takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as he takes in the view. Thomas closes his eyes and sighs. He and Benjamin are silhouetted against the rising sun. An assortment of buttons is swept off a table into a jar. Thomas lies dead on a table. An undertaker places the jar of buttons on Thomas's stomach. Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest. He holds out his arm. She takes it. The exterior of the majestic theater on Broadway, a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium. On stage, a woman in a headdress is lifted up by two men who exit stage right. Certain beautiful with a long plaited ponytail, Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin, no longer wearing spectacles, takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As he passed his entry's chamber, the aged gentleman calls out to him. Grainy footage of him being zapped. Benjamin gazes at doors who looks around pensively. Benjamin strides on up the passageway. He pauses outside the entry to his chamber and stands looking contemplative. It's dark as Benjamin walks up outside Thomas's dwelling and knocks on the entry. An attendant walks to the front entry, pulling up his suspenders. The attendant opens the entry and directs Benjamin up the stairs. Benjamin opens the entry of Thomas's chamber and goes inside. Thomas is asleep in bed. Benjamin gently shakes him. As the very first rays of dawn light creep across the sky, Thomas's automobile pulls up outside the country residence. The chauffeur and Benjamin get out of the automobile. As Benjamin walks around the vehicle, the chauffeur assists Thomas out of the automobile. With the sky tinged orange, Benjamin wheels Thomas along in a wheelchair. They come to a stop. The chauffeur waits in the automobile and pulls his cap over his eyes. In front of the lake residence, Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a pier which leads out into the waters of the vast lake. He carefully sets Thomas down and lowers him onto a wooden seat. Benjamin pats Thomas on the shoulder and takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as he takes in the panorama. Thomas closes his eyes and exhales. He and Benjamin are silhouetted against the rising sun. An assortment of buttons is swept off a table into a jar. Thomas lies deceased on a table. An undertaker places the jar of buttons on Thomas's abdomen. Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest. He holds out his arm. She takes it. The exterior of the majestic theater on Broadway, a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium. On stage, a woman in a headdress is lifted up by two men who exit stage right. Certain beautiful with a long braided ponytail, Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin, no longer wearing spectacles, takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the old man was passed by him at his door's room, he is called out to by the old man. Grainy footage shows him being zapped. The doors are stared at thoughtfully by Benjamin, who looks around. The corridor is walked up by Benjamin. Outside the door to his room, he stops and stands looking pensive. It's dark as the house of Thomas is walked up to by Benjamin, who knocks on the door. The front door is walked to by a servant, who pulls up his braces. The door is opened by the servant, who directs Benjamin up the stairs. The door of Thomas's room is opened by Benjamin as he goes inside. Thomas sleeps in bed. He is gently shaken by Benjamin. As the very first rays of dawn light creep across the sky, the country house is pulled up to by Thomas's car. The chauffeur and Benjamin get out of the car. As the vehicle is walked around by Benjamin, Thomas is helped out of the car by the chauffeur. With the sky tinged orange, Thomas is wheeled along in a wheelchair by Benjamin. A halt is come to by them. The chauffeur waits in the car and pulls his cap over his eyes. In front of the lake house, Thomas is lifted out of the wheelchair by Benjamin, who carries him over his shoulders down to a jetty that leads out into the waters of the vast lake. Thomas is carefully set down and lowered onto a wooden seat by him. Thomas is patted on the shoulder by Benjamin, who takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as the view is taken in by him. His eyes are closed and a sigh is given by Thomas. He and Benjamin are silhouetted against the rising sun. A jar is swept with an assortment of buttons off a table. Dead on a table lies Thomas. A jar of buttons is placed on Thomas's stomach by an undertaker. He is visited in an open casket by Benjamin and an elderly Queenie as he lies at rest in an ornate chapel. His arm is held out by him. She takes it. The majestic theater on Broadway is shown outside as a yellow cab pulls up to it. A bunch of flowers is clutched by Benjamin as he gets out. The cab driver is paid by him, and the theater is entered by him. The darkened auditorium is stepped into by Benjamin. On stage, a woman in a headdress is lifted up by two men who exit stage right. The stage is taken to by the certain beautiful Daisy with a long plaited ponytail, with her dance partner. As the man raises her aloft like the figurehead of a ship against the painted backdrop of a stormy ocean, Benjamin watches. No longer wearing spectacles, a seat is taken by Benjamin, who stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. Their movements are followed by the shifting spotlights as left and right are pranced."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As he passes his door, the old man calls to him. Grainy footage shows him being zapped. Benjamin stares at doors, looking thoughtful, then walks down the corridor and stops outside his room, appearing pensive. It's dark as he approaches Thomas's house and knocks. A servant, adjusting his braces, opens the door and directs Benjamin upstairs. Benjamin enters Thomas's room and gently wakes him. At dawn, Thomas's car arrives at the country house; the chauffeur and Benjamin get out. Benjamin assists Thomas from the car into a wheelchair and wheels him toward the lake house. The chauffeur waits in the car, cap over his eyes. Benjamin carries Thomas to a jetty and sets him on a wooden seat. He pats Thomas and sits behind him as Thomas gazes across the water at the dawn. Thomas nods, closes his eyes, and sighs, silhouetted against the sunrise. Buttons are swept into a jar. Thomas is deceased on a table, and an undertaker places the jar on his stomach. Benjamin and elderly Queenie visit him in an open casket at an ornate chapel. He offers his arm, and she takes it. Outside a Broadway theater, a yellow cab pulls up. Benjamin exits with flowers, pays the driver, and enters. In the dark auditorium, a woman in a headdress is lifted by two men on stage. Daisy, with a long ponytail, dances with her partner. Benjamin, without spectacles, watches as the man raises Daisy against a stormy ocean backdrop. He takes a seat, staring as the dancers move gracefully under shifting spotlights."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As the old man calls out, grainy footage shows him being zapped. Benjamin thoughtfully looks at doors and walks up the corridor, stopping outside his room pensively. In darkness, he knocks on Thomas's door. A servant opens it and directs him upstairs. Benjamin enters Thomas's room, gently shakes him. At dawn, Thomas's car arrives at the country house. The chauffeur and Benjamin assist Thomas. Under an orange sky, Benjamin wheels Thomas to a lake, lifting him to a seat on a jetty. Benjamin sits behind Thomas as he gazes at the water, nods, closes his eyes, and sighs. They are silhouetted against the rising sun. Buttons are swept into a jar; Thomas lies dead. The undertaker places the jar on him. Benjamin and elderly Queenie visit him in his casket in a chapel. Outside a Broadway theater, Benjamin exits a cab with flowers, pays, and enters. In the dark auditorium, a woman is lifted by two men on stage. Daisy, with long plaited hair, dances with her partner. Benjamin watches, mesmerized, as the spotlight follows their graceful movements."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he makes his way past the door of his own room, the old man calls out to him, capturing his attention with a voice that echoes down the hallway. Grainy footage captures a moment of him being zapped, a peculiar scene that lingers in the air. Benjamin pauses to stare at the doors, his gaze thoughtful as he takes in the surroundings with attentive eyes. With a quiet determination, Benjamin proceeds onward, continuing his walk up the corridor. He halts just outside the door to his room, where he stands, looking deeply pensive, lost in contemplation. The scene shifts to a darker tone as Benjamin approaches Thomas's house, the night enveloping him as he knocks on the door with firm resolve. A servant, adjusting his braces on the way, walks to answer the front door. This servant, pulling on his braces with purpose, opens the door and directs Benjamin up the stairs, guiding him with a sense of practiced familiarity. Benjamin proceeds to open the door of Thomas's room, stepping inside with careful intention. Thomas is found asleep in the bed, resting peacefully. Benjamin gently shakes him, attempting to rouse him from his slumber with a soft touch.\n\nAs the very first, faint rays of dawn light begin to creep across the sky, Thomas's car arrives outside the country house, cutting through the early morning stillness. Both the chauffeur and Benjamin get out of the car, setting foot on the dewy ground. As Benjamin makes his way around the vehicle, the chauffeur assists Thomas, helping him out of the car with careful, practiced movements. With the sky tinged with a delicate orange hue, Benjamin wheels Thomas along in a wheelchair, moving steadily towards their intended destination. They come to a halt, a pause in their journey, while the chauffeur waits patiently in the car, pulling his cap over his eyes to shield them from the rising sun. In front of the serene lake house, Benjamin lifts Thomas out of the wheelchair, demonstrating care and strength as he carries him over his shoulders. Together, they move down to a jetty that extends out into the placid waters of the vast, expansive lake. With gentle precision, Benjamin sets Thomas down and lowers him onto a wooden seat, ensuring his comfort. Benjamin gives Thomas a reassuring pat on the shoulder before taking a seat behind his father, providing silent support. Thomas sits quietly, gazing out across the wide expanse of water, looking towards the dawn breaking on the far horizon. He nods to himself, absorbing the majestic view, and closes his eyes with a serene sigh. As the sun rises, he and Benjamin are silhouetted against its warm glow, a poignant image of connection.\n\nMeanwhile, an assortment of buttons is swept off a table and gathered into a jar with swift movements, an indication of an ending. Thomas lies lifeless on a table, the peacefulness of death evident in his still form. An undertaker thoughtfully places the jar of buttons on Thomas's stomach, a silent tribute. Later on, Benjamin and an elderly Queenie, reflecting years of life and wisdom, visit him as he lies in an open casket in the ornate, reverent atmosphere of a chapel at rest. With a gentle motion, he holds out his arm to her, and she takes it, a gesture of shared sorrow and strength. Outside, the imposing facade of the majestic theater on Broadway comes into view as a yellow cab pulls up to its entrance. Benjamin steps out, clutching a fragrant bunch of flowers, an offering of beauty, and pays the cab driver before making his way into the theater. Benjamin steps quietly into the shadowed auditorium, a space filled with anticipation. On stage, a woman adorned with an elaborate headdress is elevated by two men who exit stage right in a fluid motion. Certain and confident, with a long, intricately plaited ponytail, Daisy graces the stage alongside her dance partner. Benjamin watches intently as the man lifts her aloft, her form reminiscent of the proud figurehead of a ship, framed against the backdrop of a painted stormy ocean. No longer wearing his spectacles, Benjamin takes a seat, his gaze fixed and unwavering as he observes the dancers move with grace. The spotlights shift, following their elegant movements as they prance left and right, illuminating their performance in a dance of light and shadow."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he makes his way past the doorway of his own room, the old man calls out to him, capturing his attention with a voice that resonates and echoes down the long hallway. Grainy, somewhat blurred footage captures a moment of him being zapped, a peculiar and enigmatic scene that seems to linger in the air. Benjamin pauses for a moment to stare at the doors, his gaze thoughtful and pensive as he attentively takes in the surroundings with keen, observant eyes. With a quiet but firm determination, Benjamin proceeds onward, continuing his purposeful walk up the corridor. He halts just outside the door to his room, where he stands for a moment, looking deeply pensive, as if lost in a world of contemplation. \n\nThe scene transitions to a darker, more somber tone as Benjamin approaches Thomas's house, the night enveloping him in its quiet embrace as he knocks on the door with firm resolve and a strong sense of intention. A servant, adjusting his braces on the way, walks briskly to answer the front door. This servant, taking a moment to pull on his braces with a sense of purpose and routine, opens the door and directs Benjamin up the stairs, guiding him with a sense of practiced familiarity borne from many such encounters. Benjamin proceeds to open the door of Thomas's room, stepping inside with careful intention and a deliberate air. Thomas is found asleep in the bed, resting peacefully in the gentle embrace of slumber. Benjamin gently shakes him, attempting to rouse him from his deep sleep with a soft, gentle touch.\n\nAs the very first, faint rays of dawn light begin to creep across the sky, casting a soft, early morning glow, Thomas's car arrives outside the country house, cutting through the serene stillness of the early morning. Both the chauffeur and Benjamin get out of the car, setting foot on the cool, dewy ground. As Benjamin makes his way around the vehicle, the chauffeur, with careful, practiced movements, assists Thomas, helping him out of the car. With the sky tinged with a delicate orange hue, marking the arrival of a new day, Benjamin wheels Thomas along in a wheelchair, moving steadily and with purpose towards their intended destination. They come to a halt, a pause in their journey, while the chauffeur waits patiently in the car, pulling his cap over his eyes to shield them from the bright, rising sun. In front of the serene and tranquil lake house, Benjamin lifts Thomas out of the wheelchair, demonstrating both care and strength as he carries him over his shoulders. Together, they move thoughtfully down to a jetty that extends out into the placid, expansive waters of the vast lake. With gentle and precise movements, Benjamin sets Thomas down and lowers him onto a wooden seat, ensuring his comfort. Benjamin gives Thomas a reassuring pat on the shoulder before taking a seat quietly behind his father, providing silent support and company. Thomas sits quietly, gazing out across the wide expanse of water, looking towards the dawn breaking on the far horizon. He nods to himself, absorbing the majestic view, and closes his eyes with a serene sigh of contentment. As the sun rises, he and Benjamin are silhouetted against its warm glow, creating a poignant and moving image of deep connection and shared experience.\n\nMeanwhile, an assortment of buttons is swept off from a table and gathered into a jar with swift, nimble movements, an indication of an ending or a conclusion. Thomas lies lifeless on a table, the peacefulness and tranquility of death evident in his still, unmoving form. An undertaker thoughtfully places the jar of buttons on Thomas's stomach, a silent tribute and a mark of respect. Later on, Benjamin and an elderly Queenie, reflecting the years of life and wisdom they have shared, visit him as he lies in an open casket in the ornate, reverent atmosphere of a chapel at rest. With a gentle motion, he holds out his arm to her, and she takes it with a gesture that speaks of shared sorrow, understanding, and strength. Outside, the imposing facade of the majestic theater on Broadway comes into view as a yellow cab pulls up to its grand entrance. Benjamin steps out, clutching a fragrant bunch of flowers, an offering of beauty and grace, and pays the cab driver before making his way into the theater. Benjamin steps quietly into the shadowed auditorium, a space filled with anticipation and expectation. On stage, a woman adorned with an elaborate, eye-catching headdress is elevated by two men who exit stage right in a fluid, practiced motion. Certain and confident, with a long, intricately plaited ponytail, Daisy graces the stage alongside her skilled dance partner. Benjamin watches intently as the man lifts her aloft, her graceful form reminiscent of the proud figurehead of a ship, framed dramatically against the backdrop of a painted, stormy ocean. No longer wearing his spectacles, Benjamin takes a seat, his gaze fixed and unwavering as he observes the dancers move with grace and elegance. The spotlights shift, following their elegant, fluid movements as they prance left and right, illuminating their performance in a mesmerizing dance of light and shadow."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he moved past his room's door, the old man's voice called out to him, causing Benjamin to pause and glance back at the familiar, grainy footage depicting him being zapped. He fixated briefly on the doors, pondering deeply before resuming his stroll up the corridor. Upon reaching the entrance to his room, he halted and stood, lost in thought, the memories swirling in his mind. Later, as darkness enveloped the surroundings, Benjamin found himself walking up to Thomas's house. Firmly, he knocked on the door, prompting a servant inside to shuffle toward the entry. Adjusting his braces as he approached, the servant opened the door and, with a courteous gesture, directed Benjamin to ascend the stairs. Once at the top, Benjamin reached out and gently opened the door to Thomas's room, stepping inside to find Thomas asleep in bed. He approached quietly and gently shook Thomas to rouse him. As the initial light of dawn stretched across the sky, Thomas's car smoothly pulled up in front of the country house. Benjamin and the chauffeur carefully alighted from the car, and as Benjamin moved around the vehicle, the chauffeur assisted Thomas in getting out. With the sky painted in hues of orange, Benjamin took charge of wheeling Thomas along in a wheelchair, and together they slowly made their way until they paused. The chauffeur, now waiting in the car, pulled his cap over his eyes to rest. Outside the lake house, Benjamin gently lifted Thomas out of the wheelchair and, with utmost care, carried him on his shoulders down to a jetty extending into the vast lake. He gingerly set Thomas down, ensuring his comfort on a wooden seat. A reassuring pat on the shoulder was shared before Benjamin took a seat behind his father. Thomas directed his gaze over the sprawling expanse of water towards the dawn blossoming on the distant horizon, nodding to himself as he absorbed the serene beauty. Closing his eyes, Thomas sighed deeply, savoring the tranquil moment. The rising sun cast their silhouettes against the breathtaking morning sky. In a swift, purposeful motion, buttons were brushed off a table into a jar. Thomas lay lifeless on a table as an undertaker solemnly placed the jar of buttons on his abdomen. Benjamin, alongside an elderly Queenie, visited him as he lay in an open casket within an ornate chapel, peacefully at rest. Extending his arm, he offered it to her, and she gracefully accepted. Later, outside the grand theater on Broadway, a yellow cab pulled up, allowing Benjamin to emerge, clutching a vibrant bouquet of flowers. He settled the fare with the cab driver and entered the theater. Making his way into the darkened auditorium, he observed the stage where a woman, adorned with an elaborate headdress, was lifted by two men who exited stage right. The breathtaking sight of Daisy, adorned with a long, plaited ponytail, gracing the stage with her dance partner, captivated him. Benjamin watched intently as the man skillfully raised her, reminiscent of the prow of a ship poised against the painted backdrop of a tempestuous ocean. Having set aside his spectacles, Benjamin settled into a seat, his gaze fixed unwaveringly on the dancers. The spotlights, attentive to their graceful maneuvers, illuminated their prancing across the stage, capturing the fluid beauty of their performance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Benjamin passes his room, the old man calls out to him. Grainy footage captures the moment he is zapped. Benjamin pauses thoughtfully before continuing up the corridor. Outside his room, he stands pensively for a moment. Later, in the darkness, he arrives at Thomas's house and knocks. A servant, adjusting his braces, opens the door and directs Benjamin upstairs. He enters Thomas's room, where Thomas is asleep, and gently wakes him.\n\nAt dawn, Thomas's car arrives at the country house. Benjamin and the chauffeur help Thomas out, and Benjamin wheels him towards a lake. Leaving the chauffeur dozing in the car, Benjamin lifts Thomas from the wheelchair, carries him to a jetty, and sets him on a wooden seat to watch the sunrise. As Thomas silently takes in the view, he closes his eyes and sighs, silhouetted against the rising sun.\n\nFollowing Thomas's death, an undertaker places a jar of buttons on his body. Benjamin and an elderly Queenie visit his open casket in an ornate chapel, where she takes his offered arm for comfort. Later, a yellow cab drops Benjamin, holding flowers, outside a majestic Broadway theater. He pays the driver and enters the dark auditorium. On stage, Daisy, adorned with a long plaited ponytail, is lifted by her dance partner amidst the stormy ocean backdrop. Benjamin, now without spectacles, sits intently as the dance unfolds, the spotlights tracing the performers' graceful movements."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As he passed his door's room, the old man, who had been a fixture in the building for decades, calls out to him. Grainy footage, reminiscent of old surveillance films, shows him getting zapped by what appears to be a malfunctioning street lamp. Benjamin stares at doors, an establishment known for its art deco design, who looks around thoughtfully. Benjamin walks on up the corridor, which is lined with vintage photographs of the city's history. He stops outside the door to his room and stands looking pensive, reflecting on the decades spent in this building. It's dark as Benjamin walks up outside Thomas's house, a stately Victorian manor passed down through generations, and knocks on the door. A servant walks to the front door, pulling up his braces, typical of early 20th-century fashion. The servant opens the door and directs Benjamin up the stairs, which creak with age. Benjamin opens the door of Thomas's room and goes inside, where the distinctive ticking of a grandfather clock is the only sound. Thomas is asleep in bed. Benjamin gently shakes him, aware of Thomas’s fragile health. As the very first rays of dawn light creep across the sky, Thomas's car, a vintage Rolls-Royce, pulls up outside the country house. The chauffeur and Benjamin get out of the car. As Benjamin walks around the vehicle, the chauffeur, who had served the family for years, helps Thomas out of the car. With the sky tinged orange, Benjamin wheels Thomas along in a wheelchair, custom-made for comfort and ease. They come to a halt. The chauffeur waits in the car and pulls his cap over his eyes, a signal of his steady patience. In front of the lake house, built in a rustic style with logs from the surrounding forest, Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake, known for its mirror-like clarity. He carefully sets Thomas down and lowers him onto a wooden seat, handcrafted by a local artisan. Benjamin pats Thomas on the shoulder and takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as he takes in the view, a view he had cherished since childhood. Thomas closes his eyes and sighs. He and Benjamin are silhouetted against the rising sun. An assortment of buttons, collected over the years from various places, is swept off a table into a jar. Thomas lies dead on a table. An undertaker places the jar of buttons on Thomas's stomach, a ritual symbolizing the closure of a life. Benjamin and an elderly Queenie, now a matriarch in her community, visit him as he lies in an open casket in an ornate chapel at rest, adorned with stained glass windows depicting biblical scenes. He holds out his arm. She takes it. The exterior of the majestic theater on Broadway, famous for its grand productions, a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers, intended for a performer on stage. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium, where the air is filled with the scent of velvet and dust. On stage, a woman in a headdress, designed in the style of ancient Greek dramas, is lifted up by two men who exit stage right. Certain beautiful with a long plaited ponytail, Daisy takes to the stage with her dance partner, whose spins and lifts are renowned in the dance world. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean, an homage to the tumultuous human spirit. Benjamin, no longer wearing spectacles, which he had worn since childhood, takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right, illuminating every elegant step in the choreography."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As he passed his door's room the old man calls out to him. Grainy footage of him getting zapped. Benjamin stares at doors who looks around thoughtfully. Benjamin walks on up the corridor. He stops outside the door to his room and stands looking pensive. It is dark as Benjamin walks up outside Thomas's house and knocks on the door. A servant walks to the front door pulling up his braces. The servant opens the door and directs Benjamin up the stairs. Benjamin opens the door of Thomas's room and goes inside. Thomas is asleep in bed. Benjamin gently shakes him. As the very first rays of dawn light creep across the sky. Thomas's car pulls up outside the country house. The chauffeur and Benjamin get out of the car. As Benjamin walks around the vehicle the chauffeur helps Thomas out of the car. With the sky tinged orange Benjamin wheels Thomas along in a wheelchair. They come to a halt. The chauffeur waits in the car and pulls his cap over his eyes. In front of the lake house. Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake. He carefully sets Thomas down and lowers him onto a wooden seat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Benjamin pats Thomas on the shoulder and takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as he takes in the view. Thomas closes his eyes and sighs. He and Benjamin are silhouetted against the rising sun. An assortment of buttons is swept off a table into a jar. Thomas lies dead on a table. An undertaker places the jar of buttons on Thomas's stomach. Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest. He holds out his arm. She takes it. The exterior of the majestic theater on Broadway. a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium. On stage a woman in a headdress is lifted up by two men who exit stage right. Certain beautiful with a long plaited ponytail. Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As he passed his door's room the old man calls out to him. Grainy footage of him getting zapped. Benjamin stares at doors who looks around thoughtfully. Benjamin walks on up the corridor. He stops outside the door to his room and stands looking pensive. It is dark as Benjamin walks up outside Thomas's house and knocks on the door. A servant walks to the front door pulling up his braces. The servant opens the door and directs Benjamin up the stairs. Benjamin opens the door of Thomas's room and goes inside. Thomas is asleep in bed. Benjamin gently shakes him. As the very first rays of dawn light creep across the sky. Thomas's car pulls up outside the country house. The chauffeur and Benjamin get out of the car. As Benjamin walks around the vehicle the chauffeur helps Thomas out of the car. With the sky tinged orange Benjamin wheels Thomas along in a wheelchair. They come to a halt. The chauffeur waits in the car and pulls his cap over his eyes. In front of the lake house. Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake. He carefully sets Thomas down and lowers him onto a wooden seat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Benjamin pats Thomas on the shoulder and takes a seat behind his father. Thomas sits looking out across the expanse of water towards the dawn on the far horizon. He nods to himself as he takes in the view. Thomas closes his eyes and sighs. He and Benjamin are silhouetted against the rising sun. An assortment of buttons is swept off a table into a jar. Thomas lies dead on a table. An undertaker places the jar of buttons on Thomas's stomach. Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest. He holds out his arm. She takes it. The exterior of the majestic theater on Broadway. a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium. On stage a woman in a headdress is lifted up by two men who exit stage right. Certain beautiful with a long plaited ponytail. Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As he passed his door's room the old man calls out to him. Grainy footage of him getting zapped. Benjamin stares at doors who looks around thoughtfully. Benjamin walks on up the corridor. He stops outside the door to his room and stands looking pensive. It is dark as Benjamin walks up outside Thomas's house and knocks on the door. A servant walks to the front door pulling up his braces. The servant opens the door and directs Benjamin up the stairs. Benjamin opens the door of Thomas's room and goes inside. Thomas is asleep in bed. Benjamin gently shakes him. The exterior of the majestic theater on Broadway. a yellow cab pulls up outside the theater. Benjamin gets out clutching a bunch of flowers. He pays the cab driver and goes into the theater. Benjamin steps into the darkened auditorium. On stage a woman in a headdress is lifted up by two men who exit stage right. Certain beautiful with a long plaited ponytail. Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As he passed his door's room the old man calls out to him. Grainy footage of him getting zapped. Benjamin stares at doors who looks around thoughtfully. Benjamin walks on up the corridor. Certain beautiful with a long plaited ponytail. Daisy takes to the stage with her dance partner. Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean. Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms. The spotlights shift to follow their movements as they prance left and right."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As the cat skipped past its window's garden, the young lady whispers out to it. Blurry images of it getting tickled. Edward blinks at windows that inspect around quietly. Edward dances down the hallway. It pauses beside the window to its garden and rests appearing curious. It’s silent as Edward dances down beside Eleanor's flat and taps on the window. A butler skips to the back window, adjusting its suspenders. The butler closes the window and guides Edward down the ladder. Edward closes the window of Eleanor’s flat and hops inside. Eleanor is napping in sofa. Edward softly nudges her. As the final beams of dusk shadow glide across the ocean, Eleanor’s bicycle glides up beside the city flat. The florist and Edward hop off the bicycle. As Edward skips around the vehicle, the florist guides Eleanor off the bicycle. With the ocean tinged pink, Edward flies Eleanor onward in a skateboard. They start to a stop. The florist rests in the bicycle and tips its hat over its toes. In front of the cabin, Edward lowers Eleanor off the skateboard and carries her above its feet up to a bridge which follows up into the shores of the endless ocean. It haphazardly lifts Eleanor up and raises her into a metal swing. Edward taps Eleanor on the head and lifts a swing opposite its friend. Eleanor sits staring out across the stretch of shore against the dusk on the close horizon. She shakes to herself as she takes out the scene. Eleanor opens its hands and sings. It and Edward are shadowed below the setting moon. A collection of feathers is blown off a carpet into a box. Eleanor rests asleep on a carpet. A baker places the box of feathers on Eleanor’s forehead. Edward and a youthful Molly visit her as she rests in a closed chest in a simple barn in motion. It clutches out its head. She leaves it. The inside of the crumbling factory on Main Street, a blue bus stops beside the factory. Edward hops off holding a bouquet of leaves. It owes the bus operator and skips into the factory. Edward hops into the illuminated courtyard. Off stage, a child in an apron is lowered down by five women who enter stage left. Certain handsome with a short curled wig, Lily leaves to the stage with its music partner. Edward listens as the woman lowers her above like the softer tail of a kite beyond the sculpted skyline of a sunny countryside. Edward, still wearing contacts, lifts a swing and blinks calmly at them as the musician jumps energetically with Lily dangling in its legs. The floodlights twirl to ignore their gestures as they skip right and left."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As Benjamin walks past his room, an old man calls to him. He appears thoughtful as he approaches his door. In the dark, Benjamin visits Thomas's house, where a servant directs him to Thomas's room. Benjamin gently wakes a sleeping Thomas. At dawn, Thomas's car arrives at a country house. Benjamin and a chauffeur help Thomas from the car. The sky turns orange as Benjamin wheels Thomas to a lake. There, Benjamin carries and sets Thomas on a wooden seat by the water. As Thomas gazes at the horizon, he closes his eyes, sighs, and Benjamin sits quietly behind him. Thomas is later shown deceased, with an undertaker placing buttons on him. Benjamin and an elderly Queenie visit Thomas in an ornate chapel. Later, Benjamin arrives at a Broadway theater with flowers. Inside, he watches Daisy, now a dancer, perform. Benjamin is captivated as Daisy is elegantly lifted and sways across the stage, reminding him of a ship's figurehead in a stormy sea backdrop."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The spotlights shift to follow their movements as they prance left and right Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean Daisy takes to the stage with her dance partner Certain beautiful with a long plaited ponytail On stage a woman in a headdress is lifted up by two men who exit stage right Benjamin steps into the darkened auditorium He pays the cab driver and goes into the theater Benjamin gets out clutching a bunch of flowers a yellow cab pulls up outside the theater The exterior of the majestic theater on Broadway She takes it He holds out his arm Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest An undertaker places the jar of buttons on Thomas's stomach Thomas lies dead on a table An assortment of buttons is swept off a table into a jar He and Benjamin are silhouetted against the rising sun Thomas closes his eyes and sighs He nods to himself as he takes in the view Thomas sits looking out across the expanse of water towards the dawn on the far horizon Benjamin pats Thomas on the shoulder and takes a seat behind his father He carefully sets Thomas down and lowers him onto a wooden seat Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake In front of the lake house The chauffeur waits in the car and pulls his cap over his eyes They come to a halt With the sky tinged orange Benjamin wheels Thomas along in a wheelchair As Benjamin walks around the vehicle the chauffeur helps Thomas out of the car The chauffeur and Benjamin get out of the car Thomas's car pulls up outside the country house As the very first rays of dawn light creep across the sky Benjamin gently shakes him Thomas is asleep in bed Benjamin opens the door of Thomas's room and goes inside The servant opens the door and directs Benjamin up the stairs A servant walks to the front door pulling up his braces It is dark as Benjamin walks up outside Thomas's house and knocks on the door He stops outside the door to his room and stands looking pensive Benjamin walks on up the corridor Benjamin stares at doors who looks around thoughtfully Grainy footage of him getting zapped As he passed his door's room the old man calls out to him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Grainy footage of him getting zapped As he passed his door's room the old man calls out to him Benjamin walks on up the corridor Benjamin stares at doors who looks around thoughtfully It is dark as Benjamin walks up outside Thomas's house and knocks on the door He stops outside the door to his room and stands looking pensive The servant opens the door and directs Benjamin up the stairs A servant walks to the front door pulling up his braces Thomas is asleep in bed Benjamin opens the door of Thomas's room and goes inside As the very first rays of dawn light creep across the sky Benjamin gently shakes him The chauffeur and Benjamin get out of the car Thomas's car pulls up outside the country house With the sky tinged orange Benjamin wheels Thomas along in a wheelchair As Benjamin walks around the vehicle the chauffeur helps Thomas out of the car The chauffeur waits in the car and pulls his cap over his eyes They come to a halt Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake In front of the lake house Benjamin pats Thomas on the shoulder and takes a seat behind his father He carefully sets Thomas down and lowers him onto a wooden seat He nods to himself as he takes in the view Thomas sits looking out across the expanse of water towards the dawn on the far horizon He and Benjamin are silhouetted against the rising sun Thomas closes his eyes and sighs Thomas lies dead on a table An assortment of buttons is swept off a table into a jar Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest An undertaker places the jar of buttons on Thomas's stomach She takes it He holds out his arm a yellow cab pulls up outside the theater The exterior of the majestic theater on Broadway He pays the cab driver and goes into the theater Benjamin gets out clutching a bunch of flowers On stage a woman in a headdress is lifted up by two men who exit stage right Benjamin steps into the darkened auditorium Daisy takes to the stage with her dance partner Certain beautiful with a long plaited ponytail Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean The spotlights shift to follow their movements as they prance left and right"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Thomas sits looking out across the expanse of water towards the dawn on the far horizon He nods to himself as he takes in the view Thomas closes his eyes and sighs He and Benjamin are silhouetted against the rising sun An assortment of buttons is swept off a table into a jar Thomas lies dead on a table An undertaker places the jar of buttons on Thomas's stomach Benjamin and an elderly Queenie visit him as he lies in an open casket in an ornate chapel at rest He holds out his arm She takes it The exterior of the majestic theater on Broadway a yellow cab pulls up outside the theater Benjamin gets out clutching a bunch of flowers He pays the cab driver and goes into the theater Benjamin steps into the darkened auditorium On stage a woman in a headdress is lifted up by two men who exit stage right Certain beautiful with a long plaited ponytail Daisy takes to the stage with her dance partner Benjamin watches as the man raises her aloft like the thicker head of a ship against the painted backdrop of a stormy ocean Benjamin no longer wearing spectacles takes a seat and stares fixedly at them as the dancer turns gracefully with Daisy reclining in his arms The spotlights shift to follow their movements as they prance left and right As he passed his door's room the old man calls out to him Grainy footage of him getting zapped Benjamin stares at doors who looks around thoughtfully Benjamin walks on up the corridor He stops outside the door to his room and stands looking pensive It is dark as Benjamin walks up outside Thomas's house and knocks on the door A servant walks to the front door pulling up his braces The servant opens the door and directs Benjamin up the stairs Benjamin opens the door of Thomas's room and goes inside Thomas is asleep in bed Benjamin gently shakes him As the very first rays of dawn light creep across the sky Thomas's car pulls up outside the country house The chauffeur and Benjamin get out of the car As Benjamin walks around the vehicle the chauffeur helps Thomas out of the car With the sky tinged orange Benjamin wheels Thomas along in a wheelchair They come to a halt The chauffeur waits in the car and pulls his cap over his eyes In front of the lake house Benjamin lifts Thomas out of the wheelchair and carries him over his shoulders down to a jetty which leads out into the waters of the vast lake He carefully sets Thomas down and lowers him onto a wooden seat Benjamin pats Thomas on the shoulder and takes a seat behind his father"
        }
      ]
    }
  ]
}