{
  "ground_truth": "Daisy toils backwards into her partner's arms, her feet leaving the floor as she is swept into an effortless turn. Daisy strikes an elegant pose, then turns to the audience and cranes a swan-like neck. She skips into her partner's arms, and he holds her above him with her knees bent and toes pointed. He lowers her as he turns, affecting the motion of a helter-skelter. Benjamin watches unblinkingly as they part, holding each other's gaze, only to embrace again in a capricious dance of attraction and repulsion. Backstage, Benjamin approaches a man with a clipboard and follows him through the corridor crowd, waiting by her dressing room door. Daisy steps out in her underwear, sees him, and hastily wraps a robe around herself. She turns to him, smiles, and regards the bouquet of white daisies he's given her. He lowers his eyes, and beaming, she retreats into the dressing room. Benjamin turns with a look of disappointment. He and Daisy step out of the lift and cross the dimly lit party where people dance and drink. Benjamin looks timid as Daisy offers a smile when a handsome dark-haired young man embraces her from behind. Smiling broadly, Daisy trots off, and David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middle-aged woman and an elderly man. Benjamin watches solemnly as David snatches her away and dances closely with her, toiling her around. They share a lingering kiss, parting when Daisy starts talking, only to be swept away in mid-sentence by another man. Benjamin stops slowly towards the lift as Daisy dances between two guys. With an arm around David, Daisy looks up to see Benjamin leave. Benjamin pulls on his coat, steps out onto the street, and strides away. Daisy canters out after him as a yellow taxi pulls up with David waiting by it. Daisy turns to Benjamin, shrugs slightly, and he blinks. She turns away, shakes her head as Benjamin remains uncomprehending, and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the other direction. At the hospital, Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag, which contains photos of Daisy as a young dancer. Light snowfall occurs as Daisy and the young man stroll through Moscow, and later, Daisy lies in bed with the young man. Caroline reads while Benjamin, wearing a brown leather jacket and dark glasses, cruises along a tree-lined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home, and wearing white overalls and a cap, Benjamin nods soberly and descends a stepladder.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Daisy labors backward into her companion's embrace, her feet leaving the ground as she is whisked into an effortless whirl. Daisy assumes an elegant stance, then turns to the crowd and extends a swan-like neck. She skips into her partner's embrace, and he supports her above him with her knees bent and toes pointed. He lowers her as he rotates, simulating the movement of a helter-skelter. Benjamin observes unblinkingly as they separate, holding each other's stare, only to embrace again in a whimsical dance of attraction and repulsion. Backstage, Benjamin approaches a man with a clipboard and follows him through the corridor throng, waiting by her dressing room entrance. Daisy steps out in her lingerie, sees him, and quickly wraps a robe around herself. She turns to him, smiles, and regards the bouquet of white daisies he's presented her. He lowers his eyes, and beaming, she retreats into the dressing room. Benjamin turns with a look of dissatisfaction. He and Daisy step out of the elevator and traverse the dimly lit gathering where people dance and drink. Benjamin appears timid as Daisy offers a smile when a handsome dark-haired youth embraces her from behind. Smiling broadly, Daisy trots off, and David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him as David makes a beeline for the dance floor where Daisy converses with a middle-aged woman and an elderly man. Benjamin watches solemnly as David snatches her away and dances closely with her, toiling her around. They share a lingering kiss, parting when Daisy starts speaking, only to be whisked away mid-sentence by another man. Benjamin stops slowly towards the elevator as Daisy dances between two guys. With an arm around David, Daisy looks up to see Benjamin leave. Benjamin pulls on his coat, steps out onto the street, and strides away. Daisy canters out after him as a yellow taxi arrives with David waiting by it. Daisy turns to Benjamin, shrugs slightly, and he blinks. She turns away, shakes her head as Benjamin remains uncomprehending, and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the opposite direction. At the hospital, Caroline looks at the theater leaflet and takes a manila envelope from Daisy's bag, which contains photographs of Daisy as a young dancer. Light snowfall occurs as Daisy and the young man stroll through Moscow, and later, Daisy lies in bed with the young man. Caroline reads while Benjamin, wearing a brown leather jacket and dark glasses, cruises along a tree-lined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home, and wearing white overalls and a cap, Benjamin nods soberly and descends a stepladder."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Daisy is toiled backwards into her partner's arms, with the floor being left by her feet as she sweeps into an effortless turn. An elegant pose is struck by Daisy, then she is turned to the audience, and a swan-like neck is craned by her. She is skipped into her partner's arms, and she is held above him with her knees bent and toes pointed by him. As he turns, she is lowered by him, affecting the motion of a helter-skelter. Benjamin unblinkingly watches them as they part, and each other's gaze is held by them, only for them to be embraced again in a capricious dance of attraction and repulsion. Backstage, a man with a clipboard is approached by Benjamin, and he is followed through the corridor crowd to her dressing room door by him. Daisy steps out in her underwear, sees him, and a robe is hastily wrapped around herself by her. She is turned to by him, smiled at, and the bouquet of white daisies he's given to her is regarded by her. His eyes are lowered by him, and she beams as she retreats into the dressing room. A look of disappointment is turned with by Benjamin. He and Daisy are stepped out of the lift by him, and the dimly lit party is crossed by them where dancing and drinking occur. A timid look is given by Benjamin as Daisy smiles when she is embraced from behind by a handsome dark-haired young man. Smiling broadly, Daisy trots off, and David and Benjamin watch as Daisy's coat is taken by a guy. Playful dancing occurs with him by her as a beeline is made for the dance floor by David where Daisy talks with a middle-aged woman and an elderly man. Solemn watching is done by Benjamin as David snatches her away and close dancing occurs with her, toiling her around. A lingering kiss is shared by them, parting when talking is begun by Daisy, only for her to be swept away in mid-sentence by another man. Slow stopping is done by Benjamin towards the lift as dancing between two guys occurs by Daisy. With an arm around David, looking up is done by Daisy to see Benjamin leave. A coat is pulled on by Benjamin, the street is stepped out onto by him, and he strides away. After him, cantering out is done by Daisy as a yellow taxi pulls up with David waiting by it. A turn to Benjamin is done by Daisy, a slight shrug is given, and a blink is made by him. She turns away, head shaking as Benjamin remains uncomprehending, and going to the taxi is done by her. A walk away is done by Benjamin hat in hand as the taxi drives off in the other direction. At the hospital, looking at the theater flyer is done by Caroline and a manila envelope is taken from Daisy's bag, which contains photos of Daisy as a young dancer. Light snowfall is occurring as a stroll through Moscow is taken by Daisy and the young man, and later, lying in bed with the young man is done by Daisy. Reading is done by Caroline while Benjamin, who is wearing a brown leather jacket and dark glasses, is cruised along a tree-lined road on a cherry red motorcycle. He strips paint from the porch of a retirement home, and wearing white overalls and a cap, a sober nod is given by Benjamin as he descends a stepladder."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Daisy glides backward into her partner's arms, lifted effortlessly into a turn. She strikes an elegant pose, turns to the audience, and extends her neck gracefully. She skips back to her partner, who lifts her with bent knees and pointed toes, then lowers her in a helter-skelter motion. Benjamin watches intently as they part and reunite in a playful dance of attraction and repulsion. Backstage, Benjamin follows a man with a clipboard to her dressing room. Daisy, in her underwear, sees him, wraps a robe around herself, smiles, and accepts a bouquet of white daisies. She retreats into the dressing room, leaving Benjamin disappointed. At a dimly lit party, Benjamin timidly watches Daisy smile as a handsome man embraces her. Daisy trots off, and David and Benjamin observe as a guy takes her coat. She dances with him, and David heads to the dance floor where Daisy talks with others. Benjamin watches as David dances closely with her, sharing a lingering kiss. Daisy is swept away mid-sentence by another man. Benjamin slowly heads to the lift as Daisy dances between two guys. With an arm around David, Daisy sees Benjamin leave. He steps onto the street, and Daisy follows as a taxi with David arrives. She turns to Benjamin, shrugs, and then goes to the taxi. Benjamin walks away as the taxi departs. At the hospital, Caroline finds a theater flyer and photos of Daisy as a young dancer. Light snow falls as Daisy and a young man stroll through Moscow, later lying in bed together. Caroline reads while Benjamin, in a leather jacket and dark glasses, rides a cherry red motorcycle along a tree-lined road. He strips paint from a retirement home's porch, wearing white overalls and a cap, nodding soberly as he descends a stepladder."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Daisy glides into her partner's arms, lifted effortlessly into a turn. She poses elegantly, turns to the audience, and extends her neck gracefully. She leaps into her partner's arms, who lifts her with bent knees and pointed toes, then lowers her in a spiral motion. Benjamin watches as they part and reunite in a dance of attraction and repulsion. Backstage, Benjamin follows a man to Daisy's dressing room. Daisy, in her underwear, sees Benjamin, wraps a robe around herself, smiles, and accepts his bouquet of white daisies. She retreats, beaming, as Benjamin looks disappointed. At a dimly lit party, Benjamin timidly watches Daisy smile at a young man who embraces her. Daisy dances with him, and David joins her on the dance floor, sharing a kiss. Daisy is swept away mid-sentence by another man. Benjamin heads to the lift as Daisy dances with two men. She sees Benjamin leave, shrugs, and turns to the waiting taxi with David. Benjamin walks away as the taxi departs. At the hospital, Caroline finds photos of young Daisy in her bag. Light snow falls as Daisy strolls through Moscow with a young man, later lying in bed with him. Caroline reads while Benjamin, in a leather jacket and sunglasses, rides a motorcycle. He strips paint from a retirement home porch, wearing overalls and a cap, and descends a stepladder soberly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Daisy gracefully toils backwards into the welcoming embrace of her partner's arms, her feet momentarily leaving the floor as she is effortlessly swept into a graceful turn. With poise, Daisy strikes an elegant pose, then turns her attention to the audience, craning her neck in a swan-like manner. She skips lightly into her partner's arms, and he lifts her above him, her knees bent and toes pointed delicately. As he lowers her, he turns, creating the effect of a helter-skelter motion. Benjamin watches intently, his eyes unblinking, as they part ways, their gazes locked, only to come together once more in a whimsical dance of attraction and repulsion. Backstage, Benjamin approaches a man holding a clipboard and follows him through the bustling corridor, waiting patiently by her dressing room door. Daisy emerges in her underwear, notices him, and quickly wraps a robe around herself. She turns to him with a smile, her eyes falling on the bouquet of white daisies he has given her. He lowers his eyes, and with a beaming smile, she retreats into the dressing room. Benjamin turns away, a look of disappointment on his face. He and Daisy step out of the lift and make their way across the dimly lit party where people are dancing and drinking. Benjamin appears timid as Daisy offers a smile when a handsome, dark-haired young man embraces her from behind. Smiling broadly, Daisy trots off, and David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him as David makes a direct path to the dance floor where Daisy is engaged in conversation with a middle-aged woman and an elderly man. Benjamin watches solemnly as David pulls her away and dances closely with her, twirling her around. They share a lingering kiss, parting only when Daisy begins to speak, only to be swept away mid-sentence by another man. Benjamin slowly makes his way towards the lift as Daisy dances between two guys. With an arm around David, Daisy looks up just in time to see Benjamin leaving. Benjamin pulls on his coat, steps out onto the street, and strides away purposefully. Daisy canters out after him as a yellow taxi pulls up with David waiting by it. Daisy turns to Benjamin, offering a slight shrug, and he blinks in response. She turns away, shaking her head as Benjamin remains uncomprehending, and heads towards the taxi. Benjamin walks away, hat in hand, as the taxi drives off in the opposite direction. At the hospital, Caroline looks at the theater flyer and retrieves a manila envelope from Daisy's bag, which contains photographs of Daisy as a young dancer. Light snowfall gently occurs as Daisy and the young man stroll through the streets of Moscow, and later, Daisy is seen lying in bed with the young man. Caroline reads while Benjamin, clad in a brown leather jacket and dark glasses, cruises along a tree-lined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home, and wearing white overalls and a cap, Benjamin nods soberly and descends a stepladder."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Daisy, with a fluid grace, gracefully labors her way backward into the warm and inviting embrace of her partner's waiting arms. Her feet leave the ground momentarily as she is effortlessly lifted into a graceful spin. With refined poise and elegance, Daisy strikes a sophisticated pose, then shifts her focus to the attentive audience, craning her neck in a manner reminiscent of a swan. She skips lightly into her partner's arms once more, and he lifts her high above him. Her knees are bent, and her toes point delicately, creating a beautiful picture. As he gently lowers her, he turns, giving rise to the effect of a helter-skelter motion that captivates all. Meanwhile, Benjamin observes with keen attention, his eyes not blinking, as they separate, locking gazes, only to reunite again in a whimsical dance that alternates between the forces of attraction and repulsion. \n\nBackstage, Benjamin approaches a man who holds a clipboard, and follows him through the bustling corridor, patiently waiting by her dressing room door. Daisy steps out in her underwear, noticing him. She promptly wraps a robe around herself, turning to him with a smile as her eyes land on the bouquet of white daisies he has presented her. He lowers his gaze, and with a beaming smile, she retreats into the sanctuary of her dressing room. Benjamin turns away, and his face betrays a look of disappointment. Later, he and Daisy exit the lift, making their way across the dimly lit party where people are engaged in dancing and sipping drinks. Benjamin appears timid, but Daisy offers him a smile when a handsome, dark-haired young man embraces her from behind. Smiling broadly, Daisy trots off, and both David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him while David makes a deliberate path toward the dance floor. There, Daisy is engrossed in conversation with a middle-aged woman and an elderly gentleman. Benjamin watches solemnly as David pulls Daisy away, dancing closely with her, twirling her around. They share a lingering kiss, parting only when Daisy begins speaking, only to be whisked away mid-sentence by another man. \n\nBenjamin slowly makes his way towards the lift, observing as Daisy dances between two gentlemen. With an arm around David, Daisy looks up just in time to see Benjamin's departure. Benjamin pulls on his coat, steps out onto the street, and strides away with purpose. Daisy canters out after him just as a yellow taxi pulls up with David waiting by it. Daisy turns to face Benjamin, offering a slight shrug, to which he responds with a blink. She turns away, shaking her head as Benjamin remains puzzled, and she heads toward the taxi. Benjamin walks away, holding his hat in hand, as the taxi drives off in the opposite direction. \n\nAt the hospital, Caroline looks thoughtfully at the theater flyer and retrieves a manila envelope from Daisy's bag. Inside, there are photographs capturing Daisy as a young dancer. Meanwhile, a gentle snow begins to fall lightly as Daisy and the young man stroll through the wintry streets of Moscow. Later on, Daisy is seen lying in bed with the young man. Caroline is absorbed in reading, while Benjamin, dressed in a brown leather jacket and sporting dark glasses, cruises along a scenic, tree-lined road on a cherry-red motorcycle. He is also seen stripping paint from the porch of a retirement home, and wearing white overalls and a cap, Benjamin nods with sober acknowledgment and descends a stepladder."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Daisy begins by moving backwards into her partner's waiting arms, her feet lifting off the ground as he effortlessly sweeps her into a graceful turn. She then strikes an elegant pose, pausing momentarily before turning to face the audience, extending her neck in a swan-like manner. With a light skip, she moves back into her partner's embrace, where he lifts her above him, her knees bent and toes pointed delicately. As he lowers her, he turns, creating a motion reminiscent of a helter-skelter. Meanwhile, Benjamin watches intently, his eyes fixed on them as they separate, maintaining eye contact, only to come together again in a whimsical dance that embodies both attraction and repulsion. Backstage, Benjamin approaches a man holding a clipboard and follows him through the bustling corridor, eventually stopping to wait by Daisy's dressing room door. Daisy emerges in her underwear, quickly noticing Benjamin, and hurriedly wraps a robe around herself. She turns to him with a smile, her eyes falling on the bouquet of white daisies he has brought her. As he lowers his eyes, she beams and retreats back into the dressing room. Benjamin turns away, a look of disappointment crossing his face. Later, he and Daisy exit the lift and make their way through a dimly lit party where people are dancing and drinking. Benjamin appears timid as Daisy offers him a smile, just as a handsome dark-haired young man embraces her from behind. Daisy, smiling broadly, trots off, and both David and Benjamin watch as another man takes Daisy's coat. She begins to dance playfully with him, prompting David to head directly for the dance floor where Daisy is engaged in conversation with a middle-aged woman and an elderly man. Benjamin watches solemnly as David pulls Daisy away, dancing closely with her and twirling her around. They share a lingering kiss, but part when Daisy starts to speak, only to be whisked away mid-sentence by another man. Benjamin slowly makes his way towards the lift as Daisy dances between two guys. With an arm around David, Daisy glances up just in time to see Benjamin leaving. Benjamin pulls on his coat, steps out onto the street, and strides away. Daisy quickly follows him out as a yellow taxi arrives with David waiting by it. She turns to Benjamin, offering a slight shrug, and he blinks in response. She then turns away, shaking her head as Benjamin stands there, uncomprehending, before she heads to the taxi. Benjamin walks away, hat in hand, as the taxi drives off in the opposite direction. At the hospital, Caroline examines a theater flyer and retrieves a manila envelope from Daisy's bag, discovering photos of Daisy as a young dancer. Light snow falls as Daisy and the young man stroll through Moscow, and later, Daisy is seen lying in bed with the young man. Meanwhile, Caroline reads while Benjamin, clad in a brown leather jacket and dark glasses, rides along a tree-lined road on a cherry red motorcycle. He is later seen stripping paint from the porch of a retirement home, wearing white overalls and a cap, nodding soberly as he descends a stepladder."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Daisy gracefully moves into her partner's arms, lifted effortlessly into a turn before striking an elegant pose and engaging the audience with a swan-like gesture. She skips back to her partner, who lifts her into a poised position, then lowers her in a helter-skelter motion. Benjamin watches intently as Daisy and her partner engage in a dynamic dance of attraction and repulsion. Backstage, Benjamin follows a man with a clipboard to Daisy's dressing room, where she emerges in her underwear, quickly covering herself with a robe upon seeing him. She smiles at Benjamin and accepts a bouquet of white daisies, retreating into her dressing room as he looks on with disappointment.\n\nLater, Benjamin and Daisy navigate a dimly lit party, where Daisy is warmly greeted by a handsome young man. As Daisy dances playfully with various partners, Benjamin watches solemnly, especially when David, another man, dances closely with her and shares a lingering kiss. Daisy is swept away mid-conversation by another man, prompting Benjamin to slowly head toward the lift. Daisy, with an arm around David, notices Benjamin leaving. Outside, Benjamin dons his coat and strides away, while Daisy follows him out, only to turn back to a waiting taxi with David. She shrugs at Benjamin, who remains uncomprehending, and joins David in the taxi as Benjamin walks away.\n\nAt the hospital, Caroline examines a theater flyer and finds photos of Daisy as a young dancer in a manila envelope from Daisy's bag. Meanwhile, Daisy and a young man enjoy a snowy stroll through Moscow, later seen lying in bed together. Caroline reads as Benjamin, in a brown leather jacket and dark glasses, rides a cherry red motorcycle along a tree-lined road. He is also seen working at a retirement home, stripping paint from the porch, and descending a stepladder in white overalls and a cap, nodding soberly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Daisy toils backwards into her partner's arms, her feet leaving the floor in a style reminiscent of a professional ballet performance as she is swept into an effortless turn. Daisy, trained at the prestigious Juilliard School, strikes an elegant pose, then turns to the audience and cranes a swan-like neck, echoing the grace of the ballet \"Swan Lake.\" She skips into her partner's arms in a sequence inspired by classical dance, and he holds her above him with her knees bent and toes pointed, a move perfected through years of practice. He lowers her as he turns, affecting the motion of a helter-skelter, a nod to the twisting slides found in British amusement parks. Benjamin, a longtime admirer and aspiring dancer himself, watches unblinkingly as they part, holding each other's gaze in an unspoken language of love and longing, only to embrace again in a capricious dance of attraction and repulsion. Backstage at the renowned Bolshoi Theatre, Benjamin approaches a man with a clipboard, likely the stage manager coordinating the performers, and follows him through the corridor crowd, waiting by her dressing room door. Daisy steps out in her underwear, sees him, and hastily wraps a robe around herself, modest in the bustling environment. She turns to him, smiles, and regards the bouquet of white daisies he's given her, a personal gift symbolizing purity and new beginnings. He lowers his eyes, and beaming, she retreats into the dressing room. Benjamin turns with a look of disappointment, feeling the weight of unspoken words. He and Daisy step out of the lift and cross the dimly lit party, hosted in a grand historic hotel, where people dance and drink amidst the opulent decor. Benjamin looks timid as Daisy offers a smile when a handsome dark-haired young man, known in the circle as a celebrated soloist, embraces her from behind. Smiling broadly, Daisy trots off, and David and Benjamin watch as a guy, part of the event's staff, takes Daisy's coat. She dances playfully with him as David makes a beeline for the dance floor, where Daisy talks animatedly with a middle-aged woman, a former prima ballerina, and an elderly man, the company’s patron. Benjamin watches solemnly as David snatches her away and dances closely with her, toiling her around in a manner reminiscent of folk dances. They share a lingering kiss, parting when Daisy starts talking with a famous choreographer, only to be swept away in mid-sentence by another man, a noted dance critic. Benjamin stops slowly towards the lift as Daisy dances between two guys, familiar faces from the dance troupe. With an arm around David, Daisy looks up to see Benjamin leave, reflecting the complexities of their intertwined lives. Benjamin pulls on his coat, steps out onto the rain-slicked street, and strides away. Daisy canters out after him as a yellow taxi, a rare sight in the city known for its iconic black cabs, pulls up with David waiting by it. Daisy turns to Benjamin, shrugs slightly, and he blinks, processing the moment's ambiguity. She turns away, shakes her head as Benjamin remains uncomprehending, and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the other direction, marking the end of an era. At the hospital, Caroline looks at the theater flyer, a memento of Daisy's illustrious career, and takes a manila envelope from Daisy's bag, which contains photos of Daisy as a young dancer, capturing her journey from obscurity to stardom. Light snowfall occurs, gently blanketing the cobblestone streets, as Daisy and the young man stroll romantically through Moscow, a city renowned for its vibrant arts scene, and later, Daisy lies in bed with the young man, symbolizing a fleeting moment of intimacy. Caroline reads while Benjamin, wearing a brown leather jacket and dark glasses to shield himself from the cold wind, cruises along a tree-lined road on a cherry red motorcycle, an emblem of freedom and rebellion. He is seen stripping paint from the porch of a retirement home, a volunteer activity he cherishes for its simplicity, and wearing white overalls and a cap, Benjamin nods soberly and descends a stepladder, reflecting on life’s winding journey."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn. Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck. She skips into her partner's arms and he holds her above him with her knees bent and toes pointed. He lowers her as he turns affecting the motion of a helterskelter. Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion. Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door. Daisy steps out in her underwear sees him and hastily wraps a robe around herself. She turns to him smiles and regards the bouquet of white daisies he is given her. He lowers his eyes and beaming she retreats into the dressing room. Benjamin turns with a look of disappointment. He and Daisy step out of the lift and cross the dimly lit party where people dance and drink. Benjamin looks timid as Daisy offers a smile when a handsome darkhaired young man embraces her from behind. Smiling broadly Daisy trots off and David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middleaged woman and an elderly man. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Benjamin watches solemnly as David snatches her away and dances closely with her toiling her around. They share a lingering kiss parting when Daisy starts talking only to be swept away in midsentence by another man. Benjamin stops slowly towards the lift as Daisy dances between two guys. With an arm around David Daisy looks up to see Benjamin leave. Benjamin pulls on his coat steps out onto the street and strides away. Daisy canters out after him as a yellow taxi pulls up with David waiting by it. Daisy turns to Benjamin shrugs slightly and he blinks. She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the other direction. At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer. Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man. Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap. Benjamin nods soberly and descends a stepladder."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn. Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck. She skips into her partner's arms and he holds her above him with her knees bent and toes pointed. He lowers her as he turns affecting the motion of a helterskelter. Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion. Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door. Daisy steps out in her underwear sees him and hastily wraps a robe around herself. She turns to him smiles and regards the bouquet of white daisies he is given her. He lowers his eyes and beaming she retreats into the dressing room. Benjamin turns with a look of disappointment. He and Daisy step out of the lift and cross the dimly lit party where people dance and drink. Benjamin looks timid as Daisy offers a smile when a handsome darkhaired young man embraces her from behind. Smiling broadly Daisy trots off and David and Benjamin watch as a guy takes Daisy's coat. She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middleaged woman and an elderly man. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Benjamin watches solemnly as David snatches her away and dances closely with her toiling her around. They share a lingering kiss parting when Daisy starts talking only to be swept away in midsentence by another man. Benjamin stops slowly towards the lift as Daisy dances between two guys. With an arm around David Daisy looks up to see Benjamin leave. Benjamin pulls on his coat steps out onto the street and strides away. Daisy canters out after him as a yellow taxi pulls up with David waiting by it. Daisy turns to Benjamin shrugs slightly and he blinks. She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the other direction. At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer. Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man. Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap. Benjamin nods soberly and descends a stepladder."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn. Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck. She skips into her partner's arms and he holds her above him with her knees bent and toes pointed. He lowers her as he turns affecting the motion of a helterskelter. Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion. Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door. Daisy steps out in her underwear sees him and hastily wraps a robe around herself. She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi. Benjamin walks away hat in hand as the taxi drives off in the other direction. At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer. Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man. Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap. Benjamin nods soberly and descends a stepladder."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn. Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck. She skips into her partner's arms and he holds her above him with her knees bent and toes pointed. Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle. He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap. Benjamin nods soberly and descends a stepladder."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tulip glides sideways into her teacher's embrace, her hands reaching the ceiling as she is lifted into a languorous whirl. Tulip forms a clumsy shape, then turns to the foliage and twists a flamingo-like wing. She hops into her teacher's embrace, and she suspends her over him with her elbows bent and fingers spread. He raises her as he spins, mimicking the movement of a carousel. Oliver glances inattentively as they drift apart, locking each other's ears, only to collide again in a whimsical waltz of curiosity and disinterest. In the library, Oliver encounters a woman with a laptop and follows her through the hallway throng, pausing by her kitchen entrance. Tulip walks out in her pajamas, notices him, and quickly throws a sweater over herself. She turns to him, grins, and examines the basket of red carnations he's offered her. He averts his gaze, and beaming, she disappears into the kitchen. Oliver turns with a hint of regret. He and Tulip exit the escalator and navigate the poorly lit gallery where animals wander and chatter. Oliver stands confidently as Tulip extends a nod when an attractive blond young woman hugs her from the front. Laughing loudly, Tulip ambles away, and Chris and Oliver observe as a lady takes Tulip's hat. She waltzes playfully with her as Chris makes a detour for the gallery wall where Tulip chats with a young man and a youthful lady. Oliver observes cheerlessly as Chris grabs her away and jigs closely with her, spinning her around. They share a brief glance, separating when Tulip begins humming, only to be carried off mid-whisper by another woman. Oliver strolls quickly towards the elevator as Tulip skips between two ladies. With a hug around Chris, Tulip glances up to see Oliver disappear. Oliver pulls on his sweater, steps onto the grass, and marches away. Tulip trots out after him as a blue scooter arrives with Chris leaning on it. Tulip glances at Oliver, shrugs lightly, and he blinks. She turns back, shakes her wrist as Oliver stands perplexed, and walks to the scooter. Oliver wanders off bag in hand as the scooter rides away in the opposite manner. At the school, Madison examines the cinema poster and retrieves a cardboard box from Tulip's drawer, which holds sketches of Tulip as a young painter. A gentle rain falls as Tulip and the young lady wander through Kyoto, and later, Tulip rests in a hammock with the young lady. Madison writes while Oliver, wearing a beige wool sweater and light sandals, sails along a desert highway on a lime green skateboard. He is seen applying varnish to the wall of a museum, and wearing green overalls and a visor, Oliver nods energetically and ascends a rope ladder."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Daisy dances gracefully with her partner, exhibiting an elegant performance that captivates Benjamin, who watches intently. Backstage, Benjamin eagerly waits to give Daisy a bouquet of daisies, but she retreats into her dressing room after a brief smile, leaving him disappointed. At a party, Daisy smiles at Benjamin but is soon whisked away by a handsome young man, David. Benjamin watches as Daisy interacts with others, feeling distant. Eventually, Daisy’s attention shifts entirely to David, leading a disheartened Benjamin to leave. Daisy hesitates but ultimately joins David in a taxi, leaving Benjamin puzzled and alone. Meanwhile, Caroline discovers photos of young Daisy and her dance career. As light snow falls, Daisy shares a tender moment with a young man in Moscow. Benjamin, now on his own, rides a motorcycle and works at a retirement home, reflecting on his unfulfilled connection with Daisy."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Benjamin nods soberly and descends a stepladder He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap  Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle  Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man  At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer  Benjamin walks away hat in hand as the taxi drives off in the other direction  She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi  Daisy turns to Benjamin shrugs slightly and he blinks  Daisy canters out after him as a yellow taxi pulls up with David waiting by it  Benjamin pulls on his coat steps out onto the street and strides away  With an arm around David Daisy looks up to see Benjamin leave  Benjamin stops slowly towards the lift as Daisy dances between two guys  They share a lingering kiss parting when Daisy starts talking only to be swept away in midsentence by another man  Benjamin watches solemnly as David snatches her away and dances closely with her toiling her around  She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middleaged woman and an elderly man  Smiling broadly Daisy trots off and David and Benjamin watch as a guy takes Daisy's coat  Benjamin looks timid as Daisy offers a smile when a handsome darkhaired young man embraces her from behind  He and Daisy step out of the lift and cross the dimly lit party where people dance and drink  Benjamin turns with a look of disappointment  He lowers his eyes and beaming she retreats into the dressing room  She turns to him smiles and regards the bouquet of white daisies he's given her  Daisy steps out in her underwear sees him and hastily wraps a robe around herself  Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door  Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion  He lowers her as he turns affecting the motion of a helterskelter  She skips into her partner's arms and he holds her above him with her knees bent and toes pointed  Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck  Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn He lowers her as he turns affecting the motion of a helterskelter She skips into her partner's arms and he holds her above him with her knees bent and toes pointed Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion She turns to him smiles and regards the bouquet of white daisies he is given her Daisy steps out in her underwear sees him and hastily wraps a robe around herself Benjamin turns with a look of disappointment He lowers his eyes and beaming she retreats into the dressing room Benjamin looks timid as Daisy offers a smile when a handsome darkhaired young man embraces her from behind He and Daisy step out of the lift and cross the dimly lit party where people dance and drink She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middleaged woman and an elderly man Smiling broadly Daisy trots off and David and Benjamin watch as a guy takes Daisy's coat They share a lingering kiss parting when Daisy starts talking only to be swept away in midsentence by another man Benjamin watches solemnly as David snatches her away and dances closely with her toiling her around With an arm around David Daisy looks up to see Benjamin leave Benjamin stops slowly towards the lift as Daisy dances between two guys Daisy canters out after him as a yellow taxi pulls up with David waiting by it Benjamin pulls on his coat steps out onto the street and strides away She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi Daisy turns to Benjamin shrugs slightly and he blinks At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer Benjamin walks away hat in hand as the taxi drives off in the other direction Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man Benjamin nods soberly and descends a stepladder He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Benjamin watches solemnly as David snatches her away and dances closely with her toiling her around  They share a lingering kiss parting when Daisy starts talking only to be swept away in midsentence by another man  Benjamin stops slowly towards the lift as Daisy dances between two guys  With an arm around David Daisy looks up to see Benjamin leave  Benjamin pulls on his coat steps out onto the street and strides away  Daisy canters out after him as a yellow taxi pulls up with David waiting by it  Daisy turns to Benjamin shrugs slightly and he blinks  She turns away shakes her head as Benjamin remains uncomprehending and goes to the taxi  Benjamin walks away hat in hand as the taxi drives off in the other direction  At the hospital Caroline looks at the theater flyer and takes a manila envelope from Daisy's bag which contains photos of Daisy as a young dancer  Light snowfall occurs as Daisy and the young man stroll through Moscow and later Daisy lies in bed with the young man  Caroline reads while Benjamin wearing a brown leather jacket and dark glasses cruises along a treelined road on a cherry red motorcycle  He is seen stripping paint from the porch of a retirement home and wearing white overalls and a cap  Benjamin nods soberly and descends a stepladder Daisy toils backwards into her partner's arms her feet leaving the floor as she is swept into an effortless turn  Daisy strikes an elegant pose then turns to the audience and cranes a swanlike neck  She skips into her partner's arms and he holds her above him with her knees bent and toes pointed  He lowers her as he turns affecting the motion of a helterskelter  Benjamin watches unblinkingly as they part holding each other's gaze only to embrace again in a capricious dance of attraction and repulsion  Backstage Benjamin approaches a man with a clipboard and follows him through the corridor crowd waiting by her dressing room door  Daisy steps out in her underwear sees him and hastily wraps a robe around herself  She turns to him smiles and regards the bouquet of white daisies he's given her  He lowers his eyes and beaming she retreats into the dressing room  Benjamin turns with a look of disappointment  He and Daisy step out of the lift and cross the dimly lit party where people dance and drink  Benjamin looks timid as Daisy offers a smile when a handsome darkhaired young man embraces her from behind  Smiling broadly Daisy trots off and David and Benjamin watch as a guy takes Daisy's coat  She dances playfully with him as David makes a beeline for the dance floor where Daisy talks with a middleaged woman and an elderly man "
        }
      ]
    }
  ]
}