{
  "ground_truth": "A postman arrives and hands Benjamin a telegram on the front porch, which Benjamin opens as the postman leaves. Clouds part to reveal a view of Paris from above, with the Arc de Triomphe in the center of the Place de l'Etoile, around which twelve roads extend. Benjamin leaves a taxi and strides through a grassy courtyard, climbs a flight of stairs, and approaches a nurse at a reception desk. He sits down opposite the desk as the nurse makes a call. Meanwhile, a woman leaves her apartment, and a black cab stops. A man takes the cab as she turns to lock her door. Daisy sits on the stage and kicks her legs while a cab breaks sharply. The man inside sits up, and she combs her hair. The nurse ends her call, and Benjamin rises to his feet and enters a hospital ward where he strolls past bed-bound patients. He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame. She opens her eyes to see his image blurred. He sits down, smiles warmly, but his face falls while she hides her face. He looks at her as she fights back tears. Benjamin looks at the floor, then stares at Daisy, who has her head turned away and her eyes closed. A moment passes, and she turns her head to find he's gone, as a dangling triangular support sways above her, which she grasps sharply. Caroline reads on and then leaps up and goes, wearing a harrowed expression. Her aged mother meets her eye with her wrist bent unnaturally across her chest. Caroline sits back and picks up the diary. Meanwhile, Benjamin sails on a calm lake and leaves a woman's doorstep, as a dark-haired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead, seeing the elderly resident staring at their rooms and at her. Benjamin, fresh-faced with short cropped hair and wearing a bright white T-shirt, stares wistfully, then goes to his window. He alights his sailboat and strolls casually on the wooden jetty, drives a blue motorbike parked outside, and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her standing in the doorway opposite, dressed in black with her hands knitted together at her waist.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A courier reaches and gives Benjamin a telegram on the front porch, which Benjamin opens as the courier departs. Clouds separate to disclose a view of Paris from above, with the Arc de Triomphe in the center of the Place de l'Etoile, around which twelve routes extend. Benjamin exits a taxi and strides through a grassy courtyard, ascends a flight of stairs, and approaches a nurse at a reception desk. He sits down across the desk as the nurse makes a call. Meanwhile, a woman exits her apartment, and a black cab halts. A man takes the cab as she turns to lock her door. Daisy sits on the stage and kicks her legs while a cab brakes sharply. The man inside sits up, and she combs her hair. The nurse ends her call, and Benjamin rises to his feet and enters a hospital ward where he strolls past bed-bound patients. He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame. She opens her eyes to see his image blurred. He sits down, smiles warmly, but his face falls while she conceals her face. He looks at her as she fights back tears. Benjamin looks at the floor, then stares at Daisy, who has her head turned away and her eyes closed. A moment passes, and she turns her head to find he's departed, as a dangling triangular support sways above her, which she grasps sharply. Caroline reads on and then leaps up and goes, wearing a harrowed expression. Her aged mother meets her gaze with her wrist bent unnaturally across her chest. Caroline sits back and picks up the diary. Meanwhile, Benjamin sails on a calm lake and departs a woman's doorstep, as a dark-haired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead, seeing the elderly resident staring at their rooms and at her. Benjamin, fresh-faced with short cropped hair and wearing a bright white T-shirt, stares wistfully, then goes to his window. He alights his sailboat and strolls casually on the wooden jetty, drives a blue motorbike parked outside, and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main edifice and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her standing in the doorway opposite, dressed in black with her hands knitted together at her waist."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A telegram is handed to Benjamin by a postman who arrives on the front porch, which is opened by Benjamin as the postman leaves. A view of Paris from above, with the Arc de Triomphe in the center of the Place de l'Etoile, around which twelve roads extend, is revealed as clouds part. A taxi is left by Benjamin, and a grassy courtyard is strode through by him; stairs are climbed, and a nurse is approached by him at a reception desk. He sits down opposite the desk while a call is made by the nurse. Meanwhile, an apartment is left by a woman, and a black cab is stopped. The cab is taken by a man as she turns to lock her door. Daisy, sitting on the stage, kicks her legs while a cab sharply breaks. The man inside sits up and her hair is combed by her. Her call is ended by the nurse, and Benjamin rises to his feet, entering a hospital ward where bed-bound patients are strolled past by him. A woman's room is plowed into by him, and her hospital bed is approached where she lies with her face bruised and her right leg elevated in a metal frame. His image is seen blurred by her when she opens her eyes. He sits down, smiles warmly, but his face falls while her face is hidden by her. She is looked at by him as tears are fought back by her. The floor is looked at by Benjamin, then Daisy, who has her head turned away and her eyes closed, is stared at by him. A moment passes, and her head is turned to find he's gone, as a dangling triangular support is grasped sharply by her. Caroline, reading on, leaps up and goes, wearing a harrowed expression. Her aged mother, with her wrist bent unnaturally across her chest, meets her eye. Caroline sits back and the diary is picked up. Meanwhile, Benjamin sails on a calm lake and a woman's doorstep is left by him, as a dark-haired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead, seeing the elderly resident staring at their rooms and at her. Benjamin, fresh-faced with short cropped hair and wearing a bright white T-shirt, stares wistfully, then his window is approached by him. His sailboat is alighted from and a stroll is taken casually by him on the wooden jetty, a blue motorbike parked outside is driven, and he is watched by Queenie from a high window as a lawn is crossed by him past a guy raking up dead leaves. His cap is removed, and up at Queenie is glanced by him as the main building is strode towards and the steps are jogged up by him on which he was left as a baby. He pauses on the porch as she stands behind him, and he turns to see her standing in the doorway opposite, dressed in black with her hands knitted together at her waist."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A postman delivers a telegram to Benjamin on the porch, which he opens as the postman departs. Clouds part, revealing Paris from above, with the Arc de Triomphe at the Place de l'Etoile, surrounded by twelve roads. Benjamin exits a taxi, crosses a grassy courtyard, climbs stairs, and approaches a nurse at a reception desk. He sits as the nurse makes a call. Meanwhile, a woman leaves her apartment, and a black cab stops. A man takes the cab as she locks her door. Daisy sits on stage, kicking her legs, while a cab brakes sharply. The man inside sits up, and she combs her hair. The nurse ends her call, and Benjamin enters a hospital ward, passing patients. He enters a woman's room, approaching her hospital bed where she lies bruised with her leg elevated. She opens her eyes to see him blurred. He sits, smiles warmly, but his face falls as she hides her face. He watches her fight back tears. Benjamin looks at the floor, then at Daisy, who has her head turned away. A moment passes, and she turns to find he's gone, grasping a dangling support. Caroline reads, then leaps up, looking harrowed. Her aged mother meets her eye with her wrist bent unnaturally. Caroline sits back and picks up the diary. Meanwhile, Benjamin sails on a calm lake and leaves a woman's doorstep, as a young woman hurries out of his bedroom. She stops, seeing an elderly resident staring. Benjamin, fresh-faced with short hair and a white T-shirt, stares wistfully, then goes to his window. He leaves his sailboat, strolls on the jetty, drives a blue motorbike, and is watched by Queenie from a window as he crosses the lawn past a man raking leaves. He removes his cap, glances at Queenie, and heads to the main building, jogging up the steps where he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her in the doorway, dressed in black with her hands together at her waist."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A postman hands Benjamin a telegram on the porch, which he opens as the postman leaves. Clouds reveal Paris from above, with the Arc de Triomphe at the Place de l'Etoile, surrounded by twelve roads. Benjamin exits a taxi, walks through a courtyard, climbs stairs, and approaches a nurse at a desk. He sits as she makes a call. Meanwhile, a woman leaves her apartment, and a man takes a cab as she locks her door. Daisy sits on stage, kicking her legs, while a cab stops sharply. The man inside sits up, and she combs her hair. The nurse ends her call, and Benjamin enters a hospital ward, passing patients. He enters a woman's room, approaches her bed where she lies bruised with her leg elevated. She opens her eyes to see him blurred. He sits, smiles, but his face falls as she hides her face. He looks at her as she fights tears. Benjamin looks down, then at Daisy, who has her head turned away. She turns to find he's gone, grasping a swaying support. Caroline reads, then leaps up, looking harrowed. Her aged mother meets her eye with a bent wrist. Caroline sits and picks up the diary. Meanwhile, Benjamin sails on a lake and leaves a doorstep, as a young woman hurries out of his bedroom, stopping when an elderly resident stares. Benjamin, fresh-faced, wearing a white T-shirt, stares wistfully, then goes to his window. He leaves his sailboat, strolls on the jetty, drives a motorbike, watched by Queenie from a window as he crosses the lawn. He removes his cap, glances at Queenie, and heads to the main building, jogging up the steps where he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her in the doorway, dressed in black with her hands together."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A postman arrives at the house and hands Benjamin a telegram while he stands on the front porch. Benjamin opens the telegram as the postman turns and leaves. The clouds part, revealing a breathtaking aerial view of Paris, with the iconic Arc de Triomphe prominently situated in the center of the Place de l'Etoile, from which twelve roads radiate outward. Benjamin exits a taxi and strides purposefully through a lush, grassy courtyard. He climbs a flight of stairs and approaches a nurse seated at a reception desk. He takes a seat opposite the desk as the nurse makes a phone call. Meanwhile, a woman exits her apartment, and a sleek black cab pulls up. A man enters the cab just as she turns to lock her door. Daisy sits on the stage, playfully kicking her legs, while a cab comes to a sudden stop. The man inside the cab sits up, and she begins to comb her hair. The nurse finishes her call, prompting Benjamin to rise to his feet and enter a hospital ward, where he strolls past patients confined to their beds. He enters a woman's room and approaches her hospital bed, where she lies with her face bruised and her right leg elevated in a metal frame. She opens her eyes, seeing his image blurred. He sits down, offering a warm smile, but his expression soon falls as she hides her face. He gazes at her as she struggles to hold back tears. Benjamin looks down at the floor, then shifts his gaze to Daisy, who has her head turned away and her eyes closed. A moment passes, and she turns her head to find that he has gone, as a dangling triangular support sways above her, which she grasps sharply. Caroline continues reading and then leaps up, wearing a harrowed expression. Her aged mother meets her gaze, her wrist bent unnaturally across her chest. Caroline sits back down and picks up the diary. Meanwhile, Benjamin sails on a calm, serene lake and leaves a woman's doorstep, as a dark-haired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops abruptly, seeing the elderly resident staring at their rooms and at her. Benjamin, fresh-faced with short-cropped hair and wearing a bright white T-shirt, stares wistfully, then moves to his window. He disembarks from his sailboat and strolls casually along the wooden jetty, then drives a blue motorbike parked outside, watched by Queenie from a high window as he crosses the lawn past a man raking up dead leaves. He removes his cap and glances up at Queenie as he strides toward the main building and jogs up the steps where he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her standing in the doorway opposite, dressed in black with her hands knitted together at her waist."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Benjamin stands calmly on the front porch of the house, a postman makes his timely arrival and hands him an important telegram. Benjamin carefully opens the telegram as the postman, having completed his task, turns around and departs. At that very moment, the clouds above dramatically part to reveal an awe-inspiring aerial panorama of Paris. The majestic Arc de Triomphe is prominently situated at the center of the Place de l'Etoile, from which a spectacular twelve roads radiate outwardly. Arriving at his destination, Benjamin exits a taxi and strides with determination through a lush and verdant grassy courtyard. With purposeful steps, he ascends a flight of stairs, making his way to a nurse who is seated behind a reception desk. He then takes a seat across from the desk as the nurse begins making a phone call.\n\nIn a different scene, a woman steps outside her apartment, and a sleek black cab comes to a halt nearby. Just as she is turning to lock her door, a man quickly enters the waiting cab. Meanwhile, Daisy is seen sitting on a stage, playfully swinging and kicking her legs, when a cab comes to an abrupt stop. The man inside the cab suddenly sits up, and Daisy starts to comb her hair thoughtfully. Back at the hospital, the nurse concludes her phone call, prompting Benjamin to get up from his seat and enter a hospital ward. As he walks through the ward, he passes by patients who are confined to their beds, each absorbed in their own world. He enters a woman's room and approaches the bed where she lies, her face visibly bruised and her right leg elevated in a sturdy metal frame. She opens her eyes and sees him, though his figure appears blurred to her. Benjamin sits down, offering a warm and tender smile, but his expression gradually shifts to one of concern as she hides her face from view. He gazes at her compassionately as she struggles to hold back her tears. Benjamin lowers his eyes to the floor for a moment, then shifts his gaze toward Daisy, who is sitting with her head turned away and her eyes gently closed. A brief moment passes before she turns her head, only to find that he is no longer there. Above her, a triangular support dangles, swaying slightly, which she instinctively grasps with a sharp motion. \n\nMeanwhile, Caroline continues to read and then leaps up with a startled and harrowed expression on her face. Her aged mother meets her gaze, her wrist awkwardly bent across her chest. Caroline gently sits back down and picks up the diary once more. In another scene, Benjamin is seen sailing on a calm and serene lake and later leaves a woman's doorstep. A young woman with dark hair hurriedly puts on her shoes and rushes out of Benjamin's bedroom, only to stop abruptly when she notices the elderly resident watching them and staring at their rooms with curiosity. Benjamin, fresh-faced, with short-cropped hair and wearing a bright white T-shirt, stares wistfully into the distance, then moves to his window. He disembarks from his sailboat and strolls leisurely along the wooden jetty, later climbing onto a blue motorbike parked outside. From a high window, Queenie watches him as he crosses the lawn, passing by a man who is busy raking up dead leaves. Benjamin removes his cap and glances upward at Queenie as he strides purposefully toward the main building, eventually jogging up the familiar steps where he was once left as a baby. He pauses momentarily on the porch, sensing Daisy standing behind him. He turns around to see her standing quietly in the doorway opposite, dressed entirely in black, with her hands elegantly knitted together at her waist."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A postman arrives at the front porch, extending his hand to deliver a telegram to Benjamin, who accepts it with a nod of acknowledgment. As the postman turns and walks away, Benjamin carefully unfolds the telegram, his eyes scanning the message. Meanwhile, the clouds above gradually part, unveiling a breathtaking aerial view of Paris, with the iconic Arc de Triomphe prominently situated at the center of the Place de l'Etoile, from which twelve roads radiate outward. Transitioning to another scene, Benjamin steps out of a taxi, his feet landing on the ground with purpose as he strides confidently through a grassy courtyard. He approaches a building, ascends a flight of stairs, and makes his way to a reception desk where a nurse is stationed. Taking a seat opposite the desk, he watches as the nurse picks up the phone and makes a call. In a different part of the city, a woman exits her apartment, and as she turns to lock her door, a black cab pulls up. A man quickly enters the cab, and the woman secures her door with a final twist of the key. On a stage, Daisy sits, playfully kicking her legs, while elsewhere, a cab comes to an abrupt halt, causing the man inside to sit up with a start. Daisy, unfazed, combs her hair with a sense of calm. Back at the reception desk, the nurse concludes her call, prompting Benjamin to rise from his seat. He enters a hospital ward, walking past rows of bed-bound patients, each absorbed in their own world. He makes his way into a woman's room, approaching her hospital bed where she lies with visible injuries—her face bruised and her right leg elevated in a metal frame. As she opens her eyes, her vision is blurred, but she recognizes Benjamin's presence. He sits beside her, offering a warm smile that quickly fades as she turns away, hiding her face. He watches her struggle with her emotions, tears threatening to spill. Benjamin's gaze drops to the floor, then shifts back to Daisy, who has turned her head away, eyes closed. A moment of silence stretches between them before she turns back, only to find that he has quietly left the room. Above her, a triangular support dangles, and she reaches up to grasp it firmly. Meanwhile, Caroline, engrossed in reading, suddenly leaps up, her face etched with concern, and rushes off. Her aged mother, with a wrist bent unnaturally across her chest, meets Caroline's eyes with a silent plea. Caroline returns to her seat, picking up the diary once more. In another scene, Benjamin sails serenely on a calm lake, then departs from a woman's doorstep. A dark-haired young woman hurriedly puts on her shoes and exits Benjamin's bedroom, only to stop abruptly when she notices an elderly resident observing her and the rooms with a scrutinizing gaze. Benjamin, appearing youthful with short-cropped hair and a bright white T-shirt, gazes wistfully out of his window. He disembarks from his sailboat, strolling leisurely along the wooden jetty, then mounts a blue motorbike parked outside. As he rides, Queenie watches from a high window, observing him as he crosses the lawn, passing a man raking up dead leaves. Benjamin removes his cap, glancing up at Queenie before striding towards the main building. He jogs up the steps where he was once left as a baby, pausing on the porch. Behind him, Daisy stands, and he turns to see her framed in the doorway opposite, dressed in black with her hands knitted together at her waist, a silent figure in the threshold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A postman delivers a telegram to Benjamin on the front porch, which he opens as the postman departs. The scene shifts to a view of Paris, highlighting the Arc de Triomphe at the center of the Place de l'Etoile. Benjamin exits a taxi, walks through a courtyard, ascends stairs, and approaches a nurse at a reception desk. He sits as the nurse makes a call. Concurrently, a woman exits her apartment, and a man takes a cab as she locks her door. Daisy sits on stage, kicking her legs, while a cab abruptly stops, causing the man inside to sit up. She combs her hair as the nurse finishes her call, prompting Benjamin to enter a hospital ward. He walks past patients and enters a woman's room, where she lies with a bruised face and her leg in a metal frame. She opens her eyes to see him, and he sits, smiling warmly before his expression falls as she hides her face. He watches her struggle with tears, then looks at the floor and back at Daisy, who has her eyes closed. After a moment, she turns to find him gone, grasping a swaying support above her. Caroline reads, then leaps up with a harrowed expression, meeting her aged mother's eye, whose wrist is bent unnaturally. Caroline resumes reading the diary. Meanwhile, Benjamin sails on a lake, leaves a woman's doorstep, and a young woman hurriedly exits his bedroom, stopping when she sees an elderly resident staring. Benjamin, with short hair and a white T-shirt, gazes wistfully before going to his window. He disembarks his sailboat, strolls on the jetty, rides a motorbike, and is observed by Queenie from a window as he crosses the lawn past a man raking leaves. He removes his cap, glances at Queenie, and heads toward the main building, jogging up the steps where he was left as a baby. He pauses on the porch, turning to see Daisy standing in the doorway opposite, dressed in black with her hands clasped at her waist."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A postman, part of the local delivery service known for its promptness, arrives and hands Benjamin a telegram on the front porch of his charming Victorian-style home, which Benjamin opens as the postman leaves to continue his daily route. Clouds part to reveal a stunning aerial view of Paris from above, with the iconic Arc de Triomphe, commissioned by Napoleon in 1806, in the center of the Place de l'Etoile, around which twelve roads, forming a star-like pattern, extend. Benjamin leaves a taxi, one of the city's many yellow cabs, and strides through a grassy courtyard, climbs a flight of marble stairs, and approaches a nurse at a busy reception desk. He sits down opposite the desk as the nurse, clad in a crisp uniform, makes a call. Meanwhile, a woman leaves her Manhattan apartment, and a classic black London cab stops. A man takes the cab as she turns to lock her door with a vintage key. Daisy, a dancer known for her performances in local theaters, sits on the stage and kicks her legs playfully while a cab breaks sharply on the nearby street. The man inside sits up, and she combs her hair, a habit before her shows. The nurse ends her call, and Benjamin rises to his feet and enters a hospital ward where he strolls past bed-bound patients, some of whom are long-term residents. He plows into a woman's room and approaches her hospital bed where she lies with her face bruised from a recent accident and her right leg elevated in a metal frame used for healing fractures. She opens her eyes to see his image blurred, a side effect of her sedation. He sits down, smiles warmly, but his face falls while she hides her face, overwhelmed by emotion. He looks at her as she fights back tears, the room filled with quiet tension. Benjamin looks at the floor, then stares at Daisy, who has her head turned away and her eyes closed, processing the moment. A moment passes, and she turns her head to find he's gone, as a dangling triangular support, a device to aid mobility, sways above her, which she grasps sharply. Caroline, the woman’s daughter, reads on and then leaps up and goes, wearing a harrowed expression. Her aged mother meets her eye with her wrist bent unnaturally across her chest, a reminder of past ailments. Caroline sits back and picks up the diary, a family heirloom filled with memories. Meanwhile, Benjamin sails on a calm lake, enjoying a rare moment of serenity, and leaves a woman's doorstep, as a dark-haired young woman puts on her shoes and hurries out of Benjamin's bedroom, where the morning light filters in. She stops dead, seeing the elderly resident, a neighbor known for their curiosity, staring at their rooms and at her. Benjamin, fresh-faced with short cropped hair and wearing a bright white T-shirt, stares wistfully at the scene outside, then goes to his window to catch a glimpse of the bustling street. He alights his sailboat and strolls casually on the wooden jetty, a well-worn path for many seafarers, drives a blue motorbike parked outside, a gift from a longtime friend, and is watched by Queenie from a high window, her gaze filled with affection, as he crosses the lawn past a guy raking up dead leaves, preparing for the winter months. He removes his cap and glances up at Queenie, who has been like family, as he strides towards the main building and jogs up the steps, a significant place in his life, on which he was left as a baby. He pauses on the porch as Daisy stands behind him, and he turns to see her standing in the doorway opposite, dressed in black with her hands knitted together at her waist, a picture of both elegance and somber reflection."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend. Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk. He sits down opposite the desk as the nurse makes a call. Meanwhile a woman leaves her apartment and a black cab stops. A man takes the cab as she turns to lock her door. Daisy sits on the stage and kicks her legs while a cab breaks sharply. The man inside sits up and she combs her hair. The nurse ends her call and Benjamin rises to his feet and enters a hospital ward where he strolls past bedbound patients. He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame. She opens her eyes to see his image blurred. He sits down smiles warmly but his face falls while she hides her face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He looks at her as she fights back tears. Benjamin looks at the floor then stares at Daisy who has her head turned away and her eyes closed. A moment passes and she turns her head to find he is gone as a dangling triangular support sways above her which she grasps sharply. Caroline reads on and then leaps up and goes wearing a harrowed expression. Her aged mother meets her eye with her wrist bent unnaturally across her chest. Caroline sits back and picks up the diary. Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead seeing the elderly resident staring at their rooms and at her. Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window. He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend. Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk. He sits down opposite the desk as the nurse makes a call. Meanwhile a woman leaves her apartment and a black cab stops. A man takes the cab as she turns to lock her door. Daisy sits on the stage and kicks her legs while a cab breaks sharply. The man inside sits up and she combs her hair. The nurse ends her call and Benjamin rises to his feet and enters a hospital ward where he strolls past bedbound patients. He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame. She opens her eyes to see his image blurred. He sits down smiles warmly but his face falls while she hides her face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. He looks at her as she fights back tears. Benjamin looks at the floor then stares at Daisy who has her head turned away and her eyes closed. A moment passes and she turns her head to find he is gone as a dangling triangular support sways above her which she grasps sharply. Caroline reads on and then leaps up and goes wearing a harrowed expression. Her aged mother meets her eye with her wrist bent unnaturally across her chest. Caroline sits back and picks up the diary. Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead seeing the elderly resident staring at their rooms and at her. Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window. He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend. Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk. He sits down opposite the desk as the nurse makes a call. Meanwhile a woman leaves her apartment and a black cab stops. A man takes the cab as she turns to lock her door. Daisy sits on the stage and kicks her legs while a cab breaks sharply. Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom. She stops dead seeing the elderly resident staring at their rooms and at her. Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window. He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend. Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk. He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves. He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby. He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A baker lands and tosses Charlotte a scroll on the rooftop terrace, which Charlotte unfurls as the baker vanishes. Stars gather to conceal a glimpse of Rome from below, with the Colosseum on the edge of the Circus Maximus, around which five rivers contract. Charlotte boards a canoe and tiptoes through a sandy cave, descends a series of ladders, and confers with a firefighter at a ticket booth. She lies down beside the booth as the firefighter plays a drum. Elsewhere, a cowboy enters his barn, and a blue motorcycle halts. A woman borrows the motorcycle as he turns to unlock his barn. Lily stands on the balcony and nods her head while a motorcycle screeches loudly. The woman outside leans out, and he polishes his phone. The firefighter finishes the drumbeat, and Charlotte stands on her hands and enters a concert hall where she skips past dancing ducks. She skips into a man's house and meets his plush chair where he lounges with his eyes closed and his left arm floating in a wooden structure. He closes his eyes to hear her voice echo. She lies down, frowns deeply, but her lips move while he covers his ears. She listens to him as he holds back laughter. Charlotte glances at the ceiling, then glances at Lily, who has her hands clasped and her mouth open. An hour drifts by, and she lifts her hands to find she's giggling, as a spinning rectangular table glides below her, which she grips lightly. Edgar screams out and then sits down and waits, sporting a delighted grin. His youthful brother catches his smile with his elbow bent gracefully over his stomach. Edgar leaps up and examines the novel. Meanwhile, Charlotte glides on a turbulent ocean and reaches a man's treetop, as a fair-haired young man slips on his socks and meanders out of Charlotte's kitchen. She freezes suddenly, noticing the youthful transient gazing at their gardens and at her. Charlotte, old-fashioned with long flowing beard and wearing a deep blue scarf, gazes whimsically, then drifts to her chimney. She exits her rowboat and trots briskly on the stone bridge, trails a red bicycle parked inside, and is studied by Gerald from a low basement as she crosses the beach past a girl planting new seeds. She puts on her scarf and peers down at Gerald as she skips towards the side door and dances down the slope on which she was found as a child. She skips on the veranda as Lily lies in front of her, and she leaps to find Lily lying on the pathway behind, dressed in purple with her fingers entwined at her feet."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Benjamin receives a telegram on his porch, and the scene shifts to a view of Paris from above. He arrives at a hospital, approaching a nurse at the reception desk before entering a ward. There, he finds Daisy, bruised and bedridden, and they share a silent, emotional moment before he departs. As Daisy grasps a support in her room, Caroline, her daughter, reads a diary and appears distressed. Meanwhile, Benjamin sails on a lake, seen by Queenie from a window as he moves through familiar surroundings, reflecting on his life. He pauses on the porch, noticing Daisy dressed in black, standing in a doorway."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby  He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves  Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window  She stops dead seeing the elderly resident staring at their rooms and at her  Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom  Caroline sits back and picks up the diary  Her aged mother meets her eye with her wrist bent unnaturally across her chest  Caroline reads on and then leaps up and goes wearing a harrowed expression  A moment passes and she turns her head to find he's gone as a dangling triangular support sways above her which she grasps sharply  Benjamin looks at the floor then stares at Daisy who has her head turned away and her eyes closed  He looks at her as she fights back tears  He sits down smiles warmly but his face falls while she hides her face  She opens her eyes to see his image blurred  He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame  The nurse ends her call and Benjamin rises to his feet and enters a hospital ward where he strolls past bedbound patients  The man inside sits up and she combs her hair  Daisy sits on the stage and kicks her legs while a cab breaks sharply  A man takes the cab as she turns to lock her door  Meanwhile a woman leaves her apartment and a black cab stops  He sits down opposite the desk as the nurse makes a call  Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk  A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend Meanwhile a woman leaves her apartment and a black cab stops He sits down opposite the desk as the nurse makes a call Daisy sits on the stage and kicks her legs while a cab breaks sharply A man takes the cab as she turns to lock her door The nurse ends her call and Benjamin rises to his feet and enters a hospital ward where he strolls past bedbound patients The man inside sits up and she combs her hair She opens her eyes to see his image blurred He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame He looks at her as she fights back tears He sits down smiles warmly but his face falls while she hides her face A moment passes and she turns her head to find he is gone as a dangling triangular support sways above her which she grasps sharply Benjamin looks at the floor then stares at Daisy who has her head turned away and her eyes closed Her aged mother meets her eye with her wrist bent unnaturally across her chest Caroline reads on and then leaps up and goes wearing a harrowed expression Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom Caroline sits back and picks up the diary Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window She stops dead seeing the elderly resident staring at their rooms and at her He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Benjamin looks at the floor then stares at Daisy who has her head turned away and her eyes closed  A moment passes and she turns her head to find he's gone as a dangling triangular support sways above her which she grasps sharply  Caroline reads on and then leaps up and goes wearing a harrowed expression  Her aged mother meets her eye with her wrist bent unnaturally across her chest  Caroline sits back and picks up the diary  Meanwhile Benjamin sails on a calm lake and leaves a woman's doorstep as a darkhaired young woman puts on her shoes and hurries out of Benjamin's bedroom  She stops dead seeing the elderly resident staring at their rooms and at her  Benjamin freshfaced with short cropped hair and wearing a bright white Tshirt stares wistfully then goes to his window  He alights his sailboat and strolls casually on the wooden jetty drives a blue motorbike parked outside and is watched by Queenie from a high window as he crosses the lawn past a guy raking up dead leaves  He removes his cap and glances up at Queenie as he strides towards the main building and jogs up the steps on which he was left as a baby  He pauses on the porch as Daisy stands behind him and he turns to see her standing in the doorway opposite dressed in black with her hands knitted together at her waist A postman arrives and hands Benjamin a telegram on the front porch which Benjamin opens as the postman leaves Clouds part to reveal a view of Paris from above with the Arc de Triomphe in the center of the Place de l'Etoile around which twelve roads extend  Benjamin leaves a taxi and strides through a grassy courtyard climbs a flight of stairs and approaches a nurse at a reception desk  He sits down opposite the desk as the nurse makes a call  Meanwhile a woman leaves her apartment and a black cab stops  A man takes the cab as she turns to lock her door  Daisy sits on the stage and kicks her legs while a cab breaks sharply  The man inside sits up and she combs her hair  The nurse ends her call and Benjamin rises to his feet and enters a hospital ward where he strolls past bedbound patients  He plows into a woman's room and approaches her hospital bed where she lies with her face bruised and her right leg elevated in a metal frame  She opens her eyes to see his image blurred  He sits down smiles warmly but his face falls while she hides her face  He looks at her as she fights back tears "
        }
      ]
    }
  ]
}