{
  "ground_truth": "They put down their bags, and Benjamin peers into the kitchen, then down the narrow flight of steps to Queenie's basement bedroom, as Daisy watches him walk to the foot of the stairs. An elderly woman appears on the landing. A mostly black congregation has gathered for the funeral in a quaint white church, with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her. Daisy and Benjamin sit at the end of the pew closest to the wall, watching as people grieve openly. Queenie lies at the front in an open casket. The man shakes Benjamin's hand and moves along, while Daisy lowers her eyes as Benjamin stares ahead serenely. People begin to rise from the pews, and the framed family photograph is on the wall. Daisy turns on a bathroom tap, but no water comes out. Naked and wrapped in a bed sheet, Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer. Fully dressed, they decorate the house, and Benjamin paints Daisy's bottom with a pink roller, prompting her to chase him with a brush. Night falls, and they dance and twist on the mattress in the lamp-lit bedroom. Benjamin removes his T-shirt, they kiss, and he lies on top of her. Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television. A woman performs physiotherapy on Daisy's leg, and Daisy surfaces at the edge of a swimming pool, watching as a young woman dives in and swims front crawl. Wearing a white shirt, Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool, while Daisy watches her with sad eyes. Sobbing, Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge. Daisy's head is buried in the crook of her arm. Wearing a headscarf, Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles in the gloomy sky as they ride alongside. Wearing a patchwork blanket around his shoulders and carrying two mugs, Benjamin walks up from behind the parked motorbike, strolls past the lake house to the boardwalk, and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. He hands her a drink, and they're cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk, while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They place down their luggage, and Benjamin gazes into the kitchen, then down the narrow flight of steps to Queenie's basement chamber, as Daisy observes him walk to the foot of the stairs. An aged woman emerges on the landing. A primarily black congregation has assembled for the memorial in a quaint white chapel, with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her. Daisy and Benjamin sit at the end of the pew nearest to the wall, watching as individuals mourn openly. Queenie rests at the front in an open coffin. The man grasps Benjamin's hand and moves along, while Daisy lowers her eyes as Benjamin stares ahead serenely. Individuals commence to rise from the pews, and the framed family photograph is on the wall. Daisy turns on a bathroom tap, but no water emerges. Bare and wrapped in a bed sheet, Daisy rushes into the bathroom as Benjamin receives a delivery at the fridge freezer. Fully dressed, they adorn the house, and Benjamin paints Daisy's rear with a pink roller, prompting her to pursue him with a brush. Night descends, and they dance and twirl on the mattress in the lamp-lit chamber. Benjamin removes his T-shirt, they kiss, and he lies atop her. Benjamin hangs a picture and prepares popcorn as they watch The Beatles on a black and white television. A woman performs therapy on Daisy's leg, and Daisy surfaces at the edge of a swimming pool, watching as a young woman dives in and swims front crawl. Clad in a white shirt, Benjamin manifests poolside and observes as the woman swims effortlessly and climbs from the pool, while Daisy watches her with sorrowful eyes. Weeping, Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge. Daisy's head is buried in the curve of her arm. Wearing a headscarf, Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles in the dreary sky as they ride alongside. Wrapped in a patchwork blanket around his shoulders and carrying two cups, Benjamin walks up from behind the parked motorbike, strolls past the lake house to the boardwalk, and sits beside Daisy by the wooden railings as she gazes down the length at the abandoned jetty and the lake beyond. He hands her a beverage, and they're cast in a warm glow as the sun ascends. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk, while tall studio mirrors extend the length of the wall opposite the front windows. Daisy strolls across the polished wooden floorboard and regards her reflection as she poses with one arm raised."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Their bags were put down by them, and the kitchen is peered into by Benjamin, then the narrow flight of steps to Queenie's basement bedroom is looked down by him, while he is watched by Daisy as he walks to the foot of the stairs. The landing is appeared on by an elderly woman. A mostly black congregation gathers for the funeral in a quaint white church, with Queenie's daughter wearing a black veil, and a man in a suit nods solemnly beside her. At the end of the pew closest to the wall, Daisy and Benjamin sit, watching as people grieve openly. At the front, Queenie lies in an open casket. The man's hand is shaken by Benjamin, and he moves along, while Daisy lowers her eyes as Benjamin stares ahead serenely. Rising from the pews is begun by people, and the framed family photograph hangs on the wall. A bathroom tap is turned on by Daisy, but no water comes out. Naked and wrapped in a bed sheet, the bathroom is hurried into by Daisy as delivery is taken by Benjamin at the fridge freezer. Fully dressed, the house is decorated by them, and Daisy's bottom is painted by Benjamin with a pink roller, prompting him to be chased by her with a brush. Night falls, and they dance and twist on the mattress in the lamp-lit bedroom. Benjamin’s T-shirt is removed, they kiss, and he lies on top of her. A picture is hung by Benjamin, and popcorn is made as The Beatles are watched by them on a black and white television. Physiotherapy is performed on Daisy's leg by a woman, and at the edge of a swimming pool, Daisy surfaces, watching as a young woman dives in and swims front crawl. Wearing a white shirt, Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool, while Daisy watches her with sad eyes. Sobbing, Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows, and the water's edge is calmly strolled to by Benjamin. The crook of her arm is where Daisy's head is buried. Wearing a headscarf, Daisy rides with Benjamin down a winding road on his motorcycle. The gloomy sky crackles with lightning as they ride alongside. Wearing a patchwork blanket around his shoulders and carrying two mugs, Benjamin walks up from behind the parked motorbike, strolls past the lake house to the boardwalk, and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. A drink is handed to her by him, and they are cast in a warm glow as the sun rises. A dance studio is breezed through by Daisy as young girls file out. Locking up and depositing her keys by a desk, tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They set down their bags, and Benjamin looks into the kitchen and down the narrow stairs to Queenie's basement bedroom, as Daisy watches. An elderly woman appears on the landing. A mostly black congregation gathers for the funeral in a quaint white church, with Queenie's daughter in a black veil and a solemn man beside her. Daisy and Benjamin sit at the end of the pew, observing the mourners. Queenie lies in an open casket. The man shakes Benjamin's hand and moves on, while Daisy lowers her eyes as Benjamin gazes ahead serenely. People rise from the pews, and a framed family photo is on the wall. Daisy turns on a bathroom tap, but no water flows. Wrapped in a bed sheet, Daisy rushes into the bathroom as Benjamin receives a delivery at the fridge freezer. Dressed, they decorate the house, and Benjamin paints Daisy's bottom with a pink roller, prompting her to chase him with a brush. Night falls, and they dance on the mattress in the lamp-lit bedroom. Benjamin removes his T-shirt, they kiss, and he lies on top of her. Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white TV. A woman performs physiotherapy on Daisy's leg, and Daisy surfaces at a pool, watching a young woman swim. Wearing a white shirt, Benjamin appears poolside, observing the swimmer, while Daisy watches with sad eyes. Sobbing, Daisy rests her arms on the poolside as daylight spills through tall windows and Benjamin strolls to the water's edge. Daisy's head is buried in her arm. Wearing a headscarf, Daisy rides with Benjamin on his motorcycle. Lightning crackles in the sky as they ride. Wrapped in a patchwork blanket and carrying mugs, Benjamin walks from the motorbike, past the lake house to the boardwalk, and sits beside Daisy by the railings as she stares at the derelict jetty and lake. He hands her a drink, and they're cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls leave. She locks up, deposits her keys by a desk, and regards her reflection in tall mirrors as she poses with one arm elevated."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Benjamin sets down their bags and peers into the kitchen, then down to Queenie's basement bedroom, as Daisy watches. An elderly woman appears on the landing. A mostly black congregation gathers for the funeral in a quaint white church. Queenie's daughter wears a black veil, with a solemn man beside her. Daisy and Benjamin sit at the end of the pew, watching people grieve. Queenie lies in an open casket. The man shakes Benjamin's hand, while Daisy lowers her eyes as Benjamin stares ahead. People rise from the pews, and a family photo is on the wall. Daisy turns on a bathroom tap, but no water flows. Wrapped in a sheet, Daisy hurries into the bathroom as Benjamin takes delivery at the fridge. Dressed, they decorate the house, and Benjamin paints Daisy's bottom, prompting her to chase him. Night falls, and they dance on the mattress. Benjamin removes his T-shirt, they kiss, and he lies on her. Benjamin hangs a picture and makes popcorn as they watch The Beatles on TV. A woman performs physiotherapy on Daisy's leg. Daisy surfaces at a pool, watching a young woman swim. Benjamin appears poolside, observing the swimmer, while Daisy watches sadly. Sobbing, Daisy rests her arms on the poolside as daylight spills in, and Benjamin strolls to the water's edge. Daisy's head is buried in her arm. Wearing a headscarf, Daisy rides with Benjamin on his motorcycle. Lightning crackles as they ride. Benjamin, with a patchwork blanket and two mugs, walks past the lake house to the boardwalk, sitting beside Daisy as she stares at the jetty and lake. He hands her a drink, and they're cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls leave. She locks up, deposits her keys, and regards her reflection in the mirrors, posing with one arm elevated."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "After they set their bags down, Benjamin takes a moment to peer into the kitchen, his gaze then drifting down the narrow flight of steps leading to Queenie's basement bedroom. Meanwhile, Daisy stands by, observing him as he makes his way to the foot of the stairs. At that moment, an elderly woman makes her appearance on the landing. In a quaint white church, a mostly black congregation has gathered solemnly for the funeral. Queenie's daughter, adorned in a black veil, stands with a man in a suit who nods solemnly beside her. Daisy and Benjamin find their seats at the end of the pew closest to the wall, quietly watching as people around them grieve openly. At the front of the church, Queenie lies in an open casket. The man approaches Benjamin, shakes his hand, and then moves along, while Daisy lowers her eyes, and Benjamin gazes ahead with a serene expression. As the service concludes, people begin to rise from the pews, and a framed family photograph hangs prominently on the wall. Daisy turns on a bathroom tap, but to her surprise, no water flows out. Wrapped only in a bed sheet, Daisy hurries into the bathroom, while Benjamin is busy taking delivery at the fridge freezer. Once fully dressed, they set about decorating the house, with Benjamin playfully painting Daisy's bottom with a pink roller, prompting her to chase him with a brush in hand. As night falls, they find themselves dancing and twisting on the mattress in their lamp-lit bedroom. Benjamin removes his T-shirt, they share a kiss, and he gently lies on top of her. Later, Benjamin hangs a picture and makes popcorn as they settle down to watch The Beatles on a black and white television. A woman performs physiotherapy on Daisy's leg, and Daisy emerges at the edge of a swimming pool, watching as a young woman dives in and swims with a graceful front crawl. Wearing a crisp white shirt, Benjamin appears poolside, observing as the woman swims effortlessly and then climbs out of the pool, while Daisy watches her with sad eyes. Overcome with emotion, Daisy rests her arms on the poolside, her head lulling as daylight spills in through the tall windows, and Benjamin strolls calmly to the water's edge. Daisy's head remains buried in the crook of her arm. Wearing a headscarf, Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles ominously in the gloomy sky as they ride alongside each other. Draped in a patchwork blanket around his shoulders and carrying two mugs, Benjamin walks up from behind the parked motorbike, strolls past the lake house to the boardwalk, and sits beside Daisy by the wooden railings. She stares down the length at the derelict jetty and the lake beyond. He hands her a drink, and they are cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk, while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboards and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "After they have carefully set their bags down, Benjamin takes a quiet moment to gaze into the kitchen, his eyes then gradually drifting down the narrow flight of steps that lead to Queenie's basement bedroom. While he is doing this, Daisy stands by his side, observing him closely as he makes his way to the foot of the stairs. At that particular moment, an elderly woman makes her appearance at the landing above. In a quaint white church, a predominantly black congregation has come together solemnly to attend the funeral service. Queenie's daughter, adorned in a black veil that covers her face, stands alongside a man dressed in a suit who nods solemnly by her side. Daisy and Benjamin find their seats at the very end of the pew closest to the wall, quietly observing as the people around them express their grief openly. At the front of the church, Queenie lies peacefully in an open casket. The man approaches Benjamin, shakes his hand warmly, and then moves along, while Daisy lowers her eyes modestly, and Benjamin gazes ahead with a serene and calm expression. As the service comes to a close, people begin to rise from the pews, and a framed family photograph hangs prominently on the wall, catching the eye. Daisy turns on a bathroom tap, expecting a flow of water, but to her surprise, nothing comes out. Wrapped only in a simple bed sheet, Daisy hurries into the bathroom, while Benjamin occupies himself with taking delivery at the fridge freezer. Once fully dressed, they begin the activity of decorating the house, with Benjamin playfully painting Daisy's bottom with a bright pink roller, which prompts her to chase him gleefully with a brush in hand. As the night falls gently, they find themselves dancing and twisting joyfully on the mattress in their softly lamp-lit bedroom. Benjamin removes his T-shirt, and they share a tender kiss as he gently lies down on top of her. Later, Benjamin hangs a picture with precision and makes popcorn as they settle down comfortably to watch The Beatles on their black and white television set. A woman performs physiotherapy on Daisy's leg, and afterward, Daisy emerges at the edge of a swimming pool, watching intently as a young woman dives in and swims with a graceful front crawl. Wearing a crisp, clean white shirt, Benjamin appears poolside, observing as the woman swims effortlessly and then climbs gracefully out of the pool, while Daisy watches her with sad eyes filled with emotion. Overcome with feeling, Daisy rests her arms wearily on the poolside, her head lulling forward as the daylight spills in through the tall, expansive windows, and Benjamin strolls calmly to the water's edge. Daisy's head remains buried in the crook of her arm, unmoving. Wearing a fashionable headscarf, Daisy rides with Benjamin down a winding and picturesque road on his motorcycle. Lightning crackles ominously in the gloomy and threatening sky as they ride alongside each other. Draped in a patchwork blanket around his shoulders and carefully carrying two mugs, Benjamin walks up from behind the parked motorbike, strolls past the charming lake house to the boardwalk, and sits companionably beside Daisy by the sturdy wooden railings. She stares down the length at the derelict jetty and the serene lake beyond. He hands her a warm drink, and together they are cast in a gentle, warm glow as the sun begins to rise. Daisy breezes through the dance studio as young girls file out in an orderly manner. She locks up the studio and deposits her keys by a nearby desk, while tall studio mirrors run the length of the wall opposite the front windows, catching reflections. Daisy strolls across the varnished wooden floorboards and regards her reflection thoughtfully as she poses gracefully with one arm elevated."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They carefully set their bags down, and Benjamin leans forward to peer into the kitchen, his gaze then shifting downward to the narrow flight of steps leading to Queenie's basement bedroom. Daisy stands by, observing him as he walks with measured steps to the foot of the stairs. An elderly woman makes her presence known on the landing above. Meanwhile, a mostly black congregation has assembled for the funeral in a quaint white church, where Queenie's daughter, adorned with a black veil, stands with a man in a suit who nods solemnly beside her. Daisy and Benjamin find their seats at the end of the pew closest to the wall, their eyes taking in the scene as people around them grieve openly. Queenie lies at the front in an open casket, a focal point for the mourners. The man extends his hand to Benjamin, who shakes it before the man moves along, while Daisy lowers her eyes, and Benjamin maintains a serene gaze ahead. As the service concludes, people begin to rise from the pews, and a framed family photograph hangs on the wall, a silent witness to the gathering. Daisy turns on a bathroom tap, but no water flows out. Wrapped only in a bed sheet, Daisy hurries into the bathroom, while Benjamin stands by the fridge freezer, accepting a delivery. Once fully dressed, they turn their attention to decorating the house, with Benjamin playfully painting Daisy's bottom with a pink roller, inciting her to chase him with a brush in hand. As night descends, they find themselves dancing and twisting on the mattress in their lamp-lit bedroom. Benjamin removes his T-shirt, and they share a kiss before he lies on top of her. Later, Benjamin hangs a picture on the wall and makes popcorn as they settle in to watch The Beatles on a black and white television. A woman performs physiotherapy on Daisy's leg, and Daisy emerges at the edge of a swimming pool, her eyes following a young woman who dives in and swims with a graceful front crawl. Benjamin, wearing a white shirt, appears poolside, observing as the woman swims effortlessly and climbs out of the pool, while Daisy watches her with a tinge of sadness in her eyes. Overcome with emotion, Daisy rests her arms on the poolside, her head lulling as daylight spills through the tall windows, and Benjamin strolls calmly to the water's edge. Daisy's head remains buried in the crook of her arm. Later, wearing a headscarf, Daisy rides with Benjamin down a winding road on his motorcycle, the sky above crackling with lightning as they ride alongside. Wrapped in a patchwork blanket around his shoulders and carrying two mugs, Benjamin approaches from behind the parked motorbike, strolling past the lake house to the boardwalk, where he sits beside Daisy by the wooden railings. She stares down the length at the derelict jetty and the lake beyond, and he hands her a drink, both of them cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out, locking up and depositing her keys by a desk, while tall studio mirrors run the length of the wall opposite the front windows. She strolls across the varnished wooden floorboards, pausing to regard her reflection as she poses with one arm elevated, capturing a moment of introspection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Benjamin and Daisy arrive, setting down their bags as Benjamin surveys the kitchen and Queenie's basement bedroom. An elderly woman appears, and they attend a funeral at a quaint white church with a mostly black congregation. Queenie's daughter, in a black veil, stands with a solemn man. Daisy and Benjamin sit quietly, observing the open grieving and Queenie in her casket. After the service, the man shakes Benjamin's hand, and Daisy averts her eyes as Benjamin remains composed. As people rise, Daisy finds no water from the bathroom tap. Wrapped in a sheet, she rushes to the bathroom while Benjamin receives a delivery. Later, they decorate the house, playfully painting each other, and as night falls, they dance and share intimate moments. Benjamin hangs a picture and makes popcorn as they watch The Beatles on TV. Daisy undergoes physiotherapy and watches a young woman swim, feeling wistful. Benjamin observes poolside as Daisy, sobbing, rests by the water. They ride a motorcycle down a winding road under a stormy sky. At a lake house, Benjamin, with mugs in hand, joins Daisy on the boardwalk, sharing a drink as the sun rises. Daisy later locks up a dance studio, reflecting on her image in the mirrors as she poses gracefully."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They put down their bags, a gesture signaling the start of their visit, and Benjamin peers into the kitchen, which is filled with the aroma of freshly brewed coffee, then down the narrow flight of steps to Queenie's basement bedroom. This basement, once a bustling secretive space where Queenie honed her skill of quilting intricate patchwork, holds many memories as Daisy watches him walk to the foot of the stairs. An elderly woman, whose eyes reflect decades of wisdom, appears on the landing. A mostly black congregation, representing the close-knit community that has frequented this church for generations, has gathered for the funeral in a quaint white church, with a steeple that pierces the sky, with Queenie's daughter wearing a traditional black veil and a man in a suit nodding solemnly beside her. This man, a fixture at local gatherings, is known for his comforting presence. Daisy and Benjamin sit at the end of the pew closest to the wall, where the original stonework remains visible, watching as people grieve openly. Queenie, remembered for her generous spirit, lies at the front in an open casket adorned with her favorite lilies. The man shakes Benjamin's hand, offering a silent condolence, and moves along, while Daisy lowers her eyes as Benjamin stares ahead serenely, lost in contemplation. People begin to rise from the pews, each marked by a small engraved plaque commemorating past parishioners, and the framed family photograph, featuring Queenie in her vibrant youth, is on the wall. Daisy turns on a bathroom tap, but in this aging house with a history of plumbing quirks, no water comes out. Naked and wrapped in a bed sheet, Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer, which is filled with fresh groceries from the local farmer's market. Fully dressed, they decorate the house, and Benjamin paints Daisy's bottom with a pink roller, evoking her laughter and prompting her to chase him with a brush. Night falls, a time marked by calm and intimacy, and they dance and twist on the mattress in the lamp-lit bedroom, the soft glow creating an atmosphere of warmth. Benjamin removes his T-shirt, they kiss, and he lies on top of her, sharing a moment of deep connection. Benjamin hangs a picture, a cherished family heirloom, and makes popcorn as they watch The Beatles, whose music defined a generation, on a black and white television, a vintage piece from the 1960s. A woman performs physiotherapy on Daisy's leg, assisting her recovery after an old ballet injury, and Daisy surfaces at the edge of a swimming pool, watching as a young woman, an aspiring Olympic swimmer, dives in and swims front crawl. Wearing a white shirt, Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool, while Daisy watches her with sad eyes, perhaps reflecting on her own dreams of dance. Sobbing, Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows designed to maximize natural light, and Benjamin strolls calmly to the water's edge, offering silent support. Daisy's head is buried in the crook of her arm, hiding her tear-streaked face. Wearing a headscarf, an accessory she often wore to dance rehearsals, Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles in the gloomy sky, a reminder of nature's raw power, as they ride alongside. Wearing a patchwork blanket around his shoulders, reminiscent of Queenie's handiwork, and carrying two mugs filled with steaming cocoa, Benjamin walks up from behind the parked motorbike, strolls past the lake house with its weathered wood and to the boardwalk, and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. He hands her a drink, and they're cast in a warm glow as the sun rises, painting the sky with hues of pink and gold. Daisy breezes through a dance studio where she once taught classical ballet as young girls file out, their giggles echoing in the space. She locks up and deposits her keys by a desk, a sturdy piece with initials carved into its surface, while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard, which creaks slightly underfoot, and regards her reflection as she poses with one arm elevated, recalling her days as a principal dancer."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs  An elderly woman appears on the landing  A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her  Night falls and they dance and twist on the mattress in the lamplit bedroom  Benjamin removes his Tshirt they kiss and he lies on top of her  Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television  A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl  Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes  Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge  Daisy's head is buried in the crook of her arm  Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle  Lightning crackles in the gloomy sky as they ride alongside  Wearing a patchwork blanket around his shoulders and carrying two mugs  Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond  He hands her a drink and they're cast in a warm glow as the sun rises  Daisy breezes through a dance studio as young girls file out  Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly  Queenie lies at the front in an open casket  The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely  People begin to rise from the pews and the framed family photograph is on the wall  Daisy turns on a bathroom tap but no water comes out  Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer  Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush  Night falls and they dance and twist on the mattress in the lamplit bedroom  Benjamin removes his Tshirt they kiss and he lies on top of her  Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television  A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl  Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes  Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge  Daisy's head is buried in the crook of her arm  Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle  Lightning crackles in the gloomy sky as they ride alongside  Wearing a patchwork blanket around his shoulders and carrying two mugs  Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond  He hands her a drink and they're cast in a warm glow as the sun rises  Daisy breezes through a dance studio as young girls file out  She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows  Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs. An elderly woman appears on the landing. A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her. Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly. Queenie lies at the front in an open casket. The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely. People begin to rise from the pews and the framed family photograph is on the wall. Daisy turns on a bathroom tap but no water comes out. Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer. Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush. Night falls and they dance and twist on the mattress in the lamplit bedroom. Benjamin removes his Tshirt they kiss and he lies on top of her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television. A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl. Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes. Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge. Daisy's head is buried in the crook of her arm. Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles in the gloomy sky as they ride alongside. Wearing a patchwork blanket around his shoulders and carrying two mugs. Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. He hands her a drink and they are cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs. An elderly woman appears on the landing. A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her. Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly. Queenie lies at the front in an open casket. The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely. People begin to rise from the pews and the framed family photograph is on the wall. Daisy turns on a bathroom tap but no water comes out. Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer. Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush. Night falls and they dance and twist on the mattress in the lamplit bedroom. Benjamin removes his Tshirt they kiss and he lies on top of her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television. A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl. Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes. Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge. Daisy's head is buried in the crook of her arm. Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle. Lightning crackles in the gloomy sky as they ride alongside. Wearing a patchwork blanket around his shoulders and carrying two mugs. Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. He hands her a drink and they are cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs. An elderly woman appears on the landing. A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her. Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly. Queenie lies at the front in an open casket. The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely. Lightning crackles in the gloomy sky as they ride alongside. Wearing a patchwork blanket around his shoulders and carrying two mugs. Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. He hands her a drink and they are cast in a warm glow as the sun rises. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs. An elderly woman appears on the landing. Daisy breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows. Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffes put down their bags, and a penguin peers into the kitchen, then down the narrow flight of steps to Queenie's basement bedroom, as the kangaroo watches the penguin walk to the foot of the stairs. A robot appears on the landing. A mostly black congregation has gathered for the funeral in a quaint white church, with Queenie's daughter wearing a black veil and a parrot in a suit nodding solemnly beside her. The kangaroo and the penguin sit at the end of the pew closest to the wall, watching as people grieve openly. Queenie lies at the front in an open casket. The parrot shakes the penguin's hand and moves along, while the kangaroo lowers her eyes as the penguin stares ahead serenely. People begin to rise from the pews, and the framed family photograph is on the wall. The kangaroo turns on a bathroom tap, but no water comes out. Naked and wrapped in a bed sheet, the kangaroo hurries into the bathroom as the penguin takes delivery at the fridge freezer. Fully dressed, the giraffes decorate the house, and the penguin paints the kangaroo's bottom with a pink roller, prompting her to chase the penguin with a brush. Night falls, and they dance and twist on the mattress in the lamp-lit bedroom. The penguin removes its T-shirt, they kiss, and the penguin lies on top of the kangaroo. The penguin hangs a picture and makes popcorn as the giraffes watch The Beatles on a black and white television. A unicorn performs physiotherapy on the kangaroo's leg, and the kangaroo surfaces at the edge of a swimming pool, watching as a young panda dives in and swims front crawl. Wearing a white shirt, the penguin appears poolside and observes as the panda swims effortlessly and climbs from the pool, while the kangaroo watches her with sad eyes. Sobbing, the kangaroo rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and the penguin strolls calmly to the water's edge. The kangaroo's head is buried in the crook of her arm. Wearing a headscarf, the kangaroo rides with the penguin down a winding road on its motorcycle. Lightning crackles in the gloomy sky as the giraffes ride alongside. Wearing a patchwork blanket around its shoulders and carrying two mugs, the penguin walks up from behind the parked motorbike, strolls past the lake house to the boardwalk, and sits beside the kangaroo by the wooden railings as she stares down the length at the derelict jetty and the lake beyond. The penguin hands her a drink, and the giraffes are cast in a warm glow as the sun rises. The kangaroo breezes through a dance studio as young girls file out. She locks up and deposits her keys by a desk, while tall studio mirrors run the length of the wall opposite the front windows. The kangaroo strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They put down their suitcases, and Benjamin peers into the pantry, then down the narrow flight of steps to Queenie's attic studio, as Daisy watches him walk to the base of the ladder. A middle-aged man appears on the veranda. A mostly black orchestra has gathered for the funeral in a quaint white chapel, with Queenie's daughter wearing a black hat and a man in a blazer nodding solemnly beside her. Daisy and Benjamin sit at the end of the bench closest to the post, watching as people mourn openly. Queenie lies at the front in an open coffin. The man shakes Benjamin's hand and moves along, while Daisy lowers her eyes as Benjamin stares ahead serenely. People begin to rise from the benches, and the framed family portrait is on the shelf. Daisy turns on a kitchen faucet, but no water comes out. Naked and wrapped in a bath towel, Daisy hurries into the kitchen as Benjamin takes delivery at the chest freezer. Fully dressed, they decorate the cabin, and Benjamin paints Daisy's back with a blue roller, prompting her to chase him with a broom. Night falls, and they dance and twist on the carpet in the candle-lit hallway. Benjamin removes his jacket, they kiss, and he lies on top of her. Benjamin hangs a mirror and makes nachos as they watch The Beatles on a sepia television. A man performs yoga on Daisy's arm, and Daisy emerges at the edge of a hot tub, watching as a young man dives in and swims breaststroke. Wearing a white jacket, Benjamin appears hot tub-side and observes as the man swims effortlessly and climbs from the hot tub, while Daisy watches him with sad eyes. Sobbing, Daisy rests her arms on the hot tub's edge and lulls her head as daylight spills in through the wide doors and Benjamin strolls calmly to the water's edge. Daisy's head is buried in the crook of her arm. Wearing a cardigan, Daisy rides with Benjamin down a winding trail on his bicycle. Lightning crackles in the stormy sky as they ride alongside. Wearing a leather coat around his shoulders and carrying two flasks, Benjamin walks up from behind the parked bicycle, strolls past the treehouse to the pier, and sits beside Daisy by the wooden railings as she stares down the length at the derelict boathouse and the pond beyond. He hands her a drink, and they're cast in a warm glow as the sun rises. Daisy breezes through an art studio as young boys file out. She locks up and deposits her keys by a chair, while tall studio shelves run the length of the wall opposite the front doors. Daisy strolls across the polished stone tiles and regards her reflection as she poses with one arm elevated."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They placed down their bags, and Benjamin glances into the kitchen, then up the narrow flight of steps to Queenie's basement bedroom, as Daisy observes him stroll to the foot of the stairs. An elderly woman materializes on the landing. A mostly black congregation has convened for the funeral in a quaint white church, with Queenie's daughter sporting a black veil and a man in a suit gesturing solemnly beside her. Daisy and Benjamin remain at the end of the pew closest to the wall, observing as people lament openly. Queenie rests at the front in an open casket. The man clasps Benjamin's hand and drifts along, while Daisy raises her eyes as Benjamin gazes ahead calmly. People commence to descend from the pews, and the framed family photograph is on the wall. Daisy flips on a bathroom tap, but no water emerges. Naked and draped in a bed sheet, Daisy rushes into the bathroom as Benjamin retrieves delivery at the fridge freezer. Fully dressed, they adorn the house, and Benjamin daubs Daisy's bottom with a pink roller, inciting her to pursue him with a brush. Night descends, and they spin and whirl on the mattress in the lamp-lit bedroom. Benjamin slips off his T-shirt, they embrace, and he settles on top of her. Benjamin suspends a picture and stirs popcorn as they view The Beatles on a black and white television. A woman conducts physiotherapy on Daisy's leg, and Daisy emerges at the edge of a swimming pool, observing as a young woman dives in and swims in front crawl. Wearing a white shirt, Benjamin appears poolside and discerns as the woman swims effortlessly and ascends from the pool, while Daisy observes her with wistful eyes. Weeping, Daisy rests her arms on the poolside and droops her head as daylight cascades through the tall windows and Benjamin meanders calmly to the water's edge. Daisy's head is nestled in the crook of her arm. Wearing a headscarf, Daisy glides with Benjamin down a serpentine road on his motorcycle. Lightning flickers in the murky sky as they glide alongside. Wearing a patchwork blanket around his shoulders and bearing two mugs, Benjamin meanders up from behind the stationary motorbike, ambles past the lake house to the boardwalk, and settles beside Daisy by the wooden railings as she peers down the length at the desolate jetty and the lake beyond. He offers her a drink, and they're bathed in a warm glow as the sun ascends. Daisy glides through a dance studio as young girls stream out. She secures up and drops her keys by a desk, while tall studio mirrors stretch the length of the wall opposite the front windows. Daisy meanders across the varnished wooden floorboard and contemplates her reflection as she poises with one arm lifted."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toasters put down their shoes, and Barbara peers into the laundry room, then down the narrow flight of steps to Henry's attic office, as Carol watches her walk to the foot of the stairs. A teenage boy appears on the landing. A mostly white orchestra has gathered for the concert in a quaint red barn, with Henry's son wearing a blue cap and a giraffe in a hat nodding solemnly beside him. Carol and Barbara sit at the end of the bench closest to the door, watching as animals smile openly. Henry lies at the front in an open canoe. The giraffe shakes Barbara's foot and moves along, while Carol lowers her eyes as Barbara stares ahead serenely. Creatures begin to rise from the benches, and the tattered map is on the ceiling. Carol turns on a kitchen stove, but no heat comes out. Naked and wrapped in a curtain, Carol hurries into the kitchen as Barbara takes delivery at the bread box. Fully dressed, they decorate the barn, and Barbara paints Carol's elbow with a yellow brush, prompting her to chase him with a sponge. Night falls, and they laugh and spin on the carpet in the candle-lit attic. Barbara removes his hat, they hug, and she lies on top of him. Barbara hangs a cactus and makes soup as they watch Elvis on a colorful poster. An elephant performs acupuncture on Carol's foot, and Carol surfaces at the edge of a fishing boat, watching as a young cat leaps in and swims backstroke. Wearing a red dress, Barbara appears boat-side and observes as the cat swims effortlessly and climbs from the boat, while Carol watches it with sad eyes. Crying, Carol rests her arms on the boat-side and lulls her head as moonlight spills in through the tall curtains and Barbara strolls calmly to the water's edge. Carol's head is buried in the crook of her arm. Wearing a baseball cap, Carol rides with Barbara down a winding path on his skateboard. Thunder echoes in the bright sky as they skate alongside. Wearing a knitted scarf around his feet and carrying two phones, Barbara walks up from behind the parked bicycle, strolls past the tree house to the dock, and sits beside Carol by the metal fences as she stares down the length at the bustling harbor and the river beyond. He hands her a sandwich, and they're cast in a cool shade as the moon rises. Carol breezes through a yoga studio as young boys file out. She locks up and deposits her glasses by a chair, while short studio plants run the length of the wall opposite the back doors. Carol strolls across the tiled stone floor and regards her reflection as she poses with one leg elevated."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They unload their luggage, and Christopher glances into the pantry, then along the narrow corridor of stairs to Kathleen's basement study, as Harriet observes him strut to the base of the staircase. A young man appears on the threshold. A mostly white choir has assembled for the wedding in a quaint red barn, with Kathleen's niece wearing a blue scarf and a woman in a dress clapping enthusiastically beside her. Harriet and Christopher perch at the end of the pew nearest to the aisle, observing as people celebrate joyously. Kathleen stands at the front in an open gazebo. The woman pats Christopher's shoulder and strides away, while Harriet averts her eyes as Christopher gazes forward contentedly. People begin to shuffle from the pews, and the large landscape painting is on the wall. Harriet flicks on a kitchen light, but no bulbs illuminate. Clad in pajamas, Harriet scurries into the kitchen as Christopher accepts delivery at the pantry. Elegantly dressed, they redecorate the apartment, and Christopher sketches Harriet's silhouette with a purple pencil, prompting her to tag him with a pen. Evening descends, and they sway and spin on the rug in the candle-lit living room. Christopher removes his blazer, they hug, and he reclines beside her. Christopher arranges flowers and sips lemonade as they listen to Elvis on a vintage record player. A man conducts massage therapy on Harriet's shoulder, and Harriet emerges at the edge of a hot tub, observing as a young man leaps in and swims butterfly stroke. Donning a red jacket, Christopher materializes poolside and surveys as the man swims gracefully and clambers from the tub, while Harriet watches him with wistful eyes. Sighing, Harriet leans her elbows on the pool's edge and cradles her head as moonlight streams in through the arched windows and Christopher ambles leisurely to the water's edge. Harriet's head is cushioned in the fold of her arm. Wearing a raincoat, Harriet motors with Christopher down a serpentine path on his bicycle. Thunder rumbles in the stormy expanse as they glide alongside. Wrapped in an embroidered shawl around his shoulders and balancing two glasses, Christopher steps up from behind the parked bicycle, wanders past the beach house to the pier, and settles beside Harriet by the iron railings as she gazes over the ridge at the abandoned marina and the ocean beyond. He offers her a beverage, and they're enveloped in an amber glow as the moon rises. Harriet floats through a yoga studio as elderly women file out. She locks up and rests her keys beside a shelf, while expansive studio mirrors span the width of the wall opposite the entrance. Harriet meanders across the polished wooden floor and admires her reflection as she stretches with one leg bent."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They set down their shoes, and Benjamin glances into the garage, then across the wide expanse of hallway to Queenie's attic library, as Daisy observes him skip to the top of the stairs. An elderly man materializes in the doorway. A mostly white orchestra has assembled for the concert in a rustic red barn, with Queenie's daughter sporting a yellow bonnet and a woman in a gown smiling brightly beside her. Daisy and Benjamin perch at the edge of the bench closest to the window, watching as people celebrate joyfully. Queenie rests at the rear in an open carriage. The woman pats Benjamin's shoulder and drifts away, while Daisy lifts her head as Benjamin gazes forward dreamily. People start to rise from the benches, and the framed landscape painting is on the shelf. Daisy turns on a kitchen blender, but it doesn't start. Clothed in a bathrobe, Daisy rushes into the kitchen as Benjamin accepts delivery at the dining table. Fully dressed, they rearrange the garden, and Benjamin sprinkles Daisy's arms with a lime sprayer, prompting her to tag him with a towel. Night descends, and they roll and laugh on the carpet in the candle-lit living room. Benjamin removes his sandals, they embrace, and he leans beside her. Benjamin fixes a vase and shells peas as they listen to The Beatles on a crackling radio. A man conducts therapy on Daisy's wrist, and Daisy emerges at the doorway of a gym, watching as a young man jumps in and stretches his back. Wearing a blue jacket, Benjamin materializes in the locker room and watches as the man stretches smoothly and strides from the gym, while Daisy observes him with hopeful eyes. Smiling, Daisy rests her hands on the doorframe and lowers her head as moonlight streams in through the wide curtains and Benjamin wanders casually to the doorway. Daisy's head is nestled in the crook of her elbow. Wearing a sunhat, Daisy strolls with Benjamin up a narrow path on his bicycle. Thunder rumbles in the overcast sky as they glide alongside. Wearing a knitted scarf around his neck and carrying two apples, Benjamin walks down from behind the stationary bicycle, ambles past the mountain cabin to the footbridge, and relaxes beside Daisy by the wooden posts as she gazes down the length at the abandoned dock and the river beyond. He offers her a snack, and they're enveloped in a gentle glow as dusk falls. Daisy flits through a yoga studio as young boys file out. She tidies up and stores her shoes by a chair, while large studio windows span the length of the wall opposite the back door. Daisy strides across the polished tile floor and examines her silhouette as she stretches with one leg extended."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They dropped off their umbrellas, and Oliver glances into the library, then up the winding spiral of ladders to Luna's attic studio, as Helen observes him leap to the top of the ladders. A young man emerges on the balcony. A mostly purple orchestra has assembled for the concert in a vibrant blue theater, with Luna's brother sporting a white hat and a woman in a gown applauding enthusiastically beside him. Helen and Oliver perch at the edge of the stage closest to the curtain, observing as musicians cheer energetically. Luna sits at the back in a closed booth. The woman claps Oliver's shoulder and skips away, while Helen raises her gaze as Oliver gazes forward thoughtfully. Performers start to descend from the stage, and the shattered glass sculpture is on the ceiling. Helen flips on a kitchen light, but no bulb lights up. Clothed and wrapped in a cloak, Helen strides into the kitchen as Oliver accepts flowers at the cabinet door. Barefoot, they rearrange the garden, and Oliver sprays Helen's elbows with a green hose, causing her to pursue him with a spade. Dawn arrives, and they swing and sway on the carpet in the moonlit lounge. Oliver unfolds his scarf, they embrace, and he drapes himself beside her. Oliver hangs a curtain and bakes muffins as they listen to Mozart on a colorful transistor radio. A man performs acupressure on Helen's shoulder, and Helen emerges at the base of a waterfall, watching as a young man leaps in and swims backstroke. Wearing a red suit, Oliver emerges pondside and surveys as the man swims smoothly and emerges from the pond, while Helen watches him with joyful eyes. Laughing, Helen folds her hands on the pondside and lifts her chin as sunset creeps in through the narrow arches and Oliver wanders briskly to the water's brink. Helen's face is nestled in the nook of her shoulder. Wearing a cowboy hat, Helen cruises with Oliver up a straight path in his convertible. Thunder rumbles in the clear sky as they drive ahead. Wearing a knitted scarf around his neck and holding two plates, Oliver glides up from beyond the parked van, shuffles past the garden gate to the gazebo, and rests beside Helen by the iron railing as she peers down the length at the bustling street and the city beyond. He offers her a sandwich, and they're cast in a soft shadow as the moon rises. Helen saunters through a music hall as young boys scamper in. She locks up and scatters her coins by a counter, while small wooden benches run the breadth of the room opposite the rear doors. Helen paces across the cracked stone slab and inspects her shadow as she kneels with one finger extended."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Benjamin and Daisy attend Queenie's funeral in a mostly black congregation. They sit quietly, observing the grieving family and Queenie in her casket. Later, they engage in playful activities at home, decorating, and dancing. As night falls, their relationship deepens with tenderness as they embrace. The couple watches The Beatles on TV, and Daisy undergoes physiotherapy before swimming, observed by Benjamin. Daisy expresses sadness while resting by the poolside. Benjamin and Daisy ride a motorcycle in a storm, later sitting together by the lake house, sharing a serene moment as the sun rises. Daisy, a dance studio owner, reflects on her life and passion for dance while closing the studio after the young girls leave."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows  Daisy breezes through a dance studio as young girls file out  He hands her a drink and they're cast in a warm glow as the sun rises  Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond  Wearing a patchwork blanket around his shoulders and carrying two mugs  Lightning crackles in the gloomy sky as they ride alongside  Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle  Daisy's head is buried in the crook of her arm  Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge  Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes  A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl  Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television  Benjamin removes his Tshirt they kiss and he lies on top of her  Night falls and they dance and twist on the mattress in the lamplit bedroom  Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush  Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer  Daisy turns on a bathroom tap but no water comes out  People begin to rise from the pews and the framed family photograph is on the wall  The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely  Queenie lies at the front in an open casket  Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly  A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her  An elderly woman appears on the landing  They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge  He hands her a drink and they're cast in a warm glow as the sun rises  Wearing a patchwork blanket around his shoulders and carrying two mugs  Daisy's head is buried in the crook of her arm  Lightning crackles in the gloomy sky as they ride alongside  Benjamin removes his Tshirt they kiss and he lies on top of her  Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle  Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes  Daisy turns on a bathroom tap but no water comes out  They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs  Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond  Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush  She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows  The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely  An elderly woman appears on the landing  Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television  A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her  Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly  Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated People begin to rise from the pews and the framed family photograph is on the wall  Queenie lies at the front in an open casket  Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer  Night falls and they dance and twist on the mattress in the lamplit bedroom  A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl  Daisy breezes through a dance studio as young girls file out "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A woman performs physiotherapy on Daisy's leg and Daisy surfaces at the edge of a swimming pool watching as a young woman dives in and swims front crawl  Wearing a white shirt Benjamin appears poolside and observes as the woman swims effortlessly and climbs from the pool while Daisy watches her with sad eyes  Sobbing Daisy rests her arms on the poolside and lulls her head as daylight spills in through the tall windows and Benjamin strolls calmly to the water's edge  Daisy's head is buried in the crook of her arm  Wearing a headscarf Daisy rides with Benjamin down a winding road on his motorcycle  Lightning crackles in the gloomy sky as they ride alongside  Wearing a patchwork blanket around his shoulders and carrying two mugs  Benjamin walks up from behind the parked motorbike strolls past the lake house to the boardwalk and sits beside Daisy by the wooden railings as she stares down the length at the derelict jetty and the lake beyond  He hands her a drink and they're cast in a warm glow as the sun rises  Daisy breezes through a dance studio as young girls file out  She locks up and deposits her keys by a desk while tall studio mirrors run the length of the wall opposite the front windows  Daisy strolls across the varnished wooden floorboard and regards her reflection as she poses with one arm elevated They put down their bags and Benjamin peers into the kitchen then down the narrow flight of steps to Queenie's basement bedroom as Daisy watches him walk to the foot of the stairs  An elderly woman appears on the landing  A mostly black congregation has gathered for the funeral in a quaint white church with Queenie's daughter wearing a black veil and a man in a suit nodding solemnly beside her  Daisy and Benjamin sit at the end of the pew closest to the wall watching as people grieve openly  Queenie lies at the front in an open casket  The man shakes Benjamin's hand and moves along while Daisy lowers her eyes as Benjamin stares ahead serenely  People begin to rise from the pews and the framed family photograph is on the wall  Daisy turns on a bathroom tap but no water comes out  Naked and wrapped in a bed sheet Daisy hurries into the bathroom as Benjamin takes delivery at the fridge freezer  Fully dressed they decorate the house and Benjamin paints Daisy's bottom with a pink roller prompting her to chase him with a brush  Night falls and they dance and twist on the mattress in the lamplit bedroom  Benjamin removes his Tshirt they kiss and he lies on top of her  Benjamin hangs a picture and makes popcorn as they watch The Beatles on a black and white television "
        }
      ]
    }
  ]
}