{
  "ground_truth": "Now a toddler, Caroline sleeps beside Daisy, and watched by Benjamin, Daisy wakes. They sit with Caroline in a park as Daisy stares at him, while chubby-cheeked Caroline plays with a toy caterpillar. Balloons decorate the dining room of their duplex, and parents sit at the table with their children. Benjamin goes to the kitchen and looks back into the dining room, where Daisy sits with little Caroline on her knee. A decorative figure of a little girl adorns the remains of a pretty, white birthday cake as the guests have departed. Daisy washes up in the kitchen, watching Benjamin through a Venetian blind as he sits on a wall outside, with Caroline in his lap. Caroline lets go of a yellow helium balloon, which floats away into the sky, and Daisy smiles. Benjamin watches Caroline sleeping in her cot, takes a bulging envelope from the old dresser drawer and a savings book from a small box, and puts them on top of the dresser with a house key. Daisy lies in bed, watching him, and they meet each other's gaze, sharing a long look. Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door. Daisy throws back the bed covers, and Benjamin, zipping up his jacket, goes to his motorcycle in the cold, blue light of dawn. Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway, to the road, and she stands at her window, watching as he rides away. Caroline sits in the corner, turns a page of the diary to find a number of postcards bound with an elastic band, removes it, and reads the back of one. Sallow-skinned Daisy watches from the bed as Caroline leafs through the postcards, flipping another postcard over and reading it, while Daisy listens and closes her eyes. Caroline unfolds a letter as Benjamin backpacks through India, locals wash in a river, and he wakes in a sleeping bag, looking out over a beautiful, desolate landscape and mending his motorbike. Now a young man, he carries groceries down a street as a dying Daisy frowns. Fifty-something Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat, switches off the studio lights as parents usher their children out of the building, then finishes putting her coat on as she starts across the darkened foyer. A figure stands by the door and steps forward; his mid-length hair is a sun-kissed blond, his build slighter, and his skin smoother, and he shrugs. Caroline is 12, Daisy hangs her head, they shake hands, and a gray-haired man enters. Robert looks confused, looks at Daisy who's fighting back tears, and then strokes Caroline's hair.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nCurrently a youngster, Caroline slumbers beside Daisy, and observed by Benjamin, Daisy awakens. They perch with Caroline in a park as Daisy gazes at him, while chubby-faced Caroline amuses herself with a plaything caterpillar. Balloons embellish the dining chamber of their duplex, and guardians sit at the table with their offspring. Benjamin proceeds to the galley and glances back into the dining chamber, where Daisy perches with little Caroline on her lap. A ornamental figurine of a small girl embellishes the remnants of a lovely, white birthday cake as the visitors have departed. Daisy cleans up in the galley, observing Benjamin through a Venetian shade as he perches on a barrier outside, with Caroline in his lap. Caroline releases a yellow helium balloon, which ascends away into the atmosphere, and Daisy grins. Benjamin observes Caroline slumbering in her crib, extracts a bulging envelope from the antique dresser drawer and a savings ledger from a diminutive box, and places them atop the dresser with a house key. Daisy reclines in bed, observing him, and they meet each other's gaze, sharing a lengthy look. Benjamin retreats into the shadows and exits the chamber as Daisy sits up in bed while he directs towards the entrance door. Daisy throws back the bed covers, and Benjamin, fastening up his jacket, proceeds to his motorcycle in the chilly, azure light of dawn. Daisy perches on the border of the bed as Benjamin rides his motorcycle down the driveway, to the road, and she stands at her window, observing as he rides away. Caroline perches in the nook, turns a page of the journal to find a series of postcards bound with an elastic band, removes it, and reads the back of one. Pallid-skinned Daisy observes from the bed as Caroline leafs through the postcards, flipping another postcard over and reading it, while Daisy listens and closes her eyes. Caroline unfolds a letter as Benjamin backpacks through India, natives wash in a river, and he awakens in a sleeping bag, looking out over a wonderful, desolate landscape and repairing his motorbike. Presently a young man, he carries groceries down a street as a dying Daisy frowns. Fifty-something Daisy crosses her dance studio while little girls file through a windowed office as she places an arm into one sleeve of her coat, switches off the studio lights as parents usher their offspring out of the building, then finishes putting her coat on as she starts across the darkened foyer. A silhouette stands by the door and steps forward; his medium-length hair is a sun-kissed blond, his build slighter, and his skin smoother, and he shrugs. Caroline is 12, Daisy lowers her head, they shake hands, and a gray-haired man enters. Robert looks perplexed, glances at Daisy who's suppressing tears, and then strokes Caroline's hair."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Now a toddler, Caroline is watched by Benjamin as she sleeps beside Daisy, and Daisy is woken by him. They are sat with Caroline in a park as Benjamin is stared at by Daisy, while a toy caterpillar is played with by chubby-cheeked Caroline. The dining room of their duplex is decorated with balloons, and the table is sat at by parents with their children. The kitchen is gone to by Benjamin who looks back into the dining room, where little Caroline is sat on Daisy's knee. The remains of a pretty, white birthday cake are adorned by a decorative figure of a little girl as the guests have departed. Benjamin is washed up in the kitchen by Daisy, who watches him through a Venetian blind while he is sat on a wall outside, with Caroline in his lap. A yellow helium balloon is let go by Caroline, which is watched floating away into the sky by Daisy who smiles. Caroline is watched sleeping in her cot by Benjamin, who takes a bulging envelope from the old dresser drawer and a savings book from a small box, placing them on top of the dresser with a house key. He is watched by Daisy lying in bed, and a long look is shared by them as they meet each other's gaze. Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while the front door is headed for by him. The bed covers are thrown back by Daisy, and Benjamin, zipping up his jacket, goes to his motorcycle in the cold, blue light of dawn. The bed is sat on by Daisy as the driveway is ridden down by Benjamin on his motorcycle, to the road, and she is stood at her window, watching as he rides away. Caroline is sat in the corner, a page of the diary is turned by her to find a number of postcards bound with an elastic band, which is removed, and one is read by her on the back. The bed watches sallow-skinned Daisy from as the postcards are leafed through by Caroline, flipping another postcard over and reading it, while her eyes are closed as Daisy listens. A letter is unfolded by Caroline as India is backpacked through by Benjamin, locals are washed in a river, and he wakes in a sleeping bag, looking out over a beautiful, desolate landscape and mending his motorbike. Now a young man, groceries are carried down a street by him as a dying Daisy frowns. The dance studio is crossed by fifty-something Daisy while little girls are filed through a windowed office as one sleeve of her coat is put on by her, the studio lights are switched off as children are ushered out of the building by parents, then she finishes putting her coat on as the darkened foyer is started across by her. The door has a figure standing by it who steps forward; his mid-length hair is a sun-kissed blond, his build is slighter, and his skin is smoother, and he shrugs. Caroline is 12, Daisy hangs her head, they shake hands, and a gray-haired man enters. Robert, looking confused, looks at Daisy who's fighting back tears, and then he strokes Caroline's hair."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Now a toddler, Caroline sleeps beside Daisy, and Benjamin watches as Daisy awakens. They sit with Caroline in a park where she plays with a toy caterpillar. Balloons decorate their duplex dining room as parents and children gather. Benjamin glances back from the kitchen to see Daisy with Caroline on her knee. A little girl figure decorates the remnants of a white birthday cake after guests leave. Daisy cleans up, watching Benjamin through Venetian blinds as he sits with Caroline outside. Caroline releases a yellow balloon into the sky, making Daisy smile. Benjamin watches Caroline sleep, places an envelope, savings book, and house key on the dresser. Daisy meets his gaze before he leaves the room, and she sits up as he heads out. Benjamin zips his jacket, rides his motorcycle away, and Daisy watches from her window. Caroline finds and reads postcards from a diary while Daisy listens quietly. Caroline unfolds a letter as Benjamin, traveling through India, wakes in a sleeping bag beside a river and repairs his motorbike in a desolate landscape. Now a young man, he carries groceries while a dying Daisy frowns. Daisy, now in her fifties, crosses her dance studio, turns off the lights, coats up, and walks across the dark foyer. A sun-kissed blond man with a slighter build appears, and they shake hands as a gray-haired man joins. Robert, confused, looks at Daisy, who fights back tears, and then strokes Caroline's hair."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Caroline, now a toddler, sleeps beside Daisy while Benjamin watches Daisy wake. They sit with Caroline in the park; Daisy stares at Benjamin as Caroline plays with a toy caterpillar. In their duplex, balloons adorn the dining room. Benjamin observes Daisy holding Caroline on her knee. A figure of a little girl sits atop a leftover birthday cake. Daisy washes dishes, watching Benjamin sit outside with Caroline in his lap. Caroline releases a yellow balloon, and Daisy smiles. Benjamin watches Caroline sleep, places a bulging envelope, savings book, and house key on the dresser. Daisy and Benjamin exchange a long gaze before he leaves. She watches from the bed as he rides away on his motorcycle. Caroline reads postcards in a diary while Daisy, in bed, listens. Caroline reads a letter as Benjamin backpacks through India, fixes his motorbike, and wakes in a desolate landscape. He later carries groceries down the street; Daisy, now older, looks troubled. At her dance studio, Daisy turns off the lights as children leave, and a figure with sun-kissed hair steps forward. Caroline, now 12, watches as Daisy hangs her head. They shake hands; Robert, confused, strokes Caroline's hair as he sees Daisy fighting back tears."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Now a young toddler, the little girl named Caroline sleeps soundly beside her mother, Daisy, who is watched over by Benjamin as she gently awakens. They spend time together, sitting contentedly in a park while keeping a watchful eye on Caroline, who, with her adorable chubby cheeks, is happily occupied playing with a small toy caterpillar. Festive balloons add a cheerful touch to the atmosphere, decorating the dining room of their cozy duplex home, where parents and their children gather around the table. Benjamin steps into the kitchen and takes a moment to glance back into the dining room, observing Daisy who is comfortably seated with the little Caroline on her knee. A charming decorative figure depicting a little girl adds a sweet touch to the remains of a pretty, white birthday cake, now that the guests have all gone home. As Daisy tackles the task of washing dishes in the kitchen, she peers through the Venetian blind, watching Benjamin sit on an outside wall while cradling Caroline on his lap. Caroline releases a bright yellow helium balloon, and as it ascends gracefully toward the sky, Daisy can't help but smile. Later, Benjamin watches over Caroline as she sleeps peacefully in her cot. He retrieves a rather bulging envelope from the old dresser drawer, together with a savings book enclosed in a small box, and places them carefully atop the dresser alongside a house key. In the dim light, Daisy reclines in bed, watching Benjamin intently, their eyes meeting and locking in a shared, prolonged gaze. Gradually, Benjamin steps back into the shadows, leaving the room quietly, while Daisy rises from the bed as he heads toward the front door. Daisy throws back the bed covers, and outside, Benjamin zips up his jacket against the chill of the early dawn light, before heading to his motorcycle. Daisy sits at the edge of the bed, watching as Benjamin rides his motorcycle down the driveway and onto the road. From her window, she follows him with her gaze as he rides away. Caroline, now sitting in a corner, turns a page of the diary to discover a stack of postcards neatly secured with an elastic band. She removes the band and begins to read the back of one postcard. Meanwhile, Daisy, with a sallow complexion, watches from the bed as Caroline pages through the postcards, flipping another one over to read it while Daisy listens quietly and eventually closes her eyes. Caroline unfolds a letter while, far away, Benjamin backpacks through India, where locals bathe in a river and he awakens in a sleeping bag to a stunning, desolate landscape, attending to repairs on his motorbike. Now a young man, he walks down the street carrying groceries as a now ailing Daisy frowns. As Daisy, now in her fifties, crosses the dance studio, little girls file out, passing through a windowed office. She slips one arm into a sleeve of her coat and switches off the studio lights, watching as parents guide their children out of the building. She completes putting on her coat as she begins to traverse the darkened foyer. A figure stands nearby at the door, stepping forward with mid-length hair colored a sun-kissed blond, exhibiting a slightly slighter build, and displaying smoother skin. The figure casually shrugs. Twelve-year-old Caroline is present, Daisy lowers her head, and they exchange a handshake. A gray-haired man enters the scene, and Robert looks on, clearly confused. His eyes meet Daisy’s, who is bravely holding back tears, and he tenderly strokes Caroline's hair."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Now that Caroline has grown into a lively young toddler, she is seen sleeping soundly, curled up cozily next to her mother, Daisy. As Daisy gently wakes from her slumber, they are lovingly watched over by Benjamin. The three of them spend precious time together, sitting contentedly in the park. They keep a careful and watchful eye on Caroline who, with her endearing and chubby cheeks, is entirely engrossed and happily occupied, playing with a small, colorful toy caterpillar. The presence of festive balloons adds a vibrant and cheerful touch to the atmosphere. These balloons also adorn the dining room of their welcoming and cozy duplex home, where parents and children have gathered together around the dining table. Benjamin makes his way into the kitchen, pauses for a thoughtful moment, and then glances back into the dining room, observing Daisy. She is comfortably seated, with little Caroline perched on her knee. A charming decorative figure, which depicts a little girl, adds a sweet touch to the leftover remnants of a pretty, white birthday cake, now sitting quietly since all the guests have departed for home. As Daisy turns her attention to the task of washing dishes in the kitchen, she takes a moment to peer through the Venetian blind, observing Benjamin while he sits on an outside wall, gently cradling Caroline on his lap. Caroline, with a sense of wonder, releases a bright yellow helium balloon, and Daisy smiles as she watches it ascend gracefully into the sky. A little later, Benjamin takes on the nurturing role of watching over Caroline as she sleeps peacefully in her cot. He retrieves a rather bulging envelope from the old dresser drawer, accompanied by a small box containing a savings book, and he places them with care atop the dresser, right beside a house key. In the soft and dim light, Daisy reclines in bed, her eyes intently watching Benjamin, their gazes meeting and locking in a shared, prolonged moment of connection. Gradually, Benjamin recedes back into the shadows, quietly departing the room, while Daisy rises from her bed as he makes his way toward the front door. With a purposeful action, Daisy throws back the bed covers, and outside, Benjamin fastens his jacket against the chill of the early dawn light, before heading out to his motorcycle. Sitting at the edge of her bed, Daisy watches Benjamin as he rides his motorcycle down the driveway and onto the open road. From her window, she follows him with her gaze, watching him ride away into the distance. Meanwhile, Caroline, seated quietly in a corner, turns a page of an old diary and discovers a stack of postcards neatly secured with an elastic band. She removes the band and begins to read the back of one postcard. In the meantime, Daisy, with a somewhat sallow complexion, observes from the bed as Caroline pages through the postcards, flipping another one over to read while Daisy listens quietly and eventually closes her eyes. Caroline then unfolds a letter, while, far away in a distant land, Benjamin finds himself backpacking through India. There, he witnesses locals bathing in a river and awakens in a sleeping bag to a stunningly beautiful yet desolate landscape, where he attends to repairs on his motorbike. Now having matured into a youthful man, he walks down the street carrying a bag of groceries, while back home, a now ailing Daisy frowns with concern. As Daisy, now having reached her fifties, crosses the dance studio, small groups of little girls file out, passing through a windowed office. She gracefully slips one arm into a sleeve of her coat and switches off the studio lights, watching as parents guide their children out of the building. Once finished putting on her coat, she begins to traverse the darkened foyer. A figure stands nearby at the door, stepping forward with mid-length hair colored a sun-kissed blond, displaying a slightly slighter build, and exhibiting smoother skin. The figure offers a casual shrug. Twelve-year-old Caroline is present, and Daisy lowers her head, exchanging a handshake with the person. A gray-haired man makes his entrance, and Robert, appearing clearly confused, looks on. His eyes eventually meet Daisy’s, who is bravely holding back tears, and he reaches out tenderly to stroke Caroline's hair in a moment of shared emotion."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Caroline, now a toddler, sleeps peacefully beside Daisy, Benjamin keeps a watchful eye on them. Daisy gradually awakens and the three of them find themselves in a picturesque park sitting together. Daisy gazes intently at Benjamin while chubby-cheeked Caroline happily entertains herself with a toy caterpillar. The scene shifts to their duplex, where balloons festively adorn the dining room. Parents are seated at the table with their children as Benjamin steps into the kitchen. He pauses, glancing back into the dining room to see Daisy seated with little Caroline perched on her knee. A decorative figure of a little girl sits atop what remains of a pretty, white birthday cake, and the guests have just left. Daisy is in the kitchen, washing dishes, and she watches Benjamin through the slats of a Venetian blind as he sits on a wall outside, cradling Caroline in his lap. Caroline releases her hold on a yellow helium balloon, allowing it to ascend into the sky, prompting Daisy to smile. Later, Benjamin watches over Caroline while she sleeps in her cot. He retrieves a bulging envelope from the old dresser drawer, along with a savings book from a small box, carefully placing them on top of the dresser next to a house key. Daisy lies in bed, observing him, and their eyes meet in a meaningful, lingering gaze. Benjamin gradually recedes into the shadows and quietly exits the room while Daisy sits up in bed, aware of his departure. As Benjamin zips up his jacket, Daisy throws back the bed covers and sits on the edge of the bed. Benjamin then proceeds to his motorcycle, bathed in the cold, blue light of dawn, and rides it down the driveway to the road. Daisy moves to the window and stands there, watching intently as he rides away. Meanwhile, Caroline sits in a corner, turning a page of the diary she holds. She discovers a bundle of postcards secured by an elastic band, removes the band, and starts reading the back of one. From her bed, sallow-skinned Daisy watches as Caroline continues flipping through the postcards, reading another one, while listening intently and eventually closing her eyes. Caroline unfolds a letter as the scene shifts to Benjamin backpacking through India. Locals wash in a river nearby as he wakes up in a sleeping bag, taking in the view of a breathtaking, desolate landscape and attending to repairs on his motorbike. Now portrayed as a young man, he strolls down a street, carrying groceries, while a dying Daisy frowns. The narrative shifts to fifty-something Daisy, who makes her way across her dance studio as little girls file through a windowed office. She slips one arm into her coat sleeve and then switches off the studio lights as parents guide their children out of the building. Daisy then finishes putting her coat on and begins her walk across the dimly lit foyer. A figure standing by the door steps forward, revealing mid-length, sun-kissed blond hair, a slightly slighter build, and smoother skin, and he offers a small shrug. Caroline, at the age of 12, is present, and Daisy lowers her head. They exchange a handshake, and a gray-haired man enters the scene. Robert looks puzzled and glances at Daisy, who is struggling to hold back tears, and then gently strokes Caroline's hair in understanding."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Now a toddler, Caroline sleeps beside Daisy, who is watched by Benjamin as she wakes. In the park, Daisy gazes at Benjamin while Caroline plays with a toy caterpillar nearby. Later, balloons fill the dining room where families gather at the table. Benjamin observes Daisy with Caroline on her knee before a decorative figure of a little girl tops the remnants of a birthday cake after guests have left. Daisy cleans up in the kitchen, watching Benjamin sitting outside on a wall with Caroline in his lap. When Caroline releases a yellow helium balloon, which floats away, Daisy smiles. Subsequently, Benjamin checks on a sleeping Caroline, retrieves a bulging envelope, a savings book, and a house key, placing them on the dresser. Daisy and Benjamin share a silent exchange before he leaves the bedroom and heads to the front door. Daisy watches from bed as Benjamin, after zipping his jacket, rides away on his motorcycle in the dawn light, observed by Daisy through the window.\n\nCaroline, now older, finds a set of postcards and reads them, sitting in the corner while a sallow-skinned Daisy watches from bed, listening and closing her eyes. Meanwhile, Benjamin backpacks through India, experiencing the local culture, and maintains his motorbike while traveling. In his youth, he carries groceries down the street as Daisy, now ill, frowns from a distance. As Daisy, now in her fifties, moves through her dance studio, she turns off the lights after the children leave, and encounters a familiar figure at the door. This figure, younger and with sun-kissed blond hair, shrugs at her. With Caroline now 12, Daisy hangs her head before shaking hands with the figure as a gray-haired man, Robert, enters and offers comfort by stroking Caroline's hair, while Daisy fights back tears."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Now a toddler, Caroline sleeps beside Daisy, her favorite doll clutched in her small hand, and watched by Benjamin, Daisy wakes. They sit with Caroline in a park renowned for its vibrant flower beds, as Daisy stares at him, while chubby-cheeked Caroline plays with a toy caterpillar that, according to local custom, symbolizes transformation. Balloons, typically used to signify celebration in their culture, decorate the dining room of their duplex, and parents sit at the table with their children, sharing stories and laughter. Benjamin goes to the kitchen and looks back into the dining room, where Daisy sits with little Caroline on her knee, cooing softly. A decorative figure of a little girl adorns the remains of a pretty, white birthday cake, which was specially ordered from the famous local bakery, as the guests have departed. Daisy washes up in the kitchen, watching Benjamin through a Venetian blind, recalling how they had chosen it for privacy, as he sits on a wall outside, with Caroline in his lap. Caroline lets go of a yellow helium balloon, which floats away into the sky, joining the hundreds released each year in the town's annual festival, and Daisy smiles. Benjamin watches Caroline sleeping in her cot, takes a bulging envelope containing old family letters from the old dresser drawer and a savings book from a small box gifted by his father, and puts them on top of the dresser with a house key. Daisy lies in bed, watching him, and they meet each other's gaze, sharing a long look that speaks of unsaid words. Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed, her mind filled with memories while he heads for the front door. Daisy throws back the bed covers, and Benjamin, zipping up his worn leather jacket that has seen many adventures, goes to his motorcycle in the cold, blue light of dawn. Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway, to the road that leads to places unknown, and she stands at her window, watching as he rides away. Caroline sits in the corner, turns a page of the diary to find a number of postcards bound with an elastic band, removes it, and reads the back of one, which describes distant lands and dreams. Sallow-skinned Daisy watches from the bed as Caroline leafs through the postcards, flipping another postcard over and reading it, while Daisy listens and closes her eyes, lost in her thoughts of days gone by. Caroline unfolds a letter as Benjamin backpacks through India, marveling at the colorful festivals, locals wash in a river, and he wakes in a sleeping bag, looking out over a beautiful, desolate landscape and mending his motorbike with a toolkit given by an old friend. Now a young man, he carries groceries down a street as a dying Daisy frowns, knowing her time is near. Fifty-something Daisy crosses her dance studio, a place where countless young dancers have found their rhythm, while little girls file through a windowed office as she puts an arm into one sleeve of her coat, switches off the studio lights, a ritual marking the end of an era, as parents usher their children out of the building, then finishes putting her coat on as she starts across the darkened foyer. A figure stands by the door and steps forward; his mid-length hair is a sun-kissed blond, his build slighter, and his skin smoother, and he shrugs with a casual grace. Caroline is 12, Daisy hangs her head, they shake hands, a gesture of connection and understanding, and a gray-haired man enters. Robert looks confused, trying to piece together a story he only half knows, looks at Daisy who's fighting back tears, and then strokes Caroline's hair in a gesture of familial warmth."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Now a toddler Caroline sleeps beside Daisy and watched by Benjamin. Daisy wakes. They sit with Caroline in a park as Daisy stares at him. while chubbycheeked Caroline plays with a toy caterpillar. Balloons decorate the dining room of their duplex and parents sit at the table with their children. Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee. A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed. Daisy washes up in the kitchen watching Benjamin through a Venetian blind as he sits on a wall outside with Caroline in his lap. Caroline let us go of a yellow helium balloon which floats away into the sky and Daisy smiles. Benjamin watches Caroline sleeping in her cot takes a bulging envelope from the old dresser drawer and a savings book from a small box and puts them on top of the dresser with a house key. Daisy lies in bed watching him and they meet each other's gaze sharing a long look. Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door. Daisy throws back the bed covers and Benjamin zipping up his jacket goes to his motorcycle in the cold blue light of dawn. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway to the road and she stands at her window watching as he rides away. Caroline sits in the corner turns a page of the diary to find a number of postcards bound with an elastic band removes it and reads the back of one. Sallowskinned Daisy watches from the bed as Caroline leafs through the postcards flipping another postcard over and reading it while Daisy listens and closes her eyes. Caroline unfolds a letter as Benjamin backpacks through India. locals wash in a river and he wakes in a sleeping bag looking out over a beautiful desolate landscape and mending his motorbike. Now a young man he carries groceries down a street as a dying Daisy frowns. Fiftysomething. Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer. A figure stands by the door and steps forward. his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs. Caroline is 12. Daisy hangs her head. they shake hands and a grayhaired man enters. Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Now a toddler Caroline sleeps beside Daisy and watched by Benjamin. Daisy wakes. They sit with Caroline in a park as Daisy stares at him. while chubbycheeked Caroline plays with a toy caterpillar. Balloons decorate the dining room of their duplex and parents sit at the table with their children. Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee. A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed. Daisy washes up in the kitchen watching Benjamin through a Venetian blind as he sits on a wall outside with Caroline in his lap. Caroline let us go of a yellow helium balloon which floats away into the sky and Daisy smiles. Benjamin watches Caroline sleeping in her cot takes a bulging envelope from the old dresser drawer and a savings book from a small box and puts them on top of the dresser with a house key. Daisy lies in bed watching him and they meet each other's gaze sharing a long look. Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door. Daisy throws back the bed covers and Benjamin zipping up his jacket goes to his motorcycle in the cold blue light of dawn. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway to the road and she stands at her window watching as he rides away. Caroline sits in the corner turns a page of the diary to find a number of postcards bound with an elastic band removes it and reads the back of one. Sallowskinned Daisy watches from the bed as Caroline leafs through the postcards flipping another postcard over and reading it while Daisy listens and closes her eyes. Caroline unfolds a letter as Benjamin backpacks through India. locals wash in a river and he wakes in a sleeping bag looking out over a beautiful desolate landscape and mending his motorbike. Now a young man he carries groceries down a street as a dying Daisy frowns. Fiftysomething. Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer. A figure stands by the door and steps forward. his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs. Caroline is 12. Daisy hangs her head. they shake hands and a grayhaired man enters. Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Now a toddler Caroline sleeps beside Daisy and watched by Benjamin. Daisy wakes. They sit with Caroline in a park as Daisy stares at him. while chubbycheeked Caroline plays with a toy caterpillar. Balloons decorate the dining room of their duplex and parents sit at the table with their children. Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee. A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed. Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer. A figure stands by the door and steps forward. his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs. Caroline is 12. Daisy hangs her head. they shake hands and a grayhaired man enters. Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Now a toddler Caroline sleeps beside Daisy and watched by Benjamin. Daisy wakes. They sit with Caroline in a park as Daisy stares at him. Daisy hangs her head. they shake hands and a grayhaired man enters. Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Now a penguin, Alfred perches beside Tulip, and observed by Hector, Tulip yawns. They rest with Alfred in a garden as Tulip gazes at him, while pudgy-feathered Alfred juggles with a rubber aardvark. Streamers embellish the lounge area of their bungalow, and caretakers lounge by the counter with their pets. Hector wanders to the pantry and peers back into the lounge area, where Tulip rests with tiny Alfred on her shoulder. An ornamental sculpture of a small elephant embellishes the leftovers of a fancy, pink wedding pie as the visitors have vanished. Tulip tidies up in the pantry, glancing at Hector through a bamboo screen as he reclines on a bench outside, with Alfred in his lap. Alfred releases a blue soap bubble, which drifts away into the breeze, and Tulip grins. Hector observes Alfred dozing in her basket, extracts a crumpled package from the ancient cabinet tray and a ledger from a tiny crate, and places them atop the cabinet with a car key. Tulip reclines on the hammock, observing him, and they exchange glances, sharing a lingering stare. Hector retreats into the dimness and exits the space as Tulip lifts herself in the hammock while he makes his way to the patio. Tulip tosses aside the hammock quilt, and Hector, fastening his raincoat, moves to his skateboard in the chilly, gray light of dawn. Tulip perches on the brink of the hammock as Hector skates down the path, to the street, and she peers out her window, observing as he skates away. Alfred huddles in the alcove, flips a leaf of the scrapbook to discover a bundle of sketches tied with a ribbon, removes it, and studies the underside of one. Pale-feathered Tulip gazes from the hammock as Alfred sifts through the sketches, turning another sketch over and studying it, while Tulip tunes in and shuts her eyes. Alfred unfolds a note as Hector treks across Japan, locals bathe in a pond, and he awakens in a sleeping sack, gazing out over a picturesque, barren scenery and fixing his unicycle. Now a lanky teen, he totes parcels down an avenue as a fading Tulip scowls. Mature Tulip strides across her painting studio while small birds file through an open gallery as she slips an arm into one sleeve of her jacket, flicks off the studio lamps as caretakers herd their pets out of the chamber, then concludes donning her jacket as she strides across the shadowy lobby. An individual lounges by the gate and steps forth; his short hair is a moonlit silver, his figure more fragile, and his fur sleeker, and he shrugs. Alfred is 15, Tulip bows her head, they clasp hands, and a silver-bearded individual enters. Paul appears bewildered, peers at Tulip who's suppressing sobs, and then pats Alfred's cheek."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Caroline, now a toddler, sleeps beside Daisy while Benjamin watches. In a park, Daisy gazes at Benjamin as Caroline plays. During a birthday gathering, Daisy, with Caroline on her knee, watches Benjamin who later sits outside with Caroline. A yellow balloon floats away, making Daisy smile. Benjamin watches Caroline sleep, then leaves a savings book, envelope, and key on a dresser. Daisy observes him leaving on a motorcycle at dawn from her window. Caroline, older, finds postcards and letters, reading them as Daisy listens from bed. In India, Benjamin fixes his motorbike and explores. As a young man, he carries groceries while Daisy, now a dance studio owner, oversees children. In the dim foyer, a familiar blond figure appears. At 12, Caroline meets a gray-haired man who comforts her as Daisy fights back tears."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair they shake hands and a grayhaired man enters Daisy hangs her head Caroline is 12 his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs A figure stands by the door and steps forward Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer Fiftysomething Now a young man he carries groceries down a street as a dying Daisy frowns locals wash in a river and he wakes in a sleeping bag looking out over a beautiful desolate landscape and mending his motorbike Caroline unfolds a letter as Benjamin backpacks through India Sallowskinned Daisy watches from the bed as Caroline leafs through the postcards flipping another postcard over and reading it while Daisy listens and closes her eyes Caroline sits in the corner turns a page of the diary to find a number of postcards bound with an elastic band removes it and reads the back of one Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway to the road and she stands at her window watching as he rides away Daisy throws back the bed covers and Benjamin zipping up his jacket goes to his motorcycle in the cold blue light of dawn Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door Daisy lies in bed watching him and they meet each other's gaze sharing a long look Benjamin watches Caroline sleeping in her cot takes a bulging envelope from the old dresser drawer and a savings book from a small box and puts them on top of the dresser with a house key Caroline let us go of a yellow helium balloon which floats away into the sky and Daisy smiles Daisy washes up in the kitchen watching Benjamin through a Venetian blind as he sits on a wall outside with Caroline in his lap A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee Balloons decorate the dining room of their duplex and parents sit at the table with their children while chubbycheeked Caroline plays with a toy caterpillar They sit with Caroline in a park as Daisy stares at him Daisy wakes Now a toddler Caroline sleeps beside Daisy and watched by Benjamin"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Daisy wakes Now a toddler Caroline sleeps beside Daisy and watched by Benjamin while chubbycheeked Caroline plays with a toy caterpillar They sit with Caroline in a park as Daisy stares at him Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee Balloons decorate the dining room of their duplex and parents sit at the table with their children Daisy washes up in the kitchen watching Benjamin through a Venetian blind as he sits on a wall outside with Caroline in his lap A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed Benjamin watches Caroline sleeping in her cot takes a bulging envelope from the old dresser drawer and a savings book from a small box and puts them on top of the dresser with a house key Caroline let us go of a yellow helium balloon which floats away into the sky and Daisy smiles Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door Daisy lies in bed watching him and they meet each other's gaze sharing a long look Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway to the road and she stands at her window watching as he rides away Daisy throws back the bed covers and Benjamin zipping up his jacket goes to his motorcycle in the cold blue light of dawn Sallowskinned Daisy watches from the bed as Caroline leafs through the postcards flipping another postcard over and reading it while Daisy listens and closes her eyes Caroline sits in the corner turns a page of the diary to find a number of postcards bound with an elastic band removes it and reads the back of one locals wash in a river and he wakes in a sleeping bag looking out over a beautiful desolate landscape and mending his motorbike Caroline unfolds a letter as Benjamin backpacks through India Fiftysomething Now a young man he carries groceries down a street as a dying Daisy frowns A figure stands by the door and steps forward Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer Caroline is 12 his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs they shake hands and a grayhaired man enters Daisy hangs her head Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Caroline sits in the corner turns a page of the diary to find a number of postcards bound with an elastic band removes it and reads the back of one Sallowskinned Daisy watches from the bed as Caroline leafs through the postcards flipping another postcard over and reading it while Daisy listens and closes her eyes Caroline unfolds a letter as Benjamin backpacks through India locals wash in a river and he wakes in a sleeping bag looking out over a beautiful desolate landscape and mending his motorbike Now a young man he carries groceries down a street as a dying Daisy frowns Fiftysomething Daisy crosses her dance studio while little girls file through a windowed office as she puts an arm into one sleeve of her coat switches off the studio lights as parents usher their children out of the building then finishes putting her coat on as she starts across the darkened foyer A figure stands by the door and steps forward his midlength hair is a sunkissed blond his build slighter and his skin smoother and he shrugs Caroline is 12 Daisy hangs her head they shake hands and a grayhaired man enters Robert looks confused looks at Daisy who is fighting back tears and then strokes Caroline's hair Now a toddler Caroline sleeps beside Daisy and watched by Benjamin Daisy wakes They sit with Caroline in a park as Daisy stares at him while chubbycheeked Caroline plays with a toy caterpillar Balloons decorate the dining room of their duplex and parents sit at the table with their children Benjamin goes to the kitchen and looks back into the dining room where Daisy sits with little Caroline on her knee A decorative figure of a little girl adorns the remains of a pretty white birthday cake as the guests have departed Daisy washes up in the kitchen watching Benjamin through a Venetian blind as he sits on a wall outside with Caroline in his lap Caroline let us go of a yellow helium balloon which floats away into the sky and Daisy smiles Benjamin watches Caroline sleeping in her cot takes a bulging envelope from the old dresser drawer and a savings book from a small box and puts them on top of the dresser with a house key Daisy lies in bed watching him and they meet each other's gaze sharing a long look Benjamin retreats into the shadows and leaves the room as Daisy sits up in bed while he heads for the front door Daisy throws back the bed covers and Benjamin zipping up his jacket goes to his motorcycle in the cold blue light of dawn Daisy sits on the edge of the bed as Benjamin rides his motorcycle down the driveway to the road and she stands at her window watching as he rides away"
        }
      ]
    }
  ]
}