{
  "ground_truth": "Frowning, Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands. Benjamin stands, then collapses. The preacher points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation. His posture's crooked. He takes a step. The congregation clap and cheer him on. The preacher freezes with his arms held aloft. Two concerned men rise sharply, and the preacher keels over. A white-robed pianist starts to play. The flag outside flies at half-mast. Music plays from a gramophone beside a grave. Benjamin, Queenie, and Tizzy are amongst the mourners. As the song ends, a man claps two cymbals together. An old guy. Benjamin eavesdrops on a conversation. Benjamin hobbles on crutches to the back door to watch Mr. Oti holding court in the garden. He turns to see Benjamin, who ducks out of sight. Indoors, diminutive, sharp-suited Mr. Oti takes a seat beside Benjamin. Benjamin turns gingerly to meet his gaze. The black African, Mr. Oti, smiles. Outside, on the sunny street, Mr. Oti tips his hat to one of three children playing baseball. Wearing a large, ill-fitting fedora, Benjamin struggles to keep up with him on crutches. Mr. Oti waves to a tram. On board, Bushman shares a cage with apes. He bares his teeth at three children in the whites-only section of the tram. They cower. They sit on a bench by tall stone columns. Benjamin presses his lips together and looks away, thoughtfully. Benjamin smiles at Mr. Oti, then looks away again. Benjamin sips root beer. They approach a woman in town. Oti hugs her. Dwarfed by Philomena, Mr. Oti walks away. Alone, Benjamin fails to reach a tram in time. He waves a crutch in the air as the tram glides off. Benjamin cuts a forlorn figure as he plods away. Night, Benjamin determinedly makes his way down a sidewalk. As he arrives at the familiar clapboard retirement home, Queenie lifts a sash window and stares down at him. At a basin. She goes and he stares at his wet, blistered hands. On the lawn, Benjamin turns to see a man watching him from the street. The man, his father, Thomas, gets into the back of a car. An elegant, gray-haired woman. The girl pirouettes. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated storybook. Benjamin sits with them. Night, age six, with long red hair, Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Frowning, Benjamin places his hands on the armrests of his seat and toils determinedly to rise. He adjusts his leg with his hands. Benjamin rises, then collapses. The preacher directs both hands at Benjamin. Benjamin strives to his feet and stands shakily before the congregation. His stance's crooked. He takes a pace. The congregation applauds and cheers him on. The preacher freezes with his arms held aloft. Two concerned men rise sharply, and the preacher keels over. A white-robed pianist begins to play. The flag outside flies at half-staff. Music plays from a gramophone beside a grave. Benjamin, Queenie, and Tizzy are among the mourners. As the song concludes, a man claps two cymbals together. An old guy. Benjamin listens in on a conversation. Benjamin limps on crutches to the back door to watch Mr. Oti holding court in the yard. He turns to see Benjamin, who ducks out of sight. Indoors, diminutive, sharp-suited Mr. Oti takes a seat beside Benjamin. Benjamin turns gingerly to meet his gaze. The black African, Mr. Oti, grins. Outside, on the sunny road, Mr. Oti tips his hat to one of three youngsters playing baseball. Wearing a large, ill-fitting fedora, Benjamin struggles to keep up with him on crutches. Mr. Oti waves to a streetcar. Onboard, Bushman shares a cage with apes. He bares his teeth at three youngsters in the whites-only section of the streetcar. They cower. They sit on a bench by tall stone columns. Benjamin presses his lips together and looks away, thoughtfully. Benjamin grins at Mr. Oti, then looks away again. Benjamin sips root beer. They approach a lady in town. Oti embraces her. Dwarfed by Philomena, Mr. Oti walks away. Alone, Benjamin fails to catch a streetcar in time. He waves a crutch in the air as the streetcar glides off. Benjamin cuts a forlorn figure as he trudges away. Night, Benjamin determinedly makes his way down a pavement. As he arrives at the familiar clapboard retirement home, Queenie lifts a sash window and stares down at him. At a basin. She goes and he stares at his damp, blistered hands. On the lawn, Benjamin turns to see a man observing him from the road. The man, his father, Thomas, enters the back of a car. An elegant, gray-haired lady. The girl twirls. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated storybook. Benjamin sits with them. Night, age six, with long red hair, Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Tablecloth has been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Frowning, the armrests of the chair are planted on by Benjamin's hands as he labors determinedly to stand up. His leg is adjusted with his hands by him. Benjamin stands, then is collapsed. Both hands are pointed at Benjamin by the preacher. His feet are struggled to by Benjamin, who stands shakily before the congregation. His posture is crooked. A step is taken by him. He is clapped and cheered on by the congregation. The preacher freezes with his arms held aloft. Two concerned men sharply rise, and the preacher is keeled over. A white-robed pianist plays. The flag outside is flown at half-mast. Music is played from a gramophone beside a grave. Benjamin, Queenie, and Tizzy are amongst the mourners. As the song is ended, a man claps two cymbals together. An old guy. A conversation is eavesdropped on by Benjamin. On crutches, the back door is hobbled to by Benjamin to watch Mr. Oti holding court in the garden. Turning to see Benjamin, Mr. Oti ducks out of sight. Indoors, a seat is taken beside Benjamin by diminutive, sharp-suited Mr. Oti. Gingerly, Benjamin turns to meet his gaze. Mr. Oti, the black African, smiles. Outside, on the sunny street, a hat is tipped by Mr. Oti to one of three children playing baseball. Wearing a large, ill-fitting fedora, crutches are struggled with by Benjamin to keep up with him. A tram is waved to by Mr. Oti. On board, apes are shared a cage with by Bushman. His teeth are bared at three children in the whites-only section of the tram. Cowering is done by them. They are sat on a bench by tall stone columns. Benjamin presses his lips together and thoughtfully looks away. Mr. Oti is smiled at by Benjamin, who then looks away again. Root beer is sipped by Benjamin. A woman in town is approached by them. She is hugged by Oti. Dwarfed by Philomena, Mr. Oti walks away. Alone, a tram in time is failed to be reached by Benjamin. A crutch is waved in the air by him as the tram glides off. A forlorn figure is cut by Benjamin as he plods away. Night, determinedly making his way down a sidewalk is Benjamin. Arriving at the familiar clapboard retirement home, a sash window is lifted by Queenie, who stares down at him. At a basin. She goes and wet, blistered hands are stared at by him. On the lawn, a man watching him from the street is turned to by Benjamin. His father, Thomas, is gotten into the back of a car by the man. An elegant, gray-haired woman. The girl pirouettes. Oti, Philomena, Miss Fuller, and Daisy are sat with by Benjamin. Tizzy's hand is taken by Queenie. Daisy is read to from an illustrated storybook by Miss Fuller. They are sat with by Benjamin. Night, age six, with long red hair, Daisy approaches Benjamin's bed. He sits up. He is beckoned by her. Down a flight of stairs, Benjamin hobbles in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Frowning, Benjamin pushes himself determinedly up from his chair, adjusts his leg, and stands before collapsing. The preacher points at him, and Benjamin shakily rises, his posture crooked, taking a step as the congregation claps and cheers. The preacher freezes mid-gesture as two men stand sharply, and he keels over. A pianist in white plays while a flag flies at half-mast. Music plays by a grave where Benjamin, Queenie, and Tizzy mourn. As the song ends, an older man claps cymbals. Benjamin listens to a conversation, then hobbles on crutches to watch Mr. Oti in the garden, who smiles when he notices him. Mr. Oti tips his hat to children playing baseball, and Benjamin, wearing a large fedora, tries to keep up. On a tram, Bushman shows his teeth at children in the whites-only section, who cower. Benjamin presses his lips and looks away, then smiles at Mr. Oti and sips root beer. They meet a woman, and Mr. Oti hugs her. Benjamin, alone, misses a tram, waving his crutch as it leaves. Plodding away forlornly, he reaches a familiar retirement home at night. Queenie looks down at him. He stares at his wet, blistered hands. On the lawn, he sees his father Thomas in a car with an elegant woman. Benjamin later sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie holds Tizzy's hand. Miss Fuller reads to Daisy. At night, a six-year-old Daisy with red hair beckons Benjamin from his bed. He hobbles downstairs in the dark, where tablecloths form a tent over furniture."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Frowning, Benjamin struggles to stand from his chair, adjusts his leg, and collapses. The preacher gestures at him. Benjamin stands shakily, prompting applause. The preacher freezes, and two men react as he falls. A pianist plays as a flag flies at half-mast. Music from a gramophone accompanies mourners, including Benjamin, Queenie, and Tizzy. A man claps cymbals. Benjamin eavesdrops and hobbles on crutches to watch Mr. Oti. Mr. Oti sits with Benjamin indoors, smiling. Outside, he tips his hat to children playing baseball. Benjamin struggles on crutches to keep pace as Oti waves to a tram. Onboard, Bushman shares a cage with apes and bares his teeth at children in the whites-only section. Benjamin looks away, then smiles. He drinks root beer. Oti hugs a woman in town. Alone, Benjamin misses a tram, waves his crutch, and plods away. At night, Benjamin reaches a retirement home. Queenie watches him from a window. Inside, he inspects his blistered hands. On the lawn, Thomas, his father, gets into a car. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie holds Tizzy's hand as Fuller reads to Daisy. At night, six-year-old Daisy approaches Benjamin's bed and beckons. Benjamin hobbles downstairs, where tables form a tent."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a deep frown etched across his face, Benjamin firmly plants his hands on the armrests of his chair, exerting effort and determination as he laboriously attempts to stand upright. He carefully adjusts his leg with his hands, a necessary task to steady himself. Once Benjamin manages to stand, his strength falters, and he collapses back down. At this moment, the preacher extends both of his hands, gesturing emphatically at Benjamin. With immense effort, Benjamin battles to get back on his feet, finally standing shakily in front of the gathered congregation. His posture is noticeably crooked. He cautiously takes a step forward. The congregation responds with clapping and cheering, encouraging him with their applause. The preacher becomes motionless, holding his arms up high. Suddenly, two concerned men rise sharply from their seats, and the preacher, unexpectedly, keels over. A pianist, dressed in flowing white robes, begins to play. Outside, the flag waves somberly at half-mast. Music emanates from a gramophone positioned beside a grave, casting a melancholic ambiance. Benjamin, along with Queenie and Tizzy, stands among the mourners. As the song concludes, an elderly man claps two cymbals together. Benjamin overhears snippets of a nearby conversation. Using crutches, he hobbles to the back door, from where he observes Mr. Oti, who is holding court in the garden. Mr. Oti turns, catching sight of Benjamin, who quickly ducks out of view. Inside, the diminutive yet sharp-suited Mr. Oti takes a seat beside Benjamin. Carefully, Benjamin turns to meet his gaze. The black African, Mr. Oti, offers him a warm smile. Out on the sunny street, Mr. Oti tips his hat to one of three children engaged in a lively game of baseball. Meanwhile, Benjamin, wearing a large, awkwardly-fitting fedora, struggles to keep pace on his crutches. Mr. Oti waves at a tram. Inside the tram, Bushman shares a cage with apes and menacingly bares his teeth at three children seated in the whites-only section, causing them to cower in fear. Benjamin and Mr. Oti find a place on a bench beside tall stone columns. Benjamin presses his lips tightly together and looks away, lost in thought. He shares a smile with Mr. Oti but then averts his eyes once more. Taking a sip of root beer, Benjamin and Mr. Oti approach a woman in town. Oti affectionately embraces her. Towered over by Philomena, Mr. Oti eventually walks away. Alone once more, Benjamin fails to board a tram in time, waving a crutch in the air as it pulls away, leaving him behind. He cuts a forlorn figure as he slowly plods away. As night falls, Benjamin makes his way, with a determined air, down a sidewalk. Upon arriving at the familiar clapboard retirement home, Queenie raises a sash window and peers out at him. She stands at a basin. After she leaves, he stares down at his wet, blistered hands. On the lawn, Benjamin turns and notices a man watching him intently from the street. This man, his father Thomas, gets into the back of a car with an elegant, gray-haired woman. Nearby, a girl gracefully pirouettes. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie takes Tizzy's hand in hers. Miss Fuller reads aloud to Daisy from an illustrated storybook, as Benjamin sits with them. As night descends, Daisy, at age six and with long red hair, approaches Benjamin's bed. He sits up attentively as she beckons him silently. In the dark, Benjamin cautiously hobbles down a flight of stairs. In the room, table linen has been draped over some tables and chairs, forming a makeshift tent."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a deep, intense frown etched across his face, Benjamin firmly plants his hands on the sturdy armrests of his chair. He exerts considerable effort and shows determination as he laboriously tries to stand upright. With precision and care, he adjusts his leg with his hands, a necessary task to steady his position. Once Benjamin manages to stand, his strength falters, and he collapses back down into the chair. At this pivotal moment, the preacher extends both of his hands, gesturing emphatically and energetically at Benjamin. Summoning immense effort and resolve, Benjamin battles to get back on his feet, eventually standing shakily in front of the gathered congregation. His posture is noticeably crooked and uneven. He cautiously takes a small, tentative step forward. The congregation responds with a spontaneous outburst of clapping and cheering, showering him with encouragement through their enthusiastic applause. The preacher becomes motionless, striking a dramatic pose with his arms held up high. Suddenly, two concerned men rise sharply from their seats, and the preacher, unexpectedly, keels over. A pianist, adorned in flowing, pristine white robes, begins to play a melody. Outside, the flag waves somberly at half-mast, casting a reflective mood. Melancholic music emanates hauntingly from a gramophone positioned beside a grave, heightening the mood of solemnity. Benjamin, accompanied by Queenie and Tizzy, stands quietly among the gathered mourners. As the poignant song concludes, an elderly man claps two cymbals together with a resonant crash. Benjamin overhears snippets of a nearby conversation floating in the air. Using crutches for support, he hobbles to the back door, from where he discreetly observes Mr. Oti, who is holding court in the garden with confidence. Mr. Oti turns, catching sight of Benjamin, who quickly ducks out of view, seeking to remain unnoticed. Inside, the diminutive yet sharp-suited Mr. Oti takes a seat beside Benjamin with a sense of purpose. Carefully, Benjamin turns to meet his gaze. The black African, Mr. Oti, offers him a warm, genuine smile. Out on the sunny street, Mr. Oti tips his hat respectfully to one of three children engaged in a lively game of baseball. Meanwhile, Benjamin, wearing a large, awkwardly-fitting fedora, struggles to keep pace on his crutches. Mr. Oti waves energetically at a tram passing by. Inside the tram, Bushman shares a cage with apes and menacingly bares his teeth at three children seated in the whites-only section, causing them to cower in fear and trepidation. Benjamin and Mr. Oti find a place to sit on a bench beside tall, imposing stone columns. Benjamin presses his lips tightly together and looks away, lost in deep thought. He briefly shares a smile with Mr. Oti but then averts his eyes once more. Taking a sip of root beer, Benjamin and Mr. Oti approach a woman in the bustling town. Oti affectionately embraces her with warmth. Towered over by Philomena, Mr. Oti eventually walks away, leaving Benjamin alone once more. Alone again, Benjamin fails to board a tram in time, waving a crutch in the air as it pulls away, leaving him behind. He cuts a forlorn figure as he slowly and resignedly plods away. As night falls, Benjamin makes his way determinedly down a quiet sidewalk. Upon arriving at the familiar clapboard retirement home, Queenie raises a sash window and peers out at him with concern. She stands at a basin, watching intently. After she leaves, he stares down at his wet, blistered hands with a sense of weariness. On the lawn, Benjamin turns and notices a man watching him intently from the street. This man, his father Thomas, gets into the back of a car with an elegant, gray-haired woman. Nearby, a girl gracefully pirouettes, her movements fluid and graceful. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy, sharing their company. Queenie takes Tizzy's hand in hers with gentle affection. Miss Fuller reads aloud to Daisy from an illustrated storybook, as Benjamin sits with them, listening. As night descends, Daisy, at the tender age of six and with long red hair, approaches Benjamin's bed. He sits up attentively as she beckons him silently. In the dark, Benjamin cautiously hobbles down a flight of stairs, navigating each step with care. In the room, table linen has been draped thoughtfully over some tables and chairs, forming a makeshift tent that adds a sense of whimsy."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "With a frown etched across his face, Benjamin firmly grips the armrests of his chair, straining with determination to rise to his feet. He utilizes his hands to adjust his leg, positioning it carefully. Once he manages to stand, his legs betray him, causing him to collapse. Observing this, the preacher extends both hands toward Benjamin in a gesture of encouragement. Summoning all his effort, Benjamin struggles back up, standing unsteadily before the attentive congregation, his posture noticeably crooked. Despite the instability, he takes a tentative step forward. The congregation responds to his courage with a round of applause and cheers of support. The preacher, caught mid-gesture, freezes with his arms raised high. Two men, filled with concern, quickly rise from their seats as the preacher suddenly keels over. At that moment, a white-robed pianist begins to play, filling the space with music. Outside, a flag flutters somberly at half-mast. Nearby, beside a grave, music drifts from a gramophone, accompanying the mourners, who include Benjamin, Queenie, and Tizzy. As the song concludes, an elderly man punctuates the silence by clapping two cymbals together. Amidst the gathering, Benjamin discreetly eavesdrops on a nearby conversation. He then makes his way to the back door, hobbling on crutches, to peer at Mr. Oti, who is holding court in the garden. Noticing Benjamin, Mr. Oti acknowledges him, prompting Benjamin to quickly duck out of sight. Inside, Mr. Oti, dressed sharply in a suit despite his small stature, joins Benjamin, taking a seat beside him. Benjamin turns with care to meet his gaze, and Mr. Oti, a black African, greets him with a friendly smile. Stepping outside, on a sunny street, Mr. Oti tips his hat to one of the three children engaged in a game of baseball. Benjamin, donning a large, ill-fitting fedora and battling to keep up with Mr. Oti on crutches, trails behind. As Mr. Oti waves to a passing tram, on board, Bushman shares space in a cage with apes, baring his teeth at three children huddled in the tram's whites-only section, who recoil in fear. Later, seated on a bench by towering stone columns, Benjamin presses his lips together, his expression contemplative, before offering Mr. Oti a smile and averting his gaze once more. Benjamin takes a sip of root beer as they walk into town, where they encounter a woman whom Oti embraces. Towering over Mr. Oti, she is Philomena, and as Mr. Oti walks away, Benjamin stands alone. He attempts, unsuccessfully, to catch a tram, waving a crutch in the air as it slips away from him, leaving him to trudge off, forlorn. That night, with determination, Benjamin makes his way down the sidewalk, arriving at a familiar clapboard retirement home. Queenie, inside, lifts a sash window, gazing down at him from above. Standing by a basin, she moves away, leaving Benjamin staring at his own hands, wet and blistered. On the lawn, Benjamin's attention is drawn to a man observing him from the street—his father, Thomas, who climbs into the back of a car beside an elegant, gray-haired woman. Nearby, a girl pirouettes, her movements graceful and fluid. Benjamin sits in a gathering with Oti, Philomena, Miss Fuller, and Daisy, while Queenie tenderly takes Tizzy's hand. Miss Fuller reads to Daisy from a storybook adorned with illustrations, and Benjamin sits quietly amongst them. Later, when night falls, a six-year-old Daisy, with her long red hair, approaches Benjamin's bed. He sits up, responding to her silent beckoning. Benjamin then hobbles down a flight of stairs in the enveloping darkness, discovering a makeshift tent formed by table linen draped over some tables and chairs."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Frowning, Benjamin struggles to stand up from his chair, adjusting his leg before collapsing. As the preacher gestures towards him, Benjamin rises shakily, prompting supportive cheers from the congregation. The preacher freezes with his arms aloft, leading two concerned men to rise abruptly as the preacher collapses. Meanwhile, a pianist in a white robe begins playing as a flag flies at half-mast outside. A gramophone plays music beside a grave where Benjamin, Queenie, and Tizzy stand among the mourners. After the song, an elderly man claps cymbals. Benjamin discreetly listens to a conversation before using crutches to view Mr. Oti holding court in the garden, then quickly ducks out of sight. Indoors, Mr. Oti sits beside Benjamin, engaging him with a smile. Out on the street, Mr. Oti tips his hat to children playing baseball as Benjamin, wearing an ill-fitting fedora, struggles to keep pace on crutches. Mr. Oti waves to a tram, and aboard, Bushman, sharing a cage with apes, intimidates children in the whites-only section. Benjamin and Mr. Oti sit by tall stone columns, exchanging thoughtful looks. Benjamin sips root beer before they meet a woman in town; Oti hugs her, then departs with Philomena. Left behind, Benjamin misses a tram, waving a crutch as it departs. He appears forlorn walking away. By night, Benjamin arrives at the retirement home, where Queenie observes him from a window. After tending to his blistered hands, Benjamin notices his father, Thomas, getting into a car with an elegant woman. Observing a young girl's pirouette, Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy, as Queenie holds Tizzy's hand. Miss Fuller reads to Daisy from a storybook as Benjamin joins them. At night, six-year-old Daisy, with long red hair, beckons Benjamin out of bed. He follows her down dark stairs to a tent made from table linen draped over furniture."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Frowning, Benjamin, who has been dealing with a degenerative condition affecting his mobility, plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands, which have become skilled at compensating for his body's weaknesses. Benjamin stands, then collapses, his frail condition evident. The preacher, a charismatic figure known for his impassioned sermons, points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation gathered in the historic church downtown. His posture's crooked, reflecting years of physical struggle. He takes a step, an act of bravery met with the congregation's clapping and cheering as they encourage his perseverance. The preacher freezes with his arms held aloft in dramatic pause. Two concerned men, wearing somber clothing for the occasion, rise sharply, and the preacher keels over dramatically. A white-robed pianist, part of the church's longstanding tradition of live music, starts to play. The flag outside, reflecting a time of mourning for a beloved community member, flies at half-mast. Music plays from a gramophone beside a grave, its vintage charm adding a timeless solemnity. Benjamin, Queenie, and Tizzy are amongst the mourners, standing by as the community pays its respects. As the song ends, a man in his twilight years, with the grace of seasoned experience, claps two cymbals together, punctuating the moment. An old guy, revered for his long life, looks on.\n\nBenjamin eavesdrops on a conversation, remaining ever curious about the world around him. Benjamin hobbles on crutches to the back door to watch Mr. Oti, a charismatic storyteller, holding court in the garden with his tales. He turns to see Benjamin, who ducks out of sight, preferring to listen from the shadows. Indoors, diminutive, sharp-suited Mr. Oti takes a seat beside Benjamin, a signal of their close companionship. Benjamin turns gingerly to meet his gaze, aware of the cultural richness Mr. Oti, the black African known for his wisdom and vibrant stories, brings to their friendship. Outside, on the sunny street, Mr. Oti, whose presence in the neighborhood has become legendary, tips his hat to one of three children playing baseball, a game that unites the local community. Wearing a large, ill-fitting fedora, Benjamin struggles to keep up with him on crutches, a testament to his determination. Mr. Oti waves to a tram, one of the few remaining in the city, a nostalgic mode of transport. On board, Bushman, a part of a traveling exhibit showcasing exotic animals, shares a cage with apes. He bares his teeth at three children in the whites-only section of the tram, highlighting the racial segregation still present in society. They cower, taken aback by the ferocity of his display. They sit on a bench by tall stone columns, part of the city's iconic old architecture. Benjamin presses his lips together and looks away, thoughtfully considering the societal issues around him. Benjamin smiles at Mr. Oti, then looks away again, contemplating their shared journey. Benjamin sips root beer, a comforting moment amidst the chaos of the day. They approach a woman in town, recognized as a local craftsman known for her skill. Oti hugs her, their friendship evident. Dwarfed by Philomena, a towering figure in the community known for her strength, Mr. Oti walks away. Alone, Benjamin fails to reach a tram in time, his physical limitations frustratingly apparent. He waves a crutch in the air as the tram glides off, a symbol of missed opportunities. Benjamin cuts a forlorn figure as he plods away, determined not to let his spirits be dampened. Night falls as Benjamin determinedly makes his way down a sidewalk lined with old streetlamps casting pools of light. As he arrives at the familiar clapboard retirement home, Queenie, a resident known for her kindness, lifts a sash window and stares down at him, recognizing his struggle. At a basin, she goes and he stares at his wet, blistered hands, raw from the day's exertions. On the lawn, Benjamin turns to see a man, who he realizes is his estranged father, Thomas, watching him from the street. The man, his father, Thomas, gets into the back of a car, a sleek vehicle driven by an elegant, gray-haired woman who exudes an air of sophistication. The girl, a young ballerina in training, pirouettes with the grace of long practice. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy, finding solace in their company. Queenie takes Tizzy's hand, a gesture of friendship. Miss Fuller reads to Daisy from an illustrated storybook, captivating her young imagination. Benjamin sits with them, appreciating the simple joy of shared stories. Night, age six, with long red hair and a spirited demeanor, Daisy approaches Benjamin's bed. He sits up, intrigued by her presence. She beckons him, inviting him into her world. Benjamin hobbles down a flight of stairs in the dark, guided by Daisy's enthusiasm. Table linen has been thrown over some tables and chairs to form a tent, a childhood fort fostering creativity and adventure."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up He adjusts his leg with his hands Benjamin stands then collapses The preacher points both hands at Benjamin Benjamin struggles to his feet and stands shakily before the congregation On board Mr Oti waves to a tram His posture's crooked He takes a step Philomena Miss Fuller and Daisy The man his father Thomas gets into the back of a car The congregation clap and cheer him on The preacher freezes with his arms held aloft Daisy approaches Benjamin's bed Two concerned men rise sharply and the preacher keels over A whiterobed pianist starts to play Queenie lifts a sash window and stares down at him Night The flag outside flies at halfmast The girl pirouettes Music plays from a gramophone beside a grave The preacher freezes with his arms held aloft Benjamin Queenie and Tizzy are amongst the mourners As the song ends a man claps two cymbals together An old guy Benjamin eavesdrops on a conversation Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden Benjamin sits with Oti He turns to see Benjamin who ducks out of sight Benjamin sips root beer Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up Indoors diminutive sharpsuited Mr Oti takes a seat beside Benjamin Benjamin turns gingerly to meet his gaze The black African Mr Oti smiles Outside on the sunny street Mr Oti tips his hat to one of three children playing baseball Wearing a large illfitting fedora A whiterobed pianist starts to play An old guy Benjamin struggles to keep up with him on crutches Mr Oti waves to a tram Oti hugs her Dwarfed by Philomena On board Bushman shares a cage with apes He bares his teeth at three children in the whitesonly section of the tram They cower They sit on a bench by tall stone columns Benjamin presses his lips together and looks away thoughtfully Benjamin smiles at Mr Oti then looks away again The preacher points both hands at Benjamin Music plays from a gramophone beside a grave Benjamin sips root beer They approach a woman in town Oti hugs her Benjamin smiles at Mr Oti then looks away again Benjamin Queenie and Tizzy are amongst the mourners Dwarfed by Philomena Benjamin sits with them Mr Oti walks away Alone Table linen has been thrown over some tables and chairs to form a tent Benjamin fails to reach a tram in time He waves a crutch in the air as the tram glides off He takes a step Benjamin cuts a forlorn figure as he plods away As the song ends a man claps two cymbals together Night Benjamin determinedly makes his way down a sidewalk Benjamin stands then collapses As he arrives at the familiar clapboard retirement home Queenie lifts a sash window and stares down at him At a basin She goes and he stares at his wet blistered hands On the lawn Benjamin turns to see a man watching him from the street The man his father Thomas gets into the back of a car They sit on a bench by tall stone columns He waves a crutch in the air as the tram glides off An elegant grayhaired woman He adjusts his leg with his hands The girl pirouettes Benjamin sits with Oti Philomena Miss Fuller and Daisy Queenie takes Tizzy's hand Miss Fuller reads to Daisy from an illustrated storybook Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden She beckons him Benjamin sits with them On the lawn Night age six with long red hair Daisy approaches Benjamin's bed He sits up She beckons him Benjamin hobbles down a flight of stairs in the dark Benjamin struggles to keep up with him on crutches Table linen has been thrown over some tables and chairs to form a tent His posture's crooked"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands. Benjamin stands then collapses. The preacher points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation. His posture's crooked. He takes a step. The congregation clap and cheer him on. The preacher freezes with his arms held aloft. Two concerned men rise sharply and the preacher keels over. A whiterobed pianist starts to play. The flag outside flies at halfmast. Music plays from a gramophone beside a grave. Benjamin Queenie and Tizzy are amongst the mourners. As the song ends a man claps two cymbals together. An old guy. Benjamin eavesdrops on a conversation. Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden. He turns to see Benjamin who ducks out of sight. Indoors. diminutive sharpsuited Mr Oti takes a seat beside Benjamin. Benjamin turns gingerly to meet his gaze. The black African Mr Oti smiles. Outside on the sunny street. Mr Oti tips his hat to one of three children playing baseball. Wearing a large illfitting fedora. Benjamin struggles to keep up with him on crutches. Mr Oti waves to a tram. On board. Bushman shares a cage with apes. He bares his teeth at three children in the whitesonly section of the tram. They cower. They sit on a bench by tall stone columns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Benjamin presses his lips together and looks away thoughtfully. Benjamin smiles at Mr Oti then looks away again. Benjamin sips root beer. They approach a woman in town. Oti hugs her. Dwarfed by Philomena. Mr Oti walks away Alone. Benjamin fails to reach a tram in time. He waves a crutch in the air as the tram glides off. Benjamin cuts a forlorn figure as he plods away. Night. Benjamin determinedly makes his way down a sidewalk. As he arrives at the familiar clapboard. retirement home. Queenie lifts a sash window and stares down at him. At a basin. She goes and he stares at his wet blistered hands. On the lawn. Benjamin turns to see a man watching him from the street. The man his father Thomas gets into the back of a car. An elegant grayhaired woman. The girl pirouettes. Benjamin sits with Oti. Philomena Miss Fuller and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated storybook. Benjamin sits with them. Night age six with long red hair. Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands. Benjamin stands then collapses. The preacher points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation. His posture's crooked. He takes a step. The congregation clap and cheer him on. The preacher freezes with his arms held aloft. Two concerned men rise sharply and the preacher keels over. A whiterobed pianist starts to play. The flag outside flies at halfmast. Music plays from a gramophone beside a grave. Benjamin Queenie and Tizzy are amongst the mourners. As the song ends a man claps two cymbals together. An old guy. Benjamin eavesdrops on a conversation. Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden. He turns to see Benjamin who ducks out of sight. Indoors. diminutive sharpsuited Mr Oti takes a seat beside Benjamin. Benjamin turns gingerly to meet his gaze. The black African Mr Oti smiles. Outside on the sunny street. Mr Oti tips his hat to one of three children playing baseball. Wearing a large illfitting fedora. Benjamin struggles to keep up with him on crutches. Mr Oti waves to a tram. On board. Bushman shares a cage with apes. He bares his teeth at three children in the whitesonly section of the tram. They cower. They sit on a bench by tall stone columns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Benjamin presses his lips together and looks away thoughtfully. Benjamin smiles at Mr Oti then looks away again. Benjamin sips root beer. They approach a woman in town. Oti hugs her. Dwarfed by Philomena. Mr Oti walks away Alone. Benjamin fails to reach a tram in time. He waves a crutch in the air as the tram glides off. Benjamin cuts a forlorn figure as he plods away. Night. Benjamin determinedly makes his way down a sidewalk. As he arrives at the familiar clapboard. retirement home. Queenie lifts a sash window and stares down at him. At a basin. She goes and he stares at his wet blistered hands. On the lawn. Benjamin turns to see a man watching him from the street. The man his father Thomas gets into the back of a car. An elegant grayhaired woman. The girl pirouettes. Benjamin sits with Oti. Philomena Miss Fuller and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated storybook. Benjamin sits with them. Night age six with long red hair. Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands. Benjamin stands then collapses. The preacher points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation. His posture's crooked. He takes a step. The congregation clap and cheer him on. The preacher freezes with his arms held aloft. Two concerned men rise sharply and the preacher keels over. A whiterobed pianist starts to play. The flag outside flies at halfmast. Music plays from a gramophone beside a grave. Benjamin Queenie and Tizzy are amongst the mourners. As the song ends a man claps two cymbals together. An old guy. Benjamin eavesdrops on a conversation. On the lawn. Benjamin turns to see a man watching him from the street. The man his father Thomas gets into the back of a car. An elegant grayhaired woman. The girl pirouettes. Benjamin sits with Oti. Philomena Miss Fuller and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated storybook. Benjamin sits with them. Night age six with long red hair. Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up. He adjusts his leg with his hands. Benjamin stands then collapses. The preacher points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the congregation. His posture's crooked. He takes a step. Benjamin sits with them. Night age six with long red hair. Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Frowning, the elephant plants its trunk on the armrests of its chair and labors determinedly to stand up. The elephant adjusts its leg with its trunk. The elephant stands, then collapses. The knight points both hands at the elephant. The elephant struggles to its feet and stands shakily before the congregation. Its posture's crooked. It takes a step. The congregation clap and cheer it on. The knight freezes with its arms held aloft. Two concerned penguins rise sharply, and the knight keels over. A white-robed dragon starts to play. The flag outside flies at half-mast. Music plays from a gramophone beside a grave. The elephant, the queen, and the artist are amongst the mourners. As the song ends, a wizard claps two cymbals together. An old pirate. The elephant eavesdrops on a conversation. The elephant hobbles on crutches to the back door to watch the lion holding court in the garden. The lion turns to see the elephant, who ducks out of sight. Indoors, diminutive, sharp-suited the lion takes a seat beside the elephant. The elephant turns gingerly to meet its gaze. The black African, the lion, smiles. Outside, on the sunny street, the lion tips its hat to one of three raccoons playing baseball. Wearing a large, ill-fitting fedora, the elephant struggles to keep up with the lion on crutches. The lion waves to a tram. On board, the giraffe shares a cage with apes. The giraffe bares its teeth at three raccoons in the whites-only section of the tram. They cower. They sit on a bench by tall stone columns. The elephant presses its lips together and looks away, thoughtfully. The elephant smiles at the lion, then looks away again. The elephant sips root beer. They approach a woman in town. The lion hugs her. Dwarfed by the giant, the lion walks away. Alone, the elephant fails to reach a tram in time. It waves a crutch in the air as the tram glides off. The elephant cuts a forlorn figure as it plods away. Night, the elephant determinedly makes its way down a sidewalk. As it arrives at the familiar clapboard retirement home, the queen lifts a sash window and stares down at the elephant. At a basin. The queen goes and the elephant stares at its wet, blistered hands. On the lawn, the elephant turns to see a clown watching it from the street. The clown, its father, the king, gets into the back of a car. An elegant, gray-haired woman. The fairy pirouettes. The elephant sits with the lion, the giant, the teacher, and the bird. The queen takes the artist's hand. The teacher reads to the bird from an illustrated storybook. The elephant sits with them. Night, age six, with long red hair, the bird approaches the elephant's bed. It sits up. The bird beckons it. The elephant hobbles down a flight of stairs in the dark. Table linen has been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Frowning, Benjamin plants his hands on the handlebars of his bicycle and labors determinedly to stand up. He adjusts his backpack with his hands. Benjamin stands, then collapses. The conductor points both hands at Benjamin. Benjamin struggles to his feet and stands shakily before the assembly. His posture's crooked. He takes a step. The assembly clap and cheer him on. The conductor freezes with his arms held aloft. Two concerned men rise sharply, and the conductor keels over. A white-robed guitarist starts to play. The kite outside flies at half-mast. Music plays from a trumpet beside a willow tree. Benjamin, Queenie, and Tizzy are amongst the spectators. As the song ends, a man claps two tambourines together. An old guy. Benjamin eavesdrops on a conversation. Benjamin hobbles on crutches to the back door to watch Mr. Oti holding court in the orchard. He turns to see Benjamin, who ducks out of sight. Indoors, diminutive, sharp-suited Mr. Oti takes a seat beside Benjamin. Benjamin turns gingerly to meet his gaze. The black African, Mr. Oti, smiles. Outside, on the sunny avenue, Mr. Oti tips his hat to one of three children playing hopscotch. Wearing a large, ill-fitting beret, Benjamin struggles to keep up with him on crutches. Mr. Oti waves to a ferry. On board, Bushman shares a pen with parrots. He bares his teeth at three children in the whites-only section of the ferry. They cower. They sit on a bench by tall sandstone sculptures. Benjamin presses his lips together and looks away, thoughtfully. Benjamin smiles at Mr. Oti, then looks away again. Benjamin sips lemonade. They approach a woman in town. Oti embraces her. Dwarfed by Philomena, Mr. Oti walks away. Alone, Benjamin fails to reach a ferry in time. He waves a crutch in the air as the ferry glides off. Benjamin cuts a forlorn figure as he plods away. Night, Benjamin determinedly makes his way down a trail. As he arrives at the familiar brick boarding house, Queenie lifts a sliding window and stares down at him. At a fountain. She goes and he stares at his wet, blistered hands. On the lawn, Benjamin turns to see a man watching him from the sidewalk. The man, his father, Thomas, gets into the back of a carriage. An elegant, gray-haired woman. The girl pirouettes. Benjamin sits with Oti, Philomena, Miss Fuller, and Daisy. Queenie takes Tizzy's hand. Miss Fuller reads to Daisy from an illustrated comic book. Benjamin sits with them. Night, age six, with long red hair, Daisy approaches Benjamin's bed. He sits up. She beckons him. Benjamin hobbles down a flight of stairs in the dark. Beach towels have been thrown over some tables and chairs to form a tent."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Frowning, Benjamin leans back in his chair and gently claps his hands on the armrests. He touches his leg with his hands. Benjamin rests, then slides to the floor. The preacher gestures excitedly at Benjamin. Benjamin scrambles to his feet and sways unsteadily before the congregation. His posture's bent. He hops forward. The congregation wave and shout encouragingly. The preacher pauses with his arms outstretched. Two concerned men stand slowly, and the preacher tumbles forward. A white-robed pianist begins to hum. The flag outside sways in the breeze. Music drifts from a gramophone beside a grave. Benjamin, Queenie, and Tizzy are amongst the mourners. As the song ends, a man taps two cymbals together. An old guy. Benjamin listens secretly to a conversation. Benjamin limps on crutches to the back door to observe Mr. Oti entertaining guests in the garden. He glances to see Benjamin, who slips out of view. Indoors, diminutive, sharp-suited Mr. Oti reclines beside Benjamin. Benjamin swivels carefully to meet his gaze. The black African, Mr. Oti, grins. Outside, on the sunny street, Mr. Oti doffs his hat to one of three children playing baseball. Wearing a large, ill-fitting fedora, Benjamin struggles to follow him on crutches. Mr. Oti signals to a tram. On board, Bushman sits in a cage with apes. He grins at three children in the whites-only section of the tram. They shrink back. They perch on a bench by tall stone columns. Benjamin bites his lip and glances away, thoughtfully. Benjamin nods at Mr. Oti, then turns away again. Benjamin tastes root beer. They greet a woman in town. Oti shakes her hand. Dwarfed by Philomena, Mr. Oti saunters away. Alone, Benjamin misses a tram just in time. He lifts a crutch in the air as the tram zooms off. Benjamin watches forlornly as he wanders away. Night, Benjamin resolutely strides down a sidewalk. As he approaches the familiar clapboard retirement home, Queenie pushes up a sash window and gazes down at him. At a basin. She departs and he examines his wet, blistered hands. On the lawn, Benjamin glances back to see a man observing him from the street. The man, his father, Thomas, steps into the back of a car. An elegant, gray-haired woman. The girl twirls. Benjamin relaxes with Oti, Philomena, Miss Fuller, and Daisy. Queenie squeezes Tizzy's hand. Miss Fuller narrates to Daisy from an illustrated storybook. Benjamin sits with them. Night, age six, with long red hair, Daisy approaches Benjamin's bed. He leans forward. She gestures to him. Benjamin descends a flight of stairs in the dark. Table linen drapes over some tables and chairs to form a tent."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Scowling, the television plants its elbows on the armrests of the lamp and labors determinedly to stand up. It adjusts its wheel with its elbows. The television stands, then collapses. The librarian points both elbows at the television. The television struggles to its feet and stands shakily before the orchestra. Its stance is crooked. It takes a step. The orchestra clap and cheer it on. The librarian freezes with its elbows held aloft. Two worried vases rise sharply, and the librarian keels over. A white-robed typewriter starts to play. The kite outside flies at half-mast. Music plays from a jukebox beside a statue. The television, the hammer, and the sock are amongst the spectators. As the melody ends, an orange claps two tambourines together. An old fish. The television eavesdrops on a dialogue. The television hobbles on pencils to the back porch to watch the cactus holding court in the courtyard. It turns to see the television, which ducks out of sight. Indoors, tiny, sharp-suited the cactus takes a seat beside the television. The television turns gingerly to meet its gaze. The black dresser, the cactus, grins. Outside, on the sunny path, the cactus tips its cap to one of three squirrels playing hopscotch. Wearing a large, ill-fitting beret, the television struggles to keep up with it on pencils. The cactus waves to a helicopter. On board, the raccoon shares a cage with tigers. It bares its teeth at three squirrels in the exclusives-only section of the helicopter. They cower. They sit on a stool by tall wooden columns. The television presses its lips together and looks away, thoughtfully. The television smiles at the cactus, then looks away again. The television sips lemonade. They approach a watermelon in town. The cactus hugs it. Dwarfed by the giraffe, the cactus walks away. Alone, the television fails to reach a helicopter in time. It waves a pencil in the air as the helicopter glides off. The television cuts a forlorn figure as it plods away. Night, the television determinedly makes its way down a sidewalk. As it arrives at the familiar stone warehouse, the hammer lifts a sash curtain and stares down at it. At a fountain. It goes and it stares at its wet, blistered wheels. On the meadow, the television turns to see a penguin watching it from the road. The penguin, its mentor, the book, gets into the back of a truck. An elegant, gray-haired guitar. The lamp pirouettes. The television sits with the cactus, the giraffe, the violin, and the drum. The hammer takes the sock's elbow. The violin reads to the drum from an illustrated pamphlet. The television sits with them. Night, age six, with long red shoelaces, the drum approaches the television's mattress. It sits up. It beckons it. The television hobbles down a flight of ladders in the dark. Table cloth has been thrown over some stools and lamps to form a pavilion."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Scowling, Jeremy places his feet on the edge of his desk and maneuvers clumsily to sit down. He rotates his arm with his feet. Jeremy sits, then topples. The musician waves both feet at Jeremy. Jeremy crawls to his knees and kneels nervously before the audience. His posture's slouched. He hops a step. The audience shout and whistle him on. The musician halts with his feet held aloft. Two worried women sit quickly, and the musician tumbles over. A red-hatted violinist begins to sing. The kite outside sways at half-mast. Melodies echo from a phonograph beside a statue. Jeremy, Alice, and Clara are amongst the visitors. As the tune finishes, a woman jingles two tambourines together. An old lady. Jeremy gawks at a conversation. Jeremy stumbles on skates to the window to watch Mrs. Lee entertaining in the patio. She turns to notice Jeremy, who slides out of view. Indoors, tall, fashionable Mrs. Lee stretches on the sofa beside Jeremy. Jeremy peers awkwardly to meet her eyes. The brown European, Mrs. Lee, laughs. Outside, on the shaded path, Mrs. Lee lifts her scarf to one of three pets chasing frisbees. Wearing a small, tight bonnet, Jeremy slides to keep up with her on skates. Mrs. Lee points to a cab. Onboard, Sailor shares a compartment with parrots. He growls at three pets in the visitors-only section of the cab. They cringe. They rest on a stool by short metal pillars. Jeremy purses his eyes and gazes aside, silently. Jeremy grins at Mrs. Lee, then peers aside again. Jeremy sniffs ginger ale. They advance to a man in town. Lee embraces him. Overshadowed by Charles, Mrs. Lee strides away. Alone, Jeremy misses a ferry in time. He shakes a skate in the sky as the ferry sails off. Jeremy strikes a miserable figure as he wanders away. Dusk, Jeremy cheerfully strolls along a pathway. As he reaches the unfamiliar brick nursing home, Alice pulls a net curtain and glances up at him. At a fountain. She departs and he glances at his dry, calloused feet. On the porch, Jeremy twists to spot a woman observing him from the pathway. The woman, his mother, Eleanor, climbs into the front of a truck. A charming, blond-haired man. The boy leaps. Jeremy reclines with Lee, Charles, Miss Green, and Lily. Alice grasps Clara's feet. Miss Green recites to Lily from a colorful comic book. Jeremy reclines with them. Evening, age three, with short black hair, Lily skips to Jeremy's couch. He lies down. She gestures to him. Jeremy slides down a ladder of steps in the moonlight. Fabric covers have been draped over several stools and couches to form a fort."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Frowning, Benjamin rests his hands on the handlebars of his scooter and struggles persistently to lie down. He adjusts his hat with his hands. Benjamin reclines, then springs up. The preacher waves both hands at Benjamin. Benjamin wrestles with a pillow and lies awkwardly before the congregation. His position's lopsided. He takes a breath. The congregation stomp and nod at him. The preacher freezes with his arms folded. Two concerned women sit slowly, and the preacher leaps up. A green-suited guitarist starts to strum. The kite outside flies at nose-height. Melodies play from a record player beside a fountain. Benjamin, Queenie, and Tizzy are amongst the listeners. As the tune ends, a woman clangs two pots together. A young girl. Benjamin listens to a whisper. Benjamin wheels on a skateboard to the front gate to watch Mr. Oti juggling lemons in the yard. He turns to see Benjamin, who sneaks into view. Outside, towering, casually-dressed Mr. Oti sits down beside Benjamin. Benjamin turns quickly to meet his gaze. The white European, Mr. Oti, chuckles. Inside, on the shaded porch, Mr. Oti tosses his cap to one of three children chasing butterflies. Wearing a small, snugly fitting cap, Benjamin struggles to catch up with him on the skateboard. Mr. Oti gestures to a bicycle. Onboard, Bushman shares a perch with parrots. He snaps his jaws at three adults in the artists-only section of the bicycle. They gape. They lean on a fence by short wooden sculptures. Benjamin hums under his breath and turns away, casually. Benjamin laughs with Mr. Oti, then turns away again. Benjamin chews popcorn. They encounter an artist in the park. Oti greets her. Overshadowed by Theodore, Mr. Oti runs away. Alone, Benjamin triumphantly reaches a bicycle in time. He waves a skateboard in the air as the bicycle speeds off. Benjamin cuts a joyful figure as he dances away. Dawn, Benjamin eagerly paces his way across a park. As he reaches the unfamiliar brick mansion, Queenie slides a glass door and peers up at him. At a fountain. She puffs and he splashes his muddy, swollen shoes. On the roof, Benjamin turns to see a woman watching him from the window. The woman, his sister, Thomasina, climbs into the front of a bus. A youthful, blonde-haired man. The boy somersaults. Benjamin stands with Oti, Theodore, Mr. Fuller, and Daisy. Queenie takes Leon's shoe. Mr. Fuller sings to Daisy from a handwritten folio. Benjamin stands with them. Dawn, age fourteen, with short blonde hair, Daisy approaches Benjamin's chair. He stands up. She calls him. Benjamin slides down a bannister in the dawn. Picnic blankets have been draped over some desks and dressers to form a cave."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Grinning, Jessica places her feet on the pedals of her tricycle and skates casually to lie down. She twirls her scarf with her fingers. Jessica reclines, then springs up. The firefighter shakes both feet at Jessica. Jessica fidgets to her knees and kneels steadily before the audience. Her stance's straightened. She jumps forward. The audience stomp and boo her off. The firefighter unfreezes with his feet lowered. Two clumsy women sit slowly, and the firefighter rises up. A black-draped violinist stops to paint. The kite indoors hangs at full-mast. Silence descends from a megaphone under a tree. Jessica, Martha, and Lenny are amidst the dancers. When the dance begins, a woman bangs two drums together. A young gal. Jessica listens to a melody. Jessica skips on wheelchairs to the front gate to hear Miss Li singing songs in the courtyard. She turns to greet Jessica, who peeks into view. Outdoors, towering, blunt-jacketed Miss Li stands up next to Jessica. Jessica turns lazily to dodge her stare. The pale European, Miss Li, frowns. Inside, under the rainy bridge, Miss Li throws her scarf to one of three cats baking cookies. Sporting a tiny, perfect beret, Jessica tries to fall behind her on wheelchairs. Miss Li shouts at a scooter. Beside, Clownfish shares a leash with hamsters. She hides her eyes from three cats in the colorful area of the scooter. They shout. They dance on a fence by short wooden fences. Jessica opens her eyes widely and turns toward, sleepily. Jessica frowns at Miss Li, then turns toward again. Jessica guzzles ginger ale. They leave a child at school. Li high-fives him. Overshadowed by Oliver, Miss Li sits down. Accompanied, Jessica succeeds to miss a scooter in place. She lowers a wheelchair on the ground as the scooter soars on. Jessica paints a joyful picture as she skips forward. Day, Jessica casually finds her path up a road. As she departs from the unfamiliar stone school, Martha drops a barn door and looks up at her. In a river. She arrives and he overlooks at his dry, bruised feet. In the attic, Jessica ignores to watch a woman hiding him from the yard. The woman, her owner, Samuel, jumps out of the front of a bus. A clumsy, bald-headed girl. The boy swims. Jessica stands with Li, Oliver, Miss Greene, and Nathan. Martha leaves Lenny's foot. Miss Greene writes for Nathan from an empty notepad. Jessica stands without them. Day, height ten, with short blonde hair, Nathan reaches Jessica's window. She lies down. He dismisses her. Jessica skips up an elevator in the sun. Wallpaper has been pulled among many lamps and rugs to form a house."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Benjamin, struggling with mobility, attempts to stand before a supportive congregation. Despite collapsing initially, he rises with difficulty, supported by their cheers. Meanwhile, a preacher collapses, and a pianist begins to play. A funeral follows, attended by Benjamin, Queenie, and Tizzy. Benjamin listens to conversations and observes Mr. Oti in the garden. Mr. Oti, a friendly figure, travels with Benjamin, who struggles to keep pace on crutches. They encounter Bushman, an ape, who frightens children on a tram. Benjamin, alone, misses a tram and trudges away. At night, he reaches a retirement home, where Queenie watches him. Benjamin reflects on encounters with his father, Thomas, and friends, including Mr. Oti, Philomena, Miss Fuller, and Daisy. Young Daisy invites Benjamin to a makeshift tent formed by table linens."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Table linen has been thrown over some tables and chairs to form a tent Benjamin hobbles down a flight of stairs in the dark She beckons him He sits up Daisy approaches Benjamin's bed Night age six with long red hair Benjamin sits with them Miss Fuller reads to Daisy from an illustrated storybook Queenie takes Tizzy's hand Philomena Miss Fuller and Daisy Benjamin sits with Oti The girl pirouettes An elegant grayhaired woman The man his father Thomas gets into the back of a car Benjamin turns to see a man watching him from the street On the lawn She goes and he stares at his wet blistered hands At a basin Queenie lifts a sash window and stares down at him retirement home As he arrives at the familiar clapboard Benjamin determinedly makes his way down a sidewalk Night Benjamin cuts a forlorn figure as he plods away He waves a crutch in the air as the tram glides off Benjamin fails to reach a tram in time Mr Oti walks away Alone Dwarfed by Philomena Oti hugs her They approach a woman in town Benjamin sips root beer Benjamin smiles at Mr Oti then looks away again Benjamin presses his lips together and looks away thoughtfully They sit on a bench by tall stone columns They cower He bares his teeth at three children in the whitesonly section of the tram Bushman shares a cage with apes On board Mr Oti waves to a tram Benjamin struggles to keep up with him on crutches Wearing a large illfitting fedora Mr Oti tips his hat to one of three children playing baseball Outside on the sunny street The black African Mr Oti smiles Benjamin turns gingerly to meet his gaze diminutive sharpsuited Mr Oti takes a seat beside Benjamin Indoors He turns to see Benjamin who ducks out of sight Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden Benjamin eavesdrops on a conversation An old guy As the song ends a man claps two cymbals together Benjamin Queenie and Tizzy are amongst the mourners Music plays from a gramophone beside a grave The flag outside flies at halfmast A whiterobed pianist starts to play Two concerned men rise sharply and the preacher keels over The preacher freezes with his arms held aloft The congregation clap and cheer him on He takes a step His posture's crooked Benjamin struggles to his feet and stands shakily before the congregation The preacher points both hands at Benjamin Benjamin stands then collapses He adjusts his leg with his hands Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Benjamin eavesdrops on a conversation Miss Fuller reads to Daisy from an illustrated storybook Benjamin smiles at Mr Oti then looks away again Benjamin stands then collapses She goes and he stares at his wet blistered hands Mr Oti tips his hat to one of three children playing baseball Philomena Miss Fuller and Daisy They sit on a bench by tall stone columns Two concerned men rise sharply and the preacher keels over Benjamin sits with them Benjamin hobbles down a flight of stairs in the dark He waves a crutch in the air as the tram glides off Wearing a large illfitting fedora The congregation clap and cheer him on retirement home Bushman shares a cage with apes Queenie lifts a sash window and stares down at him Table linen has been thrown over some tables and chairs to form a tent Benjamin determinedly makes his way down a sidewalk They cower Benjamin sits with Oti As he arrives at the familiar clapboard Night age six with long red hair He sits up diminutive sharpsuited Mr Oti takes a seat beside Benjamin On the lawn The flag outside flies at halfmast The preacher points both hands at Benjamin The black African Mr Oti smiles He adjusts his leg with his hands The preacher freezes with his arms held aloft He turns to see Benjamin who ducks out of sight Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up An old guy Night Benjamin cuts a forlorn figure as he plods away They approach a woman in town As the song ends a man claps two cymbals together Benjamin fails to reach a tram in time Oti hugs her Benjamin struggles to his feet and stands shakily before the congregation The man his father Thomas gets into the back of a car A whiterobed pianist starts to play Daisy approaches Benjamin's bed Queenie takes Tizzy's hand Dwarfed by Philomena The girl pirouettes Benjamin turns to see a man watching him from the street On board Benjamin presses his lips together and looks away thoughtfully Outside on the sunny street Mr Oti waves to a tram An elegant grayhaired woman Benjamin struggles to keep up with him on crutches At a basin Benjamin sips root beer She beckons him He bares his teeth at three children in the whitesonly section of the tram His posture's crooked Benjamin turns gingerly to meet his gaze Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden Indoors Benjamin Queenie and Tizzy are amongst the mourners Mr Oti walks away Alone He takes a step Music plays from a gramophone beside a grave"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Benjamin presses his lips together and looks away thoughtfully Benjamin smiles at Mr Oti then looks away again Benjamin sips root beer They approach a woman in town Oti hugs her Dwarfed by Philomena Mr Oti walks away Alone Benjamin fails to reach a tram in time He waves a crutch in the air as the tram glides off Benjamin cuts a forlorn figure as he plods away Night Benjamin determinedly makes his way down a sidewalk As he arrives at the familiar clapboard retirement home Queenie lifts a sash window and stares down at him At a basin She goes and he stares at his wet blistered hands On the lawn Benjamin turns to see a man watching him from the street The man his father Thomas gets into the back of a car An elegant grayhaired woman The girl pirouettes Benjamin sits with Oti Philomena Miss Fuller and Daisy Queenie takes Tizzy's hand Miss Fuller reads to Daisy from an illustrated storybook Benjamin sits with them Night age six with long red hair Daisy approaches Benjamin's bed He sits up She beckons him Benjamin hobbles down a flight of stairs in the dark Table linen has been thrown over some tables and chairs to form a tent Frowning Benjamin plants his hands on the armrests of his chair and labors determinedly to stand up He adjusts his leg with his hands Benjamin stands then collapses The preacher points both hands at Benjamin Benjamin struggles to his feet and stands shakily before the congregation His posture's crooked He takes a step The congregation clap and cheer him on The preacher freezes with his arms held aloft Two concerned men rise sharply and the preacher keels over A whiterobed pianist starts to play The flag outside flies at halfmast Music plays from a gramophone beside a grave Benjamin Queenie and Tizzy are amongst the mourners As the song ends a man claps two cymbals together An old guy Benjamin eavesdrops on a conversation Benjamin hobbles on crutches to the back door to watch Mr Oti holding court in the garden He turns to see Benjamin who ducks out of sight Indoors diminutive sharpsuited Mr Oti takes a seat beside Benjamin Benjamin turns gingerly to meet his gaze The black African Mr Oti smiles Outside on the sunny street Mr Oti tips his hat to one of three children playing baseball Wearing a large illfitting fedora Benjamin struggles to keep up with him on crutches Mr Oti waves to a tram On board Bushman shares a cage with apes He bares his teeth at three children in the whitesonly section of the tram They cower They sit on a bench by tall stone columns"
        }
      ]
    }
  ]
}