{
  "ground_truth": "Daisy crawls into the makeshift den, and Benjamin follows on his hands and knees. Kneeling beneath the table, Benjamin strikes a match and carefully lights a candle, whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller whisks up the sheet, exposing them. Daisy obeys. Miss Fuller scowls at Benjamin. Wearing a nightgown, she starts up the stairs, using her cane. Dejected, Benjamin leans out of the den with his head hung. Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows, staring at the floor. Suddenly resolute, Benjamin rises, resting on his cane. She embraces him. She gently strokes his back and kisses him on the forehead. She scratches her head thoughtfully as he walks away. Benjamin hooks his cane on the end of his bed and gets in. Old man Daws is in the bed opposite. Grainy old footage shows the lightning striking him. Sepia footage of Mr. Daws collapsing by a mailbox follows. Lying in his bed, Daws exhales a cloud of wispy, white cigarette smoke and stares off in thought. Benjamin turns onto his side and sinks down beneath the covers. Smiling, Oti takes a step back, then turns and walks briskly out of the door. Straight-backed and without the use of a cane, Benjamin goes to a window and peers out through narrowed eyes. Carrying a suitcase, Oti crosses the road below, bathed in the orange glow of a streetlamp. A woman with a dog sits beside Benjamin at a piano. He joins in, and they play together. Benjamin washes himself in the bath. He stares down. Caroline leaves Daisy's bedside. On TV, Hurricane Katrina is shown. A nurse arrives. They stand by a window at the foot of the bed. The nurse strides off to assist a colleague, and Caroline drifts over to the empty bed beside her mother's. Cast in cold, blue light from the window, she takes her hands out of the pockets of her dark body-warmer and sits cross-legged on the mattress with the diary in her lap. Mr. Daws sits beside him on a bench. Grainy footage shows lightning striking Mr. Daws in a field, sending up a plume of smoke. A man approaches them on the dock. The captain glances around. Benjamin looks at a young guy. Benjamin stands up. The bearded captain wears braces and a peaked cap. He nods. Benjamin boards the tugboat Chelsea. The captain leans out of the wheelhouse. He swabs the decks. In the wheelhouse, Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Daisy creeps into the temporary refuge, and Benjamin trails on his palms and knees. Kneeling underneath the table, Benjamin ignites a match and cautiously kindles a candle, whose warm radiance outlines them behind the white curtain. Daisy grins. She delicately reaches out to caress his grinning visage. Benjamin maintains her look as she caresses his bristly cheek. Miss Fuller flutters up the sheet, revealing them. Daisy complies. Miss Fuller glares at Benjamin. Clad in a nightdress, she ascends the stairs, utilizing her walking stick. Crestfallen, Benjamin leans out of the refuge with his head lowered. Queenie emerges from the cellar in her robe and glimpses him kneeling in the darkness, gazing at the ground. Suddenly determined, Benjamin stands, leaning on his walking stick. She hugs him. She gently caresses his back and kisses him on the brow. She scratches her head pensively as he departs. Benjamin hooks his walking stick on the end of his bed and climbs in. Old man Daws is in the bed across. Grainy old video shows the lightning striking him. Sepia video of Mr. Daws collapsing by a mailbox follows. Reclining in his bed, Daws exhales a puff of wispy, white cigarette smoke and gazes off in contemplation. Benjamin turns onto his flank and sinks down beneath the blankets. Grinning, Oti steps back, then turns and strides briskly out of the doorway. Erect and without the use of a walking stick, Benjamin goes to a window and looks out through narrowed eyes. Carrying a suitcase, Oti crosses the street below, bathed in the orange radiance of a streetlamp. A woman with a canine sits beside Benjamin at a piano. He joins in, and they perform together. Benjamin cleanses himself in the tub. He gazes down. Caroline departs from Daisy's bedside. On TV, Hurricane Katrina is displayed. A nurse arrives. They stand by a window at the foot of the bed. The nurse strides off to aid a colleague, and Caroline drifts over to the vacant bed beside her mother's. Cast in cool, blue illumination from the window, she removes her hands from the pockets of her dark vest and sits cross-legged on the mattress with the journal in her lap. Mr. Daws sits beside him on a bench. Grainy video shows lightning striking Mr. Daws in a field, sending up a plume of smoke. A man approaches them on the pier. The captain looks around. Benjamin gazes at a young fellow. Benjamin stands. The bearded captain wears suspenders and a peaked cap. He nods. Benjamin boards the tugboat Chelsea. The captain leans out of the wheelhouse. He mops the decks. In the wheelhouse, Mike leans towards Benjamin. Mike squints pensively. Benjamin wears a searching expression."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Daisy crawls into the makeshift den, and she is followed by Benjamin on his hands and knees. Kneeling beneath the table, a match is struck by Benjamin, and a candle is carefully lit by him, whose warm glow silhouettes them behind the white drapery. Daisy smiles. Her hand is gingerly reached out to touch his smiling face. Her gaze is held by Benjamin as his stubbly cheek is touched by her. The sheet is whisked up by Miss Fuller, exposing them. Daisy obeys. Benjamin is scowled at by Miss Fuller. Wearing a nightgown, the stairs are started up by her, using her cane. Dejected, the den is leaned out of by Benjamin with his head hung. Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows, with his eyes staring at the floor. Suddenly resolute, Benjamin rises, resting on his cane. He is embraced by her. His back is gently stroked, and he is kissed on the forehead by her. She scratches her head thoughtfully as he walks away. Benjamin hooks his cane on the end of his bed and gets in. In the bed opposite is Old man Daws. Grainy old footage shows the lightning striking him. Sepia footage follows Mr. Daws collapsing by a mailbox. Lying in his bed, a cloud of wispy, white cigarette smoke is exhaled by Daws, and he stares off in thought. The covers are sunk down beneath by Benjamin as he turns onto his side. Smiling, a step is taken back by Oti, then a turn is made, and the door is briskly walked out of by him. Straight-backed and without the use of a cane, a window is approached by Benjamin, and he peers out through narrowed eyes. Carrying a suitcase, the road is crossed by Oti below, bathed in the orange glow of a streetlamp. A woman with a dog sits beside Benjamin at a piano. He joins in, and the piano is played together by them. Benjamin washes himself in the bath. He stares down. Daisy's bedside is left by Caroline. On TV, Hurricane Katrina is shown. A nurse arrives. They stand by a window at the foot of the bed. A colleague is assisted by the nurse, who strides off, and the empty bed beside her mother's is drifted over to by Caroline. Cast in cold, blue light from the window, her hands are taken out of the pockets of her dark body-warmer, and she sits cross-legged on the mattress with the diary in her lap. Beside him on a bench sits Mr. Daws. Grainy footage shows Mr. Daws being struck by lightning in a field, sending up a plume of smoke. A man approaches them on the dock. The captain glances around. A young guy is looked at by Benjamin. Benjamin stands up. The bearded captain wears braces and a peaked cap. He nods. The tugboat Chelsea is boarded by Benjamin. The wheelhouse is leaned out of by the captain. The decks are swabbed by him. In the wheelhouse, Benjamin is leaned towards by Mike. Mike squints thoughtfully. A searching expression is worn by Benjamin."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Daisy crawls into the makeshift den, with Benjamin following on his hands and knees. Under the table, he lights a candle, its glow silhouetting them behind white drapery. Daisy touches his smiling face, and he holds her gaze. Miss Fuller raises the sheet, revealing them, and scowls at Benjamin. Wearing a nightgown, she ascends the stairs with her cane. Dejected, Benjamin emerges from the den. Queenie, in her dressing gown, sees him kneeling in shadows. Resolute, Benjamin rises with his cane. She embraces and kisses him on the forehead. Thoughtfully, she watches him leave. Benjamin hooks his cane on his bed and lies down. Opposite, Old man Daws exudes a cloud of cigarette smoke, staring thoughtfully. Benjamin turns onto his side. Smiling, Oti steps back, briskly exits, and crosses the street under a streetlamp's glow. A woman with her dog joins Benjamin at a piano, and they play together. Benjamin bathes, staring down. Caroline departs Daisy's bedside. Hurricane Katrina plays on TV as a nurse arrives. By the window, Caroline drifts to the empty bed and sits cross-legged, diary in lap. Mr. Daws sits on a bench. Grainy footage shows him struck by lightning in a field. A man approaches them on the dock. The captain, wearing braces and a peaked cap, nods as Benjamin boards the tugboat Chelsea. Mike, squinting thoughtfully, leans toward Benjamin in the wheelhouse, both wearing searching expressions."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Daisy crawls into the makeshift den, followed by Benjamin on his hands and knees. Beneath the table, Benjamin lights a candle, casting warm silhouettes on the drapery. Daisy smiles and touches his cheek. Miss Fuller lifts the sheet, exposing them. Benjamin, dejected, leans out of the den. Queenie sees him, kneeling in the shadows, and embraces him. She strokes his back and kisses his forehead. Benjamin, thoughtful, gets into bed opposite old man Daws. Grainy footage shows Daws struck by lightning and collapsing by a mailbox. Daws exudes cigarette smoke, deep in thought. Benjamin turns beneath the covers. Oti leaves, crossing the street under a streetlamp's glow. A woman with a dog sits beside Benjamin at a piano, and they play together. Benjamin bathes and stares down. Caroline leaves Daisy's bedside. Hurricane Katrina is on TV. A nurse arrives and then leaves. Caroline sits cross-legged on a bed with a diary. Mr. Daws appears on a bench beside Benjamin, with footage of him struck by lightning. A man approaches on the dock. The captain nods, and Benjamin boards the tugboat Chelsea. The captain swabs the decks while Mike leans towards Benjamin in the wheelhouse, both wearing searching expressions."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Daisy slowly and carefully crawls into the cozy makeshift den they've created, and shortly thereafter, Benjamin follows on his hands and knees with a playful demeanor. Kneeling down beneath the low-hanging table, Benjamin strikes a match with steady hands and attentively lights a candle. The warm, flickering glow casts their silhouettes in an enchanting display behind the soft, white drapery. Daisy, with a gentle and affectionate smile, gingerly reaches out with her hand to tenderly touch his smiling face. Benjamin holds her gaze intently as her fingers gently brush against his stubbly, rough-hewn cheek. Just then, Miss Fuller quickly whisks up the sheet covering their den, suddenly exposing them. Daisy, understanding the situation, dutifully obeys. Miss Fuller scowls disapprovingly at Benjamin, and wearing her nightgown, she slowly starts her ascent up the stairs, using her cane for support. Feeling a sense of dejection, Benjamin leans out of the cozy den, his head hung low with disappointment. Emerging quietly from the basement in her comfortable dressing gown, Queenie catches sight of him kneeling there in the shadows, staring despondently at the floor. Becoming suddenly resolute, Benjamin rises, leaning heavily on his cane for support. She embraces him warmly, offering comfort. She gently strokes his back and plants a tender kiss on his forehead. She scratches her head thoughtfully, pondering, as he walks away. Benjamin methodically hooks his cane on the end of his bed and climbs in. Across from him, in the bed opposite, is the old man Daws. Grainy old footage plays, showing the moment lightning struck him. Following that is sepia-toned footage of Mr. Daws collapsing by a lonely mailbox. Lying in his bed, Daws exhales a cloud of wispy, white cigarette smoke and stares off into space, lost in thought. Benjamin turns onto his side, seeking comfort, and sinks slowly beneath the covers. Smiling softly, Oti takes a step back, then decisively turns and walks briskly out of the door. Standing straight-backed and without needing the aid of a cane, Benjamin goes over to a window and peers out through narrowed eyes, looking contemplative. Down below, carrying a suitcase, Oti crosses the street, bathed in the soft, orange glow of a streetlamp. Beside Benjamin at a piano sits a woman with a dog, and together, they begin to play in harmony. Benjamin diligently washes himself in the bath, and he gazes down, perhaps lost in deep thought. Caroline, having been at Daisy's bedside, departs thoughtfully. On the television, dire news footage of Hurricane Katrina is being shown. A nurse arrives, and together they stand by a window at the foot of the bed. The nurse then strides off purposefully to assist a colleague, leaving Caroline to drift over thoughtfully to the empty bed beside her mother's. Cast in cold, blue light streaming in from the window, she takes her hands out of the pockets of her dark body-warmer and assumes a cross-legged position on the mattress, the diary resting contemplatively in her lap. Mr. Daws sits beside him on a bench, both absorbing the quietude of the moment. Grainy footage captures the moment when lightning strikes Mr. Daws in a field, sending up an alarming plume of smoke. A man approaches them casually on the dock. The captain glances around with a seasoned air. Benjamin takes note and looks with curiosity at a young guy. Rising to his feet, Benjamin observes as the bearded captain, wearing braces and a peaked cap, nods in acknowledgment. Benjamin boards the weathered tugboat Chelsea with a sense of purpose. The captain leans out of the wheelhouse with ease. He diligently swabs the decks, maintaining order. In the wheelhouse, Mike leans in closer towards Benjamin, squinting thoughtfully. Benjamin wears a searching expression, trying to piece it all together."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Daisy carefully and slowly makes her way into the cozy, inviting makeshift den they have meticulously created, and shortly thereafter, Benjamin follows playfully, crawling on his hands and knees with a lighthearted demeanor. Kneeling beneath the low-hanging table, Benjamin expertly strikes a match with steady hands and attentively lights a candle. The candle’s warm, flickering glow casts enchanting silhouettes behind the soft, white drapery, creating an atmospheric ambiance. With a gentle and affectionate smile, Daisy gingerly reaches out with her hand, tenderly touching his smiling face. Benjamin holds her gaze intently, and her fingers gently brush against his stubbly, rough-hewn cheek. Suddenly, Miss Fuller swiftly whisks up the sheet that is covering their den, abruptly exposing them. Daisy, understanding the situation, dutifully complies. Miss Fuller scowls disapprovingly at Benjamin, and wearing her nightgown, she slowly begins her ascent up the stairs, using her cane for necessary support. Feeling a sense of dejection, Benjamin leans out of the cozy den, his head hung low in a state of disappointment. Quietly emerging from the basement in her comfortable dressing gown, Queenie spots him kneeling there in the shadows, staring despondently at the floor. Becoming suddenly resolute, Benjamin rises, leaning heavily on his cane for support. She embraces him warmly, offering tender comfort. She gently strokes his back and plants a tender kiss on his forehead. She scratches her head thoughtfully, pondering deeply, as he slowly walks away. Benjamin methodically hooks his cane on the end of his bed and climbs in. Across from him, in the bed opposite, lies the old man Daws. Grainy old footage plays, capturing the moment when lightning struck him. Following that is sepia-toned footage of Mr. Daws collapsing next to a lonely mailbox. Lying in his bed, Daws exhales a cloud of wispy, white cigarette smoke and stares off into space, completely lost in thought. Seeking comfort, Benjamin turns onto his side and sinks slowly beneath the covers. Smiling softly, Oti takes a step back, then decisively turns and walks briskly out of the door. Standing straight-backed, without the need for a cane, Benjamin walks over to a window and peers out through narrowed eyes, looking contemplative. Down below, crossing the street with a suitcase in hand, Oti is bathed in the soft, orange glow of a streetlamp. Beside Benjamin at a piano sits a woman with a dog, and together, they begin to play in beautiful harmony. Benjamin diligently washes himself in the bath, gazing thoughtfully downwards, perhaps lost in deep contemplation. Caroline, having been at Daisy’s bedside, departs thoughtfully. On the television, dire and serious news footage of Hurricane Katrina is being shown. A nurse arrives, and together they stand by a window at the foot of the bed. The nurse then strides off purposefully to assist a colleague, leaving Caroline to drift over thoughtfully to the empty bed beside her mother’s. Cast in the cold, blue light streaming in from the window, she takes her hands out of the pockets of her dark body-warmer and assumes a cross-legged position on the mattress, the diary resting contemplatively in her lap. Mr. Daws sits beside him on a bench, both absorbing the tranquil quietude of the moment. Grainy footage captures the moment when lightning strikes Mr. Daws in a field, sending up an alarming plume of smoke. A man approaches them casually on the dock. The seasoned captain glances around with an experienced air. Benjamin takes note and looks with curious interest at a young guy. Rising to his feet, Benjamin observes as the bearded captain, wearing braces and a peaked cap, nods in acknowledgment. With a sense of purpose, Benjamin boards the weathered tugboat Chelsea. The captain leans out of the wheelhouse with practiced ease. He diligently swabs the decks, maintaining a sense of order. In the wheelhouse, Mike leans in closer towards Benjamin, squinting thoughtfully. Benjamin wears a searching expression, as if trying to piece all of it together."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Daisy slowly crawls into the makeshift den, carefully maneuvering her body to fit beneath the low-hanging cloth, and Benjamin promptly follows her, shifting to his hands and knees to navigate the cramped space. As they both settle into the den, kneeling beneath the table's confines, Benjamin reaches into his pocket, retrieves a match, and with deliberate precision, strikes it against the box, producing a small flame. Gently, he moves the lit match to the candlewick, igniting it until the candle's warm glow gently illuminates the space around them, casting their silhouettes against the white drapery. Captivated by the moment, Daisy offers a soft smile and extends her hand, carefully reaching out to connect with Benjamin's face. As she delicately touches his cheek, she feels the roughness of his stubble, maintaining eye contact and sharing a silent moment with him. Suddenly, the private atmosphere is disrupted as Miss Fuller abruptly lifts the sheet, unveiling their hidden sanctuary. Without hesitation, Daisy complies with Miss Fuller's silent command, and as she rises, Miss Fuller casts a disapproving scowl towards Benjamin. In her nightgown, holding her cane for support, Miss Fuller turns and begins her ascent up the stairs. Left in the aftermath of the intrusion, Benjamin feels a wave of dejection wash over him, causing him to lean out of the den with his head lowered in dismay. As Queenie emerges from the basement, dressed in her dressing gown, she notices Benjamin kneeling in the dim shadows and fixating his gaze on the floor. With a sudden shift in resolve, Benjamin gathers his strength to rise, leaning on his cane for support. Queenie approaches him with warmth, wrapping her arms around him and offering reassurance with gentle strokes on his back, following with a tender kiss on his forehead. As Benjamin turns to leave, Queenie thoughtfully scratches her head, contemplating his situation. Upon reaching his room, Benjamin hooks his cane onto the end of his bed frame before climbing in, settling beneath the covers. Across from him, Old Man Daws occupies the opposite bed, and grainy old footage plays in Benjamin's mind, depicting lightning striking Daws, followed by sepia-toned scenes of him collapsing near a mailbox. Lying in his bed, Daws releases a cloud of wispy, white cigarette smoke, his gaze distant and pensive. Benjamin shifts onto his side, allowing himself to sink further beneath the covers for comfort. Meanwhile, Oti steps back, a smile gracing her lips, before turning briskly and exiting through the door. Benjamin, no longer reliant on his cane, stands straight-backed and makes his way to the window, peering out with narrowed eyes. Below, under the orange glow of a streetlamp, Oti crosses the road while carrying a suitcase. Inside, a woman accompanied by her dog takes a seat beside Benjamin at the piano; he joins her, and together they play in harmonious unison. Later, Benjamin bathes, washing himself methodically, occasionally pausing to stare down introspectively. In another scene, Caroline departs from Daisy's bedside, and the TV broadcasts scenes of the impending Hurricane Katrina. A nurse arrives to check in, and they briefly stand by the window at the foot of the bed before the nurse strides off to assist a colleague. Caroline drifts towards the empty bed adjacent to her mother's, and enveloped in the cold, blue light filtering through the window, she withdraws her hands from the pockets of her dark body-warmer and sits cross-legged on the mattress with a diary placed in her lap. In a flashback, Mr. Daws sits next to Benjamin on a bench as grainy footage replays the moment lightning strikes him in a field, sending up a dramatic plume of smoke. Back in the present, a man approaches Benjamin and Mr. Daws on the dock, catching their attention. The captain, distinguished by his bearded visage, braces, and peaked cap, surveys the scene around him. Benjamin locks eyes with a young guy, prompting him to stand up and acknowledge the situation. The captain offers a nod of affirmation as Benjamin boards the tugboat Chelsea. From the wheelhouse, the captain leans out to observe the deck. Meanwhile, Mike, positioned in the wheelhouse, leans towards Benjamin, squinting with thoughtful intent. Benjamin, too, bears a searching expression as he contemplates the unfolding events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Daisy and Benjamin crawl into the makeshift den under the table, where Benjamin lights a candle, casting a warm glow around them. Daisy reaches out to touch Benjamin’s face, and they share a moment before Miss Fuller interrupts, scowling at Benjamin as she heads upstairs with her cane. Dejected, Benjamin emerges from the den, and Queenie, seeing him, embraces him tenderly before he retreats to his bed. Opposite him, Old Man Daws smokes thoughtfully, his past misfortunes captured in grainy footage. Benjamin settles into his own bed as Oti exits briskly, crossing the road with a suitcase under the streetlamp's glow. Later, Benjamin joins a woman at the piano, playing together, before he bathes in contemplation. Caroline leaves Daisy's bedside, watching the televised Hurricane Katrina, and takes a moment for herself by the window. She then sits with a diary in her lap, cast in the window's cold, blue light. Meanwhile, on a bench beside Benjamin, Mr. Daws recalls lightning striking him, captured again in grainy footage. On the dock, Benjamin boards the tugboat Chelsea with the captain’s nod of approval, observing the bustling activity and exchanging thoughtful expressions with Mike in the wheelhouse."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Daisy crawls into the makeshift den, a cozy space they crafted from furniture and sheets, and Benjamin follows on his hands and knees. Kneeling beneath the table, an old oak antique passed down through generations, Benjamin strikes a match he found in a drawer and carefully lights a candle, whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face, feeling the roughness that comes from a day spent in the sun. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller, their strict but caring housekeeper, whisks up the sheet, exposing them in their secret hideaway. Daisy obeys her sharp command. Miss Fuller scowls at Benjamin. Wearing a nightgown, one she had since she was young, she starts up the stairs, using her cane inherited from her own mother. Dejected, Benjamin leans out of the den with his head hung low. Queenie, the warm-hearted woman who raised him, comes up from the dimly lit basement in her dressing gown and catches sight of him kneeling in the shadows, staring at the floor. Suddenly resolute, finding a new strength within, Benjamin rises, resting on his cane, carved from an old hickory branch. She embraces him with the tenderness of a mother. She gently strokes his back and kisses him on the forehead, her affection never waning. She scratches her head thoughtfully as he walks away, contemplating the future. Benjamin hooks his cane on the end of his bed and gets in. Old man Daws is in the bed opposite, a fellow resident in the boarding house. Grainy old footage shows the lightning striking him during a storm in his youth. Sepia footage of Mr. Daws collapsing by a mailbox, where he used to receive letters from a distant lover, follows. Lying in his bed, Daws exhales a cloud of wispy, white cigarette smoke and stares off in thought, reflecting on a life full of adventures. Benjamin turns onto his side and sinks down beneath the covers. Smiling, Oti, Benjamin's close friend from their days at sea, takes a step back, then turns and walks briskly out of the door. Straight-backed and without the use of a cane, Benjamin goes to a window and peers out through narrowed eyes. Carrying a suitcase, Oti crosses the road below, bathed in the orange glow of a streetlamp that flickers occasionally, adding to the nighttime ambiance. A woman with a dog, an old retriever known for its friendliness, sits beside Benjamin at a piano. He joins in, and they play together, creating a harmonious duet. Benjamin washes himself in the bath, the water warm and soothing. He stares down, lost in his thoughts. Caroline leaves Daisy's bedside. On TV, Hurricane Katrina, a devastating storm that struck in 2005, is shown. A nurse arrives, her shoes squeaking on the floor. They stand by a window at the foot of the bed, the sky outside dark and brooding. The nurse strides off to assist a colleague, and Caroline drifts over to the empty bed beside her mother's. Cast in cold, blue light from the window, she takes her hands out of the pockets of her dark body-warmer and sits cross-legged on the mattress with the diary in her lap, a record of her mother's life. Mr. Daws sits beside him on a bench, sharing a moment of quiet companionship. Grainy footage shows lightning striking Mr. Daws in a field, an event that has become part of local legend, sending up a plume of smoke. A man approaches them on the dock, where fishing boats are moored. The captain, known for his stern demeanor but hidden kindness, glances around. Benjamin looks at a young guy, perhaps a new crew member. Benjamin stands up with determination. The bearded captain wears braces and a peaked cap, reminiscent of an era gone by. He nods, acknowledging Benjamin's presence. Benjamin boards the tugboat Chelsea, a vessel known for its reliability. The captain leans out of the wheelhouse, his domain on the boat, and he swabs the decks, keeping them shipshape. In the wheelhouse, Mike, the first mate known for his keen insights, leans towards Benjamin. Mike squints thoughtfully, considering the journey ahead. Benjamin wears a searching expression, eager for the next adventure to unfold."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She scratches her head thoughtfully as he walks away Daisy crawls into the makeshift den and Benjamin follows on his hands and knees Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery Daisy smiles She gingerly reaches out to touch his smiling face A nurse arrives Benjamin holds her gaze as she touches his stubbly cheek Miss Fuller whisks up the sheet exposing them Daisy obeys Miss Fuller scowls at Benjamin In the wheelhouse Mike leans towards Benjamin Wearing a nightgown she starts up the stairs using her cane Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke He nods Mr Daws sits beside him on a bench Dejected Benjamin leans out of the den with his head hung Chelsea Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor Suddenly resolute Benjamin rises resting on his cane She embraces him She gently strokes his back and kisses him on the forehead The bearded captain wears braces and a peaked cap Daisy smiles She scratches her head thoughtfully as he walks away Benjamin hooks his cane on the end of his bed and gets in Grainy old footage shows the lightning striking him Old man Daws is in the bed opposite He stares down Grainy old footage shows the lightning striking him Sepia footage of Mr Daws collapsing by a mailbox follows Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought Benjamin stands up Benjamin turns onto his side and sinks down beneath the covers Smiling Oti takes a step back then turns and walks briskly out of the door Caroline leaves Daisy's bedside Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes The captain glances around Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp A woman with a dog sits beside Benjamin at a piano He joins in and they play together Benjamin washes himself in the bath Miss Fuller scowls at Benjamin He stares down Caroline leaves Daisy's bedside On TV Hurricane Katrina is shown A nurse arrives Benjamin turns onto his side and sinks down beneath the covers They stand by a window at the foot of the bed Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window She gently strokes his back and kisses him on the forehead she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap Mr Daws sits beside him on a bench He swabs the decks Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke A man approaches them on the dock The captain glances around she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap Miss Fuller whisks up the sheet exposing them Benjamin looks at a young guy Benjamin stands up The bearded captain wears braces and a peaked cap He nods Benjamin boards the tugboat Wearing a nightgown she starts up the stairs using her cane Chelsea The captain leans out of the wheelhouse Daisy obeys He swabs the decks In the wheelhouse Mike leans towards Benjamin Benjamin hooks his cane on the end of his bed and gets in Mike squints thoughtfully Benjamin wears a searching expression"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Daisy crawls into the makeshift den and Benjamin follows on his hands and knees. Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller whisks up the sheet exposing them. Daisy obeys. Miss Fuller scowls at Benjamin. Wearing a nightgown she starts up the stairs using her cane. Dejected Benjamin leans out of the den with his head hung. Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor. Suddenly resolute Benjamin rises resting on his cane. She embraces him. She gently strokes his back and kisses him on the forehead. She scratches her head thoughtfully as he walks away. Benjamin hooks his cane on the end of his bed and gets in. Old man Daws is in the bed opposite. Grainy old footage shows the lightning striking him. Sepia footage of Mr Daws collapsing by a mailbox follows. Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought. Benjamin turns onto his side and sinks down beneath the covers. Smiling Oti takes a step back then turns and walks briskly out of the door. Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes. Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. A woman with a dog sits beside Benjamin at a piano. He joins in and they play together. Benjamin washes himself in the bath. He stares down. Caroline leaves Daisy's bedside. On TV Hurricane Katrina is shown. A nurse arrives. They stand by a window at the foot of the bed. The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window. she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap. Mr Daws sits beside him on a bench. Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke. A man approaches them on the dock. The captain glances around. Benjamin looks at a young guy. Benjamin stands up. The bearded captain wears braces and a peaked cap. He nods. Benjamin boards the tugboat. Chelsea. The captain leans out of the wheelhouse. He swabs the decks. In the wheelhouse Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Daisy crawls into the makeshift den and Benjamin follows on his hands and knees. Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller whisks up the sheet exposing them. Daisy obeys. Miss Fuller scowls at Benjamin. Wearing a nightgown she starts up the stairs using her cane. Dejected Benjamin leans out of the den with his head hung. Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor. Suddenly resolute Benjamin rises resting on his cane. She embraces him. She gently strokes his back and kisses him on the forehead. She scratches her head thoughtfully as he walks away. Benjamin hooks his cane on the end of his bed and gets in. Old man Daws is in the bed opposite. Grainy old footage shows the lightning striking him. Sepia footage of Mr Daws collapsing by a mailbox follows. Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought. Benjamin turns onto his side and sinks down beneath the covers. Smiling Oti takes a step back then turns and walks briskly out of the door. Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes. Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. A woman with a dog sits beside Benjamin at a piano. He joins in and they play together. Benjamin washes himself in the bath. He stares down. Caroline leaves Daisy's bedside. On TV Hurricane Katrina is shown. A nurse arrives. They stand by a window at the foot of the bed. The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window. she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap. Mr Daws sits beside him on a bench. Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke. A man approaches them on the dock. The captain glances around. Benjamin looks at a young guy. Benjamin stands up. The bearded captain wears braces and a peaked cap. He nods. Benjamin boards the tugboat. Chelsea. The captain leans out of the wheelhouse. He swabs the decks. In the wheelhouse Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Daisy crawls into the makeshift den and Benjamin follows on his hands and knees. Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller whisks up the sheet exposing them. Daisy obeys. Miss Fuller scowls at Benjamin. Wearing a nightgown she starts up the stairs using her cane. Dejected Benjamin leans out of the den with his head hung. Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor. Suddenly resolute Benjamin rises resting on his cane. A man approaches them on the dock. The captain glances around. Benjamin looks at a young guy. Benjamin stands up. The bearded captain wears braces and a peaked cap. He nods. Benjamin boards the tugboat. Chelsea. The captain leans out of the wheelhouse. He swabs the decks. In the wheelhouse Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Daisy crawls into the makeshift den and Benjamin follows on his hands and knees. Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. The captain leans out of the wheelhouse. He swabs the decks. In the wheelhouse Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Milo crawls into the makeshift den, and Ruby follows on her hands and knees. Kneeling beneath the table, Ruby strikes a match and carefully lights a candle, whose warm glow silhouettes them behind the white drapery. Milo smiles. He gingerly reaches out to touch her smiling face. Ruby holds his gaze as he touches her stubbly cheek. Mr. Thompson whisks up the sheet, exposing them. Milo obeys. Mr. Thompson scowls at Ruby. Wearing a nightgown, he starts up the stairs, using his cane. Dejected, Ruby leans out of the den with her head hung. Mrs. Johnson comes up from the basement in her dressing gown and catches sight of her kneeling in the shadows, staring at the floor. Suddenly resolute, Ruby rises, resting on her cane. He embraces her. He gently strokes her back and kisses her on the forehead. He scratches his head thoughtfully as she walks away. Ruby hooks her cane on the end of her bed and gets in. Old man Travers is in the bed opposite. Grainy old footage shows the lightning striking her. Sepia footage of Mrs. Travers collapsing by a mailbox follows. Lying in her bed, Travers exhales a cloud of wispy, white cigarette smoke and stares off in thought. Ruby turns onto her side and sinks down beneath the covers. Smiling, Eli takes a step back, then turns and walks briskly out of the door. Straight-backed and without the use of a cane, Ruby goes to a window and peers out through narrowed eyes. Carrying a suitcase, Eli crosses the road below, bathed in the orange glow of a streetlamp. A woman with a dog sits beside Ruby at a piano. He joins in, and they play together. Ruby washes herself in the bath. She stares down. Jackson leaves Milo's bedside. On TV, Hurricane Katrina is shown. A nurse arrives. They stand by a window at the foot of the bed. The nurse strides off to assist a colleague, and Jackson drifts over to the empty bed beside his mother's. Cast in cold, blue light from the window, he takes his hands out of the pockets of his dark body-warmer and sits cross-legged on the mattress with the diary in his lap. Mrs. Travers sits beside her on a bench. Grainy footage shows lightning striking Mrs. Travers in a field, sending up a plume of smoke. A woman approaches them on the dock. The steward glances around. Ruby looks at a young girl. Ruby stands up. The bearded steward wears braces and a peaked cap. He nods. Ruby boards the tugboat Chelsea. The steward leans out of the wheelhouse. She swabs the decks. In the wheelhouse, Kim leans towards Ruby. Kim squints thoughtfully. Ruby wears a searching expression."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Daisy crawls into the makeshift tent, and Benjamin follows on his hands and knees. Kneeling beneath the hammock, Benjamin strikes a lighter and carefully lights a lantern, whose warm glow silhouettes them behind the yellow tapestry. Daisy smiles. She gingerly reaches out to touch his smiling face. Benjamin holds her gaze as she touches his stubbly cheek. Miss Fuller whisks up the blanket, exposing them. Daisy obeys. Miss Fuller scowls at Benjamin. Wearing a robe, she starts up the ladder, using her umbrella. Dejected, Benjamin leans out of the tent with his head hung. Queenie comes up from the attic in her nightshirt and catches sight of him kneeling in the shadows, staring at the floor. Suddenly resolute, Benjamin rises, resting on his broom. She embraces him. She gently strokes his back and kisses him on the forehead. She scratches her elbow thoughtfully as he walks away. Benjamin hooks his broom on the end of his couch and gets in. Old man Daws is in the couch opposite. Grainy old footage shows the fireworks striking him. Sepia footage of Mr. Daws collapsing by a lamppost follows. Lying in his couch, Daws exhales a cloud of wispy, white pipe smoke and stares off in thought. Benjamin turns onto his side and sinks down beneath the sheets. Smiling, Oti takes a step back, then turns and walks briskly out of the gate. Straight-backed and without the use of a broom, Benjamin goes to a curtain and peers out through narrowed eyes. Carrying a backpack, Oti crosses the alley below, bathed in the orange glow of a porch light. A woman with a cat sits beside Benjamin at a keyboard. He joins in, and they play together. Benjamin washes himself in the sink. He stares down. Caroline leaves Daisy's bedside. On TV, Hurricane Florence is shown. A nurse arrives. They stand by a mirror at the foot of the couch. The nurse strides off to assist a colleague, and Caroline drifts over to the empty couch beside her mother's. Cast in cold, blue light from the curtain, she takes her hands out of the pockets of her dark sweater and sits cross-legged on the carpet with the diary in her lap. Mr. Daws sits beside him on a chair. Grainy footage shows fireworks striking Mr. Daws in a yard, sending up a plume of smoke. A man approaches them on the pier. The captain glances around. Benjamin looks at a young guy. Benjamin stands up. The bearded captain wears suspenders and a cowboy hat. He nods. Benjamin boards the barge Chelsea. The captain leans out of the cabin. He scrubs the floors. In the cabin, Mike leans towards Benjamin. Mike squints thoughtfully. Benjamin wears a searching expression."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Daisy tiptoes into the makeshift den, and Benjamin shuffles on his elbows. Sitting beneath the table, Benjamin blows on a whistle and carefully unfolds a map, whose crisp edges frame them behind the white drapery. Daisy frowns. She cautiously attempts to tickle his thoughtful face. Benjamin averts her gaze as she brushes against his stubbly cheek. Miss Fuller swipes up the sheet, revealing them. Daisy hesitates. Miss Fuller grins at Benjamin. Wearing a nightgown, she descends the stairs, balancing on her cane. Encouraged, Benjamin scuttles out of the den with his head tilted. Queenie emerges from the basement in her dressing gown and catches sight of him standing in the shadows, watching the door. Suddenly indecisive, Benjamin reclines, balancing on his cane. She nudges him. She tenderly pats his back and winks at him on the forehead. She ponders thoughtfully as he wanders away. Benjamin flings his cane on the end of his bed and lies on it. Old man Daws is in the bed opposite. Grainy old footage shows the clock ticking near him. Sepia footage of Mr. Daws skipping by a mailbox follows. Sitting in his bed, Daws inhales a plume of wispy, white cigarette smoke and gazes up in thought. Benjamin rolls onto his back and springs up beneath the covers. Laughing, Oti takes a step forward, then spins and dances briskly out of the door. Straight-backed and without the use of a cane, Benjamin strides to a window and glances out through keen eyes. Carrying a suitcase, Oti skips along the road below, bathed in the orange glow of a streetlamp. A woman with a dog reclines beside Benjamin at a piano. He hums along, and they compose together. Benjamin soaks himself in the bath. He looks up. Caroline removes Daisy's bedside cardigan. On TV, a riveting documentary is shown. A nurse departs. They lean by a window at the foot of the bed. The nurse strolls off to assist a colleague, and Caroline waltzes over to the empty bed beside her mother's. Bathed in cold, blue light from the window, she pulls her hands out of the pockets of her dark body-warmer and lies cross-legged on the mattress with the diary resting in her lap. Mr. Daws lounges beside him on a bench. Grainy footage shows a kite flying above Mr. Daws in a field, trailing a ribbon. A man skips towards them on the dock. The captain peers around. Benjamin whispers to a young guy. Benjamin sits down. The bearded captain dons braces and a peaked cap. He winks. Benjamin skips onto the tugboat Chelsea. The captain peers out of the wheelhouse. He polishes the handrails. In the wheelhouse, Mike turns towards Benjamin. Mike stretches thoughtfully. Benjamin wears a pondering expression."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tulip slides into the cardboard box, and Oliver follows on his elbows and toes. Crouching beneath the chair, Oliver flicks a lighter and carefully ignites a lantern, whose soft luminescence outlines them behind the red curtain. Tulip giggles. She cautiously reaches out to touch his grinning elbow. Oliver holds her gaze as she touches his scratchy knee. Miss Violet hoists up the curtain, revealing them. Tulip complies. Miss Violet glares at Oliver. Clad in pajamas, she ascends the ladder, using her umbrella. Crestfallen, Oliver leans out of the box with his nose drooping. Marmalade emerges from the attic in her bathrobe and notices him crouching in the shadows, gazing at the ceiling. Suddenly determined, Oliver rises, resting on his umbrella. She hugs him. She gently pats his shoulder and kisses him on the chin. She scratches her elbow thoughtfully as he moves away. Oliver hooks his umbrella on the end of his chair and climbs in. Elder Wren is in the chair opposite. Blurry old footage shows the thunder shocking him. Sepia footage of Mr. Wren falling by a lamppost follows. Reclining in his chair, Wren exhales a puff of wispy, gray train smoke and ponders silently. Oliver turns onto his back and sinks down beneath the blankets. Grinning, Leo takes a step backward, then turns and walks briskly out of the gate. Upright and without the use of an umbrella, Oliver goes to a mirror and peers out through squinted eyes. Carrying a backpack, Leo crosses the avenue below, bathed in the silver glow of a moonbeam. A girl with a cat sits beside Oliver at a drum set. He joins in, and they play together. Oliver washes himself in the sink. He gazes up. Eliza leaves Tulip's bedside. On TV, Tornado Zelda is shown. A doctor arrives. They stand by a mirror at the head of the chair. The doctor strides off to assist a friend, and Eliza drifts over to the empty chair beside her father's. Cast in warm, yellow light from the mirror, she takes her hands out of the pockets of her light windbreaker and sits cross-legged on the cushion with the notebook in her lap. Mr. Wren sits beside him on a couch. Blurry footage shows thunder shocking Mr. Wren in a garden, sending up a plume of leaves. A woman approaches them on the pier. The sailor glances around. Oliver looks at a young girl. Oliver stands up. The bald sailor wears suspenders and a floppy hat. He nods. Oliver boards the sailboat Victoria. The sailor leans out of the cockpit. He scrubs the rails. In the cockpit, Dave leans towards Oliver. Dave peers thoughtfully. Oliver wears a searching expression."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lola slithers into the makeshift den, and Thomas hops on his hands and knees. Squatting beneath the table, Thomas flicks a lighter and cautiously ignites a candle, whose warm glow silhouettes them behind the white drapery. Lola grins. She timidly reaches out to pat his laughing face. Thomas meets her gaze as she pats his smooth cheek. Miss Thompson sweeps up the sheet, revealing them. Lola complies. Miss Thompson frowns at Thomas. Clad in a nightgown, she ambles up the stairs, wielding her umbrella. Crestfallen, Thomas crawls out of the den with his head lowered. Penelope ascends from the basement in her bathrobe and notices him squatting in the shadows, gazing at the floor. Suddenly determined, Thomas stands, leaning on his umbrella. She hugs him. She softly pats his back and pecks him on the forehead. She rubs her chin thoughtfully as he saunters away. Thomas hangs his umbrella on the edge of his bed and climbs in. Old man Smith is in the bed opposite. Fuzzy old footage shows the rain drenching him. Sepia footage of Mr. Smith fainting by a mailbox follows. Reclining in his bed, Smith exhales a stream of misty, white pipe smoke and gazes off in thought. Thomas rolls onto his side and snuggles down beneath the blankets. Grinning, Raj takes a step back, then pivots and strides briskly out of the door. Straight-backed and without the use of an umbrella, Thomas approaches a window and gazes out through squinting eyes. Carrying a backpack, Raj traverses the road below, bathed in the orange glow of a streetlight. A woman with a cat sits beside Thomas at a keyboard. He pitches in, and they perform together. Thomas cleans himself in the shower. He gazes down. Jennifer exits Daisy's bedside. On TV, a tornado is shown. An orderly arrives. They stand by a window at the foot of the bed. The orderly marches off to assist a partner, and Jennifer meanders over to the vacant bed beside her mother's. Cast in cold, blue light from the window, she removes her hands from the pockets of her dark vest and sits cross-legged on the mattress with the journal in her lap. Mr. Smith sits beside him on a stool. Fuzzy footage shows rain drenching Mr. Smith in a field, sending up a spray of mist. A boy approaches them on the pier. The officer glances around. Thomas stares at a young man. Thomas rises up. The mustached officer sports suspenders and a peaked cap. He bows. Thomas boards the barge Chelsea. The officer leans out of the wheelhouse. He rinses the decks. In the wheelhouse, Nick leans towards Thomas. Nick peers intently. Thomas wears an inquisitive look."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Daisy slithers into the makeshift meadow, and Benjamin trails on his elbows and toes. Sitting beneath the cabinet, Benjamin snaps a rubber band and carefully ignites a torch, whose gentle hum silhouettes them behind the yellow curtain. Daisy grins. She delicately extends her arm to pat his grinning chin. Benjamin meets her eyes as she pats his bristly nose. Miss Fuller flings up the tarp, revealing them. Daisy complies. Miss Fuller glares at Benjamin. Clad in a bathrobe, she skips up the ramp, using her broom. Defeated, Benjamin sprawls out of the meadow with his face dropped. Queenie emerges from the attic in her robe and spots him sitting in the dimness, gazing at the rug. Suddenly determined, Benjamin stands, leaning on his umbrella. She hugs him. She softly pats his shoulder and pecks him on the ear. She pats her chin pensively as he shuffles away. Benjamin drapes his umbrella on the edge of his sofa and gets in. Old man Daws is in the hammock opposite. Grainy old footage shows the wind pushing him. Sepia footage of Mr. Daws tripping by a newspaper stand follows. Sitting in his hammock, Daws releases a cloud of wispy, white steam and gazes off in contemplation. Benjamin turns onto his stomach and sinks down beneath the quilts. Laughing, Oti takes a step sideways, then spins and skips briskly out of the gate. Straight-postured and without the aid of a walker, Benjamin approaches a doorway and squints out through wide eyes. Carrying a backpack, Oti navigates the path below, bathed in the green hue of a park lamp. A woman with a cat sits beside Benjamin at a bench. He joins in, and they sing together. Benjamin dries himself in the sink. He stares up. Caroline exits Daisy's bedside. On TV, a wildfire is shown. A doctor arrives. They stand by an entrance at the foot of the curtain. The doctor marches off to greet a visitor, and Caroline sways over to the vacant sofa beside her mother's. Bathed in warm, yellow light from the lamp, she takes her hands out of the pockets of her light shawl and perches cross-legged on the cushion with the notebook in her lap. Mr. Daws stands beside him on a balcony. Grainy footage shows wind lifting Mr. Daws in a storm, sending up a cloud of dust. A woman approaches them on the shore. The captain peers around. Benjamin observes an elderly lady. Benjamin rises. The bald captain wears suspenders and a wide hat. He waves. Benjamin climbs aboard the cargo ship Chelsea. The captain leans out of the cabin. He polishes the railings. In the cabin, Mike leans towards Benjamin. Mike widens his eyes thoughtfully. Benjamin wears a wondering expression."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tulip slides into the cardboard fort, and Gregory skitters on his elbows and toes. Stooping under the chair, Gregory ignites a sparkler and clumsily flickers a torch, whose dim shine outlines them behind the blue curtain. Tulip giggles. She cautiously extends a hand to poke his grinning shoulder. Gregory meets her glance as she brushes his prickly chin. Mrs. Turner yanks up the curtain, revealing them. Tulip complies. Mrs. Turner glares at Gregory. Wearing pajamas, she hobbles up the ladder, balancing on her crutch. Downcast, Gregory wriggles out of the fort with his face lowered. Claudia emerges from the attic in her bathrobe and glimpses him crouching in the dimness, gazing at the ceiling. Suddenly determined, Gregory stands, leaning on his crutch. She cuddles him. She softly pats his shoulder and pecks him on the cheek. She rubs her chin pensively as he shuffles away. Gregory hangs his crutch on the edge of his couch and lies down. Old man Rory is on the sofa across. Fuzzy old film reveals the thunder hitting him. Black-and-white film of Mr. Rory tumbling by a lamppost ensues. Relaxing on his seat, Rory breathes out a mist of feathery, grey pipe smoke and gazes into space. Gregory rolls onto his stomach and buries himself under the blankets. Grinning, Lila takes a hop forward, then twists and strides hurriedly through the gate. Upright and without the support of a crutch, Gregory strolls to a balcony and squints out through tiny slits. Holding a backpack, Lila trots along the lane beside, illuminated in the yellow haze of a lantern. A man with a parrot lounges beside Gregory at a drum set. He joins in, and they perform together. Gregory cleanses himself in the shower. He looks up. Vera departs Tulip's chairside. On the radio, Hurricane Elvis is announced. A doctor arrives. They stand in a hallway at the head of the couch. The doctor marches off to aid a partner, and Vera floats over to the vacant sofa beside her aunt’s. Bathed in cold, green light from the screen, she pulls her arms out of the sleeves of her bright windbreaker and sits with legs crossed on the cushion with the journal in her lap. Mr. Rory perches beside him on a rock. Blurry film shows thunder striking Mr. Rory at a farm, sending up a billow of dust. A woman approaches them by the pond. The pilot scans the horizon. Gregory peers at a middle-aged man. Gregory gets up. The mustached pilot wears suspenders and a wide-brimmed hat. He winks. Gregory boards the ferry Madison. The pilot leans out of the bridge. He polishes the railings. In the bridge, Logan leans towards Gregory. Logan peers inquisitively. Gregory wears a pondering demeanor."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Daisy and Benjamin crawl into a makeshift den, where Benjamin lights a candle, casting a warm glow. Daisy gently touches his face, but Miss Fuller interrupts, scowling at Benjamin. Dejected, he exits and leans on his cane. Queenie sees Benjamin in the shadows, offers comfort, and he walks away thoughtfully. In their shared room, Benjamin hooks his cane on the bed and lies down, mirroring the old footage of Mr. Daws being struck by lightning. Daws ponders while smoking. Oti leaves the room, carrying a suitcase under a streetlamp’s glow. Benjamin, unaided by a cane, watches her departure. He plays piano with a woman, washes himself, and reflects. Meanwhile, Caroline leaves Daisy's side during Hurricane Katrina’s news coverage. She sits with a diary on an empty bed, illuminated by cold window light. Mr. Daws, seen again in footage, is struck by lightning, sending up smoke. Benjamin and a captain exchange nods as Benjamin boards the tugboat Chelsea, where Mike squints at him thoughtfully, and Benjamin wears a searching expression."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Benjamin wears a searching expression Mike squints thoughtfully In the wheelhouse Mike leans towards Benjamin He swabs the decks The captain leans out of the wheelhouse Chelsea Benjamin boards the tugboat He nods The bearded captain wears braces and a peaked cap Benjamin stands up Benjamin looks at a young guy The captain glances around A man approaches them on the dock Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke Mr Daws sits beside him on a bench she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window They stand by a window at the foot of the bed A nurse arrives On TV Hurricane Katrina is shown Caroline leaves Daisy's bedside He stares down Benjamin washes himself in the bath He joins in and they play together A woman with a dog sits beside Benjamin at a piano Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes Smiling Oti takes a step back then turns and walks briskly out of the door Benjamin turns onto his side and sinks down beneath the covers Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought Sepia footage of Mr Daws collapsing by a mailbox follows Grainy old footage shows the lightning striking him Old man Daws is in the bed opposite Benjamin hooks his cane on the end of his bed and gets in She scratches her head thoughtfully as he walks away She gently strokes his back and kisses him on the forehead She embraces him Suddenly resolute Benjamin rises resting on his cane Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor Dejected Benjamin leans out of the den with his head hung Wearing a nightgown she starts up the stairs using her cane Miss Fuller scowls at Benjamin Daisy obeys Miss Fuller whisks up the sheet exposing them Benjamin holds her gaze as she touches his stubbly cheek She gingerly reaches out to touch his smiling face Daisy smiles Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery Daisy crawls into the makeshift den and Benjamin follows on his hands and knees"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He joins in and they play together Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought Suddenly resolute Benjamin rises resting on his cane Benjamin holds her gaze as she touches his stubbly cheek The captain leans out of the wheelhouse Benjamin washes himself in the bath Dejected Benjamin leans out of the den with his head hung On TV Hurricane Katrina is shown Old man Daws is in the bed opposite They stand by a window at the foot of the bed Smiling Oti takes a step back then turns and walks briskly out of the door She embraces him She gingerly reaches out to touch his smiling face A man approaches them on the dock Benjamin looks at a young guy Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor A woman with a dog sits beside Benjamin at a piano Benjamin wears a searching expression Daisy crawls into the makeshift den and Benjamin follows on his hands and knees Benjamin boards the tugboat Sepia footage of Mr Daws collapsing by a mailbox follows The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window Mike squints thoughtfully she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap A nurse arrives Caroline leaves Daisy's bedside Benjamin turns onto his side and sinks down beneath the covers Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes He nods He swabs the decks Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke Chelsea She gently strokes his back and kisses him on the forehead Benjamin stands up In the wheelhouse Mike leans towards Benjamin Daisy smiles He stares down The captain glances around Miss Fuller whisks up the sheet exposing them Mr Daws sits beside him on a bench Daisy obeys Wearing a nightgown she starts up the stairs using her cane She scratches her head thoughtfully as he walks away Benjamin hooks his cane on the end of his bed and gets in Grainy old footage shows the lightning striking him Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery Miss Fuller scowls at Benjamin The bearded captain wears braces and a peaked cap"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He joins in and they play together Benjamin washes himself in the bath He stares down Caroline leaves Daisy's bedside On TV Hurricane Katrina is shown A nurse arrives They stand by a window at the foot of the bed The nurse strides off to assist a colleague and Caroline drifts over to the empty bed beside her mother's Cast in cold blue light from the window she takes her hands out of the pockets of her dark bodywarmer and sits crosslegged on the mattress with the diary in her lap Mr Daws sits beside him on a bench Grainy footage shows lightning striking Mr Daws in a field sending up a plume of smoke A man approaches them on the dock The captain glances around Benjamin looks at a young guy Benjamin stands up The bearded captain wears braces and a peaked cap He nods Benjamin boards the tugboat Chelsea The captain leans out of the wheelhouse He swabs the decks In the wheelhouse Mike leans towards Benjamin Mike squints thoughtfully Benjamin wears a searching expression Daisy crawls into the makeshift den and Benjamin follows on his hands and knees Kneeling beneath the table Benjamin strikes a match and carefully lights a candle whose warm glow silhouettes them behind the white drapery Daisy smiles She gingerly reaches out to touch his smiling face Benjamin holds her gaze as she touches his stubbly cheek Miss Fuller whisks up the sheet exposing them Daisy obeys Miss Fuller scowls at Benjamin Wearing a nightgown she starts up the stairs using her cane Dejected Benjamin leans out of the den with his head hung Queenie comes up from the basement in her dressing gown and catches sight of him kneeling in the shadows staring at the floor Suddenly resolute Benjamin rises resting on his cane She embraces him She gently strokes his back and kisses him on the forehead She scratches her head thoughtfully as he walks away Benjamin hooks his cane on the end of his bed and gets in Old man Daws is in the bed opposite Grainy old footage shows the lightning striking him Sepia footage of Mr Daws collapsing by a mailbox follows Lying in his bed Daws exhales a cloud of wispy white cigarette smoke and stares off in thought Benjamin turns onto his side and sinks down beneath the covers Smiling Oti takes a step back then turns and walks briskly out of the door Straightbacked and without the use of a cane Benjamin goes to a window and peers out through narrowed eyes Carrying a suitcase Oti crosses the road below bathed in the orange glow of a streetlamp A woman with a dog sits beside Benjamin at a piano"
        }
      ]
    }
  ]
}