{
  "ground_truth": "The tug drifts, and somewhere ahead a U-boat surfaces in the darkness. Pleasant bangs on the wheelhouse window, and the tug restarts its engines, sending a plume of black smoke out of its funnel. Mike and Benjamin peer over the side and spot the U-boat's upper head as a U-boat blinds the whole surface. The tug's lights are visible on the horizon. Hurrying into the wheelhouse, the wheelman stares at Mike. Mike hands the wheelman a pistol, and a crew member mans a heavy machine gun on top of the tug while a gunner climbs into the conning tower. Benjamin has a life jacket, which he gives to one of the twins. The lights are turned off on the tug as Vic makes the sign of the cross. Manning the heavy machine gun, Danny Smith cocks the weapon, and the wheelman aims his pistol at the U-boat. Captain Mike grits his teeth, sets the engines full ahead, and steams towards the U-boat. The German gunner spots the tug approaching and opens fire with a machine gun. Benjamin ducks his face around as Danny returns fire. Mike flinches as the German rounds shatter the windows, and Pleasant, manning the searchlight, catches a bullet and collapses. Benjamin cowers on the deck below the wheelhouse, and Danny Smith is hit and falls from the machine gun. Mike also takes a hit and collapses. Vic crosses himself again as the tugboat plows forward and smashes into the side of the U-boat. The U-boat explodes beneath the tug, and both vessels take on water and begin to sink. Benjamin staggers into the wheelhouse and finds Mike on the floor. He props him up, and Mike screams in pain, tearing his jumper to reveal two bullet holes in his chest. Benjamin takes the captain's blood-soaked hand in his, and Mike dies. Benjamin stares down at him, his face stained with blood, as he stares at his lifeless skipper. Vic cradles his dead twin. A door swings open on the tug, which is listing badly in the water, and as dawn breaks, the tug and the U-boat have sunk below the waves. A fleet of other ships is now at the scene. Watched by a grieving Vic, Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water, a hummingbird flies past it, then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear, blue sky. Benjamin, who now looks about 50, with shorter hair and new specs, wanders into the retirement home. She looks around and sees him, taking a few seconds to recognize him. He looks down, and Benjamin plays the piano.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Here is the transformed text with synonyms used where possible while maintaining the sentence structure and meaning:\n\nThe towboat drifts, and someplace ahead a submarine surfaces in the blackness. Pleasant knocks on the wheelhouse window, and the towboat restarts its motors, sending a plume of ebony smoke out of its chimney. Mike and Benjamin peer over the side and spot the submarine's upper head as a submarine blinds the entire surface. The towboat's lights are visible on the skyline. Hurrying into the wheelhouse, the helmsman stares at Mike. Mike hands the helmsman a handgun, and a team member mans a heavy machine gun on top of the towboat while a cannoneer climbs into the command tower. Benjamin has a life vest, which he gives to one of the twins. The lights are turned off on the towboat as Vic makes the sign of the cross. Manning the heavy machine gun, Danny Smith cocks the weapon, and the helmsman aims his handgun at the submarine. Captain Mike grits his teeth, sets the motors full ahead, and steams towards the submarine. The German cannoneer spots the towboat approaching and opens fire with a machine gun. Benjamin ducks his face around as Danny returns fire. Mike flinches as the German rounds shatter the windows, and Pleasant, manning the searchlight, catches a bullet and collapses. Benjamin cowers on the deck below the wheelhouse, and Danny Smith is hit and falls from the machine gun. Mike also takes a hit and collapses. Vic crosses himself again as the tugboat plows forward and smashes into the side of the submarine. The submarine explodes beneath the tug, and both ships take on water and start to sink. Benjamin staggers into the wheelhouse and finds Mike on the floor. He props him up, and Mike screams in agony, tearing his sweater to reveal two bullet holes in his chest. Benjamin takes the captain's blood-soaked hand in his, and Mike dies. Benjamin stares down at him, his face stained with blood, as he stares at his lifeless skipper. Vic cradles his dead twin. A door swings open on the towboat, which is listing badly in the water, and as daybreak breaks, the towboat and the submarine have sunk below the waves. A fleet of other vessels is now at the scene. Watched by a grieving Vic, Benjamin tosses a life belt from The Chelsea over the side of the rescue ship. As it floats in the water, a hummingbird flits past it, then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear, blue sky. Benjamin, who now looks about 50, with shorter hair and new specs, wanders into the retirement abode. She looks around and sees him, taking a few seconds to recognize him. He looks down, and Benjamin plays the pianoforte."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Somewhere ahead, a U-boat is surfaced in the darkness as the tug is drifted. Pleasant bangs on the wheelhouse window, restarting the tug’s engines, and a plume of black smoke is sent out of its funnel. Over the side, Mike and Benjamin peer and spot the U-boat's upper head as the whole surface is blinded by a U-boat. On the horizon, the lights of the tug are visible. The wheelman hurries into the wheelhouse and stares at Mike. A pistol is handed to the wheelman by Mike, and on top of the tug, a heavy machine gun is manned by a crew member while into the conning tower, a gunner climbs. One of the twins is given a life jacket by Benjamin. Vic turns off the lights on the tug as he makes the sign of the cross. The weapon is cocked by Danny Smith, manning the heavy machine gun, while the pistol is aimed at the U-boat by the wheelman. The engines are set full ahead by Captain Mike as he grits his teeth and steams towards the U-boat. The tug approaching is spotted by the German gunner, and a machine gun is opened fire by him. Around, Benjamin ducks his face as Danny returns fire. As the German rounds shatter the windows, Mike flinches, and manning the searchlight, Pleasant catches a bullet and collapses. Below the wheelhouse, Benjamin cowers on the deck, and Danny Smith is hit and falls from the machine gun. Also, Mike takes a hit and collapses. As the tugboat plows forward, Vic crosses himself again and smashes into the side of the U-boat. Beneath the tug, the U-boat explodes, water is taken on by both vessels, and they begin to sink. Into the wheelhouse, Benjamin staggers and finds Mike on the floor. He props him up, and in pain, Mike screams, tearing his jumper to reveal two bullet holes in his chest. The captain's blood-soaked hand is taken in his by Benjamin, and Mike dies. Down at him, Benjamin stares, his face stained with blood, as at his lifeless skipper, he stares. His dead twin is cradled by Vic. On the tug, which is listing badly in the water, a door swings open, and as dawn breaks, below the waves, the tug and the U-boat have sunk. At the scene, a fleet of other ships is now. A life belt from The Chelsea is tossed over the side of the rescue vessel by Benjamin, watched by a grieving Vic. In the water, as it floats, past it, a hummingbird flies, then up it flies and briefly hovers in front of Benjamin before flying off. Out of a clear, blue sky, the sun shines down. Into the retirement home, Benjamin wanders, who now looks about 50, with shorter hair and new specs. Around she looks and sees him, taking a few seconds to recognize him. He looks down, and the piano is played by Benjamin."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The tug drifts as a U-boat surfaces in darkness. Pleasant knocks on the wheelhouse window, prompting the tug to restart its engines, emitting black smoke. Mike and Benjamin spot the U-boat's head. The wheelman stares at Mike, who hands him a pistol. A crew member manages a heavy machine gun, while a gunner climbs into the conning tower. Benjamin gives a life jacket to one of the twins. The tug's lights extinguish as Vic makes the sign of the cross. Danny Smith cocks the machine gun, and the wheelman aims at the U-boat. Captain Mike sets engines full ahead toward the U-boat. The German gunner fires, shattering windows. Pleasant is hit, collapsing; Danny Smith fires back but also falls. Mike is hit and collapses. Vic crosses himself as the tug crashes into the U-boat. Both vessels begin sinking. Benjamin finds Mike injured and dying in the wheelhouse. Benjamin holds Mike's blood-soaked hand as he dies. Vic cradles his dead twin. Dawn breaks, revealing the tug and U-boat have sunk. Ships arrive; Vic watches as Benjamin throws a life belt from The Chelsea. A hummingbird hovers near Benjamin, who appears older with shorter hair. He enters the retirement home, is recognized, and plays the piano."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The tug drifts in darkness as a U-boat surfaces. Pleasant taps the wheelhouse window; the tug restarts, emitting black smoke. Mike and Benjamin spot the U-boat. The wheelman stares at Mike, who hands him a pistol. A crew member mans a machine gun; Benjamin gives a life jacket to a twin. The lights dim, Vic crosses himself, Danny cocks the machine gun, and the wheelman aims at the U-boat. Captain Mike advances toward the U-boat, which fires. Benjamin ducks, Danny and Mike are hit and fall. Vic crosses himself as the tug crashes into the U-boat, which explodes. Both vessels sink. Benjamin finds Mike, bleeding with bullet holes, who dies in his arms. Vic cradles his dead twin. Dawn breaks, and both sink. Ships arrive. Vic watches Benjamin toss a life belt into the water. A hummingbird hovers before Benjamin as the sun shines. Benjamin, now 50, with short hair and glasses, enters a retirement home. She recognizes him slowly; Benjamin plays the piano."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The tugboat drifts quietly, moving with the current, while someplace ahead in the starlit darkness, a stealthy U-boat stealthily surfaces. Pleasant taps gently on the window of the wheelhouse, signaling to the crew, prompting the tug to fire up its engines once more. In response, a dense plume of black smoke billows out from its funnel into the night air. Mike and Benjamin, both alert and vigilant, peer cautiously over the side of the vessel and spot the upper head of the U-boat, whose imposing presence seems to overwhelm the entire surface of the water. Meanwhile, the tug's lights flicker distantly on the horizon, creating a small beacon of light. Rushing into the wheelhouse in a state of urgency, the wheelman locks eyes with Mike, who hands him a pistol for protection. At the same time, another crew member takes position, manning a heavy machine gun mounted atop the tug, and a gunner makes his way into the conning tower. Benjamin, prepared for emergency situations, has a life jacket ready, which he promptly hands to one of the twins for safety. In a sudden strategic maneuver, the lights on the tug are shut off, while Vic, in a moment of personal reflection, makes the sign of the cross. Positioned at the heavy machine gun, Danny Smith cocks the weapon, preparing for action, while the wheelman takes aim with his pistol at the threatening U-boat. Captain Mike, filled with determination, clenches his teeth, sets the engines to full speed ahead, and directs the tug with steely resolve towards the U-boat. The German gunner, quick to spot the advancing tug, begins to fire with their machine gun. As bullets rain down, Benjamin instinctively ducks for cover, turning his face away, while Danny immediately returns fire with precision. The tense situation escalates as Mike flinches, reacting to the German bullets that shatter the windows around him, and then, tragically, Pleasant, who is operating the searchlight, is struck by a bullet and falls. Meanwhile, Benjamin crouches down on the deck below the wheelhouse for protection, and Danny Smith is hit, falling from the machine gun position. Mike, too, suffers a hit and collapses in pain. As the tugboat continues its determined course, Vic crosses himself once more, witnessing the tug resolutely plowing forward until it collides forcefully with the side of the U-boat. The collision triggers a catastrophic explosion beneath the tug, causing both vessels to take on water rapidly and start to sink ominously. In the midst of this chaos, Benjamin struggles into the wheelhouse, only to find Mike lying on the floor. He assists in propping him up, but Mike screams in agony, revealing two bullet holes in his chest as he tears open his blood-soaked jumper. With a feeling of profound loss, Benjamin grasps the captain's blood-covered hand, and moments later, Mike succumbs to his injuries and dies. Left staring down at his fallen skipper, Benjamin's face is marked with blood and grief. Meanwhile, Vic tenderly cradles his deceased twin, mourning the profound loss. As a door swings open on the tug, which is now perilously listing in the water, dawn breaks, illuminating the scene as both the tug and the U-boat disappear beneath the waves. A fleet of other ships arrives at the scene to assist in the rescue effort. With Vic grieving nearby, Benjamin gently tosses a life belt, marked with \"The Chelsea,\" over the side of the rescue vessel into the waiting water. As the life belt floats, a hummingbird unexpectedly flits past it, then hovers momentarily in front of Benjamin, before flying gracefully away. The sun bathes the scene below in warm light from a clear, azure blue sky. Present-day Benjamin, now appearing to be around 50 years old, with shorter hair and new spectacles, finds himself wandering into a retirement home. He looks around, taking in his surroundings, while she notices him, taking a few moments to recognize the man he has become. He looks down momentarily with a sense of introspection, and soon after, Benjamin begins to play the piano, his fingers dancing over the keys."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The tugboat drifts silently and gently, moving in harmony with the natural flow of the current, while somewhere ahead in the vast, starlit darkness, a stealthy U-boat surfaces with deliberate stealth. Pleasant taps ever so gently on the window of the wheelhouse, signaling to the attentive crew and prompting the tug to fire up its engines once more. In immediate response, a dense plume of thick black smoke billows out fiercely from its funnel into the night air. Mike and Benjamin, both alert and vigilant, peer cautiously over the side of the vessel and spot the upper head of the U-boat, whose imposing and menacing presence seems to overwhelm and dominate the entire surface of the water. Meanwhile, the tug's lights flicker distantly on the horizon, creating a small yet strong beacon of light. In a state of urgency, the wheelman rushes into the wheelhouse, locking eyes with Mike, who then hands him a pistol for protection. At the exact same time, another crew member takes position, manning a heavy machine gun that is mounted atop the tug, while a gunner makes his determined way into the conning tower. Benjamin, well-prepared for emergency situations, has a life jacket ready at hand, which he promptly hands over to one of the twins for added safety. In a sudden and strategic maneuver, the lights on the tug are shut off, creating a cloak of darkness, while Vic, in a moment of personal reflection and prayer, makes the sign of the cross. Positioned at the heavy machine gun, Danny Smith cocks the weapon, preparing it for action, while the wheelman takes precise aim with his pistol at the threatening U-boat. Captain Mike, filled with unyielding determination, clenches his teeth, sets the engines to full speed ahead, and directs the tug with steely resolve towards the formidable U-boat. The German gunner, quick and vigilant, spots the advancing tug and begins to fire with their machine gun. As bullets rain down mercilessly, Benjamin instinctively ducks for cover, turning his face away for protection, while Danny immediately responds by returning fire with precision and focus. The tense situation escalates dramatically as Mike flinches, reacting to the German bullets that shatter the windows around him, and then, tragically, Pleasant, who is diligently operating the searchlight, is struck by a bullet and falls. Meanwhile, Benjamin crouches down on the deck below the wheelhouse for protection, and Danny Smith is hit, tragically falling from the machine gun position. Mike, too, suffers a hit and collapses in pain and agony. As the tugboat continues its determined and unwavering course, Vic crosses himself once more, witnessing the tug resolutely plowing forward until it collides forcefully and violently with the side of the U-boat. The collision triggers a catastrophic explosion beneath the tug, causing both vessels to take on water rapidly and start to sink ominously and inevitably. Amidst this chaos, Benjamin struggles into the wheelhouse, only to find Mike lying helplessly on the floor. He assists in propping him up, but Mike screams in agony, revealing two bullet holes in his chest as he tears open his blood-soaked jumper. Overcome with a feeling of profound loss, Benjamin grasps the captain's blood-covered hand, and moments later, Mike tragically succumbs to his severe injuries and dies. Left staring down at his fallen skipper, Benjamin's face is marked with blood and profound grief. Meanwhile, Vic tenderly cradles his deceased twin, deeply mourning the profound loss. As a door swings open on the tug, which is now perilously listing in the water, dawn breaks, illuminating the scene as both the tug and the U-boat disappear beneath the waves. A fleet of other ships arrives at the scene to assist in the rescue effort. With Vic grieving nearby, Benjamin gently tosses a life belt, marked with \"The Chelsea,\" over the side of the rescue vessel into the waiting and welcoming water. As the life belt floats, a hummingbird unexpectedly flits past it, then hovers momentarily in front of Benjamin, before flying gracefully away. The sun bathes the scene below in warm light, shining brightly from a clear, azure blue sky. Present-day Benjamin, now appearing to be around 50 years old, with shorter hair and new spectacles, finds himself wandering into a retirement home. He looks around, taking in his surroundings, while she notices him, pausing for a few moments to recognize the man he has become. He looks down momentarily with a sense of introspection, and soon after, Benjamin begins to play the piano, his fingers dancing gracefully over the keys."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The tug drifts slowly, almost lazily, in the water as the world around it seems quiet and still. In the distance, through the veil of darkness, a U-boat begins to emerge, its sleek form breaking through the surface of the water, disrupting the night. As this unfolds, Pleasant taps lightly but purposefully on the window of the wheelhouse, signaling the tug's need to awaken. The crew inside stirs into action, restarting the engines which rumble to life, sending a thick plume of black smoke spiraling out of the funnel, marking their presence. Meanwhile, Mike and Benjamin, standing at the side of the tug, peer intently into the murky abyss, their eyes catching the faint shape of the U-boat's upper head illuminated against the sky. But as if blinded by the sudden emergence, the U-boat appears to dominate the whole surface. The tug's lights, casting a faint glow, are visible in the distance, offering a glimmer of reassurance. Mike hurriedly enters the wheelhouse, where the wheelman fixes him with an intense stare. Without a word, Mike hands over a pistol to the wheelman, a silent gesture loaded with intent. Above, a crew member clambers atop the tug to man a heavy machine gun, while a determined gunner scales the conning tower, readying for conflict. Benjamin, ever thoughtful, holds a life jacket in his hands, handing it over to one of the twins as a precaution. In a tactical move, the lights on the tug are extinguished, casting them into shadow, and Vic quietly makes the sign of the cross, seeking a blessing or perhaps solace. Danny Smith, now positioned behind the heavy machine gun, cocks the weapon with a decisive motion, preparing for what is to come. Meanwhile, the wheelman takes careful aim, leveling his pistol towards the looming presence of the U-boat. Captain Mike, resolute and unflinching, grits his teeth, pushing the engines to their limits, setting them full ahead to steam directly towards the U-boat. Keenly aware, the German gunner on the U-boat notices the tug's direct approach and reacts swiftly, opening fire with a rapid burst from a machine gun. Benjamin, instinctively seeking cover, ducks his head, as Danny, unfazed, returns fire with precision. In the ensuing chaos, Mike recoils as German gunfire shatters the wheelhouse windows, sending a spray of glass everywhere. Amidst the fray, Pleasant, focused on manning the searchlight, is struck by a bullet, his body collapsing under the sudden impact. Below, Benjamin curls into the deck, seeking refuge from the barrage, while Danny Smith, hit by gunfire, falls away from the machine gun. In another cruel twist, Mike, too, is hit, his body succumbing to the relentless assault as he collapses. Vic, witnessing the devastation, crosses himself once more, a gesture of faith in a moment of despair. Yet, the tugboat, driven by momentum and fate, plows relentlessly forward, crashing into the side of the U-boat with an explosive force. The collision triggers a cataclysmic explosion beneath the tug, and both vessels, caught in the throes of destruction, begin to take on water, sinking slowly into the depths. Amidst the turmoil, Benjamin struggles into the wheelhouse, finding Mike fallen on the floor. With shaking hands, he props Mike up, only to hear the captain scream in agony, his chest revealing the grim sight of two gaping bullet holes. In a final gesture of camaraderie, Benjamin takes Mike's bloodied hand in his own, feeling the life ebb away as Mike exhales his last breath. Benjamin stands there, grief-stricken, his face smeared with blood and sorrow, as he looks down at his now-lifeless skipper. Nearby, Vic holds his deceased twin, cradling him in an embrace born of shared history and love. As the tug, now heavily listing in the water, succumbs to its watery fate, a door swings open, offering a glimpse of the dawn breaking on the horizon. As time moves inexorably forward, the tug and the U-boat disappear beneath the waves, leaving behind a somber scene. A fleet of other ships gathers at the location, a response to the tragedy that unfolded. With a heavy heart, Vic watches as Benjamin, standing aboard a rescue vessel, tosses a life belt marked 'The Chelsea' into the water, a token memory of the lost ship. As the life belt floats away, a hummingbird darts past, its vibrant energy a stark contrast to the somber mood, pausing briefly in front of Benjamin before flitting away. Above, the sun shines brightly in a clear, blue sky, casting a serene warmth over the scene. Time strides forward, and Benjamin reappears, noticeably older at around 50 years, with shorter hair and new spectacles framing his face. He wanders into a retirement home, the transformation of years evident in his demeanor. As he enters, she, a figure from his past, takes notice, needing a few moments to recognize the man before her. Her gaze prompts him to look down, and in a moment of quiet reflection, Benjamin sits down at a piano, allowing the music to speak the words his heart cannot."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The tug drifts through the darkness as a U-boat surfaces nearby. When Pleasant bangs on the window, the tug's engines restart, releasing black smoke. Mike and Benjamin spot the U-boat, and the tug's lights appear on the horizon. Rushing into the wheelhouse, Mike gives a pistol to the wheelman, while a crew member mans a machine gun and a gunner climbs into the conning tower. Benjamin hands a life jacket to one of the twins. With the tug's lights extinguished, Vic makes the sign of the cross, and Danny Smith prepares the machine gun as the wheelman aims at the U-boat. Captain Mike, determined, pushes the engines to full steam toward the U-boat. The German gunner fires, hitting Danny, Pleasant, and Mike, shattering windows and causing chaos. Despite the shooting, the tug collides with the U-boat, leading to both vessels sinking. Benjamin finds Mike injured in the wheelhouse, cradles his dying captain, and witnesses Vic mourning his twin. As dawn breaks, the tug and U-boat descend below the water, observed by a fleet of rescue ships. A grieving Vic watches Benjamin toss a life belt from the rescue vessel. A hummingbird flutters by, pausing in front of Benjamin before flying away. The sun shines in a clear sky as a visibly older Benjamin, now with shorter hair and glasses, enters a retirement home. He is initially unrecognized, but he soon plays the piano, losing himself in the music."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The tug drifts on the open sea, and somewhere ahead a U-boat, a type of German submarine used during World War II for its stealth and deadly torpedo attacks, surfaces in the darkness. Pleasant bangs on the wheelhouse window to signal urgency, and the tug restarts its engines, sending a plume of black smoke out of its funnel, a common sight indicative of coal or oil-powered vessels of that era. Mike and Benjamin peer over the side and spot the U-boat's upper head as a U-boat blinds the whole surface with its imposing presence. The tug's lights are visible on the horizon, potentially signaling other vessels of its presence or distress. Hurrying into the wheelhouse, a pivotal location for navigation and control on a ship, the wheelman stares at Mike. Mike hands the wheelman a pistol, a common practice for defense during hostile encounters at sea, and a crew member mans a heavy machine gun on top of the tug while a gunner climbs into the conning tower, a raised platform on a submarine used for observation and control. Benjamin has a life jacket, essential for survival in the event of a shipwreck, which he gives to one of the twins. The lights are turned off on the tug as Vic makes the sign of the cross, a gesture seeking divine protection or intervention in perilous situations. Manning the heavy machine gun, Danny Smith cocks the weapon, preparing it for firing, and the wheelman aims his pistol at the approaching threat of the U-boat. Captain Mike grits his teeth, sets the engines full ahead, and steams towards the U-boat with a resolve often seen in commanders during battle. The German gunner, a skilled operator trained for marine warfare, spots the tug approaching and opens fire with a machine gun. Benjamin ducks his face around as Danny returns fire, engaging in a combat exchange common in naval warfare. Mike flinches as the German rounds shatter the windows, creating a rain of glass shards, and Pleasant, manning the searchlight integral for navigation in darkness, catches a bullet and collapses. Benjamin cowers on the deck below the wheelhouse, a vulnerable position during an attack, and Danny Smith is hit and falls from the machine gun. Mike also takes a hit and collapses. Vic crosses himself again, reinforcing his faith at what could be his final moments, as the tugboat plows forward and smashes into the side of the U-boat, a tactic of desperation known as ramming. The U-boat explodes beneath the tug, and both vessels take on water and begin to sink, a grim fate for those aboard. Benjamin staggers into the wheelhouse and finds Mike on the floor. He props him up, and Mike screams in pain, tearing his jumper to reveal two bullet holes in his chest, a grim souvenir from the battle. Benjamin takes the captain's blood-soaked hand in his, and Mike dies. Benjamin stares down at him, his face stained with blood, as he stares at his lifeless skipper, the man who once commanded them. Vic cradles his dead twin, mourning the loss in the aftermath of the battle. A door swings open on the tug, which is listing badly in the water, a sign of impending capsize, and as dawn breaks, the tug and the U-boat have sunk below the waves, leaving behind debris and memories. A fleet of other ships, likely engaged in rescue or recovery, is now at the scene. Watched by a grieving Vic, Benjamin tosses a life belt from The Chelsea, a rescue vessel named likely for its home port, over the side. As it floats in the water, a hummingbird, a symbol of hope and resilience, flies past it, then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear, blue sky, an ironic contrast to the tragedy below. Benjamin, who now looks about 50, with shorter hair and new specs, wanders into the retirement home, a place for those seeking peace after a lifetime of work. She, perhaps a nurse or an old acquaintance, looks around and sees him, taking a few seconds to recognize him, changed as he is by time and experience. He looks down, and Benjamin plays the piano, perhaps as a means to find solace or connection to his past."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses The tug drifts and somewhere ahead a Uboat surfaces in the darkness He looks down and Benjamin plays the piano Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface The tug's lights are visible on the horizon Hurrying into the wheelhouse the wheelman stares at Mike Benjamin has a life jacket which he gives to one of the twins Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug while a gunner climbs into the conning tower Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel Benjamin has a life jacket which he gives to one of the twins The lights are turned off on the tug as Vic makes the sign of the cross Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat Hurrying into the wheelhouse the wheelman stares at Mike Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper The German gunner spots the tug approaching and opens fire with a machine gun The tug drifts and somewhere ahead a Uboat surfaces in the darkness Benjamin staggers into the wheelhouse and finds Mike on the floor A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves Benjamin ducks his face around as Danny returns fire Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun Mike also takes a hit and collapses Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat The Uboat explodes beneath the tug and both vessels take on water and begin to sink Benjamin staggers into the wheelhouse and finds Mike on the floor He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest Benjamin takes the captain's bloodsoaked hand in his and Mike dies The tug's lights are visible on the horizon The Uboat explodes beneath the tug and both vessels take on water and begin to sink Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper Vic cradles his dead twin A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves A fleet of other ships is now at the scene Watched by a grieving Vic Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off The sun shines down out of a clear blue sky Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home The lights are turned off on the tug as Vic makes the sign of the cross Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home She looks around and sees him taking a few seconds to recognize him As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off She looks around and sees him taking a few seconds to recognize him He looks down and Benjamin plays the piano"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The tug drifts and somewhere ahead a Uboat surfaces in the darkness. Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel. Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface. The tug's lights are visible on the horizon. Hurrying into the wheelhouse the wheelman stares at Mike. Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug. while a gunner climbs into the conning tower. Benjamin has a life jacket which he gives to one of the twins. The lights are turned off on the tug as Vic makes the sign of the cross. Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat. Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat. The German gunner spots the tug approaching and opens fire with a machine gun. Benjamin ducks his face around as Danny returns fire. Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses. Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun. Mike also takes a hit and collapses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat. The Uboat explodes beneath the tug and both vessels take on water and begin to sink. Benjamin staggers into the wheelhouse and finds Mike on the floor. He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest. Benjamin takes the captain's bloodsoaked hand in his and Mike dies. Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper. Vic cradles his dead twin. A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves. A fleet of other ships is now at the scene. Watched by a grieving Vic. Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear blue sky. Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home. She looks around and sees him taking a few seconds to recognize him. He looks down and Benjamin plays the piano."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The tug drifts and somewhere ahead a Uboat surfaces in the darkness. Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel. Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface. The tug's lights are visible on the horizon. Hurrying into the wheelhouse the wheelman stares at Mike. Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug. while a gunner climbs into the conning tower. Benjamin has a life jacket which he gives to one of the twins. The lights are turned off on the tug as Vic makes the sign of the cross. Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat. Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat. The German gunner spots the tug approaching and opens fire with a machine gun. Benjamin ducks his face around as Danny returns fire. Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses. Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun. Mike also takes a hit and collapses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat. The Uboat explodes beneath the tug and both vessels take on water and begin to sink. Benjamin staggers into the wheelhouse and finds Mike on the floor. He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest. Benjamin takes the captain's bloodsoaked hand in his and Mike dies. Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper. Vic cradles his dead twin. A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves. A fleet of other ships is now at the scene. Watched by a grieving Vic. Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear blue sky. Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home. She looks around and sees him taking a few seconds to recognize him. He looks down and Benjamin plays the piano."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The tug drifts and somewhere ahead a Uboat surfaces in the darkness. Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel. Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface. The tug's lights are visible on the horizon. Hurrying into the wheelhouse the wheelman stares at Mike. Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug. while a gunner climbs into the conning tower. Benjamin has a life jacket which he gives to one of the twins. A fleet of other ships is now at the scene. Watched by a grieving Vic. Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear blue sky. Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home. She looks around and sees him taking a few seconds to recognize him. He looks down and Benjamin plays the piano."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The tug drifts and somewhere ahead a Uboat surfaces in the darkness. Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel. Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface. The tug's lights are visible on the horizon. Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home. She looks around and sees him taking a few seconds to recognize him. He looks down and Benjamin plays the piano."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The octopus drifts, and somewhere ahead a caravan surfaces in the darkness. An elephant bangs on the wheelhouse window, and the octopus restarts its engines, sending a plume of black smoke out of its funnel. A peacock and a dolphin peer over the side and spot the caravan's upper head as a caravan blinds the whole surface. The octopus's lights are visible on the horizon. Hurrying into the wheelhouse, a sunflower stares at a peacock. A peacock hands the sunflower a pistol, and a giraffe mans a heavy machine gun on top of the octopus while a kangaroo climbs into the conning tower. A dolphin has a life jacket, which it gives to one of the acrobats. The lights are turned off on the octopus as a raccoon makes the sign of the cross. Manning the heavy machine gun, a lion cocks the weapon, and the sunflower aims its pistol at the caravan. Detective Peahen grits its teeth, sets the engines full ahead, and steams towards the caravan. The French horn spots the octopus approaching and opens fire with a machine gun. A dolphin ducks its face around as a lion returns fire. A peacock flinches as the French rounds shatter the windows, and an elephant, manning the searchlight, catches a bullet and collapses. A dolphin cowers on the deck below the wheelhouse, and a lion is hit and falls from the machine gun. A peacock also takes a hit and collapses. A raccoon crosses itself again as the octopus plows forward and smashes into the side of the caravan. The caravan explodes beneath the octopus, and both vessels take on water and begin to sink. A dolphin staggers into the wheelhouse and finds a peacock on the floor. It props it up, and a peacock screams in pain, tearing its jumper to reveal two bullet holes in its chest. A dolphin takes the detective’s blood-soaked hand in its, and a peacock dies. A dolphin stares down at it, its face stained with blood, as it stares at its lifeless detective. A raccoon cradles its dead acrobat. A door swings open on the octopus, which is listing badly in the water, and as dawn breaks, the octopus and the caravan have sunk below the waves. A fleet of other ships is now at the scene. Watched by a grieving raccoon, a dolphin tosses a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water, a butterfly flies past it, then flies up and hovers briefly in front of a dolphin before flying off. The sun shines down out of a clear, blue sky. A dolphin, who now looks about 50, with shorter hair and new specs, wanders into the retirement home. She looks around and sees it, taking a few seconds to recognize it. It looks down, and a dolphin plays the piano."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The sailboat drifts, and somewhere ahead a freighter surfaces in the darkness. Pleasant bangs on the greenhouse window, and the sailboat restarts its engines, sending a plume of white steam out of its chimney. Mike and Benjamin peer over the side and spot the freighter's upper mast as a freighter blinds the whole surface. The sailboat's lights are visible on the horizon. Hurrying into the greenhouse, the navigator stares at Mike. Mike hands the navigator a slingshot, and a crew member mans a heavy crossbow on top of the sailboat while an archer climbs into the crow's nest. Benjamin has a flotation device, which he gives to one of the twins. The lights are turned off on the sailboat as Vic makes the sign of the cross. Manning the heavy crossbow, Danny Smith cocks the weapon, and the navigator aims his slingshot at the freighter. Captain Mike grits his teeth, sets the engines full ahead, and sails towards the freighter. The German archer spots the sailboat approaching and opens fire with a crossbow. Benjamin ducks his face around as Danny returns fire. Mike flinches as the German bolts shatter the windows, and Pleasant, manning the lantern, catches a bolt and collapses. Benjamin cowers on the deck below the greenhouse, and Danny Smith is hit and falls from the crossbow. Mike also takes a hit and collapses. Vic crosses himself again as the sailboat plows forward and smashes into the side of the freighter. The freighter explodes beneath the sailboat, and both vessels take on water and begin to sink. Benjamin staggers into the greenhouse and finds Mike on the floor. He props him up, and Mike screams in pain, tearing his shirt to reveal two arrow holes in his chest. Benjamin takes the captain's blood-soaked hand in his, and Mike dies. Benjamin stares down at him, his face stained with blood, as he stares at his lifeless skipper. Vic cradles his dead twin. A hatch swings open on the sailboat, which is listing badly in the water, and as dawn breaks, the sailboat and the freighter have sunk below the waves. A fleet of other vessels is now at the scene. Watched by a grieving Vic, Benjamin tosses a buoy from The Chelsea over the side of the rescue ship. As it floats in the water, a seagull flies past it, then flies up and hovers briefly in front of Benjamin before flying off. The sun shines down out of a clear, blue sky. Benjamin, who now looks about 50, with shorter hair and new glasses, wanders into the old library. She looks around and sees him, taking a few seconds to recognize him. He looks down, and Benjamin plays the violin."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The tug floats, and somewhere ahead a U-boat emerges in the darkness. Pleasant taps on the wheelhouse window, and the tug revs its engines, sending a plume of black smoke out of its funnel. Mike and Benjamin glance over the side and notice the U-boat's upper head as a U-boat illuminates the whole surface. The tug's lights are visible on the horizon. Rushing into the wheelhouse, the wheelman gazes at Mike. Mike tosses the wheelman a pistol, and a crew member loads a heavy machine gun on top of the tug while a gunner descends into the conning tower. Benjamin carries a life jacket, which he hands to one of the twins. The lights are extinguished on the tug as Vic draws a sign of the cross. Handling the heavy machine gun, Danny Smith loads the weapon, and the wheelman gestures his pistol at the U-boat. Captain Mike grits his teeth, revs the engines full ahead, and drifts toward the U-boat. The German gunner notices the tug approaching and begins firing with a machine gun. Benjamin turns his face aside as Danny shoots back. Mike flinches as the German rounds pierce the windows, and Pleasant, operating the searchlight, takes a bullet and collapses. Benjamin crouches on the deck below the wheelhouse, and Danny Smith is struck and tumbles from the machine gun. Mike also takes a hit and collapses. Vic crosses himself again as the tugboat sails forward and bumps into the side of the U-boat. The U-boat detonates beneath the tug, and both vessels begin to sink. Benjamin stumbles into the wheelhouse and discovers Mike on the floor. He supports him, and Mike yells in pain, tearing his jumper to reveal two bullet holes in his chest. Benjamin clutches the captain's blood-soaked hand in his, and Mike passes away. Benjamin gazes down at him, his face smeared with blood, as he gazes at his lifeless skipper. Vic holds his deceased twin. A door bounces open on the tug, which is listing badly in the water, and as dawn breaks, the tug and the U-boat have submerged below the waves. A fleet of other ships is now at the scene. Observed by a grieving Vic, Benjamin flings a life belt from The Chelsea over the side of the rescue vessel. As it floats in the water, a hummingbird zips past it, then flutters up and hovers briefly in front of Benjamin before zipping away. The sun beams down out of a clear, blue sky. Benjamin, who now appears about 50, with shorter hair and new specs, ambles into the retirement home. She glances around and sees him, taking a few seconds to recognize him. He looks down, and Benjamin strums the piano."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bicycle floats, and somewhere nearby a kite emerges in the moonlight. Cheerful taps on the igloo window, and the bicycle restarts its turbines, sending a plume of blue steam out of its chimney. Clara and Jonathan gaze over the railing and spot the kite's lower wing as a kite darkens the entire sky. The bicycle's lanterns are visible on the skyline. Rushing into the igloo, the librarian stares at Clara. Clara hands the librarian a flashlight, and a drummer mans a large megaphone on top of the bicycle while a painter climbs into the crow's nest. Jonathan has a satchel, which he gives to one of the painters. The lanterns are switched off on the bicycle as Tony makes the sign of the triangle. Manning the large megaphone, Eddie Turner thumps the instrument, and the librarian aims her flashlight at the kite. Admiral Clara grinds her teeth, sets the turbines full speed, and zooms towards the kite. The French painter spots the bicycle approaching and opens fire with a megaphone. Jonathan ducks his face around as Eddie returns fire. Clara winces as the French echoes shatter the shutters, and Cheerful, manning the spotlight, catches a hammer and collapses. Jonathan cowers on the plank below the igloo, and Eddie Turner is struck and falls from the megaphone. Clara also takes a hit and collapses. Tony crosses himself again as the bicycle plows ahead and crashes into the wing of the kite. The kite implodes beneath the bicycle, and both contraptions take on air and begin to plummet. Jonathan stumbles into the igloo and finds Clara on the floor. He props her up, and Clara screams in pain, tearing her scarf to reveal two sharp pebbles in her shoulder. Jonathan takes the admiral's mud-soaked boot in his, and Clara perishes. Jonathan stares down at her, his face speckled with mud, as he gazes at his lifeless captain. Tony cradles his silent painter. A portal swings open on the bicycle, which is leaning perilously in the air, and as dawn breaks, the bicycle and the kite have drifted below the clouds. A swarm of other balloons is now at the scene. Watched by a mourning Tony, Jonathan tosses a parachute from The Boston over the edge of the rescue balloon. As it floats in the air, a butterfly flutters past it, then flutters up and hovers briefly in front of Jonathan before flitting away. The moon shines down out of a starry, purple sky. Jonathan, who now looks about 80, with longer hair and missing glasses, wanders into the museum. He looks around and sees her, taking a few seconds to recognize her. She looks down, and Jonathan strums the guitar."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The canoe floats, and somewhere ahead an airship hovers in the twilight. Satisfied taps on the doorframe, and the canoe activates its sails, releasing a plume of white mist out of its chimney. Lucy and Samuel gaze over the edge and glimpse the airship's top fin as an airship floods the entire sky. The canoe's beacons are noticeable on the skyline. Rushing into the control room, the navigator glares at Lucy. Lucy hands the navigator a sword, and a sailor staffs a light cannon on top of the canoe while a scout climbs into the crow's nest. Samuel has a parachute, which he offers to one of the siblings. The beacons are shut off on the canoe as Lee whispers a prayer. Operating the light cannon, Johnny Sparks primes the weapon, and the navigator directs his sword at the airship. Commander Lucy clenches her fists, ramps the sails full throttle, and glides towards the airship. The Italian scout spots the canoe advancing and launches a flare with a catapult. Samuel shields his eyes as Johnny responds with an arrow. Lucy winces as the Italian flares crack the lamps, and Satisfied, operating the spotlight, takes a hit and slumps. Samuel hides on the deck beneath the control room, and Johnny Sparks is struck and tumbles from the light cannon. Lucy also suffers a wound and slumps. Lee whispers again as the canoe sails forward and crashes into the flank of the airship. The airship bursts beneath the canoe, and both crafts take in water and start to submerge. Samuel stumbles into the control room and discovers Lucy on the floor. He supports her, and Lucy groans in agony, ripping her coat to expose two stab wounds in her torso. Samuel holds the commander's blood-drenched fingers in his, and Lucy perishes. Samuel gazes at her, his visage smeared with salt, as he gazes at his fallen commander. Lee embraces his silent sibling. A hatch flips open on the canoe, which is tilting precariously in the sea, and as day breaks, the canoe and the airship have vanished beneath the surface. A convoy of other boats is now at the location. Observed by a mourning Lee, Samuel heaves a flotation device from The Bristol over the edge of the rescue craft. As it drifts in the waves, a butterfly flutters past it, then flutters up and pauses momentarily in front of Samuel before fluttering away. The sun beams down out of a clear, blue sky. Samuel, who now appears about 50, with shorter hair and new spectacles, strolls into the retirement community. She gazes around and spots him, taking a few moments to identify him. She gazes down, and Samuel dances the waltz."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The kayak floats, and somewhere nearby a spaceship lands in the moonlight. Pleasant taps on the cabin window, and the kayak activates its heaters, releasing a trail of orange sparks from its chimney. Mike and Benjamin glance over the edge and notice the spaceship's lower fin as a spaceship obscures the entire horizon. The kayak's lanterns are visible in the distance. Rushing into the cabin, the helmsman gazes at Mike. Mike hands the helmsman a slingshot, and a crew member operates a large catapult on top of the kayak while a climber ascends into the observation post. Benjamin has a parachute, which he gives to one of the twins. The lanterns are extinguished on the kayak as Vic waves his hand in a gesture of farewell. Operating the large catapult, Danny Smith loads the device, and the helmsman targets his slingshot at the spaceship. Captain Mike clenches his fists, pushes the heaters to maximum, and glides towards the spaceship. The alien observer notices the kayak advancing and starts flinging pebbles with a slingshot. Benjamin hides his eyes as Danny responds with pebbles. Mike cringes as the alien pebbles shatter the portholes, and Pleasant, operating the spotlight, takes a pebble and collapses. Benjamin crouches on the deck below the cabin, and Danny Smith is struck and tumbles from the catapult. Mike also gets hit and topples over. Vic waves farewell again as the kayak charges forward and collides with the side of the spaceship. The spaceship detonates beneath the kayak, and both crafts begin to take water and start to submerge. Benjamin stumbles into the cabin and finds Mike on the ground. He props him up, and Mike cries out in agony, ripping his tunic to reveal two pebble bruises on his torso. Benjamin holds the captain's dirt-covered hand in his, and Mike passes away. Benjamin looks down at him, his face marked with dirt, as he gazes at his motionless leader. Vic embraces his deceased twin. A drawer swings open on the kayak, which is tilting precariously in the water, and as dawn arrives, the kayak and the spaceship have vanished beneath the ocean. A fleet of other kayaks is now at the scene. Observed by a mourning Vic, Benjamin hurls an inflatable ring from The Chelsea over the side of the rescue craft. As it drifts in the water, a dragonfly zips past it, then flies up and hovers briefly in front of Benjamin before darting away. The moon glows down out of a calm, dark sky. Benjamin, who now seems about 50, with shorter hair and new glasses, wanders into the art gallery. She looks around and sees him, pausing for a few moments to recognize him. He looks down, and Benjamin sketches quietly."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The kayak drifts, and somewhere ahead a cargo plane lands in the fog. Joy knocks on the lighthouse door, and the kayak revs its turbines, releasing a trail of white steam from its exhaust. Susan and Jonathan peer over the edge and notice the cargo plane's top wing as a cargo plane blinds the entire sky. The kayak's lanterns are visible on the skyline. Rushing into the lighthouse, the sailor glances at Susan. Susan passes the sailor a bouquet, and a passenger wields a massive camera on top of the kayak while a photographer clambers into the control cabin. Jonathan has an umbrella, which he gives to one of the triplets. The lights are dimmed on the kayak as Alex makes the gesture of the salute. Operating the massive camera, Charlie Lewis adjusts the lens, and the sailor focuses his bouquet at the cargo plane. Leader Susan grits her teeth, turns the turbines to maximum, and glides towards the cargo plane. The French photographer notices the kayak nearing and starts snapping photos with a camera. Jonathan shields his face as Charlie snaps back more photos. Susan winces as the French flashes shatter the portholes, and Joy, handling the spotlight, catches a flash and falls. Jonathan cringes on the ground below the lighthouse, and Charlie Lewis is blinded and tumbles from the camera. Susan also gets a flash and falls. Alex salutes again as the kayak rolls ahead and bumps into the side of the cargo plane. The cargo plane combusts beneath the kayak, and both transports take on water and start to dip. Jonathan stumbles into the lighthouse and finds Susan on the tiles. He supports her, and Susan cries out in agony, ripping her sweatshirt to reveal two snapshots in her jacket. Jonathan clasps the leader's paper-covered hand in his, and Susan expires. Jonathan gazes down at her, his face smudged with ink, as he watches his motionless mentor. Alex hugs his departed triplet. A window slides open on the kayak, which is tilting sharply in the sea, and as dusk falls, the kayak and the cargo plane have sunk beneath the waves. A convoy of other vessels is now at the location. Observed by a mourning Alex, Jonathan tosses a life preserver from The Monaco over the edge of the rescue boat. As it drifts in the sea, a dragonfly zips past it, then zips up and lingers briefly in front of Jonathan before flying away. The moon beams down out of a clear, starry night. Jonathan, who now appears about 80, with longer hair and old spectacles, strolls into the library. He looks around and sees her, taking a few seconds to recognize her. He glances up, and Jonathan reads the novel."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The tug drifts in darkness as a U-boat surfaces ahead. Mike, Benjamin, and the crew brace for a confrontation, arming themselves as the tug's lights dim. The tug charges at the U-boat, provoking German gunfire. Pleasant is killed, and Danny Smith and Mike are hit. Despite casualties, the tug collides with the U-boat, causing both vessels to sink. Benjamin finds a mortally wounded Mike, who dies in his arms. As dawn breaks, a rescue fleet arrives. A grieving Vic watches Benjamin, now appearing older, throw a life belt overboard. A hummingbird briefly appears before flying away under a clear sky. Benjamin enters a retirement home and plays the piano, marking a somber reflection on the past."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He looks down and Benjamin plays the piano She looks around and sees him taking a few seconds to recognize him Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home The sun shines down out of a clear blue sky As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel Watched by a grieving Vic A fleet of other ships is now at the scene A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves Vic cradles his dead twin Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper Benjamin takes the captain's bloodsoaked hand in his and Mike dies He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest Benjamin staggers into the wheelhouse and finds Mike on the floor The Uboat explodes beneath the tug and both vessels take on water and begin to sink Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat Mike also takes a hit and collapses Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses Benjamin ducks his face around as Danny returns fire The German gunner spots the tug approaching and opens fire with a machine gun Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat The lights are turned off on the tug as Vic makes the sign of the cross Benjamin has a life jacket which he gives to one of the twins while a gunner climbs into the conning tower Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug Hurrying into the wheelhouse the wheelman stares at Mike The tug's lights are visible on the horizon Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel The tug drifts and somewhere ahead a Uboat surfaces in the darkness"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat Mike also takes a hit and collapses Watched by a grieving Vic The German gunner spots the tug approaching and opens fire with a machine gun Vic cradles his dead twin while a gunner climbs into the conning tower He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest Benjamin ducks his face around as Danny returns fire Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat The sun shines down out of a clear blue sky Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun A fleet of other ships is now at the scene Benjamin takes the captain's bloodsoaked hand in his and Mike dies She looks around and sees him taking a few seconds to recognize him Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses Benjamin staggers into the wheelhouse and finds Mike on the floor Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface The Uboat explodes beneath the tug and both vessels take on water and begin to sink Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper The tug's lights are visible on the horizon Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home Hurrying into the wheelhouse the wheelman stares at Mike As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off He looks down and Benjamin plays the piano The lights are turned off on the tug as Vic makes the sign of the cross A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves The tug drifts and somewhere ahead a Uboat surfaces in the darkness Benjamin has a life jacket which he gives to one of the twins"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Vic crosses himself again as the tugboat plows forward and smashes into the side of the Uboat The Uboat explodes beneath the tug and both vessels take on water and begin to sink Benjamin staggers into the wheelhouse and finds Mike on the floor He props him up and Mike screams in pain tearing his jumper to reveal two bullet holes in his chest Benjamin takes the captain's bloodsoaked hand in his and Mike dies Benjamin stares down at him his face stained with blood as he stares at his lifeless skipper Vic cradles his dead twin A door swings open on the tug which is listing badly in the water and as dawn breaks the tug and the Uboat have sunk below the waves A fleet of other ships is now at the scene Watched by a grieving Vic Benjamin tosses a life belt from The Chelsea over the side of the rescue vessel As it floats in the water a hummingbird flies past it then flies up and hovers briefly in front of Benjamin before flying off The sun shines down out of a clear blue sky Benjamin who now looks about 50 with shorter hair and new specs wanders into the retirement home She looks around and sees him taking a few seconds to recognize him He looks down and Benjamin plays the piano The tug drifts and somewhere ahead a Uboat surfaces in the darkness Pleasant bangs on the wheelhouse window and the tug restarts its engines sending a plume of black smoke out of its funnel Mike and Benjamin peer over the side and spot the Uboat's upper head as a Uboat blinds the whole surface The tug's lights are visible on the horizon Hurrying into the wheelhouse the wheelman stares at Mike Mike hands the wheelman a pistol and a crew member mans a heavy machine gun on top of the tug while a gunner climbs into the conning tower Benjamin has a life jacket which he gives to one of the twins The lights are turned off on the tug as Vic makes the sign of the cross Manning the heavy machine gun Danny Smith cocks the weapon and the wheelman aims his pistol at the Uboat Captain Mike grits his teeth sets the engines full ahead and steams towards the Uboat The German gunner spots the tug approaching and opens fire with a machine gun Benjamin ducks his face around as Danny returns fire Mike flinches as the German rounds shatter the windows and Pleasant manning the searchlight catches a bullet and collapses Benjamin cowers on the deck below the wheelhouse and Danny Smith is hit and falls from the machine gun Mike also takes a hit and collapses"
        }
      ]
    }
  ]
}