{
  "ground_truth": "Tom sees her as Gatsby approaches, causing Tom to panic. Tom throws money at Wilson and speeds off after Gatsby and Daisy, who are now ahead. Watching from the upstairs window, Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past heaps of trash and coal waste, heading across the Queensboro Bridge side-by-side. Gatsby looks at Tom to his left, puts his foot down, and the coupe edges ahead. Grinning, Daisy waves exuberantly as they pass a train and head into New York City. In a plush suite at the Plaza Hotel, Tom watches an employee chip away at a large block of ice with an ice pick, while windows are wide open and several fans are on. The others sit around drinking whiskey, and the ice is put on a tray. Sweat glows on their faces, and Tom presses ice against the back of his neck. Nick and Jordan pay close attention to their exchange as frowning, Gatsby nods at Tom and stands across the room from him. Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window. Gatsby turns to face Tom who stands with his back to Gatsby, while Gatsby takes Daisy's hand. Silently seething, Tom turns to face Gatsby as Daisy slowly sits and Tom glowers. Daisy is tearful, shakes her head, and Tom looks unnerved as tears fill her eyes and her head droops forward. Gatsby smiles inquiringly, Tom points at Nick, and Gatsby drinks. Gatsby holds Tom by his shirt collar and looms over him with his fist raised. Tom rests his forehead against Gatsby's for a moment, then grins as if he's won some kind of game. Daisy holds her hands over her face fearfully, as does Jordan. Gatsby looks shocked, and his chest heaving, steps away from Tom. Daisy stares at Gatsby, tears brimming in her eyes, as he goes to her and tears flood from her eyes. Tom looks at his watch as Gatsby runs out, knocking over a lamp, and Tom pushes the door shut, causing the phone book to fall to the floor. He has a slug of whiskey, and frowning heavily, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out of the window, across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck, and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes, and seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel of the Deusenberg to try and swerve, but it's too late, and the Deusenberg hits Myrtle. She rolls up the bonnet, hits the windscreen, and is thrown in the air.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Tom perceives her as Gatsby nears, causing Tom to panic. Tom flings cash at Wilson and accelerates off after Gatsby and Daisy, who are now ahead. Observing from the upstairs window, Myrtle appears desperate and tearful. Gatsby and Tom drive along the filthy road past piles of trash and coal waste, heading across the Queensboro Bridge side-by-side. Gatsby glances at Tom to his left, pushes his foot down, and the coupe inches ahead. Grinning, Daisy waves exuberantly as they pass a train and head into New York City. In a luxurious suite at the Plaza Hotel, Tom observes an employee chip away at a large block of ice with an ice pick, while windows are wide open and several fans are on. The others sit around consuming whiskey, and the ice is placed on a tray. Sweat glistens on their faces, and Tom presses ice against the back of his neck. Nick and Jordan pay close attention to their exchange as frowning, Gatsby nods at Tom and stands across the room from him. Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window. Gatsby turns to face Tom who stands with his back to Gatsby, while Gatsby holds Daisy's hand. Silently fuming, Tom turns to face Gatsby as Daisy slowly sits and Tom scowls. Daisy is tearful, shakes her head, and Tom appears unnerved as tears fill her eyes and her head droops forward. Gatsby beams inquiringly, Tom points at Nick, and Gatsby drinks. Gatsby grasps Tom by his shirt collar and towers over him with his fist lifted. Tom rests his forehead against Gatsby's for a moment, then grins as if he's won some sort of game. Daisy covers her face fearfully, as does Jordan. Gatsby appears shocked, and his chest heaving, steps away from Tom. Daisy gazes at Gatsby, tears brimming in her eyes, as he goes to her and tears flood from her eyes. Tom checks his watch as Gatsby dashes out, knocking over a lamp, and Tom pushes the door shut, causing the phone book to tumble to the floor. He has a slug of whiskey, and frowning heavily, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out of the window, across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck, and she hits him and runs. The bright yellow Deusenberg roars through the Valley of Ashes, and seeing the automobile, Myrtle runs into the road. As another car nears, Gatsby grips the wheel of the Deusenberg to attempt and swerve, but it's too late, and the Deusenberg strikes Myrtle. She rolls up the hood, hits the windshield, and is tossed in the air."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Tom sees her as Gatsby approaches, causing Tom to panic. Money is thrown at Wilson by Tom, and the car is sped off by him after Gatsby and Daisy, who are now ahead. Myrtle, watching from the upstairs window, looks desperate and tearful. Along the filthy road past heaps of trash and coal waste, Gatsby and Tom are driven side-by-side across the Queensboro Bridge. Tom is looked at by Gatsby to his left, and the foot is put down by him as the coupe is edged ahead. As a train is passed and New York City is headed into, Daisy waves exuberantly while grinning. In a plush suite at the Plaza Hotel, an employee is watched by Tom as a large block of ice is chipped away at with an ice pick, while the windows are wide open and several fans are on. Whiskey is drunk by the others as they sit around, and ice is put on a tray by them. Sweat glows on their faces, and the back of his neck is pressed against with ice by Tom. As frowning, Gatsby nods at Tom and stands across the room from him, Nick and Jordan pay close attention to their exchange. Nick glances about uncomfortably as Gatsby has a sip of whiskey and goes to stand at a window. Tom is faced by Gatsby, who stands with his back to him, while Daisy's hand is taken by Gatsby. Silently seething, Gatsby is turned to face by Tom as Daisy slowly sits and Tom glowers. Daisy is tearful, shakes her head, and as tears fill her eyes and her head droops forward, Tom looks unnerved. Gatsby smiles inquiringly, and Nick is pointed at by Tom, while a drink is had by Gatsby. Tom is held by his shirt collar by Gatsby, who looms over him with his fist raised. For a moment, Gatsby's forehead is rested against by Tom, then a grin is given by him as if some kind of game has been won by him. Her face is held over by Daisy fearfully, as is done by Jordan. Shock is looked by Gatsby, and as his chest heaves, he steps away from Tom. Gatsby is stared at by Daisy, tears brimming in her eyes, as he goes to her and tears flood from her eyes. His watch is looked at by Tom as the lamp is knocked over by Gatsby running out, and the door is pushed shut by Tom, causing the phone book to fall to the floor. A slug of whiskey is had by him, and as another bottle of whiskey is unwrapped by Tom, Nick frowns heavily and goes to look out of a window. Nick remains at the window, turns, and away is glanced by Tom while Nick looks out of the window, across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck, and he is hit by her, and she runs. The bright yellow Deusenberg thunders through the Valley of Ashes, and as the car is seen, into the road is run by Myrtle. As another car approaches, the wheel of the Deusenberg is gripped by Gatsby to try and swerve, but it's too late, and Myrtle is hit by the Deusenberg. The bonnet is rolled up, the windscreen is hit, and she is thrown in the air."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Tom sees her as Gatsby approaches, causing Tom to panic. He throws money at Wilson and speeds after Gatsby and Daisy, who are ahead. Watching from the upstairs window, Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past trash heaps and coal waste, heading across the Queensboro Bridge side-by-side. Gatsby looks at Tom, accelerates, and the coupe edges ahead. Grinning, Daisy waves exuberantly as they pass a train into New York City. In a plush Plaza Hotel suite, Tom watches an employee chip away at ice with an ice pick, while windows are open and fans are on. The others drink whiskey, and the ice is put on a tray. Sweat glows on their faces, and Tom presses ice against his neck. Nick and Jordan pay close attention as Gatsby nods at Tom and stands across the room. Nick glances about uncomfortably while Gatsby sips whiskey and stands at a window. Gatsby turns to face Tom, who stands with his back to Gatsby, while Gatsby takes Daisy's hand. Silently seething, Tom turns to face Gatsby as Daisy slowly sits and Tom glowers. Daisy is tearful, shakes her head, and Tom looks unnerved as tears fill her eyes. Gatsby smiles inquiringly, Tom points at Nick, and Gatsby drinks. Gatsby holds Tom by his shirt collar and looms over him with his fist raised. Tom rests his forehead against Gatsby's, then grins as if he's won a game. Daisy and Jordan cover their faces fearfully. Gatsby looks shocked, steps away from Tom, and Daisy stares at Gatsby, tears brimming. He goes to her, and tears flood from her eyes. Tom looks at his watch as Gatsby runs out, knocking over a lamp, and Tom shuts the door, causing the phone book to fall. He drinks whiskey, and frowning, Nick looks out a window as Tom unwraps another bottle. Nick remains at the window, turns, and Tom glances away while Nick looks out across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck, and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes, and seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel to swerve, but it's too late, and the Deusenberg hits Myrtle. She rolls up the bonnet, hits the windscreen, and is thrown in the air."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Tom panics as Gatsby approaches, throws money at Wilson, and speeds after Gatsby and Daisy. Myrtle, desperate and tearful, watches from a window. Gatsby and Tom drive past trash heaps, heading across the Queensboro Bridge. Gatsby accelerates, edging ahead, and Daisy waves as they enter New York City. At the Plaza Hotel, Tom watches an employee chip ice while others drink whiskey. Tom presses ice to his neck, and Gatsby nods at him. Nick and Jordan observe as Gatsby stands by a window, then faces Tom, taking Daisy's hand. Tom, seething, faces Gatsby as Daisy sits tearfully. Gatsby smiles, Tom points at Nick, and Gatsby drinks. Gatsby grabs Tom's collar, raising his fist. Tom grins, Daisy and Jordan cover their faces, and Gatsby steps back, shocked. Daisy, tearful, watches Gatsby. Tom checks his watch as Gatsby runs out, knocking over a lamp. Tom shuts the door, causing a phone book to fall. He drinks whiskey, and Nick frowns, looking out the window. Myrtle's forehead is cut as Wilson shakes her, and she runs. The yellow Deusenberg speeds through the Valley of Ashes. Seeing the car, Myrtle runs into the road. Gatsby tries to swerve, but it's too late, and the Deusenberg hits Myrtle, throwing her into the air."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Tom observes her as Gatsby makes his approach, which causes Tom to become visibly panicked and anxious. In a hurried and frantic motion, Tom throws money at Wilson and quickly speeds off in pursuit of Gatsby and Daisy, who are now ahead of him on the road. From her vantage point at the upstairs window, Myrtle watches with a desperate and tearful expression. Gatsby and Tom drive along the filthy, grimy road, passing by heaps of trash and coal waste, as they head across the Queensboro Bridge side-by-side. Gatsby glances at Tom, who is positioned to his left, and then decisively puts his foot down on the accelerator, causing the coupe to edge ahead. Grinning with excitement, Daisy waves exuberantly as they pass a train and continue their journey into the bustling city of New York.\n\nIn a plush and luxurious suite at the Plaza Hotel, Tom watches intently as an employee chips away at a large block of ice with an ice pick, while the windows are wide open and several fans are running to combat the heat. The others sit around, drinking whiskey, and the ice is placed on a tray. Sweat glistens on their faces, and Tom presses a piece of ice against the back of his neck to cool down. Nick and Jordan pay close attention to the tense exchange, as Gatsby, frowning, nods at Tom and stands across the room from him. Nick glances around uncomfortably while Gatsby takes a sip of whiskey and moves to stand by a window. Gatsby turns to face Tom, who stands with his back to him, while Gatsby takes Daisy's hand in his own. Silently seething with anger, Tom turns to face Gatsby as Daisy slowly sits down, and Tom glowers at her. Daisy, tearful, shakes her head, and Tom looks unnerved as tears fill her eyes and her head droops forward. Gatsby smiles inquiringly, Tom points at Nick, and Gatsby takes another drink. Gatsby then grabs Tom by his shirt collar and looms over him with his fist raised threateningly. Tom rests his forehead against Gatsby's for a moment, then grins as if he has won some kind of game. Daisy, filled with fear, holds her hands over her face, as does Jordan. Gatsby looks shocked, and with his chest heaving, he steps away from Tom. Daisy stares at Gatsby, tears brimming in her eyes, as he approaches her and tears flood from her eyes. Tom looks at his watch as Gatsby runs out, knocking over a lamp in his haste, and Tom pushes the door shut, causing the phone book to fall to the floor. He takes a slug of whiskey, and frowning heavily, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out of the window, across the Queensboro Bridge.\n\nMyrtle's forehead is cut as Wilson shakes the poles around her neck, and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes, and upon seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel of the Deusenberg in an attempt to swerve, but it is too late, and the Deusenberg hits Myrtle. She rolls up the bonnet, hits the windscreen, and is thrown into the air."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Tom carefully observes her from a distance as Gatsby confidently makes his approach, which causes Tom to become visibly panicked and filled with anxiety. In a hurried and frantic motion, Tom throws money at Wilson and then quickly speeds off in pursuit of Gatsby and Daisy, who are now ahead of him on the road. From her vantage point at the upstairs window, Myrtle watches with a desperate and tearful expression. Gatsby and Tom drive along the filthy, grimy road, passing by heaps of trash and coal waste, as they head across the Queensboro Bridge side-by-side. Gatsby glances at Tom, who is positioned to his left, and then decisively puts his foot down on the accelerator, causing the coupe to edge ahead. Grinning with excitement, Daisy waves exuberantly as they pass a train and continue their journey into the bustling city of New York.\n\nWithin a plush and luxurious suite at the Plaza Hotel, Tom watches intently as an employee chips away at a large block of ice with an ice pick, while the windows are wide open and several fans are running to combat the stifling heat. The others sit around, drinking whiskey, and the ice is placed on a tray. Sweat glistens on their faces, and Tom presses a piece of ice against the back of his neck to cool down. Nick and Jordan pay close attention to the tense exchange, as Gatsby, frowning, nods at Tom, standing across the room from him. Nick glances around uncomfortably while Gatsby, taking a deliberate sip of whiskey, moves to stand by a window. Gatsby turns to face Tom, who stands with his back to him, while Gatsby takes Daisy’s hand in his own tenderly. Silently seething with anger, Tom turns to face Gatsby as Daisy slowly sits down, and Tom glowers at her. Daisy, tearful, shakes her head, and Tom looks unnerved as tears fill her eyes and her head droops forward. Gatsby smiles inquiringly, and Tom points accusingly at Nick, while Gatsby takes another contemplative drink. Gatsby then grabs Tom by his shirt collar and looms over him with his fist raised threateningly. Tom rests his forehead against Gatsby's for a moment, then grins as if he has won some kind of game. Daisy, filled with fear, covers her face with her hands, as does Jordan. Gatsby looks shocked, and with his chest heaving from emotion, he steps away from Tom. Daisy stares at Gatsby, tears brimming in her eyes, as he approaches her and tears flood from her eyes. Tom glances at his watch as Gatsby runs out, knocking over a lamp in his haste, and Tom pushes the door shut, causing the phone book to fall to the floor dramatically. He takes a slug of whiskey, and frowning heavily, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out of the window, across the expanse of the Queensboro Bridge.\n\nMyrtle’s forehead is cut as Wilson, in his frantic state, shakes the poles around her neck, and she hits him and runs wildly. The bright yellow Deusenberg thunders through the Valley of Ashes, and upon seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel of the Deusenberg in a desperate attempt to swerve, but it is too late, and the Deusenberg tragically hits Myrtle. She rolls up the bonnet, hits the windscreen, and is violently thrown into the air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Tom catches sight of her while Gatsby approaches, a wave of panic overtakes him, prompting him to hastily throw money at Wilson before accelerating his car in pursuit of Gatsby and Daisy, who are now ahead of him. Meanwhile, Myrtle, watching from an upstairs window, appears desperate and tearful as she observes the unfolding scene. Gatsby and Tom drive along the filthy road, navigating past heaps of trash and coal waste, as they head across the Queensboro Bridge side-by-side. Gatsby glances at Tom to his left, then decisively presses his foot down on the accelerator, causing his coupe to edge ahead. With a grin, Daisy waves exuberantly as they pass a train and continue their journey into New York City. In a plush suite at the Plaza Hotel, Tom's attention is momentarily captured by an employee chipping away at a large block of ice with an ice pick, while the windows are wide open and several fans whir in the background. The others sit around, sipping whiskey, as the ice is placed on a tray, and sweat glistens on their faces. Tom presses a piece of ice against the back of his neck for relief. Nick and Jordan watch the exchange closely as Gatsby, frowning, nods at Tom and positions himself across the room from him. Nick glances around uncomfortably while Gatsby takes a sip of whiskey and moves to stand by a window. Gatsby then turns to face Tom, who stands with his back to him, and takes Daisy's hand. Silently seething, Tom turns to confront Gatsby as Daisy slowly sits down, and Tom glowers at her. Daisy, tearful, shakes her head, and Tom appears unnerved as tears fill her eyes and her head droops forward. Gatsby smiles inquiringly, prompting Tom to point at Nick, while Gatsby takes another drink. Gatsby then grabs Tom by his shirt collar, looming over him with his fist raised. Tom rests his forehead against Gatsby's for a brief moment, then grins as if he's won some kind of game. Daisy, fearful, covers her face with her hands, as does Jordan. Gatsby, looking shocked and with his chest heaving, steps away from Tom. Daisy stares at Gatsby, tears brimming in her eyes, as he approaches her, and tears begin to flood from her eyes. Tom checks his watch as Gatsby runs out, accidentally knocking over a lamp, and Tom pushes the door shut, causing the phone book to fall to the floor. He takes a slug of whiskey, and with a heavy frown, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out across the Queensboro Bridge. Meanwhile, Myrtle's forehead is cut as Wilson shakes the poles around her neck, prompting her to hit him and run. The bright yellow Deusenberg thunders through the Valley of Ashes, and upon seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel of the Deusenberg in an attempt to swerve, but it's too late, and the Deusenberg collides with Myrtle. She rolls up the bonnet, hits the windscreen, and is thrown into the air."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Tom panics as he sees Gatsby approaching and throws money at Wilson before speeding off after Gatsby and Daisy. Myrtle, watching from an upstairs window, appears desperate and tearful. Gatsby and Tom drive side-by-side along a filthy road past heaps of trash and coal waste, heading across the Queensboro Bridge. Gatsby accelerates, edging ahead, while Daisy waves exuberantly as they pass a train into New York City.\n\nIn a plush suite at the Plaza Hotel, Tom watches an employee chip away at a large block of ice while the others sit around drinking whiskey. The room is hot, with windows wide open and several fans on. Sweat glistens on their faces as Tom presses ice against his neck. Nick and Jordan observe closely as Gatsby nods at Tom and stands across the room. Gatsby sips whiskey and moves to a window, then turns to face Tom, who stands with his back to him. Gatsby takes Daisy's hand, and Tom, silently seething, turns to face Gatsby. Daisy, tearful, shakes her head, unnerving Tom as tears fill her eyes.\n\nGatsby smiles inquiringly, and Tom points at Nick while Gatsby drinks. Gatsby then grabs Tom by the shirt collar, looming over him with a raised fist. Tom rests his forehead against Gatsby's, grinning as if victorious. Daisy and Jordan cover their faces fearfully. Shocked, Gatsby steps away, his chest heaving, and goes to Daisy, who stares at him with tears brimming. As tears flood from her eyes, Tom checks his watch, and Gatsby runs out, knocking over a lamp. Tom shuts the door, causing a phone book to fall, and has a slug of whiskey. Frowning, Nick looks out the window as Tom unwraps another bottle of whiskey. Nick remains at the window, glancing across the Queensboro Bridge.\n\nMeanwhile, Myrtle's forehead is cut as Wilson shakes the poles around her neck. She hits him and runs into the road as the bright yellow Deusenberg thunders through the Valley of Ashes. Seeing the car, Myrtle runs into its path. Gatsby grips the wheel, trying to swerve, but it's too late, and the Deusenberg hits Myrtle, sending her rolling up the bonnet, hitting the windscreen, and being thrown into the air."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Tom sees her as Gatsby, the enigmatic millionaire known for his lavish parties in West Egg, approaches, causing Tom to panic. Tom throws money at Wilson, a poor mechanic struggling with financial difficulties, and speeds off after Gatsby and Daisy, who are now ahead. Watching from the upstairs window of Wilson's garage, Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road known as the Valley of Ashes, a desolate wasteland symbolizing moral and social decay, past heaps of trash and coal waste. They head across the iconic steel structure of the Queensboro Bridge side-by-side. Gatsby, in his distinctive yellow Deusenberg, looks at Tom to his left, puts his foot down, and the coupe edges ahead. Grinning, Daisy waves exuberantly as they pass a train, likely one of the many that connect Long Island to Manhattan, and head into New York City. In a plush suite at the Plaza Hotel, one of New York's most famous hotels known for its luxury and grandeur, Tom watches an employee chip away at a large block of ice with an ice pick, while windows are wide open and several fans are on to combat the sweltering summer heat. The others sit around drinking whiskey, a popular choice among the wealthy elite of the time, and the ice is put on a tray. Sweat glows on their faces, and Tom presses ice against the back of his neck. Nick and Jordan pay close attention to their exchange as frowning, Gatsby nods at Tom and stands across the room from him. Nick, feeling out of place among the drama of the wealthy, glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window. Gatsby turns to face Tom who stands with his back to Gatsby, while Gatsby takes Daisy's hand, a gesture heavy with romantic implication. Silently seething, Tom turns to face Gatsby as Daisy slowly sits and Tom glowers. Daisy is tearful, shakes her head, and Tom looks unnerved as tears fill her eyes and her head droops forward. Gatsby smiles inquiringly, Tom points at Nick, and Gatsby drinks. Gatsby holds Tom by his shirt collar and looms over him with his fist raised. Tom rests his forehead against Gatsby's for a moment, then grins as if he's won some kind of game of social dominance. Daisy holds her hands over her face fearfully, as does Jordan, reflecting the tension in the room. Gatsby looks shocked, and his chest heaving, steps away from Tom. Daisy stares at Gatsby, tears brimming in her eyes, as he goes to her and tears flood from her eyes. Tom looks at his watch as Gatsby runs out, knocking over a lamp, and Tom pushes the door shut, causing the phone book to fall to the floor. He has a slug of whiskey, a sign of his inner turmoil, and frowning heavily, Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window, turns, and Tom glances away while Nick looks out of the window, across the Queensboro Bridge. Myrtle's forehead is cut as Wilson, overwhelmed with grief and confusion, shakes the poles around her neck, and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes, and seeing the car, Myrtle runs into the road. As another car approaches, Gatsby grips the wheel of the Deusenberg to try and swerve, but it's too late, and the Deusenberg hits Myrtle. She rolls up the bonnet, hits the windscreen, and is thrown in the air in a tragic twist of fate."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Tom sees her as Gatsby approaches causing Tom to panic. Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead. Watching from the upstairs window Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside. Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead. Grinning. Daisy waves exuberantly as they pass a train and head into New York City. In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on. The others sit around drinking whiskey and the ice is put on a tray. Sweat glows on their faces and Tom presses ice against the back of his neck. Nick and Jordan pay close attention to their exchange as frowning. Gatsby nods at Tom and stands across the room from him. Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window. Gatsby turns to face Tom who stands with his back to Gatsby while Gatsby takes Daisy's hand. Silently seething. Tom turns to face Gatsby as Daisy slowly sits and Tom glowers. Daisy is tearful shakes her head and Tom looks unnerved as tears fill her eyes and her head droops forward. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Gatsby smiles inquiringly. Tom points at Nick and Gatsby drinks. Gatsby holds Tom by his shirt collar and looms over him with his fist raised. Tom rests his forehead against Gatsby's for a moment then grins as if he is won some kind of game. Daisy holds her hands over her face fearfully as does Jordan. Gatsby looks shocked and his chest heaving steps away from Tom. Daisy stares at Gatsby tears brimming in her eyes as he goes to her and tears flood from her eyes. Tom looks at his watch as Gatsby runs out knocking over a lamp and Tom pushes the door shut causing the phone book to fall to the floor. He has a slug of whiskey and frowning heavily. Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car. Myrtle runs into the road. As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it is too late and the Deusenberg hits Myrtle. She rolls up the bonnet hits the windscreen. and is thrown in the air."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Tom sees her as Gatsby approaches causing Tom to panic. Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead. Watching from the upstairs window Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside. Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead. Grinning. Daisy waves exuberantly as they pass a train and head into New York City. In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on. The others sit around drinking whiskey and the ice is put on a tray. Sweat glows on their faces and Tom presses ice against the back of his neck. Nick and Jordan pay close attention to their exchange as frowning. Gatsby nods at Tom and stands across the room from him. Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window. Gatsby turns to face Tom who stands with his back to Gatsby while Gatsby takes Daisy's hand. Silently seething. Tom turns to face Gatsby as Daisy slowly sits and Tom glowers. Daisy is tearful shakes her head and Tom looks unnerved as tears fill her eyes and her head droops forward. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Gatsby smiles inquiringly. Tom points at Nick and Gatsby drinks. Gatsby holds Tom by his shirt collar and looms over him with his fist raised. Tom rests his forehead against Gatsby's for a moment then grins as if he is won some kind of game. Daisy holds her hands over her face fearfully as does Jordan. Gatsby looks shocked and his chest heaving steps away from Tom. Daisy stares at Gatsby tears brimming in her eyes as he goes to her and tears flood from her eyes. Tom looks at his watch as Gatsby runs out knocking over a lamp and Tom pushes the door shut causing the phone book to fall to the floor. He has a slug of whiskey and frowning heavily. Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car. Myrtle runs into the road. As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it is too late and the Deusenberg hits Myrtle. She rolls up the bonnet hits the windscreen. and is thrown in the air."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Tom sees her as Gatsby approaches causing Tom to panic. Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead. Watching from the upstairs window Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside. Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead. Grinning. Daisy waves exuberantly as they pass a train and head into New York City. In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on. The others sit around drinking whiskey and the ice is put on a tray. Nick goes to look out of a window as Tom unwraps another bottle of whiskey. Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge. Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs. The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car. Myrtle runs into the road. As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it is too late and the Deusenberg hits Myrtle. She rolls up the bonnet hits the windscreen. and is thrown in the air."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Tom sees her as Gatsby approaches causing Tom to panic. Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead. Watching from the upstairs window Myrtle looks desperate and tearful. Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside. As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it is too late and the Deusenberg hits Myrtle. She rolls up the bonnet hits the windscreen. and is thrown in the air."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Larry observes him as Wilbur ambles over, causing Larry to shiver. Larry hurls breadcrumbs at Samuel and leaps away after Wilbur and Becky, who are now lagging. Peering from the attic skylight, Gertrude appears exhilarated and giggly. Wilbur and Larry roll along the grimy avenue past piles of rubble and apple peels, gliding over the Brooklyn Bridge cheek-to-cheek. Wilbur gazes at Larry to his right, stomps the pedal, and the sedan drifts forward. Chuckling, Becky gestures wildly as they speed past a ferry and rush into Chicago. In a cozy parlor at the Ritz-Carlton, Larry observes a gardener nibble away at a massive chunk of cheese with a grater, while doors are tightly shut and multiple lanterns flicker on. The group lounges around sipping cider, and the cheese is placed on a plate. Mist gathers on their foreheads, and Larry presses cheese against the side of his face. Frank and Olivia watch intently as groaning, Wilbur winks at Larry and sits away from him. Frank peeks around nervously while Wilbur takes a gulp of cider and steps to a door. Wilbur spins to confront Larry who stands with his back to Wilbur, while Wilbur grips Becky's foot. Quietly sulking, Larry spins to confront Wilbur as Becky gradually kneels, and Larry scowls. Becky is giggly, waves her arm, and Larry appears frazzled as laughter fills her mouth and her arm droops downward. Wilbur frowns quizzically, Larry gestures at Frank, and Wilbur gulps. Wilbur grabs Larry by his hat brim and lurches over him with his foot lifted. Larry rests his chin against Wilbur's for a moment, then winces as if he's lost some kind of contest. Becky covers her mouth with her arms nervously, as does Olivia. Wilbur appears perplexed, and his legs shaking, shuffles away from Larry. Becky gazes at Wilbur, laughter erupting in her mouth, as he approaches her and giggles stream from her mouth. Larry peeks at his wristwatch as Wilbur strolls out, toppling over a vase, and Larry pulls the curtain shut, causing the almanac to drop to the carpet. He takes a sip of cider, and groaning bitterly, Frank walks to peer through a door as Larry unwraps another carton of cider. Frank stands by the door, turns, and Larry peeks away while Frank peers through the door, over the Brooklyn Bridge. Gertrude's elbow is bruised as Samuel rattles the chains around her feet, and she yanks him and skips. The bright green Volkswagen roars through the Garden of Pebbles, and spotting the vehicle, Gertrude skips into the lane. As another vehicle ambles, Wilbur clutches the handle of the Volkswagen to attempt and steer away, but it's too late, and the Volkswagen nudges Gertrude. She tumbles down the hood, pummels the grill, and is hurled into the breeze."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Tom becomes anxious as Gatsby and Daisy drive ahead, prompting him to chase after them. Myrtle, watching from a window, appears desperate. As Gatsby and Tom speed across a dirty road into New York, Daisy waves exuberantly. In a suite at the Plaza Hotel, tensions rise as Tom, Gatsby, Daisy, Nick, and Jordan share a heated exchange, marked by sweat and whiskey. Gatsby confronts Tom, causing a silent standoff, with Daisy tearful and distressed. Tom's demeanor shifts from seething to a smug grin, unsettling Gatsby and Daisy. After a physical confrontation, Gatsby leaves abruptly. Meanwhile, in the Valley of Ashes, Myrtle desperately runs into the road, only to be accidentally struck by Gatsby's yellow Deusenberg."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She rolls up the bonnet hits the windscreen and is thrown in the air As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it's too late and the Deusenberg hits Myrtle  Myrtle runs into the road  The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car  Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs  Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge  Nick goes to look out of a window as Tom unwraps another bottle of whiskey  He has a slug of whiskey and frowning heavily  Tom looks at his watch as Gatsby runs out knocking over a lamp and Tom pushes the door shut causing the phone book to fall to the floor  Daisy stares at Gatsby tears brimming in her eyes as he goes to her and tears flood from her eyes  Gatsby looks shocked and his chest heaving steps away from Tom  Daisy holds her hands over her face fearfully as does Jordan  Tom rests his forehead against Gatsby's for a moment then grins as if he's won some kind of game  Gatsby holds Tom by his shirt collar and looms over him with his fist raised  Tom points at Nick and Gatsby drinks  Gatsby smiles inquiringly  Daisy is tearful shakes her head and Tom looks unnerved as tears fill her eyes and her head droops forward  Tom turns to face Gatsby as Daisy slowly sits and Tom glowers  Silently seething  Gatsby turns to face Tom who stands with his back to Gatsby while Gatsby takes Daisy's hand  Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window  Gatsby nods at Tom and stands across the room from him  Nick and Jordan pay close attention to their exchange as frowning  Sweat glows on their faces and Tom presses ice against the back of his neck  The others sit around drinking whiskey and the ice is put on a tray  In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on  Daisy waves exuberantly as they pass a train and head into New York City  Grinning  Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead  Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside  Watching from the upstairs window Myrtle looks desperate and tearful  Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead  Tom sees her as Gatsby approaches causing Tom to panic "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead Tom sees her as Gatsby approaches causing Tom to panic Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside Watching from the upstairs window Myrtle looks desperate and tearful Grinning Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on Daisy waves exuberantly as they pass a train and head into New York City Sweat glows on their faces and Tom presses ice against the back of his neck The others sit around drinking whiskey and the ice is put on a tray Gatsby nods at Tom and stands across the room from him Nick and Jordan pay close attention to their exchange as frowning Gatsby turns to face Tom who stands with his back to Gatsby while Gatsby takes Daisy's hand Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window Tom turns to face Gatsby as Daisy slowly sits and Tom glowers Silently seething Gatsby smiles inquiringly Daisy is tearful shakes her head and Tom looks unnerved as tears fill her eyes and her head droops forward Gatsby holds Tom by his shirt collar and looms over him with his fist raised Tom points at Nick and Gatsby drinks Daisy holds her hands over her face fearfully as does Jordan Tom rests his forehead against Gatsby's for a moment then grins as if he is won some kind of game Daisy stares at Gatsby tears brimming in her eyes as he goes to her and tears flood from her eyes Gatsby looks shocked and his chest heaving steps away from Tom He has a slug of whiskey and frowning heavily Tom looks at his watch as Gatsby runs out knocking over a lamp and Tom pushes the door shut causing the phone book to fall to the floor Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge Nick goes to look out of a window as Tom unwraps another bottle of whiskey The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it is too late and the Deusenberg hits Myrtle Myrtle runs into the road and is thrown in the air She rolls up the bonnet hits the windscreen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Gatsby smiles inquiringly  Tom points at Nick and Gatsby drinks  Gatsby holds Tom by his shirt collar and looms over him with his fist raised  Tom rests his forehead against Gatsby's for a moment then grins as if he's won some kind of game  Daisy holds her hands over her face fearfully as does Jordan  Gatsby looks shocked and his chest heaving steps away from Tom  Daisy stares at Gatsby tears brimming in her eyes as he goes to her and tears flood from her eyes  Tom looks at his watch as Gatsby runs out knocking over a lamp and Tom pushes the door shut causing the phone book to fall to the floor  He has a slug of whiskey and frowning heavily  Nick goes to look out of a window as Tom unwraps another bottle of whiskey  Nick remains at the window turns and Tom glances away while Nick looks out of the window across the Queensboro Bridge  Myrtle's forehead is cut as Wilson shakes the poles around her neck and she hits him and runs  The bright yellow Deusenberg thunders through the Valley of Ashes and seeing the car  Myrtle runs into the road  As another car approaches Gatsby grips the wheel of the Deusenberg to try and swerve but it's too late and the Deusenberg hits Myrtle  She rolls up the bonnet hits the windscreen and is thrown in the air Tom sees her as Gatsby approaches causing Tom to panic  Tom throws money at Wilson and speeds off after Gatsby and Daisy who are now ahead  Watching from the upstairs window Myrtle looks desperate and tearful  Gatsby and Tom drive along the filthy road past heaps of trash and coal waste heading across the Queensboro Bridge sidebyside  Gatsby looks at Tom to his left puts his foot down and the coupe edges ahead  Grinning  Daisy waves exuberantly as they pass a train and head into New York City  In a plush suite at the Plaza Hotel Tom watches an employee chip away at a large block of ice with an ice pick while windows are wide open and several fans are on  The others sit around drinking whiskey and the ice is put on a tray  Sweat glows on their faces and Tom presses ice against the back of his neck  Nick and Jordan pay close attention to their exchange as frowning  Gatsby nods at Tom and stands across the room from him  Nick glances about uncomfortably while Gatsby has a sip of whiskey and goes to stand at a window  Gatsby turns to face Tom who stands with his back to Gatsby while Gatsby takes Daisy's hand  Silently seething  Tom turns to face Gatsby as Daisy slowly sits and Tom glowers  Daisy is tearful shakes her head and Tom looks unnerved as tears fill her eyes and her head droops forward "
        }
      ]
    }
  ]
}