{
  "ground_truth": "Nick reacts with a perplexed frown. At the cottage, Nick stands in the shadows, deep in thought. He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked. Kneeling with a rag and bucket, Gatsby looks around. They cover the car. He points at Herzog, who goes back into the house. With an emphatic gesture and a sharp nod, Gatsby opens the door to the house. He stops and glances around. He looks at Nick and points at the sky. With a cautious frown, Nick walks into the house with Gatsby. The sky lightens. They stand on the dock. Gatsby looks out across the bay. At the garage, Wilson throws Myrtle's pills into a drawer, holds up a revolver and stares at it. He looks into the eyes on the Dr. Eckleburg billboard. A golden sun rises. The bay is calm. Gatsby and Nick sit on the terrace. Gatsby steps out into the sunlight. Gatsby and Nick walk down steps and across the ornamental terrace, towards the pool. Gatsby walks between two tall, stone urns and down some more steps. Nick stays at the top. Gatsby turns to Nick. Gatsby smiles. Nick opens a low, metal gate. He stops and turns to Gatsby. They both smile. Nick looks at him thoughtfully. Nick leaves Gatsby resting on the gate. Gatsby looks up at the sky. Nick heads off along the gravel path beneath the terrace, leading through the ornamental garden. He stops and looks up at Gatsby. Gatsby smiles fondly. Nick smiles back. They wave to each other. Nick sits looking sleepy as others work around him. Gatsby stands by the pool. Wearing a swimming costume, Gatsby dives into the round, azure pool. At home, Daisy sits near a telephone, looking pale and distant. Gatsby swims deep into the pool. Shadowed against a wall, Wilson stalks through the grounds, holding his revolver. Daisy walks towards the telephone and lifts the receiver. Gatsby surfaces as his phone rings. A faint, hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He looks across the bay, to the Buchanan mansion. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back. His body flinches. Herzog looks round. Gatsby touches his chest and looks at his finger. Heavy-browed, his deep blue eyes staring wildly, Gatsby looks again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Nick responds with a bewildered scowl. At the cottage, Nick stands in the shadows, deep in contemplation. He gazes across to Gatsby's mansion and observes the yellow Duesenberg arrive. Nick strolls over and discovers Gatsby cleaning Myrtle's blood from the front of the automobile. The right fender is damaged and the windscreen is fractured. Kneeling with a cloth and pail, Gatsby glances around. They conceal the automobile. He indicates Herzog, who returns into the house. With a forceful motion and a brisk nod, Gatsby opens the entry to the house. He pauses and peers around. He gazes at Nick and indicates the sky. With a wary scowl, Nick enters the house with Gatsby. The sky brightens. They stand on the pier. Gatsby gazes out across the bay. At the garage, Wilson tosses Myrtle's medications into a drawer, holds up a pistol and gazes at it. He gazes into the eyes on the Dr. Eckleburg advertisement. A golden sun ascends. The bay is tranquil. Gatsby and Nick sit on the terrace. Gatsby steps out into the daylight. Gatsby and Nick stroll down steps and across the decorative terrace, towards the pool. Gatsby walks between two tall, stone urns and down some more steps. Nick stays at the top. Gatsby turns to Nick. Gatsby grins. Nick opens a low, metal gate. He pauses and turns to Gatsby. They both grin. Nick gazes at him thoughtfully. Nick departs Gatsby resting on the gate. Gatsby gazes up at the sky. Nick heads off along the gravel path underneath the terrace, leading through the decorative garden. He pauses and gazes up at Gatsby. Gatsby grins affectionately. Nick grins back. They wave to each other. Nick sits looking drowsy as others work around him. Gatsby stands by the pool. Wearing a swimming outfit, Gatsby plunges into the round, azure pool. At home, Daisy sits near a telephone, looking pale and remote. Gatsby swims deep into the pool. Shadowed against a wall, Wilson prowls through the grounds, holding his pistol. Daisy walks towards the telephone and lifts the receiver. Gatsby surfaces as his phone rings. A faint, optimistic grin spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He gazes across the bay, to the Buchanan mansion. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back. His body jerks. Herzog glances round. Gatsby touches his chest and gazes at his finger. Heavy-browed, his deep blue eyes staring frantically, Gatsby gazes again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Nick is perplexed by a frown. At the cottage, the shadows are stood in by Nick, deep in thought. Across to Gatsby's mansion, the yellow Duesenberg is seen driving up by him. Over is walked by Nick, and Gatsby is found washing Myrtle's blood off the front of the car by him. He sees that the right fender dents and the windscreen cracks. A rag and bucket are kneeled with by Gatsby, who looks around. The car is covered by them. Herzog, who goes back into the house, is pointed at by him. With an emphatic gesture and a sharp nod, the door to the house is opened by Gatsby. He stops and the surroundings are glanced around by him. Nick is looked at by him, and the sky is pointed at. With a cautious frown, the house is walked into with Gatsby by Nick. The sky is lightened. The dock is stood on by them. Across the bay is looked out by Gatsby. At the garage, Myrtle's pills are thrown into a drawer by Wilson, who holds up a revolver and stares at it. Into the eyes on the Dr. Eckleburg billboard he looks. A golden sun rises. The bay is kept calm. On the terrace, Gatsby and Nick are sat. Into the sunlight steps Gatsby. Down steps and across the ornamental terrace, toward the pool, walk Gatsby and Nick. Between two tall, stone urns and down some more steps walks Gatsby. At the top stays Nick. To Nick, Gatsby turns. A smile is given by Gatsby. A low, metal gate is opened by Nick. To Gatsby, he turns and stops. Smiles are exchanged between them. Thoughtfully, a look is given to him by Nick. On the gate, Gatsby is left resting by Nick. At the sky, looks Gatsby. Along the gravel path beneath the terrace, leading through the ornamental garden, Nick heads off. Gatsby is looked up at by him. Fondly, smiles Gatsby. Smiles back Nick. Waves are exchanged between them. Sleepy-looking, Nick sits as others work around him. By the pool stands Gatsby. Into the round, azure pool, wearing a swimming costume, dives Gatsby. Near a telephone at home sits Daisy, looking pale and distant. Deep into the pool swims Gatsby. Through the grounds, shadowed against a wall, Wilson stalks, holding his revolver. Towards the telephone walks Daisy and the receiver is lifted by her. As his phone rings, Gatsby surfaces. A faint, hopeful smile spreads across his lips as the steps at the side of the pool are climbed by him. Across the bay, to the Buchanan mansion, he looks. The phone is answered by Herzog. On the side of the pool behind Gatsby, Wilson approaches. In the back, Gatsby is shot by Wilson. By his body, a flinch is made. Round looks Herzog. His chest is touched and his finger is looked at by Gatsby. With deep blue eyes staring wildly, his heavy-browed face looks again across the Bay of Consequence to the Buchanan's mansion. Open hangs Gatsby's mouth. His eyes glaze as from him the life drains. Droop his eyelids."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nick frowns in confusion. At the cottage, he stands in shadows, pondering. He sees the yellow Duesenberg at Gatsby's mansion and finds Gatsby cleaning Myrtle's blood from the car. The fender is dented, and the windscreen cracked. Gatsby, kneeling with a rag, looks around. They cover the car. Gatsby gestures to Herzog, who returns inside. With a nod, Gatsby opens the house door, glances around, and points at the sky. Nick, frowning, follows him inside. The sky brightens. They stand on the dock, and Gatsby gazes across the bay. At the garage, Wilson throws Myrtle's pills into a drawer, holds a revolver, and stares at the Dr. Eckleburg billboard. The sun rises over a calm bay. Gatsby and Nick sit on the terrace. Gatsby steps into the sunlight, and they walk down steps toward the pool. Gatsby walks between stone urns, descending further. Nick stays at the top. Gatsby turns and smiles at Nick. Nick opens a gate, stops, and turns to Gatsby. They smile at each other. Nick leaves Gatsby at the gate, heads along the gravel path, and looks back. They wave. Nick sits sleepily as others work. Gatsby stands by the pool, dives in wearing a swimsuit. At home, Daisy sits by a phone, looking pale. Gatsby swims deep. Wilson, shadowed, stalks the grounds with a revolver. Daisy lifts the phone receiver. Gatsby surfaces as his phone rings, smiling hopefully. He climbs pool steps, looking at the Buchanan mansion. Herzog answers the phone. Wilson approaches and shoots Gatsby in the back. Gatsby flinches, touches his chest, and looks at his finger. His eyes, heavy-browed and wild, stare across the bay at the Buchanan mansion. His mouth hangs open, eyes glaze, and life drains from him as his eyelids droop."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nick frowns perplexedly. At the cottage, he stands in shadows, thinking. He sees the yellow Duesenberg at Gatsby's mansion. Nick finds Gatsby washing Myrtle's blood off the car, with a dented fender and cracked windscreen. They cover the car. Gatsby gestures to Herzog, who enters the house. Gatsby nods sharply, opens the door, and glances around. He points at the sky, and Nick follows him inside. The sky lightens as they stand on the dock. Gatsby looks across the bay. At the garage, Wilson throws Myrtle's pills into a drawer, holds a revolver, and stares at the Dr. Eckleburg billboard. A golden sun rises over the calm bay. Gatsby and Nick sit on the terrace, then walk towards the pool. Gatsby walks between stone urns, while Nick stays at the top. They smile at each other. Nick leaves Gatsby at the gate, heads along the garden path, and waves. Nick sits sleepily as others work. Gatsby stands by the pool, dives in, and swims. At home, Daisy looks pale by the phone. Wilson, shadowed, stalks with a revolver. Daisy lifts the receiver. Gatsby surfaces as the phone rings, smiles hopefully, and climbs the pool steps. He looks at the Buchanan mansion. Herzog answers the phone. Wilson shoots Gatsby in the back. Gatsby touches his chest, looks at his finger, and stares across the bay. His mouth hangs open, eyes glaze, and life drains from him. His eyelids droop."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Nick reacts with a perplexed frown, his brow furrowing in confusion. At the quaint cottage, Nick stands quietly in the shadows, lost in deep contemplation. He gazes across the way to Gatsby's grand mansion and observes the yellow Duesenberg as it drives up the long driveway. Nick decides to walk over and discovers Gatsby meticulously washing Myrtle's blood off the front of the luxurious car. The right fender is noticeably dented, and the windscreen is cracked. Kneeling with a rag and a bucket of water, Gatsby looks around cautiously. Together, they cover the car to conceal the damage. Gatsby points at Herzog, who obediently goes back into the house. With an emphatic gesture and a sharp nod, Gatsby opens the door to the house. He pauses momentarily and glances around the area. He looks at Nick and points upward at the sky. With a cautious frown, Nick follows Gatsby into the house. The sky begins to lighten as dawn approaches. They stand together on the dock, and Gatsby looks out pensively across the bay. Meanwhile, at the garage, Wilson throws Myrtle's pills into a drawer, then holds up a revolver and stares intently at it. He looks into the eyes depicted on the Dr. Eckleburg billboard. A golden sun rises, casting a warm glow. The bay is calm and serene. Gatsby and Nick sit together on the terrace, enjoying the peaceful morning. Gatsby steps out into the sunlight, basking in its warmth. Gatsby and Nick walk down the steps and across the ornamental terrace, heading towards the inviting pool. Gatsby walks between two tall, stone urns and descends some more steps. Nick remains at the top, watching. Gatsby turns to Nick and smiles warmly. Nick opens a low, metal gate, then stops and turns back to Gatsby. They both exchange smiles. Nick looks at him thoughtfully, pondering the moment. Nick leaves Gatsby resting on the gate, and Gatsby looks up at the sky, lost in thought. Nick heads off along the gravel path beneath the terrace, leading through the beautifully landscaped ornamental garden. He stops and looks up at Gatsby once more. Gatsby smiles fondly, and Nick smiles back, their connection evident. They wave to each other in a silent farewell. Nick sits looking sleepy as others work diligently around him. Gatsby stands by the pool, wearing a swimming costume, and dives gracefully into the round, azure pool. At home, Daisy sits near a telephone, looking pale and distant, her mind elsewhere. Gatsby swims deep into the pool, enjoying the cool water. Shadowed against a wall, Wilson stalks through the grounds, holding his revolver with determination. Daisy walks towards the telephone and lifts the receiver, her expression tense. Gatsby surfaces as his phone rings, and a faint, hopeful smile spreads across his lips as he climbs up the steps at the side of the pool. He looks across the bay, towards the Buchanan mansion, filled with longing. Herzog answers the phone. Wilson approaches silently on the side of the pool behind Gatsby. Without warning, Wilson shoots Gatsby in the back. Gatsby's body flinches from the impact. Herzog looks around in shock. Gatsby touches his chest and looks at his finger, realizing the gravity of the situation. Heavy-browed, his deep blue eyes staring wildly, Gatsby looks once more across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open in disbelief. His eyes glaze over as the life drains from him, and his eyelids droop, closing for the final time."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Nick finds himself reacting with a perplexed frown, his brow furrowing noticeably as he is overcome by a wave of confusion. Standing in the shadows of the quaint and charming cottage, Nick is enveloped in silence, lost in deep and profound contemplation. His eyes gaze intently across the distance to where Gatsby's grand and opulent mansion stands. With curiosity, he observes the yellow Duesenberg as it makes its way up the long and winding driveway. Motivated by a sense of purpose, Nick decides to walk over, discovering Gatsby in the act of meticulously washing Myrtle's blood from the front of the luxurious and extravagant car. The car's right fender is noticeably dented, and the windscreen is conspicuously cracked. While kneeling with a rag and a bucket of water, Gatsby cautiously looks around the area. Together, they proceed to cover the car in order to conceal the evident damage. Gatsby points at Herzog, who obediently retreats back into the house. With an emphatic gesture and a deliberate nod, Gatsby opens the door to the house and pauses momentarily, glancing around the area with heightened awareness. He looks intently at Nick and points upward towards the vast sky. With a cautious and wary frown, Nick follows Gatsby into the house. The sky begins to lighten gradually as the first rays of dawn approach, illuminating the scene. They stand together on the dock, and Gatsby gazes out pensively across the tranquil and still bay. Meanwhile, at the garage, Wilson throws Myrtle's pills carelessly into a drawer, before holding up a revolver and staring intently at it with determination. His eyes drift upward to the eyes depicted on the Dr. Eckleburg billboard. A golden sun rises, casting a warm and inviting glow. The bay remains calm and serene, adding to the peaceful atmosphere. Gatsby and Nick find solace as they sit together on the terrace, enjoying the tranquility of the peaceful morning. Gatsby steps out into the sunlight, basking contentedly in its warmth. Together, Gatsby and Nick walk down the steps and across the ornamental terrace, making their way toward the inviting pool. Gatsby walks between two tall, stone urns and descends several more steps. Nick remains at the top, watching intently. Gatsby turns to Nick and smiles warmly. Nick opens a low, metal gate, then pauses to turn back to Gatsby. They both exchange smiles filled with understanding. Nick regards him thoughtfully, reflecting on the meaningful moment. Nick leaves Gatsby resting against the gate, while Gatsby looks thoughtfully up at the sky, lost in contemplation. Nick heads off, walking along the gravel path beneath the terrace, which leads through the beautifully landscaped ornamental garden. He pauses and looks up at Gatsby once more. Gatsby smiles fondly, and Nick returns the smile, their mutual connection clearly evident. They wave to each other in a silent and touching farewell. Nick sits looking sleepy as others work diligently around him. Gatsby stands by the pool, clad in a swimming costume, and dives gracefully into the round, azure pool. At home, Daisy sits near a telephone, looking pale and distant, her mind clearly elsewhere. Meanwhile, Gatsby swims deeply into the pool, enjoying the refreshing coolness of the water. Shadowed against a wall, Wilson stalks methodically through the grounds, holding his revolver with grim determination. Daisy walks toward the telephone and lifts the receiver, her expression filled with tension. Gatsby surfaces as his phone rings, and a faint, hopeful smile spreads across his lips as he climbs up the steps at the side of the pool. He looks yearningly across the bay toward the Buchanan mansion, consumed with longing. Herzog answers the phone. Wilson approaches silently from the side of the pool behind Gatsby. Without warning, Wilson shoots Gatsby in the back. Gatsby's body flinches from the sudden impact. Herzog looks around, shocked and disbelieving. Gatsby touches his chest and looks at his finger, realizing the gravity of the situation. His heavy-browed, deep blue eyes stare wildly as he looks once more across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open in abject disbelief. His eyes glaze over as the life slowly drains from him, and his eyelids droop, closing for the final time, sealing the tragic end."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Nick's face contorts into a perplexed frown as he processes the situation. At the cottage, he stands quietly in the shadows, lost in deep thought, his gaze fixed across the way at Gatsby's mansion. He notices the yellow Duesenberg pulling up and decides to walk over, his steps deliberate and purposeful. Upon arrival, he finds Gatsby, who is intently focused on the task of washing Myrtle's blood off the front of the car. The right fender is visibly dented, and the windscreen bears a noticeable crack. Gatsby, kneeling with a rag and bucket in hand, pauses to look around cautiously. Together, they cover the car, ensuring it is concealed. Gatsby then points at Herzog, signaling him to return to the house. With an emphatic gesture and a sharp nod, Gatsby opens the door to the house, pausing momentarily to glance around the surroundings. He locks eyes with Nick and points towards the sky, prompting Nick to follow him inside with a cautious frown. As they enter, the sky begins to lighten, casting a soft glow. They find themselves standing on the dock, where Gatsby gazes out across the bay, lost in thought. Meanwhile, at the garage, Wilson, in a fit of frustration, throws Myrtle's pills into a drawer, retrieves a revolver, and stares at it intently. He then looks up at the eyes on the Dr. Eckleburg billboard, seeking some form of guidance. As a golden sun rises, the bay remains calm and serene. Gatsby and Nick sit together on the terrace, sharing a moment of quiet reflection. Gatsby steps out into the sunlight, and they both walk down the steps and across the ornamental terrace towards the pool. Gatsby continues down between two tall, stone urns and descends further steps, while Nick remains at the top, watching him. Gatsby turns back to Nick and offers a smile, which Nick reciprocates. Nick then opens a low, metal gate, pausing to turn back to Gatsby, and they exchange thoughtful smiles. Nick leaves Gatsby resting on the gate, and as he heads off along the gravel path beneath the terrace, he stops to look up at Gatsby once more. Gatsby smiles fondly, and Nick smiles back, their connection evident. They wave to each other, a silent farewell. Nick sits, looking sleepy, as others work around him, while Gatsby stands by the pool, contemplating. Clad in a swimming costume, Gatsby dives gracefully into the round, azure pool, cutting through the water with ease. At home, Daisy sits near a telephone, her expression pale and distant, lost in her own world. Gatsby swims deeper into the pool, savoring the moment. Meanwhile, shadowed against a wall, Wilson stealthily makes his way through the grounds, clutching his revolver with determination. Daisy approaches the telephone and lifts the receiver, her actions deliberate. As Gatsby surfaces, the phone rings, and a faint, hopeful smile spreads across his lips. He climbs up the steps at the side of the pool, his eyes drawn to the Buchanan mansion across the bay. Herzog answers the phone, unaware of the impending tragedy. Wilson approaches silently from the side of the pool, his intent clear. Without warning, Wilson shoots Gatsby in the back, and Gatsby's body flinches from the impact. Herzog looks around, startled by the sound. Gatsby, in shock, touches his chest and examines his finger, trying to comprehend what has happened. His heavy-browed, deep blue eyes stare wildly across the Bay of Consequence towards the Buchanan mansion, seeking solace. His mouth hangs open, and as his eyes glaze over, the life slowly drains from him. His eyelids droop, marking the end of his journey."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nick reacts with a perplexed frown. At the cottage, he stands in the shadows, contemplating Gatsby's mansion. Observing the yellow Duesenberg arrive, Nick approaches and finds Gatsby cleaning Myrtle's blood from the car, noting the damage. They cover the car, and Gatsby gestures for Herzog to return inside. With a nod, Gatsby leads Nick into the house as the sky lightens. They stand on the dock, where Gatsby gazes across the bay. Meanwhile, at the garage, Wilson discards Myrtle's pills, fixates on a revolver, and stares at the Dr. Eckleburg billboard. As the sun rises, Gatsby and Nick sit on the terrace, then walk toward the pool. Gatsby descends steps between stone urns while Nick remains above. They exchange smiles and thoughtful looks before Nick departs along the garden path, waving back at Gatsby. Nick sits sleepily as others work around him, while Gatsby stands by the pool, dives in, and swims. At home, Daisy sits by the phone, appearing pale and distant. Gatsby surfaces as the phone rings, smiling hopefully as he climbs out of the pool and looks toward the Buchanan mansion. Herzog answers the phone as Wilson approaches and shoots Gatsby in the back. Gatsby reacts, touches his chest, and looks at his finger. With a heavy brow and wild eyes, he gazes across the bay toward the Buchanan mansion as his life fades, his eyes glazing and eyelids drooping."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Nick reacts with a perplexed frown. At the cottage, a quaint, secluded retreat surrounded by lush vegetation, Nick stands in the shadows, deep in thought. He looks across to Gatsby's mansion, a symbol of Jazz Age opulence and extravagance, and sees the yellow Duesenberg, a luxury car known for its speed and style in the 1920s, drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked, evidence of the tragic accident that occurred. Kneeling with a rag and bucket, Gatsby looks around. They cover the car to hide the evidence. He points at Herzog, Gatsby's loyal servant, who goes back into the house. With an emphatic gesture and a sharp nod, Gatsby opens the door to the house. He stops and glances around. He looks at Nick and points at the sky, which is beginning to lighten with the approaching dawn. With a cautious frown, Nick walks into the house with Gatsby. The sky lightens into day. They stand on the dock, overlooking the bay known for its tranquil beauty. Gatsby looks out across the bay. At the garage, Wilson, Myrtle's grief-stricken husband, throws Myrtle's pills into a drawer, holds up a revolver and stares at it. He looks into the eyes on the Dr. Eckleburg billboard, which some see as a symbol of ever-watchful judgment. A golden sun rises, casting a warm glow. The bay is calm, a stark contrast to the turmoil in the characters' lives. Gatsby and Nick sit on the terrace, a place of reflection and conversation. Gatsby steps out into the sunlight. Gatsby and Nick walk down steps and across the ornamental terrace, towards the pool, a luxurious feature of Gatsby's estate. Gatsby walks between two tall, stone urns and down some more steps. Nick stays at the top. Gatsby turns to Nick. Gatsby smiles. Nick opens a low, metal gate. He stops and turns to Gatsby. They both smile. Nick looks at him thoughtfully. Nick leaves Gatsby resting on the gate. Gatsby looks up at the sky, perhaps contemplating his dreams. Nick heads off along the gravel path beneath the terrace, leading through the ornamental garden, designed to impress guests. He stops and looks up at Gatsby. Gatsby smiles fondly. Nick smiles back. They wave to each other. Nick sits looking sleepy as others work around him. Gatsby stands by the pool, a symbol of his wealth and isolation. Wearing a swimming costume typical of the time, Gatsby dives into the round, azure pool. At home, Daisy, torn between love and duty, sits near a telephone, looking pale and distant. Gatsby swims deep into the pool. Shadowed against a wall, Wilson stalks through the grounds, driven by revenge, holding his revolver. Daisy walks towards the telephone and lifts the receiver, caught in a moment of indecision. Gatsby surfaces as his phone rings. A faint, hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He looks across the bay, to the Buchanan mansion, a bastion of old money and privilege. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back, sealing his tragic fate. His body flinches. Herzog looks round. Gatsby touches his chest and looks at his finger, bewildered by the sudden betrayal of his body. Heavy-browed, his deep blue eyes staring wildly, Gatsby looks again across the Bay of Consequence to the Buchanan's mansion, perhaps longing for what he cannot have. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop, marking the end of a dream."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Nick reacts with a perplexed frown. At the cottage Nick stands in the shadows deep in thought. He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked. Kneeling with a rag and bucket Gatsby looks around. They cover the car. He points at Herzog who goes back into the house. With an emphatic gesture and a sharp nod. Gatsby opens the door to the house. He stops and glances around. He looks at Nick and points at the sky. With a cautious frown Nick walks into the house with Gatsby. The sky lightens. They stand on the dock. Gatsby looks out across the bay. At the garage Wilson throws Myrtle's pills into a drawer holds up a revolver and stares at it. He looks into the eyes on the Dr Eckleburg billboard. A golden sun rises. The bay is calm. Gatsby and Nick sit on the terrace. Gatsby steps out into the sunlight. Gatsby and Nick walk down steps and across the ornamental terrace towards the pool. Gatsby walks between two tall stone urns and down some more steps. Nick stays at the top. Gatsby turns to Nick. Gatsby smiles. Nick opens a low metal gate. He stops and turns to Gatsby. They both smile. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Nick looks at him thoughtfully. Nick leaves Gatsby resting on the gate. Gatsby looks up at the sky. Nick heads off along the gravel path beneath the terrace leading through the ornamental garden. He stops and looks up at Gatsby. Gatsby smiles fondly. Nick smiles back. They wave to each other. Nick sits looking sleepy as others work around him. Gatsby stands by the pool. Wearing a swimming costume Gatsby dives into the round azure pool. At home Daisy sits near a telephone looking pale and distant. Gatsby swims deep into the pool. Shadowed against a wall. Wilson stalks through the grounds holding his revolver. Daisy walks towards the telephone and lifts the receiver. Gatsby surfaces as his phone rings. A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He looks across the bay to the Buchanan mansion. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back. His body flinches. Herzog looks round. Gatsby touches his chest and looks at his finger. Heavybrowed his deep blue eyes staring wildly. Gatsby looks again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Nick reacts with a perplexed frown. At the cottage Nick stands in the shadows deep in thought. He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked. Kneeling with a rag and bucket Gatsby looks around. They cover the car. He points at Herzog who goes back into the house. With an emphatic gesture and a sharp nod. Gatsby opens the door to the house. He stops and glances around. He looks at Nick and points at the sky. With a cautious frown Nick walks into the house with Gatsby. The sky lightens. They stand on the dock. Gatsby looks out across the bay. At the garage Wilson throws Myrtle's pills into a drawer holds up a revolver and stares at it. He looks into the eyes on the Dr Eckleburg billboard. A golden sun rises. The bay is calm. Gatsby and Nick sit on the terrace. Gatsby steps out into the sunlight. Gatsby and Nick walk down steps and across the ornamental terrace towards the pool. Gatsby walks between two tall stone urns and down some more steps. Nick stays at the top. Gatsby turns to Nick. Gatsby smiles. Nick opens a low metal gate. He stops and turns to Gatsby. They both smile. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Nick looks at him thoughtfully. Nick leaves Gatsby resting on the gate. Gatsby looks up at the sky. Nick heads off along the gravel path beneath the terrace leading through the ornamental garden. He stops and looks up at Gatsby. Gatsby smiles fondly. Nick smiles back. They wave to each other. Nick sits looking sleepy as others work around him. Gatsby stands by the pool. Wearing a swimming costume Gatsby dives into the round azure pool. At home Daisy sits near a telephone looking pale and distant. Gatsby swims deep into the pool. Shadowed against a wall. Wilson stalks through the grounds holding his revolver. Daisy walks towards the telephone and lifts the receiver. Gatsby surfaces as his phone rings. A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He looks across the bay to the Buchanan mansion. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back. His body flinches. Herzog looks round. Gatsby touches his chest and looks at his finger. Heavybrowed his deep blue eyes staring wildly. Gatsby looks again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Nick reacts with a perplexed frown. At the cottage Nick stands in the shadows deep in thought. He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked. Kneeling with a rag and bucket Gatsby looks around. They cover the car. He points at Herzog who goes back into the house. With an emphatic gesture and a sharp nod. Gatsby opens the door to the house. He stops and glances around. He looks at Nick and points at the sky. With a cautious frown Nick walks into the house with Gatsby. The sky lightens. They stand on the dock. Daisy walks towards the telephone and lifts the receiver. Gatsby surfaces as his phone rings. A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool. He looks across the bay to the Buchanan mansion. Herzog answers the phone. Wilson approaches on the side of the pool behind Gatsby. Wilson shoots Gatsby in the back. His body flinches. Herzog looks round. Gatsby touches his chest and looks at his finger. Heavybrowed his deep blue eyes staring wildly. Gatsby looks again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Nick reacts with a perplexed frown. At the cottage Nick stands in the shadows deep in thought. He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up. Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car. The right fender is dented and the windscreen is cracked. Kneeling with a rag and bucket Gatsby looks around. Gatsby touches his chest and looks at his finger. Heavybrowed his deep blue eyes staring wildly. Gatsby looks again across the Bay of Consequence to the Buchanan's mansion. Gatsby's mouth hangs open. His eyes glaze as the life drains from him. His eyelids droop."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Brenda reacts with a surprised giggle. At the igloo, Brenda lingers in the sunlight, humming a tune. She gazes across to Hector's bungalow and sees the red Blimp hover down. Brenda skips over and finds Hector painting Sylvia's sketch on the back of the scooter. The left mirror is shattered and the bumper is missing. Lying with a brush and paint can, Hector peers around. They wrap the scooter. He gestures at Bentley, who drifts back into the treehouse. With a dramatic flourish and a slow salute, Hector slides the window to the treehouse. He pauses and surveys the scene. He winks at Brenda and gestures at the ground. With a cheerful smirk, Brenda skips into the treehouse with Hector. The ground brightens. They float on the raft. Hector gazes out over the pond. At the barn, Wilbur tosses Sylvia's postcards into a basket, holds up a locket and gazes at it. He squints into the windows on the Dr. Fibonacci zeppelin. A violet moon sets. The pond is still. Hector and Brenda lounge on the hammock. Hector steps into the moonlight. Hector and Brenda glide up stairs and past the decorative fountain, towards the spring. Hector wanders between two tall, oak barrels and up some more stairs. Brenda remains at the bottom. Hector turns to Brenda. Hector chuckles. Brenda unlatches a grand, wooden door. She halts and waves to Hector. They both chuckle. Brenda peers at him inquisitively. Brenda leaves Hector napping on the door. Hector glances up at the ground. Brenda ambles along the pebble lane beneath the fountain, winding through the decorative park. She halts and glances up at Hector. Hector chuckles warmly. Brenda giggles back. They salute one another. Brenda lounges looking alert as others bustle around her. Hector lounges by the spring. Dressed in a diving suit, Hector leaps into the oval, emerald spring. At the barn, Lillian sits next to a typewriter, looking radiant and engaged. Hector swims far into the spring. Cloaked against a tree, Wilbur prowls through the meadows, clutching his locket. Lillian strolls towards the typewriter and taps the keys. Hector emerges as his horn sounds. A broad, confident smile spreads across Hector's features as he strides up the ladder at the edge of the spring. He glances across the pond, to the Fern manor. Bentley taps the tambourine. Wilbur advances on the edge of the spring behind Hector. Wilbur slaps Hector on the back. His spine stiffens. Bentley spins around. Hector taps his shoulder and inspects his palm. Square-jawed, his bright green eyes blinking rapidly, Hector glances once more over the Pond of Tranquility to the Fern's manor. Hector's mouth gapes. His vision clouds as the vitality seeps from him. His eyelids lower."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nick is puzzled as he observes Gatsby at the cottage, washing Myrtle's blood off his damaged car. After they hide the car, Gatsby and Nick enter the house, with Gatsby frequently glancing around. They later stand on the dock, looking across the bay. Meanwhile, Wilson, at the garage, handles Myrtle's pills and stares at a revolver and Dr. Eckleburg's billboard. As the sun rises, Gatsby and Nick sit on the terrace before heading to the pool. Nick stays back as Gatsby dives into the pool. Daisy, distant at home, approaches the phone. Gatsby, swimming, smiles at the phone's ring, hopeful it's Daisy. Herzog answers the call. However, Wilson, stalking Gatsby, shoots him. Gatsby, wounded, gazes at the Buchanan mansion before dying, his eyes glazing over."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His eyelids droop His eyes glaze as the life drains from him  Gatsby's mouth hangs open  Gatsby looks again across the Bay of Consequence to the Buchanan's mansion  Heavybrowed his deep blue eyes staring wildly  Gatsby touches his chest and looks at his finger  Herzog looks round  His body flinches  Wilson shoots Gatsby in the back  Wilson approaches on the side of the pool behind Gatsby  Herzog answers the phone  He looks across the bay to the Buchanan mansion  A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool  Gatsby surfaces as his phone rings  Daisy walks towards the telephone and lifts the receiver  Wilson stalks through the grounds holding his revolver  Shadowed against a wall  Gatsby swims deep into the pool  At home Daisy sits near a telephone looking pale and distant  Wearing a swimming costume Gatsby dives into the round azure pool  Gatsby stands by the pool  Nick sits looking sleepy as others work around him  They wave to each other  Nick smiles back  Gatsby smiles fondly  He stops and looks up at Gatsby  Nick heads off along the gravel path beneath the terrace leading through the ornamental garden  Gatsby looks up at the sky  Nick leaves Gatsby resting on the gate  Nick looks at him thoughtfully  They both smile  He stops and turns to Gatsby  Nick opens a low metal gate  Gatsby smiles  Gatsby turns to Nick  Nick stays at the top  Gatsby walks between two tall stone urns and down some more steps  Gatsby and Nick walk down steps and across the ornamental terrace towards the pool  Gatsby steps out into the sunlight  Gatsby and Nick sit on the terrace  The bay is calm  A golden sun rises  He looks into the eyes on the Dr Eckleburg billboard  At the garage Wilson throws Myrtle's pills into a drawer holds up a revolver and stares at it  Gatsby looks out across the bay  They stand on the dock  The sky lightens  With a cautious frown Nick walks into the house with Gatsby  He looks at Nick and points at the sky  He stops and glances around  Gatsby opens the door to the house  With an emphatic gesture and a sharp nod  He points at Herzog who goes back into the house  They cover the car  Kneeling with a rag and bucket Gatsby looks around  The right fender is dented and the windscreen is cracked  Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car  He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up  At the cottage Nick stands in the shadows deep in thought  Nick reacts with a perplexed frown "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "At the cottage Nick stands in the shadows deep in thought Nick reacts with a perplexed frown Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up Kneeling with a rag and bucket Gatsby looks around The right fender is dented and the windscreen is cracked He points at Herzog who goes back into the house They cover the car Gatsby opens the door to the house With an emphatic gesture and a sharp nod He looks at Nick and points at the sky He stops and glances around The sky lightens With a cautious frown Nick walks into the house with Gatsby Gatsby looks out across the bay They stand on the dock He looks into the eyes on the Dr Eckleburg billboard At the garage Wilson throws Myrtle's pills into a drawer holds up a revolver and stares at it The bay is calm A golden sun rises Gatsby steps out into the sunlight Gatsby and Nick sit on the terrace Gatsby walks between two tall stone urns and down some more steps Gatsby and Nick walk down steps and across the ornamental terrace towards the pool Gatsby turns to Nick Nick stays at the top Nick opens a low metal gate Gatsby smiles They both smile He stops and turns to Gatsby Nick leaves Gatsby resting on the gate Nick looks at him thoughtfully Nick heads off along the gravel path beneath the terrace leading through the ornamental garden Gatsby looks up at the sky Gatsby smiles fondly He stops and looks up at Gatsby They wave to each other Nick smiles back Gatsby stands by the pool Nick sits looking sleepy as others work around him At home Daisy sits near a telephone looking pale and distant Wearing a swimming costume Gatsby dives into the round azure pool Shadowed against a wall Gatsby swims deep into the pool Daisy walks towards the telephone and lifts the receiver Wilson stalks through the grounds holding his revolver A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool Gatsby surfaces as his phone rings Herzog answers the phone He looks across the bay to the Buchanan mansion Wilson shoots Gatsby in the back Wilson approaches on the side of the pool behind Gatsby Herzog looks round His body flinches Heavybrowed his deep blue eyes staring wildly Gatsby touches his chest and looks at his finger Gatsby's mouth hangs open Gatsby looks again across the Bay of Consequence to the Buchanan's mansion His eyelids droop His eyes glaze as the life drains from him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Nick looks at him thoughtfully  Nick leaves Gatsby resting on the gate  Gatsby looks up at the sky  Nick heads off along the gravel path beneath the terrace leading through the ornamental garden  He stops and looks up at Gatsby  Gatsby smiles fondly  Nick smiles back  They wave to each other  Nick sits looking sleepy as others work around him  Gatsby stands by the pool  Wearing a swimming costume Gatsby dives into the round azure pool  At home Daisy sits near a telephone looking pale and distant  Gatsby swims deep into the pool  Shadowed against a wall  Wilson stalks through the grounds holding his revolver  Daisy walks towards the telephone and lifts the receiver  Gatsby surfaces as his phone rings  A faint hopeful smile spreads across Gatsby's lips as he climbs up the steps at the side of the pool  He looks across the bay to the Buchanan mansion  Herzog answers the phone  Wilson approaches on the side of the pool behind Gatsby  Wilson shoots Gatsby in the back  His body flinches  Herzog looks round  Gatsby touches his chest and looks at his finger  Heavybrowed his deep blue eyes staring wildly  Gatsby looks again across the Bay of Consequence to the Buchanan's mansion  Gatsby's mouth hangs open  His eyes glaze as the life drains from him  His eyelids droop Nick reacts with a perplexed frown  At the cottage Nick stands in the shadows deep in thought  He looks across to Gatsby's mansion and sees the yellow Duesenberg drive up  Nick walks over and finds Gatsby washing Myrtle's blood off the front of the car  The right fender is dented and the windscreen is cracked  Kneeling with a rag and bucket Gatsby looks around  They cover the car  He points at Herzog who goes back into the house  With an emphatic gesture and a sharp nod  Gatsby opens the door to the house  He stops and glances around  He looks at Nick and points at the sky  With a cautious frown Nick walks into the house with Gatsby  The sky lightens  They stand on the dock  Gatsby looks out across the bay  At the garage Wilson throws Myrtle's pills into a drawer holds up a revolver and stares at it  He looks into the eyes on the Dr Eckleburg billboard  A golden sun rises  The bay is calm  Gatsby and Nick sit on the terrace  Gatsby steps out into the sunlight  Gatsby and Nick walk down steps and across the ornamental terrace towards the pool  Gatsby walks between two tall stone urns and down some more steps  Nick stays at the top  Gatsby turns to Nick  Gatsby smiles  Nick opens a low metal gate  He stops and turns to Gatsby  They both smile "
        }
      ]
    }
  ]
}