{
  "ground_truth": "The doctor walks over to him as he lays down the open book, and Nick stares at the silver pencil resting on the blank page. In his room, Nick starts to write while men stand on hills of coal waste, hacking away with pickaxes in a filthy industrial area. Nick is on a packed train with Tom when the train stops, and they jump from the train and run off. Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money, pointing at Nick. Myrtle eyes Nick, making him look nervous. Nick sits in Myrtle's apartment in town, watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere. Nick sits on the edge of the couch, glancing at the ceiling, frowning at the sound of Tom and Myrtle upstairs, and tentatively walks to the door. He puts on his straw boater and opens the door to find a sexy, young woman wearing lots of dark eye shadow and a green dress leaning on the door frame as Myrtle appears, weakening Nick, who smiles. Tom picks him up, while Catherine drapes herself around Nick in a chair, pops a pill in her mouth, and plants a kiss on Nick, transferring the pill into his mouth. In a clinch with Myrtle, Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him. Tom dances with Myrtle, and Nick dances with Catherine as Chester takes pictures. Tom opens champagne and whacks Nick with a pillow, causing feathers to go everywhere, while a guy plays trumpet on a fire escape, and Tom picks Nick up and twirls him around. Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone's dancing. Nick sits watching woozily with Catherine slumped against him, and Myrtle wiggles her hips, pulls her red dress off her shoulder, and holds her arms in the air. Nick sits, drugged, as another version of himself pops a champagne cork, shakes the bottle, fizzing the champagne up, and pours some into his wide-open mouth. Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed, drunken eyes, and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge, looking out. He sees himself standing in the street, looking up, and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in, followed by Tom, who gives Myrtle a vicious backhander across the face. Nick retreats onto the fire escape as the city recedes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The physician strides over to him as he sets down the open tome, and Nick gazes at the argent pencil resting on the vacant sheet. In his chamber, Nick begins to scribe while men stand on mounds of coal refuse, chiseling away with pickaxes in a grimy industrial district. Nick is on a crowded train with Tom when the train halts, and they leap from the train and dash off. Tom guides Nick to a garage where she eyes Tom and grins as Tom slips her some currency, indicating Nick. Myrtle regards Nick, making him appear anxious. Nick perches in Myrtle's flat in town, observing her little canine consume remnants off a platter in the exceedingly flashy sitting room with crimson walls and furniture and gaudy floral patterns everywhere. Nick sits on the brink of the sofa, glancing at the ceiling, scowling at the noise of Tom and Myrtle above, and cautiously ambles to the entrance. He dons his straw hat and opens the door to find a sultry, young lady wearing plenty of dark eye shadow and a green frock leaning on the door frame as Myrtle materializes, enfeebling Nick, who beams. Tom lifts him up, while Catherine drapes herself around Nick in a chair, pops a tablet in her mouth, and plants a kiss on Nick, transferring the tablet into his mouth. In an embrace with Myrtle, Tom observes as Catherine guides Nick's goblet to his lips and arches an eyebrow at him. Tom dances with Myrtle, and Nick dances with Catherine as Chester snaps pictures. Tom uncorks champagne and swats Nick with a cushion, causing feathers to scatter everywhere, while a guy plays cornet on a fire escape, and Tom hoists Nick up and spins him around. Catherine kisses Nick and pulls his shirt off as the girls strip down to their undergarments and everyone's dancing. Nick sits watching dizzily with Catherine slumped against him, and Myrtle wiggles her hips, pulls her red gown off her shoulder, and raises her arms in the air. Nick sits, drugged, as another version of himself uncorks a champagne bottle, shakes the bottle, sending the champagne fizzing up, and pours some into his agape mouth. Tom pours champagne into the seated Nick's mouth from a ceramic chalice as Nick sways on the spot with glazed, inebriated eyes, and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge, looking out. He sees himself standing in the street, looking up, and his street self walks off as scenes unfold in windows. Nick discovers Chester dozing and wipes cream off his face as Myrtle parades in, followed by Tom, who gives Myrtle a vicious backhander across the face. Nick withdraws onto the fire escape as the metropolis recedes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The doctor is walked over to by him as the open book is laid down, and the silver pencil resting on the blank page is stared at by Nick. In his room, writing is started by Nick while pickaxes are hacked away with by men standing on hills of coal waste in a filthy industrial area. On a packed train with Tom, Nick is when the train is stopped, and the train is jumped from by them and run off. A garage is led to by Tom with Nick, where Tom is eyed and smiled at by her as some money is slipped to her by Tom, pointing at Nick. Nick is eyed by Myrtle, making him look nervous. In Myrtle's apartment in town, Nick is sitting, watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere. On the edge of the couch, the ceiling is glanced at by Nick, frowning at the sound of Tom and Myrtle upstairs, and the door is tentatively walked to by him. His straw boater is put on, and the door is opened by him to find a sexy, young woman wearing lots of dark eye shadow and a green dress leaning on the door frame as Myrtle appears, weakening Nick, who smiles. He is picked up by Tom, while Nick is draped around by Catherine in a chair, a pill is popped in her mouth, and a kiss is planted on Nick, transferring the pill into his mouth. In a clinch with Myrtle, Tom watches as Nick's glass is guided to his lips by Catherine, and an eyebrow is cocked at him. Myrtle is danced with by Tom, and Catherine is danced with by Nick as pictures are taken by Chester. Champagne is opened by Tom and Nick is whacked with a pillow, causing feathers to go everywhere, while the trumpet is played by a guy on a fire escape, and Nick is picked up and twirled around by Tom. Nick is kissed by Catherine, and his shirt is pulled off as the girls strip down to their underwear and everyone's dancing. Woozily sitting with Catherine slumped against him is Nick, and her hips are wiggled, her red dress is pulled off her shoulder, and her arms are held in the air by Myrtle. Drugged, Nick is sitting as the champagne cork is popped by another version of himself, the bottle is shaken, fizzing the champagne up, and some is poured into his wide-open mouth. Champagne is poured into the seated Nick's mouth from a ceramic goblet by Tom as, with glazed, drunken eyes, on the spot Nick sways, and his exuberant self rolls about on a bed with Catherine. The window is gone to by the woozy Nick, and across at other apartments is looked by him as a young black woman leans on her window ledge, looking out. Himself is seen standing in the street, looking up, and his street self walks off as the scenes are played out in windows. Chester is found sleeping by Nick, and cream is wiped off his face as Myrtle marches in, followed by Tom, who gives Myrtle a vicious backhander across the face. Onto the fire escape, Nick retreats as the city recedes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The doctor approaches as Nick puts down the open book, staring at the silver pencil on a blank page. In his room, he writes as men dig with pickaxes in a grimy industrial area. On a packed train with Tom, they stop, jump off, and run. Tom leads Nick to a garage, slipping money to a woman who nods at Nick. Myrtle's gaze makes Nick anxious. In Myrtle's gaudy apartment, Nick watches her dog eat off a plate while he frowns at noises from upstairs. As he leaves, a young woman in heavy eye shadow and a green dress appears, weakening Nick. Tom picks him up while Catherine wraps around Nick, kisses him, and slips a pill into his mouth. With Myrtle, Tom observes Catherine guiding Nick's glass to his lips. Tom and Nick dance with Myrtle and Catherine, while Chester photographs. Tom pops champagne, hits Nick with a pillow, and a trumpeter plays. Catherine kisses Nick, girls strip to their underwear, and everyone dances. Nick, woozy, sits with Catherine, and Myrtle dances. A drugged Nick sees another version of himself popping a champagne cork. Tom pours champagne into Nick's mouth as his exuberant self rolls with Catherine on a bed. Woozy, Nick watches from a window as scenes unfold. He sees himself on the street, walking away. Discovering Chester asleep, Nick wipes cream from his face. Myrtle enters, followed by Tom, who strikes her. Nick retreats to the fire escape as the city fades."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The doctor approaches Nick, who stares at a silver pencil on a blank page. In his room, Nick writes while men work with pickaxes on coal hills. On a train with Tom, they jump off and enter a garage where Myrtle eyes Nick nervously. At Myrtle's gaudy apartment, Nick watches her dog eat leftovers, frowning at Tom and Myrtle's noises upstairs. He dons his straw boater, opening the door to a young woman in a green dress as Myrtle appears, making Nick smile. Tom picks him up, and Catherine kisses Nick, transferring a pill. Tom watches as Catherine raises Nick's glass, cocks an eyebrow. Tom and Myrtle dance, Nick with Catherine, as Chester takes photos. Tom opens champagne, hits Nick with a pillow, spreading feathers, while a trumpet plays on a fire escape. Catherine undresses Nick as the party dances. Nick, woozy, sits with Catherine slumped against him as Myrtle wiggles her hips and removes her dress strap. Drugged, Nick sees himself pop champagne, pour it into his mouth as Tom does the same from a goblet. Nick sways drunkenly, his exuberant self rolls with Catherine on a bed. Woozy, Nick views other apartments from a window, seeing himself on the street. Finding Chester asleep, Nick wipes cream off him as Tom backhands Myrtle. Nick retreats to the fire escape as the city fades."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The doctor approaches him, making his way over as he sets down the book he had been engrossed in, and Nick finds himself lost in thought, focusing intently on the shiny silver pencil that glimmers as it rests upon the blank, inviting page. In the confines of his room, Nick begins to write, his thoughts flowing onto the paper while men tirelessly toil away on the coal waste hills outside, hacking vigorously with pickaxes, surrounded by the grime and filth characteristic of a bustling industrial area. As the narrative unfolds, Nick finds himself aboard a train that is packed with travelers, accompanied by Tom. Suddenly, when the train comes to a standstill, they seize the moment, jumping from the train and sprinting away with urgency. Tom leads Nick with a sense of purpose to a nearby garage, where a woman casts her eyes in Tom's direction and offers a knowing smile as Tom discreetly slips her some money, indicating toward Nick. Myrtle, with her observant gaze, eyes Nick, causing a flutter of nervousness to wash over him.\n\nNick later finds himself settled within the confines of Myrtle's apartment in town, observing as her small dog eagerly gobbles up leftovers from a plate, in a room that is overwhelmingly decorated with garish opulence, surrounded by red walls and furniture, accentuated with ostentatious flower prints scattered everywhere. Positioned carefully on the edge of the couch, Nick occasionally glances up at the ceiling, expressing a frown in response to the unmistakable sounds of Tom and Myrtle emanating from upstairs, before he makes the tentative decision to stroll towards the door. Donning his straw boater, he proceeds to open the door, only to be greeted by the sight of a young, alluring woman adorned with copious amounts of dark eye shadow and clad in a striking green dress, leaning suggestively against the door frame. At this very moment, Myrtle makes her appearance, rendering Nick momentarily weak, yet prompting a smile to grace his features.\n\nAs the gathering progresses, Tom helps Nick up, while Catherine, with a flourish, drapes herself around Nick in a nearby chair, mischievously popping a pill into her mouth and transferring it unexpectedly with a quick kiss into Nick's mouth. Meanwhile, entwined with Myrtle, Tom watches with amusement as Catherine gently guides Nick's glass to his lips, offering a quizzical raise of an eyebrow in his direction. The evening unfolds with Tom sharing a dance with Myrtle, while Nick finds himself dancing along with Catherine, as Chester busily captures the moment with pictures. In a burst of celebration, Tom uncorks a bottle of champagne, playfully whacking Nick with a pillow, setting feathers afloat in the air, while a nearby guy, positioned on a fire escape, contributes lively trumpet melodies. Amidst the merriment, Tom picks up Nick, twirling him around with exuberance.\n\nAs the festivities continue, Catherine leans in for another kiss with Nick, skillfully tugging his shirt off, just as the girls begin to strip down to their underwear, joining in on the dancing excitement. Amidst the dizzying scene, Nick finds himself seated, watching with a woozy gaze, as Catherine slumps comfortably against him, while Myrtle, in a display of sheer allure, wiggles her hips, teasingly pulls her red dress off her shoulder, and raises her arms high, basking in the revelry. Nick remains seated, enveloped in a drugged haze, while another version of himself imaginatively pops a champagne cork, eagerly shaking the bottle, letting the champagne fizz forth, and pouring it triumphantly into his eagerly open mouth.\n\nTom, in the spirit of indulgence, pours champagne into the seated Nick's mouth using a somewhat grandiose ceramic goblet, as Nick sways unsteadily on the spot, his eyes glazed over with drunken stupor, while his spirited twin rolls about on a bed with Catherine, lost in revelry. In his woozy state, Nick makes his way to a window, gazing out across the expanse of other apartments, catching sight of a young black woman leaning on her window ledge, her gaze directed outward. Observing the scene beyond, he perceives another version of himself standing there in the street, looking upwards, witnessing his street-self as it walks off, with scenes unfolding in various windows. Nick then discovers Chester fast asleep, taking a moment to wipe away some cream from his face, as Myrtle makes a dramatic entrance, trailed closely by Tom, who, in a moment of aggression, delivers a vicious backhand to Myrtle's face. In response, Nick retreats to the relative safety of the fire escape, watching as the sprawling cityscape gradually recedes into the distance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The doctor moves toward him, approaching steadily as he places down the book he had been deeply engrossed in, and Nick finds himself drifting into contemplation, his mind fixated on the gleaming silver pencil that catches the light as it rests on the blank, inviting page in front of him. Within the confines of the room where he is situated, Nick begins to write, his thoughts elegantly transferring onto the paper, while outside, men labor relentlessly on the coal waste hills, hacking away with vigor using pickaxes, encompassed by the grime and filth that are characteristic of the bustling industrial area. As the narrative begins to unfold, Nick finds himself traveling aboard a train brimming with passengers, accompanied by Tom. When the train makes an abrupt halt, they seize the opportunity without hesitation, leaping off the train and hurriedly sprinting away with a sense of urgency. Tom, leading with purpose, guides Nick toward a nearby garage, where a woman looks in Tom's direction and offers a knowing smile as Tom discreetly hands her some money, subtly gesturing toward Nick. Myrtle, with her keen eyes, studies Nick, causing a wave of nervousness to ripple through him.\n\nLater on, Nick finds himself settled comfortably within the confines of Myrtle's apartment located in town, noticing as her small dog eagerly devours leftovers from a plate, in a room that is overwhelmingly draped in garish opulence, surrounded by red walls and furniture adorned with ostentatious flower prints scattered throughout. Positioned carefully on the edge of the couch, Nick occasionally directs his gaze upwards toward the ceiling, expressing a frown in response to the unmistakable noises emanating from Tom and Myrtle upstairs, before he makes the tentative decision to casually stroll towards the door. With his straw boater securely on his head, he proceeds to open the door, only to be met with the sight of a young, alluring woman, extravagantly adorned with dark eye shadow and clad in a striking green dress, leaning suggestively against the door frame. At that very moment, Myrtle makes her appearance, causing Nick to feel momentarily weak yet prompting a smile to grace his features nonetheless.\n\nAs the gathering progresses further, Tom assists Nick to his feet, while Catherine, with a flourish, drapes herself around Nick in a nearby chair, mischievously popping a pill into her mouth and transferring it unexpectedly with a quick kiss onto Nick's lips. Meanwhile, entangled with Myrtle, Tom watches with amusement as Catherine gently guides Nick's glass to his lips, offering a quizzical raise of an eyebrow in his direction. The evening continues with Tom sharing a lively dance with Myrtle, while Nick finds himself dancing alongside Catherine, as Chester busily captures the unfolding moment with pictures. In a burst of celebration, Tom uncorks a bottle of champagne, playfully whacking Nick with a pillow, setting feathers afloat in the air, while a nearby guy, positioned on a fire escape, contributes lively trumpet melodies. Amidst all the merriment, Tom picks up Nick, twirling him around exuberantly.\n\nAs the festivities continue without pause, Catherine leans in for another kiss with Nick, skillfully tugging his shirt off, just as the girls begin to strip down to their underwear, joining in the dancing excitement. Amidst the dizzying scene, Nick finds himself seated, watching with a woozy gaze as Catherine slumps comfortably against him, while Myrtle, in a display of sheer allure, wiggles her hips, teasingly pulling her red dress off her shoulder, and raises her arms high, basking in the revelry. Nick remains seated, enveloped in a drugged haze, while another version of himself imaginatively pops a champagne cork, eagerly shaking the bottle, letting the champagne fizz forth, and pouring it triumphantly into his eagerly open mouth.\n\nTom, indulging in the spirit of the moment, pours champagne into the seated Nick's mouth using a somewhat grandiose ceramic goblet, as Nick sways unsteadily on the spot, his eyes glazed over with drunken stupor, while his spirited twin rolls about on a bed with Catherine, lost in revelry. In his woozy state, Nick makes his way to a window, gazing out across the expanse of other apartments and catching sight of a young black woman leaning on her window ledge, her gaze directed outward. Observing the scene beyond, he perceives another version of himself standing there on the street, looking upwards, witnessing his street-self as it walks off, with scenes unfolding in various windows. Nick then discovers Chester fast asleep, taking a moment to wipe away some cream from his face, as Myrtle makes a dramatic entrance, trailed closely by Tom, who, in a moment of aggression, delivers a vicious backhand to Myrtle's face. In response, Nick retreats to the relative safety of the fire escape, watching as the sprawling cityscape gradually recedes into the distance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The doctor approaches Nick just as he lays down the open book, and Nick's gaze becomes fixed on the silver pencil resting upon the blank page in front of him. Relocating to his room, Nick begins to write, immersing himself in his thoughts, while simultaneously, a group of men can be seen standing atop hills of coal waste, vigorously hacking away with pickaxes in a grimy industrial area. Transitioning to a crowded train ride, Nick finds himself holding on amidst the tight quarters with Tom, and as the train grinds to a halt, the pair swiftly jumps off the train and sprints away from the scene. Tom leads Nick with purposeful strides to a garage, where a woman fixes her eyes on Tom, her lips curling into a smile as Tom discreetly slips her some money, subtly gesturing towards Nick in the process. Myrtle, the woman, casts a meaningful glance at Nick, heightening his nervousness. Seated in Myrtle's apartment within the city, Nick observes a small dog hungrily devouring leftovers from a plate amidst the apartment's excessively decorative living room, which boasts red walls and an abundance of chintzy flower prints. As he sits precariously on the edge of the couch, Nick steals a glance at the ceiling, frowning slightly at the audible commotion of Tom and Myrtle upstairs, prompting him to tentatively rise and walk towards the door. He carefully places his straw boater on his head and gently opens the door, where he encounters a sultry young woman adorned with heavy dark eye shadow and clad in a green dress, leaning casually against the door frame as Myrtle reappears, momentarily destabilizing Nick, who allows a smile to cross his face. Tom enters and sweeps Nick up while Catherine, with a languid grace, drapes herself around Nick seated in a chair, slips a pill into her mouth, and, through a daring gesture, kisses Nick, transferring the pill into his mouth. As Tom engages in a clinch with Myrtle, he casts a watchful eye as Catherine skillfully guides Nick's glass to his lips, her eyebrow arched in a playful challenge. Tom, intoxicated by the moment, dances with Myrtle while Nick finds himself in Catherine's arms as Chester captures the lively scene with his camera. Tom exuberantly opens a bottle of champagne and, in a moment of boisterous playfulness, whacks Nick with a pillow, causing feathers to burst into the air while a man on a fire escape complements the chaos with the sound of his trumpet, and Tom lifts Nick off his feet, spinning him around in circles. Catherine, stepping up the intensity, kisses Nick and tugs at his shirt, pulling it off as the girls, absorbed in the fervor, strip down to their underwear, all the while dancing with unrestrained energy. Nick, feeling the weight of intoxication, watches in a daze with Catherine slouched against him, as Myrtle provocatively wiggles her hips, adjusts her red dress off her shoulder, and raises her arms with abandon. In a surreal moment, a drugged Nick observes another version of himself energetically popping a champagne cork, shaking the bottle until the champagne bursts out, and pouring it directly into his ecstatic open mouth. Tom, adding to the decadent atmosphere, pours champagne from a ceramic goblet into Nick's mouth, who sways unsteadily on the spot, his eyes glazed with drunkenness, while his more vibrant self rolls playfully on a bed with Catherine. The woozy Nick meanders over to a window, and he peers out across the urban landscape to other apartments, where he discerns a young black woman resting on her window ledge, gazing outward. He imagines himself standing in the street, looking upwards, and then, like a phantom, his street self casually walks away as various dramas unfold within the windows. Nick eventually stumbles upon Chester asleep, gently wiping cream off Chester's face just as Myrtle storms into the room, followed closely by Tom, who delivers a brutal backhanded slap to Myrtle's face. Overwhelmed, Nick retreats to the relative safety of the fire escape, where he finds solace in watching the sprawling city slowly vanish into the distance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The doctor approaches Nick, who sets aside his open book and stares at the silver pencil on the blank page. In his room, Nick begins writing amidst a scene of men working in a grim industrial setting. Later, Nick and Tom are on a crowded train and leap off when it stops, running to a garage where Tom discreetly gives money to Myrtle, who responds with a knowing smile while eyeing Nick, making him uneasy. At Myrtle's gaudily adorned apartment, Nick observes a small dog eating leftovers and listens to noises from upstairs, prompting him to tentatively approach the door. Donning his straw boater, he encounters a young woman in the doorway just as Myrtle arrives, which makes him smile nervously. Tom picks him up as Catherine, draped over Nick, shares a pill through a kiss. As Tom watches, Catherine guides Nick to drink as the party unfolds. Tom dances with Myrtle while Nick is with Catherine, as Chester captures the moment. Amidst the chaos, Tom hurls a pillow at Nick, scattering feathers while a trumpet plays on the fire escape; he then lifts and twirls Nick around during the celebration. Catherine strips Nick's shirt off as the women undress and everyone dances. A woozy Nick sits with Catherine against him, watching Myrtle dance provocatively, and another version of him jubilantly opens and drinks champagne. Tom pours champagne into Nick's mouth as he sways drunkenly, and his lively alter ego frolics with Catherine. The inebriated Nick looks out the window at other apartments, where he sees a young woman leaning out. He also sees himself in the street below, walking away as various scenes unfold around him. Discovering Chester asleep, Nick wipes cream from his face just before a furious Myrtle enters, followed by Tom, who hits her violently. Overwhelmed, Nick retreats to the fire escape as the city fades in the distance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The doctor walks over to him as he lays down the open book, and Nick stares at the silver pencil resting on the blank page, a symbol of unexpressed thoughts. In his room, Nick starts to write while men stand on hills of coal waste, remnants of the mining industry that transformed the landscape, hacking away with pickaxes in a filthy industrial area. Nick is on a packed train with Tom when the train stops, a common occurrence on congested routes, and they jump from the train and run off. Tom leads Nick to a garage in a rundown neighborhood where she eyes Tom and smiles as Tom slips her some money, a bribe to keep quiet, pointing at Nick. Myrtle eyes Nick, making him look nervous, aware of her reputation for drama. Nick sits in Myrtle's apartment in town, located in a lively urban district, watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere. Nick sits on the edge of the couch, glancing at the ceiling, frowning at the sound of Tom and Myrtle upstairs, a frequent occurrence in their tumultuous relationship, and tentatively walks to the door. He puts on his straw boater, a popular hat in the 1920s, and opens the door to find a sexy, young woman wearing lots of dark eye shadow and a green dress leaning on the door frame as Myrtle appears, weakening Nick, who smiles. Tom picks him up, while Catherine drapes herself around Nick in a chair, manifesting the bold social behavior of the Roaring Twenties, pops a pill in her mouth, and plants a kiss on Nick, transferring the pill into his mouth. In a clinch with Myrtle, Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him. Tom dances with Myrtle, and Nick dances with Catherine as Chester, a local socialite and amateur photographer, takes pictures. Tom opens champagne, the beverage of celebration, and whacks Nick with a pillow, causing feathers to go everywhere, while a guy plays trumpet on a fire escape, adding to the lively atmosphere, and Tom picks Nick up and twirls him around. Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone's dancing. Nick sits watching woozily with Catherine slumped against him, and Myrtle wiggles her hips, a flirtatious gesture, pulls her red dress off her shoulder, and holds her arms in the air. Nick sits, drugged, as another version of himself pops a champagne cork, shakes the bottle, fizzing the champagne up, and pours some into his wide-open mouth. Tom pours champagne into the seated Nick's mouth from a ceramic goblet, an item reminiscent of ancient drinking customs, as Nick sways on the spot with glazed, drunken eyes, and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments, observing the lives of his neighbors, as a young black woman leans on her window ledge, looking out. He sees himself standing in the street, looking up, and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in, followed by Tom, who gives Myrtle a vicious backhander across the face, a shocking act of domestic violence. Nick retreats onto the fire escape as the city recedes, an escape from the chaos inside."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page. In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area. Nick is on a packed train with Tom when the train stops and they jump from the train and run off. Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick. Myrtle eyes Nick making him look nervous. Nick sits in Myrtle's apartment in town watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere. Nick sits on the edge of the couch glancing at the ceiling frowning at the sound of Tom and Myrtle upstairs and tentatively walks to the door. He puts on his straw boater and opens the door to find a sexy young woman wearing lots of dark eye shadow and a green dress leaning on the door frame. as Myrtle appears weakening Nick who smiles. Tom picks him up while Catherine drapes herself around Nick in a chair pops a pill in her mouth and plants a kiss on Nick transferring the pill into his mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a clinch with Myrtle Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him. Tom dances with Myrtle and Nick dances with Catherine as Chester takes pictures. Tom opens champagne and whacks Nick with a pillow causing feathers to go everywhere while a guy plays trumpet on a fire escape and Tom picks Nick up and twirls him around. Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone is dancing. Nick sits watching woozily with Catherine slumped against him and Myrtle wiggles her hips pulls her red dress off her shoulder and holds her arms in the air. Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth. Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out. He sees himself standing in the street looking up and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face. Nick retreats onto the fire escape as the city recedes."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page. In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area. Nick is on a packed train with Tom when the train stops and they jump from the train and run off. Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick. Myrtle eyes Nick making him look nervous. Nick sits in Myrtle's apartment in town watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere. Nick sits on the edge of the couch glancing at the ceiling frowning at the sound of Tom and Myrtle upstairs and tentatively walks to the door. He puts on his straw boater and opens the door to find a sexy young woman wearing lots of dark eye shadow and a green dress leaning on the door frame. as Myrtle appears weakening Nick who smiles. Tom picks him up while Catherine drapes herself around Nick in a chair pops a pill in her mouth and plants a kiss on Nick transferring the pill into his mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. In a clinch with Myrtle Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him. Tom dances with Myrtle and Nick dances with Catherine as Chester takes pictures. Tom opens champagne and whacks Nick with a pillow causing feathers to go everywhere while a guy plays trumpet on a fire escape and Tom picks Nick up and twirls him around. Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone is dancing. Nick sits watching woozily with Catherine slumped against him and Myrtle wiggles her hips pulls her red dress off her shoulder and holds her arms in the air. Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth. Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out. He sees himself standing in the street looking up and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face. Nick retreats onto the fire escape as the city recedes."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page. In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area. Nick is on a packed train with Tom when the train stops and they jump from the train and run off. Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick. Myrtle eyes Nick making him look nervous. Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth. Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine. The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out. He sees himself standing in the street looking up and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face. Nick retreats onto the fire escape as the city recedes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page. In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area. He sees himself standing in the street looking up and his street self walks off as scenes play out in windows. Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face. Nick retreats onto the fire escape as the city recedes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The astronaut drifts over to the fish as it juggles the closed suitcase, and Lisa gazes at the golden flute nestled on the crowded table. In her tent, Lisa begins to sketch while cats frolic on mounds of cotton candy, slicing away with razors in a pristine agricultural region. Lisa is on a deserted highway with Jerry when the car halts, and they leap from the vehicle and dash away. Jerry guides Lisa to a bakery where he glances at Jerry and grins as Jerry hands him some tickets, gesturing at Lisa. Daisy glances at Lisa, making her feel uneasy. Lisa lounges in Daisy's caravan in the meadow, observing her tiny rabbit nibble scraps off a saucer in the wildly elegant dining area with blue drapes and furniture and ornate bird designs all over. Lisa perches on the arm of the bean bag, peering at the floor, grimacing at the echo of Jerry and Daisy in the attic, and hesitantly strolls to the window. It slides on its woolen cap and unlatches the window to find a charming, old gentleman sporting lots of bright lipstick and a yellow suit leaning on the railing as Daisy arrives, mesmerizing Lisa, who chuckles. Jerry lifts it up, while Pat twines herself around Lisa in a hammock, offers a cookie in her hand, and plants a hug on Lisa, transferring the cookie into her grasp. In a hug with Daisy, Jerry observes as Pat steers Lisa's spoon to her lips and winks at her. Jerry bakes with Daisy, and Lisa sings with Pat as Taylor sketches portraits. Jerry brews tea and tickles Lisa with a brush, scattering petals everywhere, while a woman plays violin on a rooftop, and Jerry nudges Lisa up and spins it around. Pat pecks Lisa and removes its scarf as the boys dress up in their costumes and everyone's clapping. Lisa sits observing dizzily with Pat drooped against it, and Daisy shakes her shoulders, peels her yellow coat from her elbow, and elevates her hands in a cheer. Lisa sits, entranced, as another version of itself bounces a rubber ball, shuffles the cards, fanning them out, and deals some into its outstretched arms. Jerry dribbles juice into the reclining Lisa's lap from a crystal chalice as Lisa sways on the steps with bright, dreamy eyes, and its joyful twin flips about on a trampoline with Pat. The drowsy Lisa wanders to a doorway and peers across at other rooftops as an elderly white man leans on his bannister, surveying the horizon. It notices itself lounging in a garden, gazing ahead, and its garden self strolls on as images unfold in frames. Lisa discovers Taylor snoring and flicks chocolate off her shoes as Daisy waltzes in, followed by Jerry, who offers Daisy a gentle pat on the shoulder. Lisa sneaks onto the rooftop as the mountains approach."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The doctor approaches Nick, who is absorbed in writing as men toil in a grim industrial area. On a packed train with Tom, they disembark and head to a garage, where Myrtle eyes Nick nervously. At Myrtle's gaudy apartment, Nick observes the scene tensely as Tom and Myrtle retreat upstairs. A young woman in a green dress and heavy eye shadow appears, weakening Nick, who smiles. The atmosphere becomes chaotic with dancing, champagne, and a pill exchanged via a kiss. Tom and Myrtle dance while Nick is drawn into the revelry with Catherine, captured in photos by Chester. Amidst playful antics, Nick becomes increasingly inebriated as Tom and Catherine encourage him. Nick, now woozy, watches Myrtle dance provocatively and envisions a more exuberant self. He gazes out a window at other apartments, reflecting on his street self. Finally, he finds Chester asleep, wipes cream off his face, and witnesses Tom hitting Myrtle. Disturbed, Nick retreats to the fire escape as the city's chaos fades."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nick retreats onto the fire escape as the city recedes Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face He sees himself standing in the street looking up and his street self walks off as scenes play out in windows The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth Nick sits watching woozily with Catherine slumped against him and Myrtle wiggles her hips pulls her red dress off her shoulder and holds her arms in the air Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone is dancing Tom opens champagne and whacks Nick with a pillow causing feathers to go everywhere while a guy plays trumpet on a fire escape and Tom picks Nick up and twirls him around Tom dances with Myrtle and Nick dances with Catherine as Chester takes pictures In a clinch with Myrtle Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him Tom picks him up while Catherine drapes herself around Nick in a chair pops a pill in her mouth and plants a kiss on Nick transferring the pill into his mouth as Myrtle appears weakening Nick who smiles He puts on his straw boater and opens the door to find a sexy young woman wearing lots of dark eye shadow and a green dress leaning on the door frame Nick sits on the edge of the couch glancing at the ceiling frowning at the sound of Tom and Myrtle upstairs and tentatively walks to the door Nick sits in Myrtle's apartment in town watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere Myrtle eyes Nick making him look nervous Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick Nick is on a packed train with Tom when the train stops and they jump from the train and run off In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick Nick is on a packed train with Tom when the train stops and they jump from the train and run off Nick sits in Myrtle's apartment in town watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere Myrtle eyes Nick making him look nervous He puts on his straw boater and opens the door to find a sexy young woman wearing lots of dark eye shadow and a green dress leaning on the door frame Nick sits on the edge of the couch glancing at the ceiling frowning at the sound of Tom and Myrtle upstairs and tentatively walks to the door Tom picks him up while Catherine drapes herself around Nick in a chair pops a pill in her mouth and plants a kiss on Nick transferring the pill into his mouth as Myrtle appears weakening Nick who smiles Tom dances with Myrtle and Nick dances with Catherine as Chester takes pictures In a clinch with Myrtle Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone is dancing Tom opens champagne and whacks Nick with a pillow causing feathers to go everywhere while a guy plays trumpet on a fire escape and Tom picks Nick up and twirls him around Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth Nick sits watching woozily with Catherine slumped against him and Myrtle wiggles her hips pulls her red dress off her shoulder and holds her arms in the air The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face He sees himself standing in the street looking up and his street self walks off as scenes play out in windows Nick retreats onto the fire escape as the city recedes"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Tom dances with Myrtle and Nick dances with Catherine as Chester takes pictures Tom opens champagne and whacks Nick with a pillow causing feathers to go everywhere while a guy plays trumpet on a fire escape and Tom picks Nick up and twirls him around Catherine kisses Nick and pulls his shirt off as the girls strip down to their underwear and everyone is dancing Nick sits watching woozily with Catherine slumped against him and Myrtle wiggles her hips pulls her red dress off her shoulder and holds her arms in the air Nick sits drugged as another version of himself pops a champagne cork shakes the bottle fizzing the champagne up and pours some into his wideopen mouth Tom pours champagne into the seated Nick's mouth from a ceramic goblet as Nick sways on the spot with glazed drunken eyes and his exuberant self rolls about on a bed with Catherine The woozy Nick goes to a window and looks across at other apartments as a young black woman leans on her window ledge looking out He sees himself standing in the street looking up and his street self walks off as scenes play out in windows Nick finds Chester sleeping and wipes cream off his face as Myrtle marches in followed by Tom who gives Myrtle a vicious backhander across the face Nick retreats onto the fire escape as the city recedes The doctor walks over to him as he lays down the open book and Nick stares at the silver pencil resting on the blank page In his room Nick starts to write while men stand on hills of coal waste hacking away with pickaxes in a filthy industrial area Nick is on a packed train with Tom when the train stops and they jump from the train and run off Tom leads Nick to a garage where she eyes Tom and smiles as Tom slips her some money pointing at Nick Myrtle eyes Nick making him look nervous Nick sits in Myrtle's apartment in town watching her little dog eat leftovers off a plate in the extremely gaudy living room with red walls and furnishings and chintzy flower prints everywhere Nick sits on the edge of the couch glancing at the ceiling frowning at the sound of Tom and Myrtle upstairs and tentatively walks to the door He puts on his straw boater and opens the door to find a sexy young woman wearing lots of dark eye shadow and a green dress leaning on the door frame as Myrtle appears weakening Nick who smiles Tom picks him up while Catherine drapes herself around Nick in a chair pops a pill in her mouth and plants a kiss on Nick transferring the pill into his mouth In a clinch with Myrtle Tom watches as Catherine guides Nick's glass to his lips and cocks an eyebrow at him"
        }
      ]
    }
  ]
}