{
  "ground_truth": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
  "iterations": {
    "1": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "2": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "3": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "4": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "5": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "6": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "7": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "8": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "9": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "10": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled."
  }
}