{
  "ground_truth": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
  "iterations": {
    "1": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "2": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "3": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "4": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "5": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "6": "One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "7": "Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "8": "Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells.",
    "9": "Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin.",
    "10": "Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower."
  }
}