{
  "ground_truth": "He picks up something silky and holds it out, smiling apologetically. He passes water to the men on the truck's roof. Holding his dog, he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. The hunters lounge happily on top of the truck, which heads out across the flat, sandy desert. They drive along the top of a weir, across a wide river. At night, they camp around a fire. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
  "iterations": {
    "1": "He passes water to the men on the truck's roof. Holding his dog, he looks at Sarah. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. The hunters lounge happily on top of the truck, which heads out across the flat, sandy desert. They drive along the top of a weir, across a wide river. At night, they camp around a fire. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
    "2": "He passes water to the men on the truck's roof. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. The hunters lounge happily on top of the truck, which heads out across the flat, sandy desert. They drive along the top of a weir, across a wide river. At night, they camp around a fire. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
    "3": "He passes water to the men on the truck's roof. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river. At night, they camp around a fire. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
    "4": "He passes water to the men on the truck's roof. She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
    "5": "She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river. Drover is washing his muscled torso, using water from a bucket. Sarah pops her head out of her tent, staring as the water pours off his rippling muscles. They mime keeping each other warm, and she ducks back into her tent.",
    "6": "She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river. Drover is washing his muscled torso, using water from a bucket. They mime keeping each other warm, and she ducks back into her tent.",
    "7": "She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river. Drover is washing his muscled torso, using water from a bucket.",
    "8": "She looks out of the passenger window. A kangaroo paw and a dribble of blood run down the windscreen. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river.",
    "9": "She looks out of the passenger window. She peers in horror through her desert glasses, her net veil blowing in the breeze. They drive along the top of a weir, across a wide river.",
    "10": "She looks out of the passenger window. She peers in horror through her desert glasses, her net veil blowing in the breeze."
  }
}