{
  "ground_truth": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
  "iterations": {
    "1": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "2": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "3": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "4": "Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "5": "Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "6": "Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "7": "Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica.",
    "8": "He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica.",
    "9": "He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close.",
    "10": "King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close."
  }
}