{
  "ground_truth": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
  "iterations": {
    "1": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "2": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "3": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. Neighbors watch. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "4": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "5": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "6": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The lights of a police car flash in the darkness.",
    "7": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The lights of a police car flash in the darkness.",
    "8": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. The lights of a police car flash in the darkness.",
    "9": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground.",
    "10": "He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground."
  }
}