{
  "ground_truth": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
  "iterations": {
    "1": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
    "2": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
    "3": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
    "4": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
    "5": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him.",
    "6": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him.",
    "7": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him.",
    "8": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him.",
    "9": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him.",
    "10": "Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him."
  }
}