{
  "ground_truth": "A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house.",
  "iterations": {
    "1": "A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag.",
    "2": "A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag.",
    "3": "A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag.",
    "4": "A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag.",
    "5": "A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag.",
    "6": "A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A disheveled old man lights the gas and puts on a kettle.",
    "7": "A heap of skulls and bones is piled high behind iron railings. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A disheveled old man lights the gas and puts on a kettle.",
    "8": "A heap of skulls and bones is piled high behind iron railings. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A disheveled old man lights the gas and puts on a kettle.",
    "9": "A heap of skulls and bones is piled high behind iron railings. Metallic silver letters appear in the dark, glowering sky. A disheveled old man lights the gas and puts on a kettle.",
    "10": "A heap of skulls and bones is piled high behind iron railings. Metallic silver letters appear in the dark, glowering sky."
  }
}