{
  "ground_truth": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Harry grabs Quirrell's hand, which surprises him, causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared. Puzzled, Harry stares at his hands again, then looks around for the philosopher's stone, seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up, looks at it for a moment, smiles with relief, and clutches it tightly in his hand. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
  "iterations": {
    "1": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Harry grabs Quirrell's hand, which surprises him, causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared. Puzzled, Harry stares at his hands again, then looks around for the philosopher's stone, seeing the dark red crystal lying on the stairs with a small flame flickering inside it. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "2": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Harry grabs Quirrell's hand, which surprises him, causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "3": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground, his whole body turned to a pile of dust, and Voldemort has also disappeared. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "4": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "5": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry, who falls over backwards, causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it, but Quirrell is trying to choke him. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "6": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. He stretches out desperately to reach it, but Quirrell is trying to choke him. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust. He turns quickly as the cloud of swirling dust gathers behind him, and Voldemort's face appears and screams towards Harry in a violent rushing wind, knocking him off balance.",
    "7": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. He stretches out desperately to reach it, but Quirrell is trying to choke him. Quirrell lurches towards the stone, and Harry's hands push against Quirrell's face, which also disintegrates into dust.",
    "8": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. He stretches out desperately to reach it, but Quirrell is trying to choke him.",
    "9": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way, and they appear in the mirror. He stretches out desperately to reach it, but Quirrell is trying to choke him.",
    "10": "A horrible face appears, growing out of the back of Quirrell's head, with eyes sunk in dark sockets, and the skin stretched over the bony skull as Harry turns to run. He stretches out desperately to reach it, but Quirrell is trying to choke him."
  }
}