{
  "ground_truth": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
  "iterations": {
    "1": "Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "2": "Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "3": "Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "4": "As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "5": "He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "6": "Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "7": "Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "8": "Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "9": "Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
    "10": "Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick."
  }
}