{
  "ground_truth": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
  "iterations": {
    "1": "Colin smiles at Abby, and they go to their apartments, which are opposite each other. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "2": "Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "3": "Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "4": "On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "5": "Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "6": "Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "7": "On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "8": "She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "9": "Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "10": "Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair."
  }
}