{
  "ground_truth": "Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
  "iterations": {
    "1": "Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "2": "Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "3": "He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "4": "Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "5": "At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "6": "The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "7": "Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "8": "He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "9": "Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "10": "Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest."
  }
}