{
  "ground_truth": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
  "iterations": {
    "1": "Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "2": "As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "3": "They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "4": "Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "5": "The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "6": "Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "7": "He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "8": "Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "9": "The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "10": "Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players."
  }
}