{
  "ground_truth": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
  "iterations": {
    "1": "A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "2": "A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "3": "Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "4": "One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "5": "Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "6": "Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "7": "A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "8": "An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "9": "Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "10": "The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s."
  }
}