{
  "ground_truth": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
  "iterations": {
    "1": "Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "2": "Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "3": "Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "4": "She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "5": "Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "6": "Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "7": "A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "8": "All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "9": "Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
    "10": "Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed."
  }
}