{
  "ground_truth": "Ron and Hermione follow the footprints in the snow until they reach the edge of the forest, and Ron hangs back as Hermione walks across a clearing in the trees towards the sound of crying. Falling snow deadens her footsteps. Kneeling beside her friend, Hermione puts out a hand and pulls off the invisibility cloak, revealing Harry, who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
  "iterations": {
    "1": "Falling snow deadens her footsteps. Kneeling beside her friend, Hermione puts out a hand and pulls off the invisibility cloak, revealing Harry, who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "2": "Kneeling beside her friend, Hermione puts out a hand and pulls off the invisibility cloak, revealing Harry, who looks at her miserably. A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "3": "A yellow butterfly flutters above the emerging snowdrops. The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "4": "The Whomping Willow twists its trunk and shakes the snow from its branches. In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "5": "In Lupin's room, Harry nods and grasps his wand. Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "6": "Unlocking a trunk, Lupin releases a Dementor, and Harry collapses into blackness. Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "7": "Chocolate. Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "8": "Harry nods again. Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "9": "Lupin opens the trunk, and a powerful silver mist flows from Harry's wand, shielding him from the terrifying power of the threatening Dementor. With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid.",
    "10": "With determination and willpower, he gradually forces it to retreat inside the open trunk. Laughing with delight, Lupin slams down the lid."
  }
}