{
  "ground_truth": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. He rolls over, looks up at us, and sighs, then sits up and puts on his slippers. Lester thrusts his face directly into a steaming hot shower, and from outside the shower, his naked body is silhouetted through the fogged-up glass door; it becomes apparent he is masturbating. Close on a single, dewy American Beauty rose, a gloved hand with clippers appears and snips the flower off as Carolyn Burnham tends her rose bushes in front of the Burnham house. A very well-put-together woman of forty, she wears color-coordinated gardening togs and has lots of useful and expensive tools, while Lester watches her through a window on the first floor, peeping out through the drapes. In the fenced front yard of the house next door, a dog barks repeatedly, and a man in a conservative suit (Jim #1) chastises the barking dog. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
  "iterations": {
    "1": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. He rolls over, looks up at us, and sighs, then sits up and puts on his slippers. Lester thrusts his face directly into a steaming hot shower, and from outside the shower, his naked body is silhouetted through the fogged-up glass door; it becomes apparent he is masturbating. A very well-put-together woman of forty, she wears color-coordinated gardening togs and has lots of useful and expensive tools, while Lester watches her through a window on the first floor, peeping out through the drapes. In the fenced front yard of the house next door, a dog barks repeatedly, and a man in a conservative suit (Jim #1) chastises the barking dog. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "2": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. He rolls over, looks up at us, and sighs, then sits up and puts on his slippers. A very well-put-together woman of forty, she wears color-coordinated gardening togs and has lots of useful and expensive tools, while Lester watches her through a window on the first floor, peeping out through the drapes. In the fenced front yard of the house next door, a dog barks repeatedly, and a man in a conservative suit (Jim #1) chastises the barking dog. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "3": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. He rolls over, looks up at us, and sighs, then sits up and puts on his slippers. In the fenced front yard of the house next door, a dog barks repeatedly, and a man in a conservative suit (Jim #1) chastises the barking dog. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "4": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. In the fenced front yard of the house next door, a dog barks repeatedly, and a man in a conservative suit (Jim #1) chastises the barking dog. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "5": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. An irritating alarm clock rings, and Lester gropes blindly to shut it off. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "6": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. A second man in a conservative suit (Jim #2) comes out of the house as Lester watches all this from the window. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "7": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Lester Burnham lies sleeping amidst expensive bed linens, face down, wearing pajamas. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "8": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Jim #1 walks toward the fence to greet Carolyn, and they continue to chat, unaware that Lester is watching them. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "9": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. Jane is seated at her desk, working at her computer when outside, a car horn blares.",
    "10": "Jane looks at us and sits up as we're flying above suburban America, descending slowly toward a tree-lined street. We're looking down at a king-sized bed from overhead:. when outside, a car horn blares."
  }
}