{
  "ground_truth": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
  "iterations": {
    "1": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "2": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "3": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "4": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "5": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "6": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "7": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "8": "She blinks. He raises his legs higher. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
    "9": "She blinks. He raises his legs higher. She steps over to a dressing area.",
    "10": "She blinks. She steps over to a dressing area."
  }
}