{
  "ground_truth": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
  "iterations": {
    "1": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "2": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "3": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "4": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "5": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "6": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "7": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "8": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "9": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
    "10": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Ryan sits with Alex's hand in his as Julie and Jim light candles."
  }
}