{
  "ground_truth": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing, into blackness. Marksmen watch from the rooftops of tall buildings as the President's motorcade proceeds towards the plaza. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
  "iterations": {
    "1": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan. Howard scoops Anna in his arms as the fiery explosion shrinks into nothing, into blackness. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "2": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan. President Ashton is on a car phone with Cavic and another agent sitting opposite him. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "3": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The picture freezes and the events run in reverse, showing Enrique bouncing from the windscreen of a red sedan. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "4": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. The motorcade halts in the shadows beneath a bridge where another dark-suited man, Ted Heinkin, climbs into the President's car and lowers the phone. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "5": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. He freezes in the middle of the road as the speeding ambulance hurdles towards her, then makes a mad dash for her. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "6": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. Heinkin hangs up the phone and narrows his eyes, removing two flags from the bonnet of the President's limousine and putting a document in a folder before slamming it shut. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "7": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. An ambulance motors over the crest of the hill bridge, and Howard runs along the highway towards Anna. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "8": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. Ashton stares gravely out of the window as a seething crowd fills the Plaza Mayor. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "9": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The officer stoops over Enrique's body and gently lifts his head, seeing Anna step out onto the highway as a white car swerves to avoid her. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside.",
    "10": "Holden and Parson open fire from across the highway, prompting Howard to flee and then zoom the camera back on Enrique. The double's motorcade passes beneath the watchful snipers while the crowd of protesters waves placards at the roadside."
  }
}