{
  "ground_truth": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
  "iterations": {
    "1": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "2": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "3": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "4": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "5": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "6": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "7": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "8": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "9": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. They glare at each other, and she rides towards him.",
    "10": "A wooden loading tunnel leads right to it. They glare at each other, and she rides towards him."
  }
}