{
  "ground_truth": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
  "iterations": {
    "1": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "2": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "3": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "4": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "5": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "6": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "7": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "8": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "9": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. Walt straightens up and stares at the silver four-by-four as it departs.",
    "10": "He steps on the cigarette. Walt straightens up and stares at the silver four-by-four as it departs."
  }
}