{
  "ground_truth": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera, Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
  "iterations": {
    "1": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "2": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "3": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "4": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "5": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "6": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. They head for the door. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "7": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "8": "She waves her wand. Harry blinks as his glasses repair themselves. A boy with very fair hair tears a page from a book. He steps in front of Harry.",
    "9": "She waves her wand. Harry blinks as his glasses repair themselves. He steps in front of Harry.",
    "10": "She waves her wand. He steps in front of Harry."
  }
}