{
  "ground_truth": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
  "iterations": {
    "1": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "2": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "3": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "4": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "5": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "6": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "7": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "8": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "9": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "10": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear."
  }
}