{
  "ground_truth": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. Umbridge steps back nervously and wags a finger. They have bows and arrows, and she deflects an arrow. She points her wand, and a centaur falls, a strangling rope around its throat, as it writhes and thrashes. Hermione tries to release it, but Umbridge is lifted into the air by Gwarp. The centaurs charge, firing arrows, and pierced by arrows, Gwarp drops Umbridge. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
  "iterations": {
    "1": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. Umbridge steps back nervously and wags a finger. They have bows and arrows, and she deflects an arrow. Hermione tries to release it, but Umbridge is lifted into the air by Gwarp. The centaurs charge, firing arrows, and pierced by arrows, Gwarp drops Umbridge. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "2": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. Umbridge steps back nervously and wags a finger. Hermione tries to release it, but Umbridge is lifted into the air by Gwarp. The centaurs charge, firing arrows, and pierced by arrows, Gwarp drops Umbridge. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "3": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. Umbridge steps back nervously and wags a finger. The centaurs charge, firing arrows, and pierced by arrows, Gwarp drops Umbridge. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "4": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. The centaurs charge, firing arrows, and pierced by arrows, Gwarp drops Umbridge. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "5": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. Umbridge is dirty and disheveled when shadowy creatures appear amongst the trees. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "6": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. The centaurs grab her, and she is carried off. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "7": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry catches up with Hermione as the frayed end of Gwarp's rope lies on the ground. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "8": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. They run back through the forest towards Hogwarts, where Neville, Luna, Ginny, and Ron run to meet them. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "9": "He turns to go, and Snape turns back and raises his eyebrows. With determination, Umbridge raises her wand in the Forbidden Forest. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral.",
    "10": "He turns to go, and Snape turns back and raises his eyebrows. Harry faces his friends, and they, along with Hermione, Neville, Luna, Ginny, and Ron, soar above the pine forest astride the leathery back of a thestral."
  }
}