{
  "ground_truth": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. John grins as the dogs splash around. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
  "iterations": {
    "1": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. An owner throws a Frisbee for his border collie. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "2": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. Bikini girl looks concerned. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "3": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. John grins as the dogs play together in the shallows and more join the fun. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "4": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. Marley is circling in the shallows, preparing to poop. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "5": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Others follow suit and a huge Rottweiler charges into the surf. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "6": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. Other owners watch in horror. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "7": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. Other owners look at John, and with a smile, the tanned bikini beauty unclips the leash on her pet boxer. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "8": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. The big Rottweiler owner closes his eyes in shocked disbelief as John lunges for Marley. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "9": "He looks around the beach at the other owners with their dogs on leashes. He unclips the leash and Marley bounds down to the water. The big man summons the Rottweiler and a police 4x4 noses onto the beach.",
    "10": "He looks around the beach at the other owners with their dogs on leashes. The big man summons the Rottweiler and a police 4x4 noses onto the beach."
  }
}