{
    "117": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out. Neff stares at her tensely, and she turns again to the window so he won't see that she is crying. Neff gets up and goes to her. In the foreground, Neff and Lola are having dinner, with the usual activity of Olvera Street—sidewalk peddlers, guitar players, etc.—in the background. Neff and Lola are driving along the beach near Santa Monica. Neff is wearing a light summer suit, in contrast to Lola's mourning. Apparently, she is telling him a story and now and then she laughs, but there is no sound. There is a close shot of Neff behind the steering wheel, and he is only half listening to Lola. Neff, with his hat on and no briefcase, is walking toward Keyes' office. As he comes up close to the door, he stops with a startled expression on his face. On a chair beside the door sits a familiar figure. He is Jackson, the man from the observation platform of the train. He is wearing his Stetson hat and smoking a cigar, studying something in the file folder. Neff recognizes him immediately, but Jackson does not look up. Neff controls his expression and goes on to open the door to Keyes' office. Neff is just closing the door from the inside. Keyes, with his coat off, is lying on his office couch, chewing on a cigar, as usual. Keyes bounces off the couch like a rubber ball and levels a finger at him. Keyes goes to the door and opens it, and Jackson enters with the file folder. Jackson indicates the cigar he himself is smoking and the file folder he is holding. Keyes remembers he forgot to introduce Jackson and picks up the telephone on his desk and speaks into it. Meanwhile, Jackson crosses over to Neff, and during the ensuing dialogue between him and Neff, we hear Keyes' low voice on the phone in the background. Keyes rejoins them at this point and has opened the door for Jackson, who goes out. Keyes puts a cigar in his mouth and starts tapping his pockets for matches.",
    "1263": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. They stop when they spot a Death Eater leaning over a girl's body, as a werewolf glances up. Hermione casts a spell, knocking Fenrir Greyback through a window. They run through a closed-end walkway with the giants keeping pace, smashing the walls. Racing to the front of the school, they see Dementors flying towards them, when suddenly a shimmering barrier is thrown by Aberforth Dumbledore, holding a wand in his outstretched hand. As Aberforth and his allies turn back to fight, the trio sprints away, running onto a raised walkway and down steps towards the boat house lights where Snape is with Voldemort. Voldemort stares at him as Snape perfects a smile, circling him with his eyes fixed on Voldemort. With a slicing move with the Elder Wand, Snape falls against a glass paneled wall with Harry on the other side. Mouth agape, the snake lunges repeatedly at Snape, thumping him against the lead panned glass, which shakes but doesn't give way, as Harry and the others grab helplessly outside. Snape's bloody hand slides down a window and falls limply to the floor as Harry and the others enter the boat house to find Snape still alive. His lower jaw trembles as Harry moves towards him, kneels down, and leans forward to staunch a wound on Snape's neck. The dying Snape turns his head to look at Harry, who gazes deeply into his eyes as a tear rolls down Snape's cheek, while Hermione rummages in her bag and pulls out a small phial."
}