{
  "ground_truth": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick.",
  "iterations": {
    "1": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "2": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "3": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "4": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "5": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "6": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "7": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "8": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "9": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "10": "Gatsby notices Nick watching him and checks himself, and at the sound of the organ, Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer, a wild-haired young man with glasses, plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick, and they shimmy back and forth. As Gatsby watches, he remembers some time before in uniform, dancing with Daisy and kissing her. He looks grave as he remembers being in battle, while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water, the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink, and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly, and he kisses her and rests his cheek against hers, as Nick watches them with a grave, serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties, where they drink, dance, and splash about in the ornamental pool, while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm, and Tom walks with Nick. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition."
  }
}