{
  "ground_truth": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her.",
  "iterations": {
    "1": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "2": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "3": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "4": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "5": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "6": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "7": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "8": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "9": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "10": "As she sits for a portrait wearing formal robes of state, the Queen's attention is drawn by television news coverage of Tony Blair, who is dressed in a lounge suit with no jacket, smiling towards a cheering crowd. Crawford continues his oil painting, and the Queen smiles at him while seated for the portrait half in profile, wearing a white embroidered dress and a black velvet cloak ornamented with the star and shield of St. George's Cross. As she turns her head from the artist's formal pose, her expression barely changes. A lone pipo walks along a long colonnade at Buckingham Palace, with the royal standard flag gently ruffling in the gray skies above. The Queen lies in bed in a darkened room as a door opens behind her, and a woman enters to put a newspaper on a bedside table. The Queen looks at the paper. Later, the Queen sits at a desk with some corgis behind her as Robin enters. A black Jaguar car pulls to a stop in the palace courtyard, where a man in black coattails opens the rear door for Tony and Cherie Blair, who sit inside the car. The Blairs are ushered through a vast ornate hall by a man in a naval uniform, who smirks at Tony as he leads them toward an imposing set of closed doors. Cherie takes a seat by the doors as Tony is ushered into the room. The two men bow their heads to the Queen, standing in the middle of the room, and Tony shakes her hand. Tony waits for the Queen to be seated before sitting down opposite her. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance."
  }
}