{
  "ground_truth": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches.",
  "iterations": {
    "1": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "2": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "3": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "4": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "5": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "6": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "7": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "8": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "9": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "10": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness."
  }
}