{
  "ground_truth": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles.",
  "iterations": {
    "1": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "2": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "3": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "4": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "5": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "6": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "7": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "8": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "9": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "10": "Ryan and Kara go to the Sunday School room, where Ryan peers through a window in the door. Inside, Jim is sitting in suit trousers, a white shirt, and a maroon waistcoat, reading a children's book. Ryan turns to Kara, who raises her eyebrows, urging him to go in. Jim looks up from the book, and Ryan shuts the door, his eyes roving before he sits down and shrugs. Jim nods and raises his eyebrows, while Ryan smiles and Kara, watching, smiles back. Kara ushers Jim into the room where Julie sits being consoled by the other bridesmaids. Jim walks over to Julie, kneels down, takes her hands in his, and she smiles and nods before they hug each other. Watching from the doorway, Kara glances at Ryan as an usher hands guests the order of service, and they take their seats in the church. In the vestry, Alex helps Ryan get into his suit, and they sit watching as flower girls walk down the aisle, while Jim stands waiting with the bridesmaids. Everyone looks around as Julie walks down the aisle, arm-in-arm with Jim's uncle, and then Julie and Jim walk up to the priest, who conducts the ceremony. Everyone stands watching as Jim slips the wedding ring onto Julie's finger, and she beams. Ryan sits with Alex's hand in his as Julie and Jim light candles. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind."
  }
}