{
  "ground_truth": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven.",
  "iterations": {
    "1": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "2": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "3": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "4": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "5": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "6": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "7": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "8": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "9": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "10": "Felipe perspires profusely and glowers intensely before clicking a red trigger with his thumb, causing the hotel lobby to explode. In the stairwell, Javier checks his watch, and outside, an ambulance hits the streets with Sam on its radio. A Secret Service agent heads downstairs, only to be shot by Javier. Javier watches more agents pass beneath him in the stairwell, then heads downstairs, easing a door open on level seven. He dons a ski mask, lurches through the doorway, and stabs an agent in the back. Another agent rounds the corner, and Javier attacks, killing the agent and drawing his gun. Meanwhile, Sam drives the ambulance through the streets at breakneck speed, careening through a junction and causing two cars to crash. Javier uses a mirror to spot two agents outside the President's room, then opens fire, shooting a third agent, and sets charges which blow the door to the President's room. He ducks inside and guns down Cavic, McCullough, and Heinkin before pointing his gun at Ashton. The ambulance arrives at the bombed hotel, and Veronica and Sam climb out. Sam taps his cell phone screen as the agent leads him away, and they kneel by a casualty. Barnes enters the GNN OB truck and flashes his ID as Veronica enters the elevator with a gurney and presses the button for level seven. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation."
  }
}