{
  "ground_truth": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece.",
  "iterations": {
    "1": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "2": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "3": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "4": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "5": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "6": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "7": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "8": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "9": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "10": "An uneasy silence descends, during which Mrs. Bennet winks at Kitty and Lizzie, gesturing to Jane and Mr. Bingley. Kitty glances at Jane, then at her mother, in confusion. She nods to Mr. Bingley, then leaves the room, followed by Mary and Kitty. Once they have left, Mr. Bingley sits back down. Lizzie casually takes up her embroidery, turning slightly to afford Mr. Bingley and Jane some privacy. Lizzie puts down her embroidery, smiles at Mr. Bingley, then leaves the room. She gives Jane a warning glance as she leaves. Mr. Bingley looks nervously down at Jane, who eventually raises her eyes demurely to meet his. An anxious Mrs. Bennet and the rest of the girls are sitting in another room, waiting. Mrs. Bennet sits with a smug expression. Moments later, Lizzie is skipping quietly down the stairs. She treads silently up to the door of the parlor, then walks inside to find her sister and Mr. Bingley standing together at the mantelpiece. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards."
  }
}