{
  "ground_truth": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown.",
  "iterations": {
    "1": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "2": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "3": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "4": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "5": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "6": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "7": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "8": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "9": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "10": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore."
  }
}