{
  "ground_truth": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
  "iterations": {
    "1": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "2": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "3": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "4": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "5": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "6": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "7": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "8": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "9": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "10": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance."
  }
}