{
  "ground_truth": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them.",
  "iterations": {
    "1": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "2": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "3": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "4": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "5": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "6": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "7": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "8": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "9": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "10": "More cannonballs explode the Bielski lines, claiming more victims. Asael fires his gun blind, the smoke obscuring his vision. Tuvia tosses a bag at Malvin and hares away across the field, his physical and mental strength restored. The two of them dive into thick woodland, moving behind the enemy lines, with a view of the German soldiers and their tank ahead of them. They crouch down as half a dozen Germans come past and set up a gun position in front of them. With murder in his eyes, Tuvia cocks his machine gun and steps forward, gunning down every single man. Tuvia appropriates the German gun, takes up a position in the undergrowth behind the German line, and fires on the troops who are facing away from them, killing a number of them. The Germans regroup. The heavy tank gun is slowly turned in Tuvia and Malvin's direction. As the black mouth of the big gun moves near, Tuvia leaps out of the way and dives behind a tree. A tank fires into the undergrowth behind him. More Germans zip across the field and take up positions just yards away from them. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure."
  }
}