{
  "ground_truth": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street.",
  "iterations": {
    "1": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "2": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "3": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "4": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "5": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "6": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "7": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "8": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "9": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "10": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure."
  }
}