{
  "ground_truth": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot.",
  "iterations": {
    "1": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "2": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "3": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "4": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "5": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "6": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "7": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "8": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "9": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "10": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up, brushing back his long, straggly hair. Next, he draws a circle which contains the bottom half of the wand. Finally, he draws a triangle, surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon."
  }
}