{
  "ground_truth": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
  "iterations": {
    "1": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "2": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "3": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "4": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "5": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "6": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "7": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "8": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "9": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "10": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind."
  }
}