{
  "ground_truth": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards.",
  "iterations": {
    "1": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "2": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "3": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "4": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "5": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "6": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "7": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "8": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "9": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "10": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure."
  }
}