{
  "ground_truth": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
  "iterations": {
    "1": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "2": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "3": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "4": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "5": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "6": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "7": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "8": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "9": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "10": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams."
  }
}