{
  "ground_truth": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor.",
  "iterations": {
    "1": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "2": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "3": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "4": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "5": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "6": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "7": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "8": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "9": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition.",
    "10": "They count piles of money with nobly skinny fingers at the counter as the clerk puts down his quill. Hagrid digs into his pocket and hands over an envelope marked \"top secret.\". They travel on an underground railway and the goblin guide gets off the train. Hagrid hands over a key, and he and Harry follow the goblin along the dank, gloomy passage until a goblin stops beside a door. Hagrid takes the lamp, gives him the key, and turns it in the lock. The heavy steel door opens, and Hagrid shines the lamp inside the vault, causing Harry to blink in amazement, gazed by the sight of vast piles of gleaming golden coins. The goblin guide runs a long, sharp fingernail down the center of the locking mechanism on the door of vault 713. As the door swings slowly open, Harry stares in surprise as the lamplight illuminates a very small, badly wrapped package tied with string. Hagrid steps inside the vault, snatches up the package, and puts it in his pocket, to which Harry nods in agreement. Back in Diagon Alley, Harry consults his list and opens the door of Ollivanders, going inside and gazing around the deserted shop at the shelves full of dusty boxes. An old man slides into view on a ladder, climbs down, and looks along a shelf, taking a long, narrow box from it and carrying it to the counter. He opens the box and holds out a wand, which Harry takes gently and looks at him before waving it, causing drawers to fly open and wand boxes to catapult onto the floor. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind."
  }
}