{
  "ground_truth": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches.",
  "iterations": {
    "1": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "2": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "3": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "4": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "5": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust.",
    "6": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "7": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below.",
    "8": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "9": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure.",
    "10": "The street lights are reflected in the puddles on the damp pavements. At last, he slows down and looks around him. Ahead is a small patch of worn grass in a children's playground. He's alone. He sits wearily on the edge of the pavement, hunching his shoulders against the cold and damp. He looks up as the streetlight above his head flickers and goes out. In the playground, the empty swings begin to move. The roundabout turns and a seesaw clumps down onto the grass. In front of him, a huge black dog looms out of the bushes. Harry slowly rises to his feet. Harry pulls out his wand and stumbles backwards onto the pavement. A bright light approaches. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams."
  }
}