{
  "ground_truth": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
  "iterations": {
    "1": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "2": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "3": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "4": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "5": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "6": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "7": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "8": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "9": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
    "10": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat."
  }
}