{
  "ground_truth": "A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside: the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
  "iterations": {
    "1": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "2": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "3": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "4": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "5": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "6": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "7": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "8": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "9": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.",
    "10": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside:. the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens."
  }
}