{
  "ground_truth": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
  "iterations": {
    "1": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "2": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "3": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "4": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "5": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "6": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "7": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "8": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "9": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "10": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face."
  }
}