{
  "ground_truth": "Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
  "iterations": {
    "1": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "2": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "3": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "4": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "5": "On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "6": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "7": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "8": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "9": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away.",
    "10": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Ryan is distracted, sitting in front of a computer screen, and he puts on a headset. In a meeting with Craig and other employees, Ryan looks at the schedule for the Gold Quest Conference on his laptop. At home, he takes a couple of whiskey miniatures from his fridge and stands looking out of a window with a drink in his hand. A large video screen outside a Las Vegas hotel displays a caption. Ryan waits in the wings of a packed conference hall, and smartly suited, he puts his backpack on a table and steps up to a lectern. Computer-generated backpacks revolve on the screens behind him, and Ryan looks out across the room full of seated delegates. Lost in his thoughts, he hangs his head, then shakes it slightly before looking up and smiling to himself. He taps his thumb on the lectern, walks off past a backstage guy, and leaves the building. Ryan runs through the airport, dragging his case with one hand, while a boarding pass flaps in the other. He reaches a Departure gate, gets the pass checked, and goes through. On a jet, Ryan gazes out of the window at the nighttime lights of Chicago. In a flurry of snow, Ryan picks up a Hertz rental car, signs, gets in, and drives away."
  }
}