{
  "ground_truth": "Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
  "iterations": {
    "1": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "2": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "3": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "4": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "5": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "6": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "7": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "8": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "9": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Darcy is striding towards Pemberley, his wet shirt clinging to his broad chest, as his groom leads the horse behind him. The groom goes off in one direction, and Darcy in the other. He emerges from the trees into a field filled with buttercups and makes his way down the hill towards the large lake fronting Pemberley, its classic lines reflected in the still waters. Lizzie is also making her way down to the lake, lost in thought, and she turns to see Darcy striding out of the woods towards her. Darcy stops dead in his tracks, bows, then continues on his way just as the Gardiners come down the hill towards Lizzie, who's looking a little unsettled. Darcy hurries down some steps into the courtyard, quickly pulling on his coat, pauses for a moment to decide which direction to go, then marches off through an archway, where he catches up with Lizzie. He walks off and Mrs. Gardiner takes Lizzie's arm, and they set off after Darcy and Mr. Gardiner, who are walking a few paces ahead. When they stop to look at the view, Lizzie hangs back, and Darcy comes over to her, leaving the Gardiners to their admiration of the countryside, and he and Lizzie walk on together. Lizzie keeps her gaze averted from him as the party continues their walk through the trees, with Lizzie and Darcy a fair distance ahead of the Gardiners. Later, Darcy is helping Lizzie up into her carriage and as the carriage draws away, Darcy stands watching it. Lizzie turns to see him grow ever smaller in the distance. A lady's hand is at work on a delicate piece of floral embroidery, with smooth rocks sculpted by the wind and the beautiful countryside of the Peak District stretching out to the horizon."
  }
}