{
  "ground_truth": "Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
  "iterations": {
    "1": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "2": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "3": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "4": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "5": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "6": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "7": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "8": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "9": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs.",
    "10": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Jenny puts her hand on Forrest's hand, and Forrest nods as he remembers while continuing to talk to the black woman, who looks up from her magazine. Jenny and Forrest walk, but a dirt clod hits Forrest in the back of the head, causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks, and Forrest is hit in the eye with another dirt clod, causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy #1 and Boy #2 throw more dirt clods at him, with another one hitting him in the arm. Forrest tries to run along the road, but his braces make it impossible, so he hobbles along as Jenny yells after him. Boy #1 and Boy #2 turn back toward the bikes, and the boys ride after Forrest, who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes, and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head, but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed, running from the chasing boys. The boys pedal faster as they gain on Forrest, who looks over his shoulder in fear and tries to run even faster to get away. Suddenly, his braces shatter, sending steel and plastic flying into the air. Surprised, Forrest runs and looks down at his legs as he continues to run faster, with the metal braces and straps flying off his legs."
  }
}