{
  "ground_truth": "Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
  "iterations": {
    "1": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "2": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "3": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "4": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "5": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "6": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "7": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "8": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "9": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Birds take flight over a land which has turned green as the dusty plains have been replaced by rivers, lakes and islands, and waterfalls tumble down the rocks of the previously dry canyon. Sarah and Drover are bathing in a pool in each other's arms when Nullah jumps in, and they all dine happily outside in the evening twilight. Later, Sarah and Drover stand together in each other's arms, kissing, and Sarah watches him ride away while a herd of horses thunders past the house, driven by Drover. He sprints up to Sarah, waiting on the porch, and launches himself into her arms, and they kiss passionately. Fletcher knocks Carney into a swamp with his rifle, and a crocodile attacks the cattle king. At sunset, Drover, in the saddle, leans down and kisses Sarah. The house and neat, colorful gardens of Faraway Downs are bathed in sunshine as a figure in crocodile boots ties cotton around a fly. Fletcher is sitting with a boot up on the dining table, and Sarah stares at him in dismay. He sidles up and whispers to her, then points to a display of spears before she frowns as he leaves. Bandy comes slowly back into the room, and Sarah turns anxiously to her. Nullah stands up on top of a water tower as Sarah watches his arrival from the verandah. He stops his horse, checks his herd, then gallops off, and she wakes up in bed, frowns, and then looks across at Drover lying next to her and smiles, running a hand down his bearded cheek and then down his hairy, muscular chest."
  }
}