{
  "ground_truth": "Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
  "iterations": {
    "1": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "2": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "3": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "4": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "5": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "6": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "7": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "8": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "9": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s.",
    "10": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Over the sound of Adolf Hitler addressing a rally, grainy black and white footage shows him with his arm extended at an angle of 10 degrees from his shoulder, giving the Nazi salute as he reviews troops. A Nazi motorcade approaches a curved metal bridge, and a skull and crossbones on a black flag flutters in the breeze. A man is dragged across the street, while others, identifying labels on their backs, are hounded along by Nazi officers. Jews are shot into a ditch, and women, cowering, are pushed from their homes. One woman falls to the ground and is dragged to her feet. Old men in cloth caps with bags on their shoulders, and women carrying cases, are herded from their village. Black-uniformed SS officers kick a man on the ground. A helmeted German shoots a man in the back, while an officer coolly pulls a revolver from an inside pocket, raises it, and a young man falls lifelessly to the ground; the officer then pockets his gun and resumes his conversation. An army photographer is filming the event. Small children are hauled up into trucks, and families are separated. The bony-cheeked SS officer puffs on a cigarette as a truckload of people trundles past. The departing truck, escorted by Nazi outriders, is observed by two men hiding behind a tree, one in his 30s, the other in his early 20s."
  }
}