{
  "ground_truth": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
  "iterations": {
    "1": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "2": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "3": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "4": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "5": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "6": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "7": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "8": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "9": "Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs."
  }
}