{
  "ground_truth": "He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
  "iterations": {
    "1": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "2": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "3": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "4": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "5": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "6": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "7": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "8": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "9": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear.",
    "10": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He wrestles with the chain as it drags him back, and choking, pressed up against the ice, Harry can't find the opening where he entered the water. He hammers with his hands on the underside of the ice and kicks at it with his bare feet as a shadowy figure walks over the ice above him. Harry's movements slow, and his eyes close as the figure enters the water behind him. A hand grabs the sword, and Harry is hauled across the ice. He's leant against a fallen tree as the figure moves away still clutching the sword. Harry leans forward and grabs his glasses, and he sees Ron. Harry sets the locket on the fallen tree. Drenched, Ron stares awkwardly at Harry, then looks at the ground. Ron prepares himself, and the locket springs open, knocking Harry and Ron to the ground as a huge black cloud swirls over Ron and a swarm of spiders appears. Ghostly images of Harry and Hermione speak to Ron, and he sees naked images of Hermione and Harry kissing passionately. Ron seethes as he watches them, and with the sword in both hands, Ron races towards Harry, who cowers. Ron strikes the locket with the Sword of Gryffindor, and the black cloud and the images disappear."
  }
}