{
  "ground_truth": "Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
  "iterations": {
    "1": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "2": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "3": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "4": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "5": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "6": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "7": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "8": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "9": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots.",
    "10": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots."
  }
}