{
  "ground_truth": "Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
  "iterations": {
    "1": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "2": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "3": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "4": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "5": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "6": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "7": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "8": "Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "9": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand.",
    "10": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Through a bright gap in the clouds, a huge coach appears, drawn by seven winged white horses, and students crowd into the school cloisters, gazing up in excitement as it swoops down toward them. Hagrid guides the horses to land and dives for cover as the coach flies low over his head. A tall mast flying a slender pennant emerges from the center of the lake, and a huge golden galleon rises majestically to the surface, with water spilling from its decks. Huge sails are unfurled, and the great ship glides smoothly toward the school. Gasping for breath, Filch, the caretaker, runs down the hall and whispers to Professor Dumbledore before running out again. A troop of elegant girls glide into the hall, dancing in blue silk uniforms that flatter their slim figures, and Ron gawks at the girls as tiny bluebirds flutter around them. Seamus gapes as the headmistress, Madame Maxime, who is over eight feet tall, passes and towers over Professor Dumbledore. The visitors drop a graceful curtsy, and Madame Maxime smiles graciously, her face framed by a huge fur collar, and extends her hand for Dumbledore to reach up and kiss. The Durmstrang students stride dramatically into the hall, wearing Slavic, military-style uniforms, each carrying a long staff, and sparks fly as they spin them round and strike the stone floor. Two of them hurtle forward, somersaulting high into the air as a handsome student with close-cropped hair strides past, whom Ron recognizes as his Quidditch hero. A student blows a ring of fire, and High Master Karkaroff, wearing a long white coat and a Russian hat, greets Dumbledore. A storm rages around Hogwarts as a dark, disheveled figure limps through the rain toward the school, and Hagrid accidentally stabs Professor Flitwick's hand."
  }
}