{
  "ground_truth": "The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
  "iterations": {
    "1": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "2": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "3": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "4": "On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "5": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "6": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "7": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "8": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "9": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand.",
    "10": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The friends find each other as Death Eaters advance and Ginny points her wand, causing their attackers to vanish. The passages are deserted, but several glass spheres drop from the highest shelves and shatter, prompting the friends to look up in alarm. Luna stands mesmerized by the falling spheres until Neville grabs her arm, and as they run, more spheres plummet from the shelves. They head for the door at the end of a long narrow passage, with the wooden shelves collapsing behind them and sending a cascade of glass spheres crashing down. Crunching broken glass underfoot, they reach the door, which opens, and they run straight through, only to fall into empty space. They land face down beside a large rocky mound, with Harry still clutching the glowing sphere. A stone archway filled with misty vapor stands on the mound as they raise their wands for protection against a group of black-cloaked figures that swoop down. The Death Eaters swirl around them, trailing plumes of dense black smoke. Harry lies huddled on the rocky mound, clutching the prophecy sphere, and cautiously gets to his feet. Ahead of him, a scowling Death Eater restrains Luna with his wand at her throat, while Harry looks around for the others, each held prisoner by a grim-faced Death Eater. Ron struggles, and Hermione's captor tightens his hold as Lucius approaches Harry and holds out his hand. Harry looks around at his friends, helpless in the grip of the Death Eaters, and then back at Lucius' outstretched hand."
  }
}