{
  "ground_truth": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
  "iterations": {
    "1": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "2": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "3": "During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "4": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "5": "Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "6": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "7": "On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "8": "On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "9": "High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "10": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet."
  }
}