{
  "ground_truth": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier. Forrest pays an old black shrimper a large wad of cash and stands at the grave before steering his shrimping boat.",
  "iterations": {
    "1": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard. Bubba's mother, Mrs. Blue, and her other children look at Forrest as he steps over to Bubba's tombstone and pulls out notes from his pocket, then walks along a wooden pier.",
    "2": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong. Forrest walks up to a shack on the edge of the Bayou as a group of black kids play in the front yard.",
    "3": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform. Mrs. Gump and Forrest walk into the house, where there are stacks of ping-pong paddles and life-sized cardboard cutouts of Forrest playing ping-pong.",
    "4": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium. Mrs. Gump walks out of the house and smiles as Forrest walks up to the house, wearing his uniform.",
    "5": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away. Forrest takes his paddle and runs out of the gymnasium.",
    "6": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign. An officer hands Forrest an envelope and then walks away.",
    "7": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up. President Nixon makes a resignation speech on TV, and the television cuts to a shot of President Nixon standing outside Air Force One with his hands in the peace sign.",
    "8": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench. President Nixon holds the plaque, and Forrest speaks on the phone, then hangs up.",
    "9": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House. Forrest looks at the fat man on the bus bench.",
    "10": "Lt. Dan pushes Forrest away, and Forrest steps back as Lt. Dan flips back over, then pulls himself back up onto his wheelchair and breathes heavily. An anchorman reports in front of the White House."
  }
}