{
  "ground_truth": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack. She steps over to a dressing area.",
  "iterations": {
    "1": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi. Desi pulls a brown top from a clothing rack.",
    "2": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi. Jodi's eyes follow. Debbie strolls over to Desi.",
    "3": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi. Jodi's eyes follow.",
    "4": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi. She looks back at Desi.",
    "5": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up. At the boutique, Debbie watches Desi while she folds clothing with Jodi.",
    "6": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away. He sits up.",
    "7": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread. She takes a brief look, then walks away.",
    "8": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms. Pete stares at her with his legs spread.",
    "9": "She blinks. He raises his legs higher. Debbie rolls her eyes and crosses her arms.",
    "10": "She blinks. He raises his legs higher."
  }
}