{
  "ground_truth": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles. In the buffet line, Barb's husband turns to Debbie's father, and Larry extends his hand as Desi and the girls approach. Larry hugs Desi, eyes Oliver, and Charlotte takes Oliver's hand, while Debbie gives them a look. Desi swims in slow motion underwater, Jason and Ronnie swim side-by-side, and they meet in the middle as Desi surfaces with the guys following her up, emerging beside each other. Jason gazes into her eyes as Desi smiles, turns, and swims away, and the guys glance at each other and quickly follow. Later, Larry stands with Oliver as he eats; Oliver winks and takes a bite.",
  "iterations": {
    "1": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles. In the buffet line, Barb's husband turns to Debbie's father, and Larry extends his hand as Desi and the girls approach. Larry hugs Desi, eyes Oliver, and Charlotte takes Oliver's hand, while Debbie gives them a look. Desi swims in slow motion underwater, Jason and Ronnie swim side-by-side, and they meet in the middle as Desi surfaces with the guys following her up, emerging beside each other. Jason gazes into her eyes as Desi smiles, turns, and swims away, and the guys glance at each other and quickly follow.",
    "2": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles. In the buffet line, Barb's husband turns to Debbie's father, and Larry extends his hand as Desi and the girls approach. Larry hugs Desi, eyes Oliver, and Charlotte takes Oliver's hand, while Debbie gives them a look. Desi swims in slow motion underwater, Jason and Ronnie swim side-by-side, and they meet in the middle as Desi surfaces with the guys following her up, emerging beside each other.",
    "3": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles. In the buffet line, Barb's husband turns to Debbie's father, and Larry extends his hand as Desi and the girls approach. Larry hugs Desi, eyes Oliver, and Charlotte takes Oliver's hand, while Debbie gives them a look.",
    "4": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles. In the buffet line, Barb's husband turns to Debbie's father, and Larry extends his hand as Desi and the girls approach.",
    "5": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming. Debbie opens the door for her father, who furrows his brows, while Pete looks down at the box and smiles.",
    "6": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie. Jason turns Debbie around and stares at Pete while Ronnie stares off; they quickly leave, with Jason moving next to Ronnie, exchanging awkward smiles as they notice Desi swimming.",
    "7": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave. Pete greets guests and accepts presents, then stands with Ronnie.",
    "8": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi. The guys look toward their wives and wave.",
    "9": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen. By the pool, Pete and his goateed friend watch Desi in a bikini as she swims with Charlotte, while Barb glances toward the pool and Debbie notices Desi.",
    "10": "Pete enters the room and finds Sadie with tears in her eyes and holds up both hands. Meanwhile, Debbie prepares for the party as Barb enters the kitchen."
  }
}