{
  "ground_truth": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes. At an airport, Ryan drops off a rental car and walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard. He puts his case on a table, grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them. He steps through the walk-through metal detector, holding up his boarding pass, and passes the security check.",
  "iterations": {
    "1": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes. At an airport, Ryan drops off a rental car and walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard. He puts his case on a table, grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them.",
    "2": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes. At an airport, Ryan drops off a rental car and walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard.",
    "3": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes.",
    "4": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case.",
    "5": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door.",
    "6": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office.",
    "7": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway.",
    "8": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline.",
    "9": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields.",
    "10": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises."
  }
}