{
  "ground_truth": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport. A row of grand glass-fronted arches.",
  "iterations": {
    "1": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph. Ryan holds the cardboard cut-out of Julie and Jim in front of the main terminal building at St. Louis Airport.",
    "2": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it. Natalie lines up a photograph.",
    "3": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry. Ryan reads it.",
    "4": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry. Alex looks at her BlackBerry.",
    "5": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back. Ryan stares at his BlackBerry.",
    "6": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply. Alex grins and writes back.",
    "7": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies. Alex reads the reply.",
    "8": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex. Ryan smiles and replies.",
    "9": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it. Ryan picks up his BlackBerry and reads a text from Alex.",
    "10": "Wearing a white dressing gown, he sits on the bed in his hotel room. He takes a wedding invitation from an envelope and studies it."
  }
}