{
  "ground_truth": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. The young man leaves her, and Enrique looks up as the Mayor finishes his introduction.",
  "iterations": {
    "1": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation.",
    "2": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern, and Spanish flags are waved.",
    "3": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand.",
    "4": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier, where he shows his ID and is allowed through.",
    "5": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back. She blows him a kiss.",
    "6": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag. Enrique reluctantly lets go of her hand and moves away, stopping to glance back.",
    "7": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head. As she hugs him, he hands her her bag.",
    "8": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica. He grabs her hair and pushes her against a pillar; she holds his head.",
    "9": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them, the short cropped-haired man walks away, and the two exchange looks as Enrique strides up to the pretty long-haired woman, Veronica.",
    "10": "Enrique approaches a security checkpoint and a female officer, who calls next. He notices a couple whispering and keeps his eyes on the young couple."
  }
}