{
  "ground_truth": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse, and a car pulls up at a large country house while a man in a bowler hat gets out. She frowns, her blue eyes glittering, and screws up a telegram, later looking out of an airplane window at a port with a moored ship. A red-bearded speaker is sent sprawling, making the rough-looking crew in a bar nervous; Drover downs a drink and up-ends his glass as an Aboriginal man approaches, while the pipe-smoking barman glares.",
  "iterations": {
    "1": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse, and a car pulls up at a large country house while a man in a bowler hat gets out. She frowns, her blue eyes glittering, and screws up a telegram, later looking out of an airplane window at a port with a moored ship.",
    "2": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house. A woman rides a horse, and a car pulls up at a large country house while a man in a bowler hat gets out.",
    "3": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs. He hides in a water tank as a man tries to grab the horse, peeking through a crack as an elegant woman in a bonnet and long coat strides towards the house.",
    "4": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch. Spotting an overloaded truck approaching, he dismounts and looks worried, sprinting through the settlement called Faraway Downs.",
    "5": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens. Bonfire smoke mixes with the dust in the air, and an animal skull hangs from a dry branch.",
    "6": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water. Wearing only shorts, with his long hair streaming, he rides through a dusty landscape with thinly spread trees and rocky crags, continuing through a settlement of wood buildings and animal pens.",
    "7": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle. He climbs on the horse's back, urging it out of the water.",
    "8": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom. The boy breaks the surface and sees a horse panicking in the water, reaches out, and the horse swims towards him, allowing him to stroke its muzzle.",
    "9": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water. The man floats lifelessly over the boy, his blood staining the water, and then sinks to the bottom.",
    "10": "At dawn, an orange glow silhouettes two people and a tree. His grandfather grabs his fishing pole as the boy lies wide-eyed on the bottom while a White man in a suit falls face-first into the water."
  }
}