{
  "ground_truth": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying.",
  "iterations": {
    "1": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue.",
    "2": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will.",
    "3": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops.",
    "4": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women.",
    "5": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant.",
    "6": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties.",
    "7": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical.",
    "8": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today.",
    "9": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room.",
    "10": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo."
  }
}