{
  "ground_truth": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door, Hermione looks back for a moment, then with her head lowered, walks down the path and strides along the street, her long wavy hair ruffled by a breeze as she carries a small beaded bag. A Death Eater, a dark shadowy figure, zooms over the countryside towards a large manor house on a country estate, descending to the ground. The Death Eater walks towards the gates, waves his wand to make them evaporate, allowing him to step through, his face somber with dark, lank, shoulder-length hair, and the gates reappear behind him.",
  "iterations": {
    "1": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door, Hermione looks back for a moment, then with her head lowered, walks down the path and strides along the street, her long wavy hair ruffled by a breeze as she carries a small beaded bag. A Death Eater, a dark shadowy figure, zooms over the countryside towards a large manor house on a country estate, descending to the ground.",
    "2": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go. Standing outside her front door, Hermione looks back for a moment, then with her head lowered, walks down the path and strides along the street, her long wavy hair ruffled by a breeze as she carries a small beaded bag.",
    "3": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat. Harry stands alone on the path watching them go.",
    "4": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home. Harry's Aunt Petunia sits in a car, staring blankly, while Uncle Vernon looks nervously at the sky and Dudley clambers into the backseat.",
    "5": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece. Hermione's eyes fill with tears as she sees herself disappearing from every photograph in the home.",
    "6": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow. The images of Hermione as a baby and a young child slowly fade from view in the photographs on the mantelpiece.",
    "7": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds. Hermione's parents watch TV as she looks at them sadly and raises her wand, causing the tip to glow.",
    "8": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen. Ron glances briefly behind him before turning back to the wreath beds.",
    "9": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window. Outside the rebuilt Weasleys' home, Ron stands staring over the wreath beds toward the horizon as his mother and sister, Ginny, are busy in the kitchen.",
    "10": "Two eyes staring are followed by Rufus Scrimgeour, the Minister of Magic, being photographed at a press conference. At home, Hermione reads the headlines in the Daily Prophet while Harry Potter's uncle, Vernon, drags a suitcase to his car as Harry watches from his bedroom window."
  }
}