{
  "ground_truth": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse. Neff is again busy unwrapping the tape from his leg.",
  "iterations": {
    "1": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go. Phyllis releases the hand brake and puts the car in reverse.",
    "2": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head. She turns to go.",
    "3": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits. Phyllis coolly reaches past him and takes the hat off the dead man's head.",
    "4": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks. He reaches into the car and begins to drag out the body by the armpits.",
    "5": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her. Neff points back towards the tracks.",
    "6": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard. He reaches her.",
    "7": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug. The running steps grow louder and Neff comes into the shot breathing hard.",
    "8": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in. She pulls the rug off the corpse (which is not visible) and stands looking into the car, unable to take her eyes off what she sees, while at the same time her hands mechanically begin to fold the rug.",
    "9": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks. She opens the back door of the car and leans in.",
    "10": "The front door opens and Phyllis steps out. She closes the door and looks in the direction of the tracks."
  }
}