{
  "ground_truth": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside. Voldemort bursts out, and Dumbledore launches a blast of powerful energy; Voldemort staggers and then returns it, hurling Dumbledore backwards.",
  "iterations": {
    "1": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry. Dumbledore holds it back, and hovered against the wall, Harry shields his face from the heat while Dumbledore draws a great wave of water from the pools surrounding the fountain to submerge Voldemort, forming a huge rolling ball with Voldemort trapped inside.",
    "2": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls; Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers. Voldemort breathes out a gigantic serpent, weaved in red hot flames, which bears its fangs and heads for Harry.",
    "3": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's. The two powerful forces meet like molten lava in a burst of flashing sparks and flame, as Harry cowers.",
    "4": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke. Voldemort flicks his wand, and Dumbledore retaliates with red light streaming from Dumbledore's wand while green light comes from Voldemort's.",
    "5": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand. There is a flash of green smoke as Dumbledore appears out of a fireplace and pushes Harry aside, with Bellatrix disappearing in a flash of green smoke.",
    "6": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand. Suddenly, Voldemort appears, and Harry turns as Voldemort knocks Harry's wand from his hand.",
    "7": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand. His neck twists and flexes, and he hesitates, gripping his wand.",
    "8": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;. Bellatrix cowers on the ground as Harry stands over her aiming his wand.",
    "9": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic. The spell stops her, and she falls;.",
    "10": "Lupin grabs Harry tightly and holds him back. Struggling to free himself, Harry's grief turns to rage when he sees Bellatrix Lestrange's evil smile, and she slips away quickly around a dark corner. Harry breaks free from Lupin and races after her, catching up with her as she runs through the great hall of the Ministry of Magic."
  }
}