{
  "ground_truth": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection. To his surprise, two shadowy figures gradually appear in the mirror, standing one on each side of him: a young man and young woman. Harry turns, but the room behind him is completely empty. He looks back at the pretty young woman and swallows nervously. She nods and smiles. Harry's kind-looking father beams at him.",
  "iterations": {
    "1": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection. To his surprise, two shadowy figures gradually appear in the mirror, standing one on each side of him: a young man and young woman. Harry turns, but the room behind him is completely empty. He looks back at the pretty young woman and swallows nervously. She nods and smiles.",
    "2": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection. To his surprise, two shadowy figures gradually appear in the mirror, standing one on each side of him: a young man and young woman. Harry turns, but the room behind him is completely empty. He looks back at the pretty young woman and swallows nervously.",
    "3": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection. To his surprise, two shadowy figures gradually appear in the mirror, standing one on each side of him: a young man and young woman. Harry turns, but the room behind him is completely empty.",
    "4": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection. To his surprise, two shadowy figures gradually appear in the mirror, standing one on each side of him: a young man and young woman.",
    "5": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar. Harry stands still for a moment, gazing at himself, then takes a step forward towards his reflection.",
    "6": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer. He stops in front of it and tries to read the writing carved around the wooden frame, but the words are strange and unfamiliar.",
    "7": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond. As he walks slowly towards the mirror, he sees his own reflection getting closer.",
    "8": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously. Through a stone arch, he glimpses a large mirror and a carved frame that goes down a few steps into the room beyond.",
    "9": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air. Harry looks around curiously.",
    "10": "In the classroom next door, Harry reappears as he takes off the invisibility cloak. The moonlight, filtering through the snow on the window panes, gives the empty classroom a mysterious air."
  }
}