{
  "ground_truth": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower. In the truck, Rambo's eye-line and bandana are reflected in BN's driving mirror.",
  "iterations": {
    "1": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier. He rests his rifle on the timbers of the watch tower.",
    "2": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence. On the tower, School Boy clamps a hand over the guard's mouth and plunges the serrated blade into the soldier.",
    "3": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier. School Boy steals onto the watch tower platform where a lookout sits in a chair, oblivious to his presence.",
    "4": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp. BN is at the wheel, dressed as a soldier.",
    "5": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance. He walks into the rain-soaked road as the truck approaches the camp.",
    "6": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath. A guard in a rain poncho smokes a cigarette and sees the headlamps of the truck in the distance.",
    "7": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower. He pulls out a vicious-looking knife with a serrated blade from a sheath.",
    "8": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready. His head covered by a black hat, School Boy stealthily climbs the wooden steps of the camp watch tower.",
    "9": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head. The team, including Rambo, make ready.",
    "10": "By its red glow, the mercenaries check their watches en masse. Lewis pulls a hood over his head."
  }
}