{
  "ground_truth": "Outside, Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday, video footage shows a long line of people standing outside Buckingham Palace, laying more flowers at the gates, where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates, holding a hand to her face. Inside a large room, dignitaries and their advisers sit around a long table. Outside 10 Downing Street, a car stops, and Allister emerges from a backseat door, carrying some papers. After seeing the newspapers, Tony moves to leave. Two men, holding rifles, exit Balmoral followed by Charles, William, and Harry. Some Land Rovers are parked in the courtyard, and the Queen watches from a window above as she opens a newspaper. Robin enters holding a tray of items, and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down. The Queen sits down in a nearby armchair, and Robin leaves a notepad on the table close by. Later, Tony sits at a desk with a female assistant beside him. A nervous Charles looks up at Steven, while, at the other end, a befuddled Tony puts down the phone. The Queen walks with two black Labradors, opens the door to an old Land Rover, and gets the dogs inside. Charles settles into the passenger seat, and the Queen and Charles drive along a country road. The Queen gets out, opens the back door, and the three black Labradors jump out. Charles moves round to the driver's side, drives away, leaving the Queen with the dogs. Figures can be glimpsed on the green hills nearby; one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance, over the next hill, a stag stands alone. Later, the Queen sits on a bed and watches footage from an interview with Diana on TV, with Philip standing in the doorway. The Queen stares thoughtfully at the TV, twists a silver pen in her hands, gazes at Prince Philip for a moment, then turns away. She sips drink from a glass, and a distracted Queen nods faintly. An image of Camilla on horseback appears on TV, and the Queen changes the channel. Various images appear, including Diana in a black evening dress, Diana next to a land mine danger sign, Diana cuddling children, Diana talking with pensioners, and Diana smiling. On Tuesday, Tony and Allister walk along, and Allister indicates a nearby room. The Queen strolls through some woods, carrying a lunch box and accompanied by some corgis, as some chairs, tables, and a barbecue have been set up in a clearing nearby.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Outside, Charles stands with Steven before Charles walks off and Steven departs in another direction. On Monday, video footage displays a lengthy queue of individuals standing outside Buckingham Palace, placing more blossoms at the gates, where clusters of flowers accumulate at the railings as an immense crowd of people is held back by metallic barriers. One woman crouches by the gates, holding a hand to her face. Inside a large room, dignitaries and their advisers sit around a lengthy table. Outside 10 Downing Street, a car halts, and Allister emerges from a rear door, carrying some documents. After seeing the newspapers, Tony moves to depart. Two men, holding rifles, exit Balmoral followed by Charles, William, and Harry. Some Land Rovers are parked in the courtyard, and the Queen watches from a window above as she opens a newspaper. Robin enters holding a tray of items, and the Queen looks out of the window and clenches her jaw as Robin casts his eyes down. The Queen sits down in a nearby armchair, and Robin leaves a notepad on the table close by. Later, Tony sits at a desk with a female assistant beside him. A anxious Charles looks up at Steven, while, at the other end, a confused Tony puts down the phone. The Queen walks with two black Labradors, opens the door to an aged Land Rover, and gets the dogs inside. Charles situates into the passenger seat, and the Queen and Charles drive along a rural road. The Queen gets out, opens the back door, and the three black Labradors leap out. Charles moves round to the driver's side, drives away, leaving the Queen with the dogs. Figures can be glimpsed on the verdant hills nearby; one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance, over the next hill, a stag stands alone. Later, the Queen sits on a bed and watches footage from an interview with Diana on TV, with Philip standing in the doorway. The Queen stares thoughtfully at the TV, twists a silver pen in her hands, gazes at Prince Philip for a moment, then turns away. She sips liquid from a glass, and a distracted Queen nods faintly. An image of Camilla on horseback appears on TV, and the Queen switches the channel. Various images appear, including Diana in a black evening gown, Diana next to a land mine danger sign, Diana cuddling children, Diana conversing with pensioners, and Diana smiling. On Tuesday, Tony and Allister walk along, and Allister indicates a nearby room. The Queen strolls through some woods, carrying a lunch box and accompanied by some corgis, as some chairs, tables, and a barbecue have been set up in a clearing nearby."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Outside, Steven is stood with by Charles before another direction is left in by him and off walks Charles. On Monday, a long line of people is shown by video footage standing outside Buckingham Palace, more flowers are laid by them at the gates, where bunches of flowers pile up at the railings as metal barriers hold back a massive group of people. A hand is held to her face by one woman crouching by the gates. Inside a large room, a long table is sat around by dignitaries and their advisers. Outside 10 Downing Street, a backseat door is emerged from by Allister, and some papers are carried by him. After newspapers are seen by him, leaving is moved to by Tony. Balmoral is exited by two men, holding rifles, followed by Charles, William, and Harry. In the courtyard, some Land Rovers are parked, and a newspaper is opened by the Queen as she watches from a window above. A tray of items is entered with by Robin, and the window is looked out of by the Queen, her jaw is clenched as his eyes are cast down by Robin. A nearby armchair is sat down in by the Queen, and a notepad is left by Robin on the table close by. Later, a desk is sat at by Tony with a female assistant beside him. A nervous Charles looks up at Steven, while, at the other end, the phone is put down by a befuddled Tony. Two black Labradors walk with the Queen, the door to an old Land Rover is opened by her, and the dogs are got inside. The passenger seat is settled into by Charles, and a country road is driven along by the Queen and Charles. The back door is opened by the Queen after she gets out, and the three black Labradors jump out. The driver's side is moved round to by Charles, who drives away, leaving the Queen with the dogs. On the green hills nearby, figures can be glimpsed; some binoculars are looked through by one of them while three more stand still and another three lie on the ground. In the distance, over the next hill, a stag stands alone. Later, a bed is sat on by the Queen, and footage from an interview with Diana is watched by her on TV, with Philip standing in the doorway. The TV is stared at thoughtfully by the Queen, a silver pen is twisted in her hands, Prince Philip is gazed at for a moment by her, then turns away. A drink is sipped from a glass by her, and a distracted Queen nods faintly. Camilla on horseback appears on TV, and the channel is changed by the Queen. Various images appear, including Diana in a black evening dress, next to a land mine danger sign, cuddling children, talking with pensioners, and smiling. On Tuesday, a nearby room is indicated by Allister as he walks along with Tony. Through some woods, the Queen strolls, a lunch box is carried by her and she is accompanied by some corgis, as some chairs, tables, and a barbecue have been set up in a clearing nearby."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Outside, Charles and Steven part ways. On Monday, video footage shows crowds outside Buckingham Palace laying flowers at the gates, with piles of bouquets behind metal barriers. A woman crouches by the gates, holding her face. Inside, dignitaries and advisers sit around a table. Outside 10 Downing Street, Allister exits a car, holding papers. After seeing newspapers, Tony moves to leave. Two men with rifles exit Balmoral with Charles, William, and Harry. Land Rovers are parked in the courtyard, and the Queen watches from a window, reading a newspaper. Robin enters with a tray, and the Queen looks out the window, clenching her jaw as Robin lowers his eyes. The Queen sits in an armchair, and Robin leaves a notepad nearby. Later, Tony is at a desk with a female assistant. Charles looks nervously at Steven, and a confused Tony hangs up the phone. The Queen walks two black Labradors to an old Land Rover and loads them inside. Charles takes the passenger seat, and they drive along a country road. The Queen lets the dogs out, Charles drives away, leaving her with them. Figures on nearby hills include one with binoculars, others standing and lying down. A distant stag stands alone over the next hill. Later, the Queen sits on a bed, watching Diana’s interview on TV, with Philip at the door. Thoughtfully gazing at the TV, she twists a silver pen, glances at Philip, then looks away. She sips a drink, nodding faintly, and changes the channel from an image of Camilla on horseback. Images of Diana in various settings appear. On Tuesday, Tony and Allister walk as Allister gestures to a room. The Queen strolls through woods with a lunch box and corgis, near a clearing with chairs, tables, and a barbecue."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Outside, Charles and Steven part ways. On Monday, footage shows a long line outside Buckingham Palace, where people lay flowers, creating piles at the gates, held back by barriers. A woman crouches, hand on face. In a large room, dignitaries sit around a table. At 10 Downing Street, Allister exits a car with papers. After seeing newspapers, Tony leaves. Two rifle-holding men exit Balmoral with Charles, William, and Harry. Land Rovers are in the courtyard as the Queen opens a newspaper, watching from a window. Robin brings a tray, and the Queen, jaw clenched, looks out, then sits in an armchair, as Robin places a notepad nearby. Later, Tony sits at a desk with an assistant. A nervous Charles looks at Steven, and a confused Tony hangs up the phone. The Queen, with two Labradors, opens her Land Rover, and Charles rides with her. They drive along a country road, and the Queen lets the dogs out. Charles drives away, leaving the Queen with the dogs. Figures on hills are seen, one with binoculars, others stand or lie on the ground. A lone stag stands over the hill. Later, the Queen, on a bed, watches Diana's interview, with Philip in the doorway. She twists a pen, glances at Philip, then turns away, sipping from a glass. Camilla on horseback appears on TV, and the Queen changes the channel. Images of Diana smiling, with a mine sign, with children, talking to pensioners, and in a black dress appear. On Tuesday, Tony and Allister walk by a room Allister indicates. The Queen walks through woods with corgis and a lunch box, where chairs, tables, and a barbecue are set up in a clearing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Outside, Charles stands alongside Steven momentarily before Charles walks off in one direction and Steven heads off in another course. On the following Monday, video footage surfaces, showing an extensive line of people standing outside the grand Buckingham Palace. These people are seen laying more flowers at the gates, where numerous bunches of flowers have amassed at the railings. A massive group of people, held back by sturdy metal barriers, watches as this respectful act of mourning takes place. Among them, a solitary woman crouches by the gates, holding a hand to her face, perhaps lost in thought or emotion. Inside a spacious, elegantly decorated room, dignitaries and their advisers are seated around a lengthy table, engaged in serious discussion. Outside the famous 10 Downing Street, a car comes to a stop, and Allister emerges from a backseat door, carefully carrying a stack of papers. After glancing at the newspapers, Tony decides to leave. Two men, each holding a rifle, exit Balmoral, followed by Charles, William, and Harry. A few Land Rovers are stationed in the courtyard, and the Queen watches from a window above. She opens a newspaper, seemingly deep in thought. Robin enters discreetly, holding a tray with various items, and the Queen looks out of the window, her jaw clenched slightly as Robin averts his gaze. The Queen then sits down in a nearby, comfortable armchair, while Robin places a notepad gently on the table close by. Later, Tony is seated at a desk with a female assistant beside him. Meanwhile, a visibly nervous Charles glances up at Steven, while, at the other end, a confused Tony sets down the phone. The Queen strolls with two black Labradors, opens the door to an old Land Rover, and gets the dogs inside. Charles slides into the passenger seat, and together, the Queen and Charles drive along a scenic country road. Once they stop, the Queen gets out, opens the back door, allowing the three black Labradors to leap out energetically. Charles then moves around to the driver's side and drives away, leaving the Queen alone with the dogs. Figures can be seen faintly on the green hills nearby; one of them peers through binoculars while three others stand motionless, and another three lie on the ground. Off in the distance, over the next hill, a solitary stag stands majestically alone. Later, the Queen sits on a bed and watches footage from an interview with Diana on television, as Philip stands silently in the doorway. The Queen stares thoughtfully at the screen, twisting a silver pen in her hands. She briefly gazes at Prince Philip, then turns away, taking a sip from a glass, nodding faintly in distraction. An image of Camilla on horseback appears on the TV screen, prompting the Queen to change the channel. Various images flash by, depicting Diana in a striking black evening dress, standing near a land mine danger sign, warmly cuddling children, conversing with pensioners, and smiling radiantly. On the subsequent Tuesday, Tony and Allister walk along together, and Allister indicates a nearby room. Meanwhile, the Queen takes a leisurely stroll through the woods, carrying a lunch box and accompanied by some lively corgis. Nearby, chairs, tables, and a barbecue have been set up in a clearing."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Outside, under the open sky, Charles stands joined by Steven for a brief moment before each man departs, Charles making his way in one direction while Steven heads off on a different course altogether. When the following Monday arrives, video footage surfaces, revealing an extensive line of people congregated outside the grand and historic Buckingham Palace. These individuals are seen laying more flowers at the palace gates, where countless bunches of flowers have already amassed against the railings. A massive crowd, held back by sturdy metal barriers, watches with solemn respect as this poignant act of mourning unfolds. Among those gathered, a solitary woman crouches close to the gates, holding a hand to her face, perhaps lost in deep thought or overwhelmed with emotion. Inside a spacious and elegantly adorned room, dignitaries and their advisers are seated around an impressively lengthy table, deeply engaged in serious and weighty discussions. Outside the iconic 10 Downing Street, a car comes to a gradual stop, and Allister smoothly emerges from a backseat door, carefully carrying a stack of documents and papers. After casting a glance at the newspapers, Tony decides that it is time to leave. Two men, each gripping a rifle, emerge from Balmoral, followed closely by Charles, William, and Harry. A few Land Rovers are strategically stationed in the courtyard, and the Queen watches from a window above. She opens a newspaper, seeming to be lost in thought. Robin enters the room discreetly, carrying a tray with various items, and the Queen looks out of the window, her jaw clenched slightly as Robin intentionally averts his gaze. The Queen then seats herself in a nearby, comfortable armchair, while Robin places a notepad gently on the table close by. Later on, Tony is found seated at a desk, with a female assistant positioned beside him. Meanwhile, a visibly nervous Charles glances up at Steven, while, at the opposite end of the situation, a confused Tony sets down the phone. The Queen leisurely strolls with two black Labradors, opens the door to an old Land Rover, encouraging the dogs inside. Charles slides into the passenger seat, and together, the Queen and Charles drive along a scenic and picturesque country road. Once they come to a stop, the Queen gets out, opens the back door, allowing the three black Labradors to leap out energetically. Charles then moves around to the driver’s side and drives away, leaving the Queen alone with the dogs. Figures can be seen faintly on the rolling, green hills nearby; one of them peers through binoculars while three others stand perfectly motionless, and another three lie prone on the ground. Off in the distance, over the next hill, a solitary stag stands majestically alone. Later, the Queen sits on a bed and watches as footage from an interview with Diana plays on the television, while Philip stands silently in the doorway. The Queen stares thoughtfully at the screen, twisting a silver pen in her hands. She briefly gazes at Prince Philip, only to turn away, taking a sip from a glass, nodding faintly as if in distraction. An image of Camilla on horseback appears on the TV screen, prompting the Queen to change the channel. Various images flash by, depicting Diana in a striking black evening dress, standing near a warning sign for land mines, warmly cuddling children, engaging in conversation with pensioners, and smiling radiantly. On the subsequent Tuesday, Tony and Allister walk along together, and Allister indicates a nearby room. Meanwhile, the Queen takes a leisurely stroll through the woods, carrying a lunch box and accompanied by some lively corgis. Nearby, chairs, tables, and a barbecue have been set up in a charming clearing."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Outside, Charles stands alongside Steven in an open area, exchanging final words or gestures, before Charles decisively walks off in one direction while Steven departs in another, each moving with a purposeful stride. On Monday, the scene shifts to video footage revealing a long line of people gathered outside Buckingham Palace. These individuals stand somberly, waiting their turn to approach the gates where they carefully lay flowers, adding to an ever-growing pile that rests against the railings. The atmosphere is poignant as the crowd, swelling in number, is held back by metal barriers, maintaining order amidst the emotion. Among them, one woman crouches close to the gates, her hand resting against her face in a gesture of contemplation or mourning. Inside a large, formal room, dignitaries and their advisers sit arranged around a long, imposing table, likely engaged in serious discussion. Meanwhile, outside 10 Downing Street, a car arrives and comes to a halt. Allister emerges from the backseat, deliberately clutching several sheets of paper, suggesting importance or urgency. Inside another office, Tony observes the headlines or content of the newspapers, which prompts him to decisively move to leave as if compelled by the news. At Balmoral, two men equipped with rifles exit the grand entrance, making way for the appearance of Charles, William, and Harry, who follow them with deliberate steps. In the courtyard, several Land Rovers are parked in readiness, serving as a backdrop, while the Queen remains inside, watching everything from a window above. She unfurls a newspaper, possibly to catch up on developments or reflect in solitude. Robin, a staff member, enters carrying a tray of assorted items, adding to the sense of routine, yet significant activity. The Queen, from her vantage point, observes the scenery and people outside the window, her jaw subtly clenching, conveying a mix of resolve and tension, as Robin respectfully averts his gaze to the ground. She eventually settles into a nearby armchair, a move signaling a moment of reflection or decision. Before exiting, Robin leaves a notepad on the table close by, suggesting ongoing communication or note-taking. Later, Tony, seated at a desk, works alongside a female assistant. Papers and tasks lay before him, symbolizing his ongoing duties. Meanwhile, Charles, appearing nervous, looks toward Steven perhaps for reassurance or guidance, as Tony, on the other end, sets down a phone after a possibly perplexing call. The Queen is seen walking with her two black Labradors, leading them to an old Land Rover. She opens the door, helping the dogs inside before Charles settles into the passenger seat beside her. Together, they traverse a country road, the journey marked by their shared silence and the scenery passing by. Upon reaching their destination, the Queen exits, opens the back door, and the three black Labradors eagerly jump out, their movements lively and unrestrained. Charles circles around to the driver's side, taking the wheel before driving away, his departure leaving the Queen in the company of her dogs. From afar, figures dot the surrounding green hills; one peers through binoculars while three stand vigilant and three more lie prone on the ground, likely observing or guarding their surroundings. Across the distance, beyond the next hill, a lone stag stands, its presence commanding yet isolated. In a more private moment later, the Queen sits on a bed, her attention drawn to the television displaying a replay of Diana's interview. Prince Philip stands in the doorway behind her, his presence a silent support. The Queen's gaze remains fixed on the TV, her expression thoughtful. She absently twists a silver pen in her hands, her thoughts momentarily shifting to meet Prince Philip's eyes before she looks away. The Queen takes a sip from her glass, her nod faint and distracted, as if absorbed in a world of her own. A fleeting image of Camilla on horseback appears on the TV screen, prompting the Queen to change the channel, her action deliberate and without hesitation. On the screen, various images of Diana unfold—her in a black evening dress, standing near a land mine danger sign, cuddling children, conversing with pensioners, and smiling, each image capturing a facet of her legacy. On Tuesday, the scene transitions to Tony and Allister, who walk side by side, Allister gesturing toward a nearby room, possibly suggesting a meeting or event. Meanwhile, the Queen embarks on a solitary stroll through the woods, a lunch box in hand and some corgis trailing happily behind her. The setting opens into a clearing where chairs, tables, and a barbecue have been set up, indicating preparations for a gathering or picnic, marking a serene interlude amidst the unfolding events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Outside, Charles and Steven part ways, each heading in a different direction. On Monday, video footage captures a long line of people outside Buckingham Palace, laying flowers at the gates, where the floral tributes pile up as crowds are held back by barriers. A woman crouches by the gates, visibly moved. Inside a large room, dignitaries and advisers gather around a long table. Outside 10 Downing Street, Allister exits a car with papers in hand. After reading the newspapers, Tony decides to leave. Two armed men exit Balmoral, followed by Charles, William, and Harry, as parked Land Rovers fill the courtyard. The Queen observes from a window above, reading a newspaper. Robin enters with a tray, leaving a notepad on a table, as the Queen gazes out the window, clenching her jaw. Later, she sits in an armchair while Robin departs. Tony is at a desk with an assistant, while Charles nervously glances at Steven, and Tony, perplexed, finishes a phone call. The Queen, accompanied by two black Labradors, opens an old Land Rover and helps them inside. With Charles as a passenger, they drive along a country road. After stopping, the Queen lets the Labradors out, and Charles drives away, leaving her with the dogs. Figures are visible on the nearby hills, some standing, others lying on the ground, while a stag is seen in the distance. Later, the Queen, seated on a bed, watches Diana's interview on TV, with Philip in the doorway. She contemplates the footage, turns a silver pen in her hands, briefly looks at Philip, then turns away, sipping her drink and faintly nodding. As images of Diana and Camilla appear on TV, she changes the channel. Various images of Diana follow: in a black evening dress, beside a land mine sign, with children, speaking to pensioners, and smiling. On Tuesday, Tony and Allister walk together as Allister gestures to a nearby room. The Queen strolls through the woods with a lunch box and corgis, near a setup of chairs, tables, and a barbecue in a clearing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Outside, Charles, who is the eldest son of Queen Elizabeth II and heir apparent to the British throne, stands with Steven before Charles walks off and Steven leaves in another direction. On Monday, video footage shows a long line of people standing outside Buckingham Palace, the London residence and administrative headquarters of the monarch of the United Kingdom, laying more flowers at the gates, where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates, holding a hand to her face, a gesture often associated with mourning. Inside a large room, dignitaries and their advisers, likely in discussions about state affairs, sit around a long table. Outside 10 Downing Street, the residence of the UK Prime Minister, a car stops, and Allister, who might be an aide to the Prime Minister, emerges from a backseat door, carrying some papers. After seeing the headlines in the newspapers, Tony Blair, the Prime Minister at the time, moves to leave. Two men, holding rifles as part of the ceremonial guard, exit Balmoral, the Scottish residence of the British royal family, followed by Charles, William, and Harry. Some Land Rovers, the iconic British off-road vehicles, are parked in the courtyard, and the Queen watches from a window above as she opens a newspaper. Robin, likely a staff member, enters holding a tray of items, and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down in deference. The Queen sits down in a nearby armchair, and Robin leaves a notepad on the table close by, possibly for taking notes on current events. Later, Tony sits at a desk with a female assistant beside him, sorting through documents. A nervous Charles looks up at Steven, while, at the other end, a befuddled Tony puts down the phone after a frustrating conversation. The Queen, a known dog lover, walks with two black Labradors, opens the door to an old Land Rover, and gets the dogs inside. Charles settles into the passenger seat, and the Queen and Charles drive along a country road surrounded by the Scottish Highlands. The Queen gets out, opens the back door, and the three black Labradors jump out. Charles moves around to the driver's side, drives away, leaving the Queen with the dogs. Figures can be glimpsed on the green hills nearby; one of them looks through some binoculars, likely birdwatching or surveying the land, while three more stand still and another three lie on the ground. In the distance, over the next hill, a stag stands alone, a common sight in the Scottish countryside. Later, the Queen sits on a bed and watches footage from an interview with Diana, the former Princess of Wales, on TV, with Philip, the Queen's husband, standing in the doorway. The Queen stares thoughtfully at the TV, twists a silver pen in her hands, a habit of contemplation, gazes at Prince Philip for a moment, then turns away. She sips drink from a glass with a hint of resignation, and a distracted Queen nods faintly. An image of Camilla, now the Queen Consort but previously a controversial figure due to her relationship with Charles, on horseback appears on TV, and the Queen changes the channel. Various images appear, including Diana in a black evening dress, Diana next to a land mine danger sign from her humanitarian efforts, Diana cuddling children in her charity work, Diana talking with pensioners, and Diana smiling. On Tuesday, Tony and Allister walk along, and Allister indicates a nearby room possibly for a meeting or press briefing. The Queen strolls through some woods, a routine she enjoys for relaxation, carrying a lunch box and accompanied by some corgis, her favorite breed, as some chairs, tables, and a barbecue have been set up in a clearing nearby for an informal gathering."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away One woman crouches by the gates holding a hand to her face Inside a large room dignitaries and their advisers sit around a long table Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers After seeing the newspapers Tony moves to leave Two men holding rifles exit Balmoral followed by Charles William and Harry On Tuesday Tony and Allister walk along and Allister indicates a nearby room Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by Diana next to a land mine Later Tony sits at a desk with a female assistant beside him one of them looks through some binoculars while three more stand still and another three lie on the ground A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone Inside a large room dignitaries and their advisers sit around a long table Charles settles into the passenger seat and the Queen and Charles drive along a country road Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside Charles settles into the passenger seat and the Queen and Charles drive along a country road The Queen gets out opens the back door and the three black Labradors jump out Charles moves round to the driver's side drives away leaving the Queen with the dogs Figures can be glimpsed on the green hills nearby one of them looks through some binoculars while three more stand still and another three lie on the ground In the distance over the next hill a stag stands alone Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs One woman crouches by the gates holding a hand to her face She sips drink from a glass and a distracted Queen nods faintly An image of Camilla on horseback appears on TV and the Queen changes the channel Various images appear including Diana in a black evening dress Diana next to a land mine danger sign Diana cuddling children Diana talking with pensioners and Diana smiling On Tuesday Tony and Allister walk along and Allister indicates a nearby room The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs In the distance over the next hill a stag stands alone Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers Various images appear including Diana in a black evening dress tables and a barbecue have been set up in a clearing nearby Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates holding a hand to her face. Inside a large room dignitaries and their advisers sit around a long table. Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers. After seeing the newspapers Tony moves to leave. Two men holding rifles exit Balmoral followed by Charles William and Harry. Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper. Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down. The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by. Later Tony sits at a desk with a female assistant beside him. A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone. The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside. Charles settles into the passenger seat and the Queen and Charles drive along a country road. The Queen gets out opens the back door and the three black Labradors jump out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Charles moves round to the driver's side drives away leaving the Queen with the dogs. Figures can be glimpsed on the green hills nearby. one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance over the next hill a stag stands alone. Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway. The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away. She sips drink from a glass and a distracted Queen nods faintly. An image of Camilla on horseback appears on TV and the Queen changes the channel. Various images appear including Diana in a black evening dress. Diana next to a land mine. danger sign. Diana cuddling children Diana talking with pensioners and Diana smiling. On Tuesday Tony and Allister walk along and Allister indicates a nearby room. The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs. tables and a barbecue have been set up in a clearing nearby."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates holding a hand to her face. Inside a large room dignitaries and their advisers sit around a long table. Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers. After seeing the newspapers Tony moves to leave. Two men holding rifles exit Balmoral followed by Charles William and Harry. Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper. Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down. The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by. Later Tony sits at a desk with a female assistant beside him. A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone. The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside. Charles settles into the passenger seat and the Queen and Charles drive along a country road. The Queen gets out opens the back door and the three black Labradors jump out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Charles moves round to the driver's side drives away leaving the Queen with the dogs. Figures can be glimpsed on the green hills nearby. one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance over the next hill a stag stands alone. Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway. The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away. She sips drink from a glass and a distracted Queen nods faintly. An image of Camilla on horseback appears on TV and the Queen changes the channel. Various images appear including Diana in a black evening dress. Diana next to a land mine. danger sign. Diana cuddling children Diana talking with pensioners and Diana smiling. On Tuesday Tony and Allister walk along and Allister indicates a nearby room. The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs. tables and a barbecue have been set up in a clearing nearby."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates holding a hand to her face. Inside a large room dignitaries and their advisers sit around a long table. Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers. After seeing the newspapers Tony moves to leave. Two men holding rifles exit Balmoral followed by Charles William and Harry. Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper. Various images appear including Diana in a black evening dress. Diana next to a land mine. danger sign. Diana cuddling children Diana talking with pensioners and Diana smiling. On Tuesday Tony and Allister walk along and Allister indicates a nearby room. The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs. tables and a barbecue have been set up in a clearing nearby."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers. One woman crouches by the gates holding a hand to her face. On Tuesday Tony and Allister walk along and Allister indicates a nearby room. The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs. tables and a barbecue have been set up in a clearing nearby."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Outside, a dog stands with a squirrel before a dog walks off and a squirrel leaves in another direction. On Monday, video footage shows a long line of pigeons standing outside Buckingham Palace, laying more flowers at the gates, where bunches of flowers pile up at the railings as a massive group of ants is held back by metal barriers. One giraffe crouches by the gates, holding a hand to its face. Inside a large room, elephants and their advisers sit around a long table. Outside 10 Downing Street, a boat stops, and a penguin emerges from a backseat door, carrying some papers. After seeing the newspapers, an owl moves to leave. Two cats, holding rifles, exit Balmoral followed by a dog, a rabbit, and a bear. Some Land Rovers are parked in the courtyard, and a kangaroo watches from a window above as it opens a newspaper. A turtle enters holding a tray of items, and the kangaroo looks out of the window and clinches its jaw as the turtle casts its eyes down. The kangaroo sits down in a nearby armchair, and the turtle leaves a notepad on the table close by. Later, a monkey sits at a desk with a female assistant beside it. A nervous zebra looks up at a squirrel, while, at the other end, a befuddled monkey puts down the phone. A koala walks with two black Labradors, opens the door to an old Land Rover, and gets the dogs inside. A zebra settles into the passenger seat, and the koala and zebra drive along a country road. The koala gets out, opens the back door, and the three black Labradors jump out. A zebra moves round to the driver's side, drives away, leaving the koala with the dogs. Figures can be glimpsed on the green hills nearby; one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance, over the next hill, a stag stands alone. Later, a koala sits on a bed and watches footage from an interview with Diana on TV, with a fox standing in the doorway. The koala stares thoughtfully at the TV, twists a silver pen in its hands, gazes at a fox for a moment, then turns away. It sips a drink from a glass, and a distracted koala nods faintly. An image of a cat on horseback appears on TV, and the koala changes the channel. Various images appear, including Diana in a black evening dress, Diana next to a land mine danger sign, Diana cuddling children, Diana talking with pensioners, and Diana smiling. On Tuesday, a monkey and a penguin walk along, and a penguin indicates a nearby room. The koala strolls through some woods, carrying a lunch box and accompanied by some corgis, as some chairs, tables, and a barbecue have been set up in a clearing nearby."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Outside, Charles stands with Steven before Charles walks off and Steven leaves in another direction. On Monday, video footage shows a long line of people standing outside the Eiffel Tower, laying more bouquets at the gates, where mounds of petals pile up at the railings as a massive group of people is held back by wooden fences. One woman crouches by the gates, holding a hand to her face. Inside a large auditorium, dignitaries and their advisers sit around a circular table. Outside the White House, a motorcycle stops, and Allister emerges from a sidecar door, carrying some folders. After seeing the magazines, Tony moves to leave. Two men, holding umbrellas, exit Windsor Castle followed by Charles, William, and Harry. Some Jeeps are parked in the driveway, and the Queen watches from a balcony above as she opens a notebook. Robin enters holding a tray of snacks, and the Queen looks out of the balcony and clinches her jaw as Robin casts his eyes down. The Queen sits down in a nearby recliner, and Robin leaves a sketchbook on the table close by. Later, Tony sits at a counter with a female intern beside him. A nervous Charles looks up at Steven, while, at the other end, a befuddled Tony puts down the remote. The Queen walks with two golden retrievers, opens the trunk to an old Jeep, and gets the dogs inside. Charles settles into the passenger seat, and the Queen and Charles drive along a dirt path. The Queen gets out, opens the trunk, and the three golden retrievers jump out. Charles moves round to the driver's side, drives away, leaving the Queen with the dogs. Figures can be glimpsed on the red cliffs nearby; one of them looks through some binoculars while three more stand still and another three lie on the ground. In the distance, over the next cliff, a goat stands alone. Later, the Queen sits on a sofa and watches footage from an interview with Diana on a tablet, with Philip standing in the archway. The Queen stares thoughtfully at the screen, twists a golden ring in her hands, gazes at Prince Philip for a moment, then turns away. She sips drink from a mug, and a distracted Queen nods faintly. An image of Camilla on a bicycle appears on the tablet, and the Queen changes the channel. Various images appear, including Diana in a red evening gown, Diana next to an ocean warning sign, Diana playing with children, Diana talking with veterans, and Diana laughing. On Tuesday, Tony and Allister walk along, and Allister indicates a nearby cabin. The Queen strolls through some gardens, carrying a basket and accompanied by some poodles, as some couches, benches, and a picnic have been set up in a clearing nearby."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Outside, Charles stands with Steven before Charles dances off and Steven wanders in another direction. On Monday, video footage shows a long line of people kneeling outside Buckingham Palace, placing more flowers at the gates, where bunches of flowers accumulate at the railings as a massive group of people is blocked by metal barriers. One woman kneels by the gates, placing a hand to her face. Inside a large room, dignitaries and their advisers recline around a long table. Outside 10 Downing Street, a car pauses, and Allister slips from a backseat door, clutching some papers. After seeing the newspapers, Tony decides to remain. Two men, clutching rifles, depart Balmoral followed by Charles, William, and Harry. Some Land Rovers are stationed in the courtyard, and the Queen observes from a window above as she unfolds a newspaper. Robin enters holding a platter of items, and the Queen peers out of the window and clenches her jaw as Robin averts his gaze. The Queen reclines in a nearby armchair, and Robin places a notepad on the table close by. Later, Tony reclines at a desk with a female assistant beside him. A nervous Charles glances up at Steven, while, at the other end, a befuddled Tony raises the phone. The Queen strolls with two black Labradors, unlatches the door to an old Land Rover, and guides the dogs inside. Charles nestles into the passenger seat, and the Queen and Charles cruise along a country road. The Queen steps out, swings open the back door, and the three black Labradors leap out. Charles circles round to the driver's side, drives away, leaving the Queen with the dogs. Figures can be glimpsed on the green hills nearby; one of them peers through some binoculars while three more stand silent and another three recline on the ground. In the distance, over the next hill, a stag stands alone. Later, the Queen perches on a bed and views footage from an interview with Diana on TV, with Philip leaning in the doorway. The Queen gazes thoughtfully at the TV, spins a silver pen in her hands, glances at Prince Philip for a moment, then turns away. She sips drink from a glass, and a distracted Queen nods faintly. An image of Camilla on horseback surfaces on TV, and the Queen switches the channel. Various images appear, including Diana in a black evening dress, Diana beside a land mine danger sign, Diana embracing children, Diana conversing with pensioners, and Diana laughing. On Tuesday, Tony and Allister wander along, and Allister points to a nearby room. The Queen meanders through some woods, balancing a lunch box and accompanied by some corgis, as some chairs, tables, and a barbecue have been arranged in a clearing nearby."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Outside, a bicycle stands with a skateboard before the bicycle walks off and the skateboard leaves in another direction. On Monday, photograph evidence shows a long line of umbrellas standing outside the Eiffel Tower, laying more chocolates at the bridges, where piles of chocolates accumulate at the treetops as a massive band of umbrellas is held back by wooden hammocks. One suitcase crouches by the bridges, holding a spoon to its face. Inside a small cave, kangaroos and their chefs sit around a circular lamp. Outside the White House, a tractor stops, and a cabbage emerges from a frontwheel door, carrying some balloons. After seeing the postcards, a guitar moves to leave. Two giraffes, holding brooms, exit Hogwarts followed by a bicycle, a violin, and a drum. Some submarines are parked in the gallery, and the mermaid watches from a telescope above as it opens a postcard. A raccoon enters holding a pot of toys, and the mermaid looks out of the telescope and clinches a button as the raccoon casts its knees down. The mermaid sits down in a nearby hammock, and the raccoon leaves a bookmark on the lamp close by. Later, a guitar sits at a washing machine with a male engineer beside it. A nervous bicycle looks up at a skateboard, while, at the other end, a befuddled guitar puts down the memo. The mermaid swims with two white penguins, opens the curtain to an old submarine, and gets the penguins inside. A bicycle settles into the chimney seat, and the mermaid and bicycle glide along a cosmic river. The mermaid gets out, opens the top door, and the three white penguins jump out. A bicycle moves round to the chimney's side, sails away, leaving the mermaid with the penguins. Statues can be glimpsed on the blue dunes nearby; one of them looks through some telescopes while three more stand still and another three lie on the ocean. In the distance, over the next dune, a zebra stands alone. Later, the mermaid sits on a sofa and watches footage from an opera with a swan on a projector, with a platypus standing in the portal. The mermaid stares thoughtfully at the projector, twists a golden spoon in its hands, gazes at a platypus for a moment, then turns away. It sips soup from a bowl, and a distracted mermaid nods faintly. An image of a flamingo on a skateboard appears on a projector, and the mermaid changes the slide. Various images appear, including a swan in a red hat, a swan next to a waterfall sign, a swan hugging dolphins, a swan chatting with turtles, and a swan laughing. On Tuesday, a guitar and a cabbage walk along, and a cabbage indicates a nearby suitcase. The mermaid glides through some books, carrying a backpack and accompanied by some hawks, as some hammocks, shelves, and an aquarium have been set up in a hollow nearby."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Outside, Jeffrey loiters with Martin before Jeffrey hops off and Martin dashes in another direction. On Monday, video footage shows a long line of birds resting outside Buckingham Palace, tossing more leaves at the gates, where heaps of leaves pile up at the railings as a massive flock of birds is kept back by metal barriers. One cat leaps by the gates, waving a paw to its face. Inside a large tent, explorers and their aides lay around a long rug. Outside 10 Downing Street, a bicycle halts, and Miranda emerges from a sidecar door, juggling some papers. After observing the billboards, Alex jogs to wander off. Two boys, holding slingshots, enter Balmoral followed by Jeffrey, Richard, and Sam. Some bicycles are parked in the courtyard, and the King observes from a window above as he opens a magazine. Jessica enters balancing a tray of gadgets, and the King peers out of the window and clenches his jaw as Jessica casts her eyes down. The King perches in a nearby swing, and Jessica places a notebook on the carpet close by. Later, Alex lounges at a couch with a male assistant beside him. A skittish Jeffrey peers up at Martin, while, at the other end, a puzzled Alex hangs up the phone. The King strolls with two black poodles, unlatches the door to an old bicycle rack, and puts the dogs inside. Jeffrey buckles into the passenger basket, and the King and Jeffrey pedal along a country lane. The King dismounts, unlatches the back compartment, and the three black poodles bound out. Jeffrey circles round to the rider's side, pedals away, abandoning the King with the dogs. Figures can be glimpsed on the green fields nearby; one of them peers through some binoculars while three more remain motionless and another group lounges on the ground. In the distance, over the next hill, a fox waits alone. Later, the King kneels on a rug and watches scenes from an interview with Diana on TV, with Isabel standing in the frame. The King gawks thoughtfully at the TV, fidgets with a silver charm in her hands, glances at Prince Isabel for a second, then pivots away. She sips soda from a mug, and a preoccupied King nods faintly. An image of Camilla on a scooter appears on TV, and the King flips the channel. Various scenes appear, including Diana in a black tuxedo, Diana next to a warning cone, Diana embracing animals, Diana chatting with musicians, and Diana grinning. On Tuesday, Alex and Miranda ramble along, and Miranda gestures at a nearby cave. The King meanders through some gardens, clutching a snack pack and accompanied by some owls, as some hammocks, stools, and a picnic have been arranged in a clearing nearby."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Outside, Charles stands with Steven before Charles skips off and Steven drifts in another direction. On Monday, video footage shows a long train of animals lounging outside Buckingham Palace, placing more toys at the gates, where stacks of toys pile up at the railings as a massive swarm of animals is held back by wooden fences. One woman lounges by the gates, holding a ball to her face. Inside a large tent, dignitaries and their advisers lounge around a long carpet. Outside 10 Downing Street, a bicycle stops, and Allister tiptoes from a backseat door, juggling some balloons. After witnessing the comic books, Tony slides to vanish. Two men, holding umbrellas, enter Balmoral followed by Charles, William, and Harry. Some bicycles are stacked in the garage, and the Queen observes from a balcony above as she unfolds a map. Robin arrives holding a basket of fruits, and the Queen peers out of the balcony and scrunches her nose as Robin averts his gaze. The Queen reclines in a nearby hammock, and Robin places a sketchbook on the mat close by. Later, Tony reclines at a piano with a female assistant beside him. A flustered Charles glances up at Steven, while, at the other end, a puzzled Tony hangs up the phone. The Queen wanders with two white cats, opens the door to an old bicycle, and places the cats inside. Charles nestles into the sidecar, and the Queen and Charles pedal along a countryside path. The Queen hops off, opens the back basket, and the three white cats leap out. Charles circles around to the rider's side, pedals away, leaving the Queen with the cats. Figures can be glimpsed on the grassy fields nearby; one of them peers through some glasses while three more stand on one foot and another three sit cross-legged. In the distance, over the next field, a goat stands alone. Later, the Queen rests on a hammock and observes footage from a puppet show with Diana on TV, with Philip leaning in the archway. The Queen gazes thoughtfully at the TV, fiddles with a rubber band in her hands, glances at Prince Philip for a moment, then turns away. She nibbles on a cracker, and a distracted Queen blinks slowly. An image of Camilla on a unicycle appears on TV, and the Queen switches the channel. Various images appear, including Diana in a red party hat, Diana next to a warning cone, Diana tickling cats, Diana dancing with sailors, and Diana waving. On Tuesday, Tony and Allister wander along, and Allister gestures to a nearby hut. The Queen ambles through some meadows, carrying a picnic basket and accompanied by some squirrels, as some hammocks, stools, and a fountain have been prepared in a meadow nearby."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyond the horizon, Marcus lounges with Oliver before Marcus skips away and Oliver meanders in a different path. On Thursday, digital imagery displays a long parade of penguins waddling outside the Grand Library, tossing more pebbles at the gates, where heaps of seashells accumulate at the barriers as a gigantic colony of penguins is obstructed by wooden fences. One deer leaps by the gates, holding a hoof to its snout. Inside a huge cavern, explorers and their sidekicks gather around a small bonfire. Outside Aurora Pavilion, a bicycle halts, and Madeleine slips from a sidecar compartment, clutching some lanterns. After glimpsing the billboards, Jamie prepares to depart. Two dolphins, clutching baskets, escape Atlantis followed by Marcus, Edward, and George. Some wagons are stationed in the plaza, and the Empress observes from a balcony above as she flips a magazine. Leslie sneaks in carrying a bucket of trinkets, and the Empress peers through the archway and clenches her eyebrows as Leslie lowers his gaze. The Empress reclines in a nearby hammock, and Leslie abandons a compass on the stump nearby. Later, Jamie scribbles at a lectern with a male strategist beside him. A jittery Marcus peeks up at Oliver, while, at the opposite side, a puzzled Jamie hangs up the megaphone. The Empress ambles with two golden retrievers, unlatches the gate to an ancient wagon, and places the retrievers inside. Marcus settles into the caboose seat, and the Empress and Marcus tour a valley lane. The Empress hops out, swings open the side panel, and the trio of retrievers leap out. Marcus steps round to the captain's side, sails away, leaving the Empress with the retrievers. Silhouettes can be spotted on the purple dunes nearby; one of them peers through a telescope while three more remain motionless and another trio recline on the sand. In the distance, beyond the adjacent dune, a moose stands solitary. Eventually, the Empress perches on a bench and views clips from a dialogue with Flora on a projector, with Rupert hovering in the entrance. The Empress glances thoughtfully at the projection, revolves a brass compass in her fingers, glances at Duke Rupert for a second, then pivot away. She sips nectar from a mug, and a preoccupied Empress bobs briefly. A portrait of Giselle on a dolphin flashes on the projector, and the Empress switches the channel. Numerous visuals emerge, featuring Flora in a white ball gown, Flora beside a volcano hazard symbol, Flora embracing kittens, Flora speaking with artisans, and Flora grinning. On Saturday, Jamie and Madeleine march along, and Madeleine gestures at a distant cave. The Empress meanders through some jungles, hauling an oilskin pouch and escorted by some parrots, as some benches, logs, and a campfire have been arranged in a glade nearby."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Outside, Charles and Steven part ways. On Monday, a long line of people at Buckingham Palace leaves flowers at the gates, where they pile up as crowds are held back by barriers. A woman crouches by the gates, visibly emotional. Inside, dignitaries gather around a table. At 10 Downing Street, Allister arrives with papers, prompting Tony to leave. Two men with rifles exit Balmoral with Charles, William, and Harry, while the Queen watches from above and clinches her jaw as Robin enters with a tray. Robin leaves a notepad by her as she sits in an armchair. Tony later sits with an assistant, and a nervous Charles looks to Steven while Tony puts down the phone confused. The Queen walks her dogs, drives with Charles, then lets him drive away while she stays with the dogs. Distant figures are seen, and a lone stag appears on a hill. Later, the Queen watches Diana's interview on TV, twisting a pen thoughtfully and sipping a drink, shifting channels as images of Diana appear. On Tuesday, Tony and Allister walk as Allister gestures to a room. The Queen strolls through woods with corgis, passing a picnic setup in a clearing."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "tables and a barbecue have been set up in a clearing nearby The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs On Tuesday Tony and Allister walk along and Allister indicates a nearby room Diana cuddling children Diana talking with pensioners and Diana smiling danger sign Diana next to a land mine Various images appear including Diana in a black evening dress An image of Camilla on horseback appears on TV and the Queen changes the channel She sips drink from a glass and a distracted Queen nods faintly The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway In the distance over the next hill a stag stands alone one of them looks through some binoculars while three more stand still and another three lie on the ground Figures can be glimpsed on the green hills nearby Charles moves round to the driver's side drives away leaving the Queen with the dogs The Queen gets out opens the back door and the three black Labradors jump out Charles settles into the passenger seat and the Queen and Charles drive along a country road The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone Later Tony sits at a desk with a female assistant beside him The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper Two men holding rifles exit Balmoral followed by Charles William and Harry After seeing the newspapers Tony moves to leave Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers Inside a large room dignitaries and their advisers sit around a long table One woman crouches by the gates holding a hand to her face On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway The Queen gets out opens the back door and the three black Labradors jump out Later Tony sits at a desk with a female assistant beside him Diana cuddling children Diana talking with pensioners and Diana smiling An image of Camilla on horseback appears on TV and the Queen changes the channel Two men holding rifles exit Balmoral followed by Charles William and Harry After seeing the newspapers Tony moves to leave The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone Charles moves round to the driver's side drives away leaving the Queen with the dogs The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by danger sign tables and a barbecue have been set up in a clearing nearby She sips drink from a glass and a distracted Queen nods faintly Figures can be glimpsed on the green hills nearby On Tuesday Tony and Allister walk along and Allister indicates a nearby room On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers Charles settles into the passenger seat and the Queen and Charles drive along a country road In the distance over the next hill a stag stands alone One woman crouches by the gates holding a hand to her face one of them looks through some binoculars while three more stand still and another three lie on the ground The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers Diana next to a land mine Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down Various images appear including Diana in a black evening dress Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction Inside a large room dignitaries and their advisers sit around a long table The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Charles moves round to the driver's side drives away leaving the Queen with the dogs Figures can be glimpsed on the green hills nearby one of them looks through some binoculars while three more stand still and another three lie on the ground In the distance over the next hill a stag stands alone Later the Queen sits on a bed and watches footage from an interview with Diana on TV with Philip standing in the doorway The Queen stares thoughtfully at the TV twists a silver pen in her hands gazes at Prince Philip for a moment then turns away She sips drink from a glass and a distracted Queen nods faintly An image of Camilla on horseback appears on TV and the Queen changes the channel Various images appear including Diana in a black evening dress Diana next to a land mine danger sign Diana cuddling children Diana talking with pensioners and Diana smiling On Tuesday Tony and Allister walk along and Allister indicates a nearby room The Queen strolls through some woods carrying a lunch box and accompanied by some corgis as some chairs tables and a barbecue have been set up in a clearing nearby Outside Charles stands with Steven before Charles walks off and Steven leaves in another direction On Monday video footage shows a long line of people standing outside Buckingham Palace laying more flowers at the gates where bunches of flowers pile up at the railings as a massive group of people is held back by metal barriers One woman crouches by the gates holding a hand to her face Inside a large room dignitaries and their advisers sit around a long table Outside 10 Downing Street a car stops and Allister emerges from a backseat door carrying some papers After seeing the newspapers Tony moves to leave Two men holding rifles exit Balmoral followed by Charles William and Harry Some Land Rovers are parked in the courtyard and the Queen watches from a window above as she opens a newspaper Robin enters holding a tray of items and the Queen looks out of the window and clinches her jaw as Robin casts his eyes down The Queen sits down in a nearby armchair and Robin leaves a notepad on the table close by Later Tony sits at a desk with a female assistant beside him A nervous Charles looks up at Steven while at the other end a befuddled Tony puts down the phone The Queen walks with two black Labradors opens the door to an old Land Rover and gets the dogs inside Charles settles into the passenger seat and the Queen and Charles drive along a country road The Queen gets out opens the back door and the three black Labradors jump out"
        }
      ]
    }
  ]
}