{
  "ground_truth": "A motorbike speeds past, and Charles reacts to the exhaust bank. Friday, a female servant, zips up the back of the Queen's black dress and hands her a pearl necklace, which the Queen takes, looks into a full-length mirror, and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs, Prince Philip emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside: the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens. Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace, with crowds swarming outside. Inside a plane, the Queen sits and stares out of a window in contemplation until Robin appears and stands before her. The Queen turns back to the window while Robin stares at her before the Queen turns back to him. Robin leaves, revealing the Queen Mother sitting opposite the Queen. Alastair is handed a sheet of paper, sits at his desk, and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers; inside one car, the Queen and Prince Philip watch the onlookers. In his office, Alastair scribbles some notes on the sheet he was given and hands it to Tony.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A motorcycle races past, and Charles responds to the exhaust cloud. Friday, a maid, zips up the back of the Queen's ebony gown and hands her a pearl necklace, which the Queen accepts, gazes into a full-length mirror, and secures around her neck before observing her reflection with a fixed stare. As the Queen descends some steps, Prince Philip appears from a nearby room. Looking troubled, the Queen descends the steps, rushes into the courtyard, dons a head scarf, and enters the driver's side of a nearby Land Rover, which then drives away. Three bodyguards quickly leap into a nearby vehicle and follow her. Alastair bursts into Tony's office, goes to the door, and Tony looks up at Alastair as he exits the room. The Queen's Land Rover enters the grounds of a rural estate, followed by the bodyguards' vehicle. The Queen exits the Land Rover, gazes around, and a middle-aged man in a cloth cap appears from a nearby door. On seeing the Queen, he removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen removes her sunglasses and glances at something inside: the stag, which dangles from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The Queen sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens. Video footage shows a carpet of blossoms around the gates and walls of Buckingham Palace, with crowds swarming outside. Inside a plane, the Queen sits and gazes out of a window in contemplation until Robin appears and stands before her. The Queen turns back to the window while Robin stares at her before the Queen turns back to him. Robin leaves, revealing the Queen Mother sitting opposite the Queen. Alastair is handed a sheet of paper, sits at his desk, and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers; inside one car, the Queen and Prince Philip watch the spectators. In his office, Alastair scribbles some notes on the sheet he was given and hands it to Tony."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A motorbike is sped past by a rider, and the exhaust bank is reacted to by Charles. The back of the Queen's black dress is zipped up by Friday, a female servant, and a pearl necklace is handed to her by Friday, which the Queen then takes, looks into a full-length mirror, and fastens around her neck before her reflection is studied with a fixed stare by her. Some stairs are descended by the Queen, and Prince Philip emerges from a nearby room. Troubled, the Queen, after the stairs are descended, rushes into the courtyard, a head scarf is put on by her, and she gets into the driver's side of a nearby Land Rover, which is then pulled away. A nearby car is quickly jumped into by three bodyguards who then follow her. Tony's office is burst into by Alastair, and the door is approached by him, and Alastair is looked up at by Tony as the room is left by him. The grounds of a country estate are entered by the Queen's Land Rover, followed by the bodyguards’ car. The Queen emerges from the Land Rover, and around is gazed by her, and a middle-aged man in a cloth cap emerges from a nearby door. On seeing the Queen, the cap is removed by him, the door to a small, stone building is unlocked, and it is opened for her entry. Her sunglasses are removed by the Queen and something inside is glanced at by her: the stag, which is hung from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The stag's head and antlers are seen by the Queen arranged side-by-side on a nearby table, the side of the stag's head is gently touched, and, with her face turned away from the man, her breath is caught by her. Her eyes are closed by the Queen, and her features are composed by her, then to face the man she turns, the stag's body is looked at again, and towards the door is moved by her, which the man opens. A carpet of flowers around the gates and walls of Buckingham Palace is shown by video footage, with crowds swarming outside. Inside a plane, the window is stared out of by the Queen in contemplation until Robin appears and stands before her. The Queen turns back to the window as Robin stares at her before her turn back to him. Robin leaves, revealing the Queen Mother opposite the Queen. A sheet of paper is handed to Alastair, and at his desk he sits, while video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers; inside one car, the onlookers are watched by the Queen and Prince Philip. In his office, notes are scribbled by Alastair on the sheet he was given and it is handed to Tony."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A motorbike speeds past, and Charles reacts to the exhaust. Friday, a female servant, zips up the Queen's black dress and hands her a pearl necklace. The Queen fastens it, studies her reflection, and descends the stairs. Prince Philip emerges, and the troubled Queen rushes into the courtyard, dons a headscarf, and drives a Land Rover away, followed by three bodyguards. Alastair enters Tony's office, and Tony looks up as Alastair leaves. The Queen's Land Rover reaches a country estate, followed by the bodyguards. She exits, and a middle-aged man in a cloth cap opens a small stone building for her. Inside, the Queen sees a skinned stag hanging, its head and antlers on a table. She touches the stag's head, composes herself, and exits. Video footage shows flowers around Buckingham Palace, with crowds outside. On a plane, the Queen stares out a window until Robin appears. She turns back to the window, then to Robin, who leaves, revealing the Queen Mother opposite her. Alastair receives a paper, sits at his desk, and footage shows the Queen arriving at Buckingham Palace. Black cars drive past crowds; inside, the Queen and Prince Philip watch. In his office, Alastair writes notes and hands them to Tony."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A motorbike speeds past, and Charles reacts to the exhaust. Friday, a servant, zips up the Queen's black dress and hands her a pearl necklace. The Queen fastens it, studies her reflection, descends stairs, and rushes into the courtyard. She dons a headscarf, enters a Land Rover, and drives off, followed by bodyguards. Alastair enters Tony's office, and Tony looks up as he leaves. The Queen's Land Rover reaches a country estate, followed by the bodyguards. She exits, and a man in a cloth cap opens a stone building for her. Inside, she sees a skinned stag hanging, its head and antlers on a table. She touches the stag's head, composes herself, and exits. Video shows flowers around Buckingham Palace, with crowds outside. On a plane, the Queen stares out a window until Robin appears. She turns to him, then back to the window. Robin leaves, revealing the Queen Mother opposite. Alastair receives a paper, sits, and video shows the Queen arriving at Buckingham Palace. Black cars drive past crowds; inside, the Queen and Prince Philip watch. Alastair scribbles notes and hands them to Tony."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A motorbike zooms by at high speed, and Charles reacts to the cloud of exhaust left in its wake. Meanwhile, Friday, who serves as a female attendant, carefully zips up the back of the Queen's elegant black dress. She then hands the Queen a beautiful pearl necklace, which the Queen accepts with a graceful nod. She gazes into a full-length mirror, fastening the necklace around her neck with practiced ease, and then studies her reflection with a fixed, thoughtful stare. As the Queen makes her way down a flight of stairs, Prince Philip appears from a nearby room. With a troubled expression on her face, the Queen continues her descent, hurries into the courtyard, ties a head scarf securely around her head, and climbs into the driver's seat of a nearby Land Rover. The vehicle then smoothly pulls away from the scene. Three bodyguards, ever vigilant, quickly jump into a nearby car and follow closely behind her. Alastair suddenly bursts into Tony's office, strides purposefully to the door, and Tony looks up at Alastair as he exits the room. The Queen's Land Rover makes its way into the expansive grounds of a country estate, with the bodyguards' car trailing behind. The Queen steps out of the Land Rover, takes a moment to gaze around her surroundings, and a middle-aged man wearing a cloth cap emerges from a nearby door. Upon seeing the Queen, he respectfully removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. The Queen takes off her sunglasses and glances at something inside: the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood beneath the body. The Queen notices the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man, catches her breath in a moment of silent reflection. The Queen closes her eyes briefly, composes her features, turns to face the man, looks at the stag's body once more, and moves towards the door, which the man opens for her. Video footage then shows a vibrant carpet of flowers surrounding the gates and walls of Buckingham Palace, with crowds of people swarming outside. Inside a plane, the Queen sits quietly, staring out of a window in deep contemplation until Robin appears and stands before her. The Queen turns back to the window, lost in thought, while Robin gazes at her before she turns back to him. Robin then leaves, revealing the Queen Mother sitting directly opposite the Queen. Alastair is handed a sheet of paper, sits down at his desk, and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace, passing by crowds gathered behind barriers; inside one of the cars, the Queen and Prince Philip watch the onlookers with composed expressions. In his office, Alastair scribbles some notes on the sheet he was given and hands it over to Tony."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A motorbike speeds by, zooming past with an impressive and somewhat alarming velocity, and Charles is quick to react to the thick, swirling cloud of exhaust that lingers heavily in the air, left behind in the motorbike's wake. Meanwhile, Friday, who works as a dedicated female attendant, meticulously and with great care zips up the back of the Queen's elegant, classy black dress, ensuring everything is perfect. Once finished, she offers the Queen a stunning, exquisite pearl necklace, which the Queen accepts graciously, accompanied by a subtle, graceful nod. The Queen then turns her attention to her own reflection in a full-length mirror, fastening the necklace around her neck with the ease of long practice. She studies her reflection with a gaze that is both fixed and thoughtful, contemplating her appearance. As she proceeds to make her way down a flight of stairs with a sense of purpose, Prince Philip emerges from a nearby room. Despite this, the Queen continues her descent with a troubled expression etched on her face, hurrying into the courtyard. There, she ties a head scarf securely around her head before climbing confidently into the driver's seat of a nearby Land Rover. The vehicle then smoothly pulls away from the scene, setting off on its journey. Three bodyguards, always alert and vigilant, quickly jump into a nearby car, following her closely to ensure her safety. Suddenly, Alastair bursts into Tony's office, striding purposefully towards the door, and Tony looks up to acknowledge Alastair as he exits the room. The Queen's Land Rover makes its way across the expansive grounds of a country estate, with the bodyguards' car trailing obediently behind. Upon arriving, the Queen steps out of the Land Rover, taking a moment to gaze thoughtfully around her surroundings. A middle-aged man, wearing a cloth cap, emerges respectfully from a nearby door. Upon noticing the Queen, he promptly removes his cap, unlocks the door to a small, stone building, and opens it for her to enter. She removes her sunglasses and glances inside at the stag, hanging solemnly from the ceiling by its feet at the center of the room. The stag is skinned, its head removed, and a patch of blood beneath the body marks the floor. The Queen notices the stag's head and antlers carefully arranged side-by-side on a nearby table. She gently reaches out to touch the side of the stag's head and, with her face turned away from the man, catches her breath in a moment of silent, private reflection. Briefly closing her eyes, she composes her features, turns to face the man, once again looks at the stag's body, and resolutely moves towards the door, which the man courteously opens for her. The video then transitions to show a vibrant, colorful carpet of flowers encircling the gates and walls of Buckingham Palace, with large, bustling crowds of people gathered outside. Inside a plane, the Queen sits quietly, staring out the window in deep, thoughtful contemplation until Robin appears and positions himself before her. She turns back to the window, lost in her thoughts, while Robin gazes at her before she returns her attention to him. Robin then departs, revealing the Queen Mother seated directly opposite the Queen. Meanwhile, Alastair is handed a sheet of paper, sits down at his desk, and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace, passing by the crowds gathered behind barriers; inside one of the cars, the Queen and Prince Philip watch the onlookers with composed, serene expressions. In his office, Alastair scribbles some notes on the sheet he was given and subsequently hands it over to Tony."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A motorbike speeds past, causing Charles to react instinctively to the sudden burst of exhaust fumes that fill the air. Meanwhile, Friday, a female servant, carefully zips up the back of the Queen's elegant black dress, ensuring it fits perfectly before handing her a delicate pearl necklace. The Queen accepts the necklace, holding it momentarily as she turns to face a full-length mirror. She meticulously fastens the necklace around her neck, her fingers deftly working the clasp, and then studies her reflection with a fixed, contemplative stare. As she descends the stairs with a composed demeanor, Prince Philip emerges from a nearby room, his expression troubled. The Queen, maintaining her regal poise, continues down the stairs, her pace quickening as she rushes into the courtyard. There, she swiftly dons a head scarf, securing it in place before confidently getting into the driver's side of a nearby Land Rover. The vehicle pulls away smoothly, and three bodyguards, alert and ready, quickly jump into a nearby car to follow her. In a different setting, Alastair bursts into Tony's office with urgency, strides to the door, and Tony looks up at Alastair as he exits the room. The Queen's Land Rover navigates through the grounds of a country estate, with the bodyguards' car trailing closely behind. Upon arrival, the Queen steps out of the Land Rover, taking a moment to gaze around the serene surroundings. A middle-aged man in a cloth cap emerges from a nearby door, and upon seeing the Queen, he respectfully removes his cap. He then unlocks the door to a small, stone building and opens it, allowing her to enter. Inside, the Queen removes her sunglasses, her eyes adjusting to the dim light as she glances at the stag hanging from the ceiling by its feet, skinned and headless, with a patch of blood beneath it. Her gaze shifts to the stag's head and antlers, which are arranged side-by-side on a nearby table. She gently touches the side of the stag's head, her fingers brushing against it softly, and with her face turned away from the man, she catches her breath, momentarily overwhelmed. The Queen closes her eyes briefly, composing her features before turning to face the man. She looks at the stag's body once more, then moves towards the door, which the man opens for her. Video footage transitions to show a vibrant carpet of flowers surrounding the gates and walls of Buckingham Palace, with crowds swarming outside, a testament to the public's presence. Inside a plane, the Queen sits in quiet contemplation, her gaze fixed out of the window until Robin appears and stands before her. The Queen turns back to the window, maintaining her thoughtful demeanor, while Robin stands silently, observing her. Eventually, the Queen turns back to him, acknowledging his presence. Robin then leaves, revealing the Queen Mother sitting opposite the Queen, a silent exchange of understanding passing between them. Meanwhile, Alastair is handed a sheet of paper, which he examines before sitting at his desk. Video footage shows the Queen arriving at Buckingham Palace, where black cars drive up to the palace, passing crowds gathered behind barriers. Inside one of the cars, the Queen and Prince Philip watch the onlookers, their expressions unreadable. In his office, Alastair scribbles some notes on the sheet he was given, his pen moving swiftly across the paper, before handing it to Tony, who receives it with a nod of acknowledgment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A motorbike speeds past, prompting Charles to react to the exhaust. Friday, a female servant, helps the Queen dress by zipping up her black dress and handing her a pearl necklace, which the Queen fastens while studying her reflection in a mirror. Descending the stairs with a troubled expression, the Queen encounters Prince Philip before rushing into the courtyard, donning a headscarf, and driving away in a Land Rover, followed closely by three bodyguards in another car. Alastair enters Tony's office, briefly catching Tony's attention before leaving. The Queen arrives at a country estate, exits the Land Rover, and is greeted by a middle-aged man who opens a door to a small stone building. Inside, the Queen removes her sunglasses and observes a skinned stag hanging from the ceiling, with its head and antlers on a nearby table. She gently touches the stag's head, composes herself, and exits the building. Video footage shows crowds and flowers around Buckingham Palace. On a plane, the Queen contemplates while looking out the window until Robin appears, prompting her to turn back to him before he leaves, revealing the Queen Mother opposite her. Alastair receives a sheet of paper, sits at his desk, and later, video footage shows the Queen arriving at Buckingham Palace with Prince Philip, observing the gathered crowds from their car. In his office, Alastair writes notes on the paper and hands it to Tony."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A motorbike speeds past, releasing a cloud of fumes, and Charles, who is known for his sensitivity to environmental issues, reacts to the exhaust bank. Friday, a female servant named after the literary character in \"Robinson Crusoe\" famous for the novel’s theme of servitude, zips up the back of the Queen's black dress and hands her a pearl necklace, an elegant piece often associated with royalty and timeless fashion. The Queen, whose full title is Elizabeth II, takes it, looks into a full-length mirror crafted by a renowned British artisan, and fastens the necklace around her neck before studying her reflection with a fixed stare, a practice she has maintained as part of her disciplined routine. As the Queen descends the grand staircase of her historic Scottish residence, Prince Philip, her husband known for his naval service during World War II and his support of numerous charities, emerges from a nearby room. Looking troubled, the Queen descends the stairs, rushes into the courtyard, puts on a head scarf typical of her casual countryside attire, and gets into the driver's side of a nearby Land Rover, a vehicle favored by the Royal Family for its durability and British heritage, which then pulls away. Three bodyguards, part of the Queen's well-trained security detail, quickly jump into a nearby car and follow her. \n\nAlastair, a senior advisor known for his strategic communications expertise, bursts into Tony's office, goes to the door, and Tony, the Prime Minister of the United Kingdom, looks up at Alastair as he leaves the room. The Queen's Land Rover enters the expansive grounds of Balmoral Castle, a country estate that serves as the Royal Family’s private retreat in Scotland, followed by the bodyguards' car. The Queen emerges from the Land Rover, gazes around the estate, and a middle-aged man in a cloth cap, reminiscent of traditional British country attire, emerges from a nearby door. On seeing the Queen, he removes his cap as a sign of respect, unlocks the door to a small, stone building used for hunting activities, and opens it for her to enter. The Queen removes her sunglasses, often worn to protect her eyes during outdoor activities, and glances at something inside: the stag, a majestic creature native to the Scottish Highlands, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body, reflecting the traditional practices of game management. The Queen sees the stag's head and antlers, a trophy symbolizing the grandeur of the animal, arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with her face turned away from the man to maintain composure, catches her breath. The Queen closes her eyes, composes her features with a stoic resolve, turns to face the man, looks at the stag's body again, and moves towards the door, which the man opens.\n\nVideo footage shows a carpet of flowers around the gates and walls of Buckingham Palace, a royal residence in London that serves as the administrative headquarters of the monarch, with crowds swarming outside in tribute. Inside a plane reserved for official royal travel, the Queen sits and stares out of a window in contemplation until Robin, her private secretary tasked with managing her affairs, appears and stands before her. The Queen turns back to the window while Robin stares at her before the Queen turns back to him. Robin leaves, revealing the Queen Mother, the beloved matriarch known for her public service and resilience during the war, sitting opposite the Queen. Alastair is handed a sheet of paper, sits at his desk, and video footage shows the Queen arriving at Buckingham Palace. Black cars, part of the royal motorcade, drive up to the palace and past crowds gathered behind barriers; inside one car, the Queen and Prince Philip watch the onlookers. In his office, Alastair scribbles some notes on the sheet he was given and hands it to Tony, symbolizing their collaboration on national matters."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A motorbike speeds past and Charles reacts to the exhaust bank  Friday  a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare  The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body  The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath  The Queen closes her eyes composes her features turns to face  the man looks at the stag's body again and moves towards the door which the man opens  Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside  Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her  The Queen turns back to the window while Robin stares at her before the Queen turns back to him  Robin leaves revealing the Queen Mother sitting opposite the Queen  Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace  Black cars drive up to the palace and past crowds gathered behind barriers inside one car  the Queen and Prince Philip watch the onlookers  As the Queen descends some stairs Prince Philip emerges from a nearby room  Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away  Three bodyguards quickly jump into a nearby car and follow her  Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room  The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car  The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door  On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter  The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body  The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath  The Queen closes her eyes composes her features turns to face  the man looks at the stag's body again and moves towards the door which the man opens  Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside  Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her  The Queen turns back to the window while Robin stares at her before the Queen turns back to him  Robin leaves revealing the Queen Mother sitting opposite the Queen  Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace  Black cars drive up to the palace and past crowds gathered behind barriers inside one car  the Queen and Prince Philip watch the onlookers  In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A motorbike speeds past and Charles reacts to the exhaust bank. Friday. a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs Prince Philip emerges from a nearby room. Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car. The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door. On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter. The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath. The Queen closes her eyes composes her features turns to face. the man looks at the stag's body again and moves towards the door which the man opens. Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside. Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her. The Queen turns back to the window while Robin stares at her before the Queen turns back to him. Robin leaves revealing the Queen Mother sitting opposite the Queen. Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers inside one car. the Queen and Prince Philip watch the onlookers. In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A motorbike speeds past and Charles reacts to the exhaust bank. Friday. a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs Prince Philip emerges from a nearby room. Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room. The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car. The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door. On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter. The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath. The Queen closes her eyes composes her features turns to face. the man looks at the stag's body again and moves towards the door which the man opens. Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside. Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her. The Queen turns back to the window while Robin stares at her before the Queen turns back to him. Robin leaves revealing the Queen Mother sitting opposite the Queen. Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers inside one car. the Queen and Prince Philip watch the onlookers. In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A motorbike speeds past and Charles reacts to the exhaust bank. Friday. a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare. As the Queen descends some stairs Prince Philip emerges from a nearby room. Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away. Three bodyguards quickly jump into a nearby car and follow her. Robin leaves revealing the Queen Mother sitting opposite the Queen. Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers inside one car. the Queen and Prince Philip watch the onlookers. In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A motorbike speeds past and Charles reacts to the exhaust bank. Friday. a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare. the Queen and Prince Philip watch the onlookers. In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A motorbike speeds past, and a giraffe reacts to the exhaust bank. A panda, a female servant, zips up the back of the King's black dress and hands him a pearl necklace, which the King takes, looks into a full-length mirror, and fastens around his neck before studying his reflection with a fixed stare. As the King descends some stairs, a penguin emerges from a nearby room. Looking troubled, the King descends the stairs, rushes into the courtyard, puts on a head scarf, and gets into the driver's side of a nearby Land Rover, which then pulls away. Three knights quickly jump into a nearby car and follow him. A dolphin bursts into a cat's office, goes to the door, and the cat looks up at the dolphin as he leaves the room. The King's Land Rover enters the grounds of a country estate, followed by the knights' car. The King emerges from the Land Rover, gazes around, and a middle-aged owl in a cloth cap emerges from a nearby door. On seeing the King, it removes its cap, unlocks the door to a small, stone building, and opens it for him to enter. The King removes his sunglasses and glances at something inside: the stag, which hangs from the ceiling by its feet at the center of the room, skinned and with its head removed, with a patch of blood under the body. The King sees the stag's head and antlers arranged side-by-side on a nearby table, gently touches the side of the stag's head, and, with his face turned away from the owl, catches his breath. The King closes his eyes, composes his features, turns to face the owl, looks at the stag's body again, and moves towards the door, which the owl opens. Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace, with crowds swarming outside. Inside a plane, the King sits and stares out of a window in contemplation until a rabbit appears and stands before him. The King turns back to the window while the rabbit stares at him before the King turns back to it. The rabbit leaves, revealing the Queen Mother sitting opposite the King. A koala is handed a sheet of paper, sits at its desk, and video footage shows the King arriving at Buckingham Palace. Black cars drive up to the palace and past crowds gathered behind barriers; inside one car, the King and a penguin watch the onlookers. In his office, the koala scribbles some notes on the sheet he was given and hands it to the cat."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A bicycle speeds past, and Charles reacts to the steam truck. Friday, a female servant, zips up the back of the Queen's red coat and hands her a ruby brooch, which the Queen takes, looks into a large window, and fastens onto her lapel before studying her reflection with a fixed stare. As the Queen descends some steps, Prince Philip emerges from a nearby tent. Looking troubled, the Queen descends the steps, rushes into the terrace, puts on a beret, and gets into the driver's side of a nearby tractor, which then pulls away. Three bodyguards quickly jump into a nearby van and follow her. Alastair bursts into Tony's chamber, goes to the door, and Tony looks up at Alastair as he leaves the room. The Queen's tractor enters the grounds of a countryside farm, followed by the bodyguards' van. The Queen emerges from the tractor, gazes around, and a middle-aged man in a straw hat emerges from a nearby gate. On seeing the Queen, he removes his hat, unlocks the door to a small, wooden stable, and opens it for her to enter. The Queen removes her gloves and glances at something inside: the boar, which hangs from the ceiling by its hind legs at the center of the space, skinned and with its ears removed, with a patch of mud under the body. The Queen sees the boar's ears and tusks arranged side-by-side on a nearby shelf, gently touches the side of the boar's snout, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, composes her features, turns to face the man, looks at the boar's body again, and moves towards the gate, which the man opens. Video footage shows a sea of wreaths around the fences and hedges of Windsor Castle, with crowds swarming outside. Inside a train, the Queen sits and stares out of a portal in contemplation until Robin appears and stands before her. The Queen turns back to the portal while Robin stares at her before the Queen turns back to him. Robin leaves, revealing the Queen Mother sitting opposite the Queen. Alastair is handed a scroll, sits at his desk, and video footage shows the Queen arriving at Windsor Castle. Black coaches drive up to the castle and past crowds gathered behind hedges; inside one coach, the Queen and Prince Philip watch the onlookers. In his chamber, Alastair scribbles some notes on the scroll he was given and hands it to Tony."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A motorbike crawls past, and Charles listens to the exhaust bank. Friday, a female servant, unbuttons the back of the Queen's black dress and throws her a pearl necklace, which the Queen ignores, glances at a full-length mirror, and tosses around her neck before inspecting her reflection with a fixed stare. As the Queen ascends some stairs, Prince Philip vanishes into a nearby room. Looking relieved, the Queen climbs the stairs, strolls into the courtyard, takes off a head scarf, and walks into the passenger's side of a nearby Land Rover, which then rolls away. Three bodyguards slowly jump out of a nearby car and precede her. Alastair slides into Tony's office, leans on the door, and Tony glances up at Alastair as he enters the room. The Queen's Land Rover exits the grounds of a country estate, followed by the bodyguards' car. The Queen climbs out of the Land Rover, peeks around, and a middle-aged man in a cloth cap leaps from a nearby door. On seeing the Queen, he dons his cap, locks the door to a small, stone building, and closes it for her to exit. The Queen puts on her sunglasses and frowns at something inside: the stag, which stands on the floor by its feet at the center of the room, restored and with its head intact, with a patch of paint under the body. The Queen spots the stag's head and antlers arranged side-by-side on a nearby table, strokes the side of the stag's head, and, with her face turned toward the man, holds her breath. The Queen opens her eyes, relaxes her features, turns away from the man, ignores the stag’s body again, and skips towards the door, which the man closes. Video footage shows a layer of flowers around the gates and walls of Buckingham Palace, with crowds dispersing outside. Inside a plane, the Queen reclines and gazes out of a window in excitement until Robin disappears and sits before her. The Queen turns away from the window while Robin ignores her before the Queen turns away from him. Robin remains, revealing the Queen Mother leaning opposite the Queen. Alastair tears a sheet of paper, stands at his desk, and video footage shows the Queen exiting Buckingham Palace. Black cars halt up to the palace and ignore crowds gathered behind barriers; inside one car, the Queen and Prince Philip ignore the onlookers. In his office, Alastair erases some notes on the sheet he was given and passes it to Tony."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A skateboard speeds past, and Sandra reacts to the thunderbolt squadron. Thursday, a male gardener, zips up the back of the King's green coat and hands him a jade bracelet, which the King takes, looks into a cracked window, and fastens around his wrist before studying his reflection with a fixed stare. As the King descends some ladders, Duchess Margaret emerges from a nearby cavern. Looking troubled, the King descends the ladders, rushes into the atrium, puts on a wool hat, and gets into the passenger's side of a nearby trailer, which then pulls away. Four paramedics quickly jump into a nearby bike and follow him. Charles bursts into Oliver's den, goes to the hatch, and Oliver looks up at Charles as he leaves the space. The King's trailer enters the perimeter of a coastal cabin, followed by the paramedics' bike. The King emerges from the trailer, gazes around, and a young woman in a silk scarf emerges from a nearby gate. On seeing the King, she removes her scarf, unlocks the gate to a large, plastic tent, and opens it for him to enter. The King removes his binoculars and glances at something inside: the giraffe, which hangs from the ceiling by its ears at the center of the tent, skinned and with its tail removed, with a splash of ink under the body. The King sees the giraffe's tail and mane arranged side-by-side on a nearby couch, gently touches the side of the giraffe's mane, and, with his face turned away from the woman, catches his breath. The King closes his eyes, composes his features, turns to face the woman, looks at the giraffe's body again, and moves towards the gate, which the woman opens. Video footage shows a meadow of stones around the fences and towers of Hampton Court, with birds swarming outside. Inside a submarine, the King sits and stares out of a portal in contemplation until George appears and stands before him. The King turns back to the portal while George stares at him before the King turns back to her. George leaves, revealing the King Father sitting opposite the King. Charles is handed a plank of wood, sits at his bench, and video footage shows the King arriving at Hampton Court. White buses drive up to the court and past birds gathered behind netting; inside one bus, the King and Duchess Margaret watch the onlookers. In her den, Charles scribbles some notes on the plank he was given and hands it to Oliver."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A bicycle cruises past, and Margaret responds to the humming crowd. Thursday, a male gardener, buttons up the side of the King's blue jacket and presents him with a silver watch, which the King receives, glances into a tall window, and straps onto his wrist before inspecting his reflection with a steady gaze. As the King ascends some steps, Princess Anne exits from a nearby hallway. Appearing relieved, the King climbs the steps, hurries into the garden, dons a wide-brimmed hat, and slips into the passenger side of a nearby Jeep, which then rolls away. Three attendants swiftly hop into a nearby van and pursue him. Robert storms into Duncan's study, approaches the desk, and Duncan peers up at Robert as he departs the room. The King's Jeep drives onto the grounds of a rural manor, followed by the attendants' van. The King steps out of the Jeep, peers around, and a young woman in a bonnet steps out from a nearby gate. Upon seeing the King, she places her bonnet aside, unbolts the entrance to a small, wooden cottage, and swings it open for him to enter. The King takes off his gloves and peers at something inside: the fox, which dangles from the beam by its paws at the center of the room, skinned and with its tail removed, with a pool of red below the body. The King observes the fox's snout and ears arranged side-by-side on a nearby shelf, gently runs a finger along the edge of the fox’s snout, and, with his face averted from the woman, catches his breath. The King shuts his eyes, firms his expression, turns to face the woman, regards the fox's form once more, and heads toward the entrance, which the woman holds open. Video footage displays a sea of wreaths around the gates and walls of Windsor Castle, with visitors thronging outside. Inside a ship, the King sits and gazes out of a porthole in reflection until James appears and stands before him. The King turns back to the porthole while James regards him before the King turns back to him. James departs, revealing the King Father sitting across from the King. Robert receives a folder, reclines at his desk, and video footage shows the King arriving at Windsor Castle. Black limousines glide up to the castle and past crowds amassed behind railings; inside one limousine, the King and Princess Anne observe the spectators. In his study, Robert scribbles some markings on the folder he was handed and delivers it to Duncan."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A bicycle drifts past, and Charles reacts to the steam engine. Friday, a female servant, buttons up the back of the Queen's blue coat and hands her a jade bracelet, which the Queen accepts, glances into a compact mirror, and wraps around her wrist before examining her reflection with a distant gaze. As the Queen climbs some steps, Prince Philip emerges from a nearby closet. Looking perplexed, the Queen climbs the steps, rushes into the garden, dons a sun hat, and climbs into the passenger side of a nearby tractor, which then drives away. Three bodyguards swiftly leap into a nearby motorcycle and chase after her. Alastair storms into Tony's library, walks to the window, and Tony glances up at Alastair as he exits the room. The Queen's tractor enters the grounds of a rural farm, followed by the bodyguards' motorcycle. The Queen steps out of the tractor, surveys her surroundings, and a middle-aged man in a straw hat steps out from a nearby barn. On noticing the Queen, he tips his hat, locks the door to a small, wooden shed, and opens it for her to enter. The Queen removes her eyeglasses and peers at something inside: the tapestry, which hangs from the rafters by its corners at the center of the room, woven and with its edges fringed, with a ribbon of thread underneath. The Queen observes the tapestry's design and colors arranged side-by-side on a nearby easel, softly touches the side of the tapestry's border, and, with her face turned away from the man, catches her breath. The Queen closes her eyes, regains her composure, turns to face the man, looks at the tapestry's pattern again, and strides towards the gate, which the man opens. Video footage shows a sea of balloons around the entrances and walls of Buckingham Palace, with crowds gathering outside. Inside a train, the Queen sits and gazes out of a window in contemplation until Robin appears and stands beside her. The Queen turns back to the window while Robin gazes at her before the Queen turns back to him. Robin departs, revealing the Queen Mother sitting next to the Queen. Alastair is given a notebook, sits at his desk, and video footage shows the Queen arriving at Buckingham Palace. Yellow buses drive up to the palace and past crowds gathered behind barricades; inside one bus, the Queen and Prince Philip observe the spectators. In his library, Alastair jots down some ideas on the notebook he was given and hands it to Tony."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A skateboard zooms past, and Leonardo notices the thundercloud. Monday, a male chef, buckles up the front of the King's red jacket and gives him a silver bracelet, which the King accepts, glances into a compact mirror, and straps onto his wrist before admiring his image with a vacant expression. As the King climbs some ladders, Princess Diana exits from an adjacent closet. Looking perplexed, the King climbs the ladders, dashes into the garage, puts on a baseball cap, and steps into the passenger side of a parked Jeep, which then drives off. Three detectives hurriedly leap into a nearby bike and trail after him. Benjamin barges into Lisa's studio, heads to the window, and Lisa looks up at Benjamin as he exits the studio. The King's Jeep arrives at the borders of a suburban park, followed by the detectives' bike. The King exits the Jeep, surveys the area, and a young woman in a wool scarf exits from a nearby shed. Upon seeing the King, she lowers her scarf, unlatches the gate to a tiny, wooden cabin, and holds it open for him to step through. The King sheds his hat and peers at something inside: the raven, which dangles from the ceiling by its wings at the center of the shed, plucked and with its beak detached, a splash of ink beneath it. The King observes the raven's beak and feathers laid out side-by-side on a nearby bench, softly taps the tip of the raven’s beak, and, with his gaze averted from the woman, regains his composure. The King closes his eyes, adjusts his posture, turns to face the woman, glances at the raven’s form again, and strides towards the gate, which the woman secures. Video footage displays a sea of balloons around the fences and hedges of the White House, with flocks amassing nearby. Inside a helicopter, the King reclines and gazes out of a porthole in thought until George appears and stands before him. The King turns back to the porthole while George gazes at him before the King turns back to George. George departs, unveiling the King’s brother lounging opposite the King. Benjamin receives a cup of tea, settles at his workstation, and video footage shows the King reaching the White House. Blue bikes cruise up to the mansion and wave to flocks gathered beyond fences; inside one bike, the King and Princess Diana observe the bystanders. In her studio, Benjamin jots some messages on the cup he was handed and delivers it to Lisa."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A motorbike speeds past, and Charles reacts to the exhaust bank. Friday helps the Queen dress, handing her a pearl necklace. The Queen studies her reflection, then quickly descends the stairs. With a troubled look, she rushes into the courtyard, dons a headscarf, and drives away in a Land Rover, followed by bodyguards. Alastair enters Tony's office briefly. The Queen's vehicle reaches a country estate, where a man opens a door to a stone building. Inside, she finds a stag hanging, skinned and headless, with its antlers nearby. She touches the stag's head, composes herself, and exits. Outside Buckingham Palace, a carpet of flowers and crowds are present. On a plane, the Queen stares out a window until Robin, and then the Queen Mother, appear. Alastair is handed a paper, writes notes, and passes it to Tony while the Queen, arriving at Buckingham Palace, observes the gathered crowds from her car."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony the Queen and Prince Philip watch the onlookers  Black cars drive up to the palace and past crowds gathered behind barriers inside one car  Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace  Robin leaves revealing the Queen Mother sitting opposite the Queen  The Queen turns back to the window while Robin stares at her before the Queen turns back to him  Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her  Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside  the man looks at the stag's body again and moves towards the door which the man opens  The Queen closes her eyes composes her features turns to face  The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath  The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body  On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter  The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door  The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car  Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room  Three bodyguards quickly jump into a nearby car and follow her  Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away  As the Queen descends some stairs Prince Philip emerges from a nearby room  a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare  Friday  A motorbike speeds past and Charles reacts to the exhaust bank "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter  As the Queen descends some stairs Prince Philip emerges from a nearby room  The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body  The Queen turns back to the window while Robin stares at her before the Queen turns back to him  Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her  Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace  Friday  Black cars drive up to the palace and past crowds gathered behind barriers inside one car  Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away  Three bodyguards quickly jump into a nearby car and follow her  Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room  The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath  a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare  In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony The Queen closes her eyes composes her features turns to face  A motorbike speeds past and Charles reacts to the exhaust bank  The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door  Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside  The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car  the man looks at the stag's body again and moves towards the door which the man opens  Robin leaves revealing the Queen Mother sitting opposite the Queen  the Queen and Prince Philip watch the onlookers "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Queen sees the stag's head and antlers arranged sidebyside on a nearby table gently touches the side of the stag's head and with her face turned away from the man catches her breath  The Queen closes her eyes composes her features turns to face  the man looks at the stag's body again and moves towards the door which the man opens  Video footage shows a carpet of flowers around the gates and walls of Buckingham Palace with crowds swarming outside  Inside a plane the Queen sits and stares out of a window in contemplation until Robin appears and stands before her  The Queen turns back to the window while Robin stares at her before the Queen turns back to him  Robin leaves revealing the Queen Mother sitting opposite the Queen  Alastair is handed a sheet of paper sits at his desk and video footage shows the Queen arriving at Buckingham Palace  Black cars drive up to the palace and past crowds gathered behind barriers inside one car  the Queen and Prince Philip watch the onlookers  In his office Alastair scribbles some notes on the sheet he was given and hands it to Tony A motorbike speeds past and Charles reacts to the exhaust bank  Friday  a female servant zips up the back of the Queen's black dress and hands her a pearl necklace which the Queen takes looks into a fulllength mirror and fastens around her neck before studying her reflection with a fixed stare  As the Queen descends some stairs Prince Philip emerges from a nearby room  Looking troubled the Queen descends the stairs rushes into the courtyard puts on a head scarf and gets into the driver's side of a nearby Land Rover which then pulls away  Three bodyguards quickly jump into a nearby car and follow her  Alastair bursts into Tony's office goes to the door and Tony looks up at Alastair as he leaves the room  The Queen's Land Rover enters the grounds of a country estate followed by the bodyguards' car  The Queen emerges from the Land Rover gazes around and a middleaged man in a cloth cap emerges from a nearby door  On seeing the Queen he removes his cap unlocks the door to a small stone building and opens it for her to enter  The Queen removes her sunglasses and glances at something inside the stag which hangs from the ceiling by its feet at the center of the room skinned and with its head removed with a patch of blood under the body "
        }
      ]
    }
  ]
}