{
  "ground_truth": "A bright white light is held aloft by a statuesque woman wearing a long, white robe with a blue sash draped around her, standing on a cliff before a cloudy sky. A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento, California. Names appear beside the white silhouetted symbols for a woman, then a man, which have red hearts on them. A young woman comes out of her house, talking on her phone, and a phone rings. The smart, attractive, blonde woman, Abby, arrives at work at the local TV station, KSXP, in a control room where a cooking show is on a studio set, and Technical Director, Cliff, turns to Abby. The chef swigs wine from a bottle, and Mary has a swig as Abby's boss, Stuart, switches off his monitors in the toilet. In a restaurant, Abby sits at a table with a guy, and she takes out his profile, causing him to look peeved. Later that night, Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building. She lets herself in her front door, and her cat, D'Artagnan, trots over while Abby looks thoughtful and a little sad. As she gets ready for bed, a TV plays in her bedroom, and D'Artagnan treads on the remote and changes channels. He gobbles a marshmallow on the end of a long skewer and slurps a coffee. Abby looks at Mike haughtily, and grinning, he shakes her hand. Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her. Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet, frowning and sagging as she pulls the closet door shut. A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment, dumps his bag on a chair, and presses play on his answer phone, frowning and crossing himself as he grabs the answer phone. Mike goes next door with his nephew, where Mike's sister, Elizabeth, has a cake for him. The upstairs of Abby's apartment has a balcony with light streaming through open French windows. In her bathroom, Abby runs her fingers through her long, blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window, up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome, muscular guy wrapping a towel around his waist. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A luminous alabaster radiance is held high by a stately woman clad in a lengthy, alabaster gown with a sapphire band draped around her, standing on a precipice before a nebulous sky. A lad springs off a dock towards a pond and is immobilized in midair as the commuting chopper for a regional news broadcast flies over Sacramento, California. Names emerge beside the alabaster outlined icons for a woman, then a man, which have crimson hearts on them. A youthful woman emerges from her abode, conversing on her telephone, and a telephone chimes. The clever, comely, fair-haired woman, Abby, arrives at work at the regional TV station, KSXP, in a control room where a culinary show is on a studio set, and Technical Director, Cliff, turns to Abby. The cook quaffs wine from a bottle, and Mary has a sip as Abby's superior, Stuart, shuts off his screens in the lavatory. In a bistro, Abby sits at a table with a fellow, and she takes out his profile, causing him to seem miffed. Later that evening, Abby saunters past an illuminated fountain and proceeds along a path through the charming ornamental gardens outside her flat building. She lets herself in her front portal, and her feline, D'Artagnan, trots over while Abby looks contemplative and slightly melancholy. As she prepares for slumber, a TV plays in her chamber, and D'Artagnan steps on the remote and alters channels. He devours a marshmallow on the end of a lengthy skewer and sips a coffee. Abby glances at Mike disdainfully, and smirking, he shakes her hand. Abby strides in her office and rolls her eyes on the studio lot as he positions himself between them and kisses her. Larry hurls Georgia over his shoulder and carries her off while Abby is reclining on the floor in her office closet, scowling and sagging as she pulls the closet door close. A lass pedals past a garage apartment on a verdant street as Mike strolls into the apartment, tosses his bag on a seat, and presses play on his answering machine, scowling and crossing himself as he clutches the answering machine. Mike proceeds next door with his nephew, where Mike's sister, Elizabeth, has a confection for him. The upper level of Abby's apartment has a veranda with light streaming through open French doors. In her lavatory, Abby runs her fingers through her lengthy, fair-haired locks as the feline is by a shattered aquarium and D'Artagnan trots out of the window, up a tree with Abby standing below. She ascends and looks across to a nearby balcony with French doors ajar to disclose a dashing, brawny fellow wrapping a towel around his waist. Abby clamps her hand over the feline's muzzle and gazes at the fellow as he flosses his teeth and Abby grins. The limb snaps, and she hangs topsy-turvy."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bright white light is held aloft by a statuesque woman wearing a long, white robe with a blue sash draped around her, standing on a cliff before a cloudy sky. A lake is leapt towards by a boy who has jumped off a jetty and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento, California. Beside the white silhouetted symbols for a woman and a man, which have red hearts on them, names appear. A young woman comes out of her house, talking on her phone, and a phone rings. Abby, the smart, attractive, blonde woman, arrives at work at the local TV station, KSXP, in a control room where a cooking show is on a studio set, and she is turned to by Technical Director, Cliff. As the chef swigs wine from a bottle, a swig is taken by Mary while Abby's boss, Stuart, switches off his monitors in the toilet. In a restaurant, Abby sits at a table with a guy, and his profile is taken out by her, causing him to look peeved. Later that night, an illuminated fountain is walked past by Abby, who heads along a path through the pretty ornamental gardens outside her apartment building. Her front door is let open by her, and D'Artagnan, her cat, trots over while Abby looks thoughtful and a little sad. As she gets ready for bed, a TV plays in her bedroom, and the remote is tread on by D'Artagnan, changing channels. A marshmallow on the end of a long skewer is gobbled by him, and a coffee is slurped. Abby looks haughtily at Mike, and his hand is shaken by him, grinning. In her office, Abby paces and rolls her eyes on the studio lot as she is gotten between by him and snogged. Georgia is thrown over his shoulder by Larry, who carries her off while Abby is lying on the floor in her office closet, frowning and sagging as she pulls the closet door shut. A garage apartment on a leafy street is cycled past by a girl as the apartment is walked into by Mike, who dumps his bag on a chair and plays his answer phone, frowning and crossing himself as the answer phone is grabbed by him. Next door is gone by Mike with his nephew, where a cake is had for him by Mike's sister, Elizabeth. The balcony with light streaming through open French windows is part of the upstairs of Abby's apartment. In her bathroom, Abby runs her fingers through her long, blonde hair as the broken fishbowl is by the cat and D'Artagnan trots out of the window, up a tree with Abby standing underneath. The tree is climbed by her, and she looks across to a neighboring balcony with its French windows open to reveal a handsome, muscular guy wrapping a towel around his waist. The cat's snout is clamped over by Abby, who ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A bright white light is held by a statuesque woman in a long white robe with a blue sash, standing on a cliff against a cloudy sky. A boy leaps off a jetty towards a lake, frozen in midair, as a traffic helicopter flies over Sacramento, California. Names appear beside white silhouettes of a woman and a man, both with red hearts. A young woman exits her house, talking on her phone. The smart, attractive blonde, Abby, arrives at the KSXP TV station control room where a cooking show is on set, and Technical Director Cliff turns to her. The chef swigs wine, and Mary follows, as Abby's boss, Stuart, switches off his monitors in the toilet. In a restaurant, Abby checks her dinner date's profile, causing annoyance. That night, Abby walks by an illuminated fountain through ornamental gardens to her apartment. Her cat, D'Artagnan, greets her, and she looks thoughtful. As she prepares for bed, the TV in her bedroom plays, and D'Artagnan changes the channel, gobbling a marshmallow. Abby looks at Mike haughtily while he grins and shakes her hand. Abby paces her office, rolls her eyes, and encounters interruptions. Larry carries Georgia off as Abby lies on the office closet floor, frowning. A girl cycles past as Mike enters an apartment, listens to a message, and visits his sister Elizabeth with a cake. Abby's upstairs apartment has a balcony with streaming light. In her bathroom, Abby runs her fingers through her hair near a broken fishbowl as D'Artagnan leaves through a window, climbing a tree. Abby follows, peering at a muscular guy on a neighboring balcony as he wraps a towel around his waist. Abby watches him floss, and the branch breaks, leaving her hanging upside down."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A statuesque woman in a white robe with a blue sash holds a bright light on a cliff under a cloudy sky. A boy jumps off a jetty towards a lake as a traffic helicopter flies over Sacramento, CA. Names appear beside silhouetted symbols of a woman and man with red hearts. A young woman exits her house, talking on her phone. Abby, a smart, attractive blonde, arrives at KSXP TV station's control room, where a cooking show is on. Technical Director Cliff turns to Abby, as the chef drinks wine and her boss Stuart turns off monitors. In a restaurant, Abby shows a guy his profile, making him annoyed. That night, she walks past a fountain to her apartment, looking thoughtful. Her cat, D'Artagnan, changes TV channels and eats a marshmallow. Abby shakes hands with Mike and paces her office, rolling her eyes. Larry carries Georgia off as Abby lies in her office closet, frowning. A girl bikes past as Mike enters an apartment, listens to messages, and visits his sister Elizabeth with his nephew. Abby's apartment has a balcony. In her bathroom, she touches her hair as the cat is by a broken fishbowl. D'Artagnan climbs a tree, and Abby follows, looking at a muscular guy on a neighboring balcony. She watches him floss; then, a branch breaks, leaving her hanging upside down."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A luminous, radiant white light is gracefully held aloft by a statuesque woman, who is elegantly adorned in a long, flowing white robe. A blue sash is artfully draped around her robust form, and she stands resolutely on a steep cliff, set against the backdrop of a cloudy, overcast sky. Meanwhile, a young boy energetically leaps off a sturdy jetty, suspended in midair as he aims for the sparkling waters of a nearby lake. Above, the bustling traffic helicopter, which belongs to a local news program, diligently flies over the city of Sacramento, California. Sequentially, names materialize on the screen beside the white silhouetted icons that represent a woman and then a man, both displaying bright red hearts on their figures. \n\nIn another scene, a young woman emerges confidently from her house while engaged in a lively phone conversation, and simultaneously, a phone rings audibly in the background. The intelligent and visually appealing blonde woman, Abby, makes her timely arrival at the local television station, KSXP. Inside the bustling control room, where a popular cooking show is currently being filmed on a studio set, Technical Director, Cliff, turns his attentive gaze towards Abby. On set, the chef casually takes a swig of wine directly from a bottle, and Mary does the same, just as Abby's superior, Stuart, switches off his television monitors in the confines of the restroom.\n\nLater, in the intimate setting of a restaurant, Abby is seated at a table with a gentleman. She discreetly pulls out his profile, an action that causes the man to look visibly annoyed. As the night progresses, Abby strolls past a beautifully illuminated fountain, making her way down a charming path that winds through the picturesque ornamental gardens situated outside her apartment complex. Once home, she gently opens her front door, and her beloved cat, D'Artagnan, eagerly trots over to her side while Abby appears to be lost in thought, with a subtle air of sadness. Preparing for bed, a TV set hums quietly in her bedroom, and D'Artagnan accidentally steps onto the remote, changing the channels. He then eagerly devours a marshmallow skewered on a long stick and enjoys a slurp of coffee.\n\nAbby casts a haughty glance at Mike, who, with a cheerful grin, shakes her hand. As the day unfolds, Abby paces back and forth anxiously in her office, rolling her eyes dramatically on the bustling studio lot while he interjects himself between them and passionately kisses her. Larry enthusiastically hoists Georgia over his shoulder, carrying her away, while Abby finds herself lying on the floor of her office closet, her expression one of frustration and weariness as she pulls the closet door shut.\n\nElsewhere, a girl leisurely cycles past a quaint garage apartment nestled on a leafy street. Mike strides into the apartment, casually tossing his bag onto a nearby chair. He presses play on his answering machine, frowning deeply and making the sign of the cross as he holds the device. Accompanied by his nephew, Mike then moves next door, where his sister, Elizabeth, has prepared a cake for him.\n\nThe upper level of Abby's apartment features a charming balcony, with sunlight streaming abundantly through open French windows. In her bathroom, Abby runs her fingers through her luscious, long blonde hair as her cat stands near a broken fishbowl. D'Artagnan then trots out of the window and scampers up a tree, with Abby observing from below. She climbs determinedly and gazes across to a neighboring balcony, where the French windows are open to reveal a strikingly handsome and muscular man wrapping a towel around his waist. Abby places her hand over the cat's snout, ogling the man as he meticulously flosses his teeth, her face breaking into a wide grin. Suddenly, the branch she is on gives way, leaving her hanging precariously upside down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A luminous, radiant white light is gracefully held aloft in the hand of a statuesque woman, who is elegantly adorned in a long, flowing robe of pure white fabric. A striking blue sash is artfully draped around her robust, shapely form, and she stands resolutely on a steep, rugged cliff, set against the dramatic backdrop of a cloudy, overcast sky. Meanwhile, a spirited young boy energetically leaps off a sturdy, wooden jetty, suspended in midair as he aims with determination for the sparkling, inviting waters of a nearby expansive lake. High above, the bustling traffic helicopter, which belongs to a well-known local news program, diligently flies over the sprawling cityscape of Sacramento, California, its blades slicing through the air. Sequentially, names materialize on the screen beside the white silhouetted icons that represent first a woman and then a man, each displaying vibrant bright red hearts on their figures, symbolizing love and connection.\n\nIn yet another scene, a vivacious young woman emerges confidently from the entrance of her house while she is engaged in a lively and animated phone conversation, and simultaneously, a phone rings audibly in the background. The intelligent and visually appealing blonde woman, named Abby, makes her timely and poised arrival at the bustling local television station, KSXP. Inside the lively and bustling control room, where a popular and engaging cooking show is currently being filmed on a studio set, the Technical Director, Cliff, turns his attentive gaze towards Abby, recognizing her presence. On set, the charismatic chef casually takes a swig of wine directly from a bottle, and Mary does the same in a carefree manner, just as Abby's superior, Stuart, switches off his television monitors in the confines of the restroom, ending his observation for the moment.\n\nLater, in the intimate and cozy setting of a restaurant, Abby is seated at a table with a gentleman. She discreetly pulls out his profile, an action that causes the man to look visibly annoyed at this perceived intrusion. As the night progresses into evening, Abby strolls past a beautifully illuminated fountain, making her way down a charming and winding path that leads through the picturesque ornamental gardens situated just outside her apartment complex. Once home, she gently opens her front door, and her beloved cat, D'Artagnan, eagerly trots over to her side, while Abby appears to be lost in her thoughts, with a subtle air of sadness enveloping her. Preparing for bed, a TV set hums quietly in her bedroom, creating a soft background noise, and D'Artagnan accidentally steps onto the remote, inadvertently changing the channels. He then eagerly devours a marshmallow that is skewered on a long stick and enjoys a slurp of coffee.\n\nAbby casts a haughty, dismissive glance at Mike, who, with a cheerful and infectious grin, shakes her hand warmly. As the day unfolds, Abby paces back and forth anxiously in her office, rolling her eyes dramatically amidst the hustle and bustle of the bustling studio lot while he interjects himself between them and passionately kisses her. Larry enthusiastically hoists Georgia over his shoulder, carrying her playfully away, while Abby finds herself lying on the floor of her office closet, her expression one of frustration and weariness as she pulls the closet door shut, seeking a moment of solitude.\n\nElsewhere, a girl leisurely cycles past a quaint garage apartment that is nestled charmingly on a leafy, tree-lined street. Mike strides into the apartment, casually tossing his bag onto a nearby chair with a sense of ease. He presses play on his answering machine, frowning deeply and making the sign of the cross as he listens intently, holding the small device. Accompanied by his young nephew, Mike then moves next door, where his sister, Elizabeth, has lovingly prepared a cake for him, creating a warm family moment.\n\nThe upper level of Abby's apartment features a charming balcony, with golden sunlight streaming abundantly through the open French windows, casting a warm glow across the space. In her bathroom, Abby runs her fingers thoughtfully through her luscious, long blonde hair as her cat stands nearby, close to a broken fishbowl. D'Artagnan then trots out of the window without hesitation and scampers up a nearby tree, with Abby observing from below. She climbs determinedly and gazes across to a neighboring balcony, where the French windows are open to reveal a strikingly handsome and muscular man wrapping a towel securely around his waist. Abby places her hand over the cat's snout, ogling the man as he meticulously flosses his teeth, her face breaking into a wide and amused grin. Suddenly, the branch she is perched on gives way, leaving her hanging precariously upside down, caught in an unexpected moment of surprise."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In a striking scene, a statuesque woman, elegantly dressed in a long white robe accentuated with a blue sash, stands firmly on a cliff, holding a bright white light high above her head against a backdrop of a cloudy sky. Simultaneously, a boy energetically propels himself off a jetty towards the lake below, momentarily suspended in midair as a traffic helicopter for a local news program makes its way over Sacramento, California, creating a sense of bustling activity. During this moment, names begin to materialize beside the white silhouetted symbols representing a woman and a man, both adorned with red hearts, adding a touch of intrigue. Amidst these events, a young woman casually emerges from her house while engaged in a conversation on her phone, just as another phone begins to ring nearby. Transitioning to a local TV station, KSXP, the scene shifts to a control room where the atmosphere is buzzing as Abby, a smart and attractive blonde woman, arrives at work. A cooking show is being filmed in the studio, and the Technical Director, Cliff, turns to acknowledge Abby. As the chef takes a hearty swig of wine directly from a bottle, Mary also indulges, while Abby's boss, Stuart, is humorously seen switching off his monitors while in the toilet. Later, in a restaurant setting, Abby sits across a table from a man, pulling out his profile which causes a look of annoyance to cross his face. As nighttime descends, Abby is seen walking past an illuminated fountain, her path taking her through the charming ornamental gardens surrounding her apartment building. With a thoughtful and slightly somber demeanor, she enters her apartment, greeted by her cat, D'Artagnan, who affectionately trots over. As she prepares for bed, the TV flickers in her bedroom, only for D'Artagnan to inadvertently step on the remote, causing the channel to change, before he excitedly gobbles a marshmallow from the end of a long skewer while slurping coffee. Abby, exhibiting a haughty expression, observes Mike with whom she then exchanges a knowing grin accompanied by a handshake. Within her office, Abby paces, rolling her eyes in exasperation on the studio lot as Mike boldly intervenes and kisses her amidst a chaotic moment. Meanwhile, Larry humorously hoists Georgia over his shoulder, carrying her away, as Abby is depicted lying on the floor inside her office closet, her expression one of frustration and weariness as she pulls the closet door shut on herself. In another scene, a girl cycles past a garage apartment set on a leafy street, where Mike enters, casually tossing his bag onto a chair before pressing play on his answering machine. His expression turns to a frown and, in a moment of superstitious reflex, he crosses himself while clutching the answering machine. Then, with his nephew by his side, Mike visits his sister, Elizabeth, next door, where she presents him with a cake, creating a warm familial scene. At Abby's apartment, the upper floor boasts a balcony where sunlight streams through the open French windows, casting a soft glow. In her bathroom, Abby runs her fingers through her long, blonde hair, oblivious to the fact that the cat is by a broken fishbowl. D'Artagnan exits the bathroom through the window, climbing up a tree with Abby now standing directly beneath. She begins to climb, craning her neck to see a neighboring balcony, its French windows wide open, revealing a handsome, muscular guy casually wrapping a towel around his waist. Abby, caught in a moment of awe, clamps her hand over the cat's snout to silence him, as she ogles the guy who is nonchalantly flossing his teeth, her grin widening with delight. Her reverie is abruptly interrupted when the branch beneath her breaks, leaving her hanging upside down, dangling precariously from the tree."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A statuesque woman in a white robe with a blue sash holds a bright light aloft, standing on a cliff. Meanwhile, a boy is suspended mid-leap from a jetty toward a lake, as a helicopter flies over Sacramento, California, and names appear beside silhouetted symbols for a man and woman with red hearts. Outside her house, a young woman answers a phone call. Abby, a smart and attractive blonde, arrives at her job at KSXP TV station, where Technical Director Cliff is present. During a cooking show, the chef and Mary both take swigs of wine, while Abby’s boss, Stuart, turns off his monitors. At a restaurant, Abby irritates her date by pulling out his profile. Later that night, she walks through her apartment's garden, enters her home, and greets her cat, D'Artagnan, feeling thoughtful and slightly sad. As she gets ready for bed, the TV changes channels when D'Artagnan steps on the remote, and he snacks on a marshmallow and coffee. Abby exchanges a haughty look and a handshake with Mike, who joins her on the studio lot, kisses her, and leaves Abby pacing in her office. Larry carries Georgia off over his shoulder as Abby lies frowning in her office closet. A girl cycles past as Mike enters his garage apartment, listens to his messages with concern, and then visits his sister Elizabeth, who has a cake for him. Abby's apartment has an upper balcony with light streaming through open French windows. In her bathroom, Abby runs her fingers through her hair next to a broken fishbowl. Noticing a handsome, muscular man on a neighboring balcony, she clamps her hand over her cat's snout and watches him floss his teeth before grinning. The branch she climbs breaks, leaving her hanging upside down."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bright white light, reminiscent of the Statue of Liberty's torch symbolizing freedom, is held aloft by a statuesque woman wearing a long, white robe with a blue sash draped around her, standing on a cliff before a cloudy sky that resembles scenes from classic Greek mythology. A boy leaps off a jetty towards a lake, a popular summer activity in the area, and is frozen in midair as the traffic helicopter for a local news program, known for providing real-time traffic updates, flies over Sacramento, California, the state capital. Names appear beside the white silhouetted symbols for a woman, then a man, which have red hearts on them, symbolizing romantic connection. A young woman comes out of her house, which is in a bustling urban neighborhood, talking on her phone, and a phone rings loudly. The smart, attractive, blonde woman, Abby, arrives at work at the local TV station, KSXP, a well-regarded channel in the region, in a control room where a cooking show is on a studio set featuring regional chefs, and Technical Director, Cliff, turns to Abby with a look of urgency. The chef swigs wine from a bottle, illustrating the show’s casual style, and Mary has a swig as Abby's boss, Stuart, switches off his monitors in the toilet, a quirky habit he developed to save energy. In a restaurant, Abby sits at a table with a guy, and she takes out his profile, a move that reveals her methodical approach to dating, causing him to look peeved. Later that night, Abby walks past an illuminated fountain, which is known to be a historical landmark, and heads along a path through the pretty ornamental gardens outside her apartment building that won an award for its landscape design. She lets herself in her front door, and her cat, D'Artagnan, named after the famous musketeer, trots over while Abby looks thoughtful and a little sad, reflecting on her day. As she gets ready for bed, a TV plays in her bedroom, featuring a late-night comedy show, and D'Artagnan treads on the remote and changes channels. He gobbles a marshmallow on the end of a long skewer, an unusual snack, and slurps a coffee, a habit Abby finds endearing. Abby looks at Mike haughtily, and grinning, he shakes her hand with a charm that suggests a deeper familiarity. Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her with exaggerated affection. Larry throws Georgia over his shoulder, reminiscent of a playful act from old romantic films, and carries her off while Abby is lying on the floor in her office closet, frowning and sagging as she pulls the closet door shut in a moment of introspection. A girl cycles past a garage apartment on a leafy street, known for its charming architectural style, as Mike walks into the apartment, dumps his bag on a chair that looks antique, and presses play on his answer phone, frowning and crossing himself in exasperation as he grabs the answer phone. Mike goes next door with his nephew, where Mike's sister, Elizabeth, a skilled baker, has a cake for him. The upstairs of Abby's apartment has a balcony with light streaming through open French windows, adding a touch of elegance to the space. In her bathroom, Abby runs her fingers through her long, blonde hair as the cat is by a broken fishbowl, a testament to their last misadventure, and D'Artagnan trots out of the window, up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome, muscular guy wrapping a towel around his waist, reminiscent of a classic romance novel scene. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth, a mundane moment turned intriguing, and Abby grins. The branch breaks and she hangs upside down, caught in an unexpectedly comic predicament."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them The upstairs of Abby's apartment has a balcony with light streaming through open French windows The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby A young woman comes out of her house talking on her phone and a phone rings The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby The chef swigs wine from a bottle and Mary has a swig as Abby's boss He gobbles a marshmallow on the end of a long skewer and slurps a coffee Stuart switches off his monitors in the toilet A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins He gobbles a marshmallow on the end of a long skewer and slurps a coffee Abby looks at Mike haughtily and grinning A young woman comes out of her house talking on her phone and a phone rings he shakes her hand Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist The upstairs of Abby's apartment has a balcony with light streaming through open French windows In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins The branch breaks and she hangs upside down"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky. A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California. Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them. A young woman comes out of her house talking on her phone and a phone rings. The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby. The chef swigs wine from a bottle and Mary has a swig as Abby's boss. Stuart switches off his monitors in the toilet. In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved. Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building. She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad. As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He gobbles a marshmallow on the end of a long skewer and slurps a coffee. Abby looks at Mike haughtily and grinning. he shakes her hand. Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her. Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut. A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone. Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him. The upstairs of Abby's apartment has a balcony with light streaming through open French windows. In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky. A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California. Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them. A young woman comes out of her house talking on her phone and a phone rings. The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby. The chef swigs wine from a bottle and Mary has a swig as Abby's boss. Stuart switches off his monitors in the toilet. In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved. Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building. She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad. As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. He gobbles a marshmallow on the end of a long skewer and slurps a coffee. Abby looks at Mike haughtily and grinning. he shakes her hand. Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her. Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut. A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone. Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him. The upstairs of Abby's apartment has a balcony with light streaming through open French windows. In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky. A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California. Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them. A young woman comes out of her house talking on her phone and a phone rings. The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby. The chef swigs wine from a bottle and Mary has a swig as Abby's boss. Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him. The upstairs of Abby's apartment has a balcony with light streaming through open French windows. In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky. A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist. Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins. The branch breaks and she hangs upside down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A bright white light is held aloft by a statuesque penguin wearing a long, white robe with a blue sash draped around it, standing on a cliff before a cloudy sky. A dog leaps off a jetty towards a lake and is frozen in midair as the mailman for a local news program flies over Sacramento, California. Names appear beside the white silhouetted symbols for a giraffe, then a kangaroo, which have red hearts on them. A squirrel comes out of her house, talking on her phone, and a phone rings. The smart, attractive, blonde rabbit, Abby, arrives at work at the local TV station, KSXP, in a control room where a cooking show is on a studio set, and Technical Director, a robot, turns to Abby. The chef swigs wine from a bottle, and a ghost has a swig as Abby's boss, a wizard, switches off his monitors in the toilet. In a restaurant, Abby sits at a table with a fish, and she takes out his profile, causing him to look peeved. Later that night, Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building. She lets herself in her front door, and her kangaroo, D'Artagnan, trots over while Abby looks thoughtful and a little sad. As she gets ready for bed, a TV plays in her bedroom, and D'Artagnan treads on the remote and changes channels. It gobbles a marshmallow on the end of a long skewer and slurps a coffee. Abby looks at a monkey haughtily, and grinning, it shakes her hand. Abby paces in her office and rolls her eyes on the studio lot as the elephant gets between them and snogs her. An octopus throws Georgia over its shoulder and carries her off while Abby is lying on the floor in her office closet, frowning and sagging as she pulls the closet door shut. A girl cycles past a garage apartment on a leafy street as a bear walks into the apartment, dumps his bag on a chair, and presses play on his answer phone, frowning and crossing himself as he grabs the answer phone. The rabbit goes next door with its nephew, where its sister, Elizabeth, has a cake for it. The upstairs of Abby's apartment has a balcony with light streaming through open French windows. In her bathroom, Abby runs her fingers through her long, blonde hair as the kangaroo is by a broken fishbowl and D'Artagnan trots out of the window, up a tree with Abby standing underneath. She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome, muscular elephant wrapping a towel around his waist. Abby clamps her hand over the kangaroo's snout and ogles the elephant as it flosses its teeth and Abby grins. The branch breaks and she hangs upside down."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A luminous golden orb is held aloft by a statuesque woman wearing a long, gold robe with a green sash draped around her, standing on a mountain before a misty horizon. A boy leaps off a dock towards a pond and is frozen in midair as the rescue helicopter for a wildlife documentary flies over Austin, Texas. Names appear beside the blue silhouetted symbols for a woman, then a man, which have yellow stars on them. A young woman comes out of her cottage, talking on her tablet, and a tablet rings. The smart, attractive, brunette woman, Abby, arrives at work at the local radio station, WLXC, in a recording booth where a talk show is on a soundstage set, and Sound Engineer, Cliff, turns to Abby. The bartender swigs soda from a can, and Mary has a sip as Abby's boss, Stuart, switches off his tablets in the kitchen. In a bistro, Abby sits at a booth with a guy, and she takes out his sketch, causing him to look irritated. Later that night, Abby walks past an illuminated statue and heads along a path through the pretty ornamental arboretum outside her cottage. She lets herself in her back door, and her rabbit, D’Artagnan, hops over while Abby looks pensive and a little wistful. As she gets ready for bed, a radio plays in her sitting room, and D’Artagnan nudges the remote and changes channels. He gobbles a cookie on the end of a long ruler and slurps a soda. Abby looks at Mike disdainfully, and grinning, he shakes her hand. Abby paces in her study and rolls her eyes on the radio lot as he gets between them and hugs her. Larry tosses Georgia over his shoulder and carries her off while Abby is lying on the floor in her study closet, frowning and sagging as she pulls the closet door shut. A girl cycles past a shed apartment on a leafy avenue as Mike walks into the apartment, dumps his backpack on a sofa, and presses play on his voice recorder, frowning and crossing himself as he grabs the voice recorder. Mike goes next door with his niece, where Mike's cousin, Elizabeth, has a pastry for him. The upstairs of Abby's cottage has a terrace with light streaming through open casement windows. In her kitchen, Abby runs her fingers through her long, brunette hair as the rabbit is by a fallen plant pot and D’Artagnan hops out of the window, up a ladder with Abby standing underneath. She climbs and looks across to a neighboring terrace with casement windows open to reveal a handsome, athletic guy wrapping a scarf around his neck. Abby clamps her hand over the cat's snout and ogles the guy as he brushes his teeth and Abby smirks. The ladder breaks and she hangs from her knees."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A bright white light is balanced on the palm by a statuesque woman wearing a long, white robe with a blue sash draped around her, perched on a cliff before a cloudy sky. A boy cartwheels off a jetty towards a lake and is paused in midair as the traffic helicopter for a local news program hovers over Sacramento, California. Names flash beside the white silhouetted symbols for a woman, then a man, which have red hearts on them. A young woman exits her house, whispering into her phone, and a phone vibrates. The smart, attractive, blonde woman, Abby, enters at work at the local TV station, KSXP, in a control room where a cooking show is on a studio set, and Technical Director, Cliff, nods to Abby. The chef sips wine from a glass, and Mary has a taste as Abby's boss, Stuart, dims his monitors in the toilet. In a restaurant, Abby reclines at a table with a guy, and she hands him his profile, causing him to look bemused. Later that night, Abby strolls past an illuminated fountain and tiptoes along a path through the pretty ornamental gardens outside her apartment building. She eases herself in her front door, and her cat, D'Artagnan, prances over while Abby appears thoughtful and a little pensive. As she prepares for bed, a TV blares in her bedroom, and D'Artagnan pads on the remote and switches channels. He munches a marshmallow on the end of a long skewer and sips a coffee. Abby gazes at Mike disdainfully, and beaming, he waves her hand. Abby strides in her office and sighs on the studio lot as he slides between them and embraces her. Larry spins Georgia over his shoulder and runs off while Abby is lying on the floor in her office closet, grimacing and slouching as she pushes the closet door closed. A girl skates past a garage apartment on a leafy street as Mike steps into the apartment, flings his bag on a chair, and taps play on his answer phone, grimacing and nodding as he clutches the answer phone. Mike strolls next door with his nephew, where Mike's sister, Elizabeth, presents him with a cake. The upstairs of Abby's apartment has a balcony with light trickling through open French windows. In her bathroom, Abby braids her long, blonde hair as the cat is by a spilled fishbowl and D'Artagnan skips out of the window, up a tree with Abby standing beneath. She ascends and peers across to a neighboring balcony with French windows open to reveal a handsome, muscular guy fastening a towel around his waist. Abby clasps her hand over the cat's snout and admires the guy as he threads his teeth and Abby chuckles. The branch snaps and she dangles upside down."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A glowing green umbrella is held aloft by an agile tree kangaroo wearing a short, orange jumpsuit with a yellow belt wrapped around it, standing on a boulder before a sunny ocean. A toaster leaps off a chair towards a sandbox and is frozen in midair as the delivery drone for a local orchestra program glides over Anchorage, Alaska. Titles appear beside the black silhouetted symbols for a cactus, then a piano, which have blue stars on them. A young giraffe comes out of its nest, whispering on its trumpet, and a trumpet chimes. The clever, striking, brunette calculator, Lisa, arrives at play at the local radio station, WXYP, in a podcast room where a painting class is on a theater stage, and Sound Editor, Mountain, turns to Lisa. The artist sips juice from a mug, and Jane has a sip as Lisa's coach, David, switches off his screens in the garden. In a library, Lisa sits at a bench with a penguin, and she pulls out its blueprint, causing it to look miffed. Later that evening, Lisa walks past an illuminated carousel and heads along a corridor through the charming botanical room outside her condo building. She lets herself in her back window, and her hamster, Tinkerbell, waddles over while Lisa looks pensive and a little wistful. As she prepares for sleep, a radio hums in her living space, and Tinkerbell steps on the switch and changes frequencies. It munches on a cracker on the end of a short fork and sips a lemonade. Lisa looks at John skeptically, and grinning, he nods at her. Lisa strides in her workshop and rolls her elbows on the concert plaza as he sways between them and embraces her. Jerry tosses Emma over his leg and dances her off while Lisa is reclining on the floor in her studio cabinet, grimacing and drooping as she pulls the cabinet gate shut. A lion skates past a workshop dorm on a breezy avenue as John steps into the dorm, drops his cap on a table, and presses pause on his voicemail, grimacing and kneeling as he grabs the voicemail. John goes across the hall with his niece, where John's cousin, Cecilia, has a tea for him. The attic of Lisa's condo has a terrace with shadows streaming through closed sliding windows. In her closet, Lisa runs her fingers through her short, red hair as the hamster is by a leaking teapot and Tinkerbell skips out of the basement, down a shrub with Lisa sitting underneath. She climbs and peeks across to a distant terrace with sliding windows closed to reveal a charming, slender astronaut wrapping a scarf around its neck. Lisa clamps her hand over the hamster's ear and gazes at the astronaut as it brushes its mane and Lisa smirks. The shrub snaps and she dangles upside down."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A glowing red orb is perched by a towering giraffe donning a short, red cape with a green ribbon wrapped around it, sitting on a boulder before a starry night. A girl dances off a pier towards the ocean and is suspended in midair as the rescue blimp for an interstate travel show glides over Denver, Colorado. Titles flash beside the black silhouetted symbols for a dog, then a bird, which have yellow stars on them. A young man bounces out of his apartment, whispering into his watch, and a bell chimes. The cunning, charming, brunette man, Tim, departs from home to the nearby radio station, WXRT, in an editing bay where a chat show is on a set, and Sound Engineer, Morgan, waves to Tim. The baker sips milk from a glass, and John takes a sip as Tim’s supervisor, Frank, powers down his speakers in the attic. In a cafe, Tim stands at a booth with a lady, and she pulls out her bio, causing her to look amused. Later that evening, Tim strolls past a glowing pond and drifts along a trail through the lush decorative parkland outside his office building. He slips through his back door, and his dog, Zephyr, prances over while Tim appears contemplative and mildly cheerful. As he unwinds for sleep, a radio blares in his living room, and Zephyr pounces on the stereo and changes stations. He nibbles a biscuit on the end of a short fork and gulps a tea. Tim glances at Sarah playfully, and smirking, she pats his shoulder. Tim wanders in his hallway and sighs deeply on the studio lot as she intervenes and embraces her. Betty spins Randall over her head and drags him away while Tim is sitting on the rug in his attic cupboard, grimacing and slumping as he pushes the cupboard door closed. A boy jogs past a barn loft on a sunny avenue as Sarah strolls into the loft, places her book on a table, and presses pause on her voice mail, grimacing and gasping as she clutches the voice mail. Sarah wanders next door with her cousin, where Sarah’s uncle, Oliver, has a basket for her. The lower level of Tim’s office has a patio with shadows streaming through closed bay windows. In his kitchen, Tim runs his comb through his short, black hair as the dog is by a dusty lamp, and Zephyr scampers out of the door, down a ladder with Tim watching below. He descends and peers across to a distant terrace with sliding doors open to reveal a graceful, wiry woman knotting a ribbon around her neck. Tim clasps his palm over the dog's ear and gawks at the woman as she combs her hair and Tim chuckles. The ladder collapses and he dangles by his feet."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A shiny yellow umbrella is waved casually by a statuesque woman wearing a long, yellow tunic with a red belt wrapped around her, standing on a rooftop before a foggy mountain. A boy jumps off a boulder towards a meadow and is stuck in midair as the weather balloon for a local news segment floats over San Francisco, California. Names appear beside the yellow silhouetted symbols for a woman, then a man, which have blue stars on them. A young woman emerges from her barn, texting on her phone, and a doorbell pings. The clever, charming, brunette woman, Abby, arrives at work at the local bakery, KSXP, in a pantry where a knitting show is on a workshop stage, and Technical Director, Cliff, waves to Abby. The chef gulps soda from a can, and Mary has a sip as Abby's boss, Stuart, dims the lights in the hallway. In a cafe, Abby stands at a counter with a guy, and she pulls out his business card, causing him to look puzzled. Later that night, Abby strolls past a glowing lamppost and wanders along a path through the lush botanical gardens outside her office building. She slides inside her back door, and her rabbit, D'Artagnan, hops over while Abby looks pensive and a little wistful. As she tunes the radio for the night, a record plays in her bedroom, and D'Artagnan steps on the tuner and switches tracks. He nibbles a donut on the end of a short fork and sips a tea. Abby glances at Mike coyly, and smirking, he nods at her. Abby wanders in her studio and shrugs on the theater stage as he slides beside them and embraces her. Larry lifts Georgia over his forearm and strolls away while Abby is sprawled on the carpet in her office nook, grimacing and drooping as she closes the nook door. A girl skates past a carport apartment on a quiet alley as Mike steps into the apartment, tosses his hat on a shelf, and presses skip on his answering machine, grimacing and clearing his throat as he clutches the answering machine. Mike heads next door with his cousin, where Mike's aunt, Elizabeth, has a pie for him. The attic of Abby's apartment has a skylight with light streaming through open shutters. In her kitchen, Abby runs her fingers through her short, auburn hair as the rabbit is by a shattered mug and D'Artagnan bounces out of the window, across a roof with Abby standing below. She crawls and peers across to a nearby terrace with shutters open to reveal a suave, slender guy tying a robe around his waist. Abby clamps her hand over the rabbit's ears and admires the guy as he brushes his hair and Abby chuckles. The roof tile slips and she hangs right side up."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A luminous green balloon is balanced by a diminutive alien sporting a short, green jacket with a red bandana wrapped around its neck, floating above a mountain under a starry night. A penguin slides off an iceberg toward an ocean and is suspended in motion as the delivery blimp for a local bakery service glides over Anchorage, Alaska. Words appear beside the black silhouetted emblems for a unicorn, then a dragon, which have purple stars on them. A young giraffe emerges from a cave, humming to its radio, and a radio beeps. The clumsy, charming, brunette man, Leo, departs for vacation at the local zoo, LMQP, in a locker room where a game show is on a theatre stage, and Lighting Operator, River, nods to Leo. The clown chugs lemonade from a pitcher, and Sally takes a sip as Leo's neighbor, Walter, flicks off his headlights in the sauna. In a library, Leo reclines on a bench with a rabbit, and he pulls out its resume, prompting it to appear puzzled. That same morning, Leo stumbles past a glowing bonfire and skips along a trail through the lush botanical forests near his caravan. He locks his back door, and his parrot, Romeo, flutters over while Leo seems perplexed and a bit content. As he prepares dinner, a radio broadcasts in his attic, and Romeo taps on the dial and switches stations. He nibbles a cracker on the tip of a long stick and gulps a soda. Leo glances at Emma coldly, and smiling, she pats his shoulder. Leo strolls in his den and rubs his temples on the concert stage as she stands beside them and tickles her. Roger hurls Patrick onto his lap and escorts him away while Leo is lounging on the ceiling of his storage closet, grimacing and drooping as he pushes the closet door closed. A dog paddles past a cabin loft on a dusty trail as Emma enters the loft, tosses her hat on a sofa, and dials her telephone, smiling and bowing as she drops the telephone. Emma wanders next door with her toddler, where Emma's cousin, Sophie, bakes cookies for her. The basement of Leo's caravan has a porch with shadows dancing through closed bay doors. In his kitchen, Leo drags his toes through his short, brown beard as the parrot is near a shattered teapot and Romeo flutters out of the chimney, down a ladder with Leo standing in the driveway. He climbs and peers across to a nearby patio with bay doors closed to conceal a tall, lanky girl fastening a belt around her waist. Leo covers his mouth with the parrot's wing and stares at the girl as she brushes her hair and Leo smirks. The ladder collapses and he dangles sideways."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A statuesque woman in a white robe stands on a cliff, while a boy leaps towards a lake as a helicopter flies over Sacramento. Names with red heart symbols appear. Abby, a smart, attractive blonde, arrives at her TV station job, KSXP, where chaos ensues on a cooking show. Her boss Stuart turns off monitors, and later, Abby has a tense dinner date. At home, Abby ponders life with her cat D'Artagnan, who changes TV channels and snacks on marshmallows. At work, Abby meets Mike, who shakes her hand, while Georgia gets carried off by Larry. Mike listens to messages at his apartment and visits his sister Elizabeth. Abby's cat causes a mishap with a fishbowl, leading her to climb a tree. She spies on a muscular neighbor in a towel, grinning as she hangs upside down when a branch breaks."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The branch breaks and she hangs upside down Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath The upstairs of Abby's apartment has a balcony with light streaming through open French windows Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her he shakes her hand Abby looks at Mike haughtily and grinning He gobbles a marshmallow on the end of a long skewer and slurps a coffee As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved Stuart switches off his monitors in the toilet The chef swigs wine from a bottle and Mary has a swig as Abby's boss The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby A young woman comes out of her house talking on her phone and a phone rings Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her The chef swigs wine from a bottle and Mary has a swig as Abby's boss he shakes her hand Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him Abby looks at Mike haughtily and grinning The branch breaks and she hangs upside down Stuart switches off his monitors in the toilet She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath He gobbles a marshmallow on the end of a long skewer and slurps a coffee As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby The upstairs of Abby's apartment has a balcony with light streaming through open French windows In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky A young woman comes out of her house talking on her phone and a phone rings She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Abby looks at Mike haughtily and grinning he shakes her hand Abby paces in her office and rolls her eyes on the studio lot as he gets between them and snogs her Larry throws Georgia over his shoulder and carries her off while Abby is lying on the floor in her office closet frowning and sagging as she pulls the closet door shut A girl cycles past a garage apartment on a leafy street as Mike walks into the apartment dumps his bag on a chair and presses play on his answer phone frowning and crossing himself as he grabs the answer phone Mike goes next door with his nephew where Mike's sister Elizabeth has a cake for him The upstairs of Abby's apartment has a balcony with light streaming through open French windows In her bathroom Abby runs her fingers through her long blonde hair as the cat is by a broken fishbowl and D'Artagnan trots out of the window up a tree with Abby standing underneath She climbs and looks across to a neighboring balcony with French windows open to reveal a handsome muscular guy wrapping a towel around his waist Abby clamps her hand over the cat's snout and ogles the guy as he flosses his teeth and Abby grins The branch breaks and she hangs upside down A bright white light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her standing on a cliff before a cloudy sky A boy leaps off a jetty towards a lake and is frozen in midair as the traffic helicopter for a local news program flies over Sacramento California Names appear beside the white silhouetted symbols for a woman then a man which have red hearts on them A young woman comes out of her house talking on her phone and a phone rings The smart attractive blonde woman Abby arrives at work at the local TV station KSXP in a control room where a cooking show is on a studio set and Technical Director Cliff turns to Abby The chef swigs wine from a bottle and Mary has a swig as Abby's boss Stuart switches off his monitors in the toilet In a restaurant Abby sits at a table with a guy and she takes out his profile causing him to look peeved Later that night Abby walks past an illuminated fountain and heads along a path through the pretty ornamental gardens outside her apartment building She let us herself in her front door and her cat D'Artagnan trots over while Abby looks thoughtful and a little sad As she gets ready for bed a TV plays in her bedroom and D'Artagnan treads on the remote and changes channels He gobbles a marshmallow on the end of a long skewer and slurps a coffee"
        }
      ]
    }
  ]
}