{
  "ground_truth": "She heads back inside, studying the unopened letter, and goes to knock on the door of Mr. Bennet's study. She goes inside and hands over the letter. Mr. Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's bedroom in her nightgown. Jane sits by the fire, drying her hair. Lizzie sits sadly on the stool at the foot of Jane's bed. Mr. Darcy's expression is one of determined constancy. A lady's hand at work on a delicate piece of floral embroidery. Lizzie stands and leaves. With a heavy heart, Lizzie makes her way over to her father's study. She pauses to watch him through the doorway and slowly goes inside. He turns round and takes her hand. Two of them listen to Mrs. Bennet's hysterical chatter. Lizzie does so. A building fronted by magnificent pillared portico. An open-topped carriage pulls up, drawn by two white horses. Lydia gets out, dressed in a simple, empire line wedding dress and bonnet, and carrying a bunch of flowers. The Gardiners are with her. Beaming, she takes Mr. Gardiner's hand and heads up the steps. Inside, Mr. Wickham stands up, ready to receive his bride. Mr. Darcy appears beside him, his face taut with anger. Lydia walks down the aisle, grinning, and takes her place beside Mr. Wickham at the altar. The vicar comes to stand before them. An open-topped carriage trundles down the long driveway at Longbourn. Mr. and Mrs. Wickham are sitting in the back. The Bennet family come out to greet them. Mrs. Bennet waving a white handkerchief excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way. Jane makes to follow them. Jane and Lizzie exchange glances, then head inside, followed by Mary and Kitty. Later, the girls are out walking. Mr. Wickham is showing off his riding skills nearby. Wickham canters past them and makes his horse jump over a log. Wickham rides past them again, and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr. Gardiner proffers his hand, and the deal is done. Wickham finds Lizzie reading the letter. She looks away, embarrassed. They walk together in the gardens of Longbourn.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She directs back indoors, examining the unopened note, and proceeds to knock on the portal of Mr. Bennet's study. She enters and delivers the note. Mr. Bennet places the note on the table until the housekeeper has departed. The housekeeper now makes her path out into the garden to take down the laundry. Jane and Lizzie are gathering fruit. Lizzie sets down her basket and dashes off, swiftly followed by Jane. The two maidens hurry around the exterior of the residence, then across the broad stretch of lawn, searching for their father. They identify him, arms behind his back, ambling thoughtfully into the shade of the trees. They dash over to him. Lizzie sits down with the note. Lizzie stands up, appearing perturbed. Later, Lizzie's in Jane's chamber in her nightdress. Jane sits by the hearth, drying her hair. Lizzie sits sadly on the stool at the foot of Jane's bed. Mr. Darcy's countenance is one of steadfast constancy. A lady's hand at work on a delicate piece of floral needlework. Lizzie stands and departs. With a heavy heart, Lizzie makes her path over to her father's study. She halts to observe him through the doorway and slowly enters. He turns around and takes her hand. Two of them hear Mrs. Bennet's hysterical chatter. Lizzie does so. A building fronted by splendid columned portico. An open-topped carriage arrives, drawn by two white horses. Lydia alights, dressed in a simple, empire line bridal dress and bonnet, and bearing a bouquet of flowers. The Gardiners are with her. Beaming, she takes Mr. Gardiner's hand and directs up the steps. Inside, Mr. Wickham rises, prepared to receive his bride. Mr. Darcy appears beside him, his visage taut with ire. Lydia walks down the aisle, grinning, and takes her position beside Mr. Wickham at the altar. The vicar comes to stand before them. An open-topped carriage trundles down the long driveway at Longbourn. Mr. and Mrs. Wickham are seated in the back. The Bennet family emerge to greet them. Mrs. Bennet waving a white handkerchief excitedly above her head. Mrs. Bennet takes her husband's arm and leads the path. Jane makes to follow them. Jane and Lizzie exchange looks, then head indoors, followed by Mary and Kitty. Later, the maidens are out walking. Mr. Wickham is exhibiting his riding skills nearby. Wickham gallops past them and makes his horse leap over a log. Wickham rides past them again, and Lydia grins cheekily at her sisters. Lizzie looks pensive. Mr. Gardiner offers his hand, and the agreement is done. Wickham finds Lizzie perusing the note. She looks away, embarrassed. They walk together in the gardens of Longbourn."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The unopened letter is studied by her as she heads back inside, and the door of Mr. Bennet's study is knocked on by her. She goes inside and the letter is handed over. The letter is left on the desk by Mr. Bennet until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Fruit is being picked by Jane and Lizzie. The basket is put down by Lizzie, and she rushes off, followed quickly by Jane. The two girls hurry around the outside of the house, then the wide expanse of lawn is crossed by them, looking for their father. He is spotted by them, arms behind his back, strolling pensively into the shade of the trees. Over to him they rush. The letter is sat down with by Lizzie. Lizzie stands up, looking perturbed. Later, Lizzie is in Jane's bedroom in her nightgown. Jane is sitting by the fire, drying her hair. Sadly, Lizzie sits on the stool at the foot of Jane's bed. Mr. Darcy's expression is one of determined constancy. A delicate piece of floral embroidery is being worked on by a lady's hand. Lizzie stands and leaves. With a heavy heart, her way over to her father's study is made by Lizzie. She pauses to watch him through the doorway and slowly goes inside. He turns round and her hand is taken by him. Mrs. Bennet's hysterical chatter is listened to by the two of them. Lizzie does so. A building is fronted by a magnificent pillared portico. An open-topped carriage pulls up, drawn by two white horses. Lydia gets out, dressed in a simple, empire line wedding dress and bonnet, and carrying a bunch of flowers. The Gardiners accompany her. Beaming, Mr. Gardiner's hand is taken by her and the steps are headed up. Inside, Mr. Wickham stands up, ready to receive his bride. Mr. Darcy appears beside him, his face taut with anger. Lydia walks down the aisle, grinning, and takes her place beside Mr. Wickham at the altar. The vicar stands before them. An open-topped carriage trundles down the long driveway at Longbourn. Mr. and Mrs. Wickham sit in the back. The Bennet family comes out to greet them. Mrs. Bennet waves a white handkerchief excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way. Jane makes to follow them. Jane and Lizzie exchange glances, then they head inside, followed by Mary and Kitty. Later, the girls are walking. Mr. Wickham shows off his riding skills nearby. Wickham canters past them and makes his horse jump over a log. Wickham rides past them again, and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr. Gardiner proffers his hand, and the deal is done. Lizzie is found reading the letter by Wickham. She looks away, embarrassed. They walk together in the gardens of Longbourn."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She returns inside with the unopened letter and knocks on Mr. Bennet's study door. She hands him the letter, which he leaves on the desk until the housekeeper departs. The housekeeper heads to the garden to take down the washing. Jane and Lizzie are picking fruit; Lizzie drops her basket and rushes off, followed by Jane. They hurry around the house and across the lawn, searching for their father. They find him strolling pensively under the trees and rush over. Lizzie sits with the letter, then stands, looking perturbed. Later, Lizzie is in Jane's bedroom in her nightgown. Jane sits by the fire, drying her hair, while Lizzie sits sadly at the foot of the bed. Mr. Darcy's expression is one of determined constancy. A lady works on floral embroidery. Lizzie stands and leaves, heading to her father's study. She pauses at the doorway, then enters. He turns and takes her hand. They listen to Mrs. Bennet's hysterical chatter. Lizzie complies. A building with a magnificent pillared portico. An open-topped carriage arrives, drawn by two white horses. Lydia, in a simple empire line wedding dress and bonnet, carrying flowers, gets out with the Gardiners. Beaming, she takes Mr. Gardiner's hand and heads up the steps. Inside, Mr. Wickham stands ready to receive his bride. Mr. Darcy appears beside him, his face taut with anger. Lydia grins as she walks down the aisle to Mr. Wickham at the altar. The vicar stands before them. An open-topped carriage trundles down Longbourn's driveway. Mr. and Mrs. Wickham sit in the back. The Bennet family greets them, Mrs. Bennet waving a white handkerchief excitedly. She takes her husband's arm and leads the way. Jane follows, exchanging glances with Lizzie, then heads inside with Mary and Kitty. Later, the girls walk outside. Mr. Wickham shows off his riding skills nearby, cantering past and jumping a log. Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr. Gardiner offers his hand, sealing the deal. Wickham finds Lizzie reading the letter; she looks away, embarrassed. They walk together in Longbourn's gardens."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She returns inside with the unopened letter and knocks on Mr. Bennet's study door, handing it over. Mr. Bennet leaves it on the desk until the housekeeper exits to the garden to take down the washing. Jane and Lizzie pick fruit, then rush off, searching for their father. They find him strolling pensively under the trees and hurry over. Lizzie sits with the letter, then stands, perturbed. Later, in Jane's bedroom, Lizzie sits sadly while Jane dries her hair by the fire. Mr. Darcy's expression is determined. A lady works on floral embroidery. Lizzie leaves with a heavy heart, goes to her father's study, pauses, then enters. He takes her hand, and they listen to Mrs. Bennet's chatter. A building with a pillared portico sees an open-topped carriage arrive. Lydia, in a simple wedding dress, exits with the Gardiners, takes Mr. Gardiner's hand, and heads inside. Mr. Wickham stands ready, Mr. Darcy beside him, angry. Lydia grins and joins Wickham at the altar. The vicar stands before them. The carriage departs Longbourn with Mr. and Mrs. Wickham. The Bennet family greets them, Mrs. Bennet waving excitedly. She takes her husband's arm, leading the way. Jane and Lizzie exchange glances and follow, with Mary and Kitty. Later, the girls walk as Mr. Wickham shows off his riding skills, jumping a log. Lydia grins at her sisters, while Lizzie looks thoughtful. Mr. Gardiner offers his hand, sealing the deal. Wickham finds Lizzie reading the letter; she looks away, embarrassed, and they walk together in Longbourn's gardens."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She makes her way back inside the house, her eyes intently studying the unopened letter in her hand, and proceeds to knock gently on the door of Mr. Bennet's study. Upon entering, she hands over the letter to him. Mr. Bennet places the letter on his desk, choosing to leave it there until the housekeeper has departed. The housekeeper, having completed her task, now heads out into the garden to take down the washing that has been hanging to dry. Meanwhile, Jane and Lizzie are busy picking fruit. Lizzie sets her basket down and quickly rushes off, with Jane following closely behind her. The two sisters hurry around the exterior of the house and then dash across the wide expanse of the lawn, eagerly searching for their father. They soon spot him, his arms clasped behind his back, as he strolls pensively into the cool shade of the trees. They rush over to join him. Lizzie sits down with the letter in hand. She then stands up, looking visibly perturbed. Later, Lizzie finds herself in Jane's bedroom, dressed in her nightgown. Jane is seated by the fire, drying her hair. Lizzie sits sadly on the small stool at the foot of Jane's bed. Mr. Darcy's expression is one of unwavering determination. A lady's hand is seen skillfully working on a delicate piece of floral embroidery. Lizzie stands and leaves the room. With a heavy heart, she makes her way over to her father's study once more. She pauses to watch him through the doorway before slowly stepping inside. He turns around and takes her hand gently. The two of them listen to Mrs. Bennet's hysterical chatter. Lizzie complies. A grand building is fronted by a magnificent pillared portico. An open-topped carriage arrives, drawn by two elegant white horses. Lydia steps out, dressed in a simple, empire line wedding dress and bonnet, carrying a lovely bunch of flowers. The Gardiners accompany her. Beaming with joy, she takes Mr. Gardiner's hand and heads up the steps. Inside, Mr. Wickham stands up, ready to receive his bride. Mr. Darcy appears beside him, his face taut with anger. Lydia walks down the aisle, grinning broadly, and takes her place beside Mr. Wickham at the altar. The vicar comes to stand before them, ready to officiate. An open-topped carriage trundles down the long driveway at Longbourn. Mr. and Mrs. Wickham are seated in the back. The Bennet family comes out to greet them, with Mrs. Bennet waving a white handkerchief excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way. Jane prepares to follow them. Jane and Lizzie exchange knowing glances, then head inside, followed by Mary and Kitty. Later, the girls are out walking together. Mr. Wickham is nearby, showing off his riding skills. Wickham canters past them and makes his horse jump gracefully over a log. Wickham rides past them once more, and Lydia grins cheekily at her sisters. Lizzie appears thoughtful. Mr. Gardiner offers his hand, and the deal is sealed. Wickham finds Lizzie reading the letter. She looks away, feeling embarrassed. They walk together in the beautiful gardens of Longbourn."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She slowly makes her way back into the cozy confines of the house, her eyes intensely focused on the unopened letter she holds delicately in her hand. She proceeds to knock gently on the solid wood door of Mr. Bennet's quiet study. Upon entering the room, she gracefully hands the letter over to him. Mr. Bennet then places the letter on his desk, deciding to leave it untouched until the housekeeper has finished her duties and has left the room. The housekeeper, having completed her assigned tasks, now steps out into the garden to take down the washing that has been hanging up to dry in the sun. Meanwhile, Jane and Lizzie are occupied with the task of picking ripe fruit from the trees. Lizzie sets her basket down and suddenly rushes off, with Jane following close behind her, not missing a beat. The two sisters hurry excitedly around the exterior of the house and then dash across the expansive, lush lawn, eagerly searching for their father in the grounds. They soon spot him, his arms clasped thoughtfully behind his back, as he leisurely strolls into the cool, inviting shade of the trees. They rush over enthusiastically to join him. Lizzie sits down with the letter clutched in her hand, and after a moment, stands up, looking notably perturbed. Later that evening, Lizzie finds herself in the comfort of Jane's warmly lit bedroom, dressed in her simple nightgown. Jane is seated calmly by the fire, carefully drying her hair. Lizzie sits sadly on the small wooden stool at the foot of Jane's bed. Mr. Darcy's expression is fixed in one of unwavering determination. A lady's hand is shown skillfully working on a delicate piece of floral embroidery. Lizzie stands up and exits the room. With a heavy heart and deep sigh, she makes her way once more to her father's study. She pauses briefly, watching him through the doorway before slowly stepping inside. He turns around to face her and gently takes her hand in his. Together, they listen to Mrs. Bennet's hysterical chatter from the other room. Lizzie complies silently. A grand building stands prominently, fronted by a magnificent pillared portico. An elegant open-topped carriage arrives, drawn by two strikingly beautiful white horses. Lydia steps out, wearing a simple yet graceful, empire line wedding dress and bonnet, and she holds a lovely bouquet of fresh flowers. The Gardiners accompany her closely. Beaming with uncontainable joy, she takes Mr. Gardiner's hand and heads confidently up the steps. Inside, Mr. Wickham stands up, ready and waiting to receive his bride. Mr. Darcy appears beside him, his face taut with visible anger. Lydia walks down the aisle, grinning broadly, and takes her place beside Mr. Wickham at the altar. The vicar comes to stand before them, fully prepared to officiate the ceremony. An open-topped carriage trundles steadily down the long, winding driveway at Longbourn. Mr. and Mrs. Wickham are comfortably seated in the back. The entire Bennet family comes out to greet them, with Mrs. Bennet waving a white handkerchief excitedly above her head. Mrs. Bennet eagerly takes her husband's arm and leads the way. Jane prepares herself to follow them. Jane and Lizzie exchange knowing glances, then head inside, followed closely by Mary and Kitty. Later, the girls are out walking together along the path. Mr. Wickham is nearby, proudly showing off his impressive riding skills. Wickham canters past them and confidently makes his horse jump gracefully over a log. Wickham rides past them once more, and Lydia grins cheekily at her sisters. Lizzie appears lost in thought. Mr. Gardiner offers his hand, sealing the deal. Wickham finds Lizzie quietly reading the letter. She looks away, feeling a flush of embarrassment. Together, they walk along the picturesque paths in the beautiful gardens of Longbourn."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She steps back inside, her eyes fixed on the unopened letter in her hand, and makes her way to Mr. Bennet's study, where she gently knocks on the door. Upon entering, she approaches Mr. Bennet and hands him the letter. Mr. Bennet places the letter on his desk, choosing to leave it untouched until the housekeeper has exited the room. The housekeeper then proceeds to the garden, her task being to take down the washing. Meanwhile, Jane and Lizzie are engaged in picking fruit. Lizzie sets her basket down and suddenly dashes off, with Jane quickly following her lead. The two sisters hurry around the exterior of the house and then sprint across the wide stretch of lawn, their eyes scanning for their father. They soon spot him, his arms clasped behind his back, as he strolls thoughtfully into the shade provided by the trees. They rush over to him, and Lizzie sits down with the letter in hand. After a moment, Lizzie stands up, her expression troubled. Later, Lizzie finds herself in Jane's bedroom, dressed in her nightgown, while Jane sits by the fire, drying her hair. Lizzie, looking forlorn, takes a seat on the stool at the foot of Jane's bed. Mr. Darcy's face is set with a look of determined constancy, while a lady's hand is busy working on a delicate piece of floral embroidery. Lizzie rises and departs, her heart heavy, as she makes her way to her father's study. She pauses to observe him through the doorway before slowly stepping inside. He turns to face her and takes her hand. Together, they listen to Mrs. Bennet's hysterical chatter, and Lizzie complies. A building with a grand pillared portico stands before them as an open-topped carriage, drawn by two white horses, pulls up. Lydia steps out, adorned in a simple empire line wedding dress and bonnet, clutching a bouquet of flowers. Accompanied by the Gardiners, she beams as she takes Mr. Gardiner's hand and ascends the steps. Inside, Mr. Wickham stands, poised to receive his bride, while Mr. Darcy appears beside him, his face taut with anger. Lydia, grinning, walks down the aisle and takes her place beside Mr. Wickham at the altar as the vicar steps forward to stand before them. An open-topped carriage makes its way down the long driveway at Longbourn, with Mr. and Mrs. Wickham seated in the back. The Bennet family emerges to greet them, with Mrs. Bennet waving a white handkerchief excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way, prompting Jane to follow. Jane and Lizzie exchange glances before heading inside, with Mary and Kitty trailing behind. Later, the girls are out for a walk, and Mr. Wickham is nearby, showing off his riding skills. Wickham canters past them, making his horse leap over a log, and as he rides past again, Lydia grins cheekily at her sisters, while Lizzie appears deep in thought. Mr. Gardiner extends his hand, sealing the deal. Wickham finds Lizzie absorbed in reading the letter, and she looks away, feeling embarrassed. Together, they walk through the gardens of Longbourn."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She returns inside with the unopened letter and knocks on Mr. Bennet's study door, handing it to him. After she leaves, Mr. Bennet sets the letter aside. The housekeeper heads to the garden to take down the washing, while Jane and Lizzie pick fruit. Lizzie quickly sets down her basket and rushes off with Jane, searching for their father. They find him strolling pensively under the trees and hurry over. Lizzie sits with the letter, then stands, looking perturbed. Later, in Jane's bedroom, Lizzie sits sadly at the foot of the bed while Jane dries her hair by the fire. Mr. Darcy's expression is one of determined constancy as a lady works on floral embroidery. Lizzie leaves with a heavy heart and goes to her father's study, pausing to watch him before entering. He turns and takes her hand as they listen to Mrs. Bennet's chatter. A carriage arrives at a building with a pillared portico. Lydia, in a simple wedding dress, exits with the Gardiners, takes Mr. Gardiner's hand, and heads inside. Mr. Wickham stands ready at the altar, with Mr. Darcy beside him, looking angry. Lydia grins as she joins Wickham, and the vicar stands before them. The newlyweds ride away in a carriage as the Bennet family greets them, with Mrs. Bennet excitedly waving a handkerchief. She takes her husband's arm, leading the way, followed by Jane, Lizzie, Mary, and Kitty. Later, the girls walk while Mr. Wickham shows off his riding skills, making his horse jump over a log. Lydia grins at her sisters as Wickham rides past again, while Lizzie looks thoughtful. Mr. Gardiner offers his hand, sealing a deal. Wickham finds Lizzie reading the letter, and they walk together in Longbourn's gardens, with Lizzie looking away, embarrassed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She heads back inside, studying the unopened letter with a curiosity that belied its plain appearance, and goes to knock on the door of Mr. Bennet's study, a room known for its shelves of dusty tomes and the scent of leather-bound volumes. She goes inside and hands over the letter. Mr. Bennet, known for his fondness for solitude and contemplation, leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden, an area lined with rose bushes and lavender, to take down the washing drying in the gentle afternoon breeze. Jane and Lizzie are picking fruit, gathering ripe apples from the orchard that borders the estate. Lizzie puts down her basket and rushes off, quickly followed by Jane. The two girls hurry around the outside of the house, a Georgian manor reflective of its time with grand windows and stone facade, then across the wide expanse of lawn where summer picnics were often held, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees, where a family of sparrows flits from branch to branch. They rush over to him. Lizzie sits down with the letter, its seal still unbroken. Lizzie stands up, looking perturbed, her brow furrowed with worry. Later, Lizzie's in Jane's bedroom in her nightgown, a gift from her late grandmother. Jane sits by the fire, drying her hair, which hangs in loose curls. Lizzie sits sadly on the stool at the foot of Jane's bed, upholstered in a floral fabric that matched the curtains. Mr. Darcy's expression is one of determined constancy, a man of few words but strong convictions. A lady's hand at work on a delicate piece of floral embroidery, a common pastime in their social circle. Lizzie stands and leaves. With a heavy heart, Lizzie makes her way over to her father's study, a place of solace for her. She pauses to watch him through the doorway and slowly goes inside. He turns round and takes her hand, his touch reassuring. Two of them listen to Mrs. Bennet's hysterical chatter, a frequent occurrence in the household. Lizzie does so. A building fronted by a magnificent pillared portico, reminiscent of the great houses of the aristocracy. An open-topped carriage pulls up, drawn by two white horses, their coats gleaming in the sun. Lydia gets out, dressed in a simple, empire line wedding dress and bonnet, the height of fashion, and carrying a bunch of flowers gathered from the local meadow. The Gardiners are with her, their presence a comforting support. Beaming, she takes Mr. Gardiner's hand and heads up the steps. Inside, Mr. Wickham stands up, ready to receive his bride, his demeanor charming though not entirely trustworthy. Mr. Darcy appears beside him, his face taut with anger at the turn of events. Lydia walks down the aisle, grinning, and takes her place beside Mr. Wickham at the altar, the candles flickering softly. The vicar, an old family friend, comes to stand before them. An open-topped carriage trundles down the long driveway at Longbourn, wheels crunching over the gravel. Mr. and Mrs. Wickham are sitting in the back, their expressions a mix of triumph and anticipation. The Bennet family come out to greet them, emotions ranging from amusement to exasperation. Mrs. Bennet waving a white handkerchief excitedly above her head, her pride in her married daughter evident. Mrs. Bennet takes her husband's arm and leads the way. Jane makes to follow them. Jane and Lizzie exchange glances, then head inside, followed by Mary and Kitty, both quietly observing the spectacle. Later, the girls are out walking along a path lined with wildflowers. Mr. Wickham is showing off his riding skills nearby, as he often would to impress those around. Wickham canters past them and makes his horse jump over a log, demonstrating agility and confidence. Wickham rides past them again, and Lydia grins cheekily at her sisters, her excitement undiminished by the day's events. Lizzie looks thoughtful, her mind a whirl of concerns and reflections. Mr. Gardiner proffers his hand, and the deal is done, settling matters with a firm handshake. Wickham finds Lizzie reading the letter, her face a mask of concentration. She looks away, embarrassed at the intrusion. They walk together in the gardens of Longbourn, the air filled with the scent of roses and the sound of distant birdsong."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study  She goes inside and hands over the letter  Mr Bennet leaves the letter on the desk until the housekeeper has left  The housekeeper now makes her way out into the garden to take down the washing  Jane and Lizzie are picking fruit  Lizzie puts down her basket and rushes off quickly followed by Jane  The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father  He turns round and takes her hand  Two of them listen to Mrs Bennet's hysterical chatter  Lizzie does so  A building fronted by magnificent pillared portico  An opentopped carriage pulls up drawn by two white horses  Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers  The Gardiners are with her  Beaming  she takes Mr Gardiner's hand and heads up the steps  Inside  Mr Wickham stands up ready to receive his bride  Mr Darcy appears beside him his face taut with anger  Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar  The vicar comes to stand before them  An opentopped carriage trundles down the long driveway at Longbourn  Mr and Mrs Wickham are sitting in the back  The Bennet family come out to greet them  Mrs Bennet waving a white handkerchief excitedly above her head  Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them  Jane and Lizzie exchange glances then head inside followed by Mary and Kitty  Later the girls are out walking  Mr Wickham is showing off his riding skills nearby  Wickham canters past them and makes his horse jump over a log  Wickham rides past them again and Lydia grins cheekily at her sisters  They spot him arms behind his back strolling pensively into the shade of the trees  They rush over to him  Lizzie sits down with the letter  Lizzie stands up looking perturbed  Later Lizzie's in Jane's bedroom in her nightgown  Jane sits by the fire drying her hair  Lizzie sits sadly on the stool at the foot of Jane's bed  Mr Darcy's expression is one of determined constancy  A lady's hand at work on a delicate piece of floral embroidery  Lizzie stands and leaves  With a heavy heart  Lizzie makes her way over to her father's study  She pauses to watch him through the doorway and slowly goes inside  He turns round and takes her hand  Two of them listen to Mrs Bennet's hysterical chatter  Lizzie does so  A building fronted by magnificent pillared portico  An opentopped carriage pulls up drawn by two white horses  Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers  The Gardiners are with her  Beaming  she takes Mr Gardiner's hand and heads up the steps  Inside  Mr Wickham stands up ready to receive his bride  Mr Darcy appears beside him his face taut with anger  Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar  The vicar comes to stand before them  An opentopped carriage trundles down the long driveway at Longbourn  Mr and Mrs Wickham are sitting in the back  The Bennet family come out to greet them  Mrs Bennet waving a white handkerchief excitedly above her head  Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them  Jane and Lizzie exchange glances then head inside followed by Mary and Kitty  Later the girls are out walking  Mr Wickham is showing off his riding skills nearby  Wickham canters past them and makes his horse jump over a log  Wickham rides past them again and Lydia grins cheekily at her sisters  Lizzie looks thoughtful  Mr Gardiner proffers his hand and the deal is done  Wickham finds Lizzie reading the letter She looks away embarrassed  They walk together in the gardens of Longbourn"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study. She goes inside and hands over the letter. Mr Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off quickly followed by Jane. The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father. They spot him arms behind his back strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up looking perturbed. Later Lizzie's in Jane's bedroom in her nightgown. Jane sits by the fire drying her hair. Lizzie sits sadly on the stool at the foot of Jane's bed. Mr Darcy's expression is one of determined constancy. A lady's hand at work on a delicate piece of floral embroidery. Lizzie stands and leaves. With a heavy heart. Lizzie makes her way over to her father's study. She pauses to watch him through the doorway and slowly goes inside. He turns round and takes her hand. Two of them listen to Mrs Bennet's hysterical chatter. Lizzie does so. A building fronted by magnificent pillared portico. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. An opentopped carriage pulls up drawn by two white horses. Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers. The Gardiners are with her. Beaming. she takes Mr Gardiner's hand and heads up the steps. Inside. Mr Wickham stands up ready to receive his bride. Mr Darcy appears beside him his face taut with anger. Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar. The vicar comes to stand before them. An opentopped carriage trundles down the long driveway at Longbourn. Mr and Mrs Wickham are sitting in the back. The Bennet family come out to greet them. Mrs Bennet waving a white handkerchief excitedly above her head. Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them. Jane and Lizzie exchange glances then head inside followed by Mary and Kitty. Later the girls are out walking. Mr Wickham is showing off his riding skills nearby. Wickham canters past them and makes his horse jump over a log. Wickham rides past them again and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr Gardiner proffers his hand and the deal is done. Wickham finds Lizzie reading the letter She looks away embarrassed. They walk together in the gardens of Longbourn."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study. She goes inside and hands over the letter. Mr Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off quickly followed by Jane. The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father. They spot him arms behind his back strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up looking perturbed. Later Lizzie's in Jane's bedroom in her nightgown. Jane sits by the fire drying her hair. Lizzie sits sadly on the stool at the foot of Jane's bed. Mr Darcy's expression is one of determined constancy. A lady's hand at work on a delicate piece of floral embroidery. Lizzie stands and leaves. With a heavy heart. Lizzie makes her way over to her father's study. She pauses to watch him through the doorway and slowly goes inside. He turns round and takes her hand. Two of them listen to Mrs Bennet's hysterical chatter. Lizzie does so. A building fronted by magnificent pillared portico. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. An opentopped carriage pulls up drawn by two white horses. Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers. The Gardiners are with her. Beaming. she takes Mr Gardiner's hand and heads up the steps. Inside. Mr Wickham stands up ready to receive his bride. Mr Darcy appears beside him his face taut with anger. Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar. The vicar comes to stand before them. An opentopped carriage trundles down the long driveway at Longbourn. Mr and Mrs Wickham are sitting in the back. The Bennet family come out to greet them. Mrs Bennet waving a white handkerchief excitedly above her head. Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them. Jane and Lizzie exchange glances then head inside followed by Mary and Kitty. Later the girls are out walking. Mr Wickham is showing off his riding skills nearby. Wickham canters past them and makes his horse jump over a log. Wickham rides past them again and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr Gardiner proffers his hand and the deal is done. Wickham finds Lizzie reading the letter She looks away embarrassed. They walk together in the gardens of Longbourn."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study. She goes inside and hands over the letter. Mr Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Lizzie puts down her basket and rushes off quickly followed by Jane. The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father. They spot him arms behind his back strolling pensively into the shade of the trees. They rush over to him. Lizzie sits down with the letter. Lizzie stands up looking perturbed. Later Lizzie's in Jane's bedroom in her nightgown. The Bennet family come out to greet them. Mrs Bennet waving a white handkerchief excitedly above her head. Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them. Jane and Lizzie exchange glances then head inside followed by Mary and Kitty. Later the girls are out walking. Mr Wickham is showing off his riding skills nearby. Wickham canters past them and makes his horse jump over a log. Wickham rides past them again and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr Gardiner proffers his hand and the deal is done. Wickham finds Lizzie reading the letter She looks away embarrassed. They walk together in the gardens of Longbourn."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study. She goes inside and hands over the letter. Mr Bennet leaves the letter on the desk until the housekeeper has left. The housekeeper now makes her way out into the garden to take down the washing. Jane and Lizzie are picking fruit. Wickham rides past them again and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr Gardiner proffers his hand and the deal is done. Wickham finds Lizzie reading the letter She looks away embarrassed. They walk together in the gardens of Longbourn."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat heads back inside, studying the unopened letter, and goes to knock on the door of the dog's study. The cat goes inside and hands over the letter. The dog leaves the letter on the desk until the mouse has left. The mouse now makes her way out into the garden to take down the washing. The squirrel and the rabbit are picking fruit. The rabbit puts down her basket and rushes off, quickly followed by the squirrel. The two birds hurry around the outside of the house, then across the wide expanse of lawn, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the trees. They rush over to him. The rabbit sits down with the letter. The rabbit stands up, looking perturbed. Later, the rabbit's in the squirrel's bedroom in her nightgown. The squirrel sits by the fire, drying her hair. The rabbit sits sadly on the stool at the foot of the squirrel's bed. The bear's expression is one of determined constancy. A ladybug's hand at work on a delicate piece of floral embroidery. The rabbit stands and leaves. With a heavy heart, the rabbit makes her way over to her father's study. She pauses to watch him through the doorway and slowly goes inside. He turns round and takes her hand. Two of them listen to the frog's hysterical chatter. The rabbit does so. A building fronted by magnificent pillared portico. An open-topped carriage pulls up, drawn by two white horses. The owl gets out, dressed in a simple, empire line wedding dress and bonnet, and carrying a bunch of flowers. The foxes are with her. Beaming, she takes the fox's hand and heads up the steps. Inside, the turtle stands up, ready to receive his bride. The bear appears beside him, his face taut with anger. The owl walks down the aisle, grinning, and takes her place beside the turtle at the altar. The butterfly comes to stand before them. An open-topped carriage trundles down the long driveway at Longbourn. The turtle and the owl are sitting in the back. The wolf family come out to greet them. The frog waving a white handkerchief excitedly above her head. The frog takes her husband's arm and leads the way. The sparrow makes to follow them. The sparrow and the rabbit exchange glances, then head inside, followed by the fish and the ant. Later, the birds are out walking. The turtle is showing off his riding skills nearby. The turtle canters past them and makes his horse jump over a log. The turtle rides past them again, and the owl grins cheekily at her sisters. The rabbit looks thoughtful. The fox proffers his hand, and the deal is done. The turtle finds the rabbit reading the letter. She looks away, embarrassed. They walk together in the gardens of Longbourn."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She heads back inside, studying the unopened package, and goes to knock on the door of Mr. Bennet's library. She goes inside and hands over the package. Mr. Bennet leaves the package on the bookshelf until the gardener has left. The gardener now makes her way out into the orchard to take down the birdhouses. Jane and Lizzie are picking flowers. Lizzie puts down her satchel and rushes off, quickly followed by Jane. The two girls hurry around the outside of the barn, then across the wide expanse of meadow, looking for their father. They spot him, arms behind his back, strolling pensively into the shade of the barn. They rush over to him. Lizzie sits down with the package. Lizzie stands up, looking perturbed. Later, Lizzie's in Jane's study in her nightdress. Jane sits by the window, reading. Lizzie sits sadly on the stool at the foot of Jane's couch. Mr. Darcy's expression is one of determined constancy. A lady's hand at work on a delicate piece of ceramic sculpture. Lizzie stands and leaves. With a heavy heart, Lizzie makes her way over to her father's library. She pauses to watch him through the window and slowly goes inside. He turns round and takes her hand. Two of them listen to Mrs. Bennet's hysterical gossip. Lizzie does so. A building fronted by magnificent terraced patio. An open-topped wagon pulls up, drawn by two black mules. Lydia gets out, dressed in a simple, empire line party dress and hat, and carrying a bouquet of leaves. The Gardiners are with her. Beaming, she takes Mr. Gardiner's hand and heads up the stairs. Inside, Mr. Wickham stands up, ready to receive his bride. Mr. Darcy appears beside him, his face taut with anger. Lydia walks down the aisle, grinning, and takes her place beside Mr. Wickham at the stage. The minister comes to stand before them. An open-topped wagon trundles down the long lane at Longbourn. Mr. and Mrs. Wickham are sitting in the back. The Bennet family come out to greet them. Mrs. Bennet waving a white scarf excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way. Jane makes to follow them. Jane and Lizzie exchange glances, then head inside, followed by Mary and Kitty. Later, the girls are out wandering. Mr. Wickham is showing off his dance skills nearby. Wickham frolics past them and makes his dog jump over a ditch. Wickham dances past them again, and Lydia grins cheekily at her sisters. Lizzie looks thoughtful. Mr. Gardiner proffers his hand, and the arrangement is complete. Wickham finds Lizzie reading the package. She looks away, embarrassed. They walk together in the orchards of Longbourn."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She retreats inside, pondering the unopened letter, and decides to tap on the door of Mr. Bennet's study. She enters and delivers the letter. Mr. Bennet places the letter on the desk until the housekeeper departs. The housekeeper then wanders into the garden to inspect the washing. Jane and Lizzie are gathering flowers. Lizzie sets down her basket and dashes off, swiftly trailed by Jane. The two girls meander around the outside of the house, then across the wide expanse of lawn, searching for their father. They observe him, arms behind his back, ambling thoughtfully into the shade of the trees. They hurry over to him. Lizzie kneels down with the letter. Lizzie rises, looking unsettled. Later, Lizzie's in Jane's bedroom in her nightgown. Jane sits by the fire, warming her hands. Lizzie sits gloomily on the stool at the foot of Jane's bed. Mr. Darcy's expression is one of resolved determination. A lady's hand at rest on a delicate piece of floral embroidery. Lizzie rises and exits. With a heavy heart, Lizzie strolls over to her father's study. She hesitates to observe him through the doorway and gradually steps inside. He turns round and embraces her hand. Two of them endure Mrs. Bennet's frantic chatter. Lizzie complies. A building flanked by magnificent pillared portico. An open-topped carriage halts, pulled by two white horses. Lydia hops out, dressed in a simple, empire line wedding dress and bonnet, and clutching a bunch of flowers. The Gardiners accompany her. Beaming, she grasps Mr. Gardiner's hand and steps up the steps. Inside, Mr. Wickham rises, prepared to greet his bride. Mr. Darcy emerges beside him, his face tense with ire. Lydia promenades down the aisle, grinning, and takes her place beside Mr. Wickham at the altar. The vicar arrives to stand before them. An open-topped carriage rolls down the long driveway at Longbourn. Mr. and Mrs. Wickham are seated in the back. The Bennet family emerge to welcome them. Mrs. Bennet waving a white handkerchief gleefully above her head. Mrs. Bennet clutches her husband's arm and leads the procession. Jane prepares to accompany them. Jane and Lizzie exchange glances, then retreat inside, followed by Mary and Kitty. Later, the girls are out strolling. Mr. Wickham is displaying his equestrian prowess nearby. Wickham trots past them and urges his horse to leap over a log. Wickham rides past them again, and Lydia smirks mischievously at her sisters. Lizzie appears contemplative. Mr. Gardiner extends his hand, and the arrangement is settled. Wickham notices Lizzie reading the letter. She averts her gaze, flustered. They stroll together in the gardens of Longbourn."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The apple heads back inside, studying the unopened shoebox, and goes to knock on the door of Dr. Bell's kitchen. The apple goes inside and hands over the shoebox. Dr. Bell leaves the shoebox on the blender until the candlestick has left. The candlestick now makes its way out into the attic to take down the curtains. Felix and Oscar are picking flowers. Oscar puts down his suitcase and rushes off, quickly followed by Felix. The two trees hurry around the outside of the barn, then across the wide expanse of tiles, looking for their neighbor. They spot him, ears behind his glasses, strolling pensively into the shade of the mountains. They rush over to him. Oscar sits down with the shoebox. Oscar stands up, looking perturbed. Later, Oscar's in Felix's bathroom in his raincoat. Felix sits by the lamp, drying his balloon. Oscar sits sadly on the stool at the foot of Felix's chair. Mr. Collins' expression is one of determined constancy. A trumpet's hand at work on a delicate piece of floral origami. Oscar stands and leaves. With a heavy heart, Oscar makes his way over to his neighbor's kitchen. He pauses to watch him through the doorway and slowly goes inside. He turns round and takes his elbow. Two of them listen to Mrs. Smith's hysterical chatter. Oscar does so. A carousel fronted by magnificent pillared portico. An open-topped spaceship pulls up, drawn by two white donkeys. Bert gets out, dressed in a simple, empire line raincoat and bonnet, and carrying a bunch of pineapples. The Bakers are with him. Beaming, he takes Mrs. Baker's elbow and heads up the steps. Inside, Mr. Collins stands up, ready to receive his guest. Mr. Bing appears beside him, his face taut with anger. Bert walks down the hallway, grinning, and takes his place beside Mr. Collins at the doorstep. The conductor comes to stand before them. An open-topped spaceship trundles down the long driveway at Windermere. Sir and Lady Collins are sitting in the back. The Bell family come out to greet them. Mrs. Smith waving a white umbrella excitedly above her head. Mrs. Smith takes her neighbor's knee and leads the way. Felix makes to follow them. Felix and Oscar exchange glances, then head inside, followed by Max and Leo. Later, the trees are out walking. Mr. Collins is showing off his juggling skills nearby. Collins canters past them and makes his unicycle jump over a shoe. Collins rides past them again, and Bert grins cheekily at his brothers. Oscar looks thoughtful. Mr. Baker proffers his elbow, and the deal is done. Collins finds Oscar reading the shoebox. Oscar looks away, embarrassed. They walk together in the forests of Windermere."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He slips back outside, examining the open package, and decides to stroll past the window of Mrs. Smith's kitchen. He enters the room and drops off the package. Mrs. Smith places the package on the table until the gardener has arrived. The gardener now follows his path into the library to put away the books. Sarah and Emily are drawing pictures. Emily sets down her sketchpad and meanders off, closely accompanied by Sarah. The two women wander around the inside of the garden, then across the narrow stretch of path, searching for their uncle. They glimpse him, hat in hand, lounging thoughtfully in the sunlight. They walk over to him. Emily kneels down with the package. Emily jumps up, appearing puzzled. Earlier, Emily's in Sarah's parlor in her dress. Sarah sits by the couch, tying her shoes. Emily rests happily on the chair at the side of Sarah's window. Mr. Collins's expression is one of unwavering surprise. A gentleman's hand at work on a detailed piece of animal sculpture. Emily jumps and returns. With a light spirit, Emily skips her way over to her uncle's kitchen. She pauses to listen to him behind the curtain and quickly steps inside. He glances over and shakes her hand. The pair of them talk over Mr. Smith's dry commentary. Emily whispers back. A building adorned with majestic wooden gables. A closed-top wagon pulls away, led by two brown mules. Anna steps out, clad in a complex, medieval-style party dress and veil, and holding a bouquet of vegetables. The Robinsons are next to her. Smiling, she releases Mrs. Robinson's hand and marches down the path. Inside, Mr. Brown stands back, prepared to congratulate his guest. Mr. Collins appears behind him, his face lined with curiosity. Anna strides up the aisle, laughing, and takes her position next to Mr. Brown at the podium. The butler strolls up to speak with them. A closed-top wagon ambles up the short pathway at Rosings Park. Mr. and Mrs. Brown are lounging in the front. The Smith family rush out to meet them. Mr. Smith waving a red scarf playfully beside his face. Mr. Smith pulls at his wife's coat and skips ahead. Sarah hopes to guide them. Sarah and Emily share a nod, then file outside, joined by Eliza and Susan. Earlier, the women are inside cooking. Mr. Brown is showing off his singing skills nearby. Brown strides past them and makes his voice echo through a tunnel. Brown walks by them again, and Anna giggles quietly at her friends. Emily appears contemplative. Mr. Robinson extends his arm, and the transaction is complete. Brown finds Emily painting the package. She turns aside, amused. They sit together in the library of Rosings Park."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She heads back inside, pondering the unopened parcel, and goes to tap on the window of Mr. Bennet's library. She goes inside and hands over the parcel. Mr. Bennet places the parcel on the shelf until the gardener has left. The gardener now makes her way out into the orchard to gather the fallen leaves. Jane and Lizzie are plucking blossoms. Lizzie puts down her basket and dashes off, quickly trailed by Jane. The two girls scurry around the outside of the barn, then across the vast stretch of meadow, searching for their father. They spot him, hands clasped in front, wandering thoughtfully into the shelter of the barn. They dash over to him. Lizzie kneels down with the parcel. Lizzie stands up, looking confused. Later, Lizzie's in Jane's bedroom in her dressing gown. Jane sits by the window, brushing her hair. Lizzie sits glumly on the chair at the foot of Jane's bed. Mr. Darcy's expression is one of unwavering resolve. A lady's hand at work on a delicate piece of lace knitting. Lizzie stands and departs. With a heavy heart, Lizzie makes her way over to her father's library. She pauses to observe him through the window and slowly goes inside. He turns round and takes her hand. The two of them listen to Mrs. Bennet's ecstatic talk. Lizzie does so. A building adorned with magnificent stone arches. An open-topped wagon pulls up, drawn by two black mules. Lydia gets out, dressed in a simple, empire line party dress and bonnet, and carrying a bouquet of feathers. The Gardiners are with her. Beaming, she takes Mr. Gardiner's hand and heads up the steps. Inside, Mr. Wickham stands up, prepared to greet his bride. Mr. Darcy appears beside him, his face taut with frustration. Lydia prances down the aisle, grinning, and takes her place beside Mr. Wickham at the dais. The vicar comes to stand before them. An open-topped wagon rolls down the long driveway at Longbourn. Mr. and Mrs. Wickham are sitting in the back. The Bennet family come out to greet them. Mrs. Bennet waving a red scarf excitedly above her head. Mrs. Bennet takes her husband's arm and leads the way. Jane starts to follow them. Jane and Lizzie exchange looks, then head inside, followed by Mary and Kitty. Later, the girls are out wandering. Mr. Wickham is showing off his juggling skills nearby. Wickham trots past them and makes his horse leap over a fence. Wickham rides past them again, and Lydia winks playfully at her sisters. Lizzie looks contemplative. Mr. Gardiner offers his hand, and the arrangement is settled. Wickham finds Lizzie sketching the parcel. She looks away, sheepish. They stroll together in the orchards of Longbourn."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He wanders back outside, juggling the unopened suitcase, and goes to jump on the roof of Mrs. Smith's attic. He dances outside and tosses away the suitcase. Mrs. Smith paints the suitcase on the shelf until the gardener has arrived. The gardener now dances his way out into the kitchen to toss up the furniture. John and Emma are baking cookies. Emma puts down her hat and crawls off, slowly followed by John. The two cats waddle around the inside of the barn, then through the narrow corridor of hallways, singing for their grandfather. They wave to him, hands over his ears, rolling furiously into the sunlight of the beach. They tiptoe away from him. Emma lies down with the suitcase. Emma lies down, looking relieved. Earlier, Emma's in John's library in his overalls. John stands by the window, folding his sheets. Emma stands cheerfully on the ladder at the head of John's bookcase. Mr. Burns's gesture is one of amused surprise. A man's foot at work on a delicate piece of wooden sculpture. Emma lies and dances. With a joyful grin, Emma sprints her route under to her mother's attic. He lunges to ignore her through the wall and swiftly dances outside. She frowns backward and releases his hat. Three of them ignore Mr. Smith's joyful silence. Emma does not. A doghouse decorated by hideous painted fountain. An empty boat stalls out, pushed by ten black dolphins. Robert jumps in, wearing an elaborate, Victorian-era crown and cape, and playing a bouquet of guitars. The Parkers are without him. Frowning, he loses Mrs. Parker's hat and sprints down the puddles. Outside, Mrs. Green collapses down, waiting to confuse her apprentice. Mr. Burns watches without him, her hair full with joy. Robert dances across the stage, singing, and loses his mind without Mrs. Green in the kitchen. The chef ceases to sleep above them. A closed boat crawls up the short stairway to the attic. Robert and Mary Green are standing in the front. The Smith family go in to ignore them. Mr. Smith tossing an old pair of shoes lazily under her feet. Mr. Smith releases his daughter's leg and follows the stairs. Emma dances to follow him. Emma and Susan swap manuscripting, then jump outside, chased by Alice and Nancy. Earlier, the dogs are inside reading. Mrs. Green is hiding off her swimming techniques faraway. Green swims next to them and makes her dog play under a leaf. Green gallops up them quietly, and Robert frowns sadly at his cousins. Emma feels relieved. Mrs. Parker refuses their foot, and the plan is shattered. Green misses Emma watching the suitcase. He smiles inwardly, fascinated. They sleep separately above the rooftops of the attic."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She studies the unopened letter and knocks on Mr. Bennet's study door, handing it over. Once alone, Mr. Bennet leaves it on his desk. The housekeeper goes to the garden, while Jane and Lizzie pick fruit. Lizzie quickly leaves with Jane following, searching for their father. They find him in the trees and rush over. Lizzie sits with the letter, later appearing sad in Jane's room. Mr. Darcy appears determined. Lizzie, with a heavy heart, enters her father's study, where they listen to Mrs. Bennet's chatter. A carriage arrives at a grand building; Lydia, in a wedding dress, joins Mr. Wickham, with Mr. Darcy present, at the altar. The Bennets greet Mr. and Mrs. Wickham’s carriage excitedly, Mrs. Bennet leading them inside. Jane and Lizzie exchange glances and follow with Mary and Kitty. While walking, Mr. Wickham shows off his riding skills. Lydia grins at her sisters, and Lizzie appears thoughtful. Mr. Gardiner finalizes the arrangement. Wickham finds Lizzie reading the letter, and they awkwardly walk together in Longbourn's gardens."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They walk together in the gardens of Longbourn Wickham finds Lizzie reading the letter She looks away embarrassed  Mr Gardiner proffers his hand and the deal is done  Lizzie looks thoughtful  Wickham rides past them again and Lydia grins cheekily at her sisters  Wickham canters past them and makes his horse jump over a log  Mr Wickham is showing off his riding skills nearby  Later the girls are out walking  Jane and Lizzie exchange glances then head inside followed by Mary and Kitty  Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them  Mrs Bennet waving a white handkerchief excitedly above her head  The Bennet family come out to greet them  Mr and Mrs Wickham are sitting in the back  An opentopped carriage trundles down the long driveway at Longbourn  The vicar comes to stand before them  Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar  Mr Darcy appears beside him his face taut with anger  Mr Wickham stands up ready to receive his bride  Inside  she takes Mr Gardiner's hand and heads up the steps  Beaming  The Gardiners are with her  Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers  An opentopped carriage pulls up drawn by two white horses  A building fronted by magnificent pillared portico  Lizzie does so  Two of them listen to Mrs Bennet's hysterical chatter  He turns round and takes her hand  She pauses to watch him through the doorway and slowly goes inside  Lizzie makes her way over to her father's study  With a heavy heart  Lizzie stands and leaves  A lady's hand at work on a delicate piece of floral embroidery  Mr Darcy's expression is one of determined constancy  Lizzie sits sadly on the stool at the foot of Jane's bed  Jane sits by the fire drying her hair  Later Lizzie's in Jane's bedroom in her nightgown  Lizzie stands up looking perturbed  Lizzie sits down with the letter  They rush over to him  They spot him arms behind his back strolling pensively into the shade of the trees  The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father  Lizzie puts down her basket and rushes off quickly followed by Jane  Jane and Lizzie are picking fruit  The housekeeper now makes her way out into the garden to take down the washing  Mr Bennet leaves the letter on the desk until the housekeeper has left  She goes inside and hands over the letter  She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Lizzie looks thoughtful  She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study  The vicar comes to stand before them  Mr Wickham stands up ready to receive his bride  She pauses to watch him through the doorway and slowly goes inside  The Gardiners are with her  Wickham finds Lizzie reading the letter She looks away embarrassed  Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers  A lady's hand at work on a delicate piece of floral embroidery  she takes Mr Gardiner's hand and heads up the steps  Wickham canters past them and makes his horse jump over a log  She goes inside and hands over the letter  Lizzie sits sadly on the stool at the foot of Jane's bed  Lizzie stands up looking perturbed  With a heavy heart  Mrs Bennet waving a white handkerchief excitedly above her head  The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father  The Bennet family come out to greet them  Two of them listen to Mrs Bennet's hysterical chatter  Mr Gardiner proffers his hand and the deal is done  Later Lizzie's in Jane's bedroom in her nightgown  He turns round and takes her hand  Mr Darcy appears beside him his face taut with anger  They rush over to him  Mr Wickham is showing off his riding skills nearby  The housekeeper now makes her way out into the garden to take down the washing  Later the girls are out walking  Beaming  Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar  Lizzie sits down with the letter  Jane and Lizzie exchange glances then head inside followed by Mary and Kitty  Mr Darcy's expression is one of determined constancy  Wickham rides past them again and Lydia grins cheekily at her sisters  Jane and Lizzie are picking fruit  Jane sits by the fire drying her hair  A building fronted by magnificent pillared portico  Lizzie makes her way over to her father's study  Mr and Mrs Wickham are sitting in the back  Lizzie puts down her basket and rushes off quickly followed by Jane  An opentopped carriage pulls up drawn by two white horses  They spot him arms behind his back strolling pensively into the shade of the trees  An opentopped carriage trundles down the long driveway at Longbourn  Inside  Mr Bennet leaves the letter on the desk until the housekeeper has left  Lizzie stands and leaves  Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them  They walk together in the gardens of Longbourn Lizzie does so "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "An opentopped carriage pulls up drawn by two white horses  Lydia gets out dressed in a simple empire line wedding dress and bonnet and carrying a bunch of flowers  The Gardiners are with her  Beaming  she takes Mr Gardiner's hand and heads up the steps  Inside  Mr Wickham stands up ready to receive his bride  Mr Darcy appears beside him his face taut with anger  Lydia walks down the aisle grinning and takes her place beside Mr Wickham at the altar  The vicar comes to stand before them  An opentopped carriage trundles down the long driveway at Longbourn  Mr and Mrs Wickham are sitting in the back  The Bennet family come out to greet them  Mrs Bennet waving a white handkerchief excitedly above her head  Mrs Bennet takes her husband's arm and leads the way Jane makes to follow them  Jane and Lizzie exchange glances then head inside followed by Mary and Kitty  Later the girls are out walking  Mr Wickham is showing off his riding skills nearby  Wickham canters past them and makes his horse jump over a log  Wickham rides past them again and Lydia grins cheekily at her sisters  Lizzie looks thoughtful  Mr Gardiner proffers his hand and the deal is done  Wickham finds Lizzie reading the letter She looks away embarrassed  They walk together in the gardens of Longbourn She heads back inside studying the unopened letter and goes to knock on the door of Mr Bennet's study  She goes inside and hands over the letter  Mr Bennet leaves the letter on the desk until the housekeeper has left  The housekeeper now makes her way out into the garden to take down the washing  Jane and Lizzie are picking fruit  Lizzie puts down her basket and rushes off quickly followed by Jane  The two girls hurry around the outside of the house then across the wide expanse of lawn looking for their father  They spot him arms behind his back strolling pensively into the shade of the trees  They rush over to him  Lizzie sits down with the letter  Lizzie stands up looking perturbed  Later Lizzie's in Jane's bedroom in her nightgown  Jane sits by the fire drying her hair  Lizzie sits sadly on the stool at the foot of Jane's bed  Mr Darcy's expression is one of determined constancy  A lady's hand at work on a delicate piece of floral embroidery  Lizzie stands and leaves  With a heavy heart  Lizzie makes her way over to her father's study  She pauses to watch him through the doorway and slowly goes inside  He turns round and takes her hand  Two of them listen to Mrs Bennet's hysterical chatter  Lizzie does so  A building fronted by magnificent pillared portico "
        }
      ]
    }
  ]
}