{
  "ground_truth": "Jack's flummoxed as Jenny picks up her parcels and goes into the living room, glaring at her father, David, who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny, who tries to suppress a broad grin, before they drive off for the evening. Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance. Later, they are lying in bed together, kissing face to face. In his pajama bottoms, David gets up while Jenny sits up, watching him go through to the other room as she self-consciously adjusts her nightie. Jenny is stumped and buries her face in her pillow, while David flops down on the bed, studies her uncertainly, smiles apologetically, and hangs his head. They sit side by side on the satin as Jenny grins at David, then reaches forward and grabs a banana. Sun shines on the Eiffel Tower as Jenny and David, in film star sunglasses, wander among booksellers on the banks of the Seine. Jenny finds a book she loves and looks imploringly at David, who smiles and reaches for his wallet, holding her hand as they walk along a high wall. David boxes Jenny into position for a photo with Notre Dame Cathedral in the background; she poses, and a guy on a bicycle checks her out as he rides past. David is less than impressed, then takes another photo. They run up steep stone steps and walk arm in arm, joining other couples slow dancing in the sunshine to a record playing on a small portable turntable. They lie cheek to cheek and drink wine with a picnic by the river at dusk, where Jenny rests her head on David's shoulder. In the morning, Jenny looks out from their hotel at the great dome of the Sacre-Coeur, smiles, thinks for a moment, then shakes her head. Jenny puts a bottle of Chanel on her teacher's desk but, disappointedly, puts the bottle back in her satchel as the teacher looks up when she leaves. The words hit home, and Jenny thinks hard, challenging Miss Stubs with a look, but Miss Stubs turns away. Gray hounds burst out of starting gates onto the track as Jenny, David, Danny, and Helen are in the crowd. They climb the stands to a private suite where David shakes hands with a man by the door, then they file in. Jenny gives her coat to Danny while their contact holds court in a white dinner jacket, and Danny and David move off. Jenny and Helen drink champagne, then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together, Jenny smiling with her gaze never wavering from his.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with synonyms:\n\nJack's perplexed as Jenny lifts up her packages and goes into the lounge, glaring at her father, David, who lowers his head while Jenny sighs. Jack grapples to make the next move as David gleams at Jenny, who attempts to suppress a wide grin, before they drive off for the night. Jenny glances around the sparsely equipped chamber with contemporary wooden furnishings and throws him a look. Later, they are lying in bed together, kissing face to face. In his pajama bottoms, David rises while Jenny sits up, observing him go through to the other room as she self-consciously adjusts her nightie. Jenny is stymied and buries her face in her pillow while David flops down on the bed, examines her uncertainly, smiles apologetically, and lowers his head. They sit side by side on the satin as Jenny grins at David, then reaches forward and grabs a banana. Sunlight shines on the Eiffel Tower as Jenny and David, in film star shades, stroll among booksellers on the shores of the Seine. Jenny discovers a book she adores and looks imploringly at David, who smiles and reaches for his wallet, holding her hand as they walk along a high wall. David positions Jenny for a snapshot with Notre Dame Cathedral in the background; she poses, and a guy on a bicycle checks her out as he rides by. David is less than impressed, then takes another photo. They dash up steep stone steps and walk arm in arm, joining other couples slow dancing in the sunshine to a record playing on a small portable turntable. They lie cheek to cheek and sip wine with a picnic by the river at twilight, where Jenny rests her head on David's shoulder. In the morning, Jenny gazes out from their hotel at the grand dome of the Sacre-Coeur, smiles, ponders for a moment, then shakes her head. Jenny puts a bottle of Chanel on her educator's desk but, disappointedly, puts the bottle back in her satchel as the instructor looks up when she departs. The words hit home, and Jenny thinks deeply, challenging Miss Stubs with a glance, but Miss Stubs turns away. Gray dogs burst out of starting gates onto the track as Jenny, David, Danny, and Helen are among the crowd. They ascend the stands to a private suite where David shakes hands with a man by the entrance, then they file in. Jenny gives her coat to Danny while their contact holds court in a white dinner jacket, and Danny and David move off. Jenny and Helen sip champagne, then Danny leads Jenny to the dance floor where they move flirtatiously. Helen anxiously watches David watching them as Jenny and Danny dance with their eyes locked together, Jenny smiling with her gaze never wavering from his."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jack is flummoxed as Jenny's parcels are picked up by her and the living room is entered, a glare shot at her father, David, whose head is hung as a sigh is given by Jenny. The next move is struggled with by Jack as David gleams at Jenny, who is tried to suppress a broad grin by, before the evening drive-off is made. The sparsely furnished room with modern wooden furniture is looked around by Jenny, and a glance is shot at him. Later, bed is shared by them together, face-to-face kissing occurring. In his pajama bottoms, David rises as Jenny sits up, watching as he goes through to the other room, her nightie self-consciously adjusted by her. Jenny is stumped and her face is buried in her pillow, while David flops down on the bed, her uncertainly studied, an apologetic smile given, and his head hung. They sit side by side on the satin, a grin given by Jenny to David, then forward is reached and a banana is grabbed. Sun shines on the Eiffel Tower as the booksellers are wandered among by Jenny and David, in film star sunglasses, on the banks of the Seine. A book that she loves is found by Jenny, and a look is given imploringly to David, who smiles and his wallet is reached for, her hand held as a high wall is walked along. Jenny is boxed into position by David for a photo with Notre Dame Cathedral in the background; she poses, and a check-out is given by a guy on a bicycle as he rides past. David is less than impressed, then another photo is taken by him. Steep stone steps are run up, and arm in arm is walked, other couples slow dancing are joined in the sunshine to a record playing on a small portable turntable. Cheek to cheek is lain by them, and wine is drunk with a picnic by the river at dusk, where Jenny's head rests on David's shoulder. In the morning, the great dome of the Sacre-Coeur is looked out at by Jenny from their hotel, a smile given, a moment thought of, then a shake of the head. A bottle of Chanel is put on her teacher's desk by Jenny but, disappointedly, back in her satchel is put by her as the teacher looks up when her departure is made. The words hit home, and hard thinking is done by Jenny, a challenge given with a look to Miss Stubs, but a turn away is done by Miss Stubs. Gray hounds burst out of starting gates onto the track as the crowd includes Jenny, David, Danny, and Helen. The stands are climbed to a private suite where a handshake is given to a man by the door by David, then a filing in is done. Her coat is given to Danny by Jenny while their contact holds court in a white dinner jacket, and off is moved by Danny and David. Champagne is drunk by Jenny and Helen, then Jenny is led by Danny to the dance floor where a flirtatious moving occurs. Worriedly, Helen watches David as Jenny and Danny dance, their eyes locked together, Jenny's smiling gaze never wavering from his."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jack is puzzled as Jenny picks up her parcels and enters the living room, glaring at her father, David, who hangs his head. Jenny sighs as David gleams at her, trying to suppress a grin, before they leave for the evening. Jenny surveys the sparsely furnished room with modern wooden furniture and glances at him. Later, they lie in bed kissing face to face. David rises in pajama bottoms as Jenny adjusts her nightie and watches him move to the other room. Jenny, stumped, buries her face in her pillow, while David returns to the bed, studies her, smiles apologetically, and hangs his head. They sit side by side on the satin as Jenny grins at David and grabs a banana. Sunlight hits the Eiffel Tower as Jenny and David, in sunglasses, wander among booksellers by the Seine. Jenny finds a beloved book and looks imploringly at David, who smiles, takes out his wallet, and holds her hand as they walk. David positions Jenny for a photo with Notre Dame in the background; she poses, and a cyclist notices her as he passes by. David, unimpressed, takes another photo. They run up stone steps and walk arm in arm, joining couples dancing in the sun to a portable turntable. They lie cheek to cheek, drinking wine with a picnic by the river at dusk, where Jenny rests on David's shoulder. The next morning, Jenny gazes at Sacre-Coeur’s dome from their hotel, smiles, ponders, then shakes her head. She places a bottle of Chanel on her teacher's desk but returns it to her satchel as the teacher notices her departure. The words resonate, and Jenny challenges Miss Stubs with a look, who turns away. Greyhounds burst from starting gates as Jenny, David, Danny, and Helen are in the crowd. They climb to a private suite where David greets a man, then they enter. Jenny gives her coat to Danny as their contact holds court in a white jacket, and Danny and David leave. Jenny and Helen drink champagne, then Danny leads Jenny to the dance floor, where they flirt. Helen watches David’s reaction as Jenny and Danny dance, eyes and smiles locked."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jack feels bewildered as Jenny collects her parcels and enters the living room, glaring at her father, David. David hangs his head while Jenny suppresses a grin, and they drive off for the evening. Jenny glances at the sparsely furnished room, then later, they are in bed, kissing. David rises as Jenny adjusts her nightie. Jenny buries her face in her pillow as David apologetically smiles. Sitting side by side, Jenny grins, grabs a banana. The sun shines on the Eiffel Tower as they wander by the Seine's booksellers. Jenny finds a book, looks at David, who smiles, pays, and they walk hand-in-hand. David photographs Jenny by Notre Dame, unimpressed as a cyclist checks her out. They climb steps, dance in the sun, then share wine by the river. In the morning, Jenny looks at Sacre-Coeur, smiles, but shakes her head. She hesitates to give her teacher Chanel but rethinks as they converse. At the racetrack, gray hounds race as they move to a suite. Jenny drinks champagne and dances flirtatiously with Danny, watched by David as she locks eyes with Danny."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jack finds himself utterly bewildered as he observes Jenny picking up her parcels with a determined air and promptly heading into the living room. She shoots a piercing glare at her father, David, who, seemingly fraught with emotion, bows his head in response while Jenny lets out a long, resigned sigh. Jack is caught in a dilemma, grappling with what his next move should be as he watches the interaction unfold. Meanwhile, David offers Jenny a gleaming look of warmth, to which she responds with an effort to suppress a broad, joyful grin, before the two of them head out and drive off to enjoy their evening.\n\nIn the sparsely furnished room, adorned with sleek, modern wooden furniture, Jenny casts her gaze around and glances meaningfully at Jack. As the later hours unfold, they find themselves lying intimately in bed together, engaged in a tender exchange of kisses, their faces close. At one point, David rises from the bed, clad in just his pajama bottoms, while Jenny sits up, her eyes following him as he moves through to the adjacent room. She adjusts her nightie with a twinge of self-consciousness. Feeling utterly stumped, Jenny buries her face in her pillow, overwhelmed by emotion. David, meanwhile, returns to the bed, flopping down beside her, studying her uncertainly before offering an apologetic smile and hanging his head once more. They position themselves side by side on the smooth satin sheets as Jenny, grinning from ear to ear at David, reaches forward to grab a banana.\n\nThe sun casts its brilliant light on the iconic Eiffel Tower as Jenny and David, both donning glamorous film star sunglasses, leisurely stroll among the charming booksellers along the picturesque banks of the Seine. Jenny spots a book that captivates her, gazing imploringly at David, who responds with a warm smile, reaching for his wallet and holding her hand, guiding her as they walk together along a high stone wall. David skillfully maneuvers Jenny into position for a photograph with the majestic Notre Dame Cathedral serving as a breathtaking backdrop. As she poses, a cyclist rides by, checking her out with evident interest, but David, unimpressed by the cyclist's attention, takes another photo.\n\nThey energetically run up steep, winding stone steps and walk arm in arm, seamlessly joining numerous other couples who are joyfully slow dancing in the radiant sunshine to the melodic tunes playing on a small portable turntable. In the romantic setting by the river at dusk, they lie cheek to cheek, savoring relaxing wine and a delightful picnic, with Jenny resting her head contentedly on David's shoulder.\n\nAs the morning light streams in, Jenny gazes out from their hotel, her eyes settling on the grand dome of the Sacre-Coeur, smiling softly. She pauses for a moment, contemplating deeply, and then shakes her head, lost in thought. She later places a bottle of Chanel perfume on her teacher's desk, only to disappointingly return it to her satchel when the teacher looks up as she leaves. The words spoken truly resonate with her, prompting Jenny to think critically, challenging Miss Stubs with an intense, questioning look. However, Miss Stubs chooses to turn away, ignoring the silent confrontation.\n\nGreyhounds burst energetically out of the starting gates onto the track, while Jenny, David, Danny, and Helen find themselves amidst the crowded stands. They ascend the stairs to a more exclusive private suite, where David greets a man at the door with a firm handshake before they all file into the room. Jenny entrusts her coat to Danny as their contact, donned in a sophisticated white dinner jacket, holds court. As Danny and David move away, Jenny and Helen sip champagne, enjoying the moment. Danny then leads Jenny to the dance floor, where they move with flirtatious grace. Helen watches with a hint of worry as David observes them closely, captivated by Jenny and Danny's dance, their eyes locked together, and Jenny's smile unwavering, holding Danny's gaze with an undeniable connection."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jack finds himself utterly bewildered and confused as he observes Jenny, who has a determined and purposeful air about her, picking up her parcels with swift efficiency and promptly heading into the living room with a sense of resolve. She shoots a piercing, intense glare at her father, David, who appears fraught with deep emotion and immediately bows his head in response. As if feeling the weight of the situation, Jenny lets out a long, resigned sigh, indicating her inner turmoil. Jack is caught in a dilemma, grappling with what his next move should be as he watches the interaction unfold before his eyes. Meanwhile, David offers Jenny a gleaming look filled with warmth, to which she responds by making an effort to suppress a broad, joyful grin, before the two of them eventually head out and drive off together to enjoy their evening.\n\nIn the sparsely furnished room, adorned with sleek and modern wooden furniture, Jenny casts her gaze around thoughtfully and glances meaningfully at Jack. As the later hours gradually unfold, they find themselves intimately lying in bed together, engaged in a tender exchange of kisses, their faces close together in affection. At one point, David rises from the bed, clad in just his pajama bottoms, while Jenny sits up, her eyes following him as he moves through to the adjacent room. She adjusts her nightie with a twinge of self-consciousness. Feeling utterly stumped, Jenny buries her face in her pillow, overwhelmed by a flood of emotion. David, meanwhile, returns to the bed, flopping down beside her, studying her uncertainly before offering an apologetic smile and hanging his head once more. They position themselves side by side on the smooth satin sheets as Jenny, grinning from ear to ear at David, reaches forward to grab a banana.\n\nThe sun casts its brilliant and luminous light on the iconic Eiffel Tower as Jenny and David, both donning glamorous film star sunglasses, leisurely stroll among the charming booksellers along the picturesque banks of the Seine. Jenny spots a book that captivates her attention, gazing imploringly at David, who responds with a warm smile, reaching for his wallet and gently holding her hand, guiding her as they walk together along a high stone wall. David skillfully maneuvers Jenny into position for a photograph with the majestic and magnificent Notre Dame Cathedral serving as a breathtaking backdrop. As she poses, a cyclist rides by, checking her out with evident interest, but David, unimpressed by the cyclist's attention, takes another photo.\n\nThey energetically run up steep, winding stone steps and walk arm in arm, seamlessly joining numerous other couples who are joyfully slow dancing in the radiant sunshine to the melodic tunes playing on a small portable turntable. In the romantic setting by the river at dusk, they lie cheek to cheek, savoring relaxing wine and a delightful picnic, with Jenny resting her head contentedly on David's shoulder.\n\nAs the soft, golden morning light streams in, Jenny gazes out from their hotel, her eyes settling on the grand and imposing dome of the Sacre-Coeur, smiling softly. She pauses for a moment, contemplating deeply, and then shakes her head, lost in thought. She later places a bottle of Chanel perfume on her teacher's desk, only to disappointingly return it to her satchel when the teacher looks up as she leaves. The words spoken truly resonate with her, prompting Jenny to think critically, challenging Miss Stubs with an intense, questioning look. However, Miss Stubs chooses to turn away, ignoring the silent confrontation.\n\nGreyhounds burst energetically out of the starting gates onto the track, while Jenny, David, Danny, and Helen find themselves amidst the crowded stands. They ascend the stairs to a more exclusive private suite, where David greets a man at the door with a firm and confident handshake before they all file into the room. Jenny entrusts her coat to Danny as their contact, donned in a sophisticated white dinner jacket, holds court. As Danny and David move away, Jenny and Helen sip champagne, enjoying the elegant and festive moment. Danny then leads Jenny to the dance floor, where they move with flirtatious grace. Helen watches with a hint of worry as David observes them closely, captivated by Jenny and Danny's dance, their eyes locked together, and Jenny's smile unwavering, holding Danny's gaze with an undeniable and palpable connection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jack finds himself confused and disoriented as he watches Jenny delicately gather her parcels, each one carefully cradled in her arms, before she makes her way with purpose into the living room. Her eyes narrow in a glare at her father, David, who stands with a heavy heart, his head bowed in resignation, causing Jenny to release a weary sigh. Jack hesitates, unsure of his next action, while David's eyes twinkle when they meet Jenny's, who, despite trying, cannot suppress a broad grin that spreads across her face. Together, they eventually get into their car, settle into the seats, and drive off into the evening. Jenny surveys the sparsely decorated room, her eyes tracing over the modern wooden furniture around her, and then she glances pointedly at Jack. Later that evening, they lie together in bed, intimately close, exchanging gentle kisses as they look into each other's faces. David, dressed in his pajama bottoms, rises from the bed with a quiet rustle and pads softly to the other room. Jenny watches him go with a hint of self-consciousness, adjusting her nightie as he leaves. Feeling stuck, Jenny buries her face into the softness of her pillow while David returns, flopping down onto the bed's inviting surface. He gazes at her with an expression of uncertainty, offers her an apologetic smile, and then drops his head in a gesture of regret. They find themselves sitting next to each other on the satin-covered bed as Jenny's lips curve into a grin directed at David, her arms reaching out to grab hold of a banana from nearby. In the bright sunlight, the Eiffel Tower stands majestic as Jenny and David, each sporting glamorous film star sunglasses, leisurely wander through the bookstalls along the banks of the Seine. Jenny's eyes light up as she discovers a book that captures her interest; she turns to David with an imploring look. He responds with a warm smile and reaches into his pocket for his wallet, their hands entwined as they stroll along the high wall. David carefully maneuvers Jenny into position, ensuring the Notre Dame Cathedral serves as the perfect backdrop for a photo; she strikes a pose just as a cyclist rides by, giving her an appreciative look. David, unimpressed, snaps another picture. The couple races up steep stone steps, their laughter echoing, and then, linked arm in arm, they join other couples who are slow dancing under the sun's rays to the music wafting from a small portable turntable. They recline side by side, cheek to cheek, savoring wine and a lovingly prepared picnic by the river at dusk, where Jenny lets her head rest gently on David's shoulder. As morning light spills into their hotel room, Jenny stands gazing out at the grand dome of the Sacre-Coeur, a smile playing on her lips. She pauses for a moment of contemplation and then gently shakes her head. During the school day, Jenny approaches her teacher's desk and places a bottle of Chanel perfume on it. However, as the teacher glances up, Jenny's disappointment is palpable, and she quietly retrieves the bottle, tucking it back into her satchel. The teacher's words resonate deeply, prompting Jenny to think carefully and challenge Miss Stubs with a determined look, though Miss Stubs ultimately turns away, evading her gaze. Meanwhile, greyhounds burst energetically from their starting gates onto the track, stirring excitement among the crowd that includes Jenny, David, Danny, and Helen. The group ascends the stands, making their way to a private suite where David warmly shakes hands with a man positioned by the door before they all file into the room. Jenny casually hands her coat to Danny while their contact holds sway in an elegant white dinner jacket, and soon, Danny and David drift away into the crowd. Jenny and Helen indulge in glasses of champagne, savoring each sip until Danny gestures for Jenny to join him, leading her to the dance floor where they move together in a flirtatious dance. Helen watches with concern as David's eyes remain fixed on Jenny and Danny, who dance with an intensity, their eyes locked and Jenny's unwavering gaze fixed on Danny's face, a smile gracing her features."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jack is bewildered as Jenny, after picking up her parcels, enters the living room and glares at her father, David, who shows remorse as Jenny sighs. Struggling with his next move, Jack observes David and Jenny exchange knowing glances, suppressing smiles before they leave for the evening. In the sparsely furnished room, Jenny briefly surveys the modern wooden furniture and exchanges a glance with him. Later, while they lie in bed, David rises in his pajama bottoms and moves to another room as Jenny adjusts her nightie. Confused, Jenny buries her face in her pillow while David returns, giving her an apologetic smile before sitting beside her. They share a moment of closeness, with Jenny grinning and reaching for a banana. Under the sun by the Eiffel Tower, Jenny and David, wearing sunglasses, explore the Seine's booksellers. Jenny finds a book she loves, prompting David to buy it before they continue walking hand-in-hand. At Notre Dame, David captures a photo of Jenny, while a passing cyclist notices her, but David's focus remains on her. They later climb steps and dance in the sun with other couples. By the river, they enjoy a picnic, sharing wine as Jenny rests on David's shoulder. The following morning, Jenny gazes at the Sacre-Coeur from their hotel, contemplates, then dismisses her thoughts. At school, she places a Chanel bottle on her teacher's desk, only to put it back in her satchel as the teacher looks on. The teacher's words resonate, prompting Jenny to challenge Miss Stubs with a look, though Miss Stubs avoids it. At the racetrack, Jenny, David, Danny, and Helen watch greyhounds burst from the gates. They proceed to a private suite where David greets a man, and Jenny hands her coat to Danny. As Danny and David converse, Jenny and Helen enjoy champagne before Jenny dances flirtatiously with Danny, her eyes locked with his, while Helen worries about David's reaction."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jack's flummoxed as Jenny picks up her parcels, carrying items from a popular local boutique known for its eclectic range, and goes into the living room, glaring at her father, David, a high school literature teacher known for his stern yet fair demeanor, who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny, who tries to suppress a broad grin, before they drive off for the evening in David's classic vintage car, which he lovingly restored over years. Jenny looks around the sparsely furnished room with modern wooden furniture, a minimalist design inspired by Scandinavian trends, and shoots him a glance. Later, they are lying in bed together in a cozy B&B known for its romantic ambiance, kissing face to face. In his pajama bottoms decorated with tiny sailboats reminiscent of summer days at the lake, David gets up while Jenny sits up, watching him go through to the other room as she self-consciously adjusts her nightie, a gift from her grandmother that holds sentimental value. Jenny is stumped and buries her face in her pillow, while David flops down on the bed, studies her uncertainly, smiles apologetically, and hangs his head. They sit side by side on the satin, imported from Italy, as Jenny grins at David, then reaches forward and grabs a banana from a fruit bowl on the nightstand. Sun shines on the Eiffel Tower, an iconic symbol of Paris, as Jenny and David, in film star sunglasses reminiscent of Audrey Hepburn’s glamorous style, wander among booksellers on the banks of the Seine, a tradition dating back to the 16th century. Jenny finds a book she loves, a rare edition of 'Les Misérables', and looks imploringly at David, who smiles and reaches for his wallet, holding her hand as they walk along a high wall of the ancient city fortifications. David boxes Jenny into position for a photo with Notre Dame Cathedral in the background, a masterpiece of French Gothic architecture; she poses, and a guy on a bicycle checks her out as he rides past, symbolizing the carefree Parisian lifestyle. David is less than impressed, then takes another photo. They run up steep stone steps of Montmartre and walk arm in arm, joining other couples slow dancing in the sunshine to a record playing on a small portable turntable, a nostalgic nod to the past. They lie cheek to cheek and drink wine, a fine Bordeaux, with a picnic by the river at dusk, where Jenny rests her head on David's shoulder. In the morning, Jenny looks out from their hotel at the great dome of the Sacre-Coeur, a basilica with breathtaking panoramic views of the city, smiles, thinks for a moment, then shakes her head. Jenny puts a bottle of Chanel, a gift she had saved for a special occasion, on her teacher's desk but, disappointedly, puts the bottle back in her satchel as the teacher looks up when she leaves. The words hit home, and Jenny thinks hard, challenging Miss Stubs, known for her formidable intellect, with a look, but Miss Stubs turns away. Gray hounds, bred for their speed and agility, burst out of starting gates onto the track as Jenny, David, Danny, and Helen are in the crowd. They climb the stands to a private suite where David shakes hands with a man by the door, a local business mogul with deep connections in the city's elite circles, then they file in. Jenny gives her coat to Danny, her childhood friend who always had her back, while their contact, who exudes an air of old-world charm in a white dinner jacket, holds court, and Danny and David move off. Jenny and Helen drink champagne, a vintage Moët & Chandon, then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together, Jenny smiling with her gaze never wavering from his, a silent testament to their shared history."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance Later they are lying in bed together kissing face to face In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off Later they are lying in bed together kissing face to face Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie David boxes Jenny into position for a photo with Notre Dame Cathedral in the background Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance she poses and a guy on a bicycle checks her out as he rides past David is less than impressed then takes another photo then Danny leads Jenny to the dance floor where they move flirtatiously They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder Jenny smiling with her gaze never wavering from his Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd They climb the stands to a private suite where David shakes hands with a man by the door Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder then they file in Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off Jenny and Helen drink champagne then Danny leads Jenny to the dance floor where they move flirtatiously Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together Jenny smiling with her gaze never wavering from his"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening. Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance. Later they are lying in bed together kissing face to face. In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie. Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head. They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana. Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine. Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall. David boxes Jenny into position for a photo with Notre Dame Cathedral in the background. she poses and a guy on a bicycle checks her out as he rides past. David is less than impressed then takes another photo. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable. They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder. In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head. Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves. The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away. Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd. They climb the stands to a private suite where David shakes hands with a man by the door. then they file in. Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off. Jenny and Helen drink champagne. then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together. Jenny smiling with her gaze never wavering from his."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening. Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance. Later they are lying in bed together kissing face to face. In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie. Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head. They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana. Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine. Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall. David boxes Jenny into position for a photo with Notre Dame Cathedral in the background. she poses and a guy on a bicycle checks her out as he rides past. David is less than impressed then takes another photo. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable. They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder. In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head. Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves. The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away. Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd. They climb the stands to a private suite where David shakes hands with a man by the door. then they file in. Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off. Jenny and Helen drink champagne. then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together. Jenny smiling with her gaze never wavering from his."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening. Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance. Later they are lying in bed together kissing face to face. In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie. Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head. They climb the stands to a private suite where David shakes hands with a man by the door. then they file in. Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off. Jenny and Helen drink champagne. then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together. Jenny smiling with her gaze never wavering from his."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening. then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together. Jenny smiling with her gaze never wavering from his."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Tom's flummoxed as Rachel picks up her parcels and goes into the living room, glaring at her mother, Linda, who hangs her head while Rachel sighs. Tom struggles to make the next move as Linda gleams at Rachel, who tries to suppress a broad grin, before they drive off for the evening. Rachel looks around the sparsely furnished room with modern wooden furniture and shoots him a glance. Later, they are lying in bed together, kissing face to face. In his pajama bottoms, Linda gets up while Rachel sits up, watching her go through to the other room as she self-consciously adjusts her nightie. Rachel is stumped and buries her face in her pillow, while Linda flops down on the bed, studies her uncertainly, smiles apologetically, and hangs her head. They sit side by side on the satin as Rachel grins at Linda, then reaches forward and grabs a banana. Sun shines on the Eiffel Tower as Rachel and Linda, in film star sunglasses, wander among booksellers on the banks of the Seine. Rachel finds a book she loves and looks imploringly at Linda, who smiles and reaches for her wallet, holding her hand as they walk along a high wall. Linda boxes Rachel into position for a photo with Notre Dame Cathedral in the background; she poses, and a guy on a bicycle checks her out as he rides past. Linda is less than impressed, then takes another photo. They run up steep stone steps and walk arm in arm, joining other couples slow dancing in the sunshine to a record playing on a small portable turntable. They lie cheek to cheek and drink wine with a picnic by the river at dusk, where Rachel rests her head on Linda's shoulder. In the morning, Rachel looks out from their hotel at the great dome of the Sacre-Coeur, smiles, thinks for a moment, then shakes her head. Rachel puts a bottle of Chanel on her friend's desk but, disappointedly, puts the bottle back in her satchel as the friend looks up when she leaves. The words hit home, and Rachel thinks hard, challenging Mr. Green with a look, but Mr. Green turns away. Gray hounds burst out of starting gates onto the track as Rachel, Linda, Simon, and Monica are in the crowd. They climb the stands to a private suite where Linda shakes hands with a woman by the door, then they file in. Rachel gives her coat to Simon while their contact holds court in a white dinner jacket, and Simon and Linda move off. Rachel and Monica drink champagne, then Simon leads Rachel to the dance floor where they move flirtatiously. Monica worriedly watches Linda watching them as Rachel and Simon dance with their eyes locked together, Rachel smiling with her gaze never wavering from his."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jack's flummoxed as Jenny picks up her bouquets and goes into the greenhouse, glaring at her father, David, who hangs his head while Jenny sighs. Jack struggles to make the next move as David gleams at Jenny, who tries to suppress a broad grin, before they sail off for the evening. Jenny looks around the sparsely furnished garden with ornate metal furniture and shoots him a glance. Later, they are lying in a hammock together, kissing face to face. In his pajama bottoms, David gets up while Jenny sits up, watching him go through to the other corner as she self-consciously adjusts her robe. Jenny is stumped and buries her face in her pillow, while David flops down on the hammock, studies her uncertainly, smiles apologetically, and hangs his head. They sit side by side on the grass as Jenny grins at David, then reaches forward and grabs a plum. Sun shines on the Statue of Liberty as Jenny and David, in aviator sunglasses, wander among street vendors on the docks of the Hudson. Jenny finds a trinket she loves and looks imploringly at David, who smiles and reaches for his wallet, holding her hand as they walk along a narrow alley. David boxes Jenny into position for a photo with the Brooklyn Bridge in the background; she poses, and a guy on roller skates checks her out as he glides past. David is less than impressed, then takes another photo. They run up steep wooden steps and walk arm in arm, joining other couples slow dancing in the moonlight to a boombox playing on a narrow balcony. They lie cheek to cheek and drink lemonade with a picnic by the lake at dusk, where Jenny rests her head on David's shoulder. In the morning, Jenny looks out from their cabin at the tall spires of the Empire State Building, smiles, thinks for a moment, then shakes her head. Jenny puts a bottle of perfume on her mentor's desk but, disappointedly, puts the bottle back in her tote bag as the mentor looks up when she leaves. The words hit home, and Jenny thinks hard, challenging Miss Stubs with a look, but Miss Stubs turns away. White rabbits burst out of starting pens onto the field as Jenny, David, Danny, and Helen are in the crowd. They climb the bleachers to a private box where David shakes hands with a man by the door, then they file in. Jenny gives her shawl to Danny while their contact holds court in a red dinner jacket, and Danny and David move off. Jenny and Helen drink cider, then Danny leads Jenny to the dance floor where they move flirtatiously. Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together, Jenny smiling with her gaze never wavering from his."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jack's flabbergasted as Jenny lifts her parcels and dances into the living room, winking at her father, David, who raises his head while Jenny laughs. Jack hesitates to take the next step as David beams at Jenny, who tries to hide a wide smirk, before they fly off for the evening. Jenny scans the sparsely decorated room with modern wooden furniture and throws him a glance. Later, they are lying in bed together, whispering face to face. In his pajama bottoms, David jumps up while Jenny stands up, observing him prance through to the other room as she awkwardly straightens her nightie. Jenny is confounded and hides her face in her pillow, while David bounces down on the bed, examines her uncertainly, grins shyly, and raises his head. They perch side by side on the satin as Jenny chuckles at David, then leans forward and peels a banana. Sun gleams on the Eiffel Tower as Jenny and David, in film star sunglasses, skip among booksellers on the banks of the Seine. Jenny discovers a book she adores and gazes imploringly at David, who laughs and reaches for his wallet, squeezing her hand as they skip along a high wall. David positions Jenny into place for a photo with Notre Dame Cathedral in the background; she poses, and a guy on a bicycle winks at her as he glides past. David is less than amused, then takes another snapshot. They leap up steep stone steps and stroll arm in arm, joining other couples swaying in the sunshine to a record playing on a small portable turntable. They lean cheek to cheek and sip wine with a picnic by the river at dusk, where Jenny leans her head on David's shoulder. In the morning, Jenny peers out from their hotel at the great dome of the Sacre-Coeur, smirks, ponders for a moment, then nods her head. Jenny sets a bottle of Chanel on her teacher's desk but, ruefully, tucks the bottle back in her satchel as the teacher glances up when she departs. The words resonate, and Jenny ponders deeply, confronting Miss Stubs with a look, but Miss Stubs glances away. Gray hounds leap out of starting gates onto the track as Jenny, David, Danny, and Helen are in the crowd. They ascend the stands to a private suite where David embraces a man by the door, then they waltz in. Jenny hands her coat to Danny while their contact holds court in a white dinner jacket, and Danny and David drift off. Jenny and Helen sip champagne, then Danny guides Jenny to the dance floor where they sway flirtatiously. Helen anxiously observes David observing them as Jenny and Danny twirl with their eyes locked together, Jenny grinning with her gaze never faltering from his."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Max is bewildered as Clara picks up her socks and goes into the kitchen, glaring at her uncle, Paul, who hangs his head while Clara sighs. Max struggles to make the next move as Paul gleams at Clara, who tries to suppress a broad grin, before they skip off for the afternoon. Clara looks around the densely decorated garage with vintage metal appliances and shoots him a glance. Later, they are lying on the couch together, laughing side by side. In his gym shorts, Paul gets up while Clara sits up, watching him go through to the attic as she self-consciously adjusts her sweater. Clara is perplexed and buries her face in the cushion, while Paul flops down on the couch, studies her uncertainly, smiles apologetically, and hangs his head. They sit side by side on the grass as Clara smirks at Paul, then reaches forward and grabs a broomstick. Snow falls on the Coliseum as Clara and Paul, in pilot goggles, wander among bakers on the docks of the Thames. Clara finds a scarf she adores and looks imploringly at Paul, who smiles and reaches for his phone, holding her hand as they walk along a narrow footpath. Paul sketches Clara into a position for a drawing with the Pyramids in the background; she poses, and a child on a skateboard checks her out as he glides past. Paul is less than amused, then takes another sketch. They climb up tall ladders and walk hand in hand, joining other duos slow skating in the moonlight to a melody playing on a small portable speaker. They lie back to back and sip coffee with a snack by the pond at dawn, where Clara rests her head on Paul's lap. In the evening, Clara looks out from their cottage at the vast gardens of the Villa Borghese, smiles, thinks for a minute, then nods her head. Clara puts a bouquet of roses on her coach's chair but, disappointingly, puts the bouquet back in her backpack as the coach looks up when she exits. The gestures make sense, and Clara contemplates deeply, challenging Mr. Bubbles with a look, but Mr. Bubbles turns away. Orange balloons burst out of gift boxes onto the yard as Clara, Paul, Tony, and Grace are in the park. They climb the benches to a public booth where Paul shakes hands with a woman by the entrance, then they filter in. Clara gives her scarf to Tony while their guide holds court in a blue jumpsuit, and Tony and Paul move off. Clara and Grace sip tea, then Tony leads Clara to the garden where they move playfully. Grace worriedly observes Paul watching them as Clara and Tony dance with their eyes locked together, Clara smiling with her gaze never wavering from his."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam's stunned as Lisa gathers her documents and wanders into the kitchen, scowling at her brother, Michael, who droops his shoulders while Lisa chuckles. Sam hesitates to take the next step as Michael beams at Lisa, who attempts to hide a wide smile, before they sail away for the afternoon. Lisa glances around the modestly decorated room with sleek metal furnishings and tosses him a look. Later, they are lounging on the couch together, talking face to face. In his track pants, Michael rises while Lisa stretches out, observing him wander to the other room as she awkwardly straightens her robe. Lisa is flabbergasted and hides her face in her cushion, while Michael collapses on the couch, examines her uncertainly, grins sheepishly, and droops his shoulders. They sit side by side on the leather as Lisa laughs at Michael, then leans forward and grabs an apple. Clouds drift past Big Ben as Lisa and Michael, in oversized hats, meander among artists on the streets of Soho. Lisa finds a painting she adores and gazes hopefully at Michael, who grins and reaches for his phone, gripping her hand as they stroll along an old bridge. Michael nudges Lisa into place for a snapshot with Tower Bridge in the background; she strikes a pose, and a passerby glances at her as he strolls past. Michael is mildly amused, then captures another snapshot. They dash up narrow alleyways and stroll hand in hand, joining other duos swaying slowly in the twilight to a tune playing on a small portable speaker. They sit shoulder to shoulder and sip soda with a meal by the water at dawn, where Lisa rests her head on Michael's arm. In the evening, Lisa stares out from their room at the towering spires of Westminster Abbey, smirks, contemplates briefly, then nods her head. Lisa places a bouquet of roses on her mentor's desk but, regretfully, places the flowers back in her backpack as the mentor glances up when she departs. The conversation resonates deeply, and Lisa ponders intensely, confronting Mr. Wells with a stare, but Mr. Wells looks away. Brown horses charge out of the barns onto the field as Lisa, Michael, Tom, and Alice are among the spectators. They ascend the seats to a private box where Michael embraces a man by the entrance, then they shuffle inside. Lisa hands her scarf to Tom while their contact commands attention in a navy blazer, and Tom and Michael drift away. Lisa and Alice sip cocktails, then Tom guides Lisa to the dance area where they sway playfully. Alice anxiously watches Michael eyeing them as Lisa and Tom dance with their eyes fixed on each other, Lisa grinning with her gaze never dropping from his."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jack's puzzled as Jenny lifts her guitars and dances into the dining room, glancing at her father, David, who raises his chin while Jenny chuckles. Jack grapples to decide the next course as David winks at Jenny, who tries to conceal a wide frown, before they sail away for the night. Jenny inspects the cluttered kitchen with vintage leather sofas and tosses him a wink. Later, they are standing in the kitchen together, whispering ear to ear. In his tuxedo jacket, David sits down while Jenny stands up, watching him dig through to the attic as she clumsily buttons her coat. Jenny is bewildered and hides her face in her book, while David bounces on the carpet, examines her thoughtfully, frowns cheerfully, and raises his chin. They stand side by side on the velvet as Jenny frowns at David, then leans backward and catches an apple. Moon beams on the Colosseum as Jenny and David, in clown hats, meander among painters on the hills of Rome. Jenny spots a painting she despises and gestures pleadingly at David, who frowns and reaches for his backpack, holding her elbow as they skip along a low fence. David nudges Jenny into stance for a sketch with the Leaning Tower of Pisa in the background; she frowns, and a guy on a skateboard admires her as he glides past. David is more than amused, then draws another sketch. They tiptoe down rocky paths and skip hand in hand, joining other duos fast dancing in the moonlight to a flute playing on a large stationary piano. They lean back to back and sip coffee with a barbecue by the fountain at dawn, where Jenny lays her hand on David's arm. In the evening, Jenny peers out from their chalet at the narrow spire of St. Peter's Basilica, scowls, ponders for a moment, then nods her head. Jenny places a jar of honey on her friend's table but, eagerly, puts the jar back in her backpack as the friend glances up when she enters. The sounds resonate, and Jenny ponders deeply, confronting Miss Stubs with a gesture, but Miss Stubs faces the wall. Blue turtles splash out of crashing waves onto the shore as Jenny, David, Danny, and Helen are on the beach. They descend the pier to a public booth where David high-fives a woman by the entrance, then they stroll in. Jenny tosses her hat to Danny while their associate hosts a show in a black tuxedo, and Danny and David drift away. Jenny and Helen sip tea, then Danny escorts Jenny to the painting gallery where they sway boldly. Helen eagerly watches David surveying them as Jenny and Danny sway with their eyes locked together, Jenny frowning with her gaze never straying from his."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bill's puzzled as Laura hoists up her sculptures and slips into the kitchen, glaring at her brother, Eric, who raises his chin while Laura giggles. Bill falters to perform the final act as Eric beams at Laura, who attempts to hide a slight frown, before they march away for the afternoon. Laura surveys the heavily adorned space with vintage metal gadgets and throws him a nod. Later, they are sitting on the couch together, whispering nose to nose. In his denim jeans, Eric stands up while Laura lounges back, watching him tiptoe through to the adjacent hall as she absent-mindedly straightens her scarf. Laura is confused and hides her head in her jacket, while Eric slumps onto the sofa, observes her doubtfully, frowns sheepishly, and raises his chin. They relax side by side on the carpet as Laura frowns at Eric, then leans backward and grabs a notebook. Moonlight reflects on the Statue of Liberty as Laura and Eric, in aviator goggles, stroll among painters on the boardwalk of the Thames. Laura uncovers a painting she admires and glances pleadingly at Eric, who frowns and searches for his keys, holding her elbow as they skip along a low bench. Eric poses Laura into place for a snapshot with Big Ben in the distance; she stands, and a boy on a scooter admires her as he zooms by. Eric is far from amused, then clicks another picture. They skip up worn marble stairs and walk hand in hand, joining other friends slow clapping in the moonlight to a song blaring from a large portable speaker. They lean ear to ear and sip soda with a feast by the lake at dawn, where Laura rests her chin on Eric's elbow. In the afternoon, Laura peers out from their lodge at the massive spire of the Basilica, frowns, thinks for a while, then nods. Laura places a packet of mints on her aunt's table but, satisfied, tucks the packet back in her backpack as the aunt glances up when she arrives. The whispers take root, and Laura ponders deeply, challenging Miss Clark with a grin, but Miss Clark turns her back. White cats leap out of hiding holes onto the field as Laura, Eric, Tony, and Susan are in the stands. They ascend the escalators to a public balcony where Eric high-fives a woman by the railing, then they shuffle away. Laura hands her umbrella to Tony while their acquaintance holds sway in a black apron, and Tony and Eric drift away. Laura and Susan sip juice, then Tony guides Laura to the stage where they sway rhythmically. Susan nervously observes Eric observing them as Laura and Tony groove with their eyes dancing together, Laura frowning with her gaze never straying from his."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack is confused as Jenny collects her parcels and enters the living room, exchanging glances with her father, David. Despite the tension, Jenny and David share a moment of amusement before heading out for the evening. In a minimally furnished room, Jenny and David share an intimate moment later in bed. David gets up, leaving Jenny feeling awkward, yet they soon reconcile with playful banter and a shared smile, highlighted by Jenny playfully grabbing a banana. \n\nIn Paris, Jenny and David explore the city, visiting booksellers by the Seine where David buys Jenny a book. They capture memories with photos at Notre Dame and enjoy a romantic picnic by the river, basking in the joy of each other's company. The next morning, Jenny contemplates her choices while gazing at Sacre-Coeur from their hotel. Back at school, Jenny reconsiders giving a gift to her teacher, Miss Stubbs, after a moment of reflection.\n\nAt a greyhound race, Jenny and David mingle with friends Danny and Helen, moving to a private suite. Jenny hands her coat to Danny, and they share a flirtatious dance, sparking concern in Helen and drawing David's attention. Jenny remains focused on Danny, smiling as they dance together."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jenny smiling with her gaze never wavering from his Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together then Danny leads Jenny to the dance floor where they move flirtatiously Jenny and Helen drink champagne Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off then they file in They climb the stands to a private suite where David shakes hands with a man by the door Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable David is less than impressed then takes another photo she poses and a guy on a bicycle checks her out as he rides past David boxes Jenny into position for a photo with Notre Dame Cathedral in the background Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie Later they are lying in bed together kissing face to face Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable David boxes Jenny into position for a photo with Notre Dame Cathedral in the background then they file in They climb the stands to a private suite where David shakes hands with a man by the door They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head she poses and a guy on a bicycle checks her out as he rides past Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves Jenny and Helen drink champagne David is less than impressed then takes another photo Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head then Danny leads Jenny to the dance floor where they move flirtatiously They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie Jenny smiling with her gaze never wavering from his Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs Later they are lying in bed together kissing face to face Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They lie cheek to cheek and drink wine with a picnic by the river at dusk where Jenny rests her head on David's shoulder In the morning Jenny looks out from their hotel at the great dome of the SacreCoeur smiles thinks for a moment then shakes her head Jenny puts a bottle of Chanel on her teacher's desk but disappointedly puts the bottle back in her satchel as the teacher looks up when she leaves The words hit home and Jenny thinks hard challenging Miss Stubs with a look but Miss Stubs turns away Gray hounds burst out of starting gates onto the track as Jenny David Danny and Helen are in the crowd They climb the stands to a private suite where David shakes hands with a man by the door then they file in Jenny gives her coat to Danny while their contact holds court in a white dinner jacket and Danny and David move off Jenny and Helen drink champagne then Danny leads Jenny to the dance floor where they move flirtatiously Helen worriedly watches David watching them as Jenny and Danny dance with their eyes locked together Jenny smiling with her gaze never wavering from his Jack's flummoxed as Jenny picks up her parcels and goes into the living room glaring at her father David who hangs his head while Jenny sighs Jack struggles to make the next move as David gleams at Jenny who tries to suppress a broad grin before they drive off for the evening Jenny looks around the sparsely furnished room with modern wooden furniture and shoots him a glance Later they are lying in bed together kissing face to face In his pajama bottoms David gets up while Jenny sits up watching him go through to the other room as she selfconsciously adjusts her nightie Jenny is stumped and buries her face in her pillow while David flops down on the bed studies her uncertainly smiles apologetically and hangs his head They sit side by side on the satin as Jenny grins at David then reaches forward and grabs a banana Sun shines on the Eiffel Tower as Jenny and David in film star sunglasses wander among booksellers on the banks of the Seine Jenny finds a book she loves and looks imploringly at David who smiles and reaches for his wallet holding her hand as they walk along a high wall David boxes Jenny into position for a photo with Notre Dame Cathedral in the background she poses and a guy on a bicycle checks her out as he rides past David is less than impressed then takes another photo They run up steep stone steps and walk arm in arm joining other couples slow dancing in the sunshine to a record playing on a small portable turntable"
        }
      ]
    }
  ]
}