{
  "ground_truth": "David watches them expressionlessly. Helen looks bored, then smiles ruefully at David. David smiles, then turns to watch the dancers returning. Helen and Danny watch them leave. David and Jenny walk to the car park in their overcoats. David opens the boot and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home, she sits studying. She slams down her book. She opens the bedroom window. Smoking, she looks out to the street lights. Her parents are downstairs in the kitchen. Jenny watches her parents doing the washing up. It's an engagement ring. Miss Stubs looks daggers at her. The headmistress straightens archly. Jenny rolls her tear filled eyes. Jenny turns and walks out. Jenny walks down a corridor carrying her blazer and satchel. She glances into her classroom as she walks out of the school's main doors. She walks down the pavement, then breaks into a run. A gaggle of her friends watch her go. Danny's got a stuffed armadillo. Danny looks worried. David and Jenny leave Danny's place. They head for the car. David opens the door for her. They drive off into the London twilight. Marjorie eyes her husband reproachfully. David shakes Jack's hand. They troop out to the Bristol. They hit for town in the gathering twilight. They stop off at the petrol station. The attendant pumps the fuel. David goes into the shop of the village garage. Jenny reaches into the glove box for the cigarettes. The packet is empty. Jack manages to break a door handle. There's a pile of envelopes in the glove box. Jenny looks through them. David returns from the garage. David notices Jenny looks at the envelopes. Jenny sits expressionlessly as they drive back. Jenny gets out and steps away from the car. Her parents go indoors and David approaches Jenny. He shakes his head. She looks at the envelopes then shoves them back at him. David looks at her pleadingly. They stand apart. Jenny wipes tears from her face. David shakes his head. He opens the boot and takes the bottle from a case. Jenny eyes him frostily. She turns on her heel and walks indoors. David goes to the driver's door and gets in the car. Indoors Jenny stands for lonely in the hallway. David swigs from the bottle then drops it on the passenger seat. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Jenny fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Jenny's cheeks as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David observes them impassively. Helen appears uninterested, then grins wryly at David. David grins, then pivots to observe the dancers returning. Helen and Danny observe them depart. David and Jenny stroll to the car park in their overcoats. David unlatches the trunk and rifles inside. Her eyes roll up as she gazes at him. He attempts to grasp her hand. Back at home, she sits scrutinizing. She bangs down her tome. She unlatches the bedroom window. Smoking, she gazes out to the street lamps. Her parents are downstairs in the kitchen. Jenny observes her parents doing the washing up. It's an engagement band. Miss Stubs glowers at her. The headmistress adjusts primly. Jenny rolls her tear-filled eyes. Jenny pivots and proceeds out. Jenny strolls down a passage holding her blazer and satchel. She peers into her classroom as she proceeds out of the school's main doors. She strolls down the sidewalk, then breaks into a sprint. A cluster of her friends observe her depart. Danny's got a stuffed armadillo. Danny appears apprehensive. David and Jenny depart Danny's place. They proceed for the automobile. David unlatches the door for her. They drive away into the London dusk. Marjorie gazes at her spouse reproachfully. David shakes Jack's hand. They troop out to the Bristol. They head for town in the gathering dusk. They pause at the petrol station. The attendant pumps the fuel. David goes into the shop of the village garage. Jenny reaches into the glove compartment for the cigarettes. The packet is empty. Jack manages to break a door handle. There's a pile of envelopes in the glove compartment. Jenny examines them. David returns from the garage. David notices Jenny examines the envelopes. Jenny sits impassively as they drive back. Jenny exits and steps away from the automobile. Her parents go indoors and David approaches Jenny. He shakes his head. She examines the envelopes then shoves them back at him. David gazes at her imploringly. They stand apart. Jenny wipes tears from her face. David shakes his head. He unlatches the trunk and takes the bottle from a case. Jenny gazes at him icily. She turns on her heel and proceeds indoors. David goes to the driver's door and enters the automobile. Indoors Jenny stands solitarily in the hallway. David swigs from the bottle then drops it on the passenger seat. He stares despondently into the distance. His lower lip quivers as he begins to weep. Jenny fidgets in the hall staring at the front door. Hearing the automobile Jack rises and goes to the window. Tears trail down Jenny's cheeks as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Them are watched expressionlessly by David. Boredom is looked on Helen's face, then David is smiled at ruefully by her. A smile is given by David, then the dancers returning are watched by him. Them are watched leaving by Helen and Danny. To the car park in their overcoats, David and Jenny walk. The boot is opened by David and rummaged inside. Up her eyes wheel as he is looked at by her. Her hand is tried to be taken by him. Back at home, her studies are sat by her. Her book is slammed down by her. The bedroom window is opened by her. Smoking, the street lights are looked at by her. Her parents are doing the washing up in the kitchen downstairs. Her parents are watched by Jenny. An engagement ring is there. Daggers are looked at her by Miss Stubs. Archly, the headmistress is straightened. Her tear-filled eyes are rolled by Jenny. Out is walked by Jenny. Down a corridor carrying her blazer and satchel, Jenny walks. Into her classroom, a glance is taken by her as the school's main doors are walked out of. Down the pavement, she walks, then a run is broken into by her. Her go is watched by a gaggle of her friends. A stuffed armadillo is got by Danny. Worried, Danny looks. Danny's place is left by David and Jenny. The car is headed for by them. The door is opened for her by David. Into the London twilight, they drive off. Reproachfully, Marjorie eyes her husband. Jack's hand is shaken by David. To the Bristol, they troop out. In the gathering twilight, they hit for town. The petrol station is stopped off at. The fuel is pumped by the attendant. Into the shop of the village garage, David goes. For the cigarettes, the glove box is reached into by Jenny. Empty, the packet is. A door handle is managed to be broken by Jack. In the glove box, a pile of envelopes is. Through them, Jenny looks. From the garage, David returns. Jenny looking at the envelopes is noticed by David. Expressionlessly, Jenny sits as back they are driven. Out Jenny gets and steps away from the car. Indoors her parents go and to Jenny, David approaches. His head is shaken by him. The envelopes are looked at by her then they are shoved back at him. Pleadingly, she is looked at by David. Apart they stand. Tears from her face are wiped by Jenny. His head is shaken by David. The boot is opened and a bottle is taken from a case by him. Frostily, he is eyed by Jenny. On her heel, she turns and indoors she walks. To the driver's door, David goes and into the car he gets. Lonely in the hallway, Jenny stands indoors. From the bottle, a swig is taken by David then it is dropped on the passenger seat. Into the distance, he stares mournfully. As he starts to cry, his lower lip trembles. In the hall, Jenny fidgets staring at the front door. Hearing the car, Jack gets up and to the window he goes. Down Jenny's cheeks, tears run as past the window headlights sweep. Her head is hung by Jenny. A cricket ball is played with by Danny as with Jenny, Helen sits."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David watches them expressionlessly. Helen appears bored but then smiles ruefully at David. He smiles back and watches the dancers return. Helen and Danny watch them leave. David and Jenny head to the car park in their overcoats. David opens the boot, searching inside. Jenny’s eyes follow him, and he tries to hold her hand. Back home, Jenny studies but slams her book shut. She opens the window and, smoking, gazes at the street lights. Her parents are in the kitchen, washing up. Jenny sees her parents; there's an engagement ring. Miss Stubs glares at her, and the headmistress stands stiffly. Jenny rolls her tear-filled eyes and walks out. She carries her blazer and satchel down a corridor, glancing into her classroom as she exits the school. She walks down the pavement, then starts running, watched by friends. Danny’s worried, holding a stuffed armadillo. David and Jenny leave Danny’s, heading to the car. David opens her door and they drive into the London twilight. Marjorie reproaches her husband with a look. David shakes Jack’s hand as they leave for the Bristol. They drive to town as twilight gathers, stopping at a petrol station. The attendant fills the tank, and David visits the village garage shop. Jenny reaches for cigarettes in the glove box, finding it empty. Jack breaks a door handle. Jenny notices a pile of envelopes in the glove box. David returns, seeing her with the envelopes. Jenny rides silently as they drive back. She exits the car as her parents go inside, and David approaches. He shakes his head as Jenny shoves the envelopes back at him. David looks at her pleadingly while they stand apart. Jenny wipes away tears; David shakes his head, retrieves a bottle from the boot, and she enters the house coldly. David gets in the car, swigs from the bottle, and drops it on the seat, staring into the distance with trembling lips. Jenny fidgets in the hallway, staring at the door. Jack hears the car, looks out the window, and tears run down Jenny's face as headlights pass by. She hangs her head. Danny plays with a cricket ball while Helen sits with Jenny."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David watches blankly. Helen appears bored, then smiles ruefully at him. David smiles back and watches the dancers leave. Helen and Danny observe them. David and Jenny walk to the car in coats. David rummages in the boot. Jenny looks at him. He tries to hold her hand. At home, she studies, slams her book, opens the window, and smokes. Her parents are downstairs. Jenny sees them doing dishes. It's an engagement ring. Miss Stubs glares at her. The headmistress stands straight. Jenny rolls tear-filled eyes and leaves. She walks the corridor with her blazer and satchel, glancing into her classroom. She exits the school, then runs. Friends watch her leave. Danny has a stuffed armadillo and looks worried. David and Jenny leave Danny's place. They go to the car. David opens the door for her, and they drive off into the London twilight. Marjorie looks at her husband reproachfully. David shakes Jack's hand, and they go to the Bristol. They head into town at twilight, stopping at a petrol station. The attendant fuels up. David enters the village garage shop. Jenny finds an empty cigarette packet in the glove box and a pile of envelopes. David returns, notices Jenny with envelopes. Jenny expressionless as they drive back. She exits, her parents go inside, and David approaches her. He shakes his head. She returns the envelopes. David looks pleadingly. They stand apart, Jenny wipes tears. He shakes his head, takes a bottle from the boot. Jenny eyes him coldly, turns, and goes inside. David sits in the car, swigs from the bottle, and cries. Jenny waits in the hall, hears the car. Tears fall as headlights pass. Danny plays with a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David watches them with an expressionless gaze, his face revealing no hint of emotion. Meanwhile, Helen appears indifferent initially, her boredom evident, but then she offers a rueful smile directed at David. In response, David gives a slight smile before shifting his attention back to the dancers as they make their return. Helen and Danny both watch the dancers as they leave. David and Jenny proceed to make their way to the car park, both donning their overcoats against the chill. Upon reaching the car, David opens the boot and begins rummaging around inside it. As he does this, Jenny's eyes move upwards to look at him searchingly. David attempts to reach out and take her hand, a gesture of connection. \n\nLater, when they are back at their home, Jenny is seated with her study materials in front of her. Frustrated, she slams her book down in a fit of exasperation. She then gets up and opens the bedroom window. Standing there, she takes a drag from her cigarette, the smoke curling around her as she gazes out at the street lights illuminating the night. Downstairs, her parents are in the kitchen, busy with the chore of washing up. Jenny observes her parents engaged in their domestic routine. An engagement ring comes into view, catching the light. Miss Stubs directs a scolding glare at her. The headmistress, maintaining a sense of authority, straightens herself archly. Jenny rolls her eyes, brimming with tears, before turning and walking out. \n\nAs she makes her way down a school corridor, she carries her blazer and satchel. She briefly glances into her classroom as she exits through the school's main doors. Once outside, she walks along the pavement, but soon breaks into a run. A group of her friends gather, watching her leave. Meanwhile, Danny holds a stuffed armadillo, looking worried. After leaving Danny's place, David and Jenny head toward the car. Courteously, David opens the door for her. They drive off, merging into the London twilight. \n\nMarjorie casts a reproachful look at her husband. David shakes Jack's hand in a friendly gesture. They all make their way out to the Bristol, heading towards town as the twilight deepens. They pause at a petrol station, where the attendant begins to pump fuel into their vehicle. David enters the shop adjacent to the village garage while Jenny reaches over into the glove box to get some cigarettes. She discovers the packet is empty. In the meantime, Jack manages to accidentally break a door handle. Inside the glove box, there is a pile of envelopes, which Jenny looks through. \n\nDavid returns from the garage and notices Jenny looking at the envelopes. As they drive back, Jenny sits silently, her face expressionless. Upon arrival, Jenny exits the car and steps away. Her parents go indoors, and David approaches her. He shakes his head slightly in a gesture of disappointment. Jenny looks at the envelopes once more before shoving them back at him. David gazes at Jenny with pleading eyes, hoping for understanding. They stand apart, a palpable distance between them. Jenny wipes tears from her face, her emotions evident. David shakes his head once again, a gesture filled with regret. He opens the boot of the car and retrieves a bottle from a case, a sign of his own distress. Jenny eyes him coldly before turning on her heel and walking inside. \n\nOnce inside, Jenny stands alone in the hallway, feeling isolated. Meanwhile, David goes to the driver's side of the car and gets in. He takes a swig from the bottle, then carelessly drops it onto the passenger seat. Staring mournfully into the distance, his lower lip begins to tremble as he finally gives in to tears. In the hall, Jenny fidgets, her eyes fixed on the front door, full of uncertainty. Hearing the car outside, Jack stands and moves to the window. Tears streak down Jenny's face as the headlights of the car sweep past the window and disappear. She hangs her head, overcome with emotion. Danny is seen playing with a cricket ball as Helen sits quietly with Jenny, offering silent support."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David watches them with a gaze that is entirely expressionless, his face betraying not even the slightest hint of emotion or feeling. Meanwhile, Helen initially appears indifferent, her expression one of visible boredom. However, she eventually offers a rueful, somewhat regretful smile directed towards David. In response, David gives a slight, subtle smile before he shifts his attention back to the dancers as they make their graceful return. Helen and Danny continue to watch the dancers as they make their departure. David and Jenny then proceed to make their way towards the car park, both of them donning their overcoats to protect themselves against the chill. Upon reaching the car, David opens the boot and begins rummaging around inside it, searching for something. As he does this, Jenny's eyes move upwards, looking at him with a searching gaze. David then attempts to reach out and take her hand, a tender gesture meant to establish a connection.\n\nLater, when they have returned to their home, Jenny is seated with a pile of study materials spread out in front of her. Frustrated, she slams her book down in a fit of exasperation and impatience. She then gets up and proceeds to open the bedroom window. Standing there, she takes a long drag from her cigarette, the smoke curling gracefully around her as she gazes out at the street lights illuminating the night. Downstairs, her parents are in the kitchen, preoccupied with the chore of washing up after dinner. Jenny observes her parents, engaged in their familiar domestic routine. An engagement ring comes into view, catching and reflecting the light. Miss Stubs directs a scolding glare at her. The headmistress, maintaining a palpable sense of authority, straightens herself in an arch manner. Jenny rolls her eyes, now brimming with tears, before she turns and walks out.\n\nAs she makes her way down a long school corridor, she carries her blazer and satchel along with her. She briefly glances into her classroom as she exits through the school's main doors. Once outside, she begins to walk along the pavement, but soon she breaks into a run. A group of her friends gather nearby, watching her make her departure. Meanwhile, Danny holds a stuffed armadillo, an anxious and worried expression on his face. After leaving Danny's place, David and Jenny head toward the car. With a gesture of courtesy, David opens the car door for her. They drive off together, merging seamlessly into the descending London twilight.\n\nMarjorie casts a reproachful, disapproving look at her husband. David shakes Jack's hand in a gesture that is friendly and warm. They all make their way out to the Bristol, heading towards town as the twilight deepens around them. Their journey pauses at a petrol station, where the attendant begins to pump fuel into their vehicle. David enters the small shop adjacent to the village garage while Jenny reaches over into the glove box, intending to get some cigarettes. To her disappointment, she discovers that the packet is empty. In the meantime, Jack accidentally manages to break a door handle. Within the glove box, there is a pile of envelopes that Jenny looks through with curiosity.\n\nDavid returns from the garage and notices Jenny looking intently at the envelopes. As they drive back, Jenny sits in silence, her face expressionless and devoid of emotion. Upon their arrival, Jenny exits the car and steps away. Her parents go indoors, while David approaches her. He shakes his head slightly, a gesture filled with disappointment. Jenny looks at the envelopes once more before she shoves them back at him. David gazes at Jenny with eyes full of pleading, hoping for some understanding. They stand apart, a palpable distance between them both. Jenny wipes tears from her face, her emotions evident and raw. Once more, David shakes his head, the gesture filled with a deep sense of regret. He opens the boot of the car and retrieves a bottle from a case, a sign of his own distress. Jenny eyes him coldly, her demeanor icy, before she turns on her heel and walks inside.\n\nOnce inside, Jenny stands alone in the hallway, a feeling of isolation overwhelming her. Meanwhile, David goes to the driver’s side of the car and gets in. He takes a swig from the bottle, then carelessly drops it onto the passenger seat beside him. Staring mournfully into the distance, his lower lip begins to tremble as he finally gives in to tears. In the hall, Jenny fidgets nervously, her eyes fixed on the front door, full of uncertainty and fear. Hearing the car outside, Jack stands up and moves to the window. Tears streak down Jenny’s face as the headlights of the car sweep past the window and then disappear into the night. She hangs her head low, overcome with a tumult of emotion. Danny is seen playing with a cricket ball as Helen sits quietly with Jenny, her presence offering silent, comforting support."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David stands observing the scene with an expressionless demeanor, while Helen, initially appearing bored, casts a rueful smile in his direction. In response, David returns the smile before shifting his gaze to watch the dancers as they begin to file back. Meanwhile, Helen and Danny remain stationary, their eyes trailing after the departing dancers with a sense of finality. Clad in their overcoats, David and Jenny make their way to the car park, a sense of routine enveloping their movements. Upon reaching the car, David opens the boot and begins to rummage through its contents with purpose. Jenny's gaze drifts upwards, following David's actions with a weary resignation. In a bid to bridge the silent gap between them, David reaches out to take her hand, but the gesture remains incomplete. The scene shifts back home where Jenny, seated and immersed in her studies, suddenly slams her book down with frustration. Moving to the bedroom window, she unlatches it and pushes it open, leaning out slightly as the cool air mingles with the smoke from her cigarette. The street lights below cast a soft glow, drawing her attention to the world outside. Meanwhile, her parents are ensconced downstairs in the kitchen, occupied with the mundane task of washing up. Jenny joins them, observing their synchronized movements as they dutifully clean the dishes, an engagement ring subtly catching the light and marking the occasion. In another scene, Miss Stubs glares at Jenny, her eyes filled with daggers, as the headmistress stands tall and corrects her posture with an air of authority. Overwhelmed, Jenny rolls her eyes, now brimming with tears, the salty drops threatening to spill over. Steeling herself, she pivots and exits the room, her pace measured and determined. Down the long corridor she walks, her blazer draped over one arm and satchel in hand, pausing briefly to peer into her classroom for a last glance before making her way through the school's main doors. The pavement stretches before her, and she follows it at first with a measured stride, then suddenly breaks into a run, her friends, clustered nearby, watching her departure with varying expressions of curiosity and concern. Elsewhere, Danny grips a stuffed armadillo tightly, his features etched with worry. As David and Jenny take their leave from Danny's place, they make their way towards the car. Ever the gentleman, David opens the car door for her, and with a final glance around, they drive off, the inkiness of the London twilight settling around them. At the sight of Marjorie's reproachful gaze fixed upon her husband, David shifts focus, shaking hands with Jack in a gesture of camaraderie. Together, they make their exit towards the Bristol, their collective footsteps marking their anticipation for the evening ahead. As they venture towards town under the expanse of the gathering twilight, a stop at a petrol station interrupts their journey. The attendant promptly steps forward to pump the fuel, while David strides into the shop at the village garage, his purpose temporarily diverted. Simultaneously, Jenny reaches across the car's glove box, her fingers searching for a cigarette packet, only to find it empty, the expected weight absent. Nearby, Jack fumbles, inadvertently breaking a door handle, while Jenny sifts through a pile of envelopes nestled in the glove box, curiosity mingling with her actions. David returns from the garage, his eyes noting Jenny's preoccupation with the envelopes. The drive back captures Jenny in a muted silence, her expression betraying little as she alights from the vehicle, stepping away with a sense of detachment. Her parents retreat indoors, leaving David to approach Jenny with an expression of defeat. She glances at the envelopes in her hands before shoving them back towards him, a silent refusal hanging heavily in the air. David's pleading gaze meets hers, but they stand apart, a chasm of unspoken words between them. As tears begin to streak her cheeks, Jenny wipes them away with a defiant gesture, while David shakes his head, the weight of the moment pressing down on him. He opens the boot once more, retrieving a bottle from a case, as Jenny eyes him with a frosty detachment. She turns sharply, making her way indoors while David moves towards the driver's door, slipping into the car's interior. Once inside, Jenny stands in the hallway, a solitary figure amidst the shadows. In the car, David swigs from the bottle, carelessly letting it drop onto the passenger seat, staring off into the distance with mournful eyes. His lip quivers as tears begin to flow, the weight of his emotions uncontainable. Jenny fidgets in the hall, eyes locked on the front door, her thoughts as restless as her movements. Hearing the car outside, Jack rises with curiosity, moving to the window to peer out. Meanwhile, the reality of the situation bears down upon Jenny, tears cascading as the headlights sweep past the window in a silent farewell. Her head hangs low, a gesture of defeat and resignation. In a quieter moment, Danny idly plays with a cricket ball as Helen sits with Jenny, the silence between them speaking volumes."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David watches the scene with an expressionless face, while Helen initially appears bored but then smiles ruefully at him. He returns her smile before focusing on the dancers returning, as Helen and Danny observe them leaving. Later, David and Jenny, wearing overcoats, walk to the car park, where David rummages in the boot. He attempts to hold her hand, but later, at home, she studies and, in frustration, slams her book shut, opens the bedroom window, and smokes while looking at the street lights. Downstairs, her parents do the washing up as Jenny observes them. An engagement ring is revealed, causing tension with Miss Stubs and the headmistress, leading to Jenny's tear-filled eyes and her eventual departure from the room.\n\nJenny walks through the school corridor with her blazer and satchel, glimpses into her classroom, exits the school's main doors, and strides down the pavement before breaking into a run, watched by her friends. Meanwhile, Danny is concerned about a stuffed armadillo. As David and Jenny leave Danny’s place, they head to the car, and David opens the door for her as they drive into the London twilight. Marjorie looks reproachfully at her husband as David shakes Jack's hand, and they all leave for town, stopping at a petrol station where an attendant pumps fuel. David enters the village garage shop while Jenny finds an empty cigarette packet and looks through envelopes in the glove box. Upon David's return, he notices her actions, but they drive back in silence. \n\nUpon arrival, Jenny exits the car, her parents head indoors, and David approaches her, silently pleading. She shoves the envelopes back at him, and they stand apart as Jenny wipes away tears. David, disheartened, retrieves a bottle from the boot and drinks, prompting a cold reaction from Jenny, who turns and walks inside. As David sits in the car, his sorrow deepens, and he begins to cry. Jenny stands alone in the hallway, fidgeting and staring at the door. Noticing the car, Jack looks out the window as tears flow down Jenny's cheeks, and she hangs her head. Meanwhile, Danny plays with a cricket ball as Helen sits with Jenny."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David watches them expressionlessly, his demeanor unreadable to the crowd in the lively ballroom. Helen, appearing uninterested amidst the festivities of this charity gala event, then smiles ruefully at David. David smiles, acknowledging the effort to lighten the mood, then turns to watch the dancers returning from the dance floor, their laughter echoing in the hall. Helen and Danny watch them leave, the dance troupe concluding their performance at the cultural fair. David and Jenny walk to the car park in their overcoats, bracing against the chill of the late evening. David opens the boot, the trunk of their small sedan, and rummages inside for his tools. Her eyes wheel up as she looks at him, contemplating his next move. He tries to take her hand in a gesture of reconciliation.\n\nBack at home, a quaint terraced house in the London suburbs, she sits studying for her upcoming exams in law. She slams down her book, frustrated by the complexity of criminal statutes. She opens the bedroom window to let in the cool night air. Smoking, she looks out to the street lights glowing in the quiet cul-de-sac. Her parents are downstairs in the kitchen, engaged in a late-night discussion. Jenny watches her parents doing the washing up, their domestic rhythm soothing her nerves. It's an engagement ring, gleaming softly in the kitchen's overhead light. Miss Stubs, her strict English literature teacher at the local high school, looks daggers at her, disapproving of distractions in class. The headmistress straightens archly, preparing to address the students at the end-of-term assembly. Jenny rolls her tear-filled eyes, overwhelmed by the pressure of impending changes in her life. Jenny turns and walks out, determined to gather her thoughts.\n\nJenny walks down a corridor carrying her blazer and satchel, the sounds of the bustling school winding down behind her. She glances into her classroom as she walks out of the school's main doors, reminiscing about the years spent within its walls. She walks down the pavement, then breaks into a run, eager to escape the confines of routine. A gaggle of her friends watch her go, their voices trailing off in curiosity. Danny's got a stuffed armadillo, a quirky mascot from their childhood adventures. Danny looks worried, sensing the tension in the air. David and Jenny leave Danny's place, stepping out of the cozy apartment. They head for the car, parked under the dim streetlights.\n\nDavid opens the door for her, a courteous gesture that momentarily disarms her. They drive off into the London twilight, the city's nightscape unfurling before them. Marjorie eyes her husband reproachfully across the dinner table, aware of the evening's simmering tensions. David shakes Jack's hand, a firm grip marking years of friendship. They troop out to the Bristol, an old but reliable car fondly nicknamed after its former owner. They hit for town in the gathering twilight, the city lighting up in anticipation of the night. They stop off at the petrol station, an essential pause on their journey. The attendant pumps the fuel, exchanging a few pleasantries with David about the weather. David goes into the shop of the village garage, a small establishment known for its quaint charm. Jenny reaches into the glove box for the cigarettes, a habit she's trying to break. The packet is empty, an annoyance among many. Jack manages to break a door handle, a sign of the car's age. There's a pile of envelopes in the glove box, correspondence waiting to be sorted. Jenny looks through them, curious about their contents. David returns from the garage, a small paper bag in hand. David notices Jenny looks at the envelopes, her expression unreadable.\n\nJenny sits expressionlessly as they drive back, the silence heavy between them. Jenny gets out and steps away from the car, her heart heavy with unspoken words. Her parents go indoors, the warmth of home inviting them. David approaches Jenny, his expression one of contrition. He shakes his head, unsure of how to bridge the gap. She looks at the envelopes then shoves them back at him, a gesture of despair. David looks at her pleadingly, hoping for understanding. They stand apart, a gulf of unspoken emotions between them. Jenny wipes tears from her face, the weight of the moment overwhelming her. David shakes his head, feeling the helplessness settle in. He opens the boot and takes the bottle from a case, a last resort for comfort. Jenny eyes him frostily, her disappointment palpable. She turns on her heel and walks indoors, leaving him alone with his choices.\n\nDavid goes to the driver's door and gets in the car, the night's events crashing down on him. Indoors Jenny stands forlorn in the hallway, the echoes of the past trailing her footsteps. David swigs from the bottle then drops it on the passenger seat, his resolve crumbling. He stares mournfully into the distance, lost in thought. His lower lip trembles as he starts to cry, the tears a silent testament to his regrets. Jenny fidgets in the hall staring at the front door, her mind racing with uncertainties. Hearing the car Jack gets up and goes to the window, drawn by the sound. Tears run down Jenny's cheeks as headlights sweep past the window, illuminating her anguish. Jenny hangs her head, the weight of the evening pressing down on her. Danny's playing with a cricket ball as Helen sits with Jenny, their friendship a comforting presence in her turmoil."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "David watches them expressionlessly Helen looks bored then smiles ruefully at David David smiles then turns to watch the dancers returning Helen and Danny watch them leave David and Jenny walk to the car park in their overcoats She looks at the envelopes then shoves them back at him Jenny reaches into the glove box for the cigarettes David opens the boot and rummages inside Her eyes wheel up as she looks at him David and Jenny leave Danny's place She opens the bedroom window He tries to take her hand Back at home she sits studying Her parents are downstairs in the kitchen She slams down her book She opens the bedroom window Her parents go indoors and David approaches Jenny David notices Smoking Helen looks bored then smiles ruefully at David she looks out to the street lights The headmistress straightens archly Her parents are downstairs in the kitchen Jenny watches her parents doing the washing up It is an engagement ring Miss Stubs looks daggers at her The headmistress straightens archly Jenny looks through them Jenny rolls her tear filled eyes He opens the boot and takes the bottle from a case The attendant pumps the fuel Jenny eyes him frostily Jenny turns and walks out Jenny walks down a corridor carrying her blazer and satchel She glances into her classroom as she walks out of the school's main doors She walks down the pavement then breaks into a run A gaggle of her friends watch her go Danny's got a stuffed armadillo Danny looks worried David watches them expressionlessly David shakes Jack's hand David and Jenny leave Danny's place They head for the car David opens the boot and rummages inside They troop out to the Bristol David opens the door for her They drive off into the London twilight Marjorie eyes her husband reproachfully David shakes Jack's hand They troop out to the Bristol They hit for town in the gathering twilight They stop off at the petrol station Helen and Danny watch them leave as headlights sweep past the window The attendant pumps the fuel David goes into the shop of the village garage Jenny reaches into the glove box for the cigarettes David goes to the driver's door and gets in the car She turns on her heel and walks indoors The packet is empty His lower lip trembles as he starts to cry Jack manages to break a door handle David opens the door for her There is a pile of envelopes in the glove box Jenny looks through them Her eyes wheel up as she looks at him David returns from the garage Jenny watches her parents doing the washing up David notices Jenny looks at the envelopes They head for the car Jenny sits expressionlessly as they drive back Jenny gets out and steps away from the car Her parents go indoors and David approaches Jenny He shakes his head She looks at the envelopes then shoves them back at him David looks at her pleadingly They stand apart Jenny wipes tears from her face Danny's playing with a cricket ball as Helen sits with Jenny she looks out to the street lights David shakes his head David smiles then turns to watch the dancers returning He opens the boot and takes the bottle from a case Jenny eyes him frostily She turns on her heel and walks indoors David goes to the driver's door and gets in the car Indoors Hearing the car Jack gets up and goes to the window Jenny wipes tears from her face Jenny stands for lonely in the hallway The packet is empty David swigs from the bottle then drops it on the passenger seat He stares mournfully into the distance His lower lip trembles as he starts to cry Jenny fidgets in the hall staring at the front door Hearing the car Jack gets up and goes to the window Indoors Tears run down Jenny's cheeks They stop off at the petrol station as headlights sweep past the window Jenny fidgets in the hall staring at the front door Jenny hangs her head Danny's playing with a cricket ball as Helen sits with Jenny"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "David watches them expressionlessly. Helen looks bored then smiles ruefully at David. David smiles then turns to watch the dancers returning. Helen and Danny watch them leave. David and Jenny walk to the car park in their overcoats. David opens the boot and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home she sits studying. She slams down her book. She opens the bedroom window. Smoking. she looks out to the street lights. Her parents are downstairs in the kitchen. Jenny watches her parents doing the washing up. It is an engagement ring. Miss Stubs looks daggers at her. The headmistress straightens archly. Jenny rolls her tear filled eyes. Jenny turns and walks out. Jenny walks down a corridor carrying her blazer and satchel. She glances into her classroom as she walks out of the school's main doors. She walks down the pavement then breaks into a run. A gaggle of her friends watch her go. Danny's got a stuffed armadillo. Danny looks worried. David and Jenny leave Danny's place. They head for the car. David opens the door for her. They drive off into the London twilight. Marjorie eyes her husband reproachfully. David shakes Jack's hand. They troop out to the Bristol. They hit for town in the gathering twilight. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They stop off at the petrol station. The attendant pumps the fuel. David goes into the shop of the village garage. Jenny reaches into the glove box for the cigarettes. The packet is empty. Jack manages to break a door handle. There is a pile of envelopes in the glove box. Jenny looks through them. David returns from the garage. David notices. Jenny looks at the envelopes. Jenny sits expressionlessly as they drive back. Jenny gets out and steps away from the car. Her parents go indoors and David approaches Jenny. He shakes his head. She looks at the envelopes then shoves them back at him. David looks at her pleadingly. They stand apart. Jenny wipes tears from her face. David shakes his head. He opens the boot and takes the bottle from a case. Jenny eyes him frostily. She turns on her heel and walks indoors. David goes to the driver's door and gets in the car. Indoors. Jenny stands for lonely in the hallway. David swigs from the bottle then drops it on the passenger seat. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Jenny fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Jenny's cheeks. as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "David watches them expressionlessly. Helen looks bored then smiles ruefully at David. David smiles then turns to watch the dancers returning. Helen and Danny watch them leave. David and Jenny walk to the car park in their overcoats. David opens the boot and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home she sits studying. She slams down her book. She opens the bedroom window. Smoking. she looks out to the street lights. Her parents are downstairs in the kitchen. Jenny watches her parents doing the washing up. It is an engagement ring. Miss Stubs looks daggers at her. The headmistress straightens archly. Jenny rolls her tear filled eyes. Jenny turns and walks out. Jenny walks down a corridor carrying her blazer and satchel. She glances into her classroom as she walks out of the school's main doors. She walks down the pavement then breaks into a run. A gaggle of her friends watch her go. Danny's got a stuffed armadillo. Danny looks worried. David and Jenny leave Danny's place. They head for the car. David opens the door for her. They drive off into the London twilight. Marjorie eyes her husband reproachfully. David shakes Jack's hand. They troop out to the Bristol. They hit for town in the gathering twilight. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. They stop off at the petrol station. The attendant pumps the fuel. David goes into the shop of the village garage. Jenny reaches into the glove box for the cigarettes. The packet is empty. Jack manages to break a door handle. There is a pile of envelopes in the glove box. Jenny looks through them. David returns from the garage. David notices. Jenny looks at the envelopes. Jenny sits expressionlessly as they drive back. Jenny gets out and steps away from the car. Her parents go indoors and David approaches Jenny. He shakes his head. She looks at the envelopes then shoves them back at him. David looks at her pleadingly. They stand apart. Jenny wipes tears from her face. David shakes his head. He opens the boot and takes the bottle from a case. Jenny eyes him frostily. She turns on her heel and walks indoors. David goes to the driver's door and gets in the car. Indoors. Jenny stands for lonely in the hallway. David swigs from the bottle then drops it on the passenger seat. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Jenny fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Jenny's cheeks. as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "David watches them expressionlessly. Helen looks bored then smiles ruefully at David. David smiles then turns to watch the dancers returning. Helen and Danny watch them leave. David and Jenny walk to the car park in their overcoats. David opens the boot and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home she sits studying. She slams down her book. She opens the bedroom window. Smoking. she looks out to the street lights. Her parents are downstairs in the kitchen. Jenny watches her parents doing the washing up. It is an engagement ring. Miss Stubs looks daggers at her. They stand apart. Jenny wipes tears from her face. David shakes his head. He opens the boot and takes the bottle from a case. Jenny eyes him frostily. She turns on her heel and walks indoors. David goes to the driver's door and gets in the car. Indoors. Jenny stands for lonely in the hallway. David swigs from the bottle then drops it on the passenger seat. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Jenny fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Jenny's cheeks. as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "David watches them expressionlessly. Helen looks bored then smiles ruefully at David. David smiles then turns to watch the dancers returning. Helen and Danny watch them leave. David and Jenny walk to the car park in their overcoats. David opens the boot and rummages inside. Her eyes wheel up as she looks at him. His lower lip trembles as he starts to cry. Jenny fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Jenny's cheeks. as headlights sweep past the window. Jenny hangs her head. Danny's playing with a cricket ball as Helen sits with Jenny."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sarah watches them expressionlessly. The cat looks bored, then smiles ruefully at Sarah. Sarah smiles, then turns to watch the dancers returning. The dog and Danny watch them leave. The rabbit and Jenny walk to the car park in their overcoats. The rabbit opens the boot and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home, she sits studying. She slams down her book. She opens the bedroom window. Smoking, she looks out to the street lights. Her parents are downstairs in the kitchen. Mark watches her parents doing the washing up. It's an engagement ring. Miss Stubs looks daggers at Mark. The headmistress straightens archly. Mark rolls her tear-filled eyes. Mark turns and walks out. Mark walks down a corridor carrying her blazer and satchel. She glances into her classroom as she walks out of the school's main doors. She walks down the pavement, then breaks into a run. A gaggle of her friends watch her go. Kelly's got a stuffed armadillo. Kelly looks worried. Sarah and Mark leave Kelly's place. They head for the car. Sarah opens the door for her. They drive off into the London twilight. Marjorie eyes her husband reproachfully. Sarah shakes Jack's hand. They troop out to the Bristol. They hit for town in the gathering twilight. They stop off at the petrol station. The attendant pumps the fuel. Sarah goes into the shop of the village garage. Mark reaches into the glove box for the cigarettes. The packet is empty. Tony manages to break a door handle. There's a pile of envelopes in the glove box. Mark looks through them. Sarah returns from the garage. Sarah notices Mark looks at the envelopes. Mark sits expressionlessly as they drive back. Mark gets out and steps away from the car. Her parents go indoors and Sarah approaches Mark. He shakes his head. She looks at the envelopes then shoves them back at him. Sarah looks at her pleadingly. They stand apart. Mark wipes tears from her face. Sarah shakes his head. He opens the boot and takes the bottle from a case. Mark eyes him frostily. She turns on her heel and walks indoors. Sarah goes to the driver's door and gets in the car. Indoors Mark stands for lonely in the hallway. Sarah swigs from the bottle then drops it on the passenger seat. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Mark fidgets in the hall staring at the front door. Hearing the car Jack gets up and goes to the window. Tears run down Mark's cheeks as headlights sweep past the window. Mark hangs her head. Kelly's playing with a cricket ball as the cat sits with Mark."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "David watches them expressionlessly. Helen looks bored, then smiles ruefully at David. David smiles, then turns to watch the singers returning. Helen and Danny watch them leave. David and Jenny walk to the bicycle rack in their raincoats. David opens the basket and rummages inside. Her eyes wheel up as she looks at him. He tries to take her hand. Back at home, she sits knitting. She slams down her yarn. She opens the bathroom window. Smoking, she looks out to the garden gnomes. Her parents are downstairs in the living room. Jenny watches her parents doing the decorating. It's a friendship bracelet. Miss Stubs looks daggers at her. The headmistress straightens archly. Jenny rolls her tear-filled eyes. Jenny turns and walks out. Jenny walks down a corridor carrying her cardigan and backpack. She glances into her library as she walks out of the school's main gates. She walks down the path, then breaks into a run. A gaggle of her friends watch her go. Danny's got a stuffed penguin. Danny looks worried. David and Jenny leave Danny's place. They head for the bike. David opens the gate for her. They cycle off into the London twilight. Marjorie eyes her husband reproachfully. David shakes Jack's umbrella. They troop out to the tram. They hit for town in the gathering twilight. They stop off at the bakery. The attendant wraps the bread. David goes into the shop of the village bookstore. Jenny reaches into the side pocket for the candies. The packet is empty. Jack manages to break a drawer handle. There's a pile of magazines in the side pocket. Jenny looks through them. David returns from the bookstore. David notices Jenny looks at the magazines. Jenny sits expressionlessly as they cycle back. Jenny gets out and steps away from the bike. Her parents go indoors and David approaches Jenny. He shakes his head. She looks at the magazines then shoves them back at him. David looks at her pleadingly. They stand apart. Jenny wipes tears from her face. David shakes his head. He opens the basket and takes the apple from a crate. Jenny eyes him frostily. She turns on her heel and walks indoors. David goes to the driver's seat and gets on the bike. Indoors Jenny stands for lonely in the atrium. David munches on the apple then drops it on the bench. He stares mournfully into the distance. His lower lip trembles as he starts to cry. Jenny fidgets in the atrium staring at the front gate. Hearing the bike Jack gets up and goes to the window. Tears run down Jenny's cheeks as a streetlamp glow sweeps past the window. Jenny hangs her head. Danny's playing with a frisbee as Helen sits with Jenny."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "David observes them silently. Helen appears disinterested, then grins sheepishly at David. David chuckles, then shifts to observe the dancers departing. Helen and Danny watch them vanish. David and Jenny stroll to the car park in their overcoats. David unlocks the boot and searches inside. Her eyes dart up as she glances at him. He attempts to pat her shoulder. Back at home, she sits reflecting. She tosses her book aside. She slides open the bedroom window. Smoking, she peers out at the street lights. Her parents are downstairs in the kitchen. Jenny observes her parents organizing the dishes. It's an engagement ring. Miss Stubs frowns at her. The headmistress nods haughtily. Jenny closes her tear-filled eyes. Jenny pivots and storms out. Jenny strides down a corridor clutching her blazer and satchel. She peers into her classroom as she exits the school's main doors. She strolls down the pavement, then bursts into a run. A group of her friends observe her departure. Danny's holding a stuffed armadillo. Danny appears anxious. David and Jenny depart Danny's place. They proceed toward the car. David holds the door for her. They cruise off into the London twilight. Marjorie regards her husband accusingly. David waves at Jack. They amble out to the Bristol. They venture toward town in the gathering twilight. They pause at the petrol station. The attendant refills the tank. David enters the shop of the village garage. Jenny reaches into the glove box for the cigarettes. The packet is empty. Jack manages to snap a door handle. There's a pile of envelopes in the glove box. Jenny sifts through them. David returns from the garage. David notices Jenny examining the envelopes. Jenny sits indifferently as they drive back. Jenny alights and steps away from the car. Her parents retreat indoors and David approaches Jenny. He sighs. She glances at the envelopes then thrusts them back at him. David gazes at her hopefully. They stand separately. Jenny brushes tears from her face. David sighs. He unlocks the boot and retrieves the bottle from a case. Jenny glares at him coolly. She pivots and strides indoors. David approaches the driver's door and enters the car. Indoors Jenny stands forlorn in the hallway. David sips from the bottle then places it on the passenger seat. He gazes longingly into the distance. His lower lip quivers as he starts to cry. Jenny fumbles in the hall gazing at the front door. Hearing the car, Jack rises and moves to the window. Tears cascade down Jenny's cheeks as headlights glide past the window. Jenny lowers her head. Danny's tossing a cricket ball as Helen sits with Jenny."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf watches them expressionlessly. The microwave looks bored, then smiles ruefully at the bookshelf. The bookshelf smiles, then turns to watch the telephones returning. The microwave and the suitcase watch them leave. The bookshelf and the lamp walk to the library in their raincoats. The bookshelf opens the drawer and rummages inside. Its wheels whirl up as it looks at the bookshelf. It tries to take the shelf’s hand. Back at the museum, it sits studying. It slams down the magazine. It opens the attic window. Typing, it looks out to the street signs. Its siblings are downstairs in the den. The lamp watches its siblings doing the painting. It's a jigsaw puzzle piece. The calendar looks daggers at it. The librarian straightens archly. The lamp rolls its tear-filled wheels. The lamp turns and walks out. The lamp walks down a corridor carrying its scarf and backpack. It glances into its locker as it walks out of the library’s main doors. It walks down the sidewalk, then breaks into a sprint. A flock of its pencils watch it go. The suitcase's got a stuffed cactus. The suitcase looks worried. The bookshelf and the lamp leave the suitcase's shed. They head for the elevator. The bookshelf opens the portal for it. They drift off into the Paris morning. The bicycle eyes its handlebar reproachfully. The bookshelf shakes the plank's hand. They march out to the Venice. They paddle for the pier in the swirling dawn. They stop off at the candy shop. The baker scoops the ice cream. The bookshelf goes into the aisle of the city theater. The lamp reaches into the locker for the candies. The box is empty. The plank manages to break a lock. There's a stack of brochures in the locker. The lamp looks through them. The bookshelf returns from the theater. The bookshelf notices the lamp looks at the brochures. The lamp sits expressionlessly as they cycle back. The lamp gets out and steps away from the elevator. Its siblings go outdoors and the bookshelf approaches the lamp. It shakes its head. It looks at the brochures then shoves them back at the shelf. The bookshelf looks at it pleadingly. They stand apart. The lamp wipes dew from its surface. The bookshelf shakes its head. It opens the drawer and takes the soda from a crate. The lamp eyes it frostily. It turns on its base and walks outdoors. The bookshelf goes to the driver's portal and gets in the elevator. Outdoors the lamp stands for vacant in the courtyard. The bookshelf sips from the soda then drops it on the passenger shelf. It stares mournfully into the distance. Its lower handle trembles as it starts to buzz. The lamp fidgets in the courtyard staring at the gate. Hearing the elevator, the plank gets up and goes to the lens. Dew rolls down the lamp's surface as shadows sweep past the lens. The lamp hangs its shade. The suitcase's playing with a yo-yo as the microwave sits with the lamp."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Martin observes them intently. Susan appears distracted, then chuckles softly at Martin. Martin chuckles, then pivots to see the performers arriving. Susan and Tom observe them enter. Martin and Alice stroll to the bus stop in their raincoats. Martin unlocks the trunk and searches inside. Her eyes dart up as she glances at him. He attempts to grab her arm. Back at school, she remains reviewing. She tosses her notebook aside. She closes the kitchen door. Eating, she peers out at the traffic lights. Her friends are downstairs in the living room. Alice observes her friends playing games. It's a sapphire necklace. Mr. Smith glares icily at her. The principal adjusts curtly. Alice lowers her misty eyes. Alice spins and storms off. Alice strides down a hallway clutching her jacket and backpack. She peeks into her library as she exits the school's side doors. She strolls along the sidewalk, then bursts into a sprint. A cluster of their classmates observe her leave. Tom's holding a rubber chicken. Tom seems flustered. Martin and Alice exit Tom's place. They set out for the bus. Martin holds the door for her. They cruise away into the Paris dusk. Dorothy regards her brother skeptically. Martin grasps John's arm. They file out to the Ford. They set out for the beach in the fading light. They pull in at the grocery store. The cashier fills the bags. Martin wanders into the diner of the village store. Alice reaches into the glove compartment for the mints. The package is gone. John happens to twist a trunk handle. There's a bundle of maps in the glove compartment. Alice sorts through them. Martin returns from the store. Martin spots Alice sorting the maps. Alice sits quietly as they journey back. Alice steps out and walks away from the bus. Her friends head inside and Martin approaches Alice. He lowers his eyes. She peers at the maps then tosses them back at him. Martin gazes at her imploringly. They stand separate. Alice wipes raindrops from her face. Martin lowers his eyes. He opens the trunk and retrieves the backpack from a case. Alice regards him coldly. She pivots and heads indoors. Martin moves to the passenger side and enters the bus. Inside Alice pauses forlornly in the foyer. Martin sips from the jug then places it on the driver's seat. He gazes pensively into the night. His jaw quivers as he begins to weep. Alice shifts uneasily in the foyer peering at the back door. Listening to the bus John rises and walks to the door. Raindrops cascade down Alice's face as streetlights sweep past the door. Alice lowers her chin. Tom's juggling a soccer ball as Susan sits with Alice."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "David observes them silently. Helen appears uninterested, then grimaces apologetically at David. David chuckles, then pivots to gaze at the jugglers advancing. Helen and Danny observe them vanish. David and Jenny amble to the bus stop in their raincoats. David unlatches the trunk and forages inside. Her eyes whirl overhead as she glances at him. He attempts to clasp her shoulder. Back at their place, she reclines reading. She hurls down her tablet. She unlocks the living room door. Chewing gum, she peers out at the neon signs. Her parents are upstairs in the study. Jenny observes her parents tidying up. It's a friendship bracelet. Miss Stubs glares icicles at her. The headmistress adjusts ceremoniously. Jenny rolls her damp eyes. Jenny pivots and strides away. Jenny marches down a corridor holding her sweater and backpack. She peeks into her library as she steps out of the school's main gates. She walks down the lane, then accelerates into a sprint. A flock of her friends observe her departure. Danny’s holding a stuffed penguin. Danny appears anxious. David and Jenny exit Danny's abode. They head for the bus stop. David swings the gate open for her. They cruise off into the London dusk. Marjorie regards her husband disapprovingly. David nods at Jack's elbow. They saunter out to the tram. They zoom for the cinema in the looming dusk. They pause at the newsstand. The clerk arranges the magazines. David steps into the stall of the corner kiosk. Jenny reaches into the dashboard for the napkins. The pouch is vacant. Jack manages to detach a window latch. There's a stack of postcards in the dashboard. Jenny sifts through them. David returns from the kiosk. David observes Jenny glancing at the postcards. Jenny sits stoically as they cruise back. Jenny exits and steps away from the bus stop. Her parents step indoors and David approaches Jenny. He shrugs his shoulders. She glares at the postcards then tosses them back at him. David gazes at her imploringly. They stand distant. Jenny dabs tears from her cheeks. David shrugs his shoulders. He opens the trunk and retrieves the scarf from a basket. Jenny watches him coolly. She spins on her heel and enters the house. David heads to the conductor's seat and boards the bus. Indoors, Jenny stands forlornly in the hallway. David gulps from the bottle then drops it on the driver’s seat. He gazes wistfully into the distance. His lower lip quivers as he begins to weep. Jenny paces in the hall, eyeing the front window. Hearing the tram, Jack rises and approaches the window. Tears roll down Jenny's cheeks as headlights glide past the window. Jenny lowers her head. Danny’s juggling a tennis ball as Helen chats with Jenny."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Lucas observes them with indifference. Sarah appears uninterested, then grins sheepishly at Lucas. Lucas grins, then shifts to watch the acrobats departing. Sarah and Tom observe them depart. Lucas and Emma stroll to the bus stop in their hoodies. Lucas unlatches the trunk and searches within. Her eyes drift upward as she gazes at him. He attempts to grab her shoulder. Back at the studio, she sits painting. She slams down her palette. She pushes open the patio door. Chewing gum, she gazes out to the traffic lights. Her grandparents are downstairs in the dining room. Emma observes her grandparents cleaning the dishes. It's a letter opener. Ms. Smith glances sharply at her. The principal adjusts rigidly. Emma turns her tear-filled gaze skyward. Emma pivots and exits. Emma strides down a hallway clutching her sweater and backpack. She peeks into her art room as she exits the building's main exit. She strolls down the sidewalk, then bursts into a sprint. A flock of her classmates watch her disappear. Tom's got a ceramic turtle. Tom appears anxious. Lucas and Emma leave Tom's residence. They head for the bicycle. Lucas unlocks the gate for her. They pedal off into the Paris dusk. Margaret regards her brother with disappointment. Lucas clasps Michael's shoulder. They march out to the subway. They head for the city in the deepening dusk. They pause at the café. The barista brews the coffee. Lucas enters the market of the town plaza. Emma reaches into the side pocket for the mints. The container is vacant. Michael struggles to snap a switch. There's a stack of photographs in the side pocket. Emma sifts through them. Lucas returns from the plaza. Lucas notices Emma glancing at the photographs. Emma sits with detachment as they cycle back. Emma disembarks and steps away from the bicycle. Her grandparents head indoors and Lucas approaches Emma. He shakes his foot. She glances at the photographs then tosses them back at him. Lucas gazes at her imploringly. They stand distanced. Emma wipes raindrops from her jacket. Lucas shakes his foot. He unlocks the trunk and removes the lantern from a basket. Emma regards him icily. She spins on her toes and walks indoors. Lucas goes to the front gate and mounts the bicycle. Indoors Emma stands forlorn in the foyer. Lucas takes a sip from the lantern then drops it on the side seat. He gazes sorrowfully into the horizon. His lower eyelid quivers as he begins to weep. Emma fidgets in the foyer staring at the front gate. Hearing the bicycle Michael rises and peers out the window. Rain trickles down Emma's cheeks as shadows sweep past the window. Emma lowers her gaze. Tom's playing with a baseball as Sarah sits with Emma."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David watches expressionlessly as Helen and Danny see dancers leave. David and Jenny walk to the car park, where he rummages in the boot. At home, Jenny studies, smokes, and watches her parents in the kitchen. She discovers an engagement ring, receives a cold stare from Miss Stubs, and leaves school tearfully. Her friends watch her run away. David and Jenny visit Danny, who worries over a stuffed armadillo, then drive off. Marjorie eyes her husband, and they head into town, stopping at a petrol station. Jenny finds empty cigarette packets and envelopes in the glove box. On the way back, David approaches Jenny, but she shoves envelopes at him. She walks indoors, crying. David drinks from a bottle in his car, crying as well. Jack sees the car leave, and Jenny hangs her head in tears as headlights pass. Danny plays with a cricket ball while Helen sits with Jenny."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Danny's playing with a cricket ball as Helen sits with Jenny Jenny hangs her head as headlights sweep past the window Tears run down Jenny's cheeks Hearing the car Jack gets up and goes to the window Jenny fidgets in the hall staring at the front door His lower lip trembles as he starts to cry He stares mournfully into the distance David swigs from the bottle then drops it on the passenger seat Jenny stands for lonely in the hallway Indoors David goes to the driver's door and gets in the car She turns on her heel and walks indoors Jenny eyes him frostily He opens the boot and takes the bottle from a case David shakes his head Jenny wipes tears from her face They stand apart David looks at her pleadingly She looks at the envelopes then shoves them back at him He shakes his head Her parents go indoors and David approaches Jenny Jenny gets out and steps away from the car Jenny sits expressionlessly as they drive back Jenny looks at the envelopes David notices David returns from the garage Jenny looks through them There is a pile of envelopes in the glove box Jack manages to break a door handle The packet is empty Jenny reaches into the glove box for the cigarettes David goes into the shop of the village garage The attendant pumps the fuel They stop off at the petrol station They hit for town in the gathering twilight They troop out to the Bristol David shakes Jack's hand Marjorie eyes her husband reproachfully They drive off into the London twilight David opens the door for her They head for the car David and Jenny leave Danny's place Danny looks worried Danny's got a stuffed armadillo A gaggle of her friends watch her go She walks down the pavement then breaks into a run She glances into her classroom as she walks out of the school's main doors Jenny walks down a corridor carrying her blazer and satchel Jenny turns and walks out Jenny rolls her tear filled eyes The headmistress straightens archly Miss Stubs looks daggers at her It is an engagement ring Jenny watches her parents doing the washing up Her parents are downstairs in the kitchen she looks out to the street lights Smoking She opens the bedroom window She slams down her book Back at home she sits studying He tries to take her hand Her eyes wheel up as she looks at him David opens the boot and rummages inside David and Jenny walk to the car park in their overcoats Helen and Danny watch them leave David smiles then turns to watch the dancers returning Helen looks bored then smiles ruefully at David David watches them expressionlessly"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "It is an engagement ring David looks at her pleadingly Marjorie eyes her husband reproachfully David swigs from the bottle then drops it on the passenger seat He tries to take her hand She walks down the pavement then breaks into a run David goes into the shop of the village garage Jenny rolls her tear filled eyes Miss Stubs looks daggers at her They stand apart Tears run down Jenny's cheeks Jack manages to break a door handle David and Jenny walk to the car park in their overcoats Jenny walks down a corridor carrying her blazer and satchel They hit for town in the gathering twilight Danny looks worried They drive off into the London twilight He shakes his head There is a pile of envelopes in the glove box Jenny gets out and steps away from the car Back at home she sits studying Jenny turns and walks out A gaggle of her friends watch her go Smoking David returns from the garage Jenny looks at the envelopes David shakes his head Jenny hangs her head Jenny sits expressionlessly as they drive back Danny's got a stuffed armadillo He stares mournfully into the distance She slams down her book Jenny stands for lonely in the hallway She glances into her classroom as she walks out of the school's main doors He opens the boot and takes the bottle from a case She opens the bedroom window David watches them expressionlessly Jenny fidgets in the hall staring at the front door Jenny eyes him frostily Hearing the car Jack gets up and goes to the window She looks at the envelopes then shoves them back at him David and Jenny leave Danny's place Indoors Jenny looks through them she looks out to the street lights as headlights sweep past the window Jenny wipes tears from her face The packet is empty They troop out to the Bristol Danny's playing with a cricket ball as Helen sits with Jenny Her parents are downstairs in the kitchen She turns on her heel and walks indoors Helen looks bored then smiles ruefully at David David smiles then turns to watch the dancers returning They head for the car Jenny reaches into the glove box for the cigarettes David opens the boot and rummages inside They stop off at the petrol station David goes to the driver's door and gets in the car His lower lip trembles as he starts to cry David notices Her eyes wheel up as she looks at him Her parents go indoors and David approaches Jenny The headmistress straightens archly David opens the door for her David shakes Jack's hand The attendant pumps the fuel Helen and Danny watch them leave Jenny watches her parents doing the washing up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The attendant pumps the fuel David goes into the shop of the village garage Jenny reaches into the glove box for the cigarettes The packet is empty Jack manages to break a door handle There is a pile of envelopes in the glove box Jenny looks through them David returns from the garage David notices Jenny looks at the envelopes Jenny sits expressionlessly as they drive back Jenny gets out and steps away from the car Her parents go indoors and David approaches Jenny He shakes his head She looks at the envelopes then shoves them back at him David looks at her pleadingly They stand apart Jenny wipes tears from her face David shakes his head He opens the boot and takes the bottle from a case Jenny eyes him frostily She turns on her heel and walks indoors David goes to the driver's door and gets in the car Indoors Jenny stands for lonely in the hallway David swigs from the bottle then drops it on the passenger seat He stares mournfully into the distance His lower lip trembles as he starts to cry Jenny fidgets in the hall staring at the front door Hearing the car Jack gets up and goes to the window Tears run down Jenny's cheeks as headlights sweep past the window Jenny hangs her head Danny's playing with a cricket ball as Helen sits with Jenny David watches them expressionlessly Helen looks bored then smiles ruefully at David David smiles then turns to watch the dancers returning Helen and Danny watch them leave David and Jenny walk to the car park in their overcoats David opens the boot and rummages inside Her eyes wheel up as she looks at him He tries to take her hand Back at home she sits studying She slams down her book She opens the bedroom window Smoking she looks out to the street lights Her parents are downstairs in the kitchen Jenny watches her parents doing the washing up It is an engagement ring Miss Stubs looks daggers at her The headmistress straightens archly Jenny rolls her tear filled eyes Jenny turns and walks out Jenny walks down a corridor carrying her blazer and satchel She glances into her classroom as she walks out of the school's main doors She walks down the pavement then breaks into a run A gaggle of her friends watch her go Danny's got a stuffed armadillo Danny looks worried David and Jenny leave Danny's place They head for the car David opens the door for her They drive off into the London twilight Marjorie eyes her husband reproachfully David shakes Jack's hand They troop out to the Bristol They hit for town in the gathering twilight They stop off at the petrol station"
        }
      ]
    }
  ]
}