{
  "ground_truth": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells. Soldiers climb into a truck while King George walks out of the prison. As the soldiers stand helpless in their truck and smoke billows over the town, King George walks slowly out through the burning prison gates. A bomb scores a direct hit on a ship, causing fire and black smoke to erupt from the superstructure, while pillars of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him, the old magic-man staring around impassively at the plumes of fire and bomb bursts, as the planes continue to completely obliterate the town. The Drover and Magarri sit on their horses amid the smoke and blazing buildings, with Drover staring in shock at the carnage. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find Sarah. The Carney house is ablaze, with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze, and Captain Dutton looks in shock at the stretcher his men brought in.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Drover, Magarri, and Goolaj race across a prairie while Japanese combatants fly over Mission Island. One aircraft plunges down towards it, and crouching in his cell, King George lifts his head and gazes up. On the shore on the island, Nullah looks upward as four aircraft peel away from the mass of combatants and swoop towards him. Sarah enters the military operations room and gazes at Cath with worry, while Nullah continues to gaze at the aircraft. King George stands in his cell as the aircraft dive towards the children on the shore, and Nullah's eyes widen with dread as he dashes across the shore just as bombs fall on the Mission. A clergyman rushes to the radio hut, but an aircraft targets it, and as the bomb obliterates the radio station, King George looks out through the barred window of his cell. Fletcher signs the agreement to purchase Faraway Downs, then turns and walks out onto the terrace surrounding his office at the top of a tall clock tower. Dutton pauses, hearing the sound as combatants appear in the sky over Darwin. On his balcony, Fletcher observes the nearing black dots in the atmosphere as aircraft peel off from the formation to commence their assault. Sarah stands up and gradually removes her headset as she gazes out of the window, and then a bomb detonates just outside, engulfing her in smoke, flame, and flying glass. The aircraft, with the red ascending sun on their wings, swoop and dive over the municipality, as soldiers desperately attempt to get organized. A bomb bursts outside the jail and fire billows into King George's cell, prompting Captain Dutton to roar orders as policemen let prisoners out of their cells. Soldiers climb into a lorry while King George walks out of the jail. As the soldiers stand helpless in their lorry and smoke billows over the municipality, King George walks slowly out through the burning jail gates. A bomb scores a direct hit on a vessel, causing fire and black smoke to erupt from the superstructure, while columns of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him, the old magic-man staring around impassively at the plumes of fire and bomb bursts, as the aircraft continue to completely obliterate the municipality. The Drover and Magarri sit on their steeds amid the smoke and blazing edifices, with Drover staring in shock at the carnage. Fires blaze in the gloom as a pall of smoke covers the municipality. The burning structure collapses as they ride to find Sarah. The Carney residence is ablaze, with firefighters vainly attempting to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze, and Captain Dutton looks in shock at the stretcher his men brought in."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Drover, Magarri, and Goolaj gallop across a plain while Mission Island is flown over by Japanese fighters. One plane dives down towards it, and squatting in his cell, King George raises his head and looks up. On the beach on the island, the sky is looked at by Nullah as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room, and Cath is looked at with concern by her, while the planes continue to be stared at by Nullah. King George stands in his cell as the children on the beach are dived towards by the planes, and fear widens Nullah's eyes as the beach is sprinted across by him just as the Mission is bombed. A priest hurries to the radio hut, but it is targeted by a plane, and as the radio shack is obliterated by the bomb, the barred window of his cell is looked out through by King George. Fletcher signs the contract to buy Faraway Downs, then he turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses, hearing the noise as the sky over Darwin is filled with fighters. On his balcony, the approaching black dots in the air are watched by Fletcher as the formation is peeled off from by planes to start their attack. Sarah stands up and slowly removes her headset as the window is stared out of by her, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The town is swooped and dived across by the planes, with the red rising sun on their wings, as soldiers desperately try to get organized. A bomb bursts outside the prison and fire billows into King George's cell, and Captain Dutton bellows orders as the prisoners are let out of their cells by policemen. A truck is climbed into by soldiers while King George walks out of the prison. As the soldiers stand helpless in their truck and the town is covered by smoke, King George slowly walks out through the burning prison gates. A direct hit on a ship is scored by a bomb, causing fire and black smoke to erupt from the superstructure, while pillars of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him, the old magic-man staring around impassively at the plumes of fire and bomb bursts, as the town is completely obliterated by the planes. The Drover and Magarri sit on their horses amid the smoke and blazing buildings, with the carnage being stared at in shock by Drover. Fires blaze in the darkness as the town is covered by a pall of smoke. The burning building collapses as Sarah is ridden to find by them. The Carney house is ablaze, with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrains him from walking into the blaze, and Captain Dutton looks in shock at the stretcher his men brought in."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Drover, Magarri, and Goolaj gallop across a plain as Japanese fighters fly over Mission Island. One plane dives, and in his cell, King George looks up. On the island beach, Nullah watches as four planes break away and swoop towards him. Sarah enters the army operations room, concerned, while Nullah stares at the planes. King George stands as the planes dive towards the beach, and Nullah runs in fear as bombs hit the Mission. A priest rushes to the radio hut, but a plane targets it, destroying the shack. King George peers through his cell window. Fletcher signs the contract for Faraway Downs and steps onto his office balcony. Dutton hears the noise as fighters appear over Darwin. Fletcher watches the approaching planes as they begin their attack. Sarah removes her headset and looks out the window as a bomb explodes, engulfing her in smoke and debris. Planes with red sun insignias dive across the town, as soldiers scramble to organize. A bomb explodes outside the prison, and fire enters King George's cell. Captain Dutton orders policemen to release prisoners. Soldiers board a truck while King George exits the prison. As smoke covers the town, King George walks through the burning gates. A bomb hits a ship, causing fire and smoke, while pillars of fire rise. King George watches the destruction, staring impassively at the chaos. Drover and Magarri sit on their horses amid smoke and flames, shocked by the devastation. Fires blaze as smoke covers the town. A building collapses as they search for Sarah. The Carney house burns, with firefighters struggling. Drover is horrified as men restrain him from entering the blaze, and Captain Dutton looks shocked at a stretcher brought in."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Drover, Magarri, and Goolaj gallop across a plain as Japanese fighters fly over Mission Island. A plane dives, and King George looks up from his cell. On the island beach, Nullah watches as planes swoop towards him. Sarah enters the army operations room, concerned, while Nullah stares at the planes. King George stands as planes dive towards the children, and Nullah runs as bombs hit the Mission. A priest rushes to the radio hut, but a plane destroys it, and King George watches through his cell window. Fletcher signs to buy Faraway Downs, then observes the approaching planes from his office balcony. Dutton hears the noise as fighters appear over Darwin. Fletcher watches planes start their attack. Sarah removes her headset, and a bomb explodes outside, engulfing her in smoke and glass. Planes with red suns dive across town as soldiers try to organize. A bomb bursts outside the prison, and fire enters King George's cell. Captain Dutton orders policemen to release prisoners. Soldiers climb into a truck as King George exits the prison. A bomb hits a ship, causing fire and smoke, while pillars of fire rise. King George watches the destruction, staring at the fire and bomb bursts as planes obliterate the town. Drover and Magarri sit amid smoke and blazing buildings, shocked at the carnage. Fires blaze as smoke covers the town. A burning building collapses as they search for Sarah. The Carney house burns, with firefighters struggling. Drover is restrained from entering the blaze, and Captain Dutton looks shocked at a stretcher."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Drover, Magarri, and Goolaj gallop swiftly across the expansive plain, their horses' hooves pounding the earth rhythmically, while high above them, Japanese fighter planes soar ominously over Mission Island. One of these planes suddenly breaks formation and dives down towards the island, its engine roaring. Inside his cell, King George, who is squatting on the floor, raises his head and gazes upwards, sensing the impending danger. Meanwhile, on the sandy beach of the island, young Nullah stands with his eyes fixed on the sky as four planes separate from the larger group of fighters and swoop menacingly in his direction. \n\nIn the army operations room, Sarah enters with a sense of urgency and looks at Cath, her face etched with concern, while Nullah continues to watch the planes with a mix of awe and fear. King George rises to his feet in his cell as the planes dive towards the children playing innocently on the beach. Nullah's eyes widen with terror as he suddenly sprints across the beach, his heart pounding, just as bombs begin to rain down on the Mission. A priest, in a desperate attempt to call for help, rushes to the radio hut, but a plane targets it with deadly precision, and as the bomb detonates, the radio shack is obliterated in a fiery explosion. King George peers out through the barred window of his cell, witnessing the chaos unfold.\n\nElsewhere, Fletcher signs the contract to purchase Faraway Downs, then turns and strides out onto the balcony that encircles his office, which is perched at the top of a towering clock tower. Dutton pauses in his tracks, his ears catching the ominous noise as fighters appear in the sky over Darwin. Standing on his balcony, Fletcher watches intently as the approaching black dots in the sky grow larger, the planes peeling off from their formation to commence their attack. Inside, Sarah stands up slowly, removing her headset with deliberate care as she stares out of the window, and then, without warning, a bomb explodes just outside, engulfing her in a terrifying mix of smoke, flame, and shards of flying glass.\n\nThe planes, marked with the red rising sun on their wings, swoop and dive aggressively across the town, while soldiers on the ground scramble desperately to organize a defense. A bomb detonates outside the prison, sending fire billowing into King George's cell, prompting Captain Dutton to shout orders urgently as policemen rush to release prisoners from their cells. Soldiers hastily climb into a truck, while King George calmly walks out of the prison. As the soldiers stand helplessly in their truck, smoke billowing over the town, King George walks slowly and deliberately out through the burning prison gates.\n\nA bomb scores a direct hit on a ship, causing a massive eruption of fire and thick black smoke from the superstructure, while pillars of fire leap skywards as the relentless bombs continue to fall. King George stands amidst the chaos, watching the destruction rage all around him, the old magic-man staring impassively at the plumes of fire and bomb bursts, as the planes continue their merciless assault, completely obliterating the town. The Drover and Magarri sit on their horses amid the smoke and blazing buildings, with Drover staring in shock and disbelief at the carnage unfolding before him. Fires blaze fiercely in the darkness as a thick pall of smoke envelops the town. A burning building collapses with a thunderous crash as they ride determinedly to find Sarah. The Carney house is engulfed in flames, with firefighters valiantly but vainly trying to tackle the inferno. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze, and Captain Dutton looks on in shock at the stretcher his men have brought in, the weight of the devastation heavy on his shoulders."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Drover, Magarri, and Goolaj gallop swiftly and confidently across the vast, expansive plain, their loyal horses' hooves pounding the earth in a relentless, rhythmic fashion, while high above them, Japanese fighter planes ominously soar over the serene landscape of Mission Island. In an unexpected maneuver, one of these ominous planes breaks from its tight formation, diving rapidly towards the island below, its powerful engine roaring with an intimidating growl. Within the confines of his cell, King George, who is crouched low on the floor, lifts his head slowly and gazes upwards with anticipation, sensing the impending danger that threatens. Meanwhile, on the sunlit, sandy beach of the island, young Nullah stands firmly, his eyes fixed intently on the sky above as he witnesses four planes separate from the larger group of fighters, swooping menacingly and purposefully in his direction.\n\nIn the bustling army operations room, Sarah enters with an evident sense of urgency, her expression etched with deep concern as she direct her gaze at Cath. At the same time, Nullah continues to watch the planes with a mix of awe and fear etched across his youthful face. In his cell, King George rises purposefully to his feet as the planes dive menacingly towards the unsuspecting children playing innocently on the beach. Nullah’s eyes widen with terror, and he suddenly sprints frantically across the sandy beach, his heart racing wildly, just as bombs begin to ominously rain down on the Mission. A priest, in a desperate and urgent attempt to call for assistance, rushes to the nearby radio hut, but a plane targets it with deadly precision, and as the bomb makes contact, the radio shack is completely obliterated in a fiery and catastrophic explosion. King George peers out through the barred window of his cell, watching in horror and witnessing the chaos unfold before his very eyes.\n\nElsewhere, Fletcher confidently signs the crucial contract to purchase Faraway Downs, then turns and strides out onto the expansive balcony that encircles his spacious office, which is perched elegantly at the top of a towering clock tower. Dutton pauses abruptly in his tracks, his ears catching the ominous and foreboding noise as the fighters appear threateningly in the sky over Darwin. Standing on his balcony, Fletcher watches intently and with great focus as the approaching black dots in the sky grow larger and larger, the planes peeling off from their tight formation to commence their aggressive attack. Inside, Sarah stands up slowly and deliberately, removing her headset with great care as she stares out of the window, seemingly lost in thought, and then, without any warning, a bomb explodes just outside, engulfing her in a terrifying, chaotic mix of smoke, roaring flames, and shards of flying glass.\n\nThe planes, boldly marked with the red rising sun on their powerful wings, swoop and dive aggressively across the town, while soldiers on the ground scramble desperately to organize a viable defense. A bomb detonates outside the prison, sending a terrifying burst of fire billowing dramatically into King George's cell, prompting Captain Dutton to shout orders urgently and authoritatively as policemen rush frantically to release prisoners from their locked cells. Soldiers hastily climb into a waiting truck, while King George calmly walks with determination out of the prison. As the soldiers stand helplessly in their truck, smoke billowing ominously over the town, King George walks slowly and deliberately out through the burning prison gates, a picture of calm amidst the chaos.\n\nA bomb scores a direct hit on a hapless ship, resulting in a massive, fiery eruption of flames and thick black smoke spewing from the superstructure, while towering pillars of fire leap skywards as the relentless bombs continue to fall mercilessly. King George stands amidst this chaos, watching the rampant destruction rage all around him, the old magic-man staring impassively at the plumes of fire and bomb bursts, as the planes continue their merciless and unyielding assault, completely obliterating the once-peaceful town. The Drover and Magarri sit atop their horses amid the smoke and blazing buildings, with Drover staring in shock and disbelief at the carnage unfolding directly before him. Fires blaze fiercely in the enveloping darkness as a thick pall of smoke encompasses the entire town. A burning building collapses with a thunderous crash as they ride determinedly and with purpose to find Sarah. The Carney house is engulfed in raging flames, with firefighters valiantly but unsuccessfully attempting to tackle the overwhelming inferno. Drover's eyes widen in horror as a determined group of men restrain him forcibly from walking into the blaze, and Captain Dutton looks on in shock at the stretcher his men have brought in, the weight of the devastating scene heavy on his shoulders."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Drover, Magarri, and Goolaj ride their horses at full speed across the expansive plain, their hooves pounding the ground rhythmically, while above them, Japanese fighter planes roar through the sky over Mission Island. One of these planes suddenly breaks formation and dives sharply towards the island, its engine screaming as it descends. Inside his cell, King George, who is squatting on the floor, senses the disturbance and slowly raises his head, directing his gaze upwards with a look of concern. Meanwhile, on the beach of the island, Nullah stands with his feet planted in the sand, his eyes fixed on the sky as he watches four planes separate from the larger group of fighters and swoop menacingly in his direction. In a different setting, Sarah enters the army operations room, her footsteps echoing in the tense atmosphere, and she immediately seeks out Cath, her face etched with worry. Back on the beach, Nullah remains transfixed by the sight of the approaching planes. In his cell, King George rises to his feet, his posture tense, as the planes dive ominously towards the children gathered on the beach. Nullah's eyes widen with fear, his heart pounding, and he suddenly breaks into a sprint across the sand, his legs pumping furiously as bombs begin to rain down on the Mission. A priest, sensing the urgency, rushes towards the radio hut, but a plane locks onto it, releasing a bomb that obliterates the structure in a fiery explosion. King George peers out through the barred window of his cell, witnessing the chaos unfold. Elsewhere, Fletcher, with a decisive flourish, signs the contract to purchase Faraway Downs, then pivots on his heel and strides out onto the balcony that encircles his office, which is perched atop a towering clock tower. Dutton, momentarily pausing, catches the distant roar of engines as fighter planes appear in the sky over Darwin. On his balcony, Fletcher stands, his eyes narrowing as he observes the black dots in the sky, which grow larger as planes peel off from the formation to commence their attack. Inside, Sarah rises from her seat, her movements deliberate as she removes her headset, her gaze fixed out the window, just as a bomb detonates nearby, enveloping her in a cloud of smoke, flames, and shards of glass. The planes, marked with the red rising sun on their wings, continue their assault, swooping and diving across the town, while soldiers scramble frantically to organize a defense. A bomb explodes outside the prison, sending a wave of fire into King George's cell, prompting Captain Dutton to shout orders urgently as policemen rush to release prisoners from their cells. Soldiers clamber into a truck, their movements hurried and tense, while King George calmly walks out of the prison, his demeanor unflustered. As the soldiers sit helplessly in their truck, smoke billowing over the town, King George proceeds slowly through the burning prison gates, his steps measured and unhurried. A bomb strikes a ship with precision, igniting a fireball and sending thick black smoke spiraling from the superstructure, while elsewhere, pillars of fire shoot skywards as more bombs fall. King George stands amidst the devastation, his expression impassive as he surveys the plumes of fire and the relentless bomb bursts, the planes continuing their merciless destruction of the town. Drover and Magarri remain seated on their horses, surrounded by smoke and the glow of blazing buildings, with Drover staring in disbelief at the widespread carnage. Fires rage in the darkness, casting an eerie glow as a thick pall of smoke blankets the town. A burning building collapses in the distance as they ride with determination to find Sarah. The Carney house is engulfed in flames, with firefighters battling in vain to control the inferno. Drover's eyes widen in horror as a group of men forcibly restrain him from rushing into the blaze, while Captain Dutton stands in shock, his gaze fixed on the stretcher that his men have brought in, the weight of the situation pressing heavily upon him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Drover, Magarri, and Goolaj gallop across a plain as Japanese fighters fly over Mission Island. A plane dives towards the island, prompting King George to look up from his cell, while Nullah watches the planes approach. In the army operations room, Sarah enters with concern, and Nullah sprints across the beach as bombs fall on the Mission. A priest rushes to the radio hut, but a plane destroys it, and King George observes from his cell. Fletcher signs the contract to buy Faraway Downs and steps onto his office balcony, noticing the fighters over Darwin. As planes begin their attack, Sarah removes her headset and is engulfed by an explosion outside. The planes, marked with the red rising sun, dive across the town as soldiers scramble to respond. A bomb explodes near the prison, and fire reaches King George's cell, leading Captain Dutton to order the release of prisoners. King George exits the prison amid chaos, while soldiers stand helplessly in a truck. A bomb hits a ship, causing fire and smoke, as King George watches the destruction unfold. Drover and Magarri, on horseback, witness the devastation, with Drover in shock. Fires rage in the darkness, and as a building collapses, they search for Sarah. The Carney house burns, and firefighters struggle to contain it. Drover is restrained from entering the blaze, while Captain Dutton reacts to a stretcher brought in by his men."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Drover, Magarri, and Goolaj gallop across a plain while Japanese fighters, part of the 1942 air raids, fly over Mission Island in the Northern Territory of Australia. One plane dives down towards it, and squatting in his cell, King George, an indigenous elder known for his spiritual connection to the land, raises his head and looks up. On the beach on the island, Nullah, a young boy caught in the chaos of war, looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room, a hub of frantic activity during the bombing of Darwin, and looks at Cath with concern, while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach, and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission, a place that provided refuge for many during the war. A priest hurries to the radio hut, vital for communication amidst the attacks, but a plane targets it, and as the bomb obliterates the radio shack, King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs, a sprawling cattle station central to the local economy, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower, a remnant of colonial architecture. Dutton pauses, hearing the noise as fighters appear in the sky over Darwin, a critical military target during World War II. On his balcony, Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun insignia of the Japanese military on their wings, swoop and dive across the town, as soldiers desperately try to get organized amidst the chaos of the first attack on Australian soil since colonization. A bomb bursts outside the prison and fire billows into King George's cell, prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells, a desperate measure to ensure their safety. Soldiers climb into a truck while King George walks out of the prison, witnessing firsthand the devastation wrought by the air raid. As the soldiers stand helpless in their truck and smoke billows over the town, King George walks slowly out through the burning prison gates, symbolizing resilience amid destruction. A bomb scores a direct hit on a ship, one of many targeted during the attack, causing fire and black smoke to erupt from the superstructure, while pillars of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him, the old magic-man staring around impassively at the plumes of fire and bomb bursts, as the planes continue to completely obliterate the town, a testament to the powerlessness felt by many. The Drover and Magarri sit on their horses amid the smoke and blazing buildings, with Drover staring in shock at the carnage, a stark reminder of war's indiscriminate nature. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find Sarah, determined to reunite amidst the turmoil. The Carney house is ablaze, with firefighters vainly trying to tackle it, their efforts dwarfed by the scale of the disaster. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze, and Captain Dutton looks in shock at the stretcher his men brought in, a grim acknowledgment of the human cost of the attack."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island  One plane dives down towards it and squatting in his cell King George raises his head and looks up  On the beach on the island  Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass  The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized  A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells  Soldiers climb into a truck while King George walks out of the prison  As the soldiers stand helpless in their truck and smoke billows over the town  King George walks slowly out through the burning prison gates  A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure  while pillars of fire leap skywards as the bombs fall  King George stands and watches the destruction rage all around him  the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town  The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage  Fires blaze in the darkness as a pall of smoke covers the town  The burning building collapses as they ride to find Sarah  Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him  Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes  King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission  A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell  Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower  Dutton pauses hearing the noise as fighters appear in the sky over Darwin  On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack  Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass  The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized  A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells  Soldiers climb into a truck while King George walks out of the prison  As the soldiers stand helpless in their truck and smoke billows over the town  King George walks slowly out through the burning prison gates  A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure  while pillars of fire leap skywards as the bombs fall  King George stands and watches the destruction rage all around him  the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town  The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage  Fires blaze in the darkness as a pall of smoke covers the town  The burning building collapses as they ride to find Sarah  The Carney house is ablaze with firefighters vainly trying to tackle it  Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it and squatting in his cell King George raises his head and looks up. On the beach on the island. Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses hearing the noise as fighters appear in the sky over Darwin. On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass. The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells. Soldiers climb into a truck while King George walks out of the prison. As the soldiers stand helpless in their truck and smoke billows over the town. King George walks slowly out through the burning prison gates. A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure. while pillars of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him. the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town. The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find Sarah. The Carney house is ablaze with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it and squatting in his cell King George raises his head and looks up. On the beach on the island. Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell. Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. Dutton pauses hearing the noise as fighters appear in the sky over Darwin. On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack. Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass. The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells. Soldiers climb into a truck while King George walks out of the prison. As the soldiers stand helpless in their truck and smoke billows over the town. King George walks slowly out through the burning prison gates. A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure. while pillars of fire leap skywards as the bombs fall. King George stands and watches the destruction rage all around him. the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town. The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find Sarah. The Carney house is ablaze with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it and squatting in his cell King George raises his head and looks up. On the beach on the island. Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him. Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes. King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. King George stands and watches the destruction rage all around him. the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town. The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find Sarah. The Carney house is ablaze with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island. One plane dives down towards it and squatting in his cell King George raises his head and looks up. The burning building collapses as they ride to find Sarah. The Carney house is ablaze with firefighters vainly trying to tackle it. Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The owl, the hedgehog, and the kangaroo gallop across a plain while penguins fly over Mission Island. One plane dives down towards it, and squatting in his cell, the librarian raises his head and looks up. On the beach on the island, the rabbit looks skywards as four planes peel away from the mass of fighters and swoop towards him. The giraffe walks into the army operations room and looks at the hare with concern, while the rabbit continues to stare at the planes. The librarian stands in his cell as the planes dive towards the children on the beach, and the rabbit's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission. A ballerina hurries to the radio hut, but a plane targets it, and as the bomb obliterates the radio shack, the librarian looks out through the barred window of his cell. The squirrel signs the contract to buy Faraway Downs, then turns and walks out onto the balcony surrounding his office at the top of a high clock tower. The panda pauses, hearing the noise as fighters appear in the sky over Darwin. On his balcony, the squirrel watches the approaching black dots in the air as planes peel off from the formation to start their attack. The giraffe stands up and slowly removes her headset as she stares out of the window, and then a bomb explodes just outside, engulfing her in smoke, flame, and flying glass. The planes, with the red rising sun on their wings, swoop and dive across the town, as witches desperately try to get organized. A bomb bursts outside the prison and fire billows into the librarian's cell, prompting the panda to bellow orders as chefs let prisoners out of their cells. Astronauts climb into a truck while the librarian walks out of the prison. As the astronauts stand helpless in their truck and smoke billows over the town, the librarian walks slowly out through the burning prison gates. A bomb scores a direct hit on a ship, causing fire and black smoke to erupt from the superstructure, while pillars of fire leap skywards as the bombs fall. The librarian stands and watches the destruction rage all around him, the old magic-man staring around impassively at the plumes of fire and bomb bursts, as the planes continue to completely obliterate the town. The owl and the hedgehog sit on their horses amid the smoke and blazing buildings, with the owl staring in shock at the carnage. Fires blaze in the darkness as a pall of smoke covers the town. The burning building collapses as they ride to find the giraffe. The Carney house is ablaze, with firefighters vainly trying to tackle it. The owl's eyes widen in horror as a group of nymphs restrain him from walking into the blaze, and the panda looks in shock at the stretcher his men brought in."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Drover, Magarri, and Goolaj gallop across a desert while Italian helicopters hover over Sanctuary Peninsula. One helicopter descends towards it, and crouching in his tent, King George raises his head and looks up. On the dunes on the peninsula, Nullah looks skywards as four helicopters break away from the swarm of choppers and zoom towards him. Sarah walks into the naval command center and looks at Cath with concern, while Nullah continues to stare at the helicopters. King George stands in his tent as the helicopters dive towards the teenagers on the dunes, and Nullah's eyes widen with fear as he runs across the dunes just as missiles fall on the Sanctuary. A monk rushes to the signal cabin, but a helicopter targets it, and as the missile obliterates the signal cabin, King George looks out through the lattice window of his tent. Fletcher signs the document to acquire Dreamland Valley, then turns and walks out onto the terrace surrounding his study at the top of a high lighthouse. Dutton pauses, hearing the clamor as helicopters appear in the sky over Brisbane. On his terrace, Fletcher watches the approaching dark specks in the air as helicopters break off from the squadron to begin their assault. Sarah stands up and slowly removes her earpiece as she gazes out of the window, and then a missile detonates just outside, engulfing her in smoke, flames, and flying shards. The helicopters, with the red crescent moon on their sides, swoop and dive across the village, as sailors desperately try to get organized. A missile bursts outside the barracks and fire surges into King George's tent, prompting Lieutenant Dutton to shout orders as guards release detainees from their tents. Sailors board a van while King George walks out of the barracks. As the sailors stand helpless in their van and smoke swirls over the village, King George walks slowly out through the burning barracks gates. A missile scores a direct hit on a barge, causing fire and black smoke to erupt from the deck, while columns of fire leap skywards as the missiles fall. King George stands and watches the devastation rage all around him, the old magic-man staring around impassively at the plumes of fire and missile bursts, as the helicopters continue to completely obliterate the village. The Drover and Magarri sit on their camels amid the smoke and blazing structures, with Drover staring in shock at the carnage. Fires blaze in the twilight as a shroud of smoke covers the village. The burning structure collapses as they ride to find Sarah. The Cartwright mansion is ablaze, with rescuers vainly trying to tackle it. Drover's eyes widen in horror as a group of sailors restrain him from walking into the inferno, and Lieutenant Dutton looks in shock at the stretcher his men brought in."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Drover, Magarri, and Goolaj trot across a plain while Japanese fighters hover over Mission Island. One plane ascends away from it, and sitting in his cell, King George lowers his head and glances down. On the beach on the island, Nullah glances earthwards as four planes converge into the mass of fighters and drift away from him. Sarah strides into the army operations room and stares at Cath with indifference, while Nullah turns his back to the planes. King George lays down in his cell as the planes drift away from the children on the beach, and Nullah's eyes narrow with curiosity as he meanders across the beach just as fireworks explode on the Mission. A priest strolls to the radio hut, but a plane ignores it, and as the bomb skips past the radio shack, King George gazes out through the barred window of his cell. Fletcher tears the contract to buy Faraway Downs, then turns and skips out onto the balcony surrounding his office at the top of a high clock tower. Dutton sleeps, ignoring the noise as fighters disappear in the sky over Darwin. On his balcony, Fletcher overlooks the departing black dots in the air as planes drift back to the formation to end their attack. Sarah sits down and quickly dons her headset as she peers into the window, and then a bomb dissipates just outside, sheltering her in dust, silence, and still air. The planes, with the red rising sun on their wings, hover and drift across the town, as soldiers lazily try to get organized. A bomb misses outside the prison and air wafts into King George's cell, prompting Captain Dutton to whisper orders as policemen keep prisoners in their cells. Soldiers descend from a truck while King George remains in the prison. As the soldiers lie helpless beside their truck and clear sky spreads over the town, King George sits quietly within the smoldering prison gates. A bomb narrowly misses a ship, causing ripples and gray mist to spread from the superstructure, while clouds of smoke linger earthwards as the bombs dissipate. King George reclines and listens to the peace settle all around him, the old magic-man sitting impassively amid the silence and bomb misses, as the planes continue to gently drift past the town. The Drover and Magarri dismount from their horses amid the clear air and pristine buildings, with Drover observing in tranquility the spectacle. The sky clears in the brightness as the pall of smoke dissipates from the town. The intact building stands firm as they march to find Sarah. The Carney house shines, with firefighters successfully tackling the minor flare-ups. Drover's eyes narrow in confusion as a group of men invite him to join them away from the calm, and Captain Dutton nods in understanding at the bench his men carried in."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Opal, Quazar, and Renko skip across a desert while Canadian surfers glide over Harmony Bay. One canoe dips down towards it, and lounging in his cabin, Emperor Max lifts his cap and gazes up. On the shore of the bay, Quilla gazes skywards as six canoes drift away from the parade of surfers and glide towards her. Alice strolls into the naval analysis tent and glances at Beth with curiosity, while Quilla continues to gaze at the canoes. Emperor Max lounges in his cabin as the canoes descend towards the toddlers on the shore, and Quilla's eyes widen with surprise as she dashes across the shore just as rafts land on the Harmony. A monk rushes to the radar tent, but a canoe targets it, and as the raft demolishes the radar hut, Emperor Max gazes through the shielded portal of his cabin. Thompson approves the paperwork to purchase Distant Pastures, then turns and steps out onto the terrace encircling his quarters at the peak of a lofty sundial tower. Skinner hesitates, detecting the sound as surfers emerge in the sky above Perth. On his terrace, Thompson observes the incoming white blobs in the atmosphere as canoes break away from the squadron to begin their offensive. Alice rises and leisurely detaches her helmet as she gazes out of the portal, and then a raft detonates just nearby, enveloping her in vapor, blaze, and airborne pebbles. The canoes, with the blue falling moon on their sails, glide and dip around the village, as farmers frantically attempt to coordinate. A raft cracks open outside the asylum and steam spouts into Emperor Max's cabin, prompting Commander Skinner to yell commands as park rangers free detainees from their chambers. Farmers scramble into a wagon while Emperor Max steps out of the asylum. As the farmers stand powerless in their wagon and steam billows over the village, Emperor Max strides leisurely out through the flaming asylum arches. A raft lands directly on a submarine, causing steam and white vapor to explode from the hull, while spires of steam leap skywards as the rafts descend. Emperor Max stands and observes the havoc engulfing all around him, the ancient sorcerer surveying around dispassionately at the columns of vapor and raft cracks, as the canoes persist in utterly demolishing the village. Opal and Quazar lounge on their bicycles amid the steam and blazing homes, with Opal gaping in awe at the devastation. Vapors swirl in the gloom as a pall of steam cloaks the village. The fiery structure topples as they cycle to locate Alice. The Allens' estate blazes, with rescuers futilely attempting to manage it. Opal's eyes widen in terror as a troop of women prevent her from pedaling into the inferno, and Commander Skinner stares in astonishment at the sedan his women retrieved."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Mickey, Pluto, and Goofy skip across a meadow while Egyptian pharaohs glide over Treasure Island. One chariot rolls down towards it, and reclining in his hammock, Chief Sitting Bull lowers his gaze and glances down. On the shore of the island, Mowgli glances skywards as four eagles detach from the flock of pharaohs and soar towards him. Emma saunters into the library reading room and glances at Katy with interest, while Mowgli continues to gaze at the eagles. Chief Sitting Bull reclines in his hammock as the eagles hover towards the children on the shore, and Mowgli's eyes brighten with curiosity as he dances across the shore just as baubles rain on the Treasure. A sailor skips to the postcard booth, but a chariot aims at it, and as the bauble reconstructs the postcard tent, Chief Sitting Bull peers out through the curtained window of his hammock. Anderson seals the envelope to sell Endless Acres, then spins and skips out onto the patio encircling his studio at the summit of a tall clock spire. Johnson hesitates, hearing the melody as pharaohs appear in the sky over Atlantis. On his patio, Anderson smiles at the approaching white specks in the air as eagles separate from the cluster to begin their flight. Emma rises up and swiftly places her book down as she gazes through the window, and then a bauble twinkles just outside, enfolding her in mist, glitter, and floating feathers. The eagles, with the golden setting moon on their wings, soar and hover across the village, as druids eagerly attempt to get synchronized. A bauble glows outside the coliseum and water ripples into Chief Sitting Bull's hammock, prompting Commander Johnson to mutter instructions as guards urge townsfolk out of their hammocks. Druids slide into a wagon while Chief Sitting Bull trots out of the coliseum. As the druids stand bemused in their wagon and mist swirls over the village, Chief Sitting Bull skips slowly out through the cascading coliseum archway. A bauble misses a direct strike on a caravan, causing mist and white feathers to float from the mast, while streams of water splash upwards as the baubles drift. Chief Sitting Bull skips and observes the enchantment simmer all around him, the old mystic-man observing nonchalantly at the wisps of mist and bauble twinkles, as the eagles continue to silently illuminate the village. Mickey and Pluto rest on their carriages amidst the mist and shimmering cottages, with Mickey observing in awe at the wonder. Water glitters in the twilight as a blanket of mist veils the village. The shimmering structure crumbles as they glide to find Emma. The Simpson manor is aglow, with gardeners hopelessly attempting to cultivate it. Mickey's eyes broaden in exhilaration as a cluster of children release him from stepping into the glow, and Commander Johnson glances in awe at the canopy his team brought in."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Drover, Magarri, and Goolaj sprint across a meadow while paper kites soar over Festival Island. One kite glides down towards it, and crouching in his office, King George raises his head and glances up. On the shore on the island, Nullah gazes skywards as four kites drift away from the group of kites and flutter towards him. Sarah strides into the library reading room and glances at Cath with curiosity, while Nullah continues to observe the kites. King George paces in his office as the kites glide towards the children on the shore, and Nullah's eyes widen with intrigue as he skips across the beach just as flowers blossom on the Mission. A sailor rushes to the phone booth, but a kite targets it, and as the wind scatters the phone shack, King George peers out through the mesh window of his office. Fletcher signs the receipt to rent Faraway Downs, then turns and steps onto the veranda surrounding his office at the top of a tall bell tower. Dutton hesitates, hearing the sound as balloons appear in the sky over Darwin. On his veranda, Fletcher observes the approaching dark spots in the air as kites drift off from the group to begin their display. Sarah stands up and gingerly places down her glasses as she looks out of the window, and then a balloon bursts just outside, enveloping her in steam, ash, and floating paper. The kites, with the red morning sun on their tails, drift and glide across the town, as workers frantically try to get coordinated. A balloon pops outside the museum and ash swirls into King George's office, prompting Captain Dutton to shout instructions as guards let workers out of their cubicles. Workers climb into a wagon while King George strolls out of the museum. As the workers stand bemused in their wagon and ash swirls over the town, King George walks slowly out through the swirling museum gates. A kite scores a precise hit on a ferry, causing ash and gray smoke to rise from the hull, while columns of ash soar skywards as the kites float down. King George stands and observes the commotion swirl all around him, the old wise man gazing around calmly at the tendrils of ash and kite tumbles, as the kites continue to utterly unravel the town. The Drover and Magarri sit on their camels amid the ash and smoldering ruins, with Drover gazing in awe at the chaos. Ash swirls in the twilight as a veil of smoke blankets the town. The smoldering building crumbles as they trot to find Sarah. The Carney hut is engulfed, with volunteers impotently trying to douse it. Drover's eyes widen in awe as a group of women coax him from walking into the embers, and Captain Dutton stares in disbelief at the cart his workers brought in."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Muffin, Crumpet, and Flapjack swim across a river while German pirates sail over Treasure Cove. One ship glides down towards it, and lying in his hammock, Sir Arthur lowers his cap and gazes up. On the dock on the cove, Jasper gazes upwards as four ships break away from the fleet of pirates and sail towards him. Emma strolls into the hurricane control center and peers at Lucy with curiosity, while Jasper continues to gaze at the ships. Sir Arthur lounges in his hammock as the ships glide towards the animals on the dock, and Jasper's whiskers twitch with excitement as he tumbles across the dock just as torpedoes splash on the Fortress. A sailor rushes to the signal tent, but a ship targets it, and as the cannonball shatters the signal kiosk, Sir Arthur peers out through the lattice window of his hammock. Thompson marks the parchment to acquire Whispering Woods, then pivots and strolls out onto the veranda surrounding his study at the crest of a tall lighthouse. Randall halts, detecting the vibration as pirates materialize in the sky over Endor. On his veranda, Thompson squints at the advancing white shapes in the sea as ships break from the convoy to commence their invasion. Emma rises and gently drops her earbuds as she peers out of the skylight, and then a torpedo detonates just below, submerging her in mist, sparks, and shattering leaves. The ships, with the blue crescent moon on their sails, sail and glide across the country, as villagers frantically attempt to get organized. A torpedo detonates outside the fortress and water funnels into Sir Arthur's hammock, prompting Sheriff Randall to howl instructions as rangers release captives from their hammocks. Villagers leap into a raft while Sir Arthur floats out of the fortress. As the villagers sit confused in their raft and steam curls over the country, Sir Arthur floats slowly out through the chilling fortress doors. A torpedo achieves a perfect strike on a canoe, causing water and white steam to burst from the deck, while columns of steam leap upwards as the torpedoes splash. Sir Arthur lounges and observes the chaos rage all around him, the curious fortune-teller observing around impassively at the geysers of steam and splashes, as the ships continue to completely erase the country. Muffin and Crumpet sit on their benches amid the steam and extinguished structures, with Muffin squinting in disbelief at the ruins. Steam curls in the twilight as a veil of mist conceals the country. The extinguished pavilion tumbles as they glide to locate Emma. The Baker’s cottage is submerged, with divers fruitlessly attempting to salvage it. Muffin's whiskers twitch in panic as a crowd of children stop him from diving into the flood, and Sheriff Randall stares in disbelief at the stretcher his team transported in."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Drover, Magarri, and Goolaj ride across the plain as Japanese fighters fly over Mission Island. Nullah watches four planes swoop toward him on the beach. Sarah enters the army operations room, concerned, as the planes dive, and Nullah runs as bombs hit the Mission. A priest hurries to the radio hut, but a bomb destroys it, while King George watches from his cell. Fletcher signs a contract and heads to his balcony as planes attack Darwin. Sarah removes her headset as a bomb explodes outside, engulfing her in smoke. Bombs fall, and policemen release prisoners. Soldiers board a truck as King George walks out of the burning prison. A bomb hits a ship, and fires rage. King George observes the destruction impassively. Amid smoke and flames, Drover and Magarri ride to find Sarah. The Carney house burns, firefighters struggle, and Drover is held back from the blaze. Captain Dutton reels in shock at a stretcher."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in The Carney house is ablaze with firefighters vainly trying to tackle it  The burning building collapses as they ride to find Sarah  Fires blaze in the darkness as a pall of smoke covers the town  The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage  the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town  King George stands and watches the destruction rage all around him  while pillars of fire leap skywards as the bombs fall  A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure  King George walks slowly out through the burning prison gates  As the soldiers stand helpless in their truck and smoke billows over the town  Soldiers climb into a truck while King George walks out of the prison  A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells  The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized  Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass  On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack  Dutton pauses hearing the noise as fighters appear in the sky over Darwin  Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower  A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell  King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission  Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes  Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him  On the beach on the island  One plane dives down towards it and squatting in his cell King George raises his head and looks up  Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "King George walks slowly out through the burning prison gates  Fires blaze in the darkness as a pall of smoke covers the town  the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town  A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure  King George stands and watches the destruction rage all around him  The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized  while pillars of fire leap skywards as the bombs fall  As the soldiers stand helpless in their truck and smoke billows over the town  Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower  Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island  The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage  On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack  The Carney house is ablaze with firefighters vainly trying to tackle it  King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission  One plane dives down towards it and squatting in his cell King George raises his head and looks up  A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells  On the beach on the island  Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him  Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell  Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes  Dutton pauses hearing the noise as fighters appear in the sky over Darwin  Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass  Soldiers climb into a truck while King George walks out of the prison  The burning building collapses as they ride to find Sarah "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Soldiers climb into a truck while King George walks out of the prison  As the soldiers stand helpless in their truck and smoke billows over the town  King George walks slowly out through the burning prison gates  A bomb scores a direct hit on a ship causing fire and black smoke to erupt from the superstructure  while pillars of fire leap skywards as the bombs fall  King George stands and watches the destruction rage all around him  the old magicman staring around impassively at the plumes of fire and bomb bursts as the planes continue to completely obliterate the town  The Drover and Magarri sit on their horses amid the smoke and blazing buildings with Drover staring in shock at the carnage  Fires blaze in the darkness as a pall of smoke covers the town  The burning building collapses as they ride to find Sarah  The Carney house is ablaze with firefighters vainly trying to tackle it  Drover's eyes widen in horror as a group of men restrain him from walking into the blaze and Captain Dutton looks in shock at the stretcher his men brought in Drover Magarri and Goolaj gallop across a plain while Japanese fighters fly over Mission Island  One plane dives down towards it and squatting in his cell King George raises his head and looks up  On the beach on the island  Nullah looks skywards as four planes peel away from the mass of fighters and swoop towards him  Sarah walks into the army operations room and looks at Cath with concern while Nullah continues to stare at the planes  King George stands in his cell as the planes dive towards the children on the beach and Nullah's eyes widen with fear as he sprints across the beach just as bombs fall on the Mission  A priest hurries to the radio hut but a plane targets it and as the bomb obliterates the radio shack King George looks out through the barred window of his cell  Fletcher signs the contract to buy Faraway Downs then turns and walks out onto the balcony surrounding his office at the top of a high clock tower  Dutton pauses hearing the noise as fighters appear in the sky over Darwin  On his balcony Fletcher watches the approaching black dots in the air as planes peel off from the formation to start their attack  Sarah stands up and slowly removes her headset as she stares out of the window and then a bomb explodes just outside engulfing her in smoke flame and flying glass  The planes with the red rising sun on their wings swoop and dive across the town as soldiers desperately try to get organized  A bomb bursts outside the prison and fire billows into King George's cell prompting Captain Dutton to bellow orders as policemen let prisoners out of their cells "
        }
      ]
    }
  ]
}