{
  "ground_truth": "She runs down the pier as the boat draws alongside. Nullah and Sarah peer through the smoke. The boy stands up on the prow of the boat and grins. He jumps up and down excitedly and runs off the boat onto the jetty. He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah. Nullah points and she turns slowly. There in the smoke stands the Drover. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief, then smiles and they embrace. They cling to each other, tears running down their cheeks. They break apart and look joyfully at one another, then kiss. Nullah runs up and hugs them both. Drover grins happily. The army sergeant sounds the horn of his truck and smiles. Dutton stops and stares at Sarah, Drover, and the boys. He's taken aback by her hug. The sergeant stomps up to the young priest. Fletcher grimly watches the boys, streaming towards the trucks. Sarah rests her head on Drover's shoulder and caresses his cheek. Dutton turns to them. Dutton smiles tearfully. He nods and walks away. Fletcher strides angrily towards the truck the boys are getting into. Dutton's the last on. The tailgate is raised and the trucks head off. Fletcher runs through the devastation, watched from the water tower by King George. Sarah's walking with Nullah. King George looks in horror as Fletcher grabs Bull's rifle. King George raises his arms in his magic-man stance as Fletcher advances with the rifle. King George watches Fletcher closely. Sarah smiles as Nullah runs towards the pub. Fletcher stands on top of a pile of wreckage and aims the rifle. Sarah spots the danger and, at the pub, Drover sees Fletcher. Drover runs for the boy. King George pulls a pipe off the water tower. Fletcher grimaces and Drover falls to the ground with Nullah. King George's pipe has run Fletcher through like a spear. King George glares at him. Drover strokes his hair. The unconscious boy's eyes flicker. Nullah grins. Fletcher tries to aim the rifle at King George. Fletcher winces and drops the rifle. Sarah reaches Drover and Nullah. Fletcher tries to speak and then collapses over a piece of wreckage. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss, tenderly. Callahan walks away from Fletcher's body, across the wrecked King Carney cattle pen. Smoke hangs in palls over the destruction of Darwin. Drover drives the car in the sunshine, with Sarah and Nullah asleep next to him. Sarah picks up kindling for a fire in a field next to a river. She straightens and stares.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She dashes down the dock as the vessel approaches alongside. Nullah and Sarah gaze through the haze. The lad rises up on the bow of the ship and beams. He leaps up and down eagerly and dashes off the vessel onto the landing. He races up the timber stairs to the upper tier of the quay and speeds through the smoke towards Sarah. Nullah indicates and she rotates gradually. There in the haze stands the Drover. Their gazes connect and they move slowly towards each other. Drover scowls in incredulity, then grins and they clasp. They hold to each other, tears coursing down their faces. They separate and look blissfully at each other, then kiss. Nullah rushes up and embraces them both. Drover beams joyfully. The military sergeant blares the horn of his vehicle and grins. Dutton pauses and gapes at Sarah, Drover, and the lads. He's taken aback by her embrace. The sergeant stomps up to the young clergyman. Fletcher sternly observes the boys, streaming towards the lorries. Sarah places her head on Drover's shoulder and caresses his face. Dutton turns to them. Dutton grins tearfully. He nods and strides away. Fletcher marches angrily towards the truck the lads are boarding. Dutton's the final on. The tailgate is elevated and the lorries drive off. Fletcher rushes through the destruction, observed from the water tower by King George. Sarah's strolling with Nullah. King George gazes in terror as Fletcher seizes Bull's firearm. King George elevates his arms in his sorcery-man posture as Fletcher advances with the firearm. King George observes Fletcher intently. Sarah beams as Nullah dashes towards the tavern. Fletcher stands on top of a mound of debris and targets the firearm. Sarah spots the peril and, at the tavern, Drover sees Fletcher. Drover runs for the boy. King George pulls a rod off the water tower. Fletcher grimaces and Drover drops to the ground with Nullah. King George's rod has pierced Fletcher like a lance. King George stares at him. Drover strokes his hair. The unconscious lad's eyes flicker. Nullah beams. Fletcher attempts to target the firearm at King George. Fletcher winces and drops the firearm. Sarah reaches Drover and Nullah. Fletcher tries to utter and then collapses over a fragment of rubble. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss, softly. Callahan strides away from Fletcher's body, across the demolished King Carney stock enclosure. Smoke drapes in curtains over the devastation of Darwin. Drover drives the vehicle in the sunshine, with Sarah and Nullah asleep beside him. Sarah gathers fuel for a fire in a meadow next to a stream. She straightens and gazes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The pier is run down by her as the boat is drawn alongside. Through the smoke peer Nullah and Sarah. Up on the prow of the boat stands the boy, and a grin is given by him. Up and down he jumps excitedly and the boat is run off by him onto the jetty. Up the wooden steps to the upper level of the wharf is run by him, and through the smoke he sprints towards Sarah. A point is made by Nullah and she is turned slowly. There in the smoke, the Drover stands. Their eyes are met and they walk slowly towards one another. Disbelief is shown by Drover with a frown, then a smile is given and an embrace is shared by them. Each other is clung to by them, with tears running down their cheeks. They are broken apart and joyful looks are given to one another, then they kiss. Up runs Nullah and a hug is given to them both. A happy grin is given by Drover. The horn of his truck is sounded by the army sergeant, and a smile is shown. A stare is given by Dutton at Sarah, Drover, and the boys. Her hug takes him aback. The young priest is stomped up to by the sergeant. The boys are watched grimly by Fletcher as they stream towards the trucks. Her head is rested on Drover's shoulder by Sarah and his cheek is caressed. To them turns Dutton. A tearful smile is given by Dutton. A nod is given and a walk away is taken by him. Angrily towards the truck the boys are getting into strides Fletcher. On is Dutton last. The tailgate is raised and off head the trucks. Through the devastation Fletcher runs, while he is watched from the water tower by King George. With Nullah, Sarah is walking. In horror King George looks as Bull's rifle is grabbed by Fletcher. In his magic-man stance, King George raises his arms as with the rifle Fletcher advances. Fletcher is watched closely by King George. As towards the pub, Nullah runs, a smile is given by Sarah. On top of a pile of wreckage stands Fletcher and the rifle is aimed. The danger is spotted by Sarah and, at the pub, Fletcher is seen by Drover. For the boy, Drover runs. Off the water tower, a pipe is pulled by King George. A grimace is given by Fletcher, and the ground is fallen to by Drover with Nullah. Through like a spear, King George's pipe has run Fletcher. A glare is given by King George. His hair is stroked by Drover. The unconscious boy's eyes flicker. A grin is given by Nullah. The rifle is aimed by Fletcher at King George. A wince is given and the rifle is dropped by Fletcher. Drover and Nullah are reached by Sarah. An attempt to speak is made by Fletcher and then he collapses over a piece of wreckage. Nullah is cuddled by Sarah. Fletcher's pulse is checked by Sergeant Callahan. Into each other's eyes Sarah and Drover gaze. A tender kiss is shared by them. Away from Fletcher's body walks Callahan, across the wrecked King Carney cattle pen. Palls of smoke hang over the destruction of Darwin. The car is driven by Drover in the sunshine, with Sarah and Nullah asleep next to him. Kindling for a fire in a field next to a river is picked up by Sarah. She straightens and a stare is given by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She runs down the pier as the boat approaches. Nullah and Sarah look through the smoke. The boy stands on the prow and grins, jumping excitedly before running to the jetty. Ascending the wooden steps to the wharf's upper level, he sprints through smoke towards Sarah. Nullah points, prompting her to turn slowly. In the smoke stands the Drover. Their eyes meet, and they walk towards each other. Drover frowns in disbelief, then smiles, and they embrace, tears on their cheeks. They part, look joyfully, then kiss. Nullah joins and hugs them. Drover grins. The army sergeant sounds a truck horn, smiling. Dutton stares, taken aback by her hug. The sergeant approaches the young priest. Fletcher grimly watches boys boarding trucks. Sarah rests her head on Drover's shoulder. Dutton smiles tearfully, nods, and walks away. Fletcher strides angrily to the truck. Dutton boards last. Trucks depart. Fletcher runs through devastation, observed by King George from a water tower. Sarah walks with Nullah. King George looks horrified as Fletcher grabs Bull's rifle. King George raises his arms as Fletcher advances. Sarah smiles while Nullah runs to the pub. Fletcher aims the rifle. Sarah and Drover spot the danger. Drover races for the boy. King George pulls a pipe from the tower. Fletcher grimaces, and Drover falls with Nullah. King George's pipe pierces Fletcher. Drover strokes Nullah's hair as the boy's eyes flicker. Nullah grins. Fletcher tries to aim at King George but drops the rifle. Sarah reaches Drover and Nullah. Fletcher collapses. Sarah holds Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes, kissing tenderly. Callahan walks away from Fletcher's body across the wrecked cattle pen. Smoke obscures Darwin's destruction. Drover drives with Sarah and Nullah asleep. Sarah collects kindling by a river and straightens to stare."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She runs down the pier as the boat arrives. Nullah and Sarah peer through the smoke. The boy grins from the prow, jumps off onto the jetty, and sprints through the smoke to Sarah. Nullah points; Sarah turns to see Drover. Their eyes meet, they embrace, tearfully joyful, then kiss. Nullah joins them, hugging. The army sergeant honks his truck horn and smiles. Dutton watches them, surprised by Sarah's hug. The sergeant approaches the young priest. Fletcher watches boys boarding trucks. Sarah rests on Drover's shoulder; Dutton smiles, nods, and leaves. Fletcher angrily follows boys boarding; Dutton boards last. Trucks depart. Fletcher runs through devastation, watched by King George. Sarah walks with Nullah. Fletcher grabs Bull's rifle while King George prepares. Fletcher aims; Sarah spots danger. Drover rushes to Nullah as King George spears Fletcher with a pipe. Fletcher drops the rifle; Sarah reaches them, cuddles Nullah. Fletcher collapses; Callahan checks his pulse. Sarah and Drover kiss tenderly. Callahan leaves Fletcher's body amidst Darwin's wreckage. Drover drives with Sarah and Nullah asleep. Sarah gathers kindling by a river, then straightens and stares."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As she swiftly runs down the length of the pier, the boat gradually draws alongside it. Both Nullah and Sarah peer intently through the lingering smoke that clouds their vision. The boy, full of excitement, stands upright on the prow of the boat, his face breaking into a wide, cheerful grin. He jumps up and down with sheer joy and energy before running off the boat to the jetty. From there, he dashes eagerly up the wooden steps, reaching the upper level of the wharf where the smoke hangs thick. He sprints with determination toward Sarah. Meanwhile, Nullah points, prompting Sarah to turn slowly but surely. In the midst of the smoke, stands the Drover. Their eyes meet, locking in an unspoken understanding, and they slowly walk toward each other with deliberate steps. The Drover's initial frown conveys disbelief, which melts into a warm smile as they embrace wholeheartedly. Tears stream down their faces as they cling to one another in a tight embrace. They eventually draw apart, gazing joyously at each other before sharing a heartfelt kiss. Nullah enthusiastically runs up and wraps his arms around both of them, embracing them tightly. Drover's face lights up with a happy grin. The army sergeant, in the meantime, sounds the horn of his truck with a smile on his face. Dutton, stopping in his tracks, stares in astonishment at Sarah, Drover, and the boys gathered together. He's taken aback by the depth of emotion in her hug. The sergeant walks determinedly up to the young priest. Fletcher, on the other hand, watches the boys grimly as they stream toward the waiting trucks. Sarah finds comfort as she rests her head on Drover's shoulder, gently caressing his cheek. Dutton turns to face them. With tearful eyes brimming with emotion, he gives a nod of acknowledgment before walking away. Fletcher strides angrily toward the truck that the boys are climbing into. Dutton is the last to board. Once the tailgate is raised, the trucks begin their departure. Fletcher runs through the devastation, closely observed from the water tower by King George. Sarah and Nullah walk together. King George watches in horror as Fletcher seizes Bull's rifle. In response, King George raises his arms in his characteristic magic-man stance while Fletcher advances threateningly with the weapon. King George's gaze remains fixed on Fletcher's every move. Meanwhile, Sarah smiles fondly as Nullah runs eagerly toward the pub. Fletcher positions himself on top of a pile of wreckage and takes aim with the rifle. Sarah spots the imminent danger, and at the pub, Drover, too, sees Fletcher. Acting swiftly, Drover runs to protect the boy. King George, using his resourcefulness, pulls a pipe off the water tower. As Fletcher grimaces, Drover falls protectively to the ground with Nullah. King George's pipe has impaled Fletcher like a spear, and King George regards him with a fierce glare. Drover gently strokes Nullah's hair. The unconscious boy's eyes flicker open, revealing a grin spreading across Nullah's face. Fletcher tries to raise the rifle to aim at King George once more. However, he winces in pain and ultimately drops the rifle from his grasp. Sarah reaches Drover and Nullah, and they embrace. Fletcher attempts to speak, but fails, collapsing over the wreckage instead. Sarah comforts Nullah with a tender cuddle. Sergeant Callahan checks Fletcher's pulse with a practiced hand. Sarah and Drover share a moment as they gaze deeply into each other's eyes, culminating in a tender and loving kiss. Callahan walks away from Fletcher's lifeless body, crossing the wrecked King Carney cattle pen. Smoke continues to hang in palls, casting a shadow over the destruction of Darwin. Meanwhile, Drover drives the car under the warm sunshine, with both Sarah and Nullah resting peacefully asleep beside him. When Sarah picks up kindling for a fire in a serene field next to a flowing river, she straightens up and stares out into the distance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As she swiftly runs down the entire length of the pier, the boat gradually and steadily draws alongside it. Both Nullah and Sarah peer intently through the lingering, thick smoke that clouds and obscures their vision. The boy, full of youthful excitement and energy, stands upright on the prow of the boat, his face breaking into a wide, cheerful grin that radiates joy. He eagerly jumps up and down with sheer joy and energy before running off the boat to the welcoming jetty. From there, he dashes eagerly up the wooden steps, his feet moving quickly, reaching the upper level of the wharf where the smoke hangs thick in the air. He sprints with determination toward Sarah. Meanwhile, Nullah points emphatically, prompting Sarah to turn slowly but surely. In the midst of the swirling smoke, stands the Drover. Their eyes meet, locking in an unspoken understanding, and they slowly walk toward each other with deliberate and purposeful steps. The Drover's initial frown conveys disbelief, which gradually melts into a warm smile as they embrace wholeheartedly. Tears stream down their faces, falling freely, as they cling to one another in a tight embrace. They eventually draw apart, gazing joyously at each other before sharing a heartfelt and meaningful kiss. Nullah enthusiastically runs up and wraps his arms around both of them, embracing them tightly and with much love. Drover's face lights up with a joyous and happy grin. The army sergeant, in the meantime, sounds the horn of his truck, a smile on his face. Dutton, stopping in his tracks, stares in astonishment and wonder at Sarah, Drover, and the boys gathered together. He's taken aback by the depth of emotion conveyed in her hug. The sergeant walks determinedly up to the young priest. Fletcher, on the other hand, watches the boys grimly as they stream toward the waiting trucks. Sarah finds comfort and solace as she rests her head on Drover's strong shoulder, gently caressing his cheek. Dutton turns to face them, his eyes brimming with emotion. With tearful eyes, he gives a nod of acknowledgment before turning to walk away. Fletcher strides angrily toward the truck that the boys are climbing into. Dutton is the very last to board. Once the tailgate is raised, the trucks begin their departure. Fletcher runs through the devastation, closely observed from the high vantage point of the water tower by King George. Sarah and Nullah walk together, side by side. King George watches in horror as Fletcher seizes Bull's rifle. In response, King George raises his arms in his commanding, characteristic magic-man stance while Fletcher advances threateningly with the weapon. King George's gaze remains fixed on Fletcher's every move. Meanwhile, Sarah smiles fondly as Nullah runs eagerly toward the pub. Fletcher positions himself on top of a pile of wreckage and takes careful aim with the rifle. Sarah spots the imminent danger, and over at the pub, Drover, too, sees Fletcher. Acting swiftly, Drover runs to protect the boy. King George, using his resourcefulness and quick thinking, pulls a pipe off the water tower. As Fletcher grimaces in frustration, Drover falls protectively to the ground with Nullah. King George's pipe has impaled Fletcher like a spear, and King George regards him with a fierce, determined glare. Drover gently strokes Nullah's hair, his touch tender. The unconscious boy's eyes flicker open slowly, revealing a grin spreading across Nullah's face. Fletcher tries to raise the rifle to aim at King George once more. However, he winces in pain and ultimately, with defeat, drops the rifle from his grasp. Sarah reaches Drover and Nullah, and they embrace warmly. Fletcher attempts to speak, but fails, collapsing over the wreckage instead. Sarah comforts Nullah with a tender cuddle. Sergeant Callahan checks Fletcher's pulse with a practiced and steady hand. Sarah and Drover share a moment as they gaze deeply into each other's eyes, culminating in a tender and loving kiss. Callahan walks away from Fletcher's lifeless body, crossing the devastated King Carney cattle pen. Smoke continues to hang in palls, casting a dark shadow over the widespread destruction of Darwin. Meanwhile, Drover drives the car under the warm, bright sunshine, with both Sarah and Nullah resting peacefully asleep beside him. As the journey continues, Sarah picks up kindling for a fire in a serene field next to a flowing river; she straightens up and quietly stares out into the distance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she rushes down the length of the pier, her feet pounding against the wooden planks, she is acutely aware of the boat gradually maneuvering closer alongside. Nullah and Sarah strain their eyes, squinting to peer through the thick, swirling smoke that obscures their view. The boy, positioned confidently on the prow of the boat, stands up and allows a wide grin to spread across his face. Bursting with excitement, he cannot contain his energy and begins to jump up and down with enthusiasm. In a swift, determined motion, he dashes off the boat and firmly plants his feet onto the jetty. Quickly, he ascends the wooden steps leading to the upper level of the wharf, his legs moving rapidly beneath him, and without hesitation, he sprints through the lingering smoke, eagerly making his way towards Sarah. As Nullah extends his arm to point, Sarah turns her head slowly, and her focus shifts. Within the hazy veil of smoke stands the Drover, a figure just becoming clear. Their eyes lock in a moment of recognition, and they begin to walk deliberately and slowly towards each other. Initially, the Drover's brows knit together in disbelief, a fleeting moment of astonishment crossing his face, but soon a smile breaks through, transforming his expression as they close the gap and embrace. They cling tightly to one another, overwhelmed with emotion, tears tracing paths down their cheeks. Reluctantly, they part, still holding onto the joy of their reunion, and they share a tender, heartfelt kiss. Nullah, unable to resist the moment, runs up and throws his arms around them both, and Drover responds with a wide, happy grin. Meanwhile, the army sergeant, with a lighthearted demeanor, sounds the horn of his truck and offers a smile. Dutton, pausing in his tracks, turns to observe Sarah, Drover, and the boys, momentarily stunned by the sight of her embrace. The sergeant, adopting a no-nonsense attitude, strides purposefully up to the young priest. As Fletcher watches grimly from a distance, the boys stream towards the waiting trucks. Sarah allows herself to relax, resting her head gently on Drover's shoulder, brushing her fingers softly against his cheek. Dutton, preparing to take his leave, offers a tearful smile, nods in acknowledgment, and begins to walk away. Meanwhile, Fletcher advances with anger in his steps towards the truck into which the boys are climbing. Dutton is the last to board, and as the tailgate is lifted and secured, the trucks rumble away. Fletcher, filled with a mix of emotions, runs through the devastation, his actions observed from the water tower by King George. Sarah, finding solace, walks alongside Nullah. King George, witnessing Fletcher's aggressive movements, watches in horror as Fletcher seizes Bull's rifle. Responding with determination and urgency, King George raises his arms, adopting his signature magic-man stance, keeping a vigilant watch as Fletcher advances. Apparently oblivious to the danger, Sarah smiles warmly as Nullah darts towards the pub. Fletcher, positioning himself atop a pile of wreckage, aims the rifle with intent. At the pub, Sarah notices the impending threat just as Drover catches sight of Fletcher. Without hesitation, Drover propels himself forward, racing to reach the boy. In a defensive maneuver, King George swiftly detaches a pipe from the water tower. In a tense and pivotal moment, Fletcher grimaces while Drover collapses to the ground alongside Nullah. King George's pipe has struck Fletcher with the force of a spear, pinning him down. With intense resolve, King George fixes his glare upon him. Drover reassures the unconscious boy, gently stroking his hair. The boy's eyes flutter, signs of life returning, and Nullah responds with a joyful grin. Desperately, Fletcher attempts to aim the rifle at King George, but his strength wanes, causing him to wince and relinquish his grip on the weapon, which clatters to the ground. Arriving at the scene, Sarah reaches Drover and Nullah, enveloping Nullah in her comforting arms. Fletcher struggles to form words, his energy fading, before he collapses over a piece of wreckage, motionless. As Sarah holds Nullah protectively, Sergeant Callahan approaches to check Fletcher’s pulse, confirming his fate. Seizing the moment of tranquility and intimacy, Sarah and Drover lock eyes, leaning in for a tender kiss, savoring their shared affection. Callahan, having completed his duty, walks away from Fletcher's lifeless body, making his way across the debris of the ruined King Carney cattle pen. Smoke continues to drift in thick, oppressive clouds over the devastation left in Darwin. Amidst this backdrop of destruction, Drover drives the car under the welcoming sun, where Sarah and Nullah, both exhausted, rest peacefully asleep beside him, the rhythm of the road soothing. Later, Sarah busies herself by picking up pieces of kindling for a fire in a serene field located next to a gently flowing river. She pauses in her task, straightens up, and allows her gaze to wander, lost in thought."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She rushes down the pier as the boat arrives, catching sight of Nullah and Sarah through the smoke. The boy leaps with excitement and dashes onto the jetty, running up the steps to reach Sarah. As Nullah points, she turns to see the Drover standing in the haze; their eyes meet, and they slowly approach each other. Sharing a moment of disbelief, they smile, embrace, and tearfully kiss while Nullah joins in to hug them both. The army sergeant sounds his truck's horn, smiling, as Dutton observes the reunion with mixed emotions. Fletcher watches the boys head to the trucks while Sarah lovingly rests against Drover. Dutton smiles through tears, nods, and departs as Fletcher moves toward the trucks. The tailgate closes, and the convoy departs, leaving Fletcher angry and King George looking on. Fletcher seizes Bull's rifle as Sarah and Nullah approach the pub. Fletcher aims from the wreckage, but Drover and King George act swiftly, resulting in Fletcher's downfall while Nullah regains consciousness. As Fletcher collapses, Sarah and Drover share a tender moment with Nullah. Sergeant Callahan checks Fletcher's lifeless body, while Sarah and Drover embrace tenderly. Smoke lingers over Darwin's devastation as Drover drives with Sarah and Nullah asleep beside him. In a tranquil field by the river, Sarah gathers kindling, then pauses to gaze ahead."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She runs down the pier, a structure jutting into the ocean often used for docking boats, as the boat draws alongside. Nullah and Sarah peer through the smoke lingering from a recent harbor fire. The boy stands up on the prow of the boat, a part located at the front, and grins. He jumps up and down excitedly and runs off the boat onto the jetty, which serves as a landing place for boats. He runs up the wooden steps to the upper level of the wharf, where goods are typically unloaded, and sprints through the smoke towards Sarah. Nullah points and she turns slowly. There in the smoke stands the Drover, known locally as a skilled cattle driver who often traverses the harsh outback. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief, then smiles and they embrace. They cling to each other, tears running down their cheeks, glad to be reunited amidst the chaos. They break apart and look joyfully at one another, then kiss. Nullah runs up and hugs them both, his laughter echoing over the remnants of destruction. Drover grins happily. The army sergeant, part of a unit involved in the recent efforts to protect the town, sounds the horn of his truck and smiles. Dutton stops and stares at Sarah, Drover, and the boys, overwhelmed by the scene of familial affection. He's taken aback by her hug, a gesture of solidarity and comfort. The sergeant stomps up to the young priest, who is there to offer solace in these trying times. Fletcher grimly watches the boys, streaming towards the trucks, as they are evacuated from the dangerous area. Sarah rests her head on Drover's shoulder and caresses his cheek, savoring the relief of safety. Dutton turns to them. Dutton smiles tearfully, sharing in their moment of peace amid turmoil. He nods and walks away, knowing they will find strength together. Fletcher strides angrily towards the truck the boys are getting into, fueled by unresolved rage. Dutton's the last on, ensuring all are accounted for. The tailgate is raised and the trucks head off towards a safer zone. Fletcher runs through the devastation, watched from the water tower, a vantage point for overseeing the area, by King George, a tribal elder with deep spiritual insights. Sarah's walking with Nullah, hand in hand through the remnants of their ravaged surroundings. King George looks in horror as Fletcher grabs Bull's rifle, a weapon left behind after the conflict. King George raises his arms in his magic-man stance, channeling his ancestral powers, as Fletcher advances with the rifle. King George watches Fletcher closely, knowing the gravity of the impending confrontation. Sarah smiles as Nullah runs towards the pub, a central community gathering spot. Fletcher stands on top of a pile of wreckage and aims the rifle, his mind clouded by vengeance. Sarah spots the danger and, at the pub, Drover sees Fletcher, sensing the threat and ready to protect the boy. Drover runs for the boy, determined to save him. King George pulls a pipe off the water tower, using it as an improvised weapon. Fletcher grimaces and Drover falls to the ground with Nullah, shielding him. King George's pipe has run Fletcher through like a spear, stopping further violence. King George glares at him, asserting his authority over the chaos. Drover strokes his hair, reassuring the scared boy. The unconscious boy's eyes flicker, slowly coming back to reality. Nullah grins, feeling safe at last. Fletcher tries to aim the rifle at King George, but his body betrays him. Fletcher winces and drops the rifle, realizing he is overpowered. Sarah reaches Drover and Nullah, her relief palpable. Fletcher tries to speak and then collapses over a piece of wreckage, his final acts thwarted. Sarah cuddles Nullah, vowing to protect him. Sergeant Callahan checks Fletcher's pulse, confirming the end of his threat. Sarah and Drover gaze into each other's eyes, finding solace in their shared love. They kiss, tenderly, reaffirming their bond. Callahan walks away from Fletcher's body, across the wrecked King Carney cattle pen, which once housed prized livestock. Smoke hangs in palls over the destruction of Darwin, reflecting the aftermath of a wartime bombing. Drover drives the car in the sunshine, with Sarah and Nullah asleep next to him, heading towards a hopeful future. Sarah picks up kindling for a fire in a field next to a river, which promises a new beginning. She straightens and stares, contemplating the challenges and joys that lie ahead."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nullah and Sarah peer through the smoke She runs down the pier as the boat draws alongside Nullah and Sarah peer through the smoke The boy stands up on the prow of the boat and grins He jumps up and down excitedly and runs off the boat onto the jetty Fletcher stands on top of a pile of wreckage and aims the rifle He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah Nullah points and she turns slowly There in the smoke stands the Drover Their eyes meet and they walk slowly towards one another Sarah smiles as Nullah runs towards the pub Drover frowns in disbelief then smiles and they embrace He is taken aback by her hug Sarah's walking with Nullah Drover drives the car in the sunshine with Sarah and Nullah asleep next to him They cling to each other tears running down their cheeks Fletcher runs through the devastation watched from the water tower by King George They break apart and look joyfully at one another then kiss Fletcher grimaces and Drover falls to the ground with Nullah Nullah runs up and hugs them both Drover grins happily The army sergeant sounds the horn of his truck and smiles Dutton stops and stares at Sarah Drover and the boys He is taken aback by her hug The sergeant stomps up to the young priest Fletcher tries to aim the rifle at King George Fletcher grimly watches the boys streaming towards the trucks Sarah rests her head on Drover's shoulder and caresses his cheek Dutton turns to them Dutton smiles tearfully He nods and walks away Fletcher strides angrily towards the truck the boys are getting into Drover sees Fletcher Dutton's the last on The tailgate is raised and the trucks head off Sarah and Drover gaze into each other's eyes Sergeant Callahan checks Fletcher's pulse Fletcher runs through the devastation watched from the water tower by King George Sarah's walking with Nullah King George looks in horror as Fletcher grabs Bull's rifle King George raises his arms in his magicman stance as Fletcher advances with the rifle King George watches Fletcher closely Sarah smiles as Nullah runs towards the pub Fletcher stands on top of a pile of wreckage and aims the rifle There in the smoke stands the Drover Sarah spots the danger and at the pub Drover sees Fletcher Drover runs for the boy The army sergeant sounds the horn of his truck and smiles King George pulls a pipe off the water tower King George pulls a pipe off the water tower Sarah reaches Drover and Nullah Fletcher grimaces and Drover falls to the ground with Nullah Nullah points and she turns slowly King George's pipe has run Fletcher through like a spear King George glares at him The boy stands up on the prow of the boat and grins Drover strokes his hair Smoke hangs in palls over the destruction of Darwin The unconscious boy's eyes flicker Dutton stops and stares at Sarah Drover and the boys King George glares at him Nullah grins Fletcher tries to aim the rifle at King George Fletcher winces and drops the rifle Sarah reaches Drover and Nullah Fletcher tries to speak and then collapses over a piece of wreckage Sarah cuddles Nullah Sarah cuddles Nullah Sergeant Callahan checks Fletcher's pulse Sarah rests her head on Drover's shoulder and caresses his cheek Fletcher grimly watches the boys streaming towards the trucks Drover grins happily Drover frowns in disbelief then smiles and they embrace Sarah and Drover gaze into each other's eyes They kiss tenderly Drover strokes his hair Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen Smoke hangs in palls over the destruction of Darwin Drover drives the car in the sunshine with Sarah and Nullah asleep next to him Their eyes meet and they walk slowly towards one another Sarah picks up kindling for a fire in a field next to a river She straightens and stares"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She runs down the pier as the boat draws alongside. Nullah and Sarah peer through the smoke. The boy stands up on the prow of the boat and grins. He jumps up and down excitedly and runs off the boat onto the jetty. He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah. Nullah points and she turns slowly. There in the smoke stands the Drover. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief then smiles and they embrace. They cling to each other tears running down their cheeks. They break apart and look joyfully at one another then kiss. Nullah runs up and hugs them both. Drover grins happily. The army sergeant sounds the horn of his truck and smiles. Dutton stops and stares at Sarah Drover and the boys. He is taken aback by her hug. The sergeant stomps up to the young priest. Fletcher grimly watches the boys streaming towards the trucks. Sarah rests her head on Drover's shoulder and caresses his cheek. Dutton turns to them. Dutton smiles tearfully. He nods and walks away. Fletcher strides angrily towards the truck. the boys are getting into. Dutton's the last on. The tailgate is raised and the trucks head off. Fletcher runs through the devastation watched from the water tower by King George. Sarah's walking with Nullah. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. King George looks in horror as Fletcher grabs Bull's rifle. King George raises his arms in his magicman stance as Fletcher advances with the rifle. King George watches Fletcher closely. Sarah smiles as Nullah runs towards the pub. Fletcher stands on top of a pile of wreckage and aims the rifle. Sarah spots the danger and at the pub. Drover sees Fletcher. Drover runs for the boy. King George pulls a pipe off the water tower. Fletcher grimaces and Drover falls to the ground with Nullah. King George's pipe has run Fletcher through like a spear. King George glares at him. Drover strokes his hair. The unconscious boy's eyes flicker. Nullah grins. Fletcher tries to aim the rifle at King George. Fletcher winces and drops the rifle. Sarah reaches Drover and Nullah. Fletcher tries to speak and then collapses over a piece of wreckage. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss tenderly. Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen. Smoke hangs in palls over the destruction of Darwin. Drover drives the car in the sunshine with Sarah and Nullah asleep next to him. Sarah picks up kindling for a fire in a field next to a river. She straightens and stares."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She runs down the pier as the boat draws alongside. Nullah and Sarah peer through the smoke. The boy stands up on the prow of the boat and grins. He jumps up and down excitedly and runs off the boat onto the jetty. He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah. Nullah points and she turns slowly. There in the smoke stands the Drover. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief then smiles and they embrace. They cling to each other tears running down their cheeks. They break apart and look joyfully at one another then kiss. Nullah runs up and hugs them both. Drover grins happily. The army sergeant sounds the horn of his truck and smiles. Dutton stops and stares at Sarah Drover and the boys. He is taken aback by her hug. The sergeant stomps up to the young priest. Fletcher grimly watches the boys streaming towards the trucks. Sarah rests her head on Drover's shoulder and caresses his cheek. Dutton turns to them. Dutton smiles tearfully. He nods and walks away. Fletcher strides angrily towards the truck. the boys are getting into. Dutton's the last on. The tailgate is raised and the trucks head off. Fletcher runs through the devastation watched from the water tower by King George. Sarah's walking with Nullah. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. King George looks in horror as Fletcher grabs Bull's rifle. King George raises his arms in his magicman stance as Fletcher advances with the rifle. King George watches Fletcher closely. Sarah smiles as Nullah runs towards the pub. Fletcher stands on top of a pile of wreckage and aims the rifle. Sarah spots the danger and at the pub. Drover sees Fletcher. Drover runs for the boy. King George pulls a pipe off the water tower. Fletcher grimaces and Drover falls to the ground with Nullah. King George's pipe has run Fletcher through like a spear. King George glares at him. Drover strokes his hair. The unconscious boy's eyes flicker. Nullah grins. Fletcher tries to aim the rifle at King George. Fletcher winces and drops the rifle. Sarah reaches Drover and Nullah. Fletcher tries to speak and then collapses over a piece of wreckage. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss tenderly. Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen. Smoke hangs in palls over the destruction of Darwin. Drover drives the car in the sunshine with Sarah and Nullah asleep next to him. Sarah picks up kindling for a fire in a field next to a river. She straightens and stares."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She runs down the pier as the boat draws alongside. Nullah and Sarah peer through the smoke. The boy stands up on the prow of the boat and grins. He jumps up and down excitedly and runs off the boat onto the jetty. He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah. Nullah points and she turns slowly. There in the smoke stands the Drover. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief then smiles and they embrace. They cling to each other tears running down their cheeks. They break apart and look joyfully at one another then kiss. Nullah runs up and hugs them both. Drover grins happily. The army sergeant sounds the horn of his truck and smiles. Nullah grins. Fletcher tries to aim the rifle at King George. Fletcher winces and drops the rifle. Sarah reaches Drover and Nullah. Fletcher tries to speak and then collapses over a piece of wreckage. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss tenderly. Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen. Smoke hangs in palls over the destruction of Darwin. Drover drives the car in the sunshine with Sarah and Nullah asleep next to him. Sarah picks up kindling for a fire in a field next to a river. She straightens and stares."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She runs down the pier as the boat draws alongside. Nullah and Sarah peer through the smoke. The boy stands up on the prow of the boat and grins. He jumps up and down excitedly and runs off the boat onto the jetty. He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah. Nullah points and she turns slowly. They kiss tenderly. Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen. Smoke hangs in palls over the destruction of Darwin. Drover drives the car in the sunshine with Sarah and Nullah asleep next to him. Sarah picks up kindling for a fire in a field next to a river. She straightens and stares."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She runs down the pier as the seagull draws alongside. The cat and the goldfish peer through the smoke. The turtle stands up on the prow of the boat and grins. The turtle jumps up and down excitedly and runs off the boat onto the jetty. The turtle runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards the goldfish. The cat points and the kangaroo turns slowly. There in the smoke stands the penguin. Their eyes meet and they walk slowly towards one another. The penguin frowns in disbelief, then smiles and they embrace. They cling to each other, tears running down their cheeks. They break apart and look joyfully at one another, then kiss. The cat runs up and hugs them both. The penguin grins happily. The librarian sounds the horn of his truck and smiles. The wizard stops and stares at the goldfish, the penguin, and the turtles. He's taken aback by the kangaroo's hug. The librarian stomps up to the elephant. The owl grimly watches the turtles, streaming towards the trucks. The goldfish rests her head on the penguin's shoulder and caresses his cheek. The wizard turns to them. The wizard smiles tearfully. The wizard nods and walks away. The owl strides angrily towards the truck the turtles are getting into. The wizard's the last on. The tailgate is raised and the trucks head off. The owl runs through the devastation, watched from the water tower by the koala. The kangaroo's walking with the cat. The koala looks in horror as the owl grabs the donkey's rifle. The koala raises his arms in his magic-man stance as the owl advances with the rifle. The koala watches the owl closely. The kangaroo smiles as the cat runs towards the pub. The owl stands on top of a pile of wreckage and aims the rifle. The kangaroo spots the danger and, at the pub, the penguin sees the owl. The penguin runs for the turtle. The koala pulls a pipe off the water tower. The owl grimaces and the penguin falls to the ground with the cat. The koala's pipe has run the owl through like a spear. The koala glares at him. The penguin strokes his hair. The unconscious turtle's eyes flicker. The cat grins. The owl tries to aim the rifle at the koala. The owl winces and drops the rifle. The kangaroo reaches the penguin and the cat. The owl tries to speak and then collapses over a piece of wreckage. The kangaroo cuddles the cat. Officer Whiskers checks the owl's pulse. The kangaroo and the penguin gaze into each other's eyes. They kiss, tenderly. Officer Whiskers walks away from the owl's body, across the wrecked Queen Carney cattle pen. Smoke hangs in palls over the destruction of Atlantis. The penguin drives the car in the sunshine, with the kangaroo and the cat asleep next to him. The kangaroo picks up kindling for a fire in a field next to a river. The kangaroo straightens and stares."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She runs down the runway as the airplane draws alongside. Nullah and Sarah peer through the fog. The boy stands up on the nose of the airplane and grins. He jumps up and down excitedly and runs off the airplane onto the tarmac. He runs up the metal steps to the upper level of the terminal and sprints through the fog towards Sarah. Nullah points and she turns slowly. There in the fog stands the Drover. Their eyes meet and they walk slowly towards one another. Drover frowns in disbelief, then smiles and they embrace. They cling to each other, tears running down their cheeks. They break apart and look joyfully at one another, then kiss. Nullah runs up and hugs them both. Drover grins happily. The army sergeant sounds the horn of his jeep and smiles. Dutton stops and stares at Sarah, Drover, and the boys. He's taken aback by her hug. The sergeant stomps up to the young minister. Fletcher grimly watches the boys, streaming towards the jeeps. Sarah rests her head on Drover's shoulder and caresses his cheek. Dutton turns to them. Dutton smiles tearfully. He nods and walks away. Fletcher strides angrily towards the jeep the boys are getting into. Dutton's the last on. The tailgate is raised and the jeeps head off. Fletcher runs through the desolation, watched from the lighthouse by King George. Sarah's walking with Nullah. King George looks in horror as Fletcher grabs Eagle's spear. King George raises his arms in his magic-man stance as Fletcher advances with the spear. King George watches Fletcher closely. Sarah smiles as Nullah runs towards the tavern. Fletcher stands on top of a pile of rubble and aims the spear. Sarah spots the danger and, at the tavern, Drover sees Fletcher. Drover runs for the boy. King George pulls a rope off the lighthouse. Fletcher grimaces and Drover falls to the ground with Nullah. King George's rope has run Fletcher through like an arrow. King George glares at him. Drover strokes his hair. The unconscious boy's eyes flicker. Nullah grins. Fletcher tries to aim the spear at King George. Fletcher winces and drops the spear. Sarah reaches Drover and Nullah. Fletcher tries to speak and then collapses over a piece of rubble. Sarah cuddles Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They kiss, tenderly. Callahan walks away from Fletcher's body, across the wrecked King Carney sheep pen. Mist hangs in palls over the devastation of Darwin. Drover drives the wagon in the sunshine, with Sarah and Nullah asleep next to him. Sarah picks up rocks for a fire in a meadow next to a pond. She straightens and stares."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She skips down the pier as the boat parks alongside. Nullah and Sarah glance through the smoke. The boy kneels down on the prow of the boat and chuckles. He claps his hands excitedly and skips off the boat onto the jetty. He strolls up the wooden steps to the upper level of the wharf and jogs through the smoke towards Sarah. Nullah gestures and she spins slowly. There in the smoke stands the Drover. Their eyes connect and they drift slowly towards one another. Drover tilts his head in disbelief, then beams and they high-five. They grasp each other, tears dripping down their cheeks. They separate and gaze joyfully at one another, then hug. Nullah skips up and pats them both. Drover laughs happily. The army sergeant honks the horn of his truck and waves. Dutton pauses and glances at Sarah, Drover, and the boys. He's startled by her handshake. The sergeant strides up to the young priest. Fletcher solemnly observes the boys, meandering towards the trucks. Sarah leans her head on Drover's shoulder and brushes his cheek. Dutton turns to them. Dutton laughs tearfully. He nods and ambles away. Fletcher marches angrily towards the truck the boys are climbing into. Dutton's the last on. The tailgate is closed and the trucks roll off. Fletcher strolls through the devastation, observed from the water tower by King George. Sarah's wandering with Nullah. King George observes in horror as Fletcher grips Bull's rifle. King George lifts his arms in his magic-man stance as Fletcher proceeds with the rifle. King George scrutinizes Fletcher closely. Sarah giggles as Nullah skips towards the pub. Fletcher perches on top of a pile of wreckage and points the rifle. Sarah notices the danger and, at the pub, Drover spots Fletcher. Drover dashes for the boy. King George pulls a hose off the water tower. Fletcher grimaces and Drover falls to the ground with Nullah. King George's hose has brushed Fletcher through like a spear. King George stares at him. Drover pats his hair. The unconscious boy's eyes blink. Nullah beams. Fletcher attempts to point the rifle at King George. Fletcher grimaces and drops the rifle. Sarah reaches Drover and Nullah. Fletcher attempts to whisper and then slumps over a piece of wreckage. Sarah holds Nullah. Sergeant Callahan checks Fletcher's pulse. Sarah and Drover gaze into each other's eyes. They hug, tenderly. Callahan strides away from Fletcher's body, across the wrecked King Carney cattle pen. Smoke lingers in palls over the destruction of Darwin. Drover maneuvers the car in the sunshine, with Sarah and Nullah asleep next to him. Sarah gathers kindling for a campfire in a field next to a river. She stretches and peers."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She sprints down the escalator as the airplane draws alongside. The mural and the fern peer through the mist. The kite stands up on the tip of the airplane and grins. It bounces up and down excitedly and runs off the airplane onto the raft. It runs up the marble columns to the upper level of the veranda and dashes through the mist towards the fern. The mural gestures and it turns slowly. There in the mist stands the hammer. Their glances meet and they walk slowly towards one another. The hammer frowns in disbelief, then smiles and they embrace. They cling to each other, raindrops running down their elbows. They break apart and look joyfully at one another, then kiss. The mural runs up and hugs them both. The hammer grins happily. The baker sounds the horn of his bicycle and smiles. The fountain stops and stares at the fern, the hammer, and the kites. It's taken aback by its hug. The baker stomps up to the young painter. The anvil grimly watches the kites, streaming towards the bicycles. The fern rests its head on the hammer's shoulder and caresses its elbow. The fountain turns to them. The fountain smiles tearfully. It nods and walks away. The anvil strides angrily towards the bicycle the kites are getting into. The fountain's the last on. The tailgate is raised and the bicycles head off. The anvil runs through the devastation, watched from the treehouse by the parrot. The fern's walking with the mural. The parrot looks in horror as the anvil grabs the camel's shovel. The parrot raises its feathers in its magic-bird stance as the anvil advances with the shovel. The parrot watches the anvil closely. The fern smiles as the mural runs towards the cafe. The anvil stands on top of a pile of debris and aims the shovel. The fern spots the danger and, at the cafe, the hammer sees the anvil. The hammer runs for the kite. The parrot pulls a branch off the treehouse. The anvil grimaces and the hammer falls to the ground with the mural. The parrot's branch has run the anvil through like a spear. The parrot glares at it. The hammer strokes its feathers. The unconscious kite's eyes flicker. The mural grins. The anvil tries to aim the shovel at the parrot. The anvil winces and drops the shovel. The fern reaches the hammer and the mural. The anvil tries to speak and then collapses over a piece of debris. The fern cuddles the mural. Baker Coral checks the anvil's pulse. The fern and the hammer gaze into each other's eyes. They kiss, tenderly. Coral walks away from the anvil's body, across the ruined King Mango orchard. Mist hangs in palls over the destruction of Darwin. The hammer drives the scooter in the sunshine, with the fern and the mural asleep next to it. The fern picks up twigs for a fire in a garden next to a pond. It straightens and stares."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She strolls down the runway as the airplane floats nearby. Roger and Nancy gaze through the mist. The girl rises on the edge of the plane and beams. She skips up and down joyfully and strolls off the plane onto the dock. She dances up the metal stairs to the top deck of the jetty and marches through the fog towards Nancy. Roger gestures and she spins slowly. There in the mist stands the Engineer. Their gazes lock and they glide slowly towards each other. Engineer scowls in disbelief, then laughs and they cuddle. They hold each other, rain streaming down their faces. They separate and glance happily at one another, then hug. Roger skips up and joins them both in an embrace. Engineer beams contentedly. The navy lieutenant blows the whistle of his jeep and waves. Morgan halts and gazes at Nancy, Engineer, and the children. He's surprised by her embrace. The lieutenant strides up to the elder monk. Thomas grimly observes the children, drifting towards the jeeps. Nancy leans her head on Engineer's chest and touches his arm. Morgan turns to them. Morgan grins tearfully. He shakes his head and ambles away. Thomas marches angrily towards the jeep the children are climbing into. Morgan's the last aboard. The ramp is lowered and the jeeps drive off. Thomas dashes through the chaos, observed from the lighthouse by Captain Bruce. Nancy's wandering with Roger. Captain Bruce watches in shock as Thomas seizes Harry's shotgun. Captain Bruce lifts his arms in his shaman pose as Thomas approaches with the shotgun. Captain Bruce observes Thomas intently. Nancy laughs as Roger sprints towards the inn. Thomas stands atop a mound of debris and points the shotgun. Nancy notices the threat and, at the inn, Engineer spots Thomas. Engineer dashes for the girl. Captain Bruce pulls a rod off the lighthouse. Thomas frowns and Engineer drops to the floor with Roger. Captain Bruce's rod has struck Thomas through like a javelin. Captain Bruce stares at him. Engineer pats his hand. The waking girl's eyes flutter. Roger laughs. Thomas attempts to target Captain Bruce. Thomas groans and releases the shotgun. Nancy arrives at Engineer and Roger. Thomas attempts to talk and then slumps over a chunk of debris. Nancy hugs Roger. Lieutenant Carter checks Thomas's heartbeat. Nancy and Engineer look deeply into each other's eyes. They embrace, gently. Carter strides away from Thomas's body, through the ravaged King Carney ranch. Mist lingers in curtains over the ruins of Darwin. Engineer steers the bicycle in the sunlight, with Nancy and Roger sleeping beside him. Nancy collects firewood for a flame in a grove next to a stream. She bends and watches."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She strolls down the runway as the train glides alongside. Nullah and Sarah gaze through the haze. The boy kneels on the edge of the train and smirks. He leaps upwards eagerly and skips off the train onto the dock. He skips up the stone staircase to the upper deck of the warehouse and jogs through the haze towards Sarah. Nullah gestures and she pivots gently. There in the haze stands the Drover. Their eyes connect and they shuffle slowly toward one another. Drover squints in astonishment, then chuckles and they clasp. They hold each other, raindrops slipping down their cheeks. They part and gaze blissfully at one another, then peck. Nullah skips up and envelops them both. Drover beams cheerfully. The army sergeant blares the siren of his van and grins. Dutton halts and gazes at Sarah, Drover, and the youths. He's startled by her peck. The sergeant marches up to the young monk. Fletcher solemnly observes the youths, streaming towards the vans. Sarah rests her head on Drover's shoulder and pats his cheek. Dutton swivels to them. Dutton grins tearfully. He bobs his head and struts away. Fletcher strides furiously towards the van the youths are climbing into. Dutton's the last onboard. The ramp is lifted and the vans cruise away. Fletcher dashes through the desolation, observed from the lighthouse by King George. Sarah's strolling with Nullah. King George watches in terror as Fletcher snatches Bull's lantern. King George raises his arms in his ritual-man pose as Fletcher progresses with the lantern. King George observes Fletcher intently. Sarah beams as Nullah skips towards the tavern. Fletcher stands on top of a mound of rubbish and aims the lantern. Sarah notices the threat and, at the tavern, Drover spots Fletcher. Drover rushes for the youth. King George pulls a rod off the lighthouse. Fletcher grimaces and Drover tumbles to the ground with Nullah. King George's rod has run Fletcher through like a lance. King George scowls at him. Drover pats his hair. The unconscious youth's eyes flutter. Nullah beams. Fletcher attempts to point the lantern at King George. Fletcher winces and releases the lantern. Sarah arrives at Drover and Nullah. Fletcher attempts to utter words and then crumples over a piece of rubbish. Sarah snuggles Nullah. Sergeant Callahan checks Fletcher's heartbeat. Sarah and Drover gaze into each other's eyes. They peck, softly. Callahan saunters away from Fletcher's body, across the ruined King Carney storage yard. Haze suspends in drapes over the wreckage of Darwin. Drover maneuvers the bicycle in the daylight, with Sarah and Nullah dozing next to him. Sarah gathers pebbles for a garden in a meadow next to a creek. She stands straight and gazes."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit skips along the trail as the submarine glides beneath. Luna and Oliver gaze through the fog. The cat rises on the edge of the submarine and smirks. It bounces up and down eagerly and skips off the submarine onto the dock. It dashes up the stone stairs to the top floor of the depot and zooms through the fog towards Oliver. Luna gestures and the turtle rotates slowly. There in the fog stands the Pilot. Their glances connect and they shuffle slowly towards each other. Pilot gawks in amazement, then beams and they cuddle. They clutch each other, raindrops trickling down their faces. They separate and gaze cheerfully at each other, then peck. Luna skips up and squeezes them both. Pilot beams joyously. The navy carpenter rings the bell of his motorcycle and beams. Sutton halts and gazes at Oliver, Pilot, and the kittens. He's astonished by her squeeze. The carpenter marches up to the old monk. Dexter solemnly observes the kittens, drifting towards the motorcycles. Oliver leans her brow on Pilot's chest and brushes his mane. Sutton pivots to them. Sutton grins mournfully. He bows and strides away. Dexter marches furiously towards the motorcycle the kittens are climbing into. Sutton's the last aboard. The cover is lifted and the motorcycles speed off. Dexter dashes through the chaos, observed from the windmill by Chief Albert. Oliver's strolling with Luna. Chief Albert watches in shock as Dexter seizes Bull's slingshot. Chief Albert lifts his hands in his wizard-man pose as Dexter advances with the slingshot. Chief Albert watches Dexter intently. Oliver beams as Luna sprints towards the inn. Dexter stands on top of a stack of debris and aims the slingshot. Oliver notices the peril and, at the inn, Pilot sees Dexter. Pilot dashes for the cat. Chief Albert yanks a rope off the windmill. Dexter winces and Pilot tumbles to the earth with Luna. Chief Albert's rope has struck Dexter down like an arrow. Chief Albert glowers at him. Pilot pats his paw. The unconscious cat's eyelids flutter. Luna smirks. Dexter attempts to aim the slingshot at Chief Albert. Dexter grimaces and drops the slingshot. Oliver reaches Pilot and Luna. Dexter tries to whisper and then crumbles over a chunk of debris. Oliver snuggles Luna. Artisan Marvin examines Dexter's wrist. Oliver and Pilot gaze into each other's souls. They peck, gently. Marvin ambles away from Dexter's figure, across the ruined King Charles pigsty. Fog lingers in shrouds over the ruins of Sydney. Pilot steers the train in the daylight, with Oliver and Luna dozing beside him. Oliver gathers branches for a bonfire in a meadow next to a stream. She stands upright and gawks."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As the boat arrives, Nullah and Sarah spot the Drover through the smoke. Nullah excitedly runs to Sarah, who turns to see Drover. They share a tearful embrace and kiss, joined by Nullah in a group hug. Dutton observes, moved, while Fletcher angrily watches the departing boys. Chaos ensues as Fletcher grabs a rifle, aiming at Nullah. King George intervenes, and Fletcher is incapacitated. Drover and Sarah protect Nullah, and Fletcher collapses. Callahan confirms Fletcher's death. Sarah and Drover share a tender moment, and the trio drives away, leaving the devastation behind. Sarah collects kindling near a river, pausing to reflect."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She straightens and stares Sarah picks up kindling for a fire in a field next to a river Drover drives the car in the sunshine with Sarah and Nullah asleep next to him Smoke hangs in palls over the destruction of Darwin Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen They kiss tenderly Sarah and Drover gaze into each other's eyes Sergeant Callahan checks Fletcher's pulse Sarah cuddles Nullah Fletcher tries to speak and then collapses over a piece of wreckage Sarah reaches Drover and Nullah Fletcher winces and drops the rifle Fletcher tries to aim the rifle at King George Nullah grins The unconscious boy's eyes flicker Drover strokes his hair King George glares at him King George's pipe has run Fletcher through like a spear Fletcher grimaces and Drover falls to the ground with Nullah King George pulls a pipe off the water tower Drover runs for the boy Drover sees Fletcher Sarah spots the danger and at the pub Fletcher stands on top of a pile of wreckage and aims the rifle Sarah smiles as Nullah runs towards the pub King George watches Fletcher closely King George raises his arms in his magicman stance as Fletcher advances with the rifle King George looks in horror as Fletcher grabs Bull's rifle Sarah's walking with Nullah Fletcher runs through the devastation watched from the water tower by King George The tailgate is raised and the trucks head off Dutton's the last on the boys are getting into Fletcher strides angrily towards the truck He nods and walks away Dutton smiles tearfully Dutton turns to them Sarah rests her head on Drover's shoulder and caresses his cheek Fletcher grimly watches the boys streaming towards the trucks The sergeant stomps up to the young priest He is taken aback by her hug Dutton stops and stares at Sarah Drover and the boys The army sergeant sounds the horn of his truck and smiles Drover grins happily Nullah runs up and hugs them both They break apart and look joyfully at one another then kiss They cling to each other tears running down their cheeks Drover frowns in disbelief then smiles and they embrace Their eyes meet and they walk slowly towards one another There in the smoke stands the Drover Nullah points and she turns slowly He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah He jumps up and down excitedly and runs off the boat onto the jetty The boy stands up on the prow of the boat and grins Nullah and Sarah peer through the smoke She runs down the pier as the boat draws alongside"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "King George watches Fletcher closely the boys are getting into They kiss tenderly Nullah runs up and hugs them both The sergeant stomps up to the young priest Dutton smiles tearfully Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen Sarah picks up kindling for a fire in a field next to a river Drover runs for the boy Dutton turns to them They cling to each other tears running down their cheeks Sarah spots the danger and at the pub The unconscious boy's eyes flicker Fletcher winces and drops the rifle King George raises his arms in his magicman stance as Fletcher advances with the rifle She straightens and stares He jumps up and down excitedly and runs off the boat onto the jetty He nods and walks away Fletcher tries to speak and then collapses over a piece of wreckage He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah King George looks in horror as Fletcher grabs Bull's rifle They break apart and look joyfully at one another then kiss Nullah grins Fletcher strides angrily towards the truck King George's pipe has run Fletcher through like a spear Dutton's the last on She runs down the pier as the boat draws alongside The tailgate is raised and the trucks head off Sergeant Callahan checks Fletcher's pulse Sarah rests her head on Drover's shoulder and caresses his cheek Sarah smiles as Nullah runs towards the pub King George pulls a pipe off the water tower Fletcher runs through the devastation watched from the water tower by King George Drover grins happily King George glares at him Fletcher stands on top of a pile of wreckage and aims the rifle Sarah and Drover gaze into each other's eyes The army sergeant sounds the horn of his truck and smiles Sarah reaches Drover and Nullah Drover drives the car in the sunshine with Sarah and Nullah asleep next to him The boy stands up on the prow of the boat and grins Sarah's walking with Nullah Fletcher grimaces and Drover falls to the ground with Nullah Nullah points and she turns slowly Drover sees Fletcher Fletcher tries to aim the rifle at King George There in the smoke stands the Drover Smoke hangs in palls over the destruction of Darwin Drover frowns in disbelief then smiles and they embrace Dutton stops and stares at Sarah Drover and the boys He is taken aback by her hug Fletcher grimly watches the boys streaming towards the trucks Sarah cuddles Nullah Nullah and Sarah peer through the smoke Their eyes meet and they walk slowly towards one another Drover strokes his hair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "King George looks in horror as Fletcher grabs Bull's rifle King George raises his arms in his magicman stance as Fletcher advances with the rifle King George watches Fletcher closely Sarah smiles as Nullah runs towards the pub Fletcher stands on top of a pile of wreckage and aims the rifle Sarah spots the danger and at the pub Drover sees Fletcher Drover runs for the boy King George pulls a pipe off the water tower Fletcher grimaces and Drover falls to the ground with Nullah King George's pipe has run Fletcher through like a spear King George glares at him Drover strokes his hair The unconscious boy's eyes flicker Nullah grins Fletcher tries to aim the rifle at King George Fletcher winces and drops the rifle Sarah reaches Drover and Nullah Fletcher tries to speak and then collapses over a piece of wreckage Sarah cuddles Nullah Sergeant Callahan checks Fletcher's pulse Sarah and Drover gaze into each other's eyes They kiss tenderly Callahan walks away from Fletcher's body across the wrecked King Carney cattle pen Smoke hangs in palls over the destruction of Darwin Drover drives the car in the sunshine with Sarah and Nullah asleep next to him Sarah picks up kindling for a fire in a field next to a river She straightens and stares She runs down the pier as the boat draws alongside Nullah and Sarah peer through the smoke The boy stands up on the prow of the boat and grins He jumps up and down excitedly and runs off the boat onto the jetty He runs up the wooden steps to the upper level of the wharf and sprints through the smoke towards Sarah Nullah points and she turns slowly There in the smoke stands the Drover Their eyes meet and they walk slowly towards one another Drover frowns in disbelief then smiles and they embrace They cling to each other tears running down their cheeks They break apart and look joyfully at one another then kiss Nullah runs up and hugs them both Drover grins happily The army sergeant sounds the horn of his truck and smiles Dutton stops and stares at Sarah Drover and the boys He is taken aback by her hug The sergeant stomps up to the young priest Fletcher grimly watches the boys streaming towards the trucks Sarah rests her head on Drover's shoulder and caresses his cheek Dutton turns to them Dutton smiles tearfully He nods and walks away Fletcher strides angrily towards the truck the boys are getting into Dutton's the last on The tailgate is raised and the trucks head off Fletcher runs through the devastation watched from the water tower by King George Sarah's walking with Nullah"
        }
      ]
    }
  ]
}