{
  "ground_truth": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. They slow to a halt near the Weasley's home, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A coach and a truck approach as Hagrid rides inverted on the tunnel roof, with Harry hanging out of the sidecar, running over the coach, and dropping back in when the motorcycle returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorcycle up into the air. Hedwig flies towards them and attacks the pursuing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the motorcycle's headlamp. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the motorcycle. Harry presses the control button, and the motorcycle zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the motorcycle soar upwards beyond the clouds, and Hagrid comes to and takes control of the motorcycle. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. They slow to a halt near the Weasley's home, and the motorcycle throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bus and a lorry are approached as Hagrid is ridden upside down on the tunnel roof, with Harry being hung out of the sidecar, run over the bus, and dropped back in when the bike is returned to the road. Hagrid is slumped forward, a bolt from a death eater hits him, and the handlebars are grabbed by Harry, forcing the motorbike to be lifted into the air. Hedwig is flown towards them and the chasing death eater is attacked by her, but as the owl swoops to attack again, a bolt of green light hits her and she is tumbled earthwards. The death eater is pulled back, and a sudden cry of pain is let out by Harry, his face contorted as another ominous, dark figure is closed in on him. Harry is slumped forward, the bike's headlight illuminating his jagged scar. As two lines of electric pylons are sped between by them, Harry's wand is lighted of its own accord. The dark figure is drawn level, and the power flowing from Harry's wand is connected with an equal force of pulsating energy. Voldemort's wand is traveled up by the swirling vortex of light, illuminating his face, and an explosion is rocked on the bike. The control button is pressed by Harry, and the bike is zoomed away, spewing out flames that are propelled by Voldemort backwards as the electric pylons are collapsed. Harry, Hagrid, and the bike are soared upwards beyond the clouds, and Hagrid is come to and control of the bike is taken by him. As Harry is settled back into the sidecar, the engine fails, and they are hurdled downwards. Molly Weasley hears the protective shield around their house being broken through by them as the ground is plummeted towards, making a bumpy landing in a reed bed. A halt is slowed to near the Weasley's home, and a spume of water is thrown up by the bike, soaking both rider and passenger. A look is exchanged by Harry and Hagrid, and towards the house, they trudge, where her mother is followed out by Ginny, with George being supported by Lupin, whose left ear is covered in blood. George is carried inside and he is laid on a sofa as Harry is grabbed by Lupin by the collar, pinning him against the fireplace before his wand is lowered by Lupin and Harry is let go. Back is stepped by Lupin, and a nod is given by Harry. Out is raced by Lupin as Kingsley and Hermione return, and each other is pointed at by the two men with their wands before Kingsley's wand is lowered and he turns to Harry. A thestral lands, Bill and Fleur are carried by it, while Nymphadora Tonks approaches with another Harry lookalike, who transforms back into Ron as Hermione rushes to hug him. Nymphadora is embraced by Lupin, and Hermione and Ron are run to by Harry to embrace them. Fred is returned with by Mr. Weasley, who runs indoors as he follows anxiously. George's brow is stroked by Mrs. Weasley as Fred kneels down beside his twin. Around, the others gather, with Ron looking anxious. George is leaned towards by Fred, who has a large wound in his ear and points to it. Forward steps Bill, his face grim, and each other is looked at in shock by everyone, stunned."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hagrid rides upside down on the tunnel roof as a bus and lorry approach, with Harry hanging out of the sidecar. After running over the bus, Harry drops back in when the bike returns to the road. Hagrid slumps forward, hit by a death eater's bolt, and Harry grabs the handlebars, forcing the bike into the air. Hedwig attacks the death eater but is hit by a green bolt and falls. The death eater retreats, and Harry cries out in pain as another dark figure approaches. Harry slumps forward, his scar illuminated by the bike's headlight. As they speed between electric pylons, Harry's wand lights up. The dark figure draws level, and the power from Harry's wand connects with a pulsating energy. A vortex of light travels up Voldemort's wand, causing an explosion. Harry presses a button, and the bike zooms away, flames propelling Voldemort backward as the pylons collapse. Harry, Hagrid, and the bike soar beyond the clouds, and Hagrid regains control. As Harry settles back into the sidecar, the engine fails, and they plummet. Molly Weasley hears them break through the protective shield around their house, landing in a reed bed. They halt near the Weasley's home, the bike splashing water on them. Harry and Hagrid exchange a look and head to the house, where Ginny follows her mother out, with Lupin supporting George, whose ear is bleeding. George is carried inside, and Lupin pins Harry against the fireplace before releasing him. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands with Bill and Fleur, while Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione hugs him. Lupin embraces Tonks, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows. Mrs. Weasley strokes George's brow as Fred kneels beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who points to his wounded ear. Bill steps forward, his face grim, and everyone looks at each other in shock."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hagrid rides upside down on the tunnel roof as a bus and lorry approach, with Harry hanging from the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a death eater's bolt, and Harry grabs the handlebars, forcing the bike into the air. Hedwig attacks the death eater but is hit by a green bolt and falls. The death eater retreats, and Harry cries out in pain as another dark figure approaches. Harry slumps forward, his scar illuminated by the bike's headlight. As they speed between pylons, Harry's wand lights up. The dark figure draws level, and energy from Harry's wand connects with Voldemort's, causing an explosion. Harry presses a button, and the bike zooms away, flames propelling Voldemort backward as pylons collapse. Harry, Hagrid, and the bike soar beyond the clouds, and Hagrid regains control. The engine fails, and they plummet, breaking through a protective shield and landing near the Weasley's home, soaking them. Harry and Hagrid head to the house, where Ginny and Lupin support George, whose ear is bleeding. George is laid on a sofa as Lupin confronts Harry, then steps back. Kingsley and Hermione return, and Kingsley lowers his wand at Harry. A thestral lands with Bill and Fleur, while Tonks arrives with Ron, who changes back from a Harry lookalike. Lupin embraces Tonks, and Harry hugs Hermione and Ron. Mr. Weasley returns with Fred, who rushes inside. Mrs. Weasley tends to George as Fred kneels beside him. The others gather, stunned, as Bill steps forward grimly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As a bus and a large lorry approach, Hagrid finds himself riding his motorbike upside down on the roof of a tunnel. Meanwhile, Harry is precariously hanging out of the sidecar, running over the top of the bus before dropping back into the sidecar as the bike returns to the road. Suddenly, Hagrid slumps forward, having been struck by a bolt from a menacing death eater. In a swift reaction, Harry seizes the handlebars, forcing the motorbike to ascend into the air. At that moment, Hedwig, Harry's loyal owl, flies towards them and bravely attacks the pursuing death eater. However, as she swoops in for another attack, she is tragically hit by a bolt of green light, causing her to tumble earthwards. The death eater retreats, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in on them. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of towering electric pylons, Harry's wand mysteriously lights up on its own. The dark figure draws level with them, and the power emanating from Harry's wand connects with an equally powerful force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion violently rocks the bike. Harry quickly presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse in their wake. Harry, Hagrid, and the bike soar upwards, beyond the clouds, and Hagrid regains consciousness, taking control of the bike once more. As Harry settles back into the sidecar, the engine suddenly fails, and they begin to hurtle downwards. Molly Weasley hears them as they break through the protective shield surrounding their house, plummeting towards the ground and making a bumpy landing in a reed bed. They eventually slow to a halt near the Weasley's home, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a knowing look and trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood. George is carefully carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods in understanding. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him tightly. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who quickly runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley gently strokes George's brow as Fred kneels down beside his injured twin. The others gather around, with Ron looking particularly anxious. Fred leans towards George, who has a large wound in his ear and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock and disbelief."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As a bus and an impressively large lorry approach in the distance, Hagrid finds himself in a rather unusual position, riding his motorbike upside down on the roof of a tunnel. Meanwhile, Harry, in a perilous situation, is dangling precariously out of the sidecar, momentarily running across the top of the bus before he manages to drop back into the sidecar as the bike seamlessly returns to the road. Quite suddenly, Hagrid slumps forward, having been struck down by a bolt from a menacing and relentless death eater. In a swift and instinctive reaction, Harry firmly seizes the handlebars, expertly forcing the motorbike to ascend high into the air. At that very moment, Hedwig, Harry's ever-loyal owl, flies towards them with determination and bravely launches an attack against the pursuing death eater. However, in a tragic turn of events, as she courageously swoops in for another daring attack, she is struck by a lethal bolt of green light, which sends her tumbling earthward. The death eater strategically retreats, and Harry suddenly cries out in intense pain, his face contorting as another ominous, shadowy figure rapidly closes in on them. Harry slumps forward, his infamous jagged scar illuminated ominously by the bike's headlight. As they speed recklessly between two lines of towering electric pylons, Harry's wand mysteriously lights up of its own accord. The dark figure draws level with them, and the powerful energy emanating from Harry's wand connects with an equally strong force of pulsating energy. This swirling vortex of light travels up the length of Voldemort's wand, illuminating his face menacingly, and an explosion violently rocks the bike. Harry quickly presses the control button, and the bike zooms away with remarkable speed, spewing out powerful flames that propel Voldemort backwards as the electric pylons collapse dramatically in their wake. Harry, Hagrid, and the bike soar upwards, far beyond the clouds, and Hagrid regains consciousness, taking control of the bike once again. As Harry settles himself back into the sidecar, the engine suddenly fails, and they begin to hurtle downwards with frightening speed. Molly Weasley hears them as they break through the protective shield surrounding their home, plummeting towards the ground and finally making a bumpy landing in a reed bed. They eventually slow to a halt near the Weasley's comfortable home, and as the bike stops, it throws up a spume of water, soaking both rider and passenger thoroughly. Harry and Hagrid exchange a knowing look before they trudge towards the house, where Ginny follows her mother out, with Lupin supporting George, whose left ear is covered in blood and looking quite worse for wear. George is carefully carried inside the house and laid gently on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and finally letting Harry go. Lupin then steps back, and Harry nods in understanding. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other tensely before Kingsley lowers his wand and turns his attention to Harry. A thestral lands dramatically, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who dramatically transforms back into Ron as Hermione rushes forward to hug him tightly. Lupin embraces Nymphadora affectionately, and Harry quickly runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who quickly runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley gently strokes George's brow tenderly as Fred kneels down beside his injured twin. The others gather around, with Ron looking particularly anxious and on edge. Fred leans towards George, who has a large, concerning wound in his ear and points to it. Bill steps forward, his expression grim, and stunned, everyone looks at each other, clearly in shock and disbelief."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the bus and a lorry approach, Hagrid rides upside down on the tunnel roof, gripping the motorbike tightly, while Harry hangs precariously out of the sidecar, feeling the rush of air against his face. The motorbike, with Harry clinging on, runs over the bus, the wheels skimming its roof, before dropping back down as the bike returns to the road with a jolt. Suddenly, Hagrid slumps forward, struck by a bolt from a death eater, causing Harry to react quickly by grabbing the handlebars with determination, forcing the motorbike to ascend into the air. As they rise, Hedwig, Harry's loyal owl, flies towards them with urgency, launching an attack on the pursuing death eater. In a swift, graceful motion, Hedwig swoops to attack again, but is tragically hit by a bolt of green light, causing her to tumble earthwards in a heart-wrenching descent. The death eater pulls back, and Harry, overwhelmed by a sudden, sharp pain, cries out, his face contorting as another ominous, dark figure closes in on them. Harry slumps forward, his jagged scar glowing ominously in the light of the bike's headlamp. As they speed between two lines of towering electric pylons, Harry's wand, seemingly of its own volition, lights up with a bright, magical glow. The dark figure draws level with them, and the power emanating from Harry's wand connects with an equal force of pulsating energy from the figure's wand. A swirling vortex of light travels up Voldemort's wand, illuminating his menacing face, and an explosion violently rocks the bike. In a desperate move, Harry presses the control button, causing the bike to zoom away with a burst of speed, spewing out flames that propel Voldemort backwards as the electric pylons collapse in a dramatic cascade. Harry, Hagrid, and the bike soar upwards, breaking through the clouds, and Hagrid regains consciousness, taking control of the bike once more. As Harry settles back into the sidecar, the engine suddenly fails, and they begin to plummet downwards, hurtling towards the ground with alarming speed. Molly Weasley hears the commotion as they break through the protective shield surrounding their house, and they make a bumpy landing in a reed bed, the impact jarring but ultimately slowing them to a halt near the Weasley's home. The bike throws up a spume of water, drenching both rider and passenger as they come to a stop. Harry and Hagrid exchange a look of relief and exhaustion before trudging towards the house, where Ginny follows her mother out, her eyes wide with concern. Lupin supports George, whose left ear is covered in blood, and George is carefully carried inside and laid on a sofa. Lupin, with urgency in his movements, grabs Harry by the collar, pinning him against the fireplace in a tense moment before lowering his wand and releasing him. Lupin steps back, and Harry nods in understanding. Lupin then races out as Kingsley and Hermione return, and the two men, wands drawn, point them at each other in a moment of tension before Kingsley lowers his wand and turns to Harry with a nod of acknowledgment. A thestral lands gracefully, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who quickly transforms back into Ron as Hermione rushes forward to embrace him with relief. Lupin embraces Nymphadora warmly, and Harry runs to embrace Hermione and Ron, feeling a wave of relief wash over him. Mr. Weasley returns with Fred, who quickly runs indoors, his face etched with worry, as Mr. Weasley follows anxiously. Inside, Mrs. Weasley gently strokes George's brow, her face a mask of concern, as Fred kneels down beside his injured twin, his expression mirroring his mother's worry. The others gather around, their faces a mix of anxiety and shock, with Ron looking particularly anxious. Fred leans towards George, pointing to the large wound in his ear, his face a mixture of concern and disbelief. Bill steps forward, his face grim and serious, and as everyone looks at each other in stunned silence, the gravity of the situation settles over them like a heavy cloud."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar, they narrowly avoid a bus and a lorry. Hagrid is hit by a death eater's bolt, prompting Harry to take control and steer the motorbike into the air. Hedwig attacks the pursuing death eater but is struck down by a green bolt. As Harry cries out in pain, his scar illuminated, his wand lights up on its own. A dark figure draws near, and the power from Harry's wand clashes with Voldemort's, causing an explosion. Harry activates the bike's controls, propelling them away with flames that repel Voldemort and collapse the electric pylons. They ascend beyond the clouds, where Hagrid regains consciousness and resumes control. As Harry settles back into the sidecar, the engine fails, sending them plummeting. They crash through the protective shield around the Weasley's house, landing in a reed bed and coming to a halt, drenched by the bike's splash. Harry and Hagrid exchange a look and head towards the house, where Ginny and Lupin, supporting an injured George, meet them. Inside, George is laid on a sofa as Lupin confronts Harry before releasing him. Lupin rushes out as Kingsley and Hermione arrive, exchanging tense gestures before Kingsley turns to Harry. A thestral lands with Bill and Fleur, while Tonks arrives with a Harry lookalike who reverts to Ron, prompting Hermione to embrace him. Lupin and Tonks reunite, and Harry joins Hermione and Ron. Mr. Weasley returns with Fred, who rushes to George's side. Mrs. Weasley tends to George's wound as the others gather, stunned by the sight of his injury."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, a location in the busy streets of London known for its iconic underground passages, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, one of Voldemort's loyal followers adept in dark magic, and Harry grabs the handlebars, forcing the motorbike, a magical flying vehicle given to Hagrid by Sirius Black, up into the air. Hedwig, Harry's loyal snowy owl often used for delivering messages, flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light, characteristic of the killing curse Avada Kedavra, and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure, Voldemort, closes in. Harry slumps forward, his jagged lightning bolt-shaped scar, a remnant of his survival against Voldemort as a child, illuminated by the bike's headlight. As they speed between two lines of electric pylons, towering metal structures that carry high voltage power lines across the countryside, Harry's wand lights of its own accord, a sign of powerful magic. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy, revealing the intense magical duel. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails due to the extensive damage from the battle, and they hurdle downwards. Molly Weasley, the matriarch of the Weasley family known for her fierce protective nature, hears them break through the protective shield around their house, the Burrow, as they plummet towards the ground, making a bumpy landing in a reed bed typical of the marshy surroundings of their cottage. They slow to a halt near the Weasley's home, a welcoming but chaotic household for many of Harry's friends, and the bike throws up a spume of water, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house, where Ginny follows her mother out, with Lupin, a werewolf and former Defense Against the Dark Arts professor, supporting George, whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar, pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley, a high-ranking Auror and Order member, and Hermione, Harry's intelligent and resourceful friend, return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral, a skeletal winged horse visible only to those who have witnessed death, lands carrying Bill and Fleur, while Nymphadora Tonks, a Metamorphmagus known for her ability to change appearance at will, approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his ear, indicating the severity of their skirmish with the death eaters, and points to it. Bill, known for his curse-breaking skills at Gringotts, steps forward, his face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed  They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Lupin steps back and Harry nods  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  The others gather around with Ron looking anxious  Fred leans towards George who has a large wound in his ear and points to it  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  Harry slumps forward his jagged scar illuminated by the bike's headlight  As they speed between two lines of electric pylons Harry's wand lights of its own accord  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed  They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Lupin steps back and Harry nods  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  The others gather around with Ron looking anxious  Fred leans towards George who has a large wound in his ear and points to it  Bill steps forward his face grim and stunned  everyone looks at each other in shock"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike. Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar the engine fails and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back and Harry nods. Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike. Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar the engine fails and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood. George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go. Lupin steps back and Harry nods. Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in. Harry slumps forward his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons Harry's wand lights of its own accord. Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron. Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around with Ron looking anxious. Fred leans towards George who has a large wound in his ear and points to it. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in. when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards. Bill steps forward his face grim and stunned. everyone looks at each other in shock."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A kitten and a rabbit approach as a dragon rides upside down on the tunnel roof, with a turtle hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. The dragon slumps forward, hit by a bolt from a wizard, and the turtle grabs the handlebars, forcing the motorbike up into the air. A parrot flies towards them and attacks the chasing wizard, but as the bird swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The wizard pulls back, and the turtle suddenly cries out in pain, its face contorting as another ominous, dark figure closes in. The turtle slumps forward, its jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, the turtle's wand lights of its own accord. The dark figure draws level, and the power flowing from the turtle's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up a goblin's wand, illuminating its face, and an explosion rocks the bike. The turtle presses the control button, and the bike zooms away, spewing out flames that propel the goblin backwards as the electric pylons collapse. The turtle, the dragon, and the bike soar upwards beyond the clouds, and the dragon comes to and takes control of the bike. As the turtle settles back into the sidecar, the engine fails, and they hurdle downwards. A fairy hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. They slow to a halt near the fairy's home, and the bike throws up a spume of water, soaking both rider and passenger. The turtle and the dragon exchange a look and trudge towards the house, where a rabbit follows her mother out, with a centaur supporting an elf, whose left ear is covered in blood. The elf is carried inside and laid on a sofa as the centaur grabs the turtle by the collar, pinning it against the fireplace before lowering its wand and letting the turtle go. The centaur steps back, and the turtle nods. The centaur races out as a phoenix and a mermaid return, and the two creatures point their wands at each other before the phoenix lowers its wand and turns to the turtle. A unicorn lands, carrying a bear and a lioness, while a griffin approaches with another turtle lookalike, who changes back into a dog as a mermaid rushes to hug him. The centaur embraces the griffin, and the turtle runs to embrace the mermaid and the dog. A dwarf returns with a fox, who runs indoors as the dwarf follows anxiously. A fairy strokes the elf's brow as the fox kneels down beside its twin. The others gather around, with the dog looking anxious. The fox leans towards the elf, who has a large wound in its ear and points to it. A bear steps forward, its face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A train and a carriage approach as Hagrid rides upside down on the bridge ceiling, with Harry hanging out of the canoe, running over the train, and dropping back in when the scooter returns to the track. Hagrid slumps forward, hit by a dart from a ghostly knight, and Harry grabs the oars, forcing the scooter up into the air. Hedwig swoops towards them and attacks the chasing ghostly knight, but as the pigeon dives to attack again, she is hit by a dart of bright light and tumbles earthwards. The ghostly knight pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark shadow closes in. Harry slumps forward, his jagged scar illuminated by the scooter’s headlight. As they speed between two lines of wind turbines, Harry's wand lights of its own accord. The dark shadow draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the scooter. Harry presses the control button, and the scooter zooms away, spewing out steam that propels Voldemort backwards as the wind turbines collapse. Harry, Hagrid, and the scooter soar upwards beyond the clouds, and Hagrid comes to and takes control of the scooter. As Harry settles back into the canoe, the motor fails, and they plummet downwards. Molly Weasley hears them break through the protective barrier around their cottage as they plummet towards the ground, making a bumpy landing in a flowerbed. They slow to a halt near the Weasley's cottage, and the scooter throws up a spume of mud, soaking both rider and passenger. Harry and Hagrid exchange a look and trudge towards the cottage, where Ginny follows her mother out, with Lupin supporting George, whose left arm is covered in blood. George is carried inside and laid on a blanket as Lupin grabs Harry by the collar, pinning him against the bookshelf before lowering his wand and letting Harry go. Lupin steps back, and Harry nods. Lupin races out as Kingsley and Hermione return, and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry. A dragon lands, carrying Bill and Fleur, while Nymphadora Tonks approaches with another Harry lookalike, who changes back into Ron as Hermione rushes to hug him. Lupin embraces Nymphadora, and Harry runs to embrace Hermione and Ron. Mr. Weasley returns with Fred, who runs indoors as Mr. Weasley follows anxiously. Mrs. Weasley strokes George's brow as Fred kneels down beside his twin. The others gather around, with Ron looking anxious. Fred leans towards George, who has a large wound in his arm and points to it. Bill steps forward, his face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A bus and a lorry retreat as Hagrid dangles upside down on the tunnel roof, with Harry dangling out of the sidecar, skipping over the bus, and leaping back in when the bike ascends to the road. Hagrid slouches backward, nudged by a feather from a death eater, and Harry releases the handlebars, twisting the motorbike into the air. Hedwig dances towards them and distracts the chasing death eater, but as the owl spins to circle again, she is struck by a gust of green light and glides earthwards. The death eater retreats, and Harry suddenly whispers in pain, his face twisting as another ominous, dark figure inches closer. Harry slouches backward, his jagged scar highlighted by the bike's headlight. As they glide between two lines of electric pylons, Harry's wand glows of its own accord. The dark figure aligns level, and the energy flowing from Harry's wand merges with an equal force of throbbing energy. The swirling cascade of light travels up Voldemort's wand, lighting up his face, and a tremor shakes the bike. Harry taps the control button, and the bike zooms away, sending out sparks that nudge Voldemort backwards as the electric pylons shiver. Harry, Hagrid, and the bike ascend upwards beyond the clouds, and Hagrid wakens and maneuvers the bike. As Harry reclines back into the sidecar, the engine sputters, and they drift downwards. Molly Weasley watches them tear through the protective shield around their house as they plunge towards the ground, making a rough landing in a reed bed. They reduce to a stop near the Weasley's home, and the bike sprays out a splash of water, drenching both rider and passenger. Harry and Hagrid exchange a look and shuffle towards the house, where Ginny pursues her mother out, with Lupin propping up George, whose left ear is smeared in blood. George is carried inside and placed on a sofa as Lupin yanks Harry by the collar, pinning him against the fireplace before lowering his wand and releasing Harry. Lupin retreats, and Harry nods. Lupin darts out as Kingsley and Hermione arrive, and the two men wave their wands at each other before Kingsley lowers his wand and turns to Harry. A thestral touches down, carrying Bill and Fleur, while Nymphadora Tonks strides with another Harry lookalike, who shifts back into Ron as Hermione rushes to hold him. Lupin cuddles Nymphadora, and Harry dashes to hug Hermione and Ron. Mr. Weasley arrives with Fred, who hurries indoors as Mr. Weasley trails anxiously. Mrs. Weasley pats George's brow as Fred crouches down beside his twin. The others gather around, with Ron peering anxiously. Fred tilts towards George, who has a notable wound in his ear and gestures to it. Bill moseys forward, his face stern, and stunned, everyone glances at each other in disbelief."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A giraffe and a submarine approach as a mailbox rides upside down on the bridge roof, with a lamp hanging out of the backpack, running over the giraffe, and dropping back in when the skateboard returns to the road. The mailbox slumps forward, hit by a whistle from a scarecrow, and the lamp grabs the shoelaces, forcing the skateboard up into the air. A calculator flies towards them and attacks the chasing scarecrow, but as the calculator swoops to attack again, it is hit by a bolt of blue light and tumbles earthwards. The scarecrow pulls back, and the lamp suddenly cries out in pain, its face contorting as another ominous, dark window closes in. The lamp slumps forward, its jagged sticker illuminated by the skateboard's headlight. As they speed between two lines of electric guitars, the lamp's umbrella lights of its own accord. The dark window draws level, and the power flowing from the lamp's umbrella connects with an equal force of pulsating marshmallow. The swirling vortex of light travels up the toaster's umbrella, illuminating its face, and an explosion rocks the skateboard. The lamp presses the volume button, and the skateboard zooms away, spewing out feathers that propel the toaster backwards as the electric guitars collapse. The lamp, mailbox, and skateboard soar upwards beyond the balloons, and the mailbox comes to and takes control of the skateboard. As the lamp settles back into the backpack, the engine fails, and they hurdle downwards. A tomato hears them break through the protective shield around their library as they plummet towards the ground, making a bumpy landing in a sand dune. They slow to a halt near the tomato's library, and the skateboard throws up a spume of chocolate, soaking both rider and passenger. The lamp and mailbox exchange a look and trudge towards the library, where a toaster follows its tomato out, with a watermelon supporting a strawberry, whose left wing is covered in syrup. The strawberry is carried inside and laid on a treadmill as the watermelon grabs the lamp by the shoelaces, pinning it against the microwave before lowering its umbrella and letting the lamp go. The watermelon steps back, and the lamp nods. The watermelon races out as a drum and a pinecone return, and the two watermelons point their umbrellas at each other before the drum lowers its umbrella and turns to the lamp. A suitcase lands, carrying a coffee maker and a blender, while a snow globe approaches with another lamp lookalike, who changes back into a pineapple as the pinecone rushes to hug them. The watermelon embraces the snow globe, and the lamp runs to embrace the pinecone and pineapple. A cactus returns with an eraser, who runs indoors as the cactus follows anxiously. A balloon strokes the strawberry's brow as the eraser kneels down beside its twin. The others gather around, with the pineapple looking anxious. The eraser leans towards the strawberry, who has a large sticker in its wing and points to it. The coffee maker steps forward, its face grim, and stunned, everyone looks at each other in shock."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A parrot and a tractor roll as a dragon dances upside down on the mountain peak, with a rabbit floating out of the hammock, skipping over the parrot, and bouncing back in when the sled returns to the trail. The dragon naps backward, jolted by a pebble from a ghost, and the rabbit hugs the steering column, urging the sled up into the sky. A phoenix swims toward them and nudges the chasing ghost, but as the bird dives to nudge again, it is tapped by a ray of blue water and glides oceanwards. The ghost glides away, and the rabbit quietly sneezes in joy, its tail flickering as another bright, light creature glides near. The rabbit dances backward, its smooth tail glimmering by the sled’s taillights. As they drift between two rows of bamboo sticks, the rabbit's whistle hums of its own accord. The light creature draws close, and the energy humming from the rabbit's whistle mingles with an equal stream of vibrant sound. The spiraling melody of energy travels up Snape's whistle, illuminating his hair, and a ripple shakes the sled. The rabbit taps the control lever, and the sled whizzes away, releasing gusts that spin Snape around as the bamboo sticks tremble. The rabbit, the dragon, and the sled glide skyward past the fog, and the dragon wakes up and steers the sled. As the rabbit curls back into the hammock, the propeller sputters, and they float downward. Luna Lovegood notices them crack the magical seal around their nest as they drift towards the ocean, making a gentle landing in a cloud bank. They drift to a stop near the Lovegood's house, and the sled tosses up a mist of fog, drenching both creature and rider. The rabbit and the dragon share a glance and shuffle to the house, where Neville trails after his aunt, with McGonagall flying Holly, whose left toe is wrapped in yarn. Holly is perched inside and placed on a stool as McGonagall pokes the rabbit by the paw, pinning it against the chimney before raising her umbrella and releasing the rabbit. McGonagall steps aside, and the rabbit giggles. McGonagall gallops out as Dobby and Luna return, and the two creatures wave their umbrellas at each other before Dobby raises his umbrella and turns to the rabbit. A unicorn bounds, carrying Charlie and Gabrielle, while Professor Sprout tiptoes with another rabbit lookalike, who switches back into Neville as Luna races to kiss him. McGonagall hugs Professor Sprout, and the rabbit sprints to hug Luna and Neville. Mr. Lovegood arrives with Percy, who skips indoors as Mr. Lovegood marches earnestly. Mrs. Lovegood pats Holly's toe as Percy kneels next to his friend. The rest gather around, with Neville looking earnest. Percy whispers to Holly, who has a small star on her toe and points to it. Charlie steps near, his smile bright, and astonished, everyone glances at each other in amazement."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A tugboat and a kayak drift as Hagrid cartwheels upside down on the bridge ceiling, with Harry dangling from the seaplane, gliding past the tugboat, and returning when the moped dives to the ground. Hagrid leans backward, struck by a pebble from a rival wizard, and Harry seizes the steering wheel, steering the moped down into the tunnel. Hedwig flutters towards them and distracts the pursuing wizard, but as the owl dives to distract again, she is struck by a flash of purple smoke and spirals skywards. The rival wizard retracts, and Harry suddenly gasps in delight, his face lighting up as another mysterious, golden silhouette floats closer. Harry leans backward, his rounded scar highlighted by the moped's taillight. As they cruise between two lines of streetlights, Harry's broomstick glimmers of its own accord. The golden silhouette matches speed, and the glow emitted from Harry's broomstick merges with a counterforce of glowing mist. The spiraling cascade of mist travels up Voldemort's broomstick, revealing his face, and a burst rattles the moped. Harry taps the control lever, and the moped vanishes, releasing gusts of confetti that propel Voldemort forwards as the streetlights topple. Harry, Hagrid, and the moped dive downwards beneath the waves, and Hagrid awakens and regains control of the moped. As Harry reclines back into the seaplane, the propeller succeeds, and they drift upwards. Molly Weasley notices them sneak through the magical barrier around their garden as they soar away from the sun, making a smooth landing in a sandpit. They accelerate to a stop near the Weasley's lawn, and the moped sprays a mist of dust, covering both navigator and co-pilot. Harry and Hagrid share a glance and skate towards the lawn, where Ginny follows her father out, with Lupin carrying Fred, whose right foot is painted in ink. Fred is lifted inside and placed on a recliner as Lupin holds Harry by the arm, pinning him against the bookshelf before setting his broomstick and letting Harry fly. Lupin steps forward, and Harry smiles. Lupin sneaks out as Kingsley and Hermione appear, and the two men wave their broomsticks at each other before Kingsley sets down his broomstick and spins to Harry. A unicorn arrives, carrying Bill and Fleur, while Nymphadora Tonks saunters with another Harry lookalike, who shifts back into Ron as Hermione darts to cheer him. Lupin applauds Nymphadora, and Harry skips to applaud Hermione and Ron. Mr. Weasley arrives with George, who rushes outdoors as Mr. Weasley follows eagerly. Mrs. Weasley pats Fred's cheek as George crouches down beside his twin. The others cluster around, with Ron appearing relaxed. George leans away from Fred, who has a small smile on his mouth and gestures to it. Bill strides backward, his face serene, and amazed, everyone gazes at each other in awe."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A submarine and a spaceship drift closer as Gandalf swings sideways from the cave ceiling, with Bilbo dangling from the chariot, skipping over the submarine, and leaping back in when the skateboard glides to the pier. Gandalf leans backward, struck by a pebble from a wizard hunter, and Bilbo seizes the wheel, launching the skateboard skyward. Gollum flutters towards them and tackles the pursuing wizard hunter, but as the creature dives to tackle again, it is struck by a flash of red lightning and spirals toward the ocean. The wizard hunter recoils, and Bilbo suddenly shouts out in agony, his features twisting as another shadowy, sinister specter draws near. Bilbo leans backward, his twisted birthmark highlighted by the skateboard's spotlight. As they race between two rows of telephone poles, Bilbo's staff glows spontaneously. The shadowy specter matches pace, and the energy emanating from Bilbo's staff converges with a similar stream of throbbing power. The shimmering spiral of light ascends Sauron's staff, outlining his visage, and a detonation shakes the skateboard. Bilbo hits the activation lever, and the skateboard rockets off, belching out smoke that pushes Sauron backwards as the telephone poles topple. Bilbo, Gandalf, and the skateboard ascend beyond the mist, and Gandalf wakes up and regains control of the skateboard. As Bilbo reclines back into the chariot, the machine sputters, and they dive downwards. Arwen hears them shatter the mystical barrier around their sanctuary as they crash towards the earth, making a rough stop in a marshy pool. They decelerate to a standstill near the Elven retreat, and the skateboard kicks up a spray of mud, drenching both navigator and traveler. Bilbo and Gandalf share a glance and shuffle towards the sanctuary, where Legolas follows his father out, with Elrond supporting Aragorn, whose right arm is soaked in wine. Aragorn is carried inside and laid on a hammock as Elrond seizes Bilbo by the jacket, pressing him against the chimney before lowering his staff and releasing Bilbo. Elrond steps away, and Bilbo agrees. Elrond dashes out as Galadriel and Frodo return, and the two elves aim their staffs at each other before Galadriel lowers hers and turns to Bilbo. A phoenix lands, bearing Elendil and Éowyn, while Faramir approaches with another Bilbo doppelgänger, who shifts back into Sam as Frodo rushes to embrace him. Elrond hugs Faramir, and Bilbo runs to hug Frodo and Sam. Gimli returns with Eomer, who hurries inside as Gimli follows nervously. Arwen caresses Aragorn's cheek as Eomer crouches beside his comrade. The others cluster around, with Sam looking nervous. Eomer leans towards Aragorn, who has a massive cut on his arm and gestures to it. Elendil steps closer, his expression serious, and in disbelief, everyone stares at one another aghast."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hagrid, upside down on the tunnel roof, rides a motorbike with Harry in the sidecar. A death eater hits Hagrid, and Harry takes control, forcing the bike into the air. Hedwig attacks the death eater but is struck down. As another dark figure approaches, Harry cries in pain, his scar glowing. His wand lights up, connecting with Voldemort's energy, causing an explosion. Harry activates the bike's controls, creating flames that repel Voldemort, collapsing electric pylons. Hagrid regains control, but the bike fails, crashing through a protective shield at the Weasleys' home. They land in a reed bed, drenched. Limping toward the house, they meet Ginny and Molly with Lupin supporting George, whose ear is injured. Lupin confronts Harry but then releases him as Kingsley and Hermione return. Thestrals bring Bill, Fleur, Tonks, and Ron, who changes from a Harry lookalike back to himself. Harry reunites with friends. Mr. Weasley and Fred arrive, and Fred tends to George's ear wound, while everyone else looks on in shock."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "everyone looks at each other in shock Bill steps forward his face grim and stunned  Fred leans towards George who has a large wound in his ear and points to it  The others gather around with Ron looking anxious  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  Lupin steps back and Harry nods  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  As they speed between two lines of electric pylons Harry's wand lights of its own accord  Harry slumps forward his jagged scar illuminated by the bike's headlight  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  Fred leans towards George who has a large wound in his ear and points to it  They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  Lupin steps back and Harry nods  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  everyone looks at each other in shock Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed  Bill steps forward his face grim and stunned  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  The others gather around with Ron looking anxious  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  Harry slumps forward his jagged scar illuminated by the bike's headlight  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  As they speed between two lines of electric pylons Harry's wand lights of its own accord  A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They slow to a halt near the Weasley's home and the bike throws up a spume of water soaking both rider and passenger  Harry and Hagrid exchange a look and trudge towards the house where Ginny follows her mother out with Lupin supporting George whose left ear is covered in blood  George is carried inside and laid on a sofa as Lupin grabs Harry by the collar pinning him against the fireplace before lowering his wand and letting Harry go  Lupin steps back and Harry nods  Lupin races out as Kingsley and Hermione return and the two men point their wands at each other before Kingsley lowers his wand and turns to Harry  A thestral lands carrying Bill and Fleur while Nymphadora Tonks approaches with another Harry lookalike who changes back into Ron as Hermione rushes to hug him  Lupin embraces Nymphadora and Harry runs to embrace Hermione and Ron  Mr Weasley returns with Fred who runs indoors as Mr Weasley follows anxiously Mrs Weasley strokes George's brow as Fred kneels down beside his twin  The others gather around with Ron looking anxious  Fred leans towards George who has a large wound in his ear and points to it  Bill steps forward his face grim and stunned  everyone looks at each other in shock A bus and a lorry approach as Hagrid rides upside down on the tunnel roof with Harry hanging out of the sidecar running over the bus and dropping back in  when the bike returns to the road Hagrid slumps forward hit by a bolt from a death eater and Harry grabs the handlebars forcing the motorbike up into the air  Hedwig flies towards them and attacks the chasing death eater but as the owl swoops to attack again she is hit by a bolt of green light and tumbles earthwards  The death eater pulls back and Harry suddenly cries out in pain his face contorting as another ominous dark figure closes in  Harry slumps forward his jagged scar illuminated by the bike's headlight  As they speed between two lines of electric pylons Harry's wand lights of its own accord  The dark figure draws level and the power flowing from Harry's wand connects with an equal force of pulsating energy  The swirling vortex of light travels up Voldemort's wand illuminating his face and an explosion rocks the bike  Harry presses the control button and the bike zooms away spewing out flames that propel Voldemort backwards as the electric pylons collapse  Harry Hagrid and the bike soar upwards beyond the clouds and Hagrid comes to and takes control of the bike  As Harry settles back into the sidecar the engine fails and they hurdle downwards  Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground making a bumpy landing in a reed bed "
        }
      ]
    }
  ]
}