{
  "ground_truth": "The lights come on in the hall, and they close the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears, his hand reaches out, and then the face disappears as the smoke dissipates. They freeze, but Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening the wand maker, Ollivander, and then wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite, Hermione is still asleep, her left hand hanging over the edge almost touching Ron's hand, as Ron sleeps on the floor between them. Harry hauls himself upright, using the glowing tip of his wand to light the way, and mounts a staircase, his shadow cast on the wall. He turns the handle, pushes the door open, and stands in the doorway as light floods in through a dusty window. Inside the room, he pulls a cord, causing two skeletal bats to flap their bony wings as he looks around. On top of a chest of drawers, he finds a dusty old book and looks back at it. Hermione enters another room, which is a mess with a mattress falling off the bed, while Ron indicates the name of the door. Harry reads the message in the locket and, hearing a noise, they turn towards it. Harry gets up and cautiously crosses the room towards a door in the corner, yanking it open to reveal a house elf. Harry holds up the replica as Kreacher stares at the locket before he disapparates. Meanwhile, the Hogwarts Express puffs its way across a barren landscape, and in the train, Ginny sits with Neville Longbottom. Death Eaters fly over the engine, and a dark figure stands on the tread, halting the train. A student, Cormac, confronts the Death Eaters as they walk through the carriages, and Death Eaters approach Ginny and Neville. Dressed in pink, Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister. Mundungus sells stolen property, and upon seeing a group of snatchers, he scurries away taking shelter in an alley where the reward posters of Harry, Undesirable Number One, are pasted on the walls. Hermione plays while Ron watches her with puppy dog eyes; she glances at him and he tries again. Harry stares at the Snitch fluttering in front of him, and Hermione joins him. He takes hold of the Snitch, causing its wings to fold, and stares at the Golden Ball as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus, who sees a photograph in a newspaper on the floor, picks it up, and puts it on the table, while outside, a city street with stone buildings is shown.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The illuminations activate in the corridor, and they shut the main entrance. Ashen fumes ascend from the tiled surface in the extended slender passageway ahead of them and expands towards them. A spectral Dumbledore manifests, his hand extends out, and then the visage vanishes as the vapor dissipates. They stall, but Hermione advances forward and lifts her wand. Harry envisions Voldemort menacing the wand artisan, Ollivander, and then rouses from his vision to discover himself reclining fully attired on a sofa. On a sofa across, Hermione is still slumbering, her left hand dangling over the edge nearly touching Ron's hand, as Ron slumbers on the ground between them. Harry hoists himself erect, utilizing the luminous point of his wand to illuminate the path, and ascends a staircase, his silhouette projected on the partition. He rotates the knob, thrusts the door ajar, and stands in the threshold as brilliance pours in through a dusty pane. Inside the chamber, he tugs a cord, prompting two skeletal bats to flutter their bony wings as he gazes around. Atop a chest of drawers, he discovers a dusty aged tome and gazes back at it. Hermione enters another room, which is a jumble with a mattress tumbling off the bed, while Ron points to the inscription on the entrance. Harry peruses the message in the locket and, perceiving a sound, they pivot towards it. Harry rises and warily traverses the chamber towards a door in the angle, wrenching it ajar to unveil a house elf. Harry elevates the duplicate as Kreacher gazes at the locket before he disapparates. Meanwhile, the Hogwarts Express exhales its way across a desolate scenery, and in the locomotive, Ginny sits with Neville Longbottom. Death Eaters soar over the engine, and a shadowy entity stands on the step, stopping the train. A pupil, Cormac, challenges the Death Eaters as they stride through the carriages, and Death Eaters approach Ginny and Neville. Clad in pink, Dolores Umbridge stands beside Pius Thicknesse as a man is hauled towards the new Minister. Mundungus vends pilfered items, and upon noticing a group of snatchers, he dashes away seeking refuge in an alley where the bounty posters of Harry, Undesirable Number One, are affixed on the surfaces. Hermione performs while Ron observes her with puppy dog eyes; she peeks at him and he attempts again. Harry fixes his gaze on the Snitch flapping in front of him, and Hermione joins him. He grasps the Snitch, causing its wings to contract, and gazes at the Golden Ball as they all glance around. Harry and Hermione sprint past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus, who notices a photograph in a newspaper on the floor, snatches it up, and places it on the table, while outside, a metropolis street with stone edifices is depicted."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The lights are turned on in the hall, and the front door is closed by them. Gray smoke is seen rising from the tiled floor in the long narrow corridor ahead of them, and it swells towards them. A ghostly Dumbledore is made to appear, his hand is reached out, and then the face disappears as the smoke dissipates. They freeze, but Hermione steps forward and raises her wand. Harry is dreaming of Voldemort threatening the wand maker, Ollivander, and then he wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite, Hermione remains asleep, her left hand is hanging over the edge almost touching Ron's hand, while Ron sleeps on the floor between them. Harry hauls himself upright, using the glowing tip of his wand to light the way, and a staircase is mounted by him, with his shadow being cast on the wall. The handle is turned by him, the door is pushed open, and he stands in the doorway as light floods in through a dusty window. Inside the room, a cord is pulled by him, causing two skeletal bats to flap their bony wings as he looks around. On top of a chest of drawers, a dusty old book is found by him, and he looks back at it. Hermione enters another room, which is a mess with a mattress falling off the bed, while the name of the door is indicated by Ron. The message in the locket is read by Harry, and hearing a noise, they turn towards it. Harry rises and cautiously crosses the room towards a door in the corner, yanking it open to reveal a house elf. The replica is held up by Harry as Kreacher stares at the locket before he disapparates. Meanwhile, the Hogwarts Express is seen puffing its way across a barren landscape, and in the train, Neville Longbottom sits with Ginny. The engine is flown over by Death Eaters, and a dark figure is standing on the tread, halting the train. Cormac, a student, confronts the Death Eaters as they walk through the carriages, and Ginny and Neville are approached by Death Eaters. Dressed in pink, Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister. Stolen property is sold by Mundungus, and upon seeing a group of snatchers, he scurries away taking shelter in an alley where the reward posters of Harry, Undesirable Number One, are pasted on the walls. Hermione plays while Ron watches her with puppy dog eyes; a glance is given to him by her, and he tries again. Harry stares at the Snitch fluttering in front of him, and Hermione joins him. He takes hold of the Snitch, causing its wings to fold, and the Golden Ball is stared at by him as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus, who sees a photograph in a newspaper on the floor, picks it up, and it is put on the table by him, while outside, a city street with stone buildings is shown."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The lights activate in the hall, and they shut the door. Gray smoke rises in the corridor and swells toward them. A ghostly Dumbledore appears, reaching out, then vanishes as the smoke clears. Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening Ollivander, then wakes on a sofa. Opposite, Hermione sleeps, her hand almost touching Ron's as he sleeps on the floor. Harry sits up, using his wand to light the way, and ascends a staircase, his shadow on the wall. He turns a handle, opens a door, and stands as light floods through a dusty window. Inside, he pulls a cord, causing skeletal bats to flap. He finds a dusty book on a chest of drawers. Hermione enters another room, messy with a toppled mattress, while Ron indicates the door's name. Harry reads the locket's message; hearing a noise, they turn. Harry cautiously opens a corner door, revealing a house elf. Harry holds up the replica as Kreacher stares at the locket, then disapparates. Meanwhile, the Hogwarts Express travels a barren landscape, with Ginny sitting with Neville. Death Eaters fly over, and a dark figure halts the train. Cormac confronts the Death Eaters in the carriages as they approach Ginny and Neville. Dolores Umbridge, in pink, stands with Pius Thicknesse as a man is brought to the new Minister. Mundungus sells stolen goods and, seeing snatchers, hides in an alley with Harry’s reward posters on the walls. Hermione plays as Ron watches her adoringly; she glances at him, and he tries again. Harry stares at the Snitch, then holds it as its wings fold, observing the Golden Ball. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus and Dobby clings to his leg. They surround Mundungus, who picks up a photo from the floor and places it on the table, while outside, a city street with stone buildings is shown."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The hall lights come on as they close the door, with gray smoke rising from the tiled floor. A ghostly Dumbledore appears and vanishes as the smoke dissipates. Hermione steps forward, raising her wand. Harry dreams of Voldemort threatening Ollivander and wakes on a sofa. Hermione sleeps opposite him, her hand almost touching Ron's as he lies on the floor. Harry gets up, lights his wand, and climbs a staircase, opening a door to a dusty room. He pulls a cord, causing skeletal bats to stir, and finds a dusty book on a chest. Hermione enters another messy room, and Ron notes the door's name. Harry reads a message in the locket, hears a noise, and opens a door to reveal a house elf. Kreacher stares at the locket and disapparates. Meanwhile, the Hogwarts Express crosses a barren landscape with Ginny and Neville inside. Death Eaters stop the train; Cormac challenges them as they approach Ginny and Neville. Dolores Umbridge stands beside Pius Thicknesse as someone is dragged to the Minister. Mundungus flees snatchers, hiding in an alley with Harry's wanted posters. Hermione plays while Ron watches her. Harry examines a Snitch, and Hermione joins him. Taking the Snitch, its wings fold as they all look. Harry and Hermione run past Ron into the kitchen where Kreacher holds Mundungus, and Dobby clings to his leg. Mundungus picks up a photograph from the floor and puts it on the table, with a city street view outside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the lights gradually illuminate the expansive hall, the distinctive sound of the door gently closing echoes through the space. Wisps of gray smoke eerily emerge from the patterned tiled floor of the narrow and elongated corridor that lies ahead of them, swelling ominously in their direction. In an unexpected apparition, a ghostly figure resembling Dumbledore manifests, his ethereal hand reaching out towards them before his spectral visage vanishes as the smoke disperses into the air. The group is momentarily paralyzed by this uncanny encounter, yet Hermione steps forward with resolve, her wand raised with determined confidence. In the midst of these strange occurrences, Harry drifts into a vivid dream where he envisions Voldemort menacingly threatening the wand maker, Ollivander. Jolted awake from this unsettling vision, Harry finds himself lying fully dressed on the cushioned sofa. Opposite him, Hermione remains in a deep slumber, her left hand serenely hanging over the edge, almost brushing against Ron's hand as he sleeps soundly on the floor between them. Summoning his strength, Harry pulls himself upright, using the illuminated tip of his wand to guide his path as he ascends a staircase, his shadow stretching and flickering against the wall. He turns the handle with anticipation, pushes the door open, and stands at the threshold, where light floods through a dusty window, bathing the room in a gentle glow. Inside, he tugs a dangling cord, causing two skeletal bats to unfurl their bony wings, flapping as he surveys the surroundings. Upon a chest of drawers, he discovers an ancient, dust-covered book and glances back at it with curiosity. Simultaneously, Hermione ventures into another room, chaotic and disheveled, with a mattress precariously slipping off the bed. Ron, gesturing, points out the name on the door. Harry, contemplating the message inscribed in the locket, hears an unfamiliar noise, prompting them to turn towards its source. He rises, cautiously crossing the cluttered room towards the corner where a door awaits. With a firm yank, he opens it to reveal a house elf, Kreacher, who stares intently at the locket's replica before disapparating. Meanwhile, the Hogwarts Express chugs determinedly across a stark and barren landscape, with Ginny seated inside alongside Neville Longbottom. Overhead, Death Eaters ominously fly above the engine, and a dark figure positions itself on the tread, effectively halting the train's progress. In a brave confrontation, a student named Cormac faces the Death Eaters as they stride through the carriages, eventually approaching Ginny and Neville. At the Ministry, Dolores Umbridge, adorned in pink, stands beside Pius Thicknesse while a man is dragged toward the newly appointed Minister. Mundungus, engaged in illicit activities by selling stolen goods, spots a group of snatchers and swiftly scuttles away, seeking refuge in a shadowy alley where posters declaring Harry as Undesirable Number One are conspicuously plastered on the walls. As Hermione occupies herself with a playful activity, Ron watches her with adoring, puppy-like eyes; she catches his gaze, and he attempts to engage her once more. Meanwhile, Harry fixates on the Snitch fluttering just before him, and Hermione joins him in this moment of intrigue. As Harry seizes the Snitch, its delicate wings fold inward, and he gazes at the Golden Ball, prompting them all to glance around in shared wonder. In a flurry of activity, Harry and Hermione dash past Ron into the bustling kitchen where a scene unfolds: Kreacher has Mundungus in a firm grip around the head, and Dobby is clinging determinedly to his leg. Closing in on Mundungus, their attention is drawn to a photograph that Mundungus picks up from the floor and places on the table. Outside, the scene shifts to a bustling city street flanked by imposing stone buildings."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the ambient lights begin to glow and gradually illuminate the expansive and cavernous hall, the distinctive, almost echoing sound of the door closing gently reverberates through the spacious area. Wisps of gray, ghostly smoke eerily and mysteriously emerge from the uniquely patterned, tiled floor of the narrow and elongated corridor that stretches out ahead of them, ominously swelling in their direction. In an unexpected and startling apparition, a ghostly figure resembling the wise Dumbledore manifests before them, his ethereal and translucent hand reaching out towards them before his spectral visage suddenly vanishes as the swirling smoke disperses into the thin air. The group is momentarily paralyzed and rooted to the spot by this uncanny and surreal encounter, yet with resolve and determination, Hermione steps forward, her wand confidently raised and ready for action. Amidst these strange and peculiar occurrences, Harry drifts into a vivid and unsettling dream where he sees Voldemort menacingly threatening the wand maker, Ollivander. Jolted awake from this disturbing vision, Harry finds himself lying fully dressed on the cushioned and comfortable sofa. Directly opposite him, Hermione remains in a deep, peaceful slumber, her left hand serenely hanging over the edge, almost brushing gently against Ron's hand as he sleeps soundly on the floor between them. Summoning his strength and gathering his resolve, Harry pulls himself upright, using the illuminated tip of his wand to guide his path as he carefully ascends a staircase, his shadow stretching and flickering wildly against the wall. He turns the handle with anticipation, pushes the door open, and stands at the threshold, where light floods through a dusty window, bathing the room in a soft, gentle glow. Once inside, he tugs on a dangling cord, causing two skeletal bats to unfurl their bony wings, flapping as he surveys the surroundings with interest. On a chest of drawers, he discovers an ancient, dust-covered book and glances back at it with curiosity and intrigue. Simultaneously, Hermione ventures into another room, chaotic and disheveled, with a mattress precariously slipping off the rickety bed. Ron, gesturing, points out the name inscribed on the door. Harry, contemplating the cryptic message inscribed in the locket, hears an unfamiliar noise, prompting them to turn towards its source. He rises, cautiously crossing the cluttered room toward the corner where a door awaits. With a firm yank, he opens it to reveal a house elf, Kreacher, who stares intently at the locket's replica before disapparating. Meanwhile, the Hogwarts Express chugs determinedly across a stark and barren landscape, with Ginny seated inside alongside Neville Longbottom. Overhead, Death Eaters ominously fly above the engine, and a dark figure positions itself on the tread, effectively halting the train's progress. In a courageous confrontation, a student named Cormac faces the Death Eaters as they stride purposefully through the carriages, eventually approaching Ginny and Neville. At the Ministry, the formidable Dolores Umbridge, adorned in her signature pink attire, stands beside the new Minister, Pius Thicknesse, while a man is dragged menacingly toward him. Mundungus, engaged in illicit activities by selling stolen goods, spots a group of snatchers and swiftly scuttles away, seeking refuge in a shadowy and dimly lit alley where posters declaring Harry as Undesirable Number One are conspicuously plastered on the walls. As Hermione occupies herself with a playful activity, Ron watches her with adoring, puppy-like eyes; she catches his gaze, and he attempts to engage her once more. Meanwhile, Harry fixates intently on the Snitch fluttering just before him, and Hermione joins him in this shared moment of intrigue. As Harry seizes the Snitch, its delicate wings fold inward, and he gazes at the Golden Ball, prompting them all to glance around in shared wonder. In a flurry of activity, Harry and Hermione dash past Ron into the lively and bustling kitchen, where an animated scene unfolds: Kreacher has Mundungus in a firm grip around the head, and Dobby is clinging determinedly to his leg. Closing in on Mundungus, their attention is drawn to a photograph that Mundungus picks up from the floor and places on the table. Outside, the scene shifts dramatically to a bustling city street flanked by imposing and towering stone buildings."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the bright lights flicker on in the hall, they firmly close the front door behind them, sealing off the outside world. In the long, narrow corridor that stretches ahead, gray smoke begins to rise eerily from the tiled floor, swirling and swelling towards them with a mysterious air. Amid this fog, the ghostly figure of Dumbledore materializes, extending a spectral hand forward before his visage vanishes as the smoke gradually dissipates. Momentarily frozen in place by the apparition, Hermione bravely steps forward, lifting her wand with determination. In a sudden shift, Harry finds himself deep in the throes of a dream, envisioning Voldemort menacingly threatening the wand maker, Ollivander. Abruptly, he jolts awake from the dream to discover he is fully clothed and lying on a sofa. Across from him, Hermione remains asleep on another sofa, her left hand dangling over the edge, nearly brushing Ron's hand as he sleeps on the floor between them. Shaking off his grogginess, Harry propels himself upright, using the glow from his wand to illuminate his path. He ascends a staircase with his shadow stretching across the wall, arriving at a door where he turns the handle and pushes it open, allowing light to pour in through a dusty window. Inside the room, he pulls a cord that startles two skeletal bats into flapping their bony wings as he surveys the surroundings. On top of a chest of drawers, he spots a dusty old book and contemplates it briefly. Meanwhile, Hermione steps into a chaotic room with a mattress askew from the bed, while Ron gestures at the name on the door. Harry absorbs the message inscribed in the locket and, upon hearing a noise, they all pivot toward the sound. Rising cautiously, Harry crosses the room toward a door nestled in the corner, pulling it open to uncover a house elf. Harry raises a replica as Kreacher fixes his gaze on the locket before abruptly disapparating. Simultaneously, the Hogwarts Express steams across a desolate landscape, where inside the train, Ginny shares a compartment with Neville Longbottom. Above the engine, Death Eaters loom ominously, and a dark figure stands firmly on the train's tread, bringing the journey to a halt. Within the carriages, a student named Cormac boldly confronts the Death Eaters as they stride through, closing in on Ginny and Neville. Clad in pink, Dolores Umbridge stands beside Pius Thicknesse as a man is forcibly dragged toward the new Minister. Meanwhile, Mundungus is busy selling stolen goods, and upon noticing a group of snatchers, he hastily retreats, seeking refuge in an alley plastered with reward posters of Harry, labeled Undesirable Number One. In the interim, Hermione entertains herself while Ron watches her with adoring eyes; she glances back, and Ron makes another attempt to catch her attention. Meanwhile, Harry's focus is captured by the Snitch that flutters before him, and Hermione soon joins him. As he grasps the Snitch, its wings fold up neatly, and he contemplates the Golden Ball as they all survey their surroundings. Urgently, Harry and Hermione sprint past Ron into the kitchen, where Kreacher is attempting to subdue Mundungus by the head and Dobby clings steadfastly to his leg. They converge on Mundungus, who notices a photograph in a newspaper on the floor, snatches it, and places it on the table, while outside, a city street lined with stone buildings is quietly depicted."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The lights illuminate the hall as they close the front door. Gray smoke rises from the tiled floor and swells toward them, revealing a ghostly apparition of Dumbledore reaching out before disappearing. They freeze, but Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening Ollivander and then awakens fully clothed on a sofa. Hermione sleeps on a sofa opposite, almost touching Ron, who is on the floor between them. Harry uses his wand to light his way upstairs, opens a door, and stands in the doorway as light floods the room. He pulls a cord, causing skeletal bats to flap, and finds a dusty old book. Meanwhile, Hermione enters a messy room, and Ron indicates the name on the door. Harry reads the locket's message, hears a noise, and cautiously opens a door to reveal a house elf. Harry holds up the replica as Kreacher looks at the locket before disapparating. Meanwhile, the Hogwarts Express crosses a barren landscape. Inside the train, Ginny sits with Neville Longbottom as Death Eaters halt the train and confront students, including Cormac, Ginny, and Neville. Dolores Umbridge stands with Pius Thicknesse as a man is dragged to the Minister. Mundungus sells stolen goods, then flees from snatchers into an alley with reward posters of Harry on the walls. Hermione plays, and Ron watches her with longing; she glances at him, and he tries again. Harry fixes his gaze on a fluttering Snitch, takes hold of it, and they all observe the Golden Ball. Harry and Hermione rush past Ron into the kitchen, where Kreacher has Mundungus in a hold and Dobby clings to his leg. They converge on Mundungus, who notices a photograph in a newspaper, picks it up, and sets it on the table while a city street scene appears outside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The lights come on in the hall, part of the old Black family residence known as Grimmauld Place, and they close the front door. Gray smoke rises from the tiled floor, often seen in enchanted places, in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears, known for his role as the wise and respected headmaster of Hogwarts School of Witchcraft and Wizardry, his hand reaches out, and then the face disappears as the smoke dissipates. They freeze, but Hermione, a gifted witch known for her intelligence and bravery, steps forward and raises her wand. Harry dreams of Voldemort, the notorious dark wizard feared in the wizarding world, threatening the wand maker, Ollivander, renowned for his expertise in crafting wands, and then wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite, Hermione is still asleep, her left hand hanging over the edge almost touching Ron's hand, as Ron, her loyal friend with a knack for strategic thinking, sleeps on the floor between them. Harry hauls himself upright, using the glowing tip of his wand to light the way, and mounts a staircase, his shadow cast on the wall. He turns the handle, pushes the door open, and stands in the doorway as light floods in through a dusty window, revealing a room filled with relics of the wizarding family who once lived there. Inside the room, he pulls a cord, causing two skeletal bats to flap their bony wings, remnants of enchanted decorations, as he looks around. On top of a chest of drawers, he finds a dusty old book, possibly a tome of forgotten spells, and looks back at it. Hermione enters another room, which is a mess with a mattress falling off the bed, while Ron indicates the name of the door, hinting at its past occupant. Harry reads the message in the locket, a mysterious and possibly cursed object, and, hearing a noise, they turn towards it. Harry gets up and cautiously crosses the room towards a door in the corner, yanking it open to reveal a house elf, a magical creature often bound to serve wizarding families. Harry holds up the replica as Kreacher stares at the locket before he disapparates, using the elf's ability to vanish instantly. Meanwhile, the Hogwarts Express, the iconic train that transports students to the school of magic, puffs its way across a barren landscape, and in the train, Ginny, a member of the resistance against Voldemort, sits with Neville Longbottom, known for his courage and growth into a capable leader. Death Eaters, loyal followers of Voldemort, fly over the engine, and a dark figure stands on the tread, halting the train in a show of intimidation. A student, Cormac, confronts the Death Eaters as they walk through the carriages, bravely standing up to the dark forces, and Death Eaters approach Ginny and Neville, causing tension among the students. Dressed in pink, Dolores Umbridge, infamous for her tyrannical rule at Hogwarts, stands beside Pius Thicknesse, the puppet Minister controlled by Voldemort's influence, as a man is dragged towards the new Minister. Mundungus, known for his dubious dealings and tendency to flee, sells stolen property, and upon seeing a group of snatchers, the bounty hunters working for the regime, he scurries away taking shelter in an alley where the reward posters of Harry, labeled Undesirable Number One, are pasted on the walls, showing the Ministry's efforts to capture him. Hermione plays a magical tune while Ron watches her with puppy dog eyes; she glances at him, and he tries again to express his feelings. Harry stares at the Snitch fluttering in front of him, a key element in the sport of Quidditch, and Hermione joins him. He takes hold of the Snitch, causing its wings to fold, and stares at the Golden Ball, wondering about the secrets it might reveal, as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg, both house elves showing their loyalty to Harry. They close in on Mundungus, who sees a photograph in a newspaper on the floor, highlighting a moment of significance, picks it up, and puts it on the table, while outside, a city street with stone buildings reminiscent of old London is shown."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg The lights come on in the hall and they close the front door Harry stares at the Snitch fluttering in front of him and Hermione joins him Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them she glances at him and he tries again A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates They freeze but Hermione steps forward and raises her wand Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa They freeze but Hermione steps forward and raises her wand The lights come on in the hall and they close the front door Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister On top of a chest of drawers he finds a dusty old book and looks back at it Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door Harry holds up the replica as Kreacher stares at the locket before he disapparates Harry reads the message in the locket and hearing a noise they turn towards it Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around Harry holds up the replica as Kreacher stares at the locket before he disapparates Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window Death Eaters fly over the engine and a dark figure stands on the tread halting the train A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates Hermione plays while Ron watches her with puppy dog eyes she glances at him and he tries again Harry stares at the Snitch fluttering in front of him and Hermione joins him He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table while outside a city street with stone buildings is shown"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The lights come on in the hall and they close the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates. They freeze but Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them. Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall. He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window. Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around. On top of a chest of drawers he finds a dusty old book and looks back at it. Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door. Harry reads the message in the locket and hearing a noise they turn towards it. Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Harry holds up the replica as Kreacher stares at the locket before he disapparates. Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom. Death Eaters fly over the engine and a dark figure stands on the tread halting the train. A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville. Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister. Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls. Hermione plays while Ron watches her with puppy dog eyes. she glances at him and he tries again. Harry stares at the Snitch fluttering in front of him and Hermione joins him. He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table. while outside a city street with stone buildings is shown."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The lights come on in the hall and they close the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates. They freeze but Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them. Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall. He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window. Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around. On top of a chest of drawers he finds a dusty old book and looks back at it. Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door. Harry reads the message in the locket and hearing a noise they turn towards it. Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Harry holds up the replica as Kreacher stares at the locket before he disapparates. Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom. Death Eaters fly over the engine and a dark figure stands on the tread halting the train. A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville. Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister. Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls. Hermione plays while Ron watches her with puppy dog eyes. she glances at him and he tries again. Harry stares at the Snitch fluttering in front of him and Hermione joins him. He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table. while outside a city street with stone buildings is shown."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The lights come on in the hall and they close the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates. They freeze but Hermione steps forward and raises her wand. Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa. On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them. Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall. she glances at him and he tries again. Harry stares at the Snitch fluttering in front of him and Hermione joins him. He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table. while outside a city street with stone buildings is shown."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The lights come on in the hall and they close the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them. A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates. Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg. They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table. while outside a city street with stone buildings is shown."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The lights come on in the hall, and the giraffe closes the front door. Gray smoke rises from the tiled floor in the long narrow corridor ahead of the flamingo and swells towards the flamingo. A ghostly Sherlock Holmes appears, Sherlock's hand reaches out, and then the face disappears as the smoke dissipates. The flamingo freezes, but a penguin steps forward and raises her wand. A squirrel dreams of Voldemort threatening the wand maker, Ollivander, and then wakes from the squirrel's dream to find itself lying fully clothed on a sofa. On a sofa opposite, the penguin is still asleep, her left hand hanging over the edge almost touching an otter's hand, as the otter sleeps on the floor between them. The squirrel hauls itself upright, using the glowing tip of its wand to light the way, and mounts a staircase, its shadow cast on the wall. It turns the handle, pushes the door open, and stands in the doorway as light floods in through a dusty window. Inside the room, the squirrel pulls a cord, causing two skeletal bats to flap their bony wings as the squirrel looks around. On top of a chest of drawers, the squirrel finds a dusty old book and looks back at it. The penguin enters another room, which is a mess with a mattress falling off the bed, while the otter indicates the name of the door. The squirrel reads the message in the locket and, hearing a noise, the flamingo turns towards it. The squirrel gets up and cautiously crosses the room towards a door in the corner, yanking it open to reveal a house elf. The squirrel holds up the replica as Kreacher stares at the locket before Kreacher disapparates. Meanwhile, the Titanic puffs its way across a barren landscape, and in the train, a lion sits with Neville Longbottom. Death Eaters fly over the engine, and a dark figure stands on the tread, halting the train. A student, Cormac, confronts the Death Eaters as they walk through the carriages, and Death Eaters approach the lion and Neville. Dressed in pink, the Easter Bunny stands beside Pius Thicknesse as a man is dragged towards the new Minister. Mundungus sells stolen property, and upon seeing a group of snatchers, Mundungus scurries away taking shelter in an alley where the reward posters of a zebra, Undesirable Number One, are pasted on the walls. A penguin plays while the otter watches her with puppy dog eyes; she glances at him and he tries again. The squirrel stares at the Snitch fluttering in front of it, and the penguin joins it. The squirrel takes hold of the Snitch, causing its wings to fold, and stares at the Golden Ball as they all look round. The squirrel and the penguin run past the otter into the kitchen where Kreacher has Mundungus round the head and Dobby clings to Dobby's leg. They close in on Mundungus, who sees a photograph in a newspaper on the floor, picks it up, and puts it on the table, while outside, a city street with stone buildings is shown."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The lights come on in the garden, and they close the gate. Yellow mist rises from the grassy path in the long winding trail ahead of them and swirls towards them. A spectral Merlin appears, his hand reaches out, and then the face vanishes as the mist vanishes. They freeze, but Hermione steps forward and raises her lantern. Harry dreams of Voldemort threatening the potion maker, Slughorn, and then wakes from his dream to find himself lying fully clothed on a hammock. On a hammock opposite, Hermione is still asleep, her left hand hanging over the edge almost touching Ron's hand, as Ron sleeps on the ground between them. Harry hauls himself upright, using the glowing tip of his flashlight to light the way, and climbs a ladder, his shadow cast on the tree trunk. He turns the latch, pushes the door open, and stands in the doorway as light floods in through a cracked skylight. Inside the attic, he pulls a lever, causing two ghostly owls to flap their spectral wings as he looks around. On top of a wardrobe, he finds a dusty old map and looks back at it. Hermione enters another attic, which is a mess with a rug slipping off the floor, while Ron indicates the name on the wall. Harry reads the message in the bottle and, hearing a noise, they turn towards it. Harry gets up and cautiously crosses the attic towards a hatch in the corner, yanking it open to reveal a fairy. Harry holds up the talisman as Kreacher stares at the bottle before he disapparates. Meanwhile, the Hogwarts Carriage rolls its way across a desert landscape, and in the carriage, Ginny sits with Luna Lovegood. Dementors glide over the roof, and a dark figure stands on the step, halting the carriage. A student, Lavender, confronts the Dementors as they walk through the compartments, and Dementors approach Ginny and Luna. Dressed in purple, Bellatrix Lestrange stands beside Severus Snape as a student is dragged towards the new Headmaster. Mundungus sells counterfeit goods, and upon seeing a group of goblins, he scurries away taking shelter in a market where the reward flyers of Harry, Fugitive Number One, are plastered on the stalls. Hermione plays while Ron watches her with hopeful eyes; she glances at him and he tries again. Harry stares at the Quill floating in front of him, and Hermione joins him. He takes hold of the Quill, causing its tip to retract, and stares at the Silver Pen as they all look round. Harry and Hermione run past Ron into the pantry where Kreacher has Mundungus round the shoulders and Winky clings to his arm. They close in on Mundungus, who sees a sketch in a journal on the floor, picks it up, and puts it on the counter, while outside, a village road with wooden cottages is shown."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The lights flicker in the hall, and they paint the front door. Gray smoke descends onto the tiled floor in the long narrow corridor ahead of them and floats away from them. A ghostly Dumbledore materializes, his hand points out, and then the face vanishes as the smoke condenses. They retreat, but Hermione charges forward and drops her wand. Harry envisions Voldemort comforting the wand maker, Ollivander, and then jolts from his sleep to find himself lying fully clothed on a sofa. On a sofa opposite, Hermione is still asleep, her left hand drifting over the edge almost tickling Ron's hand, as Ron naps on the floor between them. Harry pulls himself upright, using the glowing tip of his wand to guide the way, and descends a staircase, his shadow flickering on the wall. He kicks the handle, slams the door shut, and leans in the doorway as light fades in through a dusty window. Inside the room, he snaps a cord, causing two skeletal bats to glide through the air as he glances around. On top of a chest of drawers, he tosses a dusty old book and gazes back at it. Hermione exits another room, which is a mess with a mattress teetering on the bed, while Ron gestures towards the name of the door. Harry ignores the message in the locket and, sensing a noise, they turn from it. Harry sits down and nervously drifts across the room towards a door in the corner, sealing it shut to conceal a house elf. Harry lowers the replica as Kreacher glares at the locket before he appears. Meanwhile, the Hogwarts Express creeps its way across a barren landscape, and in the train, Ginny stands with Neville Longbottom. Death Eaters drift over the engine, and a dark figure crouches on the tread, accelerating the train. A student, Cormac, evades the Death Eaters as they linger through the carriages, and Death Eaters circle Ginny and Neville. Dressed in pink, Dolores Umbridge sits beside Pius Thicknesse as a man is brought towards the new Minister. Mundungus hides stolen property, and upon spotting a group of snatchers, he sneaks away taking refuge in an alley where the reward posters of Harry, Undesirable Number One, are stuck on the walls. Hermione dances while Ron gazes at her with puppy dog eyes; she peers at him and he fumbles again. Harry ignores the Snitch fluttering in front of him, and Hermione observes him. He releases hold of the Snitch, causing its wings to expand, and glances at the Golden Ball as they all turn away. Harry and Hermione walk past Ron into the kitchen where Kreacher entertains Mundungus round the head and Dobby clings to his leg. They back away from Mundungus, who avoids a photograph in a newspaper on the floor, kicks it aside, and throws it on the table, while outside, a city street with stone buildings is hidden."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The shadows come on in the meadow, and they latch the back gate. Blue steam descends from the grassy ceiling in the short wide avenue behind them and shrinks away from them. A wispy Sherlock appears, his elbow reaches out, and then the shoulders disappear as the steam dissipates. They freeze, but Penelope steps forward and raises her pen. Tom imagines of Frodo threatening the shoe cobbler, Anderson, and then wakes from his vision to find himself lying fully clothed on a bench. On a bench opposite, Penelope is still asleep, her right foot hanging over the edge almost touching Sam's foot, as Sam sleeps on the grass between them. Tom hauls himself upright, using the glowing edge of his pen to light the way, and mounts a ladder, his shadow cast on the ceiling. He turns the knob, pushes the gate open, and stands in the threshold as light floods in through a dusty curtain. Inside the chamber, he pulls a chain, causing two skeletal parrots to flap their bony tails as he looks around. On top of a bookshelf, he finds a dusty old map and looks back at it. Penelope enters another chamber, which is a mess with a cushion falling off the chair, while Sam indicates the number of the window. Tom reads the message in the diary and, hearing a sound, they turn towards it. Tom gets up and cautiously crosses the chamber towards a window in the corner, yanking it open to reveal a garden gnome. Tom holds up the imitation as Igor stares at the diary before he vanishes. Meanwhile, the Nile Steamboat puffs its way across a lush landscape, and in the vessel, Lily sits with Lucy Pevensie. Goblins fly over the mast, and a light figure stands on the rail, halting the vessel. A sailor, Nigel, confronts the goblins as they stride through the decks, and goblins approach Lily and Lucy. Dressed in blue, Mary Poppins stands beside Captain Hook as a woman is dragged towards the old Guard. Alonso sells ancient artifacts, and upon seeing a flock of crows, he scurries away taking shelter in a forest where the wanted posters of Tom, Undesirable Number Seven, are pasted on the branches. Penelope dances while Sam watches her with puppy dog eyes; she glances at him and he tries again. Tom stares at the Kite fluttering in front of him, and Penelope joins him. He takes hold of the Kite, causing its tail to fold, and stares at the Golden Sphere as they all look round. Tom and Penelope run past Sam into the pantry where Igor has Alonso round the neck and Winky clings to his arm. They close in on Alonso, who sees a painting in a magazine on the cushion, picks it up, and puts it on the counter, while outside, a desert path with wooden huts is shown."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The ceiling fans start spinning in the arena, and the butler opens the back window. Blue mist sinks from the wooden ceiling in the wide short hallway behind them and rolls away from them. A mythical Gandalf vanishes, his foot stretches down, and then the nose emerges as the mist condenses. They sprint, but Luna steps back and lowers her umbrella. Draco imagines Voldemort assisting the potion maker, Snape, and then dozes off in his daydream to find himself floating barefoot on a cloud. On a cloud nearby, Luna is still awake, her right foot rising over the side almost touching Draco's foot, as Draco dances on the ceiling above them. Draco rolls himself sideways, using the sparkling end of his umbrella to dim the path, and descends a hill, his reflection bounced on the floor. He twists the knob, pulls the window shut, and lies near the threshold as shadows retreat through a broken door. Outside the space, he cuts a wire, causing two porcelain doves to droop their feathered heads as he listens intently. On top of a chair, he discovers a shiny new mirror and turns away from it. Luna exits another space, which is tidy with a blanket rising onto the sofa, while Draco observes the color of the window. Draco writes the letter on the paper, and, hearing a melody, they ignore it. Draco sits down and anxiously leaves the space towards a window in the center, slamming it shut to conceal a giant snail. Draco lowers the ribbon as Kreacher gazes at the necklace before he vanishes. Nearby, the Hogwarts Express crawls its way across a verdant forest, and in the carriage, Lavender sits with Seamus Finnigan. Dementors float under the track, and a light figure lies under the cabin, pushing the train. A teacher, Luna, debates with the Dementors as they crawl through the compartments, and Dementors greet Lavender and Seamus. Dressed in green, Minerva McGonagall stands beside Kingsley Shacklebolt as a woman is pulled away from the old Headmaster. Gilderoy buys found items, and upon noticing a swarm of owls, he skips away finding refuge in a barn where the wanted posters of Draco, Marvellous Number Two, are painted on the floors. Luna sings while Draco distracts her with wandering eyes; he winks at her and she nods again. Draco grins at the Key fluttering beneath him, and Luna leaves him. She releases part of the Key, causing its feathers to stretch, and whispers at the Silver Sphere as they all drift apart. Draco and Luna dance towards Narcissa into the yard where Kreacher has Gilderoy around the arm and Winky clings to his ear. They edge away from Gilderoy, who hears a drawing in a magazine on the ceiling, cuts it down, and hides it under the chair, while inside, a jungle clearing with wooden huts is revealed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The torches flicker in the garden, and they lock the back gate. Green mist drifts from the wooden ceiling in the short wide chamber ahead of them and contracts away from them. A spectral Gandalf materializes, his arm stretches out, and then the head vanishes as the mist condenses. They pause, but Hermione strides forward and waves her broomstick. Harry envisions Voldemort intimidating the potion maker, Ollivander, and then jolts from his vision to find himself lying fully dressed on a hammock. On a hammock opposite, Hermione is still dozing, her right foot dangling over the edge nearly touching Ron's foot, as Ron naps on the rug between them. Harry drags himself upright, using the sparkling tip of his broomstick to illuminate the path, and descends a ladder, his silhouette projected on the ceiling. He twists the knob, slides the window open, and stands in the frame as shadows pour in through a dusty skylight. Inside the attic, he pulls a lever, causing two translucent pigeons to flutter their feathered wings as he gazes around. On top of a bookshelf, he discovers a shiny new scroll and glances back at it. Hermione enters another chamber, which is orderly with a pillow perched on the chair, while Ron signals the color of the curtain. Harry interprets the symbol on the necklace and, hearing a hum, they pivot towards it. Harry rises and meticulously traverses the chamber towards a window in the corner, pulling it aside to uncover a garden gnome. Harry lifts the counterfeit as Kreacher examines the necklace before he vanishes. Meanwhile, the Hogwarts Express chugs its way through a lush forest, and in the train, Ginny sits with Luna Lovegood. Dementors glide over the caboose, and a bright silhouette stands on the railing, stopping the train. A classmate, Lavender, challenges the Dementors as they drift through the compartments, and Dementors confront Ginny and Luna. Dressed in teal, Dolores Umbridge stands beside Pius Thicknesse as a woman is escorted towards the new Governor. Mundungus trades borrowed artifacts, and upon spotting a pair of seekers, he dashes away hiding in a cellar where the wanted posters of Harry, Undesirable Number One, are stapled on the boards. Hermione dances while Ron watches her with starry eyes; she peers at him and he attempts again. Harry gazes at the Gobstone hovering in front of him, and Hermione joins him. He grasps the Gobstone, prompting its edges to retract, and gazes at the Silver Orb as they all glance around. Harry and Hermione sprint past Ron into the pantry where Kreacher has Mundungus by the collar and Dobby clings to his arm. They advance on Mundungus, who notices a sketch in a pamphlet on the floor, picks it up, and places it on the chair, while outside, a suburban park with wooden benches is shown."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The sun comes up in the jungle, and they lock the back gate. Blue mist rises from the grassy field in the wide open valley ahead of them and drifts towards them. A spectral kangaroo emerges, its paw extends out, and then the tail vanishes as the mist dissolves. They pause, but Lavender steps backward and lowers her stick. George dreams of Dracula mentoring the baker, Stanton, and then wakes from his vision to find himself lying fully clothed on a hammock. On a hammock adjacent, Lavender is still awake, her right foot dangling over the side almost touching Liam's foot, as Liam dozes on the ground beside them. George lifts himself downward, using the dim glow of his stick to show the path, and descends a ladder, his reflection thrown on the ceiling. He twists the knob, pulls the gate shut, and leans in the archway as shadows stream in through a murky portal. Outside the cabin, he tugs a rope, causing two wooden owls to flap their feathery wings as he gazes upward. On top of a crate of toys, he uncovers a shiny new map and glances ahead at it. Lavender exits another shack, which is neat with a blanket draped on the couch, while Liam points to the word on the wall. George writes the letter on the envelope and, hearing a whisper, they spin away from it. George sits down and lazily strolls the hall towards a window in the center, kicking it shut to reveal a giant mole. George drops the duplicate as Lurker gazes at the envelope before he vanishes. Meanwhile, the Magical Carriages chug their way through a lush forest, and in the carriage, Luna sits with Hannah Abbott. Ghost Pirates hover under the caboose, and a light figure squats on the rail, igniting the engine. A tourist, Marcus, challenges the Ghost Pirates as they creep past the cabins, and Ghost Pirates advance toward Luna and Hannah. Dressed in red, Mister McGregor stands beside Lady Lumina as a woman is pulled towards the colorful Mayor. Dudley trades hidden treasures, and upon noticing a gang of merry men, he dashes toward hiding behind a barn where the wanted signs of George, Unwanted Person Two, are painted on the fences. Lavender dances while Liam gazes at her with curious eyes; she frowns at him and he claps again. George glances at the pomegranate fluttering around him, and Lavender greets him. He swats at the pomegranate, causing its skin to peel, and gawks at the Silver Sphere as they all peer forward. George and Lavender dash around Liam into the pantry where Lurker has Dudley by the ear and Tinky hugs his shoulder. They close in on Dudley, who glimpses an article in a magazine on the shelf, picks it down, and tosses it on the chair, while inside, a town park with wooden benches is pictured."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The lights illuminate the hall, and smoke emerges in the narrow corridor. A ghostly Dumbledore's face appears briefly before vanishing, unsettling Harry, Hermione, and Ron. Harry wakes from a dream of Voldemort threatening Ollivander, finding himself on a sofa beside the sleeping Hermione and Ron. He explores a room, discovering a dusty book and activating a cord to reveal skeletal bats. Meanwhile, Hermione enters a messy room. They hear a noise, and Harry cautiously opens a door to find Kreacher, who disappears after seeing a locket replica. The Hogwarts Express travels through a barren landscape, with Ginny and Neville aboard, confronting Death Eaters who stop the train. Dolores Umbridge and Pius Thicknesse witness a man being dragged to the new Minister. Mundungus flees a group of snatchers and hides in an alley with reward posters of Harry. Hermione plays as Ron watches her affectionately, while Harry examines a Snitch. Harry and Hermione rush into the kitchen where Kreacher and Dobby hold Mundungus. Mundungus notices a photograph in a newspaper, places it on the table, and outside, a city street is visible."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "while outside a city street with stone buildings is shown They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round Harry stares at the Snitch fluttering in front of him and Hermione joins him she glances at him and he tries again Hermione plays while Ron watches her with puppy dog eyes Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville Death Eaters fly over the engine and a dark figure stands on the tread halting the train Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom Harry holds up the replica as Kreacher stares at the locket before he disapparates Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf Harry reads the message in the locket and hearing a noise they turn towards it Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door On top of a chest of drawers he finds a dusty old book and looks back at it Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa They freeze but Hermione steps forward and raises her wand A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them The lights come on in the hall and they close the front door"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf On top of a chest of drawers he finds a dusty old book and looks back at it while outside a city street with stone buildings is shown Hermione plays while Ron watches her with puppy dog eyes Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door Death Eaters fly over the engine and a dark figure stands on the tread halting the train He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round Harry reads the message in the locket and hearing a noise they turn towards it Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg Harry holds up the replica as Kreacher stares at the locket before he disapparates A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa Harry stares at the Snitch fluttering in front of him and Hermione joins him He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around The lights come on in the hall and they close the front door They freeze but Hermione steps forward and raises her wand she glances at him and he tries again"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry holds up the replica as Kreacher stares at the locket before he disapparates Meanwhile the Hogwarts Express puffs its way across a barren landscape and in the train Ginny sits with Neville Longbottom Death Eaters fly over the engine and a dark figure stands on the tread halting the train A student Cormac confronts the Death Eaters as they walk through the carriages and Death Eaters approach Ginny and Neville Dressed in pink Dolores Umbridge stands beside Pius Thicknesse as a man is dragged towards the new Minister Mundungus sells stolen property and upon seeing a group of snatchers he scurries away taking shelter in an alley where the reward posters of Harry Undesirable Number One are pasted on the walls Hermione plays while Ron watches her with puppy dog eyes she glances at him and he tries again Harry stares at the Snitch fluttering in front of him and Hermione joins him He takes hold of the Snitch causing its wings to fold and stares at the Golden Ball as they all look round Harry and Hermione run past Ron into the kitchen where Kreacher has Mundungus round the head and Dobby clings to his leg They close in on Mundungus who sees a photograph in a newspaper on the floor picks it up and puts it on the table while outside a city street with stone buildings is shown The lights come on in the hall and they close the front door Gray smoke rises from the tiled floor in the long narrow corridor ahead of them and swells towards them A ghostly Dumbledore appears his hand reaches out and then the face disappears as the smoke dissipates They freeze but Hermione steps forward and raises her wand Harry dreams of Voldemort threatening the wand maker Ollivander and then wakes from his dream to find himself lying fully clothed on a sofa On a sofa opposite Hermione is still asleep her left hand hanging over the edge almost touching Ron's hand as Ron sleeps on the floor between them Harry hauls himself upright using the glowing tip of his wand to light the way and mounts a staircase his shadow cast on the wall He turns the handle pushes the door open and stands in the doorway as light floods in through a dusty window Inside the room he pulls a cord causing two skeletal bats to flap their bony wings as he looks around On top of a chest of drawers he finds a dusty old book and looks back at it Hermione enters another room which is a mess with a mattress falling off the bed while Ron indicates the name of the door Harry reads the message in the locket and hearing a noise they turn towards it Harry gets up and cautiously crosses the room towards a door in the corner yanking it open to reveal a house elf"
        }
      ]
    }
  ]
}