{
  "ground_truth": "Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, it crashes closed in front of him, and the hedges on either side grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots. Harry points his wand upwards, and high above, red sparks explode in the evening sky. A howling wind lashes the branches, sending dust and leaves into the air. Harry starts to run as the hedges start to close together behind him, diving head first through a closing gap and landing on the ground. Harry sees a bright object in the distance, and heading towards it, he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his hand, and raising his own wand. Harry stops him, but Cedric pushes him off and starts to run, with Harry following. They jostle for position, grabbing each other by the shirt, pulling each other's back, fighting each other off, and they see the trophy. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric, and Harry surges past, then stops and looks back. Cedric is dragged backwards, tangled in the roots and branches of the hedge, struggling in vain to escape as the sinuous roots have twined around his neck, strangling him. Harry looks at the gleaming trophy and back at Cedric, and as he points his wand, the roots and branches loosen their hold.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Cedric has arrived in via another entry, and as bewildered as Harry, he sprints along the slim tracks between the neatly trimmed hedges, halting unsure of which way to proceed, before selecting a route. As he progresses forward, it slams shut ahead of him, and the hedges on either flank grow together, enclosing him in. He forces his route through the dense boughs as they close in around him, lashing him across the visage. Meanwhile, Viktor trudges along in his steady boots, wielding his wand, and Harry spins around as he perceives a noise behind him. Viktor's eyes are glazed over. Fleur races frantically between the hedges, arrives at a dead end, panics, races back the way she arrived, and, with her visage clammy with trepidation, she gazes uncertainly down the misty path. Hearing something behind her, she turns, and Harry perceives her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from beneath the hedge. Harry sprints in the direction of the scream, peers through the swirling haze, and spots Viktor. Harry withdraws into the hedge as Viktor illuminates the end of his wand directly into Harry's visage, but, as Viktor's eyes are clouded over and he fails to perceive Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a snarl of sinuous roots. Harry points his wand upwards, and high above, crimson sparks erupt in the evening sky. A howling gale lashes the boughs, sending grit and foliage into the air. Harry starts to dash as the hedges start to close together behind him, diving head first through a closing gap and landing on the ground. Harry sees a bright item in the distance, and heading towards it, he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his grasp, and raising his own wand. Harry stops him, but Cedric shoves him off and starts to dash, with Harry pursuing. They jostle for position, clutching each other by the shirt, pulling each other's back, fighting each other off, and they see the trophy. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric, and Harry surges past, then halts and looks back. Cedric is drawn backwards, entangled in the roots and boughs of the hedge, struggling futilely to escape as the sinuous roots have twined around his neck, choking him. Harry looks at the gleaming trophy and back at Cedric, and as he points his wand, the roots and boughs loosen their hold."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Cedric has come in through another entrance, and as confused as Harry, he runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he is moved forward by him, it crashes closed in front of him, and the hedges on either side are grown together, hemming him in. He forces his way through the dense branches as they are closed in around him, lashing him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his wand, and Harry spins around as he hears a sound behind him. A glaze is in Viktor's eyes. The hedges are run frantically between by Fleur, a dead end is reached, panic overtakes her, she runs back the way she came, and, with her face clammy with fear, the misty pathway is stared down uncertainly by her. Hearing something behind her, she turns, and Harry hears her scream. Fleur, who lies on the ground, is leaned over by Viktor, staring slightly, and he looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, and spots Viktor. Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes cloud over and Harry is not seen by him, Viktor passes by. Fleur is searched for by Harry, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots. Harry points his wand upwards, and high above, red sparks are exploded in the evening sky by him. The branches are lashed by a howling wind, sending dust and leaves into the air. The hedges are started to close together behind him, and Harry starts to run, diving head first through a closing gap and landing on the ground. A bright object is seen by Harry in the distance, and heading towards it, he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his hand, and raising his own wand. Harry stops him, but Cedric pushes him off and starts to run, with Harry following. They jostle for position, grabbing each other by the shirt, pulling each other's back, fighting each other off, and the trophy is seen by them. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams through the mist. Cedric is tripped by the roots that reach out, and Harry surges past, then stops and looks back. Cedric is dragged backwards, tangled in the roots and branches of the hedge, struggling in vain to escape as the sinuous roots have twined around his neck, strangling him. The gleaming trophy and back at Cedric are looked at by Harry, and as he points his wand, the roots and branches are loosened in their hold."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Cedric enters through another entrance, as confused as Harry, and runs along narrow paths between neatly clipped hedges. He stops, unsure of which way to go, then chooses a path. As he moves forward, it closes in front of him, and the hedges grow together, trapping him. He forces through dense branches that lash his face. Meanwhile, Viktor plods steadily with his wand, and Harry spins around at a sound behind him. Viktor's eyes are glazed. Fleur runs frantically, reaches a dead end, panics, and runs back, her face clammy with fear. Hearing something, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, and looks up with cloudy eyes. Sinuous roots creep towards Fleur. Harry runs toward the scream, peers through mist, and spots Viktor. Harry retreats as Viktor shines his wand's light into Harry's face but doesn't see him and passes by. Harry searches for Fleur, and as he reaches her, she vanishes, drawn under the hedge by roots. Harry points his wand upwards, and red sparks explode in the sky. A howling wind lashes branches, sending dust and leaves into the air. Harry runs as hedges close behind him, diving through a gap and landing on the ground. He sees a bright object and emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand away, and raising his own wand. Harry stops him, but Cedric pushes him off and runs, with Harry following. They jostle for position, grabbing and pulling each other, and see the trophy. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams through the mist. Roots trip Cedric, and Harry surges past, then stops and looks back. Cedric is dragged backward, tangled in roots and branches, struggling as roots twine around his neck. Harry looks at the trophy and back at Cedric, and as he points his wand, the roots and branches loosen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Cedric enters through another entrance, confused like Harry, and runs along narrow paths between clipped hedges, unsure of which way to go. As he moves forward, the path closes, and the hedges grow together, trapping him. He forces through dense branches that lash his face. Viktor plods steadily with his wand, and Harry spins at a sound behind him. Viktor's eyes are glazed. Fleur runs frantically, reaches a dead end, panics, and runs back, staring uncertainly down the misty path. Hearing something, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, and looks up with cloudy eyes. Roots creep towards Fleur. Harry runs towards the scream, spots Viktor, and hides as Viktor's wand light misses him. Harry searches for Fleur, but she vanishes under the hedge. He sends red sparks into the sky. A howling wind lashes branches, and Harry dives through a closing gap. He sees a bright object and emerges between Cedric and Viktor. Cedric knocks Viktor unconscious, but Harry stops him. Cedric pushes Harry and runs, with Harry following. They jostle for position and see the trophy. Cedric is tripped by roots, and Harry surges past, then stops. Cedric is tangled in roots, struggling as they strangle him. Harry looks at the trophy, then back at Cedric, and loosens the roots with his wand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Cedric has entered through a different entrance, and just as bewildered as Harry, he dashes along the narrow, winding paths that snake between the neatly clipped hedges. He pauses, uncertain and hesitant about which direction to take, before finally deciding on a path. As he advances, the path suddenly crashes closed right in front of him, and the hedges on either side grow together rapidly, hemming him in tightly. He struggles to force his way through the dense, interlocking branches as they close in around him, lashing him painfully across the face. Meanwhile, Viktor trudges along steadily in his sturdy boots, carrying his wand with determination, while Harry spins around abruptly as he hears a noise behind him. Viktor's eyes appear glazed over, lacking focus. Fleur, in a state of panic, runs frantically between the hedges, only to reach a dead end. She panics, retracing her steps, and with her face clammy with fear, she stares uncertainly down the misty, obscured pathway. Hearing something behind her, she turns quickly, and Harry hears her scream piercing the air. Viktor leans over Fleur, who lies on the ground, staring blankly, and he looks up with his eyes clouded and unfocused. Sinuous roots creep menacingly towards Fleur from beneath the hedge. Harry dashes in the direction of the scream, peers through the swirling mist, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand directly into Harry's face, but since Viktor's eyes are clouded over, he fails to see Harry and passes by without noticing him. Harry searches frantically for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous, creeping roots. Harry points his wand upwards, and high above, red sparks explode brilliantly in the evening sky. A howling wind lashes the branches, sending dust and leaves swirling into the air. Harry starts to run as the hedges begin to close together ominously behind him, diving headfirst through a rapidly closing gap and landing heavily on the ground. Harry sees a bright object gleaming in the distance, and heading towards it, he emerges onto a path situated between Cedric and Viktor. Harry drops to the ground as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his hand, and raising his own wand with intent. Harry stops him, but Cedric pushes him off forcefully and starts to run, with Harry following closely behind. They jostle for position, grabbing each other by the shirt, pulling each other's backs, fighting each other off with determination, and they see the trophy ahead. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams enticingly through the mist. The roots reach out and trip Cedric, and Harry surges past, then stops and looks back. Cedric is dragged backwards, entangled in the roots and branches of the hedge, struggling desperately in vain to escape as the sinuous roots have twined around his neck, strangling him. Harry looks at the gleaming trophy and then back at Cedric, and as he points his wand, the roots and branches begin to loosen their hold."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Cedric has entered through a different entrance, and just as bewildered as Harry, he rapidly dashes along the narrow, winding paths that snake intricately between the meticulously clipped hedges. He comes to a halt, standing uncertain and hesitant, unsure of which direction to take next, before finally making a decision and choosing a path. As he continues forward, the path abruptly crashes closed right before him, and the hedges on either side grow together rapidly, hemming him in tightly. He struggles, trying with all his might to force his way through the dense, interlocking branches that close in menacingly around him, lashing him painfully across the face. Meanwhile, Viktor trudges along steadily, his sturdy boots crunching the ground beneath him as he carries his wand with determination, while Harry spins around abruptly upon hearing a noise behind him. Viktor's eyes appear glazed over, lacking any focus or awareness. Fleur, caught in a state of panic, runs frantically between the towering hedges, only to reach a sudden dead end. She panics further, retracing her steps quickly, her face clammy and slick with fear as she stares uncertainly down the misty, obscured pathway. Hearing something behind her, she turns swiftly, and Harry hears her scream piercing the otherwise silent air. Viktor leans over Fleur, who lies on the ground, staring blankly, and he looks upwards with his eyes clouded and unfocused. Sinuous roots creep menacingly towards Fleur from beneath the hedge, moving with a sinister purpose. Harry dashes in the direction from which the scream came, peering intently through the swirling mist, and he spots Viktor's familiar figure. Harry draws back into the shelter of the hedge as Viktor shines the lighted end of his wand directly into Harry's face, but since Viktor's eyes are clouded over, he fails to see Harry and passes by, oblivious to his presence. Harry searches frantically for Fleur, and just as he reaches her, she vanishes from sight, drawn helplessly under the hedge by a tangle of sinuous, creeping roots. Harry points his wand upwards, and high above, red sparks explode brilliantly in the evening sky, casting an eerie glow. A howling wind lashes the branches violently, sending dust and leaves swirling chaotically into the air. Harry starts to run as the hedges begin to close together ominously behind him, diving headfirst through a rapidly closing gap and landing heavily on the ground with a thud. Harry sees a bright object gleaming alluringly in the distance, and heading towards it with determination, he emerges onto a path situated conveniently between Cedric and Viktor. Harry drops to the ground precipitously as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his hand, and raising his own wand with clear intent. Harry stops him, but Cedric pushes him off forcefully and starts to run, with Harry following closely behind, determined to keep up. They jostle for position, grabbing each other by the shirt, pulling each other's backs, fighting each other off with fierce determination, and they see the trophy ahead, gleaming invitingly. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy gleams enticingly through the mist. The roots reach out deviously and trip Cedric, and Harry surges past, then stops abruptly and looks back. Cedric is dragged backwards, entangled helplessly in the roots and branches of the hedge, struggling desperately in vain to escape as the sinuous roots have twined tightly around his neck, strangling him. Harry looks at the gleaming trophy, a beacon of success, and then back at Cedric, and as he points his wand with resolve, the roots and branches begin to loosen their fierce hold."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Cedric enters through an alternate entrance, mirroring Harry's confusion, and begins to run along the narrow paths bordered by neatly clipped hedges. He halts, uncertain of which direction to take, before making a decision and choosing a path. As he advances, the path abruptly closes in front of him, and the hedges on either side grow together, trapping him. He struggles to push through the dense branches that close in around him, their twigs lashing against his face. Meanwhile, Viktor moves steadily along, his boots making a rhythmic sound as he carries his wand. Harry, hearing a noise behind him, spins around to see Viktor, whose eyes are glazed over. Fleur, in a state of panic, runs frantically between the hedges, only to reach a dead end. She panics, retraces her steps, and with her face clammy with fear, she stares uncertainly down the misty pathway. Upon hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and he looks up with his eyes clouded. Sinuous roots begin to creep towards Fleur from beneath the hedge. Harry, hearing the scream, runs in its direction, peers through the swirling mist, and spots Viktor. He quickly draws back into the hedge as Viktor shines the lighted end of his wand directly into Harry's face. However, Viktor's clouded eyes fail to see Harry, allowing him to pass by unnoticed. Harry searches for Fleur, and as he reaches her, she vanishes from sight, pulled under the hedge by a tangle of sinuous roots. Harry points his wand upwards, and high above, red sparks explode in the evening sky. A howling wind lashes the branches, sending dust and leaves swirling into the air. Harry begins to run as the hedges start to close together behind him, diving headfirst through a closing gap and landing on the ground. He spots a bright object in the distance and, heading towards it, emerges onto a path between Cedric and Viktor. Harry drops to the ground as Cedric aims his wand at Viktor, knocking him unconscious, kicking Viktor's wand from his hand, and raising his own wand. Harry intervenes to stop him, but Cedric pushes him off and starts to run, with Harry following closely. They jostle for position, grabbing each other by the shirt, pulling each other back, and fighting each other off as they catch sight of the trophy. They sprint forward, with Cedric slightly ahead, and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric, causing Harry to surge past, but he stops and looks back. Cedric is being dragged backward, entangled in the roots and branches of the hedge, struggling in vain to escape as the sinuous roots twine around his neck, strangling him. Harry glances at the gleaming trophy and then back at Cedric, and as he points his wand, the roots and branches begin to loosen their hold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Cedric enters through another entrance, confused like Harry, and navigates the narrow paths between the hedges, hesitating before choosing a direction. As he proceeds, the path closes in front of him, and the hedges constrict around him. He pushes through the dense branches, which lash his face. Meanwhile, Viktor steadily advances with his wand, and Harry spins around at a sound behind him, noticing Viktor's glazed eyes. Fleur frantically runs between the hedges, hits a dead end, panics, and retreats, her face clammy with fear. Hearing something, she turns, screams, and Viktor, with cloudy eyes, leans over her as she lies on the ground. Sinuous roots creep towards her. Harry rushes toward the scream, spots Viktor through the mist, and retreats as Viktor's wand light passes over him without noticing. Harry searches for Fleur, but she vanishes, pulled under the hedge by roots. He sends red sparks into the sky, and as a howling wind stirs the branches, he runs, diving through a closing gap. Spotting a bright object, he emerges onto a path with Cedric and Viktor. Cedric knocks Viktor unconscious, kicks his wand away, and raises his own wand, but Harry intervenes. Cedric pushes him off and runs, with Harry following. They jostle for position, fighting each other off, and spot the trophy. Sprinting forward, Cedric is slightly ahead when roots trip him. Harry surges past, then stops and looks back as Cedric is dragged by roots, struggling as they strangle him. Harry looks between the trophy and Cedric, and with a wave of his wand, the roots and branches release their hold."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Cedric, who had entered through an unfamiliar entrance meant to confuse participants, has come in through another entrance, and as confused as Harry, he runs along the narrow paths of the Triwizard Maze, a complex and magical labyrinth filled with dangers, between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As he moves forward, the path, enchanted to test his resolve, crashes closed in front of him, and the hedges on either side, enchanted to change and trap, grow together, hemming him in. He forces his way through the dense branches as they close in around him, lashing him across the face. Meanwhile, Viktor, the renowned Bulgarian Quidditch player, plods along in his steady boots designed for rough terrain, carrying his wand, and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over due to a Bewitched state that affects his judgment. Fleur, a competitor known for her skill in magical charms, runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, perhaps a creature lurking in the maze, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots, possibly from a magical plant like Devil's Snare, creep towards Fleur from under the hedge. Harry runs in the direction of the scream, peers through the swirling mist, enchanted to disorient, and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots. Harry points his wand upwards, and high above, red sparks explode in the evening sky, a signal used by champions in distress. A howling wind, summoned by the maze's enchantments to add chaos, lashes the branches, sending dust and leaves into the air. Harry starts to run as the hedges start to close together behind him, diving head first through a closing gap and landing on the ground. Harry sees a bright object in the distance, recognizing it as his goal, and heading towards it, he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor, knocking him unconscious with a stunning spell, kicking Viktor's wand from his hand, and raising his own wand. Harry stops him, but Cedric pushes him off and starts to run, with Harry following. They jostle for position, grabbing each other by the shirt, pulling each other's back, fighting each other off, and they see the coveted trophy. They sprint forward, Cedric slightly ahead, and the Triwizard Trophy, a magical portkey, gleams through the mist. The roots, perhaps alive and enchanted to challenge participants, reach out and trip Cedric, and Harry surges past, then stops and looks back. Cedric is dragged backwards, tangled in the roots and branches of the hedge, struggling in vain to escape as the sinuous roots have twined around his neck, strangling him. Harry looks at the gleaming trophy and back at Cedric, and as he points his wand, the roots and branches, responsive to his magical intervention, loosen their hold."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path  As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in  He forces his way through the dense branches as they close in around him lashing him across the face  Harry runs in the direction of the scream peers through the swirling mist and spots Viktor  Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by  Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots  Harry points his wand upwards and high above red sparks explode in the evening sky  A howling wind lashes the branches sending dust and leaves into the air  Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground  Harry sees a bright object in the distance and heading towards it  he emerges onto a path between Cedric and Viktor  Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand  Harry stops him but Cedric pushes him off and starts to run with Harry following  They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy  They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist  The roots reach out and trip Cedric and Harry surges past then stops and looks back  Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him  Viktor's eyes are glazed over  Fleur runs frantically between the hedges reaches a dead end  panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway  Hearing something behind her she turns and Harry hears her scream  Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy  Sinuous roots creep towards Fleur from under the hedge  Harry runs in the direction of the scream peers through the swirling mist and spots Viktor  Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by  Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots  Harry points his wand upwards and high above red sparks explode in the evening sky  A howling wind lashes the branches sending dust and leaves into the air  Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground  Harry sees a bright object in the distance and heading towards it  he emerges onto a path between Cedric and Viktor  Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand  Harry stops him but Cedric pushes him off and starts to run with Harry following  They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy  They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist  The roots reach out and trip Cedric and Harry surges past then stops and looks back  Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him  Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path. As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in. He forces his way through the dense branches as they close in around him lashing him across the face. Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges reaches a dead end. panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway. Hearing something behind her she turns and Harry hears her scream. Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream peers through the swirling mist and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots. Harry points his wand upwards and high above red sparks explode in the evening sky. A howling wind lashes the branches sending dust and leaves into the air. Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground. Harry sees a bright object in the distance and heading towards it. he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand. Harry stops him but Cedric pushes him off and starts to run with Harry following. They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy. They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric and Harry surges past then stops and looks back. Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him. Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path. As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in. He forces his way through the dense branches as they close in around him lashing him across the face. Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges reaches a dead end. panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway. Hearing something behind her she turns and Harry hears her scream. Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy. Sinuous roots creep towards Fleur from under the hedge. Harry runs in the direction of the scream peers through the swirling mist and spots Viktor. Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots. Harry points his wand upwards and high above red sparks explode in the evening sky. A howling wind lashes the branches sending dust and leaves into the air. Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground. Harry sees a bright object in the distance and heading towards it. he emerges onto a path between Cedric and Viktor. Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand. Harry stops him but Cedric pushes him off and starts to run with Harry following. They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy. They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric and Harry surges past then stops and looks back. Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him. Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path. As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in. He forces his way through the dense branches as they close in around him lashing him across the face. Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him. Viktor's eyes are glazed over. Fleur runs frantically between the hedges reaches a dead end. Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand. Harry stops him but Cedric pushes him off and starts to run with Harry following. They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy. They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist. The roots reach out and trip Cedric and Harry surges past then stops and looks back. Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him. Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path. As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in. The roots reach out and trip Cedric and Harry surges past then stops and looks back. Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him. Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Geraldine has come in through another entrance, and as confused as Nancy, she runs along the narrow paths between the neatly clipped hedges, stopping uncertain of which way to go, before choosing a path. As she moves forward, it crashes closed in front of her, and the hedges on either side grow together, hemming her in. She forces her way through the dense branches as they close in around her, lashing her across the face. Meanwhile, Trevor plods along in his steady boots, carrying his wand, and Nancy spins around as she hears a sound behind her. Trevor's eyes are glazed over. Penelope runs frantically between the hedges, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the misty pathway. Hearing something behind her, she turns, and Nancy hears her scream. Trevor leans over Penelope, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous roots creep towards Penelope from under the hedge. Nancy runs in the direction of the scream, peers through the swirling mist, and spots Trevor. Nancy draws back into the hedge as Trevor shines the lighted end of his wand straight into Nancy's face, but, as Trevor's eyes are clouded over and he fails to see Nancy, he passes by. Nancy searches for Penelope, and as she reaches her, she vanishes from sight, drawn under the hedge by a tangle of sinuous roots. Nancy points her wand upwards, and high above, red sparks explode in the evening sky. A howling wind lashes the branches, sending dust and leaves into the air. Nancy starts to run as the hedges start to close together behind her, diving head first through a closing gap and landing on the ground. Nancy sees a bright object in the distance, and heading towards it, she emerges onto a path between Geraldine and Trevor. Nancy drops as Geraldine aims her wand at Trevor, knocking him unconscious, kicking Trevor's wand from his hand, and raising her own wand. Nancy stops her, but Geraldine pushes her off and starts to run, with Nancy following. They jostle for position, grabbing each other by the shirt, pulling each other's back, fighting each other off, and they see the trophy. They sprint forward, Geraldine slightly ahead, and the Triwizard Trophy gleams through the mist. The roots reach out and trip Geraldine, and Nancy surges past, then stops and looks back. Geraldine is dragged backwards, tangled in the roots and branches of the hedge, struggling in vain to escape as the sinuous roots have twined around her neck, strangling her. Nancy looks at the gleaming trophy and back at Geraldine, and as she points her wand, the roots and branches loosen their hold."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Cedric has come in through another gateway, and as confused as Harry, he runs along the narrow corridors between the neatly arranged statues, stopping uncertain of which way to go, before choosing a route. As he moves forward, it shutters closed in front of him, and the statues on either side slide together, trapping him in. He forces his way through the dense sculptures as they close in around him, slapping him across the face. Meanwhile, Viktor plods along in his steady boots, carrying his scepter, and Harry spins around as he hears a noise behind him. Viktor's eyes are glazed over. Fleur runs frantically between the statues, reaches a dead end, panics, runs back the way she came, and, with her face clammy with fear, she stares uncertainly down the foggy corridor. Hearing something behind her, she turns, and Harry hears her scream. Viktor leans over Fleur, who lies on the ground, staring slightly, and looks up with his eyes cloudy. Sinuous vines creep towards Fleur from under the statue. Harry runs in the direction of the scream, peers through the swirling fog, and spots Viktor. Harry draws back into the statue as Viktor shines the beaming tip of his scepter straight into Harry's face, but, as Viktor's eyes are clouded over and he fails to see Harry, he passes by. Harry searches for Fleur, and as he reaches her, she vanishes from sight, drawn under the statue by a tangle of sinuous vines. Harry points his scepter upwards, and high above, red fireworks explode in the evening sky. A howling wind lashes the sculptures, sending sand and petals into the air. Harry starts to run as the statues start to slide together behind him, diving head first through a closing gap and landing on the ground. Harry sees a bright figure in the distance, and heading towards it, he emerges onto a corridor between Cedric and Viktor. Harry drops as Cedric aims his scepter at Viktor, knocking him unconscious, kicking Viktor's scepter from his hand, and raising his own scepter. Harry stops him, but Cedric pushes him off and starts to run, with Harry following. They jostle for position, grabbing each other by the jacket, pulling each other's back, fighting each other off, and they see the chalice. They sprint forward, Cedric slightly ahead, and the Triwizard Chalice gleams through the fog. The vines reach out and trip Cedric, and Harry surges past, then stops and looks back. Cedric is dragged backwards, tangled in the vines and branches of the statue, struggling in vain to escape as the sinuous vines have twined around his neck, strangling him. Harry looks at the gleaming chalice and back at Cedric, and as he points his scepter, the vines and branches loosen their hold."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Cedric has wandered in through another entrance, and as puzzled as Harry, he skips along the narrow paths between the neatly clipped hedges, pausing uncertain of which way to go, before electing a path. As he leaps forward, it swings closed in front of him, and the hedges on either side sway together, enclosing him in. He squeezes his way through the dense branches as they curl in around him, brushing him across the face. Meanwhile, Viktor saunters along in his steady boots, brandishing his wand, and Harry twirls around as he perceives a sound behind him. Viktor's eyes are misted over. Fleur scurries frantically between the hedges, encounters a dead end, frets, dashes back the way she came, and, with her face clammy with fear, she gazes uncertainly down the misty pathway. Sensing something behind her, she pivots, and Harry hears her shout. Viktor huddles over Fleur, who lies on the ground, staring slightly, and glances up with his eyes cloudy. Sinuous roots slither towards Fleur from under the hedge. Harry bolts in the direction of the shout, glimpses through the swirling mist, and identifies Viktor. Harry ducks into the hedge as Viktor illuminates the end of his wand straight into Harry's face, but, as Viktor's eyes are clouded over and he neglects to see Harry, he advances by. Harry quests for Fleur, and as he arrives at her, she disappears from sight, tugged under the hedge by a tangle of sinuous roots. Harry directs his wand upwards, and high above, red sparks burst in the evening sky. A howling wind sweeps the branches, hurling dust and leaves into the air. Harry begins to dash as the hedges begin to squeeze together behind him, leaping head first through a closing gap and rolling on the ground. Harry views a bright object in the distance, and heading towards it, he emerges onto a path between Cedric and Viktor. Harry ducks as Cedric waves his wand at Viktor, staggering him unconscious, kicking Viktor's wand from his hand, and lifting his own wand. Harry halts him, but Cedric nudges him off and begins to sprint, with Harry tailing. They shove for position, clutching each other by the shirt, tugging each other's back, fending each other off, and they notice the trophy. They dash forward, Cedric slightly ahead, and the Triwizard Trophy shimmers through the mist. The roots reach out and snare Cedric, and Harry sweeps past, then halts and glances back. Cedric is hauled backwards, entangled in the roots and branches of the hedge, grappling in vain to escape as the sinuous roots have wrapped around his neck, constricting him. Harry glances at the shimmering trophy and back at Cedric, and as he brandishes his wand, the roots and branches relax their grip."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Timothy has come in through another portal, and as bewildered as Oliver, he sprints along the thin corridors between the carefully trimmed poles, stopping uncertain of which direction to head, before choosing a corridor. As he moves onward, it slams shut in front of him, and the poles on either side knit together, trapping him in. He forces his way through the thick vines as they close in around him, whipping him across the arm. Meanwhile, Ivan trundles along in his sturdy sandals, holding his book, and Oliver spins around as he hears a noise behind him. Ivan's toes are fogged over. Emily darts frantically between the poles, reaches a cul-de-sac, panics, runs back the way she came, and, with her expression sweaty with dread, she gazes uncertainly down the hazy hallway. Hearing something behind her, she turns, and Oliver hears her shriek. Ivan leans over Emily, who lies on the floor, gazing slightly, and looks up with his toes misty. Twisting vines snake towards Emily from beneath the pole. Oliver dashes in the direction of the shriek, peers through the swirling mist, and spots Ivan. Oliver draws back into the pole as Ivan beams the glowing tip of his book straight into Oliver's face, but, as Ivan's toes are misted over and he fails to perceive Oliver, he moves past. Oliver searches for Emily, and as he reaches her, she disappears from view, pulled under the pole by a tangle of twisting vines. Oliver directs his book skywards, and high above, orange fireworks explode in the twilight sky. A howling breeze batters the vines, sending sand and pebbles into the air. Oliver begins to sprint as the poles begin to close together behind him, diving head first through a closing gap and landing on the ground. Oliver sees a luminous creature in the distance, and heading towards it, he emerges onto a corridor between Timothy and Ivan. Oliver drops as Timothy aims his book at Ivan, rendering him unconscious, kicking Ivan's book from his grasp, and raising his own book. Oliver halts him, but Timothy shoves him off and begins to sprint, with Oliver trailing. They jostle for position, grabbing each other by the jacket, pulling each other's shoulder, battling each other off, and they spot the figurine. They dash forward, Timothy slightly ahead, and the Triwizard Figurine shines through the mist. The vines reach out and trip Timothy, and Oliver charges past, then stops and looks back. Timothy is dragged backwards, ensnared in the vines and tendrils of the pole, struggling in vain to break free as the twisting vines have wrapped around his ankle, binding him. Oliver looks at the shining figurine and back at Timothy, and as he points his book, the vines and tendrils loosen their grip."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sylvia has entered through an unexpected doorway, and as puzzled as Wendy, she tiptoes along the narrow paths between the meticulously trimmed hedges, pausing uncertainly which direction to head, before opting for a route. As she advances, it snaps shut in front of her, and the hedges on either side contract together, enclosing her. She pushes her way through the thick branches as they encircle her, swatting her across the cheeks. Meanwhile, Marcus trudges along in his reliable shoes, wielding his flashlight, and Wendy twirls around as she detects a rustle behind her. Marcus's eyes are fogged over. Clara dashes desperately between the hedges, hits a dead end, frets, rushes back the way she arrived, and, with her face damp with dread, she gazes hesitantly down the foggy pathway. Detecting a noise behind her, she spins, and Wendy catches her yell. Marcus stoops over Clara, who sprawls on the ground, gazing slightly, and glances up with his eyes misty. Serpentine vines slither towards Clara from beneath the hedge. Wendy bolts in the direction of the shout, peers through the swirling haze, and identifies Marcus. Wendy retreats into the hedge as Marcus directs the illuminated end of his flashlight straight into Wendy's face, but, as Marcus's eyes are misted over and he neglects to notice Wendy, he ambles by. Wendy scouts for Clara, and as she reaches her, she fades from view, pulled under the hedge by a mass of serpentine vines. Wendy points her flashlight upwards, and high above, crimson flares burst in the twilight sky. A wailing wind whips the branches, tossing dust and leaves into the air. Wendy begins to dash as the hedges begin to contract together behind her, diving headfirst through a sealing gap and landing on the earth. Wendy observes a luminous object in the distance, and heading towards it, she emerges onto a path between Sylvia and Marcus. Wendy crouches as Sylvia directs her flashlight at Marcus, rendering him unconscious, flicking Marcus's flashlight from his grip, and lifting her own flashlight. Wendy halts her, but Sylvia shoves her off and begins to sprint, with Wendy trailing. They hustle for position, clutching each other's shirts, yanking each other's back, combating each other off, and they spot the marionette. They dash forward, Sylvia marginally ahead, and the Triwizard Marionette glistens through the mist. The vines reach out and trip Sylvia, and Wendy surges past, then stops and glances back. Sylvia is dragged backwards, ensnared in the vines and branches of the hedge, striving fruitlessly to break free as the serpentine vines have coiled around her neck, constricting her. Wendy gazes at the glistening marionette and back at Sylvia, and as she points her flashlight, the vines and branches ease their grip."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Cedric has come in through another doorway, and as confused as Harry, he glides along the narrow tracks between the roughly stacked stone walls, pausing uncertain of which way to proceed, before selecting a trail. As he drifts forward, it slams closed in front of him, and the walls on either side fuse together, trapping him inside. He squeezes his way through the thick vines as they close in around him, brushing against him across the face. Meanwhile, Viktor shuffles along in his worn sandals, holding his staff, and Harry twirls around as he hears a whisper behind him. Viktor's eyes are veiled. Fleur dashes wildly between the walls, reaches a dead end, freezes, rushes back the way she came, and, with her face slick with fear, she gapes uncertainly down the cloudy corridor. Hearing something behind her, she pivots, and Harry hears her wail. Viktor crouches over Fleur, who lies on the ground, blinking slowly, and looks up with his eyes misty. Twisting tendrils wind towards Fleur from beneath the wall. Harry sprints in the direction of the wail, gazes through the swirling fog, and spots Viktor. Harry recoils into the wall as Viktor illuminates the fiery tip of his staff straight into Harry's eyes, but, as Viktor's eyes are fogged over and he fails to notice Harry, he strides past. Harry searches for Fleur, and as he reaches her, she vanishes from sight, pulled beneath the wall by a mesh of twisting tendrils. Harry points his staff upwards, and high above, golden flares burst in the twilight sky. A howling gale whips the vines, sending pebbles and dirt into the air. Harry starts to dash as the walls start to close together behind him, diving head first through a closing narrow opening and landing on the earth. Harry spots a glistening figure in the distance, and heading towards it, he emerges onto a trail between Cedric and Viktor. Harry drops as Cedric directs his staff at Viktor, stunning him, kicking Viktor's staff from his grasp, and lifting his own staff. Harry halts him, but Cedric shoves him aside and starts to race, with Harry trailing. They scuffle for position, clutching each other by the collar, tugging each other's backs, warding each other off, and they see the trophy. They dash forward, Cedric slightly ahead, and the Triwizard Trophy gleams through the fog. The tendrils extend and trip Cedric, and Harry strides past, then pauses and looks back. Cedric is pulled backwards, ensnared in the tendrils and vines of the wall, thrashing uselessly to break free as the twisting tendrils have wound around his neck, choking him. Harry glances at the shimmering trophy and back at Cedric, and as he points his staff, the tendrils and vines slacken their grip."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Trevor has drifted through an alternate window, and as perplexed as Max, he dances along the narrow corridors between the perfectly polished statues, halting unsure of which direction to leap, before selecting a trail. As he drifts onward, it slams shut before him, and the statues on either side merge together, trapping him within. He squeezes his way through the tangled vines as they tighten around him, slapping him across the arm. Meanwhile, Oscar trudges along in his heavy sandals, brandishing his flute, and Max whirls around as he detects a whistle behind him. Oscar's eyes are glazed over. Lily skips frantically among the statues, finds a blockade, panics, retreats the way she entered, and, with her expression moist with anxiety, she gazes uncertainly down the foggy avenue. Sensing something behind her, she pivots, and Max hears her gasp. Oscar bends over Lily, who reclines on the earth, blinking softly, and glances upwards with his vision veiled. Sly vines slither towards Lily from beneath the statue. Max dashes towards the gasp, peers through the churning fog, and glimpses Oscar. Max withdraws into the statue as Oscar shines the glowing tip of his flute directly into Max's eyes, but, as Oscar's gaze is veiled and he fails to detect Max, he strolls past. Max searches for Lily, and as he encounters her, she dissolves from view, pulled beneath the statue by a snarl of sly vines. Max aims his flute upwards, and far above, orange embers burst in the twilight sky. A howling storm batters the vines, casting sand and petals into the air. Max begins to sprint as the statues begin to converge behind him, diving feet first through a narrowing gap and landing on the turf. Max notices a glistening entity in the expanse, and steering towards it, he emerges onto a corridor between Trevor and Oscar. Max collapses as Trevor directs his flute at Oscar, rendering him insensible, nudging Oscar's flute from his grip, and elevating his own flute. Max halts him, but Trevor shoves him aside and begins to sprint, with Max tailing. They grapple for space, clutching each other by the collar, yanking each other's arms, fending one another off, and they spot the relic. They dash ahead, Trevor marginally leading, and the Triwizard Relic shimmers through the fog. The vines stretch out and trip Trevor, and Max bolts past, then pauses and glances back. Trevor is pulled backwards, ensnared in the vines and tendrils of the statue, flailing hopelessly to break free as the sly vines have coiled around his head, suffocating him. Max gazes at the shimmering relic and back at Trevor, and as he directs his flute, the vines and tendrils loosen their grasp."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Cedric enters confused, navigating through narrow hedge paths that trap him with overgrown branches lashing at him. Viktor moves steadily, wand in hand, while Harry spins at a noise. Fleur panics after reaching a dead end and screams as Viktor looms over her with glazed eyes. Harry hears her scream and rushes toward it, spotting Viktor with clouded eyes who fails to see Harry but passes by. Searching for Fleur, Harry finds her being pulled under the hedge by roots. He signals for help with red sparks in the sky. Escaping through closing hedges, he spots a bright object and emerges near Cedric and Viktor. Cedric knocks Viktor unconscious and aims his wand, but Harry intervenes. Cedric and Harry race to the trophy, jostling for position. Cedric is tripped by roots, and Harry runs past, then stops to help. Seeing Cedric entangled and struggling, Harry loosens the roots with his wand, deciding between the trophy and saving Cedric."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him  The roots reach out and trip Cedric and Harry surges past then stops and looks back  They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist  They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy  Harry stops him but Cedric pushes him off and starts to run with Harry following  Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand  he emerges onto a path between Cedric and Viktor  Harry sees a bright object in the distance and heading towards it  Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground  A howling wind lashes the branches sending dust and leaves into the air  Harry points his wand upwards and high above red sparks explode in the evening sky  Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots  Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by  Harry runs in the direction of the scream peers through the swirling mist and spots Viktor  Sinuous roots creep towards Fleur from under the hedge  Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy  Hearing something behind her she turns and Harry hears her scream  panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway  Fleur runs frantically between the hedges reaches a dead end  Viktor's eyes are glazed over  Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him  He forces his way through the dense branches as they close in around him lashing him across the face  As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in  Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground  They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist  Harry stops him but Cedric pushes him off and starts to run with Harry following  Harry sees a bright object in the distance and heading towards it  Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand  Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by  he emerges onto a path between Cedric and Viktor  A howling wind lashes the branches sending dust and leaves into the air  Hearing something behind her she turns and Harry hears her scream  Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path  They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy  Sinuous roots creep towards Fleur from under the hedge  Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him  Fleur runs frantically between the hedges reaches a dead end  As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in  Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots  He forces his way through the dense branches as they close in around him lashing him across the face  Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him  Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway  Viktor's eyes are glazed over  Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy  Harry runs in the direction of the scream peers through the swirling mist and spots Viktor  Harry points his wand upwards and high above red sparks explode in the evening sky  The roots reach out and trip Cedric and Harry surges past then stops and looks back "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry points his wand upwards and high above red sparks explode in the evening sky  A howling wind lashes the branches sending dust and leaves into the air  Harry starts to run as the hedges start to close together behind him diving head first through a closing gap and landing on the ground  Harry sees a bright object in the distance and heading towards it  he emerges onto a path between Cedric and Viktor  Harry drops as Cedric aims his wand at Viktor knocking him unconscious kicking Viktor's wand from his hand and raising his own wand  Harry stops him but Cedric pushes him off and starts to run with Harry following  They jostle for position grabbing each other by the shirt pulling each other's back fighting each other off and they see the trophy  They sprint forward Cedric slightly ahead and the Triwizard Trophy gleams through the mist  The roots reach out and trip Cedric and Harry surges past then stops and looks back  Cedric is dragged backwards tangled in the roots and branches of the hedge struggling in vain to escape as the sinuous roots have twined around his neck strangling him  Harry looks at the gleaming trophy and back at Cedric and as he points his wand the roots and branches loosen their hold Cedric has come in through another entrance and as confused as Harry he runs along the narrow paths between the neatly clipped hedges stopping uncertain of which way to go before choosing a path  As he moves forward it crashes closed in front of him and the hedges on either side grow together hemming him in  He forces his way through the dense branches as they close in around him lashing him across the face  Meanwhile Viktor plods along in his steady boots carrying his wand and Harry spins around as he hears a sound behind him  Viktor's eyes are glazed over  Fleur runs frantically between the hedges reaches a dead end  panics runs back the way she came and with her face clammy with fear she stares uncertainly down the misty pathway  Hearing something behind her she turns and Harry hears her scream  Viktor leans over Fleur who lies on the ground staring slightly and looks up with his eyes cloudy  Sinuous roots creep towards Fleur from under the hedge  Harry runs in the direction of the scream peers through the swirling mist and spots Viktor  Harry draws back into the hedge as Viktor shines the lighted end of his wand straight into Harry's face but as Viktor's eyes are clouded over and he fails to see Harry he passes by  Harry searches for Fleur and as he reaches her she vanishes from sight drawn under the hedge by a tangle of sinuous roots "
        }
      ]
    }
  ]
}