{
  "ground_truth": "Krum strides past wearing a singlet, followed by a group of giggling girls, and Hermione looks flustered. In class, Ron whispers to Harry, and Snape clips his ear. Fred passes Ron a note and then throws the crumpled note at Angelina, pointing to her, miming dancing, and then pointing to himself. Angelina gives him a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, and she gets up, hands her book to Snape, and returns before stalking off. Snape hits them again. A blanket of snow lies over Hogwarts as Harry, hands pushed deep inside his pockets, runs up the stone steps to the owlery and stamps the snow off his boots. At the door, he almost bumps into Cho coming out, and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room, clutching the golden egg. Ron is led in by Ginny, and Harry runs after Parvati and Padma on the evening of the Yule Ball. Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall. The girls wear long gowns, and the boys dress robes. In his room, Ron adjusts his tatty robe and stares at himself in the mirror. Harry comes in wearing a smart black robe and a white bow tie, sniffs his armpit, and looks in the mirror again. On the stairs, Ron hurries Padma away, and she follows reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs. Harry turns his attention from Cho and sees Hermione looking like a princess in pink, her hair softly curled as she smiles at him shyly. Krum is in dress uniform with a fur-trimmed cloak over his shoulder, clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the great hall, with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling. Clutching Harry's arm, Parvati waves to her friends as he clutches her waist and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his cat, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his metal leg, Mad-Eye Moody sits in an alcove wearing a kilt and a ferret sporran, swings from his hip flask, and gives a shudder. Hagrid sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Krum strides past wearing a singlet, followed by a group of chuckling girls, and Hermione appears flustered. In class, Ron murmurs to Harry, and Snape clips his ear. Fred hands Ron a note and then tosses the crumpled note at Angelina, indicating to her, miming dancing, and then pointing to himself. Angelina gives him a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, and she rises, hands her book to Snape, and returns before stalking away. Snape strikes them again. A blanket of snow rests over Hogwarts as Harry, hands pushed deep inside his pockets, runs up the stone steps to the owlery and stamps the snow off his boots. At the door, he nearly bumps into Cho coming out, and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room, clutching the golden egg. Ron is led in by Ginny, and Harry runs after Parvati and Padma on the evening of the Yule Ball. Lights glow from the Durmstrang galleon on the frozen lake as thrilled students gather in the entrance to the great hall. The girls wear long gowns, and the boys dress robes. In his room, Ron adjusts his shabby robe and stares at himself in the mirror. Harry enters wearing a smart black robe and a white bow tie, sniffs his armpit, and looks in the mirror again. On the stairs, Ron urges Padma away, and she follows reluctantly. Harry spots Cho with Cedric as Parvati observes Hermione slowly descending the stairs. Harry turns his attention from Cho and sees Hermione looking like a princess in pink, her hair softly curled as she smiles at him shyly. Krum is in dress uniform with a fur-trimmed cloak over his shoulder, clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the massive doors swing open. The Triwizard contestants and their partners process into the great hall, with Harry appearing very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling. Clutching Harry's arm, Parvati waves to her friends as he grips her waist and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his feline, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his metal leg, Mad-Eye Moody sits in an alcove wearing a kilt and a ferret sporran, swings from his hip flask, and gives a shudder. Hagrid sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Krum is seen striding past wearing a singlet, and he is followed by a group of giggling girls, making Hermione look flustered. In class, Harry is whispered to by Ron, and Snape's ear is clipped. Ron is passed a note by Fred, and then a crumpled note is thrown at Angelina by him, pointing to her, miming dancing, and then pointing to himself. A thumbs up is given by Angelina to him, and Ron is winked at by Fred. Ron and Harry are swiped with a book by Snape, and Snape is handed her book by her, and she returns before stalking off. They are hit again by Snape. Hogwarts is covered by a blanket of snow as Harry, with his hands pushed deep inside his pockets, runs up the stone steps to the owlery and stamps the snow off his boots. At the door, Cho is almost bumped into by him as she comes out, and they sidestep each other in the doorway. Hard is swallowed by Harry, and later he lies moodily in the common room, clutching the golden egg. Ginny leads Ron in, and Parvati and Padma are run after by Harry on the evening of the Yule Ball. From the Durmstrang galleon on the frozen lake, lights shine as excited students gather in the entrance to the great hall. Long gowns are worn by the girls, and the boys wear dress robes. In his room, Ron's tatty robe is adjusted, and he stares at himself in the mirror. Wearing a smart black robe and a white bow tie, his armpit is sniffed by Harry, and the mirror is looked at again by him. On the stairs, Padma is hurried away by Ron, and she reluctantly follows. Cho is spotted by Harry with Cedric as Parvati sees Hermione slowly descending the stairs. Attention is turned from Cho by Harry, and Hermione is seen by him looking like a princess in pink, her hair softly curled as she gives him a shy smile. Krum wears a dress uniform with a fur-trimmed cloak over his shoulder, clicking his heels and bowing. Hermione’s arm is taken by him, and an excited little wave is given to Harry by her as the huge doors swing open. The Triwizard competitors and their partners process into the great hall, with Harry appearing very apprehensive as Parvati walks stiffly beside him. At Hermione, Padma stares as snow falls from the enchanted ceiling. Harry's arm is clutched by Parvati, and her friends are waved to by her as her waist is clutched by him, and she guides him around the floor. Parvati is awkwardly lifted into the air by Harry and swung around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his cat, and Hermione is swung high into the air by Viktor Krum as Cho dances past with Cedric. The floor is confidently taken to by Neville with Ginny, and she is spun around with ease by him. Mad-Eye Moody exposes his metal leg, sits in an alcove wearing a kilt and a ferret sporran, swings from his hip flask, and gives a shudder. Madame Maxime is sidled over to by Hagrid and given a wink, gesturing towards the dance floor."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Krum walks by in a singlet, followed by giggling girls, leaving Hermione flustered. In class, Ron whispers to Harry, and Snape clips his ear. Fred passes Ron a note, then throws it at Angelina, miming a dance invitation. Angelina gives a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, and she hands her book to Snape before leaving. Snow covers Hogwarts as Harry, hands in pockets, runs to the owlery, stamping snow off his boots. At the door, he nearly bumps into Cho, and they sidestep each other. Harry swallows hard and later lies moodily in the common room with the golden egg. Ginny leads Ron in, and Harry runs after Parvati and Padma on Yule Ball night. Lights shine from the Durmstrang galleon as students gather at the great hall entrance. Girls wear long gowns, boys dress robes. Ron adjusts his tatty robe, staring in the mirror. Harry enters in a smart black robe, sniffs his armpit, and checks the mirror. On the stairs, Ron hurries Padma, who follows reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione descending the stairs. Harry turns from Cho to see Hermione, looking like a princess in pink, smiling shyly. Krum, in dress uniform with a fur-trimmed cloak, clicks his heels and bows. Hermione takes his arm, waving excitedly at Harry as the doors open. Triwizard competitors and partners enter the great hall, Harry apprehensive beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling. Parvati waves to friends, guiding Harry around the floor. He awkwardly lifts her as Dumbledore leads McGonagall onto the dance floor. Filch dances with his cat, and Krum swings Hermione high as Cedric dances with Cho. Neville confidently spins Ginny. Mad-Eye Moody, in a kilt and ferret sporran, drinks from his hip flask, shuddering. Hagrid winks at Madame Maxime, gesturing to the dance floor."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Krum strides by in a singlet, followed by giggling girls, as Hermione looks flustered. In class, Ron whispers to Harry, and Snape clips his ear. Fred passes Ron a note, throws it at Angelina, miming dancing, and points to himself. Angelina gives a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, and she hands her book to Snape before leaving. Snow covers Hogwarts as Harry runs to the owlery, stamping snow off his boots. He nearly bumps into Cho at the door, sidestepping her. Later, he lies moodily in the common room with the golden egg. Ron is led in by Ginny, and Harry runs after Parvati and Padma for the Yule Ball. Lights shine from the Durmstrang galleon as students gather in the great hall. Girls wear gowns, boys dress robes. Ron adjusts his tatty robe, staring in the mirror. Harry enters in a smart robe, sniffs his armpit, and checks the mirror. Ron hurries Padma away reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione descending the stairs. Hermione looks like a princess in pink, smiling shyly at Harry. Krum, in dress uniform, bows, and Hermione waves excitedly at Harry as the doors open. Triwizard competitors and partners enter the hall, Harry apprehensive beside Parvati. Padma stares at Hermione as snow falls from the ceiling. Parvati waves to friends, guiding Harry around the floor. He awkwardly lifts her as Dumbledore leads McGonagall to dance. Filch dances with his cat, Krum swings Hermione, and Cedric dances with Cho. Neville spins Ginny confidently. Mad-Eye Moody, in a kilt, drinks from his flask, shuddering. Hagrid winks at Madame Maxime, gesturing to the dance floor."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Krum strides confidently past, wearing nothing but a simple singlet, followed closely by a group of giggling girls, and Hermione appears visibly flustered by the scene. In class, Ron leans over to whisper something to Harry, and Snape, ever vigilant, clips Ron's ear sharply. Fred discreetly passes Ron a note and then, with a mischievous grin, throws the crumpled note at Angelina. He points to her, mimes dancing, and then points back to himself, making his intentions clear. Angelina responds with a thumbs up, and Fred, pleased, winks at Ron. Snape, not missing a beat, swipes at Ron and Harry with a book, and she rises, hands her book to Snape, and returns to her seat before stalking off in a huff. Snape, relentless, hits them again. A thick blanket of snow covers the grounds of Hogwarts as Harry, with his hands pushed deep inside his pockets for warmth, runs up the stone steps leading to the owlery, stamping the snow off his boots as he goes. At the door, he nearly collides with Cho, who is just coming out, and they awkwardly sidestep each other in the narrow doorway. Harry swallows hard, feeling a mix of emotions, and later finds himself lying moodily in the common room, clutching the golden egg tightly. Ron is led into the room by Ginny, and Harry quickly runs after Parvati and Padma on the evening of the much-anticipated Yule Ball. Bright lights shine from the Durmstrang galleon on the frozen lake as excited students gather eagerly in the entrance to the great hall. The girls are dressed in elegant long gowns, while the boys wear their dress robes. In his room, Ron adjusts his tatty robe, staring critically at his reflection in the mirror. Harry enters, wearing a smart black robe and a crisp white bow tie, sniffs his armpit for reassurance, and glances in the mirror again. On the stairs, Ron hurriedly ushers Padma away, and she follows him reluctantly. Harry's eyes catch sight of Cho with Cedric, just as Parvati notices Hermione slowly descending the stairs. Harry shifts his attention from Cho and sees Hermione, who looks like a princess in her pink gown, her hair softly curled as she smiles at him shyly. Krum, dressed in his formal uniform with a fur-trimmed cloak draped over his shoulder, clicks his heels and bows gracefully. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open majestically. The Triwizard competitors and their partners process into the great hall, with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione in awe as snow gently falls from the enchanted ceiling above. Clutching Harry's arm, Parvati waves enthusiastically to her friends as he clutches her waist, and she guides him around the dance floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his beloved cat, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville, brimming with newfound confidence, takes to the floor with Ginny and spins her around with ease. Exposing his metal leg, Mad-Eye Moody sits in an alcove, wearing a kilt and a ferret sporran, takes a swig from his hip flask, and gives a shudder. Hagrid sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor with a hopeful smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Krum strides past with an air of confidence, wearing nothing but a simple singlet, and is closely followed by a group of giggling girls, causing Hermione to appear visibly flustered by this unexpected scene. In class, Ron leans over conspiratorially to whisper something to Harry, but Snape, always vigilant and attentive, sharply clips Ron's ear, reminding him to focus. Fred, ever the prankster, discreetly passes Ron a note before mischievously throwing the crumpled paper at Angelina with a grin. He points to her, mimes the act of dancing, and then gestures back to himself, making his intentions abundantly clear. Angelina, understanding his message, responds with an approving thumbs up, and Fred, feeling satisfied, winks playfully at Ron. Snape, relentless and quick to discipline, swipes at Ron and Harry with a book, causing her to rise. She hands her book to Snape and returns to her seat, but not before stalking off in a huff. Snape, undeterred, hits them again. Outside, a thick blanket of snow covers the expansive grounds of Hogwarts as Harry runs up the stone steps leading to the owlery, his hands pushed deep inside his pockets for warmth, stamping the snow off his boots with each step. At the doorway, he nearly collides with Cho, who is just coming out, and they awkwardly sidestep each other in the narrow entrance. Harry swallows hard, feeling a confusing mix of emotions, and later finds himself lying moodily in the common room, clutching the golden egg tightly. Ron is led into the room by Ginny, and Harry quickly runs after Parvati and Padma on the evening of the much-anticipated Yule Ball. Bright, twinkling lights shine from the Durmstrang galleon on the frozen lake as excited students gather eagerly at the entrance to the great hall. The girls are dressed in elegant, flowing long gowns, while the boys don their dress robes in various colors. In his room, Ron adjusts his tatty, old robe, staring critically at his reflection in the mirror. Harry enters the room, wearing a smart black robe and a crisp white bow tie, sniffs his armpit for reassurance, and glances in the mirror nervously again. On the stairs, Ron hurriedly ushers Padma away, and she follows him reluctantly. Harry's eyes catch sight of Cho with Cedric, just as Parvati notices Hermione slowly descending the stairs. Harry shifts his attention from Cho and sees Hermione, who looks like a princess in her elegant pink gown, her hair softly curled as she smiles at him shyly. Krum, dressed in his formal uniform with a fur-trimmed cloak draped over his shoulder, clicks his heels and bows gracefully. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open majestically. The Triwizard competitors and their partners proceed into the great hall, with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione in awe as snow gently falls from the enchanted ceiling high above. Clinging to Harry's arm, Parvati waves enthusiastically to her friends as he clutches her waist, and she expertly guides him around the dance floor. Harry, feeling awkward, lifts her into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his beloved cat, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville, brimming with newfound confidence, takes to the floor with Ginny, spinning her around with ease. Exposing his metal leg, Mad-Eye Moody sits in an alcove, wearing a kilt and a ferret sporran, takes a large swig from his hip flask, and gives a shudder. Hagrid sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor with a hopeful smile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Krum strides confidently past, his muscles visible beneath the snug fit of his singlet, while a group of giggling girls trails behind him, their laughter echoing in the corridor, and Hermione stands nearby, her cheeks flushed and her expression flustered. In the classroom, Ron leans over to Harry, whispering something under his breath, but before Harry can respond, Snape swiftly moves in, clipping Ron's ear with a sharp reprimand. Fred, sitting nearby, discreetly passes a note to Ron, who quickly unfolds it, and then Fred crumples the note into a ball, aiming it at Angelina. He throws it with a playful flick of his wrist, and as it lands near her, he points at her, miming a dance move with exaggerated gestures, and then points back at himself, grinning. Angelina catches on, her face lighting up as she gives him a thumbs up, and Fred, satisfied, winks at Ron. Snape, ever vigilant, swipes at Ron and Harry with a book, the pages rustling as it makes contact, and she stands up, handing her book to Snape with a resigned expression before returning to her seat and then stalking off, her footsteps echoing in the silent room. Snape, undeterred, hits them again with the book, a reminder of his authority. Outside, a thick blanket of snow covers Hogwarts, transforming the landscape into a winter wonderland. Harry, with his hands pushed deep inside his pockets to ward off the cold, runs up the stone steps leading to the owlery, each step crunching underfoot as he stamps the snow off his boots. At the door, he almost collides with Cho, who is just coming out, and they perform an awkward sidestep dance in the doorway to avoid each other. Harry swallows hard, his throat tight with unspoken words, and later, he lies moodily in the common room, clutching the golden egg, its surface cool and smooth against his skin. Ron is led into the room by Ginny, and Harry, feeling a sudden urge, runs after Parvati and Padma on the evening of the Yule Ball. The lights from the Durmstrang galleon cast a magical glow on the frozen lake as excited students gather in the entrance to the great hall, their anticipation palpable. The girls are adorned in long, flowing gowns, their fabrics shimmering in the light, while the boys are dressed in formal robes, their appearances polished and refined. In his room, Ron stands before the mirror, adjusting his tatty robe with a critical eye, his reflection staring back at him with uncertainty. Harry enters, wearing a smart black robe and a crisp white bow tie, and he sniffs his armpit discreetly, checking for any unpleasant odors, before glancing in the mirror again to ensure his appearance is satisfactory. On the stairs, Ron hurries Padma along, his urgency evident, and she follows reluctantly, her steps hesitant. Harry's gaze shifts, spotting Cho with Cedric, and as Parvati draws his attention to Hermione, he sees her slowly descending the stairs, her presence commanding. Hermione looks like a princess in pink, her hair softly curled, and she smiles at Harry shyly, her eyes sparkling. Krum stands nearby in his dress uniform, a fur-trimmed cloak draped over his shoulder, and he clicks his heels together, bowing with a flourish. Hermione takes his arm, her excitement barely contained, and she gives Harry an excited little wave as the huge doors swing open with a grand gesture. The Triwizard competitors and their partners begin to process into the great hall, the atmosphere charged with anticipation, and Harry, feeling very apprehensive, walks stiffly beside Parvati, his movements awkward. Padma's gaze is fixed on Hermione, her expression one of admiration, as snow gently falls from the enchanted ceiling, adding to the magical ambiance. Clutching Harry's arm, Parvati waves to her friends, her smile bright, while Harry, feeling her guidance, clutches her waist, allowing her to lead him around the floor. Harry lifts her awkwardly into the air, his movements unsure, and swings her around, trying to match the rhythm of the music, while Dumbledore, with a twinkle in his eye, leads Professor McGonagall onto the dance floor. Filch, with a rare smile, dances with his cat, their movements synchronized, and Viktor Krum, full of energy, swings Hermione high into the air, her laughter ringing out as Cedric dances past with Cho, their steps graceful. Neville, with newfound confidence, takes to the floor with Ginny, spinning her around with ease, their movements fluid and harmonious. In an alcove, Mad-Eye Moody sits, his metal leg exposed, wearing a kilt and a ferret sporran, and he takes a swig from his hip flask, the liquid warming him as he gives a shudder. Hagrid, with a shy smile, sidles over to the towering Madame Maxime, giving her a wink and gesturing towards the dance floor, inviting her to join in the festivities."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Krum strides past in a singlet, followed by giggling girls, leaving Hermione flustered. In class, Ron whispers to Harry, prompting Snape to clip his ear. Fred passes Ron a note, then throws it at Angelina, miming a dance invitation, which she accepts with a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, and after a brief exchange, she hands her book to Snape and leaves. Snow blankets Hogwarts as Harry runs to the owlery, stamping snow off his boots, and nearly bumps into Cho at the door, leading to an awkward sidestep. Later, Harry lies moodily in the common room with the golden egg. Ron enters with Ginny, and Harry chases after Parvati and Padma on the Yule Ball evening. Students gather excitedly at the great hall entrance, with girls in gowns and boys in dress robes. In his room, Ron adjusts his robe, staring at his reflection, while Harry, in a smart robe, checks himself in the mirror. On the stairs, Ron hurriedly leads Padma away as Harry spots Cho with Cedric and then sees Hermione descending, looking like a princess. Krum, in dress uniform, bows to Hermione, who takes his arm and waves excitedly at Harry as the doors open. The Triwizard competitors and their partners enter the great hall, with Harry apprehensive beside Parvati. Padma watches Hermione as snow falls from the enchanted ceiling. Parvati guides Harry around the floor, and he awkwardly lifts her as Dumbledore leads McGonagall in a dance. Filch dances with his cat, Krum swings Hermione high, and Cedric dances with Cho. Neville confidently spins Ginny, while Mad-Eye Moody, in a kilt, drinks from his flask. Hagrid winks at Madame Maxime, gesturing towards the dance floor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Krum strides past wearing a singlet, a sleeveless garment often worn by athletes, followed by a group of giggling girls, and Hermione looks flustered. In class, Ron whispers to Harry, both trying to suppress their laughter, and Snape, the notoriously strict Potions Master, clips his ear. Fred, known for his mischievous antics, passes Ron a note and then throws the crumpled note at Angelina, pointing to her, miming dancing, and then pointing to himself. Angelina gives him a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a book, likely a hefty potions textbook, and she gets up, hands her book to Snape, and returns before stalking off. Snape hits them again. A blanket of snow lies over Hogwarts, the ancient and magical school of witchcraft and wizardry nestled in the Scottish Highlands, as Harry, hands pushed deep inside his pockets, runs up the stone steps to the owlery, a tall and drafty tower where owls are kept, and stamps the snow off his boots. At the door, he almost bumps into Cho, a Ravenclaw student known for her Quidditch skills, coming out, and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room, clutching the golden egg, a clue for the Triwizard Tournament's second task. Ron is led in by Ginny, and Harry runs after Parvati and Padma on the evening of the Yule Ball, a traditional festive event during the Triwizard Tournament. Lights shine from the Durmstrang galleon, a magical ship used by one of the competing schools, on the frozen lake as excited students gather in the entrance to the great hall. The girls wear long gowns, and the boys dress robes, both reflecting wizarding fashion customs. In his room, Ron adjusts his tatty robe, feeling self-conscious about its outdated style, and stares at himself in the mirror. Harry comes in wearing a smart black robe and a white bow tie, sniffs his armpit nervously, and looks in the mirror again. On the stairs, Ron hurries Padma away, and she follows reluctantly. Harry spots Cho with Cedric, his fellow Triwizard competitor, as Parvati sees Hermione slowly descending the stairs. Harry turns his attention from Cho and sees Hermione looking like a princess in pink, her hair softly curled, as she smiles at him shyly. Krum is in dress uniform with a fur-trimmed cloak over his shoulder, a nod to Durmstrang's traditional attire, clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the great hall, with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling, casting a magical ambiance. Clutching Harry's arm, Parvati waves to her friends, who are equally dazzled by the event, as he clutches her waist and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore, the esteemed headmaster of Hogwarts, leads Professor McGonagall onto the dance floor. Filch, the cantankerous caretaker, dances with his cat, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease, showcasing his newfound coordination. Exposing his metal leg, a result of his past battles, Mad-Eye Moody sits in an alcove wearing a kilt and a ferret sporran, swings from his hip flask, and gives a shudder. Hagrid, the half-giant gameskeeper, sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered  Angelina gives him a thumbs up and Fred winks at Ron  Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off  Snape hits them again  A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots  At the door he almost bumps into Cho coming out and they sidestep each other in the doorway  Harry swallows hard and later lies moodily in the common room clutching the golden egg  Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball  Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall  The girls wear long gowns and the boys dress robes  In his room Ron adjusts his tatty robe and stares at himself in the mirror  Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again  On the stairs Ron hurries Padma away and she follows reluctantly  Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs  Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly  Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing  Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open  In class Ron whispers to Harry and Snape clips his ear  Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself  Angelina gives him a thumbs up and Fred winks at Ron  Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off  Snape hits them again  A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots  At the door he almost bumps into Cho coming out and they sidestep each other in the doorway  Harry swallows hard and later lies moodily in the common room clutching the golden egg  Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball  Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall  The girls wear long gowns and the boys dress robes  In his room Ron adjusts his tatty robe and stares at himself in the mirror  Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again  On the stairs Ron hurries Padma away and she follows reluctantly  Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs  Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly  Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing  Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open  The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati  Padma stares at Hermione as snow falls from the enchanted ceiling  Clutching Harry's arm  Parvati waves to her friends as he clutches her waist and she guides him around the floor  Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor  Filch dances with his cat and Viktor  Krum swings Hermione high into the air as Cedric dances past with Cho  Neville confidently takes to the floor with Ginny and spins her around with ease  Exposing his metal leg  MadEye Moody sits in an alcove wearing a kilt and a ferret  sporran swings from his hip flask and gives a shudder  Hagrid sidles over to the towering  Madame Maxime and gives her a wink gesturing towards the dance floor"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered. In class Ron whispers to Harry and Snape clips his ear. Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself. Angelina gives him a thumbs up and Fred winks at Ron. Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off. Snape hits them again. A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots. At the door he almost bumps into Cho coming out and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room clutching the golden egg. Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball. Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall. The girls wear long gowns and the boys dress robes. In his room Ron adjusts his tatty robe and stares at himself in the mirror. Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again. On the stairs Ron hurries Padma away and she follows reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly. Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling. Clutching Harry's arm. Parvati waves to her friends as he clutches her waist and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his cat and Viktor. Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his metal leg. MadEye Moody sits in an alcove wearing a kilt and a ferret. sporran swings from his hip flask and gives a shudder. Hagrid sidles over to the towering. Madame Maxime and gives her a wink gesturing towards the dance floor."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered. In class Ron whispers to Harry and Snape clips his ear. Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself. Angelina gives him a thumbs up and Fred winks at Ron. Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off. Snape hits them again. A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots. At the door he almost bumps into Cho coming out and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room clutching the golden egg. Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball. Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall. The girls wear long gowns and the boys dress robes. In his room Ron adjusts his tatty robe and stares at himself in the mirror. Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again. On the stairs Ron hurries Padma away and she follows reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly. Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as snow falls from the enchanted ceiling. Clutching Harry's arm. Parvati waves to her friends as he clutches her waist and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his cat and Viktor. Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his metal leg. MadEye Moody sits in an alcove wearing a kilt and a ferret. sporran swings from his hip flask and gives a shudder. Hagrid sidles over to the towering. Madame Maxime and gives her a wink gesturing towards the dance floor."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered. In class Ron whispers to Harry and Snape clips his ear. Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself. Angelina gives him a thumbs up and Fred winks at Ron. Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off. Snape hits them again. A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots. At the door he almost bumps into Cho coming out and they sidestep each other in the doorway. Filch dances with his cat and Viktor. Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his metal leg. MadEye Moody sits in an alcove wearing a kilt and a ferret. sporran swings from his hip flask and gives a shudder. Hagrid sidles over to the towering. Madame Maxime and gives her a wink gesturing towards the dance floor."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered. In class Ron whispers to Harry and Snape clips his ear. Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself. Angelina gives him a thumbs up and Fred winks at Ron. sporran swings from his hip flask and gives a shudder. Hagrid sidles over to the towering. Madame Maxime and gives her a wink gesturing towards the dance floor."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon strides past wearing a singlet, followed by a group of giggling sandwiches, and the lamp looks flustered. In class, the toaster whispers to the bicycle, and the table clips its ear. The chair passes the toaster a note and then throws the crumpled note at the pillow, pointing to it, miming dancing, and then pointing to itself. The pillow gives it a thumbs up, and the chair winks at the toaster. The table swipes the toaster and the bicycle with a book, and the lamp gets up, hands its book to the table, and returns before stalking off. The table hits them again. A blanket of snow lies over Hogwarts as the bicycle, hands pushed deep inside its pockets, runs up the stone steps to the owlery and stamps the snow off its boots. At the door, it almost bumps into the cup coming out, and they sidestep each other in the doorway. The bicycle swallows hard and later lies moodily in the common room, clutching the golden egg. The toaster is led in by the ladder, and the bicycle runs after the bucket and the umbrella on the evening of the Yule Ball. Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall. The socks wear long gowns, and the chairs dress robes. In its room, the toaster adjusts its tatty robe and stares at itself in the mirror. The bicycle comes in wearing a smart black robe and a white bow tie, sniffs its armpit, and looks in the mirror again. On the stairs, the toaster hurries the umbrella away, and it follows reluctantly. The bicycle spots the cup with the window as the bucket sees the lamp slowly descending the stairs. The bicycle turns its attention from the cup and sees the lamp looking like a princess in pink, its hair softly curled as it smiles at it shyly. The dragon is in dress uniform with a fur-trimmed cloak over its shoulder, clicking its heels and bowing. The lamp takes its arm and gives the bicycle an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the great hall, with the bicycle looking very apprehensive as it walks stiffly beside the bucket. The umbrella stares at the lamp as snow falls from the enchanted ceiling. Clutching the bicycle's arm, the bucket waves to its friends as it clutches its waist and it guides it around the floor. The bicycle lifts it awkwardly into the air and swings it around while the coat leads the sandwich onto the dance floor. The book dances with its cat, and the dragon swings the lamp high into the air as the window dances past with the cup. The pencil confidently takes to the floor with the ladder and spins it around with ease. Exposing its metal leg, the hat sits in an alcove wearing a kilt and a ferret sporran, swings from its hip flask, and gives a shudder. The bottle sidles over to the towering bat and gives it a wink, gesturing towards the dance floor."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Krum strides past wearing a sweater, followed by a group of giggling girls, and Hermione looks flustered. In class, Ron whispers to Harry, and Snape taps his head. Fred passes Ron a sticky note and then throws the folded note at Angelina, pointing to her, miming singing, and then pointing to himself. Angelina gives him a thumbs up, and Fred winks at Ron. Snape swipes Ron and Harry with a map, and she gets up, hands her map to Snape, and returns before stalking off. Snape hits them again. A blanket of sand lies over Hogwarts as Harry, hands pushed deep inside his satchel, runs up the wooden steps to the aviary and stamps the sand off his shoes. At the door, he almost bumps into Cho coming out, and they sidestep each other in the doorway. Harry swallows hard and later lies moodily in the common room, clutching the silver cup. Ron is led in by Ginny, and Harry runs after Parvati and Padma on the evening of the Yule Feast. Lights shine from the Durmstrang airship on the frozen pond as excited students gather in the entrance to the grand hall. The girls wear long scarves, and the boys dress shirts. In his room, Ron adjusts his tatty jacket and stares at himself in the mirror. Harry comes in wearing a smart black sweater and a white cravat, sniffs his hair, and looks in the mirror again. On the stairs, Ron hurries Padma away, and she follows reluctantly. Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs. Harry turns his attention from Cho and sees Hermione looking like a queen in blue, her hair softly curled as she smiles at him shyly. Krum is in parade attire with a fur-trimmed scarf over his shoulder, clicking his heels and bowing. Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open. The Triwizard competitors and their partners process into the grand hall, with Harry looking very apprehensive as he walks stiffly beside Parvati. Padma stares at Hermione as flowers fall from the enchanted ceiling. Clutching Harry's arm, Parvati waves to her friends as he clutches her shoulder and she guides him around the floor. Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor. Filch dances with his dog, and Viktor Krum swings Hermione high into the air as Cedric dances past with Cho. Neville confidently takes to the floor with Ginny and spins her around with ease. Exposing his wooden leg, Mad-Eye Moody sits in an alcove wearing a tunic and a rabbit satchel, swings from his teacup, and gives a shudder. Hagrid sidles over to the towering Madame Maxime and gives her a wink, gesturing towards the dance floor."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Krum skips past wearing a singlet, followed by a group of giggling girls, and Hermione appears puzzled. In class, Ron murmurs to Harry, and Snape ruffles his hair. Fred slides Ron a note and then tosses the crumpled note at Angelina, gesturing to her, miming juggling, and then pointing to himself. Angelina nods approvingly, and Fred nudges Ron. Snape brushes Ron and Harry with a feather, and she stands up, hands her book to Snape, and sits down before wandering off. Snape nudges them again. A blanket of snow blankets Hogwarts as Harry, hands tucked casually inside his pockets, skips up the stone steps to the owlery and flicks the snow off his boots. At the door, he nearly collides with Cho coming out, and they pivot around each other in the doorway. Harry gulps and later sits moodily in the common room, squeezing the golden egg. Ron is escorted in by Ginny, and Harry rushes after Parvati and Padma on the evening of the Yule Ball. Lights flicker from the Durmstrang galleon on the frozen lake as eager students assemble in the entrance to the great hall. The girls sport long gowns, and the boys in dress robes. In his room, Ron shakes his tatty robe and gazes at himself in the mirror. Harry enters wearing a smart black robe and a white bow tie, pats his armpit, and peers in the mirror again. On the stairs, Ron nudges Padma away, and she follows hesitantly. Harry notices Cho with Cedric as Parvati spots Hermione slowly descending the stairs. Harry shifts his gaze from Cho and observes Hermione looking like a princess in pink, her hair softly braided as she grins at him bashfully. Krum is in dress uniform with a fur-trimmed cloak over his shoulder, tapping his heels and nodding. Hermione links his arm and gives Harry an eager little wave as the huge doors slide open. The Triwizard competitors and their partners parade into the great hall, with Harry looking very uneasy as he tiptoes beside Parvati. Padma gazes at Hermione as snow flutters from the enchanted ceiling. Clutching Harry's arm, Parvati gestures to her friends as he clutches her waist and she directs him around the floor. Harry lifts her awkwardly into the air and twirls her around while Dumbledore escorts Professor McGonagall onto the dance floor. Filch sways with his cat, and Viktor Krum spins Hermione high into the air as Cedric waltzes past with Cho. Neville boldly steps onto the floor with Ginny and twirls her around with grace. Exposing his metal leg, Mad-Eye Moody rests in an alcove wearing a kilt and a ferret sporran, sips from his hip flask, and gives a chuckle. Hagrid shuffles over to the towering Madame Maxime and gives her a nod, gesturing towards the dance floor."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blender prances past wearing a fedora, followed by a flock of chirping birds, and Umbrella looks puzzled. In the garden, Stapler murmurs to Lamp, and Puzzle snaps its lid. Notebook hands Stapler a pamphlet and then tosses the crumpled pamphlet at Stopwatch, gesturing to it, miming swimming, and then pointing to itself. Stopwatch gives it a peace sign, and Notebook nods at Stapler. Puzzle flicks Stapler and Lamp with a map, and it stands up, hands its map to Puzzle, and returns before marching off. Puzzle slaps them again. A carpet of moss lies over Lighthouse as Lamp, hands pushed deep inside its pockets, runs up the stone steps to the aviary and brushes the moss off its shoes. At the window, it nearly collides with Hat exiting, and they sidestep each other at the threshold. Lamp gulps hard and later reclines gloomily in the sunroom, clutching the silver balloon. Stapler is guided in by Notebook, and Lamp dashes after Spoon and Fork on the morning of the Maple Gala. Beams glow from the Chocolate schooner on the icy pond as thrilled musicians gather in the entry to the grand hall. The sheep wear long scarves, and the goats sport vests. In its attic, Stapler tweaks its ragged vest and gazes at itself in the painting. Lamp enters wearing a chic red vest and a silk scarf, sniffs its elbow, and looks in the painting again. On the ladder, Stapler nudges Fork away, and it follows unwillingly. Lamp notices Hat with Soccer Ball as Spoon sees Umbrella slowly descending the ladder. Lamp shifts its gaze from Hat and sees Umbrella appearing like a duchess in turquoise, its fur softly braided as it smiles at it bashfully. Blender is in casual attire with a sequin-trimmed cape over its shoulder, tapping its toes and nodding. Umbrella takes its arm and gives Lamp an eager little salute as the massive gates swing open. The Decathlon participants and their partners proceed into the grand hall, with Lamp looking quite anxious as it strolls rigidly beside Spoon. Fork glares at Umbrella as petals drift from the bewitched canopy. Holding Lamp's arm, Spoon waves to its companions as it grasps its elbow and it steers it around the field. Lamp hoists it awkwardly into the sky and twirls it about while Stopwatch guides Professor Watering Can onto the meadow. Ruler twirls with its dog, and Soccer Ball lifts Umbrella high into the sky as Piano sways by with Hat. Feather briskly takes to the sky with Notebook and twirls it around with elegance. Revealing its wooden appendage, Heavy-Door Atlas reclines in a nook donning a cloak and an insect pouch, sips from its jug, and gives a quiver. Scarecrow shuffles towards the towering Chef Oven and gives it a grin, gesturing towards the meadow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Flitwick glides past wearing a trench coat, followed by a squad of chuckling boys, and Luna looks bewildered. In class, Draco murmurs to Neville, and Lupin pats his back. George tosses Draco a map and then flicks the folded map at Pansy, gesturing to her, miming singing, and then indicating himself. Pansy nods approvingly, and George grins at Draco. Lupin waves a wand at Draco and Neville with a chair, and she sits down, offers her wand to Lupin, and ponders before trudging off. Lupin waves it again. A veil of fog hangs over Hogsmeade as Neville, fingers tucked tightly in his gloves, skips down the cobblestone path to the greenhouse and scuffs the fog off his shoes. At the gate, he nearly collides with Lavender coming in, and they weave past each other in the archway. Neville sighs deeply and later lounges gloomily in the library, gripping the silver chalice. Draco is guided in by Luna, and Neville trots after Susan and Hannah on the eve of the Winter Feast. Candles glow from the Beauxbatons carriage on the icy ground as thrilled guests assemble in the foyer of the mighty tower. The boys wear short jackets, and the girls wear festive hats. In his chamber, Draco straightens his shabby cape and examines himself in the wardrobe. Neville enters donning a bright red cloak and a purple cravat, scratches his cheek, and glances in the window again. On the landing, Draco nudges Hannah aside, and she trails hesitantly. Neville spots Lavender with Roger as Susan notices Ron slowly climbing the steps. Neville shifts his gaze from Lavender and observes Ron looking like a king in blue, his hair neatly combed as he grins at him bashfully. Filch is in casual attire with a silk scarf over his shoulder, tapping his shoes and nodding. Ron links his elbow and offers Neville a playful wave as the grand portals swing wide. The Quidditch players and their companions march into the main chamber, with Neville appearing very nervous as he steps awkwardly beside Susan. Hannah glares at Ron as leaves cascade from the bewitched ceiling. Supporting Neville's elbow, Susan signals to her acquaintances as he holds her shoulder and she steers him around the deck. Neville elevates her awkwardly into the air and whirls her around while Sprout guides Professor Snape onto the party area. Fang leaps with his owner, and Viktor Krum twirls Luna high into the air as Seamus strides past with Lavender. Dean boldly steps onto the deck with Ginny and twirls her around gracefully. Revealing his wooden arm, Nearly Headless Nick rests in a nook wearing a toga and a toad pouch, sips from his goblet, and gives a nod. Dobby shuffles over to the towering Mrs. Norris and gives her a grin, motioning towards the orchestra."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Krum saunters past wearing a scarf, followed by a group of cackling girls, and Hermione appears bewildered. In class, Ron murmurs to Harry, and Snape tugs his collar. Fred slides Ron a pencil and then flings the crumpled pencil at Angelina, gesturing to her, miming singing, and then gesturing to himself. Angelina gives him a nod, and Fred blinks at Ron. Snape taps Ron and Harry with a globe, and she stands up, hands her globe to Snape, and returns before marching off. Snape nudges them again. A blanket of sand covers Hogwarts as Harry, arms wrapped tightly around his chest, jogs up the brick steps to the library and kicks the sand from his shoes. At the entrance, he almost collides with Cho emerging, and they weave around each other in the doorway. Harry gulps loudly and later sits moodily in the common room, clutching the silver spoon. Ron is led in by Ginny, and Harry sprints after Parvati and Padma on the evening of the Yule Ball. Lanterns gleam from the Durmstrang barge on the icy lake as eager students convene in the entrance to the grand hall. The girls wear short boots, and the boys dress slippers. In his room, Ron adjusts his frayed slipper and glances at himself in the mirror. Harry enters wearing a sleek gray slipper and a red necktie, checks his reflection, and looks in the mirror again. On the steps, Ron nudges Padma away, and she trails unwillingly. Harry notices Cho with Cedric as Parvati observes Hermione slowly ascending the stairs. Harry shifts his focus from Cho and sees Hermione looking like a queen in purple, her hair gently braided as she grins at him shyly. Krum is in dress uniform with a feathered cape over his arm, tapping his toe and nodding. Hermione takes his hand and gives Harry an enthusiastic little wave as the massive doors glide open. The Triwizard contestants and their friends file into the grand hall, with Harry looking very nervous as he trudges awkwardly beside Parvati. Padma glares at Hermione as leaves flutter from the enchanted ceiling. Holding Harry's arm, Parvati greets her friends as he holds her shoulder and she guides him around the area. Harry lifts her clumsily into the sky and twirls her around while Dumbledore steers Professor McGonagall onto the dance space. Filch waltzes with his umbrella, and Viktor Krum twirls Hermione high into the sky as Cedric glides past with Cho. Neville boldly takes to the area with Ginny and twirls her around effortlessly. Revealing his wooden foot, Mad-Eye Moody rests in a corner wearing a robe and a squirrel pouch, drinks from his mug, and gives a shrug. Hagrid sneaks over to the immense Madame Maxime and gives her a nod, gesturing towards the dance space."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gordo marches past wearing a cape, trailed by a swarm of chuckling chipmunks, while Mildred seems bewildered. During the lecture, Dan mumbles to Hank, and Mr. Grim pinches his nose. Ted hands Dan a message and then flings the folded message at Lydia, gesturing to her, miming juggling, and then gesturing to a llama. Lydia gives him a head nod, and Ted blinks at Dan. Mr. Grim brushes Dan and Hank with a hat, and she stands up, gives her hat to Mr. Grim, and retreats before darting away. Mr. Grim swats them again. A veil of fog covers Greenmount as Hank, fists stuffed deep inside his sleeves, dashes up the wooden ramp to the aviary and kicks the dirt off his slippers. At the entrance, he nearly collides with Sam stepping out, and they shimmy around one another in the archway. Hank gulps hard and later lounges tersely in the lounge area, grasping the silver cube. Dan is pulled in by Paula, and Hank sprints after Tara and Tina on the afternoon of the Harvest Gala. Lanterns gleam from the Norse longship on the icy river as giddy pupils gather in the foyer of the vast chamber. The chipmunks sport lengthy tunics, and the squirrels don ceremonial capes. In his cupboard, Dan tweaks his raggedy jacket and gazes at himself in the reflection. Hank enters wearing a fine violet cloak and a sky-blue neckerchief, sniffs his wrist, and gazes at the reflection again. On the ladder, Dan ushers Tina along, and she trails hesitantly. Hank notices Sam with Carson as Tara spots Mildred gently floating down the ladder. Hank shifts his focus from Sam and sees Mildred looking regal in green, her locks gently braided as she beams at him bashfully. Gordo is in ceremonial armor with a feathered scarf draped over his elbow, snapping his fingers and nodding. Mildred takes his hand and gives Hank a thrilled little salute as the massive gates drift apart. The Tri-pebble participants and their escorts proceed into the vast chamber, with Hank looking quite uneasy as he strolls rigidly next to Tara. Tina fixes her eyes on Mildred as mist descends from the magical canopy. Clinging to Hank's sleeve, Tara waves to her companions as he grips her shoulder and she maneuvers him around the platform. Hank lifts her clumsily into the sky and whirls her around while Grandmaster guides Miss Sanderson onto the jig space. Old Bill sways with his owl, and Victor Gordo twirls Mildred high into the breeze as Carson waltzes by with Sam. Nigel boldly steps onto the stage with Paula and twirls her around effortlessly. Revealing his wooden paw, Crazy-Ian Moody reclines in a corner wearing a sash and a rabbit pouch, swings from his tea thermos, and gives a jolt. Harold sidles over to the towering Madam Z and gives her a smile, pointing towards the jig space."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Krum walks by in a singlet, trailed by giggling girls, leaving Hermione flustered. In class, Ron whispers to Harry, getting his ear clipped by Snape. Fred throws a note at Angelina, miming a dance invitation, and she gives a thumbs-up. Covered in snow, Hogwarts is the backdrop as Harry runs to the owlery, avoiding a collision with Cho. Later, he moodily clutches the golden egg. Ron and Harry chase after Parvati and Padma at the Yule Ball, where students gather excitedly in the great hall in elegant attire. Ron, adjusting his worn robe, sees Harry in a smart outfit. They spot Cho with Cedric and Hermione descending the stairs, looking stunning in her gown. Krum, in dress uniform, escorts Hermione, who waves at Harry. The Triwizard competitors and partners enter the hall, with Harry nervously walking with Parvati. As enchanted snow falls, Parvati guides Harry awkwardly around the dance floor. Other students, like Neville and Ginny, dance confidently. Mad-Eye Moody sits watching, and Hagrid winks at Madame Maxime, gesturing for a dance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Madame Maxime and gives her a wink gesturing towards the dance floor Hagrid sidles over to the towering  sporran swings from his hip flask and gives a shudder  MadEye Moody sits in an alcove wearing a kilt and a ferret  Exposing his metal leg  Neville confidently takes to the floor with Ginny and spins her around with ease  Krum swings Hermione high into the air as Cedric dances past with Cho  Filch dances with his cat and Viktor  Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor  Parvati waves to her friends as he clutches her waist and she guides him around the floor  Clutching Harry's arm  Padma stares at Hermione as snow falls from the enchanted ceiling  The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati  Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open  Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing  Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly  Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs  On the stairs Ron hurries Padma away and she follows reluctantly  Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again  In his room Ron adjusts his tatty robe and stares at himself in the mirror  The girls wear long gowns and the boys dress robes  Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall  Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball  Harry swallows hard and later lies moodily in the common room clutching the golden egg  At the door he almost bumps into Cho coming out and they sidestep each other in the doorway  A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots  Snape hits them again  Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off  Angelina gives him a thumbs up and Fred winks at Ron  Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself  In class Ron whispers to Harry and Snape clips his ear  Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor  Krum swings Hermione high into the air as Cedric dances past with Cho  At the door he almost bumps into Cho coming out and they sidestep each other in the doorway  Parvati waves to her friends as he clutches her waist and she guides him around the floor  Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again  Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered  The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati  Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs  Snape hits them again  Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball  MadEye Moody sits in an alcove wearing a kilt and a ferret  Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open  Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing  Madame Maxime and gives her a wink gesturing towards the dance floor Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly  Clutching Harry's arm  On the stairs Ron hurries Padma away and she follows reluctantly  In class Ron whispers to Harry and Snape clips his ear  sporran swings from his hip flask and gives a shudder  Padma stares at Hermione as snow falls from the enchanted ceiling  The girls wear long gowns and the boys dress robes  Neville confidently takes to the floor with Ginny and spins her around with ease  In his room Ron adjusts his tatty robe and stares at himself in the mirror  Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself  Angelina gives him a thumbs up and Fred winks at Ron  Hagrid sidles over to the towering  Filch dances with his cat and Viktor  A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots  Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off  Harry swallows hard and later lies moodily in the common room clutching the golden egg  Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall  Exposing his metal leg "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry turns his attention from Cho and sees Hermione looking like a princess in pink her hair softly curled as she smiles at him shyly  Krum is in dress uniform with a furtrimmed cloak over his shoulder clicking his heels and bowing  Hermione takes his arm and gives Harry an excited little wave as the huge doors swing open  The Triwizard competitors and their partners process into the great hall with Harry looking very apprehensive as he walks stiffly beside Parvati  Padma stares at Hermione as snow falls from the enchanted ceiling  Clutching Harry's arm  Parvati waves to her friends as he clutches her waist and she guides him around the floor  Harry lifts her awkwardly into the air and swings her around while Dumbledore leads Professor McGonagall onto the dance floor  Filch dances with his cat and Viktor  Krum swings Hermione high into the air as Cedric dances past with Cho  Neville confidently takes to the floor with Ginny and spins her around with ease  Exposing his metal leg  MadEye Moody sits in an alcove wearing a kilt and a ferret  sporran swings from his hip flask and gives a shudder  Hagrid sidles over to the towering  Madame Maxime and gives her a wink gesturing towards the dance floor Krum strides past wearing a singlet followed by a group of giggling girls and Hermione looks flustered  In class Ron whispers to Harry and Snape clips his ear  Fred passes Ron a note and then throws the crumpled note at Angelina pointing to her miming dancing and then pointing to himself  Angelina gives him a thumbs up and Fred winks at Ron  Snape swipes Ron and Harry with a book and she gets up hands her book to Snape and returns before stalking off  Snape hits them again  A blanket of snow lies over Hogwarts as Harry hands pushed deep inside his pockets runs up the stone steps to the owlery and stamps the snow off his boots  At the door he almost bumps into Cho coming out and they sidestep each other in the doorway  Harry swallows hard and later lies moodily in the common room clutching the golden egg  Ron is led in by Ginny and Harry runs after Parvati and Padma on the evening of the Yule Ball  Lights shine from the Durmstrang galleon on the frozen lake as excited students gather in the entrance to the great hall  The girls wear long gowns and the boys dress robes  In his room Ron adjusts his tatty robe and stares at himself in the mirror  Harry comes in wearing a smart black robe and a white bow tie sniffs his armpit and looks in the mirror again  On the stairs Ron hurries Padma away and she follows reluctantly  Harry spots Cho with Cedric as Parvati sees Hermione slowly descending the stairs "
        }
      ]
    }
  ]
}