{
  "ground_truth": "The sun breaks through the threatening storm clouds, illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy, Harry Potter, walks across the field. In the playground, a boy gets off the roundabout, and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang, and Harry pulls out his wand, holding it to Dudley's throat. The sky grows dark, and heavy storm clouds roll overhead, blocking out the sun as a strong wind rises, causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground, prompting them to run for shelter as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track, with Dudley, who is overweight and finds it hard to keep up. Soaked to the skin, they find shelter in a long tunnel under the road and stop to catch their breath. Ahead of them, the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, throwing an eerie yellow light along the tunnel, and the dingy concrete walls are covered with graffiti. They look around nervously, their breath visible in the icy air, when a cloaked figure swoops in and grabs Harry. As Dudley flees, his legs are knocked from under him, and an unseen force drags him along the ground. A second skeletal figure floats closer above his face. A Dementor hovers in front of Harry, forcing him against the wall with his bony fingers around his throat, attempting to suck out his life. Harry struggles desperately as a faint vapor is drawn from his face, while the second Dementor floats above Dudley, sucking vapor from him. Harry pulls out his wand and strikes his attacker, causing the Dementor to release him. Harry falls heavily, dropping his wand, but grabs it as the cloaked figure swoops again, and a powerful bright light hurls his attacker away. Dudley lies helpless beneath the other Dementor, and Harry uses his wand to hurl the dazzling light towards it, causing the creature to fly from the underpass. Traffic roars past on the road above as Harry runs to Dudley, who is semi-conscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley, prompting Harry to try and hide his wand. The elderly woman stops, and they walk home, with Harry half-carrying the stupefied Dudley to number four Privet Drive, where Aunt Petunia is watching television.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The star pierces through the menacing tempest clouds, highlighting phrases in jagged metallic characters as the star blazes downward and a warmth shimmer lingers over residential London. Autos race along a dual roadway beside a meadow where the lawn is parched and arid. In a nook of the meadow is an abandoned play area. An adolescent youth, Harry Potter, strides across the meadow. In the play area, a youth dismounts the merry-go-round, and everybody departs. Harry perches on a swing immersed in contemplation. He notices his relative Dudley with his crew, and Harry extracts his rod, holding it to Dudley's neck. The heavens become dim, and dense tempest clouds roll overhead, obscuring the star as a fierce gust arises, causing the crew to flee. Dudley and Harry glance upward as the heavens become even denser while the mighty gust blows eddies of trash paper across the play area, urging them to dash for refuge as the tempest erupts and heavy precipitation begins to descend. Harry leads the route along a furrowed cart path, with Dudley, who is corpulent and struggles to maintain pace. Drenched to the hide, they discover refuge in a lengthy tunnel beneath the route and pause to recover their breath. A few of them, the filthy subway is dimly illuminated by amber lights mirrored in the pools of liquid beneath. The defective lights flicker and sizzle, casting a spectral amber glow along the tunnel, and the grimy concrete barriers are coated with graffiti. They glance around apprehensively, their breath perceptible in the frigid atmosphere, when a shrouded silhouette dives in and snatches Harry. As Dudley escapes, his limbs are swept from beneath him, and an invisible force drags him along the terrain. A second gaunt silhouette glides nearer above his visage. A Dementor hovers before Harry, forcing him against the barrier with his skeletal digits around his neck, attempting to draw out his essence. Harry fights frantically as a faint mist is drawn from his visage, while the second Dementor glides above Dudley, drawing mist from him. Harry extracts his rod and strikes his assailant, causing the Dementor to free him. Harry collapses forcefully, dropping his rod, but seizes it as the shrouded silhouette dives again, and a potent radiant light hurls his assailant away. Dudley lies powerless beneath the other Dementor, and Harry utilizes his rod to hurl the brilliant light towards it, causing the entity to fly from the subway. Vehicles roar by on the route above as Harry rushes to Dudley, who is semi-conscious and panting for breath. An aged lady wearing a plastic mac and rain cap enters the tunnel pulling a shopping cart, prompting Harry to attempt and conceal his rod. The aged lady pauses, and they stroll home, with Harry half-carrying the dazed Dudley to number four Privet Drive, where Aunt Petunia is viewing television."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The threatening storm clouds are broken through by the sun, illuminating words in spiky metal letters as the sun blazes down and a heat haze is hung over suburban London. A dual carriageway is sped along by cars beside a field where the grass has been scorched and left dry. In a corner of the field, a playground is neglected. The field is crossed by a teenage boy, Harry Potter. In the playground, a boy gets off the roundabout, and everyone leaves. A swing is sat on by Harry, lost in thought. He sees his cousin Dudley with his gang, and Dudley's throat is been pulled to by Harry, who pulls out his wand. The sky is grown dark, and heavy storm clouds roll overhead, blocking out the sun as a strong wind rises, causing the gang to run off. Dudley and Harry look up as the sky is grown even darker while the powerful wind blows flurries of waste paper across the playground, prompting them to run for shelter as the storm is broken and heavy rain begins to fall. The way is led along a rutted cart track by Harry, with Dudley, who is overweight and finds it hard to keep up. Soaked to the skin, shelter is found by them in a long tunnel under the road where they stop to catch their breath. Ahead of them, yellow lamps dimly light the grimy underpass, reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, throwing an eerie yellow light along the tunnel, and graffiti covers the dingy concrete walls. They look around nervously, their breath visible in the icy air, when Harry is grabbed by a cloaked figure swooping in. Dudley flees, and the unseen force knocks his legs from under him, dragging him along the ground. Closer above his face floats a second skeletal figure. In front of Harry, a Dementor hovers, forcing him against the wall with its bony fingers around his throat, while it attempts to suck out his life. Desperately, Harry struggles as a faint vapor is drawn from his face, while above Dudley, the second Dementor floats, sucking vapor from him. Harry pulls out his wand and strikes his attacker, the Dementor is caused to release him. Harry falls heavily, dropping his wand, but he grabs it as the cloaked figure swoops again, and a powerful bright light hurls his attacker away. Beneath the other Dementor, Dudley lies helpless, and Harry uses his wand to hurl the dazzling light towards it, causing the creature to be flown from the underpass. On the road above, traffic roars past as Harry runs to Dudley, who is semi-conscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley, prompting Harry to try and hide his wand. The elderly woman stops, and home is walked by them, with Harry half-carrying the stupefied Dudley to number four Privet Drive, where Aunt Petunia watches television."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The sun pierces storm clouds, casting light on spiky metal letters as heat shimmers over suburban London. Cars race along a dual carriageway beside a parched field with a neglected playground. Harry Potter crosses the field, sits on a swing, and spots his cousin Dudley with his gang. Harry draws his wand on Dudley as storm clouds darken the sky, prompting the gang to flee. As the wind rises, Harry and Dudley run for shelter from the rain. They find refuge in a dimly lit tunnel under the road, where flickering lamps cast an eerie glow on graffiti-covered walls. Suddenly, a cloaked figure grabs Harry, and Dudley is dragged by an unseen force. A Dementor attacks Harry, trying to drain his life, while another targets Dudley. Harry uses his wand to repel the Dementors with a bright light. Dudley lies helpless, and Harry drives the second Dementor away. As traffic roars above, Harry helps a semi-conscious Dudley. An elderly woman enters the tunnel, and Harry hides his wand. They walk home, with Harry supporting Dudley to number four Privet Drive, where Aunt Petunia watches TV."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The sun breaks through storm clouds, illuminating spiky metal letters as heat haze hangs over suburban London. Cars speed along a dual carriageway beside a scorched field with a neglected playground. Harry Potter walks across the field. A boy leaves the roundabout, and everyone departs. Harry sits on a swing, lost in thought, and sees his cousin Dudley with his gang. Harry pulls out his wand, holding it to Dudley's throat. The sky darkens, storm clouds roll in, and a strong wind rises, causing the gang to flee. Dudley and Harry look up as the sky darkens further, prompting them to seek shelter as heavy rain falls. Harry leads along a rutted track, with Dudley struggling to keep up. Soaked, they find shelter in a tunnel under the road. The dimly lit underpass has flickering lamps and graffiti-covered walls. Nervously, they see their breath in the icy air when a cloaked figure grabs Harry. Dudley flees but is dragged by an unseen force. A Dementor hovers over Harry, attempting to suck out his life. Harry struggles as vapor is drawn from his face, while another Dementor attacks Dudley. Harry uses his wand to strike his attacker, causing the Dementor to release him. He grabs his wand and hurls a bright light, driving the attacker away. Dudley lies helpless, and Harry uses his wand to repel the second Dementor. Traffic roars above as Harry runs to semi-conscious Dudley. An elderly woman enters the tunnel, prompting Harry to hide his wand. They walk home, with Harry half-carrying Dudley to number four Privet Drive, where Aunt Petunia watches TV."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The sun, in a dramatic display, breaks through the ominous and threatening storm clouds, casting its bright light on words formed in spiky metal letters. As the sun blazes down with intensity, a shimmering heat haze hangs over the suburban landscape of London. Cars zoom along a busy dual carriageway that runs beside a field where the grass is parched, scorched, and dry from the relentless sun. In one corner of this field lies a neglected playground, its equipment rusting and forlorn. A teenage boy, none other than Harry Potter, makes his way across the field. In the playground, a boy dismounts from the roundabout, and soon, everyone else leaves. Harry, deep in thought, sits on a swing, lost in his own world. He notices his cousin Dudley approaching with his gang, and Harry, feeling threatened, pulls out his wand, holding it menacingly to Dudley's throat. \n\nSuddenly, the sky begins to grow dark, and heavy storm clouds roll in overhead, effectively blocking out the sun. A strong wind rises, causing Dudley's gang to scatter and run off in fear. Both Dudley and Harry look up as the sky becomes even darker, while the powerful wind blows flurries of waste paper across the playground. This prompts them to seek shelter as the storm finally breaks, and heavy rain starts to pour down. Harry takes the lead along a rutted cart track, with Dudley, who is overweight and struggling to keep up, trailing behind. Completely soaked to the skin, they eventually find refuge in a long tunnel that runs under the road, where they stop to catch their breath. Ahead of them, the grimy underpass is dimly lit by yellow lamps, their light reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, casting an eerie yellow glow along the tunnel, while the dingy concrete walls are covered with graffiti.\n\nThey look around nervously, their breath visible in the icy air, when suddenly, a cloaked figure swoops in and grabs Harry. As Dudley attempts to flee, his legs are knocked from under him, and an unseen force drags him along the ground. A second skeletal figure floats closer, hovering ominously above his face. A Dementor, one of the terrifying creatures, hovers in front of Harry, forcing him against the wall with its bony fingers wrapped around his throat, attempting to suck out his very life. Harry struggles desperately as a faint vapor is drawn from his face, while the second Dementor floats above Dudley, similarly sucking vapor from him. In a moment of desperation, Harry pulls out his wand and strikes his attacker, causing the Dementor to release him. Harry falls heavily, dropping his wand, but quickly grabs it as the cloaked figure swoops again. With a powerful bright light, he hurls his attacker away. Dudley lies helpless beneath the other Dementor, and Harry uses his wand to send the dazzling light towards it, causing the creature to fly from the underpass.\n\nAbove them, traffic roars past on the road as Harry rushes to Dudley, who is semi-conscious and gasping for breath. An elderly woman, wearing a plastic mac and a rain hat, enters the tunnel, pulling a shopping trolley behind her, prompting Harry to try and hide his wand. The elderly woman stops, and together, they walk home, with Harry half-carrying the stupefied Dudley back to number four Privet Drive, where Aunt Petunia is inside, watching television."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The sun, in a dramatic and eye-catching display of nature's power, breaks forcefully through the ominous and threatening storm clouds, casting its vibrant and bright light onto words that are carefully crafted in spiky metal letters. As the sun blazes down with an unyielding intensity, a shimmering heat haze hovers and wavers over the suburban landscape of London, painting a vivid picture of the scene. Cars zoom along the bustling and busy dual carriageway that runs closely beside a field where the grass has become parched, scorched, and undeniably dry from the relentless and unforgiving rays of the sun. In one neglected corner of this field lies an abandoned playground, its equipment rusting and looking forlorn. A teenage boy, none other than the iconic Harry Potter, makes his way purposefully across the field. In the playground, another boy dismounts from the roundabout, and soon thereafter, everyone else leaves, leaving the area deserted. Harry, deep in thought and contemplation, sits pensively on a swing, lost in his own world. He notices his cousin Dudley making his approach, accompanied by his gang, and Harry, feeling threatened and on edge, pulls out his wand, holding it menacingly to Dudley's throat as a sign of warning.\n\nSuddenly, the sky begins to grow dark, with heavy storm clouds rolling in ominously overhead, effectively blocking out the once-bright sun. A strong wind rises, causing Dudley's gang to scatter and run off in a state of fear. Both Dudley and Harry look up as the sky becomes even darker, while the powerful wind blows flurries of waste paper across the playground, creating a scene of chaos. This prompts them to seek shelter as the storm finally breaks, and heavy rain starts to pour down incessantly. Harry takes the lead along a rutted cart track, with Dudley, who is overweight and struggling to keep up, trailing laboriously behind. Completely soaked to the skin, they eventually find refuge in a long tunnel that runs under the road, where they pause to catch their breath. Ahead of them, the grimy underpass is dimly lit by yellow lamps, their light reflected intermittently in the puddles of water underfoot. The faulty lamps flicker and fizz, casting an eerie yellow glow along the tunnel, while the dingy concrete walls are smeared with graffiti.\n\nThey look around nervously, their breath visible in the icy air, when suddenly, a cloaked figure swoops in swiftly and grabs Harry. As Dudley attempts to flee, his legs are knocked from under him, and an unseen force drags him along the ground forcefully. A second skeletal figure floats closer, hovering ominously above his face. A Dementor, one of the terrifying and fearsome creatures, hovers menacingly in front of Harry, forcing him against the wall with its bony fingers wrapped tightly around his throat, attempting to suck out his very life. Harry struggles desperately as a faint vapor is drawn from his face, while the second Dementor floats above Dudley, similarly sucking vapor from him with terrifying efficiency. In a moment of desperation, Harry pulls out his wand and strikes his attacker, causing the Dementor to release him. Harry falls heavily, dropping his wand in the process, but quickly grabs it as the cloaked figure swoops again menacingly. With a powerful and bright light, he hurls his attacker away forcefully. Dudley lies helpless beneath the other Dementor, and Harry uses his wand to send the dazzling light towards it, causing the creature to flee swiftly from the underpass.\n\nAbove them, traffic roars past on the road as Harry rushes to Dudley, who is semi-conscious and gasping for breath in a state of shock. An elderly woman, wearing a plastic mac and a protective rain hat, enters the tunnel, pulling a shopping trolley behind her, prompting Harry to try and hide his wand awkwardly. The elderly woman stops, and together, they walk home, with Harry half-carrying the stupefied and dazed Dudley back to number four Privet Drive, where Aunt Petunia is inside, watching television, completely unaware of the chaos that has unfolded outside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the sun breaks through the threatening storm clouds, its rays illuminate words in spiky metal letters, casting a bright light as the sun blazes down, creating a shimmering heat haze over suburban London. Cars speed along a dual carriageway that runs beside a field where the grass lies scorched and dry from the relentless sun. In one corner of this field, a neglected playground stands, its equipment worn and unused. A teenage boy, Harry Potter, walks purposefully across the field, his steps steady and deliberate. In the playground, a boy dismounts from the roundabout, and the other children follow suit, leaving the area deserted. Harry approaches the swing set, sits down on one of the swings, and becomes lost in thought, his mind wandering as he gently sways back and forth. His attention is drawn to his cousin Dudley, who appears with his gang, their presence disrupting the quiet. Harry, feeling the tension rise, reaches into his pocket, pulls out his wand, and holds it threateningly to Dudley's throat, a silent warning. Suddenly, the sky grows ominously dark as heavy storm clouds roll in overhead, blotting out the sun. A strong wind begins to rise, whipping through the playground and causing Dudley's gang to scatter in fear. Dudley and Harry look up, their eyes widening as the sky darkens further, and the powerful wind sends flurries of waste paper swirling across the playground. Realizing the impending danger, they turn and run for shelter as the storm breaks, and heavy rain starts to pour down. Harry takes the lead, guiding Dudley along a rutted cart track, the path uneven and challenging, especially for Dudley, who struggles to keep up due to his weight. Soaked to the skin, they finally find refuge in a long tunnel under the road, where they stop to catch their breath, the sound of their panting echoing off the walls. Ahead of them, the grimy underpass is dimly lit by yellow lamps, their light reflecting in the puddles of water that have collected underfoot. The faulty lamps flicker and fizz, casting an eerie yellow glow along the tunnel, while the dingy concrete walls are covered with graffiti, adding to the unsettling atmosphere. They glance around nervously, their breath visible in the icy air, when suddenly, a cloaked figure swoops in and seizes Harry, its grip firm and unyielding. As Dudley attempts to flee, his legs are swept out from under him, and an unseen force drags him along the ground, his cries for help echoing in the tunnel. A second skeletal figure floats closer, hovering ominously above his face. A Dementor confronts Harry, forcing him against the wall with its bony fingers wrapped around his throat, attempting to suck out his life force. Harry struggles desperately, feeling a faint vapor being drawn from his face, while the second Dementor hovers above Dudley, similarly extracting vapor from him. In a moment of desperation, Harry manages to pull out his wand and strikes his attacker, causing the Dementor to release him. He falls heavily to the ground, his wand slipping from his grasp, but he quickly retrieves it as the cloaked figure swoops again. Summoning all his strength, he conjures a powerful bright light that hurls his attacker away. Dudley lies helpless beneath the other Dementor, and Harry, determined to save him, uses his wand to send a dazzling light towards it, causing the creature to flee from the underpass. Above them, traffic roars past on the road, oblivious to the drama unfolding below. Harry rushes to Dudley's side, finding him semi-conscious and gasping for breath. Just then, an elderly woman wearing a plastic mac and rain hat enters the tunnel, pulling a shopping trolley behind her. Her unexpected presence prompts Harry to quickly try and hide his wand, not wanting to draw attention. The elderly woman pauses, observing the scene, and then they begin the walk home, with Harry half-carrying the stupefied Dudley back to number four Privet Drive, where Aunt Petunia sits watching television, unaware of the harrowing events that have just transpired."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The sun breaks through storm clouds, casting a heat haze over suburban London as cars speed along a dual carriageway beside a scorched field. In a neglected playground, Harry Potter sits on a swing, lost in thought, until he spots his cousin Dudley with his gang. As Harry confronts Dudley with his wand, the sky darkens, and a strong wind scatters the gang. With the storm breaking, Harry leads Dudley, struggling to keep up, to shelter in a tunnel under the road. The dimly lit underpass, flickering with faulty lamps, is covered in graffiti. Suddenly, a cloaked figure grabs Harry, and Dudley is dragged by an unseen force. A Dementor attacks Harry, attempting to suck out his life, while another targets Dudley. Harry fights back with his wand, releasing a bright light that repels the Dementors. As traffic roars above, Harry rushes to the semi-conscious Dudley. An elderly woman enters the tunnel, prompting Harry to hide his wand. Together, they walk home, with Harry supporting Dudley to number four Privet Drive, where Aunt Petunia is watching television."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The sun breaks through the threatening storm clouds, illuminating words in spiky metal letters on a derelict billboard that have been rusting away for years, as the sun blazes down and a heat haze hangs over suburban London, known for its unpredictable weather. Cars speed along a dual carriageway, a common British road layout with two lanes in each direction, beside a field where the grass is scorched and dry due to the recent heatwave. In a corner of the field is a neglected playground, once vibrant with children's laughter but now forgotten. A teenage boy, Harry Potter, who has spent his summer isolated and away from his magical school, walks across the field. In the playground, a boy gets off the roundabout, and everyone leaves as if sensing trouble. Harry sits on a swing lost in thought, contemplating the events of the past year. He sees his cousin Dudley, who often bullied him during their childhood, with his gang, and Harry pulls out his wand, a magical tool used by wizards to channel their powers, holding it to Dudley's throat. The sky grows dark, and heavy storm clouds, reminiscent of the tempestuous weather Harry has encountered in his magical life, roll overhead, blocking out the sun as a strong wind rises, causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper left by careless visitors across the playground, prompting them to run for shelter as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track, a remnant of older times when horse-drawn carts were common, with Dudley, who is overweight and finds it hard to keep up despite his efforts. Soaked to the skin, they find shelter in a long tunnel under the road, an underpass often used for pedestrian crossing, and stop to catch their breath. Ahead of them, the grimy underpass is dimly lit by yellow lamps, installed decades ago and never replaced, reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, throwing an eerie yellow light along the tunnel, and the dingy concrete walls are covered with graffiti, a testament to the rebellious spirit of local youths. They look around nervously, their breath visible in the icy air, when a cloaked figure, a menacing presence in the magical world, swoops in and grabs Harry. As Dudley flees, his legs are knocked from under him, and an unseen force, indicative of dark magic, drags him along the ground. A second skeletal figure floats closer above his face, embodying the cold fear of hopelessness. A Dementor, creatures known in the wizarding world for feeding on human happiness, hovers in front of Harry, forcing him against the wall with his bony fingers around his throat, attempting to suck out his life. Harry struggles desperately as a faint vapor, his essence of happiness and soul, is drawn from his face, while the second Dementor floats above Dudley, sucking vapor from him. Harry pulls out his wand and strikes his attacker, causing the Dementor to release him. Harry falls heavily, dropping his wand, but grabs it as the cloaked figure swoops again, and a powerful bright light, a Patronus Charm which repels these dark creatures, hurls his attacker away. Dudley lies helpless beneath the other Dementor, and Harry uses his wand to hurl the dazzling light towards it, causing the creature to fly from the underpass. Traffic roars past on the road above, oblivious to the drama unfolding below, as Harry runs to Dudley, who is semi-conscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat, a common attire for the wet British weather, enters the tunnel pulling a shopping trolley filled with groceries, prompting Harry to try and hide his wand. The elderly woman stops, taken aback by the situation, and they walk home, with Harry half-carrying the stupefied Dudley to number four Privet Drive, a typical suburban house where Aunt Petunia is watching television, unaware of the peril her son and nephew just faced."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London  Cars speed along a dual carriageway beside a field where the grass is scorched and dry  In a corner of the field is a neglected playground  Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up  Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath  Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot  The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti  They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry  As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground  A second skeletal figure floats closer above his face  A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life  Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him  Harry pulls out his wand and strikes his attacker causing the Dementor to release him  Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away  Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass  Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath  A teenage boy Harry Potter walks across the field  In the playground a boy gets off the roundabout and everyone leaves  Harry sits on a swing lost in thought  He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat  The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off  Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter  as the storm breaks and heavy rain begins to fall  Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up  Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath  Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot  The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti  They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry  As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground  A second skeletal figure floats closer above his face  A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life  Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him  Harry pulls out his wand and strikes his attacker causing the Dementor to release him  Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away  Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass  Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath  An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand  The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot. The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti. They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry. As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground. A second skeletal figure floats closer above his face. A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life. Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him. Harry pulls out his wand and strikes his attacker causing the Dementor to release him. Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away. Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass. Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand. The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot. The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti. They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry. As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground. A second skeletal figure floats closer above his face. A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life. Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him. Harry pulls out his wand and strikes his attacker causing the Dementor to release him. Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away. Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass. Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand. The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him. Harry pulls out his wand and strikes his attacker causing the Dementor to release him. Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away. Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass. Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand. The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath. An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand. The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The moon breaks through the threatening storm clouds, illuminating words in spiky metal letters as the moon blazes down and a heat haze hangs over suburban London. Birds speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage girl, Hermione Granger, walks across the field. In the playground, a cat gets off the roundabout, and everyone leaves. Hermione sits on a swing lost in thought. She sees her cousin Ron with his gang, and Hermione pulls out her wand, holding it to Ron's throat. The sky grows dark, and heavy storm clouds roll overhead, blocking out the moon as a strong wind rises, causing the gang to run off. Ron and Hermione look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground, prompting them to run for shelter as the storm breaks and heavy rain begins to fall. Hermione leads the way along a rutted cart track, with Ron, who is overweight and finds it hard to keep up. Soaked to the skin, they find shelter in a long tunnel under the road and stop to catch their breath. Ahead of them, the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, throwing an eerie yellow light along the tunnel, and the dingy concrete walls are covered with graffiti. They look around nervously, their breath visible in the icy air, when a cloaked figure swoops in and grabs Hermione. As Ron flees, his legs are knocked from under him, and an unseen force drags him along the ground. A second skeletal figure floats closer above his face. A Dementor hovers in front of Hermione, forcing her against the wall with his bony fingers around her throat, attempting to suck out her life. Hermione struggles desperately as a faint vapor is drawn from her face, while the second Dementor floats above Ron, sucking vapor from him. Hermione pulls out her wand and strikes her attacker, causing the Dementor to release her. Hermione falls heavily, dropping her wand, but grabs it as the cloaked figure swoops again, and a powerful bright light hurls her attacker away. Ron lies helpless beneath the other Dementor, and Hermione uses her wand to hurl the dazzling light towards it, causing the creature to fly from the underpass. Bicycles roar past on the road above as Hermione runs to Ron, who is semi-conscious and gasping for breath. A young man wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley, prompting Hermione to try and hide her wand. The young man stops, and they walk home, with Hermione half-carrying the stupefied Ron to number four Privet Drive, where Uncle Vernon is watching television."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The sun breaks through the threatening storm clouds, illuminating words in neon plastic letters as the sun blazes down, and a heat haze hangs over suburban London. Bicycles speed along a cobblestone lane beside an orchard where the trees are scorched and dry. In a corner of the orchard is a neglected skate park. A teenage boy, Harry Potter, walks across the orchard. In the skate park, a boy gets off the skateboard, and everyone leaves. Harry sits on a bench lost in thought. He sees his cousin Dudley with his gang, and Harry pulls out his locket, holding it to Dudley's throat. The sky grows dark, and heavy mist clouds roll overhead, blocking out the sun as a strong wind rises, causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of ticket stubs across the skate park, prompting them to run for shelter as the storm breaks and heavy rain begins to fall. Harry leads the way along a winding footpath, with Dudley, who is overweight and finds it hard to keep up. Soaked to the skin, they find shelter in a narrow alley under the railway and stop to catch their breath. Ahead of them, the grimy passage is dimly lit by red lamps reflected in the puddles of water underfoot. The faulty lamps flicker and fizz, throwing an eerie red light along the passage, and the dingy concrete walls are covered with posters. They look around nervously, their breath visible in the icy air, when a cloaked figure swoops in and grabs Harry. As Dudley flees, his legs are knocked from under him, and an unseen force drags him along the ground. A second skeletal figure floats closer above his face. A Dementor hovers in front of Harry, forcing him against the wall with his bony fingers around his throat, attempting to suck out his life. Harry struggles desperately as a faint vapor is drawn from his face, while the second Dementor floats above Dudley, sucking vapor from him. Harry pulls out his locket and strikes his attacker, causing the Dementor to release him. Harry falls heavily, dropping his locket, but grabs it as the cloaked figure swoops again, and a powerful bright light hurls his attacker away. Dudley lies helpless beneath the other Dementor, and Harry uses his locket to hurl the dazzling light towards it, causing the creature to fly from the passage. Cyclists whiz past on the path above as Harry runs to Dudley, who is semi-conscious and gasping for breath. An elderly woman wearing a rubber poncho and sun hat enters the passage pulling a stroller, prompting Harry to try and hide his locket. The elderly woman stops, and they walk home, with Harry half-carrying the stupefied Dudley to number four Lily Lane, where Aunt Petunia is watching the news."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The sun peeks through the looming storm clouds, highlighting words in jagged metal letters as the sun shines brightly and a gentle breeze hovers over suburban London. Cars cruise along a dual carriageway beside a field where the grass is lush and green. In a corner of the field is a pristine playground. A teenage boy, Harry Potter, skips across the field. In the playground, a boy hops off the roundabout, and everyone stays. Harry perches on a swing lost in thought. He spots his cousin Dudley with his gang, and Harry pulls out his wand, waving it around playfully. The sky brightens, and fluffy white clouds float overhead, revealing the sun as a gentle breeze arises, causing the gang to laugh. Dudley and Harry look up as the sky becomes clear while the mild wind carries leaves across the playground, prompting them to stroll leisurely as the shower pauses and soft droplets begin to mist. Harry leads the way along a smooth cart track, with Dudley, who is cheerful and matches his pace. Dry from the light drizzle, they explore a long tunnel under the road and pause to enjoy the ambiance. Ahead of them, the spotless underpass is warmly lit by orange lamps reflected in the crystalline water underfoot. The steady lamps glow continuously, casting a warm orange light along the tunnel, and the pristine concrete walls are adorned with murals. They look around calmly, their breath blending in the warm air, when a cloaked figure glides by and greets Harry. As Dudley chuckles, his legs carry him forward, and an unseen force gently aids him along the ground. A second ethereal figure hovers closer above his face. A Dementor floats in front of Harry, gently guiding him against the wall with his bony fingers around his shoulders, attempting to share his joy. Harry smiles serenely as a faint mist is released from his face, while the second Dementor hovers above Dudley, sharing mist with him. Harry pulls out his wand and taps his companion, causing the Dementor to embrace him. Harry lands softly, holding his wand, but grasps it as the cloaked figure glides again, and a gentle shimmering light drifts his companion away. Dudley rests peacefully beneath the other Dementor, and Harry uses his wand to guide the soft light towards it, causing the creature to journey from the underpass. Traffic whispers past on the road above as Harry strolls to Dudley, who is fully alert and breathing steadily. An elderly woman wearing a stylish mac and sun hat enters the tunnel wheeling a shopping trolley, prompting Harry to carefully display his wand. The elderly woman pauses, and they wander home, with Harry lightly assisting the jubilant Dudley to number four Privet Drive, where Aunt Petunia is enjoying a book."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The moon breaks through the gentle mist, illuminating books in silky fabric letters as the moon glimmers up and a frost crystalizes over coastal Paris. Bicycles glide along a single pathway beside a garden where the flowers are vibrant and lush. In a corner of the garden is a thriving marketplace. A young girl, Ron Weasley, strolls across the garden. In the marketplace, a girl gets off the seesaw, and nobody stays. Ron perches on a bench lost in thought. She notices her neighbor Hermione with her club, and Ron pulls out her spatula, holding it to Hermione's elbow. The ground grows silent, and gentle mist swirls overhead, dimming the moon as a gentle breeze rises, causing the club to wander off. Hermione and Ron glance up as the moon dims even more while the mellow breeze stirs clusters of flower petals across the marketplace, prompting them to stroll for cover as the mist swells and light fog begins to settle. Ron leads the way along an ancient cobblestone path, with Hermione, who is athletic and maintains a brisk pace. Shielded from the chill, they find cover in a wide entrance under the bridge and pause to regain their composure. Ahead of them, the clean corridor is softly lit by silver bulbs reflected in the pools of light above. The steady bulbs glimmer and hum, casting a mystical silver glow along the corridor, and the fresh brick walls are adorned with murals. They glance around cautiously, their whispers visible in the warm air, when a cloaked shadow glides in and holds Ron. As Hermione hurries, her arms are wrenched from under her, and an unseen force lifts her from the ground. A second ghostly shadow hovers nearer above her head. A Paladin looms in front of Ron, pressing her against the pillar with his shadowy hands around her wrist, attempting to absorb her soul. Ron fights frantically as a faint shimmer is drawn from her eyes, while the second Paladin hovers above Hermione, drawing mist from her. Ron pulls out her spatula and strikes her assailant, causing the Paladin to release her. Ron collapses heavily, dropping her spatula, but snatches it as the cloaked shadow glides again, and a blinding bright spark propels her assailant away. Hermione lies motionless beside the other Paladin, and Ron uses her spatula to cast the brilliant spark towards it, causing the shadow to glide from the corridor. Motorcycles whiz past on the bridge above as Ron hurries to Hermione, who is barely awake and struggling for calm. A young man wearing a cotton jacket and sun hat enters the corridor pulling a bicycle, prompting Ron to try and conceal her spatula. The young man pauses, and they amble home, with Ron half-dragging the confused Hermione to number seven Elm Street, where Cousin Vernon is reading a book."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The moon peeks through the tranquil misty clouds, highlighting phrases in delicate stone letters as the moon twinkles above and a cool mist settles over downtown Paris. Bicycles glide along a narrow alley beside a garden where the flowers are lush and vibrant. In a corner of the garden is a bustling market. An elderly woman, Hermione Granger, dances across the garden. In the market, a merchant gets off his stool, and everyone gathers. Hermione perches on a bench absorbed in contemplation. She notices her uncle Vernon with his choir, and Hermione pulls out her broomstick, pointing it to Vernon's chest. The ground brightens up, and gentle rain clouds drift past, unveiling the moon as a gentle breeze rises, urging the choir to sing along. Vernon and Hermione gaze down as the ground grows even brighter while the gentle breeze scatters petals across the market, encouraging them to dance for warmth as the drizzle ends and soft dew begins to settle. Hermione leads the way along a winding bike path, with Vernon, who is weary and struggles to keep pace. Enveloped in mist, they reach refuge in a short tunnel beneath the railway and pause to regain their composure. Beyond them, the tidy overpass is softly lit by blue lanterns reflected in the shallow pools of water underfoot. The steady lanterns glow and sway, casting a soothing blue light along the tunnel, and the clean brick walls are adorned with murals. They glance around eagerly, their footsteps echoing in the warm air, when a shadowy owl flutters in and nudges Hermione. As Vernon dances, his feet are swept out from under him, and a gentle breeze cradles him along the path. A second silent owl perches closer above his shoulder. A Pixie floats in front of Hermione, pushing her toward the ground with his feathery wings around her shoulders, attempting to tickle her to sleep. Hermione squirms gently as a soft mist is drawn from her hair, while the second Pixie hovers above Vernon, drawing mist from him. Hermione pulls out her broomstick and charms her companion, causing the Pixie to retreat. Hermione rises gracefully, clutching her broomstick, but steadies it as the shadowy owl flutters again, and a soothing soft glow calms her companion away. Vernon lies tranquil beneath the other Pixie, and Hermione uses her broomstick to send the calming glow towards it, encouraging the creature to float from the overpass. Birds chirp softly in the park above as Hermione dances to Vernon, who is dormant and resting peacefully. A young boy wearing a wool coat and rain boots enters the tunnel pushing a tricycle, prompting Hermione to tuck away her broomstick. The young boy pauses, and they stroll home, with Hermione gently guiding the serene Vernon to number nine Rue Lune, where Cousin Bathilda is reading a book."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The moon peeks through the scattered mist, casting shadows in twisted wooden shapes as the moon glows gently and a misty fog settles over downtown Paris. Bicycles crawl along a narrow pathway beside a garden where the flowers are wilting and brown. In a corner of the garden is an abandoned pond. A teenage boy, Harry Potter, skips across the garden. In the pond, a child jumps off the seesaw, and everyone disappears. Harry perches on a bench lost in daydreams. He spots his cousin Dudley with his crew, and Harry pulls out his pen, pressing it to Dudley's shoulder. The stars twinkle brightly, and wispy fog wisps drift overhead, dimming the moon as a soft breeze stirs, causing the crew to stroll away. Dudley and Harry glance upwards as the stars twinkle more brightly while the gentle breeze carries flutters of autumn leaves across the pond area, prompting them to wander for cover as the drizzle begins and light snow starts to fall. Harry guides the way along a narrow footpath, with Dudley, who is clumsy and struggles to keep up. Drenched to the bone, they discover refuge in a short bridge over the canal and pause to rest. Ahead of them, the narrow bridge is softly illuminated by orange bulbs reflected in the icy slush beneath. The flickering bulbs flash and hum, casting an unsettling orange glow along the bridge, and the worn wooden beams are marked with carvings. They glance around anxiously, their breath visible in the chilly air, when a veiled creature glides in and seizes Harry. As Dudley scampers, his shoes are pulled from beneath him, and an invisible force slides him along the ground. A second skeletal entity drifts closer above his head. A Dementor floats before Harry, pinning him against the wall with his brittle claws around his shoulder, trying to drain his spirit. Harry wrestles frantically as a thin mist is drawn from his forehead, while the second Dementor hovers over Dudley, draining mist from him. Harry retrieves his pen and flicks at his assailant, causing the Dementor to loosen its grip. Harry tumbles awkwardly, dropping his pen, but snatches it as the veiled creature glides again, and a brilliant beam repels his assailant away. Dudley lies motionless beneath the other Dementor, and Harry waves his pen to send the bright beam towards it, causing the entity to flee from the bridge. Bicycles murmur past on the pathway above as Harry rushes to Dudley, who is barely conscious and wheezing for air. An old woman wearing a thick coat and woolen hat steps into the bridge pulling a suitcase, prompting Harry to attempt to conceal his pen. The old woman pauses, and they stroll home, with Harry half-supporting the bewildered Dudley to number four, Rue de la Fleur, where Aunt Petunia is listening to the radio."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The moon slips behind the lazy mist shrouds, obscuring numbers in bubbly plastic symbols as the moon cools down and a light frost settles over rural Dublin. Bicycles crawl along a single pathway beside a pond where the water is vibrant and fresh. In a corner of the pond is a bustling garden. An elderly woman, Lucy Skywalker, glides across the pond. In the garden, a girl jumps on a trampoline, and nobody stays. Lucy rests on a bench consumed by curiosity. She hears her uncle Marvin with his crew, and Lucy pulls out her umbrella, pointing it at Marvin's nose. The ground lightens up, and soft mist veils float underneath, letting in the moon as a gentle breeze falls, encouraging the crew to stroll away. Marvin and Lucy gaze down as the earth lightens even more while the gentle breeze flutters waves of leaves across the garden, urging them to leap for cover as the mist settles and delicate snow starts to drift. Lucy guides the path along a smooth rail track, with Marvin, who is nimble and finds it hard to slow down. Wrapped in warmth, they discover cover under a wide canopy beside the trail and pause to steady their hearts. Beside them, the polished surface is brightly lit by blue lamps shining in the ripples of ice above. The steady lamps beam and glow, casting a calm blue haze across the canopy, and the clean glass walls are painted with cartoons. They glance down confidently, their whispers silent in the warm breeze, when a caped animal crawls in and holds Lucy. As Marvin charges, his arms are pulled over him, and a visible presence lifts him off the ceiling. A third furry beast skims farther beneath his feet. A phantom floats beside Lucy, pressing her over the ceiling with his fluffy paws around her neck, working to drain out her energy. Lucy dances happily as a thick fog is blown from her feet, while the third phantom floats beside Marvin, inhaling fog from him. Lucy pulls out her umbrella and pushes her supporter, leading the phantom to aid her. Lucy bounces lightly, adjusting her umbrella, but holds it as the caped animal crawls away, and a gentle soft mist attracts her supporter closer. Marvin rests gracefully inside the third phantom, and Lucy applies her umbrella to draw the gentle mist away from it, causing the creation to drift into the canopy. Clouds whisper near on the sky beyond as Lucy smiles at Marvin, who is half-sleeping and resting in calm. A young man wearing a cotton coat and sun hat exits the canopy pushing a cart of apples, encouraging Lucy to attempt to show her umbrella. The young man glides, and they stroll away, with Lucy half-pulling the tranquil Marvin to number ten Maple Avenue, where Uncle Albert is playing checkers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The sun breaks through storm clouds over suburban London, casting a heat haze. Harry Potter crosses a scorched field to a playground. There, he encounters his cousin Dudley and his gang, pulling out his wand as darkness and wind rise, scattering the gang. As rain falls, Harry and overweight Dudley seek refuge in a dimly lit tunnel. Suddenly, a cloaked Dementor attacks Harry, trying to suck out his life. Another Dementor targets Dudley. Harry struggles but uses his wand to emit a bright light, repelling the Dementors. He aids a semi-conscious Dudley, and together they head home, where Harry helps Dudley to number four, Privet Drive."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand  Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath  Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass  Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away  Harry pulls out his wand and strikes his attacker causing the Dementor to release him  Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him  A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life  A second skeletal figure floats closer above his face  As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground  They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry  The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti  Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot  Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath  Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up  as the storm breaks and heavy rain begins to fall  Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter  The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off  He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat  Harry sits on a swing lost in thought  In the playground a boy gets off the roundabout and everyone leaves  A teenage boy Harry Potter walks across the field  In a corner of the field is a neglected playground  Cars speed along a dual carriageway beside a field where the grass is scorched and dry  The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground  Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass  Harry pulls out his wand and strikes his attacker causing the Dementor to release him  A second skeletal figure floats closer above his face  Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him  Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath  A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life  They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry  The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off  The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London  Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away  as the storm breaks and heavy rain begins to fall  An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand  Harry sits on a swing lost in thought  Cars speed along a dual carriageway beside a field where the grass is scorched and dry  Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot  In a corner of the field is a neglected playground  A teenage boy Harry Potter walks across the field  The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat  In the playground a boy gets off the roundabout and everyone leaves  Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter  Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up  The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti  Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The faulty lamps flicker and fizz throwing an eerie yellow light along the tunnel and the dingy concrete walls are covered with graffiti  They look around nervously their breath visible in the icy air when a cloaked figure swoops in and grabs Harry  As Dudley flees his legs are knocked from under him and an unseen force drags him along the ground  A second skeletal figure floats closer above his face  A Dementor hovers in front of Harry forcing him against the wall with his bony fingers around his throat attempting to suck out his life  Harry struggles desperately as a faint vapor is drawn from his face while the second Dementor floats above Dudley sucking vapor from him  Harry pulls out his wand and strikes his attacker causing the Dementor to release him  Harry falls heavily dropping his wand but grabs it as the cloaked figure swoops again and a powerful bright light hurls his attacker away  Dudley lies helpless beneath the other Dementor and Harry uses his wand to hurl the dazzling light towards it causing the creature to fly from the underpass  Traffic roars past on the road above as Harry runs to Dudley who is semiconscious and gasping for breath  An elderly woman wearing a plastic mac and rain hat enters the tunnel pulling a shopping trolley prompting Harry to try and hide his wand  The elderly woman stops and they walk home with Harry halfcarrying the stupefied Dudley to number four Privet Drive where Aunt Petunia is watching television The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London  Cars speed along a dual carriageway beside a field where the grass is scorched and dry  In a corner of the field is a neglected playground  A teenage boy Harry Potter walks across the field  In the playground a boy gets off the roundabout and everyone leaves  Harry sits on a swing lost in thought  He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat  The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off  Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter  as the storm breaks and heavy rain begins to fall  Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up  Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath  Ahead of them the grimy underpass is dimly lit by yellow lamps reflected in the puddles of water underfoot "
        }
      ]
    }
  ]
}