{
  "ground_truth": "Pettigrew grabs Lupin's wand, turns back into a rat, and runs off, leaving only a pile of clothes. Hermione grabs Harry's arm to stop him from following. Lupin's fingers turn to claws, he bursts out of his clothes, his limbs grow thin and twisted, his face becomes a long snout with sharp teeth, and he flings Sirius aside and stands whimpering. Hermione slowly approaches, and the creature looks at her pathetically before howling to the moon. Snape appears, and the werewolf lashes out at him. The black dog leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling, then both leap to the attack, colliding in mid-air, then falling, snarling and biting. The dog runs off, chased by the werewolf. Harry follows and sees the werewolf hurling the dog against a rock. Harry throws a stone and hits the werewolf on the back of the head, causing it to turn slowly and lope menacingly toward him. It stops, lifts its head, and runs toward the sound of howling. From where the dog fell, a figure gets up and limps away through the bushes. Harry follows the figure, hurrying through the trees toward the moonlit lake, running down the bank and across the stony shore to the edge of the water. Sirius is lying on his back, his eyes closed, with a bloody claw mark on his shoulder. The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake. Sirius opens his eyes and shudders with horror. Harry looks up to see a swarm of hooded Dementors circling above their heads, their black cloaks fluttering behind them. One swoops down and attacks Sirius. Harry pulls out his wand and points it at the Dementors, forming a silver mist as a protective shield that holds the Dementors back. But the power of Harry's wand fades, and the Dementors return to the attack. He cries out in horror as he falls back onto the stony beach beside Sirius. The Dementors circle overhead again, then swoop lower and lower, hovering over the two figures lying helpless below as life is gradually sucked out of them. A faint, silvery breath floats from Sirius' half-open mouth, illuminating his face. Exhausted, Harry lifts his head and, to his surprise, sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake: a magnificent silver stag with huge antlers stands facing him, glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again, they are turned back by a powerful invisible shield and swoop away over Harry's head.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Pettigrew seizes Lupin's wand, morphs back into a rat, and dashes off, leaving only a heap of garments. Hermione grabs Harry's arm to halt him from pursuing. Lupin's fingers change to talons, he bursts out of his garments, his limbs grow slender and contorted, his face becomes a long snout with sharp fangs, and he hurls Sirius aside and stands whimpering. Hermione slowly nears, and the creature looks at her plaintively before baying to the moon. Snape materializes, and the werewolf lashes out at him. The black canine leaps out of the shadows and knocks the werewolf to the ground. The beasts confront each other growling, then both leap to the assault, colliding in mid-air, then tumbling, snarling and biting. The canine dashes off, pursued by the werewolf. Harry follows and sees the werewolf hurling the canine against a boulder. Harry throws a stone and strikes the werewolf on the back of the head, causing it to turn slowly and lope menacingly toward him. It halts, lifts its head, and rushes toward the sound of baying. From where the canine fell, a silhouette gets up and limps away through the shrubs. Harry follows the silhouette, hurrying through the trees toward the moonlit lake, sprinting down the bank and across the stony shore to the edge of the water. Sirius is lying on his back, his eyes closed, with a bloody talon mark on his shoulder. The water lapping the shore ceases moving as a sheet of crackling ice spreads over the surface of the lake. Sirius opens his eyes and shudders with terror. Harry looks up to see a multitude of hooded Dementors circling above their heads, their black cloaks fluttering behind them. One swoops down and attacks Sirius. Harry pulls out his wand and points it at the Dementors, forming a silver haze as a protective barrier that holds the Dementors back. But the strength of Harry's wand diminishes, and the Dementors return to the assault. He cries out in terror as he falls back onto the stony strand beside Sirius. The Dementors circle overhead again, then swoop lower and lower, hovering over the two silhouettes lying helpless below as life is gradually sucked out of them. A faint, silvery breath floats from Sirius' half-open mouth, illuminating his visage. Drained, Harry lifts his head and, to his astonishment, sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake: a magnificent silver stag with enormous antlers stands facing him, glowing amongst the trees. Harry gazes at the beautiful creature as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again, they are turned back by a potent invisible barrier and swoop away over Harry's head."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Pettigrew’s wand is grabbed by him, he is turned back into a rat, and he is run off with only a pile of clothes left behind. Harry's arm is grabbed by Hermione to stop him from following. Claws are turned from Lupin’s fingers, his clothes are burst out of by him, his limbs are grown thin and twisted, a long snout with sharp teeth is formed by his face, and Sirius is flung aside by him as he stands whimpering. Hermione approaches slowly, and she is looked at pathetically by the creature before a howl is given to the moon by it. Snape appears, and he is lashed at by the werewolf. Out of the shadows leaps the black dog, and the werewolf is knocked to the ground by it. Each other are faced by the animals growling, then the attack is leapt to by both, they are collided in mid-air, then snarling and biting, they are fallen. The dog is run off with, and it is chased by the werewolf. The werewolf is seen by Harry as it hurls the dog against a rock. A stone is thrown by Harry, and the werewolf is hit on the back of the head by it, causing a slow turn and a menacing lope toward him. It is stopped, its head is lifted, and it is run toward the sound of howling. A figure gets up from where the dog fell and is limped away through the bushes. The figure is followed by Harry, he hurries through the trees toward the moonlit lake, is run down the bank and across the stony shore to the edge of the water. On his back Sirius is lying, his eyes closed, with a bloody claw mark on his shoulder. The shore is stopped from moving by the water lapping as a sheet of crackling ice is spread over the surface of the lake. His eyes are opened by Sirius, and horror shudders him. Above their heads, Harry looks up to see a swarm of hooded Dementors circling, their black cloaks flutter behind them. Down swoops one and Sirius is attacked by it. Out comes Harry’s wand and at the Dementors, it is pointed by him, forming a silver mist as a protective shield that holds the Dementors back. But the power of his wand diminishes, and they return to the attack. He cries out in horror as back, he falls onto the stony beach beside Sirius. Overhead, the Dementors are circled again, then lower and lower they swoop, hovering over the two figures lying helpless below as life gradually is sucked out of them. From Sirius' half-open mouth, a faint, silvery breath floats, illuminating his face. Exhausted, his head is lifted by Harry and, to his surprise, he sees the harmlessly floating Dementors. On the far side of the frozen lake, something shining is seen by him: a magnificent silver stag with huge antlers stands facing him, glowing amongst the trees. At the beautiful animal, he gazes as the dazzling light surrounding the stag is grown even brighter. As the Dementors start to move again, back are they turned by a powerful invisible shield and are swooped away over Harry's head."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Pettigrew grabs Lupin's wand, turns into a rat, and escapes, leaving a pile of clothes. Hermione stops Harry from following. Lupin transforms into a werewolf, flinging Sirius aside. Hermione approaches, and the creature howls at the moon. Snape appears, and the werewolf attacks him. A black dog leaps from the shadows, tackling the werewolf. They fight, then the dog runs off, pursued by the werewolf. Harry follows and sees the werewolf slam the dog against a rock. Harry throws a stone at the werewolf, which turns and lopes toward him but stops and runs to a howling sound. A figure limps away where the dog fell, and Harry follows to a moonlit lake. Sirius lies with a bloody shoulder as ice covers the lake. Dementors circle above, and one attacks Sirius. Harry uses his wand to repel them with a silver mist, but the protection fades. He falls beside Sirius as Dementors hover, draining their life. A silvery breath from Sirius' mouth lights his face. Exhausted, Harry sees the Dementors retreat, turned back by a glowing silver stag on the lake's far side. The light from the stag brightens, and the Dementors are driven away."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Pettigrew grabs Lupin's wand, becomes a rat, and escapes, leaving clothes behind. Hermione stops Harry from following. Lupin transforms into a werewolf, flinging Sirius aside and standing whimpering. Hermione approaches, and it howls at the moon. Snape appears, and the werewolf attacks him. A black dog tackles the werewolf, and they fight fiercely before the dog runs off, chased by the werewolf. Harry follows and sees the werewolf throw the dog against a rock. Harry hits the werewolf with a stone, making it turn and approach him, but it hears howling and leaves. A figure limps away, and Harry follows to a moonlit lake. Sirius lies with a claw mark on his shoulder as ice spreads over the lake. Sirius shudders as Dementors circle above. One attacks Sirius, and Harry uses his wand to create a silver mist shield, but it fades, and Dementors attack again. Harry falls beside Sirius, and the Dementors hover, draining their life. A silver breath escapes Sirius, illuminating his face. Exhausted, Harry sees the Dementors floating harmlessly and a shining silver stag on the lake's far side. The stag's dazzling light grows brighter, and Dementors are driven back by an invisible shield, swooping away over Harry."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Pettigrew quickly seizes Lupin's wand, deftly transforming back into his rat form, and hastily scurries away, leaving nothing behind except for a scattered pile of discarded clothes. Hermione urgently grabs onto Harry's arm to prevent him from rushing after Pettigrew. Meanwhile, Lupin's fingers begin to morph into sharp claws, as he violently bursts out of his clothes. His limbs become thin and grotesquely twisted, while his face elongates into a long snout filled with sharp, menacing teeth. With a sudden burst of strength, he flings Sirius aside and stands there, whimpering loudly. Cautiously and slowly, Hermione begins to approach, and the creature turns to look at her with a pathetic expression before letting out a haunting howl directed at the full moon above. Snape makes an appearance, and the werewolf turns its aggression toward him, lashing out violently. Suddenly, a large black dog emerges from the shadows, leaping forth to knock the werewolf to the ground. The two creatures face each other, growling ferociously before both of them leap into an attack, colliding forcefully in mid-air, and then falling to the ground, snarling and biting viciously. The dog then takes off running, with the werewolf hot on its heels. \n\nHarry follows the chase and witnesses the werewolf brutally hurling the dog against a hard rock. With determination, Harry picks up a stone and hurls it, striking the werewolf on the back of its head. This distraction causes it to slowly turn and begin to lurch menacingly toward Harry. However, it halts, lifts its head high, and runs off in the direction of distant howling. From the spot where the dog had fallen, a human figure gradually rises and starts to limp away through the dense bushes. Harry gives chase, hurriedly weaving through the trees toward the moonlit lake, racing down the sloping bank and across the stony shore to the water's edge. There, he finds Sirius lying on his back, his eyes closed, with a bloody claw mark visible on his shoulder. The gentle water lapping at the shore comes to a standstill as a sheet of crackling ice begins to spread across the surface of the moonlit lake. Sirius stirs, opening his eyes, visibly shuddering with horror. \n\nHarry glances upward to see a chilling swarm of hooded Dementors circling ominously above their heads, their black cloaks fluttering eerily in the air. One of the Dementors swoops down and attacks Sirius. Reacting quickly, Harry pulls out his wand and points it at the encroaching Dementors, conjuring a silver mist that forms a protective shield, managing to push back the Dementors temporarily. However, the power emanating from Harry's wand begins to fade, and the relentless Dementors return to continue their attack. In horror, he cries out as he collapses backward onto the stony beach beside Sirius. The Dementors circle eerily overhead once more, then swoop lower and lower, hovering over the two helpless figures below, as life is gradually drained from them. A faint, silvery breath floats gently from Sirius' half-open mouth, illuminating his gaunt face. Exhausted, Harry lifts his head and, to his utter surprise, sees the Dementors floating harmlessly. Across the frozen lake, something radiant catches his eye: a magnificent silver stag with enormous antlers stands proudly, glowing amidst the trees. Harry gazes in awe at the beautiful creature, as the dazzling light surrounding the stag continues to grow even brighter. As the Dementors begin to advance once again, they are forcibly turned back by a powerful invisible shield and are compelled to swoop away, retreating over Harry's head."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Pettigrew, acting with haste and dexterity, swiftly seizes Lupin's wand and then deftly transforms back into his small, rat form. He scurries away with great urgency, leaving behind nothing more than a disorganized heap of discarded clothes scattered across the ground. Hermione, acting with urgency, grabs onto Harry's arm firmly, preventing him from impulsively rushing after Pettigrew. Meanwhile, a disturbing transformation occurs as Lupin's fingers begin to morph into sharp, dangerous claws. Violently, he bursts out of his clothes, his limbs becoming thin and grotesquely twisted. His face undergoes a terrifying change, elongating into a long snout filled with a row of sharp, menacing teeth. With a sudden and forceful burst of strength, he flings Sirius aside and stands in place, whimpering loudly. Hermion cautiously approaches him, moving slowly. The creature turns its gaze towards her with a pitiful expression before letting out a haunting, bone-chilling howl directed at the full moon that hangs above. Just then, Snape arrives on the scene, and the werewolf turns its aggressive focus toward him, lashing out with violent intent. Suddenly, from the shadows, a large black dog emerges and leaps forth, knocking the werewolf to the ground. The two creatures confront one another, growling ferociously. They both leap into an attack, colliding forcefully in mid-air, then fall to the ground, engaging in a vicious encounter of snarling and biting. The black dog then takes off running, with the werewolf relentlessly pursuing it hot on its heels.\n\nHarry decides to follow the intense chase and witnesses the werewolf brutally hurling the dog against a hard, unforgiving rock. With determination and quick thinking, Harry picks up a stone from the ground and hurls it, striking the werewolf on the back of its head. This unexpected distraction causes the werewolf to slowly turn around and begin to lurch menacingly toward Harry. However, it abruptly halts, lifts its head high to listen, and then suddenly runs off in the direction of distant howling. In the spot where the dog had fallen, a human figure gradually rises and starts to limp away, moving through the dense bushes. Harry gives chase, hurriedly weaving through the trees, making his way toward the moonlit lake. He races down the sloping bank and crosses the stony shore to reach the water's edge. There, he discovers Sirius lying on his back, eyes closed, with a bloody claw mark visibly etched on his shoulder. As the gentle water laps at the shore, it comes to a standstill, and a sheet of crackling ice begins to spread ominously across the surface of the moonlit lake. Sirius stirs slightly, opening his eyes, visibly shuddering with horror at the scene unfolding.\n\nHarry glances upward to witness a chilling sight: a swarm of hooded Dementors circling ominously above their heads, their black cloaks fluttering eerily in the air. One of the Dementors swoops down with intent and attacks Sirius. Reacting quickly, Harry pulls out his wand and points it at the approaching Dementors, conjuring a protective silver mist that forms a temporary shield, managing to push the sinister creatures back. However, the power emanating from Harry's wand begins to fade, allowing the relentless Dementors to return and continue their menacing attack. In horror, Harry cries out as he collapses backward onto the stony beach beside Sirius. The Dementors circle overhead once more in an eerie manner, then swoop lower and lower, hovering threateningly over the two helpless figures, as life is gradually drained from them. A faint, silvery breath floats gently from Sirius' half-open mouth, illuminating his gaunt and weary face. Exhausted, Harry lifts his head and, to his utter shock and surprise, sees the Dementors floating harmlessly. Across the frozen, moonlit lake, something radiant catches his eye: a magnificent silver stag with enormous, majestic antlers stands proudly, glowing amidst the trees. Harry gazes in awe at the breathtakingly beautiful creature, as the dazzling light surrounding the stag continues to grow even brighter. As the Dementors begin to advance once again, they are forcibly turned back by a powerful invisible shield, compelling them to swoop away, retreating over Harry's head and leaving the scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Pettigrew hastily snatches Lupin's wand from the ground, clenching it tightly before swiftly reverting to his Animagus form, transforming into a small rat in the blink of an eye. He scurries away with urgency, leaving behind nothing but a heap of abandoned clothes on the ground where he stood a moment ago. Hermione, acting quickly, reaches out and firmly grasps Harry's arm, halting him in his tracks to prevent him from instinctively giving chase. Meanwhile, Lupin undergoes a startling transformation, his fingers elongating and morphing into sharp claws as a ripple of change courses through his body. He violently erupts out of his garments, leaving them shredded around him, while his limbs stretch painfully, growing gaunt and contorted. His face reshapes itself into an elongated muzzle equipped with fierce, sharp teeth, and with a fierce motion, he hurls Sirius aside and stands, emitting a pitiful whimpering sound. Hermione, filled with a mix of bravery and caution, slowly steps forward, her eyes fixed on the creature, which returns her gaze with a pathetic expression before tilting its head back and releasing a mournful howl toward the moon hanging above. At that moment, Snape materializes on the scene, only to find himself immediately targeted by the werewolf, which lashes out aggressively. Out of the shadowy depths, a large black dog suddenly leaps into view, launching itself at the werewolf and knocking it forcefully to the ground. The two animals stand, eyeing each other with a mutual growl, before both spring into a fierce attack, meeting mid-air in a chaotic tangle of fur, teeth, and claws, and finally crashing to the ground in a snarling, biting struggle. The black dog then breaks free and sprints away, pursued relentlessly by the werewolf. Harry finds himself compelled to follow this chaotic chase, witnessing the werewolf viciously slam the dog against a rock. Reacting swiftly, Harry grabs a stone from the ground and throws it with all his might, striking the werewolf on the back of its head. The creature halts, turning slowly to fix its predatory gaze on Harry, before abruptly lifting its head and charging in the direction of the distant, haunting sound of howling. As the werewolf disappears, Harry spots a figure rising unsteadily from the spot where the black dog had fallen, limping away awkwardly through the dense foliage. Determined, Harry races after the retreating silhouette, winding his way through the moonlit trees until he reaches the serene lake. Once at the shore, he navigates the stony terrain, descending down the bank to where the gentle waves touch the edge. There, lying prone with eyes shut tight and a bleeding scratch marring his shoulder, is Sirius. Suddenly, the water's surface ceases its rhythmic motion as sheets of crackling ice creep across, freezing the lake in an instant. Sirius' eyes flutter open in horror as he gazes skyward. Harry, following his gaze, sees a swarm of hooded Dementors, their cloaks billowing in the air as they circle ominously overhead. One of the spectral beings swoops down aggressively, setting upon Sirius. Quick to react, Harry draws his wand, aiming it with determination at the throng of Dementors, and conjures a protective silver mist that forms a shield around them, momentarily holding the dark threat at bay. But the strength of Harry's magic wanes; the shimmering mist fades, allowing the Dementors to resume their menacing advance. Overcome with terror, Harry cries out as he collapses backwards onto the rocky shore beside Sirius. The Dementors hover malignantly, spiraling closer with each pass, as they begin to extract the very essence of life from the two defenseless figures below them. From Sirius' half-open mouth, a delicate, translucent breath escapes, catching the eerie moonlight as it floats upwards. Despite his fatigue, Harry lifts his head and is astounded to see the Dementors suddenly held at bay, unable to approach any further. Across the frozen expanse of the lake, he notices a radiant glow—a spectacular silver stag with grand antlers has appeared, standing with noble grace amidst the trees, its luminous form intensifying with every second. Harry stares, captivated by this awe-inspiring sight, as the brilliant light emanating from the stag swells in size and intensity. As if repelled by an invisible force, the resurgent Dementors are driven back, retreating into the night sky, sweeping away above Harry's head and leaving the scene in peace."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Pettigrew seizes Lupin's wand, transforms into a rat, and escapes, leaving behind his clothes. Hermione restrains Harry from pursuing him. Meanwhile, Lupin undergoes a painful transformation into a werewolf, casting aside his clothes, his body contorting and face elongating into a snout with sharp teeth, and then knocking Sirius aside. As Hermione cautiously approaches, the werewolf howls at the moon. Snape arrives, only to be attacked by the werewolf, but is saved when a black dog emerges and tackles the creature. They confront each other with growls, then engage in a fierce mid-air collision before the dog retreats, pursued by the werewolf. Harry witnesses the werewolf assaulting the dog against a rock and intervenes by throwing a stone, which diverts the creature's attention. As the werewolf departs, responding to distant howls, a figure rises from where the dog had been, and Harry follows it through the woods to a moonlit lake. There, Sirius lies injured, marked by a bloody claw. Suddenly, the lake freezes over, and a swarm of Dementors descends, their black cloaks billowing. When one attacks Sirius, Harry conjures a protective silver mist with his wand, but it's not enough to repel them for long. As the Dementors close in, Harry collapses beside Sirius, feeling their life being drained away. Suddenly, he notices a radiant silver stag standing across the frozen lake, its presence growing brighter. This stag forms a powerful shield, driving the Dementors away."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Pettigrew, in his desperation to escape capture by his former friends, grabs Lupin's wand, turns back into a rat through his skills as an Animagus—a wizard who can transform into an animal at will—and runs off, leaving only a pile of clothes. Hermione, aware of the dangers they face, grabs Harry's arm to stop him from following. Lupin's fingers turn to claws as he involuntarily transforms, a painful process that afflicts werewolves under the full moon, and he bursts out of his clothes. His limbs grow thin and twisted, his face becomes a long snout with sharp teeth, and he flings Sirius, who once served as his closest friend during their time at Hogwarts School of Witchcraft and Wizardry, aside and stands whimpering. Hermione slowly approaches, and the creature looks at her pathetically before howling to the moon, a characteristic response to the lunar cycle among werewolves. Snape, who harbors a long-standing grudge against Lupin and Sirius dating back to their school days, appears, and the werewolf lashes out at him. The black dog, which is actually Sirius in his Animagus form, a huge black dog resembling the mythical Grim, leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling, then both leap to the attack, colliding in mid-air, then falling, snarling and biting. The dog, intent on drawing the werewolf away from his friends, runs off, chased by the werewolf. Harry follows and sees the werewolf hurling the dog against a rock, a maneuver showcasing the werewolf's formidable strength. Harry throws a stone and hits the werewolf on the back of the head, causing it to turn slowly and lope menacingly toward him. It stops, lifts its head, and runs toward the sound of howling, which echoes eerily across the landscape. From where the dog fell, a figure—Sirius in his human form—gets up and limps away through the bushes. Harry follows the figure, hurrying through the trees toward the moonlit lake, known for its eerily beautiful tranquility under the night sky, running down the bank and across the stony shore to the edge of the water. Sirius is lying on his back, his eyes closed, with a bloody claw mark on his shoulder, a testament to the ferocity of the werewolf attack. The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake, a chilling effect linked to the presence of Dementors, the dark creatures that feed on human happiness. Sirius opens his eyes and shudders with horror. Harry looks up to see a swarm of hooded Dementors circling above their heads, their black cloaks fluttering behind them, causing the air to grow colder and more oppressive. One swoops down and attacks Sirius. Harry, remembering his lessons on defensive spells taught to him by Lupin, pulls out his wand and points it at the Dementors, forming a silver mist as a protective shield that holds the Dementors back. But the power of Harry's wand fades, revealing his inexperience with the complex Patronus Charm, and the Dementors return to the attack. He cries out in horror as he falls back onto the stony beach beside Sirius. The Dementors circle overhead again, then swoop lower and lower, hovering over the two figures lying helpless below as life is gradually sucked out of them. A faint, silvery breath, a sign of a person's soul being drained, floats from Sirius' half-open mouth, illuminating his face. Exhausted, Harry lifts his head and, to his surprise, sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake: a magnificent silver stag with huge antlers, a manifestation of Harry's Patronus that symbolizes protection, stands facing him, glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again, they are turned back by a powerful invisible shield, created by the stag's presence, and swoop away over Harry's head."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Hermione grabs Harry's arm to stop him from following Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes The dog runs off chased by the werewolf Hermione grabs Harry's arm to stop him from following But the power of Harry's wand fades and the Dementors return to the attack Lupin's fingers turn to claws he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering Hermione slowly approaches and the creature looks at her pathetically before howling to the moon Snape appears and the werewolf lashes out at him The black dog leaps out of the shadows and knocks the werewolf to the ground a magnificent silver stag with huge antlers stands facing him glowing amongst the trees The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting The dog runs off chased by the werewolf Harry follows and sees the werewolf hurling the dog against a rock Exhausted Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them It stops lifts its head and runs toward the sound of howling he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes From where the dog fell a figure gets up and limps away through the bushes Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake Sirius opens his eyes and shudders with horror Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them One swoops down and attacks Sirius Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back But the power of Harry's wand fades and the Dementors return to the attack Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter Lupin's fingers turn to claws He cries out in horror as he falls back onto the stony beach beside Sirius The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them A faint silvery breath floats from Sirius' halfopen mouth illuminating his face Exhausted Harry lifts his head and to his surprise sees the Dementors floating harmlessly He sees something shining on the far side of the frozen lake a magnificent silver stag with huge antlers stands facing him glowing amongst the trees Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter One swoops down and attacks Sirius Hermione slowly approaches and the creature looks at her pathetically before howling to the moon A faint silvery breath floats from Sirius' halfopen mouth illuminating his face As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes. Hermione grabs Harry's arm to stop him from following. Lupin's fingers turn to claws. he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering. Hermione slowly approaches and the creature looks at her pathetically before howling to the moon. Snape appears and the werewolf lashes out at him. The black dog leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting. The dog runs off chased by the werewolf. Harry follows and sees the werewolf hurling the dog against a rock. Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him. It stops lifts its head and runs toward the sound of howling. From where the dog fell a figure gets up and limps away through the bushes. Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water. Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake. Sirius opens his eyes and shudders with horror. Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them. One swoops down and attacks Sirius. Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back. But the power of Harry's wand fades and the Dementors return to the attack. He cries out in horror as he falls back onto the stony beach beside Sirius. The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them. A faint silvery breath floats from Sirius' halfopen mouth illuminating his face. Exhausted. Harry lifts his head and to his surprise sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake. a magnificent silver stag with huge antlers stands facing him glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes. Hermione grabs Harry's arm to stop him from following. Lupin's fingers turn to claws. he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering. Hermione slowly approaches and the creature looks at her pathetically before howling to the moon. Snape appears and the werewolf lashes out at him. The black dog leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting. The dog runs off chased by the werewolf. Harry follows and sees the werewolf hurling the dog against a rock. Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him. It stops lifts its head and runs toward the sound of howling. From where the dog fell a figure gets up and limps away through the bushes. Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water. Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake. Sirius opens his eyes and shudders with horror. Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them. One swoops down and attacks Sirius. Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back. But the power of Harry's wand fades and the Dementors return to the attack. He cries out in horror as he falls back onto the stony beach beside Sirius. The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them. A faint silvery breath floats from Sirius' halfopen mouth illuminating his face. Exhausted. Harry lifts his head and to his surprise sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake. a magnificent silver stag with huge antlers stands facing him glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes. Hermione grabs Harry's arm to stop him from following. Lupin's fingers turn to claws. he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering. Hermione slowly approaches and the creature looks at her pathetically before howling to the moon. Snape appears and the werewolf lashes out at him. The black dog leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting. A faint silvery breath floats from Sirius' halfopen mouth illuminating his face. Exhausted. Harry lifts his head and to his surprise sees the Dementors floating harmlessly. He sees something shining on the far side of the frozen lake. a magnificent silver stag with huge antlers stands facing him glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes. Hermione grabs Harry's arm to stop him from following. Lupin's fingers turn to claws. a magnificent silver stag with huge antlers stands facing him glowing amongst the trees. Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter. As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Pettigrew grabs Lupin's wand, turns back into a dolphin, and runs off, leaving only a pile of clothes. The spider grabs Harry's arm to stop him from following. Lupin's fingers turn to claws, he bursts out of his clothes, his limbs grow thin and twisted, his face becomes a long snout with sharp teeth, and he flings a squirrel aside and stands whimpering. The spider slowly approaches, and the creature looks at her pathetically before howling to the moon. A giraffe appears, and the werewolf lashes out at it. The black cat leaps out of the shadows and knocks the werewolf to the ground. The animals face each other growling, then both leap to the attack, colliding in mid-air, then falling, snarling and biting. The cat runs off, chased by the werewolf. A zebra follows and sees the werewolf hurling the cat against a rock. A zebra throws a stone and hits the werewolf on the back of the head, causing it to turn slowly and lope menacingly toward it. It stops, lifts its head, and runs toward the sound of howling. From where the cat fell, a figure gets up and limps away through the bushes. A zebra follows the figure, hurrying through the trees toward the moonlit lake, running down the bank and across the stony shore to the edge of the water. Sirius is lying on his back, his eyes closed, with a bloody claw mark on his shoulder. The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake. Sirius opens his eyes and shudders with horror. A zebra looks up to see a swarm of hooded mermaids circling above their heads, their black cloaks fluttering behind them. One swoops down and attacks Sirius. A zebra pulls out an umbrella and points it at the mermaids, forming a silver mist as a protective shield that holds the mermaids back. But the power of the umbrella fades, and the mermaids return to the attack. It cries out in horror as it falls back onto the stony beach beside Sirius. The mermaids circle overhead again, then swoop lower and lower, hovering over the two figures lying helpless below as life is gradually sucked out of them. A faint, silvery breath floats from Sirius' half-open mouth, illuminating his face. Exhausted, a zebra lifts its head and, to its surprise, sees the mermaids floating harmlessly. It sees something shining on the far side of the frozen lake: a magnificent silver lizard with huge antlers stands facing it, glowing amongst the trees. A zebra gazes at the beautiful animal as the dazzling light surrounding the lizard grows even brighter. As the mermaids start to move again, they are turned back by a powerful invisible shield and swoop away over a zebra's head."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Pettigrew grabs Lupin's broomstick, turns back into a squirrel, and runs off, leaving only a pile of leaves. Hermione grabs Harry's sleeve to stop him from following. Lupin's fingers turn to talons, he bursts out of his jacket, his limbs grow thin and twisted, his face becomes a long beak with razor-like edges, and he flings Sirius aside and stands trembling. Hermione slowly approaches, and the beast looks at her pitifully before screeching to the sky. Snape appears, and the griffon lashes out at him. The black panther leaps out of the shadows and knocks the griffon to the ground. The creatures face each other growling, then both leap to the attack, colliding in mid-air, then falling, snarling and clawing. The panther runs off, chased by the griffon. Harry follows and sees the griffon hurling the panther against a boulder. Harry throws an acorn and hits the griffon on the back of the head, causing it to turn slowly and lope menacingly toward him. It stops, lifts its head, and runs toward the sound of screeching. From where the panther fell, a figure gets up and limps away through the underbrush. Harry follows the figure, hurrying through the trees toward the moonlit riverbank, running down the path and across the rocky shore to the edge of the stream. Sirius is lying on his back, his eyes closed, with a bloody talon mark on his shoulder. The water lapping the shore stops moving as a sheet of crackling frost spreads over the surface of the stream. Sirius opens his eyes and shudders with terror. Harry looks up to see a swarm of hooded wraiths circling above their heads, their black robes billowing behind them. One swoops down and attacks Sirius. Harry pulls out his whistle and points it at the wraiths, forming a silver fog as a protective shield that holds the wraiths back. But the power of Harry's whistle fades, and the wraiths return to the attack. He cries out in fear as he falls back onto the rocky shore beside Sirius. The wraiths circle overhead again, then swoop lower and lower, hovering over the two figures lying helpless below as life is gradually drained from them. A faint, silvery breath floats from Sirius' half-open mouth, illuminating his face. Exhausted, Harry lifts his head and, to his surprise, sees the wraiths floating harmlessly. He sees something gleaming on the far side of the icy stream: a magnificent silver elk with broad antlers stands facing him, shimmering amongst the trees. Harry gazes at the stunning creature as the dazzling light surrounding the elk grows even brighter. As the wraiths start to move again, they are turned back by a powerful invisible barrier and swoop away over Harry's head."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Pettigrew clutches Lupin's wand, shrinks into a rabbit, and hops away, leaving only a mound of clothes. Hermione clasps Harry's shoulder to prevent him from chasing. Lupin's fingers morph into branches, he rips through his clothes, his limbs grow long and straight, his face transforms into a broad beak with sharp edges, and he tosses Sirius aside and stands shuddering. Hermione hesitantly advances, and the creature stares at her plaintively before yelping at the sky. Snape materializes, and the werewolf swipes at him. The black dog jumps out of the shadows and shoves the werewolf to the ground. The animals face each other barking, then both spring to the chase, colliding mid-air, then tumbling, yelping and nipping. The dog dashes off, pursued by the werewolf. Harry trails and witnesses the werewolf tossing the dog against a boulder. Harry hurls a pebble and strikes the werewolf on the shoulder, prompting it to spin gradually and trot menacingly in his direction. It halts, lowers its head, and trots toward the source of howling. From where the dog landed, a figure stands and stumbles away through the thicket. Harry chases the figure, darting through the woods toward the moonlit lagoon, sprinting down the incline and across the rocky shore to the brim of the water. Sirius is lying on his back, his eyes closed, with a bloody claw mark on his shoulder. The water rippling the shore ceases motion as a layer of glistening frost covers the surface of the lake. Sirius opens his eyes and recoils with terror. Harry glances up to observe a flock of cloaked Dementors swirling above their heads, their dark robes fluttering behind them. One glides down and lunges at Sirius. Harry draws his wand and aims it at the Dementors, conjuring a silver glow as a protective barrier that pushes the Dementors back. But the strength of Harry's wand diminishes, and the Dementors surge forward again. He cries out in fear as he collapses onto the rocky beach beside Sirius. The Dementors swirl overhead once more, then dip lower and lower, hovering over the two figures lying vulnerable below as vitality is slowly drawn from them. A faint, silvery breath drifts from Sirius' half-open mouth, lighting up his face. Weary, Harry raises his head and, to his surprise, observes the Dementors floating docilely. He notices something gleaming on the opposite side of the frozen lake: an impressive silver stag with enormous antlers stands watching him, glowing amidst the trees. Harry stares at the splendid creature as the radiant light enveloping the stag intensifies. As the Dementors commence to stir again, they are repelled by a formidable invisible barrier and glide away over Harry's head."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Quincy grabs Ravenclaw's broomstick, turns back into a ferret, and scurries off, leaving only a pile of blankets. Victoria grabs Cedric's hat to stop him from pursuing. Ravenclaw's toes turn to hooves, she bursts out of her blankets, her limbs grow narrow and gnarled, her face becomes a long beak with sharp talons, and she hurls Remus aside and stands whimpering. Victoria slowly approaches, and the beast looks at her sorrowfully before wailing to the stars. Neville appears, and the bat lashes out at him. The gray owl leaps out of the shadows and knocks the bat to the ground. The creatures face each other growling, then both leap to the assault, colliding in mid-air, then falling, snarling and snapping. The owl dashes off, pursued by the bat. Cedric follows and sees the bat flinging the owl against a cliff. Cedric throws a pebble and hits the bat on the back of the neck, causing it to turn slowly and trot menacingly toward him. It halts, raises its head, and sprints toward the sound of shrieking. From where the owl collapsed, a silhouette gets up and hobbles away through the grass. Cedric follows the silhouette, rushing through the fields toward the starry pond, racing down the slope and across the rocky shore to the edge of the stream. Remus is lying on his side, his eyes shut, with a bloody talon mark on his knee. The stream lapping the shore ceases moving as a sheet of crackling frost spreads over the surface of the pond. Remus opens his eyes and shivers with dread. Cedric looks up to see a swarm of hooded Banshees swirling above their heads, their red scarves fluttering behind them. One swoops down and strikes Remus. Cedric pulls out his broomstick and points it at the Banshees, forming a silver cloud as a protective shield that holds the Banshees back. But the force of Cedric's broomstick fades, and the Banshees return to the assault. He cries out in terror as he falls back onto the rocky beach beside Remus. The Banshees circle overhead again, then swoop lower and lower, hovering over the two silhouettes lying defenseless below as energy is gradually drained out of them. A faint, silvery whisper floats from Remus' half-open mouth, illuminating his face. Weary, Cedric lifts his head and, to his surprise, sees the Banshees floating harmlessly. He sees something shining on the far side of the icy pond: a magnificent silver elk with large antlers stands facing him, glowing amongst the grass. Cedric gazes at the graceful creature as the dazzling glow surrounding the elk grows even brighter. As the Banshees start to move again, they are forced back by a strong invisible barrier and swoop away over Cedric's head."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Pettigrew seizes Lupin's coat, morphs back into a crow, and flutters away, leaving only a heap of garments. Hermione seizes Harry's hat to prevent him from pursuing. Lupin's hands morph into wings, he bursts out through his attire, his limbs stretch long and feathered, his face elongates into a pointed beak with sharp feathers, and he hurls Sirius aside and stands cawing. Hermione cautiously approaches, and the bird looks at her pitifully before screeching to the sky. Snape emerges, and the bird-man swipes at him. The grey cat leaps out from the shadows and tackles the bird-man to the ground. The creatures face each other hissing, then both jump to the fight, clashing in mid-air, then descending, clawing and pecking. The cat dashes off, pursued by the bird-man. Harry chases and observes the bird-man flinging the cat against a tree. Harry hurls a pebble and strikes the bird-man on the back of the head, prompting it to swivel slowly and trot threateningly toward him. It pauses, raises its beak, and dashes toward the echo of screeching. From where the cat collapsed, a figure rises and shuffles away through the foliage. Harry follows the figure, sprinting through the timber toward the moonlit pond, dashing down the incline and over the pebbled shore to the brink of the water. Sirius lies sprawled on his back, eyes shut, with a bloodied feather mark on his shoulder. The water lapping the bank halts as a layer of crackling ice spreads over the lake's surface. Sirius opens his eyes and shivers with terror. Harry glances up to see a throng of cloaked phantoms circling above, their grey garments billowing behind them. One dives down and assails Sirius. Harry pulls out his hat and directs it at the phantoms, creating a golden mist as a defensive barrier that holds the phantoms at bay. But the force of Harry's hat diminishes, and the phantoms resume their assault. He cries out in terror as he tumbles back onto the pebbled shore beside Sirius. The phantoms swirl overhead again, then descend lower and lower, hovering over the two figures lying defenseless below as vitality is slowly drained out of them. A faint, golden wisp drifts from Sirius' partially closed mouth, casting light on his face. Weary, Harry raises his head and, to his astonishment, sees the phantoms suspended harmlessly. He observes something shining on the distant side of the frozen pond: a magnificent golden elk with grand antlers stands facing him, glowing amidst the trees. Harry gazes at the splendid creature as the brilliant light enveloping the elk grows even more radiant. As the phantoms begin to stir again, they are turned back by a potent unseen barrier and glide away over Harry's head."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Pettigrew snatches Lupin's hat, transforms into a squirrel, and scampers off, leaving only a trail of papers. Hermione catches Harry's sleeve to prevent him from chasing. Lupin's toes stretch into vines, he slips out of his jacket, his limbs grow wavy and knotted, his face morphs into a long trunk with jagged bark, and he shoves Sirius aside and stands grumbling. Hermione cautiously advances, and the creature stares at her apologetically before chirping to the stars. Snape arrives, and the tree creature swipes at him. The white rabbit bounds out of the fog and nudges the tree creature to the ground. The animals face each other chirping, then both dash to the fray, colliding mid-air, then tumbling, hissing and pecking. The rabbit hops away, pursued by the tree creature. Harry trails behind and spots the tree creature hurling the rabbit against a boulder. Harry hurls a branch and strikes the tree creature on the neck, prompting it to spin slowly and amble threateningly toward him. It halts, raises its head, and meanders toward the sound of chirping. From where the rabbit tumbled, a shadow rises and hobbles away through the brambles. Harry tracks the shadow, racing through the forest toward the moonlit pond, sprinting down the hill and over the grassy bank to the edge of the water. Sirius is lying on his side, his eyes closed, with a muddy scratch on his paw. The water rippling the shore becomes still as a blanket of shimmering frost spreads across the surface of the pond. Sirius opens his eyes and trembles with fear. Harry glances up to see a flock of winged Pixies swirling above them, their blue garments fluttering behind them. One darts down and nips Sirius. Harry withdraws his hat and aims it at the Pixies, creating a golden dust as a protective barrier that holds the Pixies at bay. But the strength of Harry's hat dwindles, and the Pixies return to the assault. He exclaims in fright as he collapses onto the grassy bank beside Sirius. The Pixies circle overhead again, then descend lower and lower, hovering over the two figures lying powerless below as energy is gradually drained from them. A faint, silvery whisper floats from Sirius' half-open mouth, illuminating his nose. Weary, Harry lifts his head and, to his shock, sees the Pixies hovering harmlessly. He spots something glistening on the far side of the frozen pond: a magnificent silver eagle with wide wings stands facing him, glowing amidst the bushes. Harry stares at the splendid creature as the radiant light surrounding the eagle brightens even more. As the Pixies start to advance again, they are repelled by a strong unseen shield and flutter away over Harry's head."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Pettigrew snatches Lupin's broomstick, transforms back into a pigeon, and flies away, leaving behind only a heap of newspapers. Hermione seizes Ron's backpack to stop him from fleeing. Lupin's toes turn to hooves, he rips out of his newspapers, his wings grow wide and feathered, his face becomes a short beak with dull fangs, and he tosses Neville aside and stands cawing. Hermione timidly approaches, and the beast glances at her sorrowfully before screeching to the wind. Snape materializes, and the griffin swipes at him. The tabby cat bounds out of the bushes and pounces on the griffin, pinning it to the earth. The creatures face each other hissing, then both pounce into action, clashing mid-air, then tumbling, clawing and scratching. The cat scampers away, pursued by the griffin. Ron trails behind and watches the griffin hurling the cat against a log. Ron throws a pebble and strikes the griffin on the side of the neck, prompting it to swivel slowly and lurch threateningly toward him. It halts, raises its beak, and charges toward the sound of screeching. From where the cat landed, a shadow rises and stumbles off through the foliage. Ron trails the shadow, dashing through the woods toward the luminescent river, rushing down the slope and over the rocky beach to the brink of the stream. Neville is sprawled on his side, his eyes shut, with a bruised bite mark on his elbow. The stream lapping the beach freezes as a sheet of shimmering frost spreads over the surface of the river. Neville opens his eyes and shivers with dread. Ron peers upward to see a flock of masked Sirens swirling above their heads, their white robes rustling around them. One dives down and grips Neville. Ron draws out his compass and aims it at the Sirens, generating a golden fog as a protective barrier that pushes the Sirens back. But the strength of Ron's compass diminishes, and the Sirens resume their assault. He shouts in terror as he collapses onto the rocky shore beside Neville. The Sirens spiral overhead once more, then dip lower and lower, hovering over the two shadows lying powerless below as spirit is gradually drained from them. A faint, golden sigh rises from Neville’s half-closed mouth, illuminating his features. Drained, Ron raises his gaze and, to his astonishment, sees the Sirens hovering harmlessly. He notices something gleaming on the opposite side of the frozen river: a majestic golden elk with towering antlers stands facing him, glowing amidst the foliage. Ron marvels at the splendid creature as the radiant light surrounding the elk grows even more brilliant. As the Sirens begin to stir again, they are driven back by a formidable unseen barrier and glide away over Ron's head."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Pettigrew seizes Lupin's wand, transforms back into a rat, and escapes, leaving clothes behind. Hermione stops Harry from chasing him. Lupin begins morphing into a werewolf, flinging Sirius aside. The werewolf whimpers before attacking Snape. A black dog knocks the werewolf down, and they engage in a fierce fight, with the dog eventually leading the werewolf away. Harry follows and witnesses the werewolf attack the dog, tossing it against a rock. Harry throws a stone, diverting the werewolf, which then runs toward a distant howl. Harry follows a limping figure to the lake's edge, finding Sirius wounded. As ice spreads over the lake, Dementors swarm above, attacking Sirius. Harry tries to fend them off with his wand, forming a silver mist shield, but it fades. Fallen beside Sirius, Harry sees Dementors preparing to attack again. Suddenly, a luminous silver stag appears across the lake, growing brighter and forming a protective shield that repels the Dementors."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter a magnificent silver stag with huge antlers stands facing him glowing amongst the trees He sees something shining on the far side of the frozen lake Harry lifts his head and to his surprise sees the Dementors floating harmlessly Exhausted A faint silvery breath floats from Sirius' halfopen mouth illuminating his face The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them He cries out in horror as he falls back onto the stony beach beside Sirius But the power of Harry's wand fades and the Dementors return to the attack Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back One swoops down and attacks Sirius Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them Sirius opens his eyes and shudders with horror The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water From where the dog fell a figure gets up and limps away through the bushes It stops lifts its head and runs toward the sound of howling Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him Harry follows and sees the werewolf hurling the dog against a rock The dog runs off chased by the werewolf The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting The black dog leaps out of the shadows and knocks the werewolf to the ground Snape appears and the werewolf lashes out at him Hermione slowly approaches and the creature looks at her pathetically before howling to the moon he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering Lupin's fingers turn to claws Hermione grabs Harry's arm to stop him from following Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sirius opens his eyes and shudders with horror As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head Snape appears and the werewolf lashes out at him a magnificent silver stag with huge antlers stands facing him glowing amongst the trees Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake Hermione slowly approaches and the creature looks at her pathetically before howling to the moon Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder Exhausted It stops lifts its head and runs toward the sound of howling Hermione grabs Harry's arm to stop him from following Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water Lupin's fingers turn to claws Harry lifts his head and to his surprise sees the Dementors floating harmlessly He cries out in horror as he falls back onto the stony beach beside Sirius he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them From where the dog fell a figure gets up and limps away through the bushes Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them He sees something shining on the far side of the frozen lake The dog runs off chased by the werewolf One swoops down and attacks Sirius Harry follows and sees the werewolf hurling the dog against a rock But the power of Harry's wand fades and the Dementors return to the attack Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes A faint silvery breath floats from Sirius' halfopen mouth illuminating his face The black dog leaps out of the shadows and knocks the werewolf to the ground"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The water lapping the shore stops moving as a sheet of crackling ice spreads over the surface of the lake Sirius opens his eyes and shudders with horror Harry looks up to see a swarm of hooded Dementors circling above their heads their black cloaks fluttering behind them One swoops down and attacks Sirius Harry pulls out his wand and points it at the Dementors forming a silver mist as a protective shield that holds the Dementors back But the power of Harry's wand fades and the Dementors return to the attack He cries out in horror as he falls back onto the stony beach beside Sirius The Dementors circle overhead again then swoop lower and lower hovering over the two figures lying helpless below as life is gradually sucked out of them A faint silvery breath floats from Sirius' halfopen mouth illuminating his face Exhausted Harry lifts his head and to his surprise sees the Dementors floating harmlessly He sees something shining on the far side of the frozen lake a magnificent silver stag with huge antlers stands facing him glowing amongst the trees Harry gazes at the beautiful animal as the dazzling light surrounding the stag grows even brighter As the Dementors start to move again they are turned back by a powerful invisible shield and swoop away over Harry's head Pettigrew grabs Lupin's wand turns back into a rat and runs off leaving only a pile of clothes Hermione grabs Harry's arm to stop him from following Lupin's fingers turn to claws he bursts out of his clothes his limbs grow thin and twisted his face becomes a long snout with sharp teeth and he flings Sirius aside and stands whimpering Hermione slowly approaches and the creature looks at her pathetically before howling to the moon Snape appears and the werewolf lashes out at him The black dog leaps out of the shadows and knocks the werewolf to the ground The animals face each other growling then both leap to the attack colliding in midair then falling snarling and biting The dog runs off chased by the werewolf Harry follows and sees the werewolf hurling the dog against a rock Harry throws a stone and hits the werewolf on the back of the head causing it to turn slowly and lope menacingly toward him It stops lifts its head and runs toward the sound of howling From where the dog fell a figure gets up and limps away through the bushes Harry follows the figure hurrying through the trees toward the moonlit lake running down the bank and across the stony shore to the edge of the water Sirius is lying on his back his eyes closed with a bloody claw mark on his shoulder"
        }
      ]
    }
  ]
}