{
  "ground_truth": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long, white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Shafts of light gradually form the shape of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black guy holds a receiver to his ear. He covers his eyes with his hand. He rocks back and forth. He removes his hand from his face. The silhouette of the man swims the crawl on the surface. Sun glints on the surface of the water. The man swims to shore and strides onto the beach. The man, tall, lean and in his 30s, walks up steps from the beach which cut through a garden, abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof looks out over a patio, the garden and the ocean. In the house, the man studies himself solemnly in a mirror as he fastens his tie. The man sits pensively on his sofa. Before him on a coffee table is a list of names with a typed note attached to it. The name Ezra Turner has been encircled on the list. In a call center cubicle, a man wearing a headset sits at a computer. Ezra types on a braille keyboard. Ezra disconnects the call. Ben slams the phone down. Looking disturbed by his own actions, Ben claps his hands to his mouth and stares down. He blinks, composes himself, and lowers his hands. Pacing, Ben stabs the air with a finger each time he calls out a name. Ben smashes a chair against a coffee table. A list of names scrolls. A rapid montage of items -- a newspaper article, a coast road, snapshots of Ben, Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A cleaner polishes a floor in a brightly lit corridor. Ben sits in a cubicle, typing on a keyboard. He stares at his computer monitor gravely. The name, Emily Posa, has been encircled on his list beside him. Above it, the name Yvonne Bastidos has been crossed out. Ben stares pensively at the details, which include a photo of attractive, dark-haired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details attached to it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A radiant white glow gleams out from the middle of a dark display. The display brightens to disclose clouds and a cerulean sky. The glow is upheld by a statuesque lady wearing a lengthy, white gown with a blue sash draped around her. She stands on a raised pedestal before the cloudy sky. An orange disk encircled by black rotates like a record on a phonograph. Beams of glow gradually form the outline of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black guy holds a handset to his ear. He covers his eyes with his hand. He rocks back and forth. He removes his hand from his face. The silhouette of the man swims the crawl on the surface. Sun glints on the surface of the water. The man swims to shore and strides onto the strand. The man, tall, lean, and in his 30s, walks up steps from the strand which cut through a garden, abundant with colorful blooms and shrubs. A long low strand house with white blooms trailing from part of its roof looks out over a patio, the garden, and the ocean. In the house, the man studies himself solemnly in a mirror as he fastens his tie. The man sits pensively on his settee. Before him on a coffee table is a list of names with a typed note affixed to it. The name Ezra Turner has been encircled on the list. In a call center cubicle, a man wearing a headset sits at a computer. Ezra types on a braille keyboard. Ezra disconnects the call. Ben slams the phone down. Looking disturbed by his own actions, Ben claps his hands to his mouth and stares downward. He blinks, composes himself, and lowers his hands. Pacing, Ben jabs the air with a finger each time he calls out a name. Ben smashes a chair against a coffee table. A list of names scrolls. A rapid montage of items -- a newspaper article, a coast road, snapshots of Ben, Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A cleaner polishes a floor in a brightly lit corridor. Ben sits in a cubicle, typing on a keyboard. He stares at his computer monitor gravely. The name, Emily Posa, has been encircled on his list beside him. Above it, the name Yvonne Bastidos has been crossed out. Ben stares pensively at the details, which include a photo of attractive, dark-haired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details affixed to it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bright white light is shone out from the center of a black screen. The screen is lightened to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long, white robe with a blue sash draped around her. She is stood on a raised plinth before the cloudy sky. An orange disc surrounded by black is revolved like a record on a turntable. Shafts of light gradually form the shape of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image is faded to black. A handsome black guy is holding a receiver to his ear. His eyes are covered by his hand. He is rocked back and forth. His hand is removed from his face. The silhouette of the man is swum the crawl on the surface. The surface of the water is glinted on by the sun. The shore is swum to by the man, and he strides onto the beach. The man, tall, lean and in his 30s, is walked up steps from the beach which cut through a garden, abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof is looking out over a patio, the garden and the ocean. In the house, himself is studied solemnly in a mirror by the man as his tie is fastened. The man is sat pensively on his sofa. Before him on a coffee table is a list of names with a typed note attached to it. The name Ezra Turner has encircled it on the list. In a call center cubicle, a man wearing a headset is sat at a computer. Ezra types on a braille keyboard. The call is disconnected by Ezra. Ben slams the phone down. Looking disturbed by his own actions, his hands are clapped to his mouth by Ben and he stares down. He blinks, composes himself, and his hands are lowered. Pacing, the air is stabbed by Ben with a finger each time a name is called out. A chair is smashed by Ben against a coffee table. A list of names is scrolled. A rapid montage of items -- a newspaper article, a coast road, snapshots of Ben, Sarah Jenson's funeral card. A deserted open plan office is shadowily lit. A floor is polished by a cleaner in a brightly lit corridor. Ben sits in a cubicle, typing on a keyboard. His computer monitor is gravely stared at by him. The name, Emily Posa, is encircled on his list beside him. Above it, the name Yvonne Bastidos has been crossed out. The details, which include a photo of attractive, dark-haired Emily, are stared at pensively by Ben. Her details are printed out by him. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is attached a file with Emily Posa's details."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A bright light emerges from the center of a black screen, illuminating clouds and a blue sky. Held aloft by a statuesque woman in a white robe with a blue sash, she stands on a plinth before the clouds. An orange disc spins like a record, transforming light into a running man who shrinks into the iris of a blue eye before fading to black. A handsome black man holds a phone, covering his eyes and rocking. He swims, sunlight glinting on water, to shore and strides onto the beach. Tall and lean, in his 30s, he walks through a vibrant garden to a beach house. Inside, he solemnly fastens his tie in front of a mirror and sits pensively, examining a list with \"Ezra Turner\" circled. At a call center, Ezra wears a headset, using a braille keyboard before disconnecting a call. Ben slams the phone down, disturbed, then lowers his hands. Pacing, he calls out names, smashes a chair on a table, and sees a list scroll. A quick montage shows various items, including a funeral card and a deserted office. A cleaner polishes a brightly lit corridor. Ben sits in a cubicle, gravely staring at his monitor. \"Emily Posa\" is circled beside him, \"Yvonne Bastidos\" crossed out. Staring pensively at Emily's photo and details, he prints them. Traffic flows on a sunny freeway as Ben drives, with Emily's file on the seat beside him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A bright white light emerges from a black screen, revealing clouds and blue sky. A statuesque woman in a white robe with a blue sash holds the light aloft, standing on a plinth. An orange disc revolves, forming the shape of a running man that shrinks into a blue eye before fading to black. A handsome black man holds a phone, covers his eyes, rocks, removes his hand, and swims ashore. Tall and lean, he walks through a garden to a beach house. Inside, he solemnly fastens his tie, sits pensive on a sofa, with a list encircling Ezra Turner's name. In a call center, Ezra types on a braille keyboard. Ben angrily hangs up, disturbed by his actions, and claps his mouth. He paces, pointing and calling names, then smashes a chair against a table. A list of names scrolls by, followed by a montage of a newspaper, coast road, and funeral card. A shadowy office, a cleaner in a corridor, and Ben in a cubicle typing appear; Emily Posa’s name is circled, and Yvonne Bastidos’ is crossed out. Ben stares at Emily's details and prints them. Traffic moves on a freeway as Ben drives with Emily Posa's file beside him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A radiant and piercing white light emerges from the very center of an otherwise entirely black screen, dramatically illuminating the darkness. As the light intensifies, the screen gradually becomes lighter, revealing a breathtaking display of fluffy clouds set against a vibrant blue sky. Within this celestial scene, the light is majestically held aloft by a statuesque woman who is gracefully adorned in a long and flowing white robe. Draped elegantly around her is a blue sash, enhancing her dignified appearance. This commanding figure stands proudly on a raised plinth, set against the backdrop of the cloudy sky. In a vivid contrast of colors, an orange disc, encircled by black, revolves slowly and deliberately, mimicking the motion of a record spinning on a turntable. As this happens, shafts of luminous light gradually take on the form of a running man, initially appearing substantial but then diminishing in size. The figure is eventually frozen, captured within the iris of an intensely blue eye, which is striking in its clarity. Finally, the image gradually fades back into the darkness of a black screen.\n\nTransitioning to a different scene, a handsome black man is seen holding a receiver to his ear, his expression engaged yet introspective. He shields his eyes with one hand, rocking back and forth rhythmically in what suggests a moment of contemplation or decision. Eventually, he uncovers his face, revealing his focused gaze. The silhouette of this man becomes apparent as he swims the crawl stroke gracefully on the water's surface, the sun's rays glinting brightly on the rippling surface. He swims with purpose toward the shore and strides confidently onto the beach. The man, who is tall and lean, and appears to be in his 30s, ascends steps that cut through a garden vibrant with the colors of countless flowers and lush bushes. A long, low beach house stands nearby, its roof adorned with cascading white flowers, offering a serene view over a patio, the flourishing garden, and the vast ocean beyond. Inside the house, the man gazes solemnly at his reflection in a mirror while he fastens his tie, his expression one of serious introspection.\n\nSitting pensively on his sofa, the man stares thoughtfully at a coffee table in front of him, where a neatly typed list of names lies accompanied by a note. Among these names, the name Ezra Turner is distinctly circled. In a bustling call center, another man, wearing a headset, sits at his computer. He efficiently types on a Braille keyboard, indicating a profound focus on his task. The man, Ezra, concludes the call and disconnects, while separately, Ben forcefully slams down his phone, visibly disturbed by his own actions. Overcome by emotion, Ben clasps his hands over his mouth and gazes downward, blinks slowly, and gradually regains his composure, lowering his hands. As he paces the room, Ben vigorously thrusts a finger into the air with each name he calls out, his intensity unmistakable. In a sudden outburst, Ben violently smashes a chair against a nearby coffee table.\n\nMeanwhile, a scrolling list of names appears on the screen, accompanied by a rapid montage of various items—a newspaper article, a winding coast road, snapshots of Ben, and Sarah Jenson's funeral card—all flash by in quick succession. A deserted office space, dimly lit and open plan, is momentarily visible, where a cleaner diligently polishes the floor of a brightly lit corridor. Back in the cubicle, Ben sits, typing at a keyboard, his focus unwavering as he stares seriously at his computer monitor. The name Emily Posa is visibly circled on the list beside him, while another name, Yvonne Bastidos, is noticeably crossed out above it. Ben stares pensively at the associated details, which include a photograph of the attractive, dark-haired Emily. He prints out Emily's details, a determined look set in his eyes. Meanwhile, traffic flows smoothly along a sunny freeway, and Ben, driving with a grave expression, stares straight ahead. Beside him on the car seat lies a file, prominently displaying Emily Posa's details."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A radiant and piercing white light emerges from the very center of what is an otherwise entirely black screen, dramatically and almost suddenly illuminating the vast expanse of darkness. As this resplendent light intensifies in its brilliance, the screen gradually transitions to a lighter shade, unveiling a breathtaking and awe-inspiring display of fluffy clouds set against the backdrop of a vibrant and clear blue sky. Within this celestial and ethereal scene, the light is majestically held aloft by a statuesque woman, who is gracefully adorned in a long and flowing white robe. Elegantly draped around her is a blue sash, enhancing her dignified and regal appearance. This commanding figure stands proudly on a raised plinth, set vividly against the backdrop of the cloudy sky. In a vivid contrast of colors, an orange disc, encircled by black, revolves slowly and deliberately, mimicking the graceful motion of a record spinning on a turntable. As this happens, shafts of luminous light gradually take on the form of a running man, initially appearing substantial and significant, but then diminishing in size. The figure is eventually and dramatically frozen in time, captured within the iris of an intensely blue eye, which is strikingly clear and vivid in its depth. Finally, the captivating image gradually fades back into the hushed darkness of a now-black screen.\n\nTransitioning to a different scene, a handsome black man is observed holding a receiver to his ear, his expression engaged yet introspective, perhaps lost in thought. He shields his eyes with one hand, while rocking back and forth in a rhythmic manner, suggestive of a moment of contemplation or decision-making. Eventually, he uncovers his face, revealing a focused and intense gaze. The silhouette of this man becomes apparent as he swims the crawl stroke gracefully on the surface of the water, the sun's rays glinting brightly off the rippling surface. He swims with purpose, making his way toward the shore, where he strides confidently up onto the beach. The man, who is tall, lean, and appears to be in his 30s, ascends steps that cut through a garden vibrant with a multitude of colors from countless flowers and lush bushes. A long, low beach house stands nearby, its roof adorned with a cascade of white flowers, offering a serene and beautiful view over a patio, the flourishing garden, and the vast ocean that stretches beyond. Inside the house, the man gazes solemnly at his own reflection in a mirror while he fastens his tie, his expression one of deep and serious introspection.\n\nSitting pensively on his sofa, the man stares thoughtfully at a coffee table situated in front of him, where a neatly typed list of names lies, accompanied by a note. Among these carefully listed names, the name Ezra Turner is distinctly circled. In a bustling, busy call center, another man, wearing a headset, sits at his computer. He efficiently types on a Braille keyboard, his profound focus evident from his task-driven demeanor. The man, Ezra, concludes his call and disconnects, while separately, Ben forcefully slams down his phone, appearing visibly disturbed by his own actions. Overcome with emotion, Ben clasps his hands over his mouth and gazes downward, blinking slowly as he gradually regains his composure, lowering his hands from his face. As he paces the room, Ben vigorously thrusts a finger into the air with each name he calls out, his intensity unmistakable. In a sudden, explosive outburst, Ben violently smashes a chair against a nearby coffee table.\n\nMeanwhile, a scrolling list of names appears on the screen, accompanied by a rapid montage of various items—a newspaper article, a winding coast road, snapshots of Ben, and Sarah Jenson's funeral card—all flash by in quick and rapid succession. A deserted office space, dimly lit and open-plan, is momentarily visible, where a diligent cleaner works meticulously to polish the floor of a brightly lit corridor. Back in the cubicle, Ben sits, typing intently at a keyboard, his unwavering focus locked on his computer monitor. The name Emily Posa is visibly circled on the list beside him, while another name, Yvonne Bastidos, is noticeably crossed out just above it. Ben stares pensively at the associated details, which include a photograph of the attractive, dark-haired Emily. He prints out Emily's details, a determined look setting firm in his eyes. Meanwhile, traffic flows smoothly along a sunny freeway, and Ben, driving with a grave expression, stares straight ahead. Beside him on the car seat lies a file, prominently displaying Emily Posa's details."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A bright white light emanates from the center of a black screen, gradually illuminating the darkness around it. As this radiant light intensifies, the screen steadily lightens, unveiling a scene of fluffy clouds set against a vast, blue sky. The source of this light is revealed to be held high by a statuesque woman, who stands with grace and elegance, adorned in a flowing white robe complemented by a blue sash elegantly draped around her form. She stands firmly atop a raised plinth, framed by the majestic backdrop of the cloudy sky. In a seamless transition, an orange disc encircled by black begins to revolve smoothly, reminiscent of a record spinning steadily on a turntable. As the disc continues its rotation, slender shafts of light pierce through, gradually coalescing into the distinctive shape of a man in mid-sprint. This figure, with each rotation, appears to diminish in size until it is encapsulated and frozen within the vivid aperture of an intensely blue eye, before the entire image gracefully transitions into blackness. Emerging from the darkness, a handsome black man is seen, firmly grasping a receiver and pressing it to his ear while simultaneously shielding his eyes with his free hand. He gently rocks back and forth, a subtle movement that suggests contemplation or distress. In a gradual motion, he lowers his hand from his face, revealing his countenance fully. The scene then shifts to a silhouette of the man as he performs the crawl stroke, propelling himself across the water's surface. The sunlight reflects off the water, creating a dazzling display of glints. As the man nears the shore, he transitions smoothly from swimming to striding confidently onto the sandy beach. This man, tall and lean with the vitality of a thirty-something, ascends a flight of steps that cut through a lush garden, abundant with vibrant flowers and thick bushes. Overlooking this picturesque setting is a long, low beach house, adorned with white flowers trailing delicately from sections of its roof, offering a serene view over the patio, garden, and extending out to the ocean. Inside this tranquil abode, the man regards himself solemnly in the mirror, his expression serious as he deftly fastens his tie. He then sits pensively on his sofa, his gaze fixed on a coffee table where a list of names lies, with a typed note attached. Among the names, the name ‘Ezra Turner’ is conspicuously encircled. In a bustling call center cubicle, a man donned in a headset is seated before a computer. With practiced precision, Ezra operates a braille keyboard, his fingers moving swiftly over its surface. After concluding a call, Ezra disconnects with professional calmness. Meanwhile, Ben forcefully slams the phone down, a reaction that betrays his inner turmoil. Clearly disturbed by his own actions, he quickly brings his hands to cover his mouth, staring downward in apparent regret. He blinks, taking a moment to collect himself before lowering his hands back to his sides. As he begins to pace, his movements are sharp, and each time he calls out a name, he accentuates it with a stabbing motion of his finger directed at the air. In a sudden burst of frustration, Ben seizes a chair and violently smashes it against a coffee table, releasing pent-up energy. A list of names begins to scroll before him, followed by a rapid montage featuring a newspaper article, a scenic coast road, and snapshots capturing moments of Ben, culminating with a funeral card of Sarah Jenson. The scene shifts to reveal a deserted, open-plan office, cloaked in shadowy light, creating an atmosphere of solitude. In stark contrast, a cleaner diligently polishes the floor in a brightly illuminated corridor, the sound of the buffer breaking the silence. Within this office, Ben is seen sitting alone in a cubicle, his fingers deftly typing on a keyboard, his attention unwavering as he stares gravely at the computer monitor. Beside him, a list features prominently, with the name ‘Emily Posa’ encircled and emphasized, while above it, the name ‘Yvonne Bastidos’ is crossed out, marking a distinction. As Ben’s eyes scan the details, his gaze lingers on a photo of the attractive, dark-haired Emily, each feature seemingly etched in his memory. Resolutely, he prints out her details, the sound of the printer punctuating the silence. Outside, traffic moves smoothly along a sun-drenched freeway, the steady flow of vehicles mirroring the rhythm of life. Within his car, Ben stares stoically ahead, his thoughts hidden behind his grave expression as he drives with purpose. On the passenger seat beside him lies a file, prominently displaying Emily Posa’s details, signifying the next step in his journey."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A bright white light emerges from the center of a black screen, gradually revealing clouds and a blue sky. A statuesque woman, dressed in a long white robe with a blue sash, stands holding the light aloft on a plinth before the cloudy sky. An orange disc surrounded by black spins like a record, and shafts of light shape into a running man, who shrinks and freezes in the iris of a vivid blue eye before fading to black. A handsome black man, in his 30s, holds a phone receiver, covers his eyes, and rocks back and forth. He then uncovers his face and transitions into a swimming silhouette that glides through sunlit water, eventually reaching shore and striding onto the beach. He walks through a garden lush with colorful flowers, approaching a long, low beach house adorned with white flowers on its roof. Inside, he solemnly fastens his tie in front of a mirror before sitting pensively on a sofa, studying a list of names with Ezra Turner circled. In a call center, Ezra, a man with a headset, operates a braille keyboard and disconnects a call. Ben, feeling disturbed, slams the phone down, covers his mouth, then composes himself, pacing and calling out names while smashing a chair against a coffee table. A montage unfolds showing a newspaper article, a coast road, snapshots of Ben, and Sarah Jenson's funeral card. In a deserted, shadowy office, a cleaner polishes the floor of a brightly lit corridor. Ben sits gravely in a cubicle, typing and staring at his computer monitor with Emily Posa's name circled and Yvonne Bastidos’ name crossed out on the list beside him. He studies Emily’s details, prints them out, and drives along a sunny freeway with Emily's file on the seat beside him, staring ahead intently."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bright white light shines out from the center of a black screen, reminiscent of the iconic opening logo of a major Hollywood film studio known for its memorable and stylized animations. The screen lightens to reveal clouds and a blue sky, often symbolizing a fresh beginning or a moment of tranquility in cinematic language. The light is held aloft by a statuesque woman, reminiscent of the symbolic figure Columbia, who often represents freedom and opportunity, wearing a long, white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky, evoking the grandeur of classical architecture and art. An orange disc surrounded by black revolves like a record on a turntable, an image that conjures the nostalgic era of vinyl records and classic music. Shafts of light gradually form the shape of a running man, a motif frequently used to signify urgency or the passage of time in visual storytelling. The figure becomes smaller and is frozen in the iris of an intensely blue eye, a technique often used to create a sense of introspection or to depict a personal journey. The image fades to black. A handsome black guy holds a receiver to his ear, evoking a scene of intense communication or critical news. He covers his eyes with his hand, a gesture signifying distress or contemplation. He rocks back and forth, a motion that often signals anxiety or deep thought. He removes his hand from his face. The silhouette of the man swims the crawl on the surface, a reference to survival and perseverance, often reflected in water symbolism. Sun glints on the surface of the water, capturing a moment of hope or realization. The man swims to shore and strides onto the beach, a classic metaphor for reaching safety or achieving clarity. The man, tall, lean and in his 30s, walks up steps from the beach which cut through a garden, abundant with colorful flowers and bushes, symbolizing life and rejuvenation. A long low beach house with white flowers trailing from part of its roof looks out over a patio, the garden and the ocean, suggesting a peaceful and idyllic retreat. In the house, the man studies himself solemnly in a mirror as he fastens his tie, a moment of self-reflection common before significant events. The man sits pensively on his sofa. Before him on a coffee table is a list of names with a typed note attached to it, an indication of a mission or an investigation. The name Ezra Turner has been encircled on the list, highlighting its importance in his task. In a call center cubicle, a man wearing a headset sits at a computer. Ezra, who is visually impaired, types on a braille keyboard, showcasing the adaptive technologies available for accessibility. Ezra disconnects the call. Ben slams the phone down, an expression of frustration or emotional turmoil. Looking disturbed by his own actions, Ben claps his hands to his mouth and stares down. He blinks, composes himself, and lowers his hands. Pacing, Ben stabs the air with a finger each time he calls out a name, a sign of determination or desperation. Ben smashes a chair against a coffee table, an act often symbolizing a breaking point or a loss of control. A list of names scrolls. A rapid montage of items -- a newspaper article capturing a pivotal event, a scenic coast road symbolizing a journey, snapshots of Ben, Sarah Jenson's funeral card revealing personal grief. A deserted open plan office in shadowy light creates an atmosphere of isolation or mystery. A cleaner polishes a floor in a brightly lit corridor, a mundane but detailed contrast to the surrounding drama. Ben sits in a cubicle, typing on a keyboard. He stares at his computer monitor gravely. The name, Emily Posa, has been encircled on his list beside him, indicating her significance in his unfolding story. Above it, the name Yvonne Bastidos has been crossed out, suggesting a change in focus or resolution. Ben stares pensively at the details, which include a photo of attractive, dark-haired Emily, perhaps the key to his next steps. He prints out her details. Traffic glides along a sunny freeway, a sign of ongoing life and movement. Ben stares ahead gravely as he drives, focused on his destination or purpose. On the seat beside him is a file with Emily Posa's details attached to it, ready to guide his next action."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Shafts of light gradually form the shape of a running man A bright white light shines out from the center of a black screen The screen lightens to reveal clouds and a blue sky The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her She stands on a raised plinth before the cloudy sky An orange disc surrounded by black revolves like a record on a turntable Shafts of light gradually form the shape of a running man The figure becomes smaller and is frozen in the iris of an intensely blue eye The image fades to black A handsome black guy holds a receiver to his ear The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her On the seat beside him is a file with Emily Posa's details attached to it Before him on a coffee table is a list of names with a typed note attached to it He covers his eyes with his hand He rocks back and forth He prints out her details He removes his hand from his face The silhouette of the man swims the crawl on the surface Sun glints on the surface of the water the garden and the ocean The man swims to shore and strides onto the beach The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes A long low beach house with white flowers trailing from part of its roof looks out over a patio A handsome black guy holds a receiver to his ear A long low beach house with white flowers trailing from part of its roof looks out over a patio the garden and the ocean In the house the man studies himself solemnly in a mirror as he fastens his tie The man sits pensively on his sofa Before him on a coffee table is a list of names with a typed note attached to it The name Ezra Turner has been encircled on the list The man sits pensively on his sofa In a call center cubicle a man wearing a headset sits at a computer A cleaner polishes a floor in a brightly lit corridor Ezra types on a braille keyboard Ezra disconnects the call Ben slams the phone down The screen lightens to reveal clouds and a blue sky The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes Looking disturbed by his own actions Ben claps his hands to his mouth and stares down Above it the name Yvonne Bastidos has been crossed out He blinks composes himself and lowers his hands Pacing Ben stabs the air with a finger each time he calls out a name Ben smashes a chair against a coffee table A list of names scrolls A rapid montage of items A bright white light shines out from the center of a black screen a newspaper article The man swims to shore and strides onto the beach In a call center cubicle a man wearing a headset sits at a computer The image fades to black Sun glints on the surface of the water a coast road snapshots of Ben Traffic glides along a sunny freeway Sarah Jenson's funeral card A deserted open plan office in shadowy light A cleaner polishes a floor in a brightly lit corridor Ben sits in a cubicle typing on a keyboard He stares at his computer monitor gravely A deserted open plan office in shadowy light The name Emily Posa has been encircled on his list beside him Above it the name Yvonne Bastidos has been crossed out Ben claps his hands to his mouth and stares down Ben stares pensively at the details which include a photo of attractive darkhaired Emily He stares at his computer monitor gravely The figure becomes smaller and is frozen in the iris of an intensely blue eye He prints out her details Traffic glides along a sunny freeway Ben stares ahead gravely as he drives a coast road On the seat beside him is a file with Emily Posa's details attached to it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Shafts of light gradually form the shape of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black guy holds a receiver to his ear. He covers his eyes with his hand. He rocks back and forth. He removes his hand from his face. The silhouette of the man swims the crawl on the surface. Sun glints on the surface of the water. The man swims to shore and strides onto the beach. The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof looks out over a patio. the garden and the ocean. In the house the man studies himself solemnly in a mirror as he fastens his tie. The man sits pensively on his sofa. Before him on a coffee table is a list of names with a typed note attached to it. The name Ezra Turner has been encircled on the list. In a call center cubicle a man wearing a headset sits at a computer. Ezra types on a braille keyboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Ezra disconnects the call. Ben slams the phone down. Looking disturbed by his own actions. Ben claps his hands to his mouth and stares down. He blinks composes himself and lowers his hands. Pacing Ben stabs the air with a finger each time he calls out a name. Ben smashes a chair against a coffee table. A list of names scrolls. A rapid montage of items. a newspaper article. a coast road. snapshots of Ben. Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A cleaner polishes a floor in a brightly lit corridor. Ben sits in a cubicle typing on a keyboard. He stares at his computer monitor gravely. The name Emily Posa has been encircled on his list beside him. Above it the name Yvonne Bastidos has been crossed out. Ben stares pensively at the details which include a photo of attractive darkhaired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details attached to it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Shafts of light gradually form the shape of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black guy holds a receiver to his ear. He covers his eyes with his hand. He rocks back and forth. He removes his hand from his face. The silhouette of the man swims the crawl on the surface. Sun glints on the surface of the water. The man swims to shore and strides onto the beach. The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof looks out over a patio. the garden and the ocean. In the house the man studies himself solemnly in a mirror as he fastens his tie. The man sits pensively on his sofa. Before him on a coffee table is a list of names with a typed note attached to it. The name Ezra Turner has been encircled on the list. In a call center cubicle a man wearing a headset sits at a computer. Ezra types on a braille keyboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Ezra disconnects the call. Ben slams the phone down. Looking disturbed by his own actions. Ben claps his hands to his mouth and stares down. He blinks composes himself and lowers his hands. Pacing Ben stabs the air with a finger each time he calls out a name. Ben smashes a chair against a coffee table. A list of names scrolls. A rapid montage of items. a newspaper article. a coast road. snapshots of Ben. Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A cleaner polishes a floor in a brightly lit corridor. Ben sits in a cubicle typing on a keyboard. He stares at his computer monitor gravely. The name Emily Posa has been encircled on his list beside him. Above it the name Yvonne Bastidos has been crossed out. Ben stares pensively at the details which include a photo of attractive darkhaired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details attached to it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Shafts of light gradually form the shape of a running man. The figure becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black guy holds a receiver to his ear. He covers his eyes with his hand. He rocks back and forth. He removes his hand from his face. Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A cleaner polishes a floor in a brightly lit corridor. Ben sits in a cubicle typing on a keyboard. He stares at his computer monitor gravely. The name Emily Posa has been encircled on his list beside him. Above it the name Yvonne Bastidos has been crossed out. Ben stares pensively at the details which include a photo of attractive darkhaired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details attached to it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her. She stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Ben stares pensively at the details which include a photo of attractive darkhaired Emily. He prints out her details. Traffic glides along a sunny freeway. Ben stares ahead gravely as he drives. On the seat beside him is a file with Emily Posa's details attached to it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A bright white light shines out from the center of a black screen. The screen lightens to reveal clouds and a blue sky. The light is held aloft by a statuesque penguin wearing a long, white robe with a blue sash draped around the penguin. The penguin stands on a raised plinth before the cloudy sky. An orange disc surrounded by black revolves like a record on a turntable. Shafts of light gradually form the shape of a running frog. The frog becomes smaller and is frozen in the iris of an intensely blue eye. The image fades to black. A handsome black dog holds a receiver to its ear. It covers its eyes with its paw. It rocks back and forth. It removes its paw from its face. The silhouette of the dog swims the crawl on the surface. Sun glints on the surface of the water. The dog swims to shore and strides onto the beach. The dog, tall, lean and in its 30s, walks up steps from the beach which cut through a garden, abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof looks out over a patio, the garden and the ocean. In the house, the dog studies itself solemnly in a mirror as it fastens its tie. The dog sits pensively on its sofa. Before it on a coffee table is a list of names with a typed note attached to it. The name Ezra Turner has been encircled on the list. In a call center cubicle, a rabbit wearing a headset sits at a computer. A turtle types on a braille keyboard. The turtle disconnects the call. A fox slams the phone down. Looking disturbed by its own actions, the fox claps its hands to its mouth and stares down. It blinks, composes itself, and lowers its hands. Pacing, the fox stabs the air with a finger each time it calls out a name. The fox smashes a chair against a coffee table. A list of names scrolls. A rapid montage of items -- a newspaper article, a coast road, snapshots of the fox, Sarah Jenson's funeral card. A deserted open plan office in shadowy light. A squirrel polishes a floor in a brightly lit corridor. The fox sits in a cubicle, typing on a keyboard. It stares at its computer monitor gravely. The name, Emily Posa, has been encircled on its list beside it. Above it, the name Yvonne Bastidos has been crossed out. The fox stares pensively at the details, which include a photo of attractive, dark-haired Emily. It prints out her details. Traffic glides along a sunny freeway. The fox stares ahead gravely as it drives. On the seat beside it is a file with Emily Posa's details attached to it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A bright red lantern shines out from the center of a green screen. The screen lightens to reveal mountains and a golden sunset. The lantern is held aloft by a statuesque woman wearing a long, green dress with a red ribbon draped around her. She stands on a raised pedestal before the mountainous horizon. A purple globe surrounded by green revolves like a carousel on a music box. Shafts of light gradually form the shape of a climbing man. The figure becomes smaller and is frozen in the iris of an intensely green eye. The image fades to white. A handsome black guy holds a telescope to his ear. He covers his eyes with his hat. He rocks back and forth. He removes his hat from his face. The silhouette of the man hops the leap on the surface. Moonlight glints on the surface of the sand. The man hops to shore and strides onto the desert. The man, tall, lean and in his 30s, walks up steps from the desert which cut through a forest, abundant with colorful lanterns and trees. A long low cabin with red vines trailing from part of its roof looks out over a terrace, the forest and the river. In the cabin, the man studies himself solemnly in a portrait as he fastens his scarf. The man sits pensively on his armchair. Before him on a side table is a list of tasks with a typed memo attached to it. The task \"Ezra Turner\" has been encircled on the list. In a library cubicle, a man wearing headphones sits at a typewriter. Ezra types on a tactile slate. Ezra disconnects the call. Ben slams the book down. Looking disturbed by his own actions, Ben claps his hands to his forehead and stares down. He blinks, composes himself, and lowers his elbows. Pacing, Ben stabs the air with a pen each time he calls out an item. Ben smashes a lamp against a side table. A list of tasks scrolls. A rapid montage of items -- a magazine cover, a forest trail, snapshots of Ben, Sarah Jenson's wedding invitation. A deserted open plan studio in flickering light. A gardener rakes a lawn in a brightly lit hallway. Ben sits in a box, typing on a typewriter. He stares at his television screen gravely. The name, Emily Posa, has been encircled on his list beside him. Above it, the name Yvonne Bastidos has been crossed out. Ben stares pensively at the documents, which include a sketch of attractive, dark-haired Emily. He prints out her sketch. Clouds drift along a cloudy mountain pass. Ben stares ahead gravely as he pedals. On the seat beside him is a folder with Emily Posa's sketch attached to it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A bright white light flickers out from the center of a black screen. The screen transforms to reveal clouds and a blue sky. The light is suspended by a statuesque woman wearing a long, white robe with a blue sash wrapped around her. She hovers on a raised plinth before the cloudy sky. An orange disc surrounded by black spins like a carousel on a turntable. Shafts of light gradually shape the form of a running man. The figure enlarges and is captured in the iris of an intensely blue eye. The image blurs to black. A handsome black guy grips a receiver to his ear. He uncovers his eyes with his hand. He sways side to side. He places his hand on his face. The silhouette of the man glides the backstroke on the surface. Sun sparkles on the surface of the water. The man drifts to shore and jogs onto the beach. The man, tall, lean and in his 30s, hops up steps from the beach which weave through a garden, abundant with colorful flowers and bushes. A long low beach house with white flowers trailing from part of its roof overlooks a patio, the garden and the ocean. In the house, the man examines himself quietly in a mirror as he ties his tie. The man lounges pensively on his sofa. Before him on a coffee table is a list of names with a typed note affixed to it. The name Ezra Turner has been decorated on the list. In a call center cubicle, a man wearing a headset reclines at a computer. Ezra clicks on a braille keyboard. Ezra interrupts the call. Ben throws the phone up. Looking puzzled by his own actions, Ben places his hands on his mouth and gazes up. He yawns, composes himself, and raises his hands. Stomping, Ben flicks the air with a finger each time he whispers a name. Ben drops a chair onto a coffee table. A list of names cascades. A rapid montage of items -- a magazine article, a mountain road, snapshots of Ben, Sarah Jenson's wedding card. A deserted open plan office in shadowy light. A cleaner scrubs a floor in a brightly lit corridor. Ben stands in a cubicle, scribbling on a keyboard. He glances at his computer monitor gravely. The name, Emily Posa, has been highlighted on his list beside him. Above it, the name Yvonne Bastidos has been erased. Ben gazes thoughtfully at the details, which include a photo of attractive, dark-haired Emily. He folds her details. Traffic drifts along a sunny freeway. Ben looks ahead gravely as he rides. On the seat beside him is a file with Emily Posa's details enclosed in it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A luminous green light beams out from the edge of a silver canvas. The canvas brightens to reveal mountains and a red ocean. The light is held aloft by a gigantic elephant wearing a short, red jacket with a green ribbon draped around it. It stands on a flat pedestal before the rocky ocean. A purple triangle surrounded by white revolves like a coin on a table. Streams of darkness gradually form the shape of a flying bird. The shape becomes larger and is frozen in the pupil of a fiery red eye. The picture fades to white. A cheerful white cat holds a hammer to its paw. It covers its ears with its paw. It sways up and down. It removes its paw from its ears. The shadow of the cat dances the tango on the ground. Moonlight sparkles on the surface of the sand. The cat dances to the forest and strides onto the meadow. The cat, short, plump and in its teens, walks up hills from the meadow which cut through a desert, barren with dry rocks and cacti. A tall high mountain cabin with yellow trees trailing from part of its chimney looks out over a balcony, the desert and the lake. In the cabin, the cat examines itself cheerfully in a camera as it adjusts its hat. The cat sits joyfully on its bed. Before it on a bookshelf is a collection of stories with a handwritten letter attached to it. The title Oliver Twist has been highlighted on the collection. In a library cubicle, an owl wearing glasses sits at a calculator. Oliver calculates on a wooden abacus. Oliver ends the conversation. John drops the pencil down. Looking pleased with its own actions, John taps its toes to its lips and gazes up. It winks, calms itself, and raises its toes. Stretching, John tickles the sky with a wing each time it whispers a phrase. John tosses a pillow against a bookshelf. A collection of stories rotates. A slow sequence of objects – a diary entry, a mountain path, portraits of John, Lucy Stevenson's invitation card. A crowded closed plan kitchen in bright light. A gardener trims a hedge in a dimly lit hallway. John sits in a lounge, scribbling on a tablet. It peers at its tablet screen joyfully. The title, Anna Garcia, has been highlighted on its collection beside it. Beneath it, the title Rosie Delgado has been erased. John studies cheerfully at the documents, which include a sketch of beautiful, blonde-haired Anna. It sketches out her documents. Birds soar along a cloudy avenue. John peers around cheerfully as it pedals. On the cushion beside it is a notebook with Anna Garcia's documents attached to it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A dim golden glow emanates from the center of a green screen. The screen darkens to reveal mountains and a red sky. The glow is tossed aside by a diminutive man wearing a short, black cloak with a red ribbon tied around him. He kneels on a broken stage beneath the mountainous sky. A green triangle surrounded by white rotates like a globe on a pedestal. Trenches of shadow slowly form the shape of a sleeping woman. The figure becomes larger and is trapped in the iris of a brightly yellow eye. The image shifts to white. A nervous blonde woman lifts a microphone to her mouth. She uncovers her mouth with her arm. She sways side to side. She places her arm on her shoulder. The outline of the woman dives under the water. Moon reflects on the surface of the water. The woman crawls to land and skips off the pier. The woman, short, stout and in her 50s, leaps up stairs from the pier which leads through a jungle, sparse with gray boulders and trees. A tall narrow mountain cabin with black vines hanging from part of its chimney gazes over a terrace, the jungle and the lake. In the cabin, the woman surveys herself cheerfully in a mirror as she removes her hat. The woman stands restlessly by her bed. Before her on a nightstand is a map of cities with a handwritten letter stapled to it. The name Henry Collins has been underlined on the map. In a library basement, a woman wearing a scarf stands at a desk. Henry reads on a braille tablet. Henry answers the call. Laura drops the pen. Looking perplexed by her own thoughts, Laura clasps her hands over her forehead and gazes up. She chuckles, composes herself, and raises her arms. Standing still, Laura snaps the air with a thumb each time she whispers a city. Laura throws a book against a chair. A collection of cities flashes. A slow sequence of visuals -- a magazine cover, a desert path, photographs of Laura, Robert Solomon's wedding invitation. A bustling public plaza in glaring light. A gardener waters a plant in a dimly lit hallway. Laura kneels in a tent, whispering to a typewriter. She glances at her typewriter screen delightedly. The name, Michael Santos, has been underlined on her map beside her. Below it, the name Julian Alvarez has been erased. Laura glances excitedly at the facts, which include a drawing of handsome, blond-haired Michael. She tears out his details. Clouds hover over a rainy highway. Laura glances backward joyfully as she flies. On the seat beside her is a backpack with Michael Santos's details attached to it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A bright green flame flickers out from the center of a silver canvas. The canvas darkens to reveal mountains and a golden desert. The flame is held high by a towering woman wearing a short, black jacket with a green belt looped around her. She stands on a wooden stage before the rocky desert. A white triangle surrounded by red spins like a wheel on a bicycle. Beams of flame gradually form the shape of a flying bird. The figure becomes larger and is trapped in the center of an intensely green leaf. The image brightens to white. A cheerful white lady holds a book to her mouth. She covers her ears with her fingers. She sways side to side. She removes her fingers from her ears. The outline of the woman dances the tango on the ground. Moonlight glimmers on the surface of the sand. The woman dances to a dune and leaps into the forest. The woman, short, stocky and in her 50s, climbs down steps from the forest which wind through a meadow, teeming with white rocks and trees. A tall round farmhouse with blue vines hanging from part of its walls stands above a balcony, the meadow and the river. In the farmhouse, the woman admires herself cheerfully in a window as she takes off her hat. The woman stands excitedly on her porch. Before her on a picnic blanket is a stack of books with a handwritten letter pinned to it. The name Ezra Turner has been underlined on the stack. In a library booth, a woman wearing earphones stands at a typewriter. Ezra paints on a canvas. Ezra ends the conversation. Ben puts the pencil up. Looking pleased by his own actions, Ben lowers his hands and peers up. He yawns, relaxes, and raises his hands. Jumping, Ben pats the air with a palm each time he writes out a word. Ben throws a pillow against a bookshelf. A stack of books flips. A fast sequence of objects -- a diary entry, a desert path, portraits of Ben, Sarah Jenson's wedding invitation. An empty enclosed park in bright sunshine. A gardener trims a hedge in a dimly lit walkway. Ben stands in a booth, painting on a canvas. He listens to his radio intently. The name, Emily Posa, has been underlined on his stack beside him. Above it, the name Yvonne Bastidos has been erased. Ben listens cheerfully to the melodies, which include a sketch of charming, fair-haired Emily. He tears up her sketch. Airplanes soar over a cloudy skyline. Ben listens upward cheerfully as he sings. On the mat beside him is a scrapbook with Emily Posa's song attached to it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A dim green glow radiates from the center of a wooden canvas. The canvas darkens to disclose mountains and a red river. The glow is perched high by a colossal bird wearing a short, green vest with a yellow ribbon tied around it. It perches on a sunken pedestal beneath the misty river. A purple hexagon encircled by white spins like a wheel on a cart. Beams of shadow gradually craft the form of a leaping frog. The creature becomes larger and is suspended in the pupil of a vividly red eye. The vision brightens to white. A jovial white cat grasps a telescope to its mouth. It uncovers its ears with its paw. It shakes side to side. It places its paw over its tail. The outline of the cat floats the backstroke on the ground. Rain sparkles on the ground of the soil. The cat glides to an island and skips onto the forest. The cat, short, plump and in its teens, runs down ladders from the forest which wind through a desert, sparse with dull rocks and cacti. A short high mountain cabin with black vines hanging from part of its balcony gazes out over a veranda, the desert and the canyon. Inside the cabin, the cat examines itself cheerfully in a window as it loosens its belt. The cat stands joyfully on its bed. Before it on a tea stand is a stack of numbers with a written script pasted to it. The number 789 has been squared on the stack. In a warehouse booth, a pigeon wearing goggles perches before a monitor. 789 scribbles on a tactile tablet. 789 reconnects the transmission. Max tosses the horn up. Looking elated by its own maneuvers, Max snaps its paws to its nostrils and leers up. It yawns, calms itself, and raises its paws. Dancing, Max pokes the ground with a foot each time it shouts out a number. Max mends a table around a tea stand. A column of numbers rotates. A slow sequence of gadgets -- a journal excerpt, a desert path, portraits of Max, Lily Davis's wedding invitation. An abandoned closed space workshop in a dim glow. A gardener sweeps a wall in a dimly lit hallway. Max stands in a booth, scribbling on a tablet. It glances at its screen lightly. The number, Olivia Reed, has been squared on its stack beneath it. Below it, the number Carlos Montoya has been highlighted. Max glances joyfully at the summaries, which include a sketch of charming, golden-haired Olivia. It erases her summary. Birds hover above a cloudy canyon. Max glances down lightly as it crawls. On the ground beneath it is a box with Olivia Reed's summary glued to it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A bright light on a black screen reveals clouds and a statuesque woman in a white robe. An orange disc spins and light forms a running man who freezes in a blue eye. The scene fades to black. A handsome black man holds a phone, looking distressed, then swims to shore and walks through a garden to a beach house. He solemnly fastens his tie and sits with a list of names, focusing on Ezra Turner. In a call center, Ezra uses a braille keyboard. Ben, the man from earlier, angrily slams the phone, paces while calling out names, and smashes a chair. A montage follows: a newspaper, coast road, and a funeral card for Sarah Jenson. In an office, Ben types on a computer, focuses on Emily Posa's circled name, and crosses out Yvonne Bastidos. He prints Emily's details. Driving, Ben stares ahead gravely with a file of Emily’s information beside him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On the seat beside him is a file with Emily Posa's details attached to it Ben stares ahead gravely as he drives Traffic glides along a sunny freeway He prints out her details Ben stares pensively at the details which include a photo of attractive darkhaired Emily Above it the name Yvonne Bastidos has been crossed out The name Emily Posa has been encircled on his list beside him He stares at his computer monitor gravely Ben sits in a cubicle typing on a keyboard A cleaner polishes a floor in a brightly lit corridor A deserted open plan office in shadowy light Sarah Jenson's funeral card snapshots of Ben a coast road a newspaper article A rapid montage of items A list of names scrolls Ben smashes a chair against a coffee table Pacing Ben stabs the air with a finger each time he calls out a name He blinks composes himself and lowers his hands Ben claps his hands to his mouth and stares down Looking disturbed by his own actions Ben slams the phone down Ezra disconnects the call Ezra types on a braille keyboard In a call center cubicle a man wearing a headset sits at a computer The name Ezra Turner has been encircled on the list Before him on a coffee table is a list of names with a typed note attached to it The man sits pensively on his sofa In the house the man studies himself solemnly in a mirror as he fastens his tie the garden and the ocean A long low beach house with white flowers trailing from part of its roof looks out over a patio The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes The man swims to shore and strides onto the beach Sun glints on the surface of the water The silhouette of the man swims the crawl on the surface He removes his hand from his face He rocks back and forth He covers his eyes with his hand A handsome black guy holds a receiver to his ear The image fades to black The figure becomes smaller and is frozen in the iris of an intensely blue eye Shafts of light gradually form the shape of a running man An orange disc surrounded by black revolves like a record on a turntable She stands on a raised plinth before the cloudy sky The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her The screen lightens to reveal clouds and a blue sky A bright white light shines out from the center of a black screen"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Pacing Ben stabs the air with a finger each time he calls out a name Ezra types on a braille keyboard Ezra disconnects the call He rocks back and forth The name Ezra Turner has been encircled on the list He covers his eyes with his hand Ben smashes a chair against a coffee table Ben sits in a cubicle typing on a keyboard The silhouette of the man swims the crawl on the surface She stands on a raised plinth before the cloudy sky snapshots of Ben An orange disc surrounded by black revolves like a record on a turntable Ben stares pensively at the details which include a photo of attractive darkhaired Emily Looking disturbed by his own actions He removes his hand from his face a newspaper article He blinks composes himself and lowers his hands The name Emily Posa has been encircled on his list beside him In the house the man studies himself solemnly in a mirror as he fastens his tie A list of names scrolls Ben stares ahead gravely as he drives A rapid montage of items Sarah Jenson's funeral card Ben slams the phone down Before him on a coffee table is a list of names with a typed note attached to it In a call center cubicle a man wearing a headset sits at a computer On the seat beside him is a file with Emily Posa's details attached to it He prints out her details A bright white light shines out from the center of a black screen The man sits pensively on his sofa A long low beach house with white flowers trailing from part of its roof looks out over a patio Above it the name Yvonne Bastidos has been crossed out Sun glints on the surface of the water A cleaner polishes a floor in a brightly lit corridor Traffic glides along a sunny freeway The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her Ben claps his hands to his mouth and stares down A deserted open plan office in shadowy light Shafts of light gradually form the shape of a running man a coast road The figure becomes smaller and is frozen in the iris of an intensely blue eye A handsome black guy holds a receiver to his ear The man swims to shore and strides onto the beach The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes the garden and the ocean The screen lightens to reveal clouds and a blue sky The image fades to black He stares at his computer monitor gravely"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ezra disconnects the call Ben slams the phone down Looking disturbed by his own actions Ben claps his hands to his mouth and stares down He blinks composes himself and lowers his hands Pacing Ben stabs the air with a finger each time he calls out a name Ben smashes a chair against a coffee table A list of names scrolls A rapid montage of items a newspaper article a coast road snapshots of Ben Sarah Jenson's funeral card A deserted open plan office in shadowy light A cleaner polishes a floor in a brightly lit corridor Ben sits in a cubicle typing on a keyboard He stares at his computer monitor gravely The name Emily Posa has been encircled on his list beside him Above it the name Yvonne Bastidos has been crossed out Ben stares pensively at the details which include a photo of attractive darkhaired Emily He prints out her details Traffic glides along a sunny freeway Ben stares ahead gravely as he drives On the seat beside him is a file with Emily Posa's details attached to it A bright white light shines out from the center of a black screen The screen lightens to reveal clouds and a blue sky The light is held aloft by a statuesque woman wearing a long white robe with a blue sash draped around her She stands on a raised plinth before the cloudy sky An orange disc surrounded by black revolves like a record on a turntable Shafts of light gradually form the shape of a running man The figure becomes smaller and is frozen in the iris of an intensely blue eye The image fades to black A handsome black guy holds a receiver to his ear He covers his eyes with his hand He rocks back and forth He removes his hand from his face The silhouette of the man swims the crawl on the surface Sun glints on the surface of the water The man swims to shore and strides onto the beach The man tall lean and in his 30s walks up steps from the beach which cut through a garden abundant with colorful flowers and bushes A long low beach house with white flowers trailing from part of its roof looks out over a patio the garden and the ocean In the house the man studies himself solemnly in a mirror as he fastens his tie The man sits pensively on his sofa Before him on a coffee table is a list of names with a typed note attached to it The name Ezra Turner has been encircled on the list In a call center cubicle a man wearing a headset sits at a computer Ezra types on a braille keyboard"
        }
      ]
    }
  ]
}