{
  "ground_truth": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the switch, and her eyes widen as she looks at Ben in awe as the fly wheels turn. Emily presses down a lever, and the piston arms pump, picking up paper, setting it on the platen, and printing on it. Emily watches in amazement, then wraps her arms around Ben's neck and hugs him tight. Ben gradually responds to her touch, rests his head on her shoulder, closes his eyes, and lays his hands on her back. A tearful Emily nuzzles into him, and Ben stands back, gently drawing her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. They break off and stand with their foreheads together. Ben pulls back a little and kisses her fingertips. Ben hurries out of the workshop, steps over the low picket fence, goes to unlock his car, and takes out the gift. His brother, Ben, now Tim, goes to his car and reaches in for the ID, which he hands to his brother, Ben. Tim, who has put his gift back in the car, looks sheepish while the real Ben considers uneasily for a moment. Tim reaches into his jeans' pocket and hands them over, then walks briskly back towards the house, breaking into a jog. He steps back over the picket fence and returns to the workshop, where Emily sits in a sultry pose, waiting for him. Emily stands, and shuffling uneasily, Tim reluctantly moves away from Emily's touch. Ever-persistent, she draws his face to her and kisses his cheek. Tim calms a little and lets her kiss his cheek several more times. Cupping his face in her hands, Emily kisses Tim on the lips, and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms. They kiss again, and Tim carries her out of the workshop. Tim and Emily, still kissing, fall back on gold satin pillows, and Tim kneels astride Emily, who helps him off with his polo shirt. She sees a long scar running from his side and back. In golden light, Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss, and Tim lays a hand gently on a scar on Emily's naked breast and kisses it. Outside, rain streaks a window, making the image of the kissing couple inside hazy.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Creature is now shining as she nears with a doubtful grin. Emily stretches for the button, and her eyes enlarge as she gazes at Ben in wonder as the flywheels revolve. Emily pushes down a grip, and the piston limbs pump, picking up paper, placing it on the platen, and producing on it. Emily observes in astonishment, then encircles her arms around Ben's neck and embraces him firmly. Ben gradually reacts to her touch, rests his head on her shoulder, shuts his eyes, and places his hands on her back. A teary Emily snuggles into him, and Ben stands back, gently pulling her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing fervently. They break off and stand with their foreheads together. Ben pulls back a little and kisses her fingertips. Ben rushes out of the workshop, steps over the low picket fence, goes to unlock his vehicle, and takes out the present. His sibling, Ben, now Tim, goes to his vehicle and reaches in for the ID, which he hands to his sibling, Ben. Tim, who has put his present back in the vehicle, looks ashamed while the real Ben considers uneasily for a moment. Tim reaches into his jeans' pocket and hands them over, then walks briskly back towards the house, breaking into a jog. He steps back over the picket fence and returns to the workshop, where Emily sits in a sultry pose, waiting for him. Emily stands, and shuffling uneasily, Tim reluctantly moves away from Emily's touch. Ever-persistent, she draws his face to her and kisses his cheek. Tim calms a little and lets her kiss his cheek several more times. Cupping his face in her hands, Emily kisses Tim on the lips, and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks. The pair wrap their arms tightly around each other as they continue to kiss with increasing passion. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms. They kiss again, and Tim carries her out of the workshop. Tim and Emily, still kissing, fall back on gold satin cushions, and Tim kneels astride Emily, who helps him off with his polo shirt. She sees a long scar running from his side and back. In golden light, Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss, and Tim lays a hand gently on a scar on Emily's bare breast and kisses it. Outside, rain streaks a window, making the image of the kissing pair inside hazy."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Beast is now gleaming as an unconvinced smile is worn by her while she is approached. The switch is reached for by Emily, and awe widens her eyes as Ben is looked at by her while the fly wheels are turned. A lever is pressed down by Emily, and the piston arms are pumped, with paper being picked up, set on the platen, and printed on. Amazement is shown by Emily as she watches, then Ben's neck is wrapped around by her arms as she hugs him tight. Her touch is gradually responded to by Ben, and his head is rested on her shoulder, his eyes are closed, and her back is laid on by his hands. Into him, a tearful Emily is nuzzled, while back is stood by Ben, and her to him is gently drawn, as a lingering kiss is planted on her lips. Against Ben's cheek, her fingers are brushed by Emily as a passionate kiss is continued. The kiss is broken off, and with their foreheads together, they stand. Back is pulled by Ben a little, and her fingertips are kissed by him. Out of the workshop is hurried by Ben, and over the low picket fence, he is stepped, going to his car to unlock it and taking out the gift. His brother, now Tim, goes to his car, reaches in for the ID, and hands it to his brother, Ben. His gift is put back in the car by Tim, looking sheepish while the real Ben considers uneasily for a moment. Into his jeans' pocket, Tim reaches, hands them over, and towards the house, he walks briskly, breaking into a jog. Over the picket fence, he steps back and into the workshop, he returns, where a sultry pose is sat in by Emily, waiting for him. Tim stands reluctantly, shuffling uneasily, and away from Emily's touch, he moves. Ever-persistent, his face is drawn to her by her, and his cheek is kissed. A little calmed is Tim, allowing his cheek to be kissed several more times. Tim's face is cupped in her hands by Emily as his lips are kissed, and motionless with eyes closed, Tim remains but back gradually begins to kiss her as tears roll down his cheeks. Each other is tightly wrapped around by the couple's arms as a kiss with mounting passion is continued. Around Tim’s neck, Emily's arms are as her legs are lifted and held in his arms. A kiss is given again, and out of the workshop, she is carried by Tim. On gold satin pillows, Tim and Emily, still kissing, fall back, while across Emily Tim kneels and off with his polo shirt helps him. From his side and back, a long scar is seen by her. In golden light, off comes Emily’s delicate sandals, and undone is the clasp on her halterneck dress. Slowly, into a tender kiss, she and Tim move, and on a scar on Emily's naked breast a hand is gently laid by Tim, and it is kissed. Outside, the window is streaked by rain, making a hazy image of the kissing couple inside."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Beast gleams as Emily approaches with a hesitant smile. She flips the switch, eyes widening in awe at Ben as the flywheels turn. Emily presses a lever, and the piston arms pump, setting paper on the platen and printing. Amazed, she hugs Ben tightly. Ben responds, resting his head on her shoulder, eyes closed, hands on her back. Tearful, Emily nuzzles him, and Ben gently draws her in for a lingering kiss. Emily brushes Ben's cheek as they kiss passionately, then stand with foreheads together. Ben kisses her fingertips before hurrying out, stepping over the picket fence to his car for a gift. His brother, Tim, retrieves an ID from his car, handing it to Ben. Tim sheepishly returns to the house, jogging back to the workshop where Emily waits. Tim reluctantly moves away from her touch, but Emily persistently kisses his cheek, calming him. She cups his face, kissing him on the lips. Tim, initially motionless, gradually kisses back as tears fall. They embrace tightly, kissing passionately. Tim lifts Emily, carrying her out of the workshop. They fall onto gold satin pillows, and Tim kneels over Emily, who helps him remove his polo shirt, revealing a long scar. In golden light, Emily slips off her sandals and undoes her dress clasp. They share a tender kiss, Tim gently touching a scar on Emily's breast and kissing it. Outside, rain streaks the window, blurring the image of the kissing couple."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Beast gleams as Emily approaches with a hesitant smile. She flips a switch, eyes widening at Ben as the flywheels turn. Emily presses a lever, and the piston arms pump, printing on paper. Amazed, she hugs Ben, who gradually responds, resting his head on her shoulder. Tearful, Emily nuzzles him, and Ben gently kisses her. They continue kissing passionately, then stand with foreheads together. Ben kisses her fingertips before hurrying out, stepping over the fence to his car for a gift. His brother, Tim, retrieves an ID from his car, handing it to Ben. Tim sheepishly returns to the workshop, where Emily waits. Tim hesitantly moves away, but Emily kisses his cheek, calming him. She kisses him on the lips, and Tim gradually responds, tears falling. They embrace tightly, kissing passionately. Tim lifts Emily, carrying her out. They fall onto gold satin pillows, and Emily helps Tim remove his shirt, revealing a scar. In golden light, Emily removes her sandals and dress. They kiss tenderly, and Tim gently touches a scar on Emily's breast, kissing it. Outside, rain streaks the window, blurring the image of the kissing couple."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Beast, now polished to a brilliant shine, stands proudly as she approaches with a smile that betrays her lingering doubts. Emily reaches out for the switch, and her eyes widen in sheer amazement as she turns to look at Ben, her expression filled with awe as the flywheels begin to spin. With a sense of wonder, Emily presses down on a lever, setting the piston arms into motion. They pump rhythmically, picking up sheets of paper, setting them carefully on the platen, and printing on them with precision. Emily watches this mechanical marvel unfold before her eyes, utterly captivated, and then she wraps her arms around Ben's neck, pulling him into a tight embrace. Ben, feeling her warmth, gradually responds to her touch, resting his head gently on her shoulder, closing his eyes in contentment, and placing his hands softly on her back. A tearful Emily nuzzles into him, and Ben steps back slightly, gently drawing her closer to him and planting a lingering, tender kiss on her lips. Emily brushes her fingers delicately against Ben's cheek as they continue to kiss with growing passion. They eventually break apart, standing with their foreheads touching in a moment of shared intimacy. Ben pulls back just a little and kisses her fingertips with affection. \n\nBen then hurries out of the workshop, stepping carefully over the low picket fence, and makes his way to unlock his car, retrieving the gift he had prepared. His brother, who is now known as Tim, goes to his own car and reaches inside for the ID, which he hands over to his brother, Ben. Tim, having placed his gift back in the car, looks somewhat sheepish while the real Ben considers the situation uneasily for a moment. Tim reaches into the pocket of his jeans and hands over the keys, then walks briskly back towards the house, breaking into a jog as he goes. He steps back over the picket fence and returns to the workshop, where Emily sits waiting for him in a sultry pose. As Emily stands, Tim shuffles uneasily, reluctantly moving away from her touch. Ever-persistent, she draws his face towards her and plants a gentle kiss on his cheek. Tim calms down a little, allowing her to kiss his cheek several more times. Cupping his face tenderly in her hands, Emily kisses Tim on the lips, and although Tim remains motionless with his eyes closed, he gradually begins to kiss her back as tears roll down his cheeks. The couple wraps their arms tightly around each other, continuing to kiss with mounting passion. Emily's arms encircle Tim's neck as he lifts her legs, holding her securely in his arms. They share another kiss, and Tim carries her out of the workshop. \n\nTim and Emily, still locked in a passionate embrace, fall back onto gold satin pillows, and Tim kneels astride Emily, who assists him in removing his polo shirt. She notices a long scar running from his side to his back. Bathed in golden light, Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss, and Tim lays a gentle hand on a scar on Emily's bare breast, kissing it softly. Outside, rain streaks down the window, creating a hazy image of the couple kissing inside, their silhouettes blurred by the droplets."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The impressive machine known as The Beast gleams with a polished brilliance, standing proudly as Emily approaches, her smile unable to completely mask the lingering doubts hidden beneath her cheerful demeanor. As she extends her hand towards the switch, her eyes widen in absolute amazement, and she turns her gaze towards Ben. Her expression is filled with awe and wonder as the flywheels begin to spin smoothly. With a sense of wonderment, Emily presses down on a lever, setting the piston arms into systematic motion. They rhythmically pump, meticulously picking up sheets of paper, placing them carefully on the platen, and printing on them with remarkable precision and accuracy. Emily watches this mechanical marvel unfold before her, completely captivated by the sight, and then she wraps her arms warmly around Ben's neck, pulling him into a tight, heartfelt embrace. Ben, feeling the comfort of her warmth, gradually responds to her touch, resting his head gently on her shoulder, savoring the moment as he closes his eyes in pure contentment, softly placing his hands on her back. A tearful Emily nuzzles into him affectionately, and Ben steps back slightly, yet gently draws her closer to him and plants a lingering, tender kiss on her lips. Emily gently brushes her fingers against Ben's cheek with a tender caress as they continue to kiss with growing passion and intensity. They eventually break apart, standing close with their foreheads touching, embracing a moment of shared intimacy and connection. Ben then pulls back slightly, placing a soft kiss on her fingertips with affection and fondness.\n\nBen subsequently hurries out of the bustling workshop, stepping carefully over the low, modest picket fence, and makes his way toward his car to unlock it, retrieving the thoughtfully prepared gift he had brought with him. Meanwhile, his brother, who is now referred to as Tim, walks over to his own vehicle and reaches inside to retrieve the identification, which he then hands over to his brother, Ben. Tim, having placed his own gift back in his car, appears somewhat sheepish, while the real Ben pauses to consider the situation with a sense of unease for a brief moment. Tim reaches into the pocket of his jeans and hands over the keys, then walks briskly back towards the house, breaking into a jog as he goes. He steps back over the picket fence and returns to the workshop, where Emily sits waiting for him in an alluring pose. As Emily rises, Tim shuffles uneasily, reluctantly moving away from her affectionate touch. Ever-persistent, she gently draws his face towards her and plants a soft, gentle kiss on his cheek. Tim calms down slightly, allowing her to kiss his cheek several more times with tenderness. Cupping his face lovingly in her hands, Emily kisses Tim on the lips, and although Tim remains motionless with his eyes closed, he gradually begins to respond and kiss her back, as tears roll down his cheeks. The couple wraps their arms tightly around each other, continuing to kiss with increasing passion and fervor. Emily's arms encircle Tim's neck as he lifts her legs, holding her securely within his embrace. They share yet another kiss, and Tim carries her out of the workshop with a sense of purpose.\n\nTim and Emily, still locked passionately in each other's embrace, fall back into the soft, inviting warmth of gold satin pillows. Tim kneels gently astride Emily, who assists him in removing his polo shirt, revealing a long scar that runs from his side to his back. Bathed in the golden light filtering through, Emily effortlessly slips off her delicate sandals and carefully undoes the clasp on her elegant halterneck dress. She and Tim move slowly into a tender, loving kiss, and Tim lays a gentle, reassuring hand on a scar on Emily's bare breast, kissing it softly with care. Outside, raindrops streak down the window, creating a hazy, dreamlike image of the couple locked in a kiss inside, their silhouettes beautifully blurred by the droplets cascading down the glass."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Beast stands gleaming under the light as she approaches with a smile that suggests skepticism. Emily reaches out her hand towards the switch, her fingers brushing against it before she flicks it on. Her eyes widen in surprise and awe as she turns her gaze towards Ben, who stands nearby, and watches the flywheels begin to turn with a rhythmic motion. Emily then presses down on a lever with deliberate force, setting the piston arms into motion. These arms pump methodically, picking up sheets of paper, setting them precisely on the platen, and imprinting them with ink. As the machine operates, Emily watches in amazement, her expression a mix of wonder and disbelief. Overcome with emotion, she wraps her arms around Ben's neck, pulling him into a tight embrace. Ben, feeling her warmth, gradually responds to her touch, resting his head gently on her shoulder. He closes his eyes, savoring the moment, and lays his hands softly on her back. A tearful Emily nuzzles into him, seeking comfort, while Ben stands back slightly, drawing her closer to him and planting a lingering kiss on her lips. Emily, feeling the tenderness of the moment, brushes her fingers gently against Ben's cheek as they continue to kiss passionately. They eventually break off the kiss, standing with their foreheads touching, sharing a quiet, intimate moment. Ben then pulls back a little, lifting her hand to his lips and kissing her fingertips tenderly. With a sense of urgency, Ben hurries out of the workshop, stepping over the low picket fence with ease. He makes his way to his car, unlocking it swiftly, and retrieves a gift from inside. Meanwhile, his brother, Tim, who is now mistaken for Ben, goes to his own car and reaches in to grab an ID, which he hands over to his brother, Ben. Tim, having placed his gift back in the car, looks sheepish and uncertain while the real Ben considers the situation uneasily for a moment. Tim then reaches into his jeans' pocket, retrieves a set of keys, and hands them over before walking briskly back towards the house, breaking into a jog as he steps back over the picket fence and returns to the workshop. Inside, Emily sits in a sultry pose, waiting for him. As Emily stands, Tim shuffles uneasily, feeling reluctant as he moves away from her touch. However, ever-persistent, Emily draws his face towards her and plants a gentle kiss on his cheek. Tim calms a little, allowing her to kiss his cheek several more times. Emily, cupping his face in her hands, kisses Tim on the lips. Tim remains motionless at first, his eyes closed, but gradually begins to kiss her back as tears roll down his cheeks. The couple wraps their arms tightly around each other, their kisses growing in intensity and passion. Emily's arms encircle Tim's neck as he lifts her legs, holding her securely in his arms. They share another kiss, and Tim carries her out of the workshop. Still locked in a kiss, Tim and Emily fall back onto gold satin pillows, with Tim kneeling astride Emily. She helps him remove his polo shirt, revealing a long scar running from his side to his back. Bathed in golden light, Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss, with Tim laying a gentle hand on a scar on Emily's naked breast and kissing it softly. Outside, rain streaks down a window, blurring the image of the kissing couple inside, creating a hazy, dreamlike scene."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Beast gleams as Emily approaches with an unconvinced smile. She activates the machine, watching in awe as it prints, then embraces Ben tightly. Ben gradually responds, resting his head on her shoulder and holding her close. A tearful Emily nuzzles into him, and Ben gently draws her in for a lingering kiss. They continue kissing passionately, breaking off to stand with their foreheads together. Ben kisses her fingertips before hurrying out of the workshop to retrieve a gift from his car. Meanwhile, Tim, who has put his gift back in the car, sheepishly hands Ben his ID and keys before jogging back to the house. He returns to the workshop, where Emily waits. Despite his reluctance, Emily persistently kisses Tim's cheek, calming him. She cups his face and kisses him on the lips, and Tim gradually reciprocates as tears fall. They embrace tightly, kissing with growing passion. Tim lifts Emily in his arms, and they continue kissing as he carries her out of the workshop. They fall back onto gold satin pillows, and Emily helps Tim remove his polo shirt, revealing a long scar. In the golden light, Emily slips off her sandals and undoes her dress, moving into a tender kiss with Tim. He gently touches a scar on her breast and kisses it. Outside, rain streaks the window, blurring the image of the kissing couple inside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Beast, a vintage printing press known for its intricate mechanisms, is now gleaming as she approaches with an unconvinced smile. Emily, fascinated by the press's historical significance, reaches for the switch, and her eyes widen as she looks at Ben in awe as the fly wheels, once integral to industrial revolution-era printing, turn. Emily presses down a lever, and the piston arms pump, picking up paper, setting it on the platen, and printing on it with a precision that once revolutionized communication. Emily watches in amazement, then wraps her arms around Ben's neck, grateful for his restoration skills, and hugs him tight. Ben gradually responds to her touch, rests his head on her shoulder, closes his eyes, and lays his hands on her back, embracing the moment. A tearful Emily nuzzles into him, and Ben stands back, gently drawing her to him and planting a lingering kiss on her lips, reminiscent of a scene from a romantic film. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. They break off and stand with their foreheads together, savoring the closeness. Ben pulls back a little and kisses her fingertips with tender affection. Ben hurries out of the workshop, located in a quaint corner of the property, steps over the low picket fence that marks the boundary, goes to unlock his car, and takes out the gift, carefully wrapped for the special occasion. His brother, Ben, now Tim, goes to his car and reaches in for the ID, which he hands to his brother, Ben, highlighting their close relationship. Tim, who has put his gift back in the car, looks sheepish while the real Ben considers uneasily for a moment, pondering the implications. Tim reaches into his jeans' pocket and hands them over, then walks briskly back towards the house, breaking into a jog as if compelled by an unseen urgency. He steps back over the picket fence and returns to the workshop, where Emily sits in a sultry pose, waiting for him with an air of anticipation. Emily stands, and shuffling uneasily, Tim reluctantly moves away from Emily's touch, feeling conflicted yet drawn to her. Ever-persistent, she draws his face to her and kisses his cheek, a gesture of understanding and patience. Tim calms a little and lets her kiss his cheek several more times, feeling comforted by her presence. Cupping his face in her hands, Emily kisses Tim on the lips, and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks, a silent expression of his vulnerability. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion, lost in their shared intimacy. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms, symbolizing trust and connection. They kiss again, and Tim carries her out of the workshop, stepping into the dim light of the hallway. Tim and Emily, still kissing, fall back on gold satin pillows, which were a recent purchase for their shared space, and Tim kneels astride Emily, who helps him off with his polo shirt, revealing his athletic build. She sees a long scar running from his side and back, a remnant of a past accident that left lasting memories. In golden light, Emily slips off her delicate sandals, handcrafted in Tuscany, and undoes the clasp on her halterneck dress, a vintage find. She and Tim move slowly into a tender kiss, and Tim lays a hand gently on a scar on Emily's naked breast, a testament to her own journey, and kisses it with compassion. Outside, rain streaks a window, making the image of the kissing couple inside hazy, as if nature itself was moved by their union."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile  Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it  Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight  Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back  A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips  Emily brushes her fingers against Ben's cheek as they continue kissing passionately  They break off and stand with their foreheads together  Ben pulls back a little and kisses her fingertips  Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift  His brother Ben now  Tim goes to his car and reaches in for the ID which he hands to his brother Ben  Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily  for a moment  Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog  He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him  Emily stands and shuffling uneasily  Tim reluctantly moves away from Emily's touch  Emily reaches for the switch and her eyes widen as she looks at Ben in awe  as the fly wheels turn  Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it  Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight  Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back  A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips  Emily brushes her fingers against Ben's cheek as they continue kissing passionately  They break off and stand with their foreheads together  Ben pulls back a little and kisses her fingertips  Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift  His brother Ben now  Tim goes to his car and reaches in for the ID which he hands to his brother Ben  Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily  for a moment  Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog  He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him  Emily stands and shuffling uneasily  Tim reluctantly moves away from Emily's touch  Everpersistent she draws his face to her and kisses his cheek  Tim calms a little and lets her kiss his cheek several more times  Cupping his face in her hands  Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks  The couple wrap their arms tightly around each other as they continue to kiss with mounting passion  Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms  They kiss again and Tim carries her out of the workshop  Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt  She sees a long scar running from his side and back  In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress  She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it  Outside rain streaks a window making the image of the kissing couple inside hazy"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the switch and her eyes widen as she looks at Ben in awe. as the fly wheels turn. Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it. Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight. Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back. A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. They break off and stand with their foreheads together. Ben pulls back a little and kisses her fingertips. Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift. His brother Ben now. Tim goes to his car and reaches in for the ID which he hands to his brother Ben. Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily. for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog. He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him. Emily stands and shuffling uneasily. Tim reluctantly moves away from Emily's touch. Everpersistent she draws his face to her and kisses his cheek. Tim calms a little and let us her kiss his cheek several more times. Cupping his face in her hands Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms. They kiss again and Tim carries her out of the workshop. Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt. She sees a long scar running from his side and back. In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it. Outside rain streaks a window making the image of the kissing couple inside hazy."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the switch and her eyes widen as she looks at Ben in awe. as the fly wheels turn. Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it. Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight. Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back. A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. They break off and stand with their foreheads together. Ben pulls back a little and kisses her fingertips. Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift. His brother Ben now. Tim goes to his car and reaches in for the ID which he hands to his brother Ben. Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily. for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog. He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him. Emily stands and shuffling uneasily. Tim reluctantly moves away from Emily's touch. Everpersistent she draws his face to her and kisses his cheek. Tim calms a little and let us her kiss his cheek several more times. Cupping his face in her hands Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms. They kiss again and Tim carries her out of the workshop. Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt. She sees a long scar running from his side and back. In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it. Outside rain streaks a window making the image of the kissing couple inside hazy."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the switch and her eyes widen as she looks at Ben in awe. as the fly wheels turn. Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it. Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight. Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back. A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms. They kiss again and Tim carries her out of the workshop. Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt. She sees a long scar running from his side and back. In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it. Outside rain streaks a window making the image of the kissing couple inside hazy."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the switch and her eyes widen as she looks at Ben in awe. as the fly wheels turn. In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress. She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it. Outside rain streaks a window making the image of the kissing couple inside hazy."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel is now gleaming as she approaches with an unconvinced smile. The lamp reaches for the switch, and its eyes widen as it looks at a chair in awe as the fly wheels turn. The lamp presses down a lever, and the piston arms pump, picking up paper, setting it on the platen, and printing on it. The lamp watches in amazement, then wraps its arms around the chair's neck and hugs it tight. The chair gradually responds to its touch, rests its head on the lamp's shoulder, closes its eyes, and lays its hands on the lamp's back. A tearful lamp nuzzles into it, and the chair stands back, gently drawing the lamp to it and planting a lingering kiss on its lips. The lamp brushes its fingers against the chair's cheek as they continue kissing passionately. They break off and stand with their foreheads together. The chair pulls back a little and kisses the lamp's fingertips. The chair hurries out of the workshop, steps over the low picket fence, goes to unlock its car, and takes out the gift. Its cousin, the chair, now the table, goes to its car and reaches in for the ID, which it hands to its cousin, the chair. The table, who has put its gift back in the car, looks sheepish while the real chair considers uneasily for a moment. The table reaches into its jeans' pocket and hands them over, then walks briskly back towards the house, breaking into a jog. It steps back over the picket fence and returns to the workshop, where the lamp sits in a sultry pose, waiting for it. The lamp stands, and shuffling uneasily, the table reluctantly moves away from the lamp's touch. Ever-persistent, it draws the table's face to it and kisses its cheek. The table calms a little and lets the lamp kiss its cheek several more times. Cupping its face in its hands, the lamp kisses the table on the lips, and the table remains motionless with its eyes closed but gradually begins to kiss it back as tears roll down its cheeks. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion. The lamp's arms are around the table's neck as it lifts the lamp's legs and holds it in its arms. They kiss again, and the table carries it out of the workshop. The table and the lamp, still kissing, fall back on gold satin pillows, and the table kneels astride the lamp, who helps it off with its polo shirt. It sees a long scar running from the table's side and back. In golden light, the lamp slips off its delicate sandals and undoes the clasp on its halterneck dress. It and the table move slowly into a tender kiss, and the table lays a hand gently on a scar on the lamp's naked breast and kisses it. Outside, rain streaks a window, making the image of the kissing couple inside hazy."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Beast is now gleaming as she approaches with an unconvinced smile. Emily reaches for the dial, and her eyes widen as she looks at Ben in awe as the clock hands turn. Emily presses down a button, and the gear wheels rotate, picking up fabric, setting it on the loom, and weaving it. Emily watches in amazement, then wraps her arms around Ben's neck and hugs him tight. Ben gradually responds to her touch, rests his head on her shoulder, closes his eyes, and lays his hands on her waist. A tearful Emily nuzzles into him, and Ben stands back, gently drawing her to him and planting a lingering kiss on her lips. Emily brushes her fingers against Ben's cheek as they continue kissing passionately. They break off and stand with their foreheads together. Ben pulls back a little and kisses her fingertips. Ben hurries out of the gallery, steps over the low wrought-iron railing, goes to unlock his motorcycle, and takes out the parcel. His brother, Ben, now Tim, goes to his bicycle and reaches in for the ticket, which he hands to his brother, Ben. Tim, who has put his parcel back in the bicycle basket, looks sheepish while the real Ben considers uneasily for a moment. Tim reaches into his jacket pocket and hands them over, then walks briskly back towards the garden, breaking into a jog. He steps back over the wrought-iron railing and returns to the gallery, where Emily sits in a carefree pose, waiting for him. Emily stands, and shuffling uneasily, Tim reluctantly moves away from Emily's touch. Ever-persistent, she draws his face to her and kisses his cheek. Tim calms a little and lets her kiss his cheek several more times. Cupping his face in her hands, Emily kisses Tim on the lips, and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks. The couple wrap their arms tightly around each other as they continue to kiss with mounting passion. Emily's arms are around Tim's neck as he lifts her arms and holds her in his embrace. They kiss again, and Tim carries her out of the gallery. Tim and Emily, still kissing, fall back on crimson velvet cushions, and Tim kneels astride Emily, who helps him off with his hoodie. She sees a long scar running from his shoulder and thigh. In golden light, Emily slips off her delicate slippers and undoes the clasp on her jumpsuit. She and Tim move slowly into a tender kiss, and Tim lays a hand gently on a scar on Emily's naked shoulder and kisses it. Outside, mist swirls on a window, making the image of the kissing couple inside hazy."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Beast is now shimmering as she strolls with an amused smile. Emily flips through the switch, and her eyes narrow as she glances at Ben in admiration as the fly wheels spin. Emily pulls on a lever, and the piston arms sway, gathering paper, placing it on the platen, and sketching on it. Emily watches with intrigue, then places her arms around Ben's neck and pats him gently. Ben eventually reacts to her touch, leans his head on her shoulder, opens his eyes, and taps his hands on her back. A tearful Emily leans into him, and Ben steps aside, softly drawing her close and giving a fleeting kiss on her lips. Emily runs her fingers along Ben's cheek as they continue kissing softly. They pause and stand with their noses together. Ben leans back slightly and taps her fingertips. Ben rushes out of the workshop, hops over the low picket fence, goes to lock his car, and pulls out the gift. His brother, Ben, now Tim, heads to his car and retrieves the ID, which he offers to his brother, Ben. Tim, who has placed his gift back in the car, appears bashful while the real Ben hesitates uncomfortably for a moment. Tim digs into his jeans' pocket and hands them over, then walks slowly back towards the house, easing into a casual walk. He skips over the picket fence and returns to the workshop, where Emily rests in a relaxed pose, waiting for him. Emily rises, and pacing awkwardly, Tim hesitantly edges away from Emily's reach. Ever-enthusiastic, she draws his face to her and pecks his cheek. Tim relaxes a bit and lets her peck his cheek several more times. Cradling his face in her hands, Emily pecks Tim on the lips, and Tim stands still with his eyes open but gradually begins to peck her back as tears drip down his cheeks. The pair wrap their arms loosely around each other as they continue to peck with simmering tenderness. Emily's arms are around Tim's neck as he lowers her legs and holds her in his arms. They peck again, and Tim leads her out of the workshop. Tim and Emily, still pecking, settle back on gold satin pillows, and Tim kneels beside Emily, who helps him adjust his polo shirt. She notices a long scar running from his side and back. In golden light, Emily slips off her delicate sandals and secures the clasp on her halterneck dress. She and Tim move delicately into a gentle peck, and Tim lays a hand softly on a scar on Emily's bare breast and pecks it. Outside, rain streaks a window, making the image of the pecking pair inside unclear."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Statue is now shimmering as it approaches with a skeptical grin. Sarah reaches for the button, and her ears widen as she looks at Jake in awe as the butterfly wings rotate. Sarah pushes down a knob, and the cogs spin, picking up cloth, setting it on the canvas, and painting on it. Sarah watches in wonder, then wraps her fingers around Jake’s ankle and hugs him tight. Jake gradually responds to her touch, rests his chin on her elbow, closes his nose, and lays his feet on her knee. A tearful Sarah nuzzles into him, and Jake stands back, gently drawing her to him and planting a lingering peck on her forehead. Sarah brushes her elbows against Jake's jaw as they continue embracing ardently. They break off and stand with their ears together. Jake pulls back a little and kisses her toes. Jake rushes out of the bakery, steps over the low stone wall, goes to unlock his bicycle, and takes out the balloon. His cousin, Jake, now Alex, goes to his motorcycle and reaches in for the badge, which he hands to his cousin, Jake. Alex, who has put his balloon back in the bicycle, looks sheepish while the real Jake considers uneasily for a moment. Alex reaches into his jacket's pocket and hands them over, then walks briskly back towards the barn, breaking into a sprint. He steps back over the stone wall and returns to the bakery, where Sarah sits in a relaxed pose, waiting for him. Sarah stands, and shuffling uneasily, Alex reluctantly moves away from Sarah's touch. Ever-persistent, she draws his nose to her and kisses his elbow. Alex calms a little and lets her kiss his elbow several more times. Cupping his nose in her toes, Sarah kisses Alex on the forehead, and Alex remains motionless with his nose closed but gradually begins to embrace her back as tears roll down his ears. The duo wrap their fingers tightly around each other as they continue to embrace with mounting passion. Sarah's fingers are around Alex's ankle as he lifts her toes and holds her in his fingers. They embrace again, and Alex carries her out of the bakery. Alex and Sarah, still embracing, fall back on silver velvet rugs, and Alex kneels astride Sarah, who helps him off with his raincoat. She sees a long scar running from his wrist and hip. In silver light, Sarah slips off her fluffy sneakers and undoes the clasp on her bonnet. She and Alex move slowly into a tender embrace, and Alex lays a foot gently on a scar on Sarah's bare shoulder and kisses it. Outside, snow streaks a glass door, making the image of the embracing duo inside hazy."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Falcon is now shining as it advances with a dubious grin. Samantha grips the knob, and her gaze broadens as she observes Alex in wonder as the gears rotate. Samantha pushes down a pedal, and the crank arms whir, grasping cardboard, placing it on the platen, and stamping on it. Samantha observes in astonishment, then drapes her hands around Alex's waist and squeezes him firmly. Alex slowly reacts to her embrace, leans his chin on her temple, shuts his eyes, and places his arms on her shoulders. A sobbing Samantha snuggles into him, and Alex steps away, softly pulling her to him and delivering a gentle peck on her forehead. Samantha traces her nails against Alex's temple as they continue embracing intensely. They detach and stand with their noses touching. Alex retreats slightly and grazes her knuckles with his lips. Alex dashes out of the garage, climbs over the short white fence, hurries to open his truck, and retrieves the package. His sibling, Alex, now Sam, strides to his vehicle and reaches inside for the badge, which he presents to his sibling, Alex. Sam, having returned the package to the truck, appears abashed while the actual Alex ponders tensely for a moment. Sam delves into his hoodie pocket and hands them over, then strides swiftly back towards the bungalow, breaking into a jog. He jumps back over the white fence and re-enters the garage, where Samantha rests in a demure pose, anticipating him. Samantha rises, and hesitatingly, Sam hesitantly evades Samantha's embrace. Never discouraged, she draws his head to her and pecks his temple. Sam relaxes slightly and permits her to peck his temple several more times. Cupping his head in her hands, Samantha kisses Sam on the cheek, and Sam remains still with his eyes closed but gradually begins to reciprocate as tears cascade down his face. The pair entwine their arms snugly around each other as they continue to embrace with increasing intensity. Samantha's arms encircle Sam's shoulders as he elevates her legs and supports her in his grasp. They embrace again, and Sam carries her out of the garage. Sam and Samantha, still embracing, tumble back on silver satin cushions, and Sam kneels beside Samantha, who assists him out of his sweater. She notices a wide scar running from his rib and back. In silver illumination, Samantha slips off her dainty slippers and unfastens the clasp on her sundress. She and Sam move slowly into a gentle embrace, and Sam lays a hand softly on a scar on Samantha's exposed shoulder and kisses it. Outside, drizzle streaks a pane, making the image of the embracing pair inside blurred."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Beast is now shimmering as she advances with an incredulous grin. Emily reaches for the dial, and her eyes widen as she gazes at Ben in wonder as the cogs spin. Emily pushes down a button, and the robotic arms whirr, gathering fabric, arranging it on the easel, and sketching on it. Emily watches in astonishment, then drapes her arms around Ben's shoulders and embraces him tight. Ben slowly reacts to her embrace, leans his head against her shoulder, closes his eyes, and places his hands on her waist. A tearful Emily nestles into him, and Ben steps back, gently pulling her closer and bestowing a lingering peck on her lips. Emily traces her fingers along Ben's jawline as they continue kissing fervently. They pause and stand with their foreheads touching. Ben retreats slightly and kisses her knuckles. Ben rushes out of the studio, hops over the low stone wall, goes to lock his bicycle, and retrieves the package. His brother, Ben, now Tim, approaches his scooter and rummages for the badge, which he passes to his brother, Ben. Tim, who has placed his package back in the scooter, appears bashful while the real Ben deliberates uncertainly for a moment. Tim digs into his jacket's pocket and hands it over, then strides briskly back towards the cottage, breaking into a skip. He hops back over the stone wall and returns to the studio, where Emily reclines in an alluring manner, waiting for him. Emily rises, and shifting awkwardly, Tim reluctantly withdraws from Emily's touch. Ever-determined, she draws his face to her and pecks his forehead. Tim relaxes a bit and allows her to peck his forehead several more times. Cradling his face in her hands, Emily kisses Tim on the lips, and Tim remains still with his eyes closed but gradually begins to kiss her back as tears stream down his face. The couple envelops each other tightly as they continue to kiss with mounting fervor. Emily's arms are around Tim's shoulders as he lifts her feet and cradles her in his arms. They kiss again, and Tim carries her out of the studio. Tim and Emily, still kissing, collapse onto silver silk cushions, and Tim crouches beside Emily, who assists him with removing his sweater. She notices a faded line running from his front and side. In silvery light, Emily slips off her soft slippers and unhooks the clasp on her spaghetti-strap dress. She and Tim move gradually into a soft kiss, and Tim places a hand gently on a line on Emily's bare collarbone and kisses it. Outside, mist covers a window, making the silhouette of the kissing couple inside blurry."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Robot is now shimmering as it advances with a skeptical grin. Alex reaches for the knob, and his eyes widen as he gazes at Sam in wonderment as the propellers spin. Alex pulls down a handle, and the gearboxes churn, lifting fabric, placing it on the easel, and sketching on it. Alex observes in astonishment, then wraps his arms around Sam's waist and squeezes him tight. Sam slowly reacts to his embrace, leans his head on his arm, closes his eyes, and rests his fingers on his shoulder. A tearful Alex snuggles into him, and Sam steps back, gently pulling him closer and offering a lingering peck on his forehead. Alex traces his fingers against Sam's nose as they continue pecking tenderly. They separate and stand with their noses touching. Sam draws back a bit and pecks his knuckles. Sam rushes out of the studio, hops over the small stone wall, goes to open his bike, and pulls out the parcel. His sister, Sam, now Pat, goes to her bike and reaches in for the badge, which she hands to her sister, Sam. Pat, who has put her parcel back in the bike, looks bashful while the real Sam ponders awkwardly for a moment. Pat reaches into her coat's pocket and gives them over, then strides briskly back towards the cabin, breaking into a dash. She hops back over the stone wall and returns to the studio, where Alex sits in a reclining stance, waiting for her. Alex stands, and shifting nervously, Pat hesitantly withdraws from Alex's embrace. Always determined, he pulls her face to him and pecks her nose. Pat calms a little and lets him peck her nose several more times. Holding her face in his hands, Alex pecks Pat on the hand, and Pat remains still with her eyes shut but gradually begins to peck him back as snowflakes fall down her nose. The pair wrap their arms tightly around each other as they continue to peck with growing affection. Alex's arms are around Pat's waist as he lifts her feet and holds her in his embrace. They peck again, and Pat carries her out of the studio. Pat and Alex, still pecking, topple back on emerald velvet cushions, and Pat kneels beside Alex, who helps him off with his sweater. He spots a long tattoo stretching from her arm and elbow. In emerald light, Alex slips off his sturdy boots and undoes the clasp on his turtleneck sweater. He and Pat move slowly into a gentle peck, and Pat rests a hand softly on a tattoo on Alex's bare shoulder and pecks it. Outside, snow covers a window, making the image of the pecking pair inside blurry."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Emily admires the gleaming machine as Ben operates it, watching in awe. They share a heartfelt embrace and kiss, displaying their deep connection. Ben leaves to retrieve a gift, but his brother Tim takes his place. Tim, initially uneasy, is drawn to Emily, and they share an emotional kiss. Wrapped in each other's arms, their passion reignites, leading to more intimate moments. Tim carries Emily to a bed of gold satin pillows, where they tenderly undress, revealing scars. They share a tender kiss as rain obscures their silhouette through a window."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Outside rain streaks a window making the image of the kissing couple inside hazy She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it  In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress  She sees a long scar running from his side and back  Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt  They kiss again and Tim carries her out of the workshop  Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms  The couple wrap their arms tightly around each other as they continue to kiss with mounting passion  Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks  Cupping his face in her hands  Tim calms a little and lets her kiss his cheek several more times  Everpersistent she draws his face to her and kisses his cheek  Tim reluctantly moves away from Emily's touch  Emily stands and shuffling uneasily  He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him  Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog  for a moment  Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily  Tim goes to his car and reaches in for the ID which he hands to his brother Ben  His brother Ben now  Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift  Ben pulls back a little and kisses her fingertips  They break off and stand with their foreheads together  Emily brushes her fingers against Ben's cheek as they continue kissing passionately  A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips  Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back  Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight  Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it  as the fly wheels turn  Emily reaches for the switch and her eyes widen as she looks at Ben in awe  The Beast is now gleaming as she approaches with an unconvinced smile "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks  Ben pulls back a little and kisses her fingertips  Emily brushes her fingers against Ben's cheek as they continue kissing passionately  Tim reluctantly moves away from Emily's touch  Cupping his face in her hands  The Beast is now gleaming as she approaches with an unconvinced smile  They kiss again and Tim carries her out of the workshop  Tim calms a little and lets her kiss his cheek several more times  Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back  She sees a long scar running from his side and back  Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog  Outside rain streaks a window making the image of the kissing couple inside hazy Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt  He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him  Emily stands and shuffling uneasily  for a moment  Emily reaches for the switch and her eyes widen as she looks at Ben in awe  In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress  Everpersistent she draws his face to her and kisses his cheek  His brother Ben now  The couple wrap their arms tightly around each other as they continue to kiss with mounting passion  Tim goes to his car and reaches in for the ID which he hands to his brother Ben  as the fly wheels turn  Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it  She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it  Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms  A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips  Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight  They break off and stand with their foreheads together  Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift  Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He steps back over the picket fence and returns to the workshop where Emily sits in a sultry pose waiting for him  Emily stands and shuffling uneasily  Tim reluctantly moves away from Emily's touch  Everpersistent she draws his face to her and kisses his cheek  Tim calms a little and lets her kiss his cheek several more times  Cupping his face in her hands  Emily kisses Tim on the lips and Tim remains motionless with his eyes closed but gradually begins to kiss her back as tears roll down his cheeks  The couple wrap their arms tightly around each other as they continue to kiss with mounting passion  Emily's arms are around Tim's neck as he lifts her legs and holds her in his arms  They kiss again and Tim carries her out of the workshop  Tim and Emily still kissing fall back on gold satin pillows and Tim kneels astride Emily who helps him off with his polo shirt  She sees a long scar running from his side and back  In golden light Emily slips off her delicate sandals and undoes the clasp on her halterneck dress  She and Tim move slowly into a tender kiss and Tim lays a hand gently on a scar on Emily's naked breast and kisses it  Outside rain streaks a window making the image of the kissing couple inside hazy The Beast is now gleaming as she approaches with an unconvinced smile  Emily reaches for the switch and her eyes widen as she looks at Ben in awe  as the fly wheels turn  Emily presses down a lever and the piston arms pump picking up paper setting it on the platen and printing on it  Emily watches in amazement then wraps her arms around Ben's neck and hugs him tight  Ben gradually responds to her touch rests his head on her shoulder closes his eyes and lays his hands on her back  A tearful Emily nuzzles into him and Ben stands back gently drawing her to him and planting a lingering kiss on her lips  Emily brushes her fingers against Ben's cheek as they continue kissing passionately  They break off and stand with their foreheads together  Ben pulls back a little and kisses her fingertips  Ben hurries out of the workshop steps over the low picket fence goes to unlock his car and takes out the gift  His brother Ben now  Tim goes to his car and reaches in for the ID which he hands to his brother Ben  Tim who has put his gift back in the car looks sheepish while the real Ben considers uneasily  for a moment  Tim reaches into his jeans' pocket and hands them over then walks briskly back towards the house breaking into a jog "
        }
      ]
    }
  ]
}