{
  "ground_truth": "Grainy footage shows matches from the time, featuring rough tackles, as it is revealed that England failed to qualify for the World Cup, making the position of England's manager the most coveted job in the country, with only one obvious choice. In an empty Leeds United stadium, rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly, middle-aged Don Revie, flanked by members of the Leeds board, makes his way from the boardroom to a press conference with a nonchalant wave, as gaunt, grey-haired Manny Cussins, director of the board, sits uneasily before the press, bringing his hand to his mouth. On a gloomy day, a Ford Zodiac travels a moorland road, with two boys in the back staring through rain-soaked windows as the handsome driver, Brian Clough, sings along to the radio, driving past the Leeds United stadium. In the Yorkshire television studios, Brian smirks a wry, lopsided smile. Watching at home, a livid Don storms to the phone and dials. Back at the Elland Road stadium, a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign, and a gaggle of reporters flocks around as craggy-faced Jimmy Gordon opens the driver's door, letting Brian and his sons out. Brian waves to his boys and up at the footballers on the training field, who scowl down at him through a chain-link fence, before turning back to the press. Brian struts into the boardroom, shakes Cussins' hand, and sits at the end of the long board table, his broad grin setting hard as the board glare at him, but he still beams his toothy grin. Six years earlier, at the draw, Brian picks up the phone outside Derby County's rundown stadium, the baseball ground, where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entrance and marches in through the tatty door, dashing down corridors past smoking cleaners. On the pitch, the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses. Brian stands beside tubby Peter Taylor, watching the team play, and volleys a goal. In his trademark red track suit, Brian sweeps the dingy corridors by the Derby dressing rooms, under flickering strip lights, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Grainy footage displays contests from the era, showcasing coarse tackles, as it is uncovered that England failed to qualify for the World Cup, making the role of England's manager the most desired occupation in the nation, with only one evident selection. In an unoccupied Leeds United stadium, rain drenches the muddy field while photographers' flashes illuminate the boardroom panes. Burly, middle-aged Don Revie, flanked by members of the Leeds board, makes his way from the boardroom to a press gathering with a nonchalant wave, as gaunt, grey-haired Manny Cussins, director of the board, sits uneasily before the press, bringing his hand to his mouth. On a gloomy day, a Ford Zodiac travels a moorland route, with two boys in the back staring through rain-soaked panes as the handsome driver, Brian Clough, sings along to the radio, driving past the Leeds United stadium. In the Yorkshire television studios, Brian smirks a wry, lopsided grin. Watching at home, a livid Don storms to the phone and dials. Back at the Elland Road stadium, a group of boys scamper after Brian's Zodiac while it swings into the parking area below the Leeds United AFC sign, and a gaggle of reporters flocks around as craggy-faced Jimmy Gordon opens the driver's door, letting Brian and his sons out. Brian waves to his boys and up at the footballers on the training ground, who scowl down at him through a chain-link barrier, before turning back to the press. Brian struts into the boardroom, shakes Cussins' hand, and sits at the end of the long board table, his broad grin setting hard as the board glare at him, but he still beams his toothy grin. Six years prior, at the draw, Brian picks up the phone outside Derby County's rundown stadium, the baseball ground, where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entry and marches in through the tatty door, dashing down corridors past smoking cleaners. On the field, the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses. Brian stands beside tubby Peter Taylor, watching the team play, and volleys a goal. In his trademark red track suit, Brian sweeps the dingy corridors by the Derby dressing rooms, under flickering strip lights, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Grainy footage is shown by matches from the time, featuring rough tackles, as it reveals that England did not qualify for the World Cup, making the position of England's manager the most coveted job in the country, with only one obvious choice. In an empty Leeds United stadium, the muddy pitch is soaked by rain while the boardroom windows are lit up by photographers' flashes. Burly, middle-aged Don Revie, flanked by members of the Leeds board, is seen making his way from the boardroom to a press conference with a nonchalant wave, as gaunt, grey-haired Manny Cussins, director of the board, uneasily sits before the press, bringing his hand to his mouth. On a gloomy day, a Ford Zodiac is traveled by Brian Clough on a moorland road, with two boys in the back staring through rain-soaked windows as he sings along to the radio, driving past the Leeds United stadium. In the Yorkshire television studios, Brian smirks a wry, lopsided smile. Watching at home, Don, livid, storms to the phone and dials it. Back at the Elland Road stadium, Brian's Zodiac is scampered after by a group of boys while it is swung into the car park below the Leeds United AFC sign, and a gaggle of reporters flocks around Jimmy Gordon, who opens the driver's door, letting Brian and his sons out. Brian waves to his boys and up at the footballers on the training field, who scowl down at him through a chain-link fence, before the press is turned back to by him. The boardroom is strutted into by Brian, Cussins' hand is shaken by him, and he sits at the end of the long board table, his broad grin being set hard by the board that glare at him, but a toothy grin is still beamed by him. Six years earlier, at the draw, the phone is picked up by Brian outside Derby County's rundown stadium, the baseball ground, where the letters missing from the club's sign are eyed by elderly groundskeepers. The visitor's entrance is pointed at by Brian, and the tatty door is marched in through by him, dashing down corridors past smoking cleaners. On the pitch, the white lines are marked by the groundsman as grubby kids gaze over the training ground from streets of terraced houses. Beside tubby Peter Taylor, the team is watched by Brian while a goal is volleyed by him. In his trademark red track suit, the dingy corridors by the Derby dressing rooms are swept by Brian, under flickering strip lights, as the brass plaque on the visitors' door is polished by him, and stepping back to admire the now-untarnished sign. In the shower room, the chest-high plunge bath is stood in by Brian, scrubbing the white tiles with a coarse brush before an orange is laid by him on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as his hair is smoothed by him in his office mirror."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Grainy footage shows matches with rough tackles, revealing England's failure to qualify for the World Cup, making the England manager's job the most coveted, with one clear choice. In an empty Leeds United stadium, rain soaks the muddy pitch as photographers' flashes illuminate the boardroom. Burly, middle-aged Don Revie, flanked by Leeds board members, waves nonchalantly en route to a press conference, while gaunt, grey-haired director Manny Cussins sits uneasily before the press. On a gloomy day, a Ford Zodiac travels a moorland road, with two boys in the back watching through rain-soaked windows as the handsome driver, Brian Clough, sings along to the radio, passing the Leeds United stadium. In Yorkshire television studios, Brian smirks a wry smile. At home, a livid Don storms to the phone. At Elland Road stadium, boys chase Brian's Zodiac as it swings into the car park, and reporters gather as craggy-faced Jimmy Gordon opens the driver's door, letting Brian and his sons out. Brian waves to his boys and the footballers on the training field, who scowl at him through a chain-link fence, before turning to the press. Brian struts into the boardroom, shakes Cussins' hand, and sits at the board table's end, his broad grin hardening as the board glares, yet he maintains his toothy smile. Six years earlier, Brian picks up the phone outside Derby County's rundown stadium, where elderly groundskeepers eye missing letters from the club's sign. Brian points at the visitor's entrance, marches through the tatty door, and dashes past smoking cleaners. On the pitch, the groundsman marks white lines as kids gaze over the training ground. Brian stands beside tubby Peter Taylor, watching the team play, and volleys a goal. In his red tracksuit, Brian sweeps Derby's dingy corridors, polishing the brass plaque on the visitors' door. In the shower room, he scrubs tiles with a coarse brush, lays an orange on each towel, places a glass ashtray beside them, and strolls out. Brian gravely eyes himself, smoothing his hair in his office mirror."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Grainy footage shows rough tackles as England fails to qualify for the World Cup, making the manager's job the most coveted, with one clear choice. In an empty Leeds United stadium, rain soaks the pitch while photographers' flashes light the boardroom. Burly Don Revie, with Leeds board members, heads to a press conference, waving nonchalantly, as gaunt Manny Cussins sits uneasily, hand to mouth. On a gloomy day, a Ford Zodiac travels a moorland road; two boys stare through rain-soaked windows as driver Brian Clough sings past the Leeds stadium. In Yorkshire TV studios, Brian smirks. At home, a livid Don dials the phone. At Elland Road, boys chase Brian's Zodiac into the car park, reporters gather as Jimmy Gordon opens the door, letting Brian and his sons out. Brian waves to his boys and the scowling footballers, then turns to the press. He enters the boardroom, shakes Cussins' hand, and sits, grinning as the board glares. Six years earlier, Brian picks up the phone outside Derby County's rundown stadium. He points at the visitor's entrance, dashes past cleaners, and watches the team with Peter Taylor, scoring a goal. In his red tracksuit, Brian polishes the brass plaque and admires the sign. In the shower room, he scrubs tiles, places oranges and ashtrays on towels, and strolls out. Brian gravely smooths his hair in his office mirror."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The grainy, somewhat unclear footage captures matches from that era, prominently featuring rough and aggressive tackles. It is revealed during this time that England, unfortunately, did not succeed in qualifying for the World Cup. This failure has made the position of England's manager the most sought-after and desirable job in the entire country, with only one candidate standing out as the obvious choice. In the empty and silent Leeds United stadium, rain pours down, soaking the already muddy pitch, while the flashes from photographers' cameras illuminate the windows of the boardroom. The burly and middle-aged Don Revie, accompanied by members of the Leeds board, makes his way from the boardroom to a press conference, offering a nonchalant wave. Meanwhile, the gaunt and grey-haired Manny Cussins, who is the director of the board, sits uneasily before the press, bringing his hand to his mouth in a gesture of unease. On a gloomy and overcast day, a Ford Zodiac travels along a moorland road, with two young boys in the backseat staring out through the rain-soaked windows. The handsome driver, Brian Clough, sings along to the radio as he drives past the Leeds United stadium. In the Yorkshire television studios, Brian smirks with a wry, lopsided smile. Watching from home, a livid Don storms to the phone and dials a number. Back at the Elland Road stadium, a group of boys eagerly scamper after Brian's Zodiac as it swings into the car park below the Leeds United AFC sign. A gaggle of reporters flocks around as the craggy-faced Jimmy Gordon opens the driver's door, allowing Brian and his sons to step out. Brian waves to his boys and up at the footballers on the training field, who scowl down at him through a chain-link fence, before turning back to face the press. Brian struts confidently into the boardroom, shakes Cussins' hand, and takes a seat at the end of the long board table. His broad grin sets hard as the board members glare at him, but he continues to beam his toothy grin. Six years earlier, at the draw, Brian picks up the phone outside Derby County's rundown stadium, known as the baseball ground, where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entrance and marches in through the tatty door, dashing down corridors past smoking cleaners. On the pitch, the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses. Brian stands beside the tubby Peter Taylor, watching the team play, and volleys a goal. In his trademark red tracksuit, Brian sweeps the dingy corridors by the Derby dressing rooms, under flickering strip lights, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches. He then places a heavy, glass ashtray beside each of the towels and strolls out. Brian gravely eyes himself as he smooths his hair in his office mirror, contemplating his reflection."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The grainy, somewhat unclear and indistinct footage from that particular era captures the essence of matches, prominently featuring rough, aggressive, and intense tackles. It gradually becomes apparent during this period that England, unfortunately, did not succeed in qualifying for the World Cup. This unfortunate failure has rendered the position of England's manager the most sought-after, coveted, and desirable job in the entire country, with only one candidate standing out as the obvious choice for the role. Within the empty and silent Leeds United stadium, rain pours down relentlessly, soaking the already muddy pitch, while the bright flashes from photographers' cameras illuminate the windows of the boardroom. The burly and middle-aged Don Revie, accompanied by members of the distinguished Leeds board, makes his way from the boardroom towards a press conference, offering a casual, nonchalant wave. Meanwhile, the gaunt and grey-haired Manny Cussins, who serves as the director of the board, sits uneasily before the press, anxiously bringing his hand to his mouth in a gesture of unmistakable unease. On a gloomy and overcast day, a Ford Zodiac travels along a moorland road, with two young boys seated in the back, staring out through the rain-soaked windows. The handsome driver, Brian Clough, sings along joyfully to the radio as he drives past the Leeds United stadium. In the Yorkshire television studios, Brian smirks with a wry, lopsided smile on his face. Watching from home, a livid and enraged Don storms to the phone and hurriedly dials a number. Back at the Elland Road stadium, a group of boys eagerly scamper after Brian's Zodiac as it swings gracefully into the car park below the Leeds United AFC sign. A gaggle of reporters flocks around as the craggy-faced Jimmy Gordon opens the driver's door, allowing Brian and his sons to step out. Brian waves to his boys and up at the footballers on the training field, who scowl down at him through the chain-link fence, before turning back to face the press. Brian struts confidently into the boardroom, shakes Cussins' hand firmly, and takes a seat at the end of the long board table. His broad grin sets hard as the stern board members glare at him, but he continues to beam his toothy grin. Six years earlier, at the draw, Brian picks up the phone outside Derby County's rundown stadium, known as the baseball ground, where elderly groundskeepers eye the letters missing from the club's sign. Brian points assertively at the visitor's entrance and marches purposefully in through the tatty door, dashing swiftly down corridors past smoking cleaners. On the pitch, the groundsman diligently marks white lines as grubby kids gaze with curiosity over the training ground from streets of terraced houses. Brian stands beside the tubby Peter Taylor, watching intently as the team plays, and effortlessly volleys a goal. In his trademark red tracksuit, Brian energetically sweeps the dingy corridors by the Derby dressing rooms, under the flickering strip lights, polishing the brass plaque on the visitor's door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before carefully laying an orange on each of the neatly folded towels on the benches. He then places a heavy, glass ashtray beside each of the towels and strolls out confidently. Brian gravely eyes himself as he smooths his hair thoughtfully in his office mirror, contemplating his own reflection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The grainy footage begins by capturing matches from the era, highlighting the rough tackles that characterized the games, as the narrative unfolds to reveal that England's failure to qualify for the World Cup has made the position of England's manager the most sought-after job in the country, with only one candidate standing out as the obvious choice. In the empty Leeds United stadium, the rain relentlessly pours down, soaking the muddy pitch, while the photographers' flashes intermittently illuminate the boardroom windows. Burly and middle-aged Don Revie, accompanied by members of the Leeds board, makes his way from the boardroom to a press conference, offering a nonchalant wave to those around him. Meanwhile, gaunt and grey-haired Manny Cussins, the director of the board, sits uneasily before the press, bringing his hand to his mouth in a gesture of discomfort. On a gloomy day, a Ford Zodiac travels along a moorland road, with two boys in the backseat gazing through the rain-soaked windows, as the handsome driver, Brian Clough, sings along to the radio, driving past the Leeds United stadium. In the Yorkshire television studios, Brian smirks with a wry, lopsided smile, a reaction that prompts a livid Don to storm to the phone and dial from his home. Back at the Elland Road stadium, a group of boys eagerly chase after Brian's Zodiac as it swings into the car park beneath the Leeds United AFC sign, where a gaggle of reporters quickly gathers around. Craggy-faced Jimmy Gordon opens the driver's door, allowing Brian and his sons to step out. Brian waves to his boys and then up at the footballers on the training field, who scowl down at him through a chain-link fence, before he turns back to face the press. With a confident stride, Brian enters the boardroom, shakes hands with Cussins, and takes a seat at the end of the long board table, his broad grin hardening as the board members glare at him, yet he continues to beam his toothy grin. Flashing back six years earlier, at the draw, Brian picks up the phone outside Derby County's rundown stadium, known as the baseball ground, where elderly groundskeepers cast wary glances at the letters missing from the club's sign. Brian points towards the visitor's entrance and marches through the tatty door, dashing down corridors past cleaners who are smoking. On the pitch, the groundsman diligently marks white lines as grubby kids watch the training ground from the nearby streets of terraced houses. Brian stands beside the tubby Peter Taylor, observing the team play, and skillfully volleys a goal. Clad in his trademark red tracksuit, Brian sweeps through the dingy corridors by the Derby dressing rooms, under flickering strip lights, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, vigorously scrubbing the white tiles with a coarse brush before carefully laying an orange on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Finally, Brian gravely eyes himself in the mirror of his office, smoothing his hair with a sense of determination."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Grainy footage shows matches from the time, highlighting rough tackles, as England's failure to qualify for the World Cup makes the position of England's manager highly coveted, with one clear candidate. In an empty Leeds United stadium, rain-soaked and muddy, photographers' flashes illuminate the boardroom windows. Don Revie, a burly, middle-aged man, exits the boardroom with a nonchalant wave, accompanied by Leeds board members, while Manny Cussins, the gaunt, grey-haired director, sits uneasily before the press, nervously bringing his hand to his mouth. On a gloomy day, a Ford Zodiac travels a moorland road, with two boys in the back watching the rain-soaked scenery as Brian Clough, the handsome driver, sings along to the radio, passing the Leeds United stadium. In the Yorkshire television studios, Brian smirks a wry, lopsided smile. At home, a livid Don Revie storms to the phone and dials. Back at Elland Road stadium, boys chase after Brian's Zodiac as it swings into the car park beneath the Leeds United AFC sign, where reporters gather as Jimmy Gordon opens the driver's door, allowing Brian and his sons to exit. Brian waves to his boys and the footballers on the training field, who scowl at him through a chain-link fence, before turning to the press. He strides into the boardroom, shakes Cussins' hand, and takes a seat at the end of the long table, maintaining his broad grin despite the board's glare. Six years earlier, at Derby County's rundown stadium, Brian picks up the phone, pointing at the visitor's entrance before marching through the tatty door, dashing past smoking cleaners. On the pitch, the groundsman marks white lines as kids watch from nearby streets. Brian stands with Peter Taylor, watching the team play, and volleys a goal. In his red tracksuit, Brian sweeps the dingy corridors by the Derby dressing rooms, polishing the brass plaque on the visitors' door. In the shower room, he scrubs the tiles, places an orange and a glass ashtray beside each neatly folded towel, and strolls out. Finally, Brian gravely smooths his hair in his office mirror."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Grainy footage shows matches from the time when football was notably more aggressive, featuring rough tackles, as it is revealed that England failed to qualify for the World Cup, a tournament first held in 1930 that captivates global audiences, making the position of England's manager the most coveted job in the country, with only one obvious choice. In an empty Leeds United stadium, home to a club founded in 1919, rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly, middle-aged Don Revie, who had famously led Leeds United to numerous victories in the 1960s and 1970s, flanked by members of the Leeds board, makes his way from the boardroom to a press conference with a nonchalant wave, as gaunt, grey-haired Manny Cussins, director of the board and a prominent figure in the club's management, sits uneasily before the press, bringing his hand to his mouth. On a gloomy day, a Ford Zodiac, a classic British car from the 1960s known for its robust design, travels a moorland road, with two boys in the back staring through rain-soaked windows as the handsome driver, Brian Clough, a charismatic and outspoken manager renowned for his unique style, sings along to the radio, driving past the Leeds United stadium. In the Yorkshire television studios, which broadcast to one of the largest regions in England, Brian smirks a wry, lopsided smile. Watching at home, a livid Don storms to the phone and dials. Back at the Elland Road stadium, a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign, and a gaggle of reporters flocks around as craggy-faced Jimmy Gordon, Brian's trusted assistant coach, opens the driver's door, letting Brian and his sons out. Brian waves to his boys and up at the footballers on the training field, who scowl down at him through a chain-link fence, acknowledging the team's formidable reputation, before turning back to the press. Brian struts into the boardroom, shakes Cussins' hand, and sits at the end of the long board table, his broad grin setting hard as the board glare at him, but he still beams his toothy grin. Six years earlier, at the draw of the English football season, Brian picks up the phone outside Derby County's rundown stadium, the baseball ground, reflecting the club's working-class roots, where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entrance and marches in through the tatty door, dashing down corridors past smoking cleaners, a common sight in the era before strict smoking bans. On the pitch, the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses, typical of industrial England's close-knit communities. Brian stands beside tubby Peter Taylor, his long-time collaborator, watching the team play, and volleys a goal. In his trademark red track suit, Brian sweeps the dingy corridors by the Derby dressing rooms, under flickering strip lights reminiscent of the era's utilitarian design, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Brian stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before laying an orange, a symbol of sustenance in sports, on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror, a ritual that reveals his fastidious attention to personal appearance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows  Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave  as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth  On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows  as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium  In the Yorkshire television studios Brian smirks a wry lopsided smile  Watching at home a livid Don storms to the phone and dials  Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out  Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press  Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice  In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows  Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave  as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth  On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows  as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium  In the Yorkshire television studios Brian smirks a wry lopsided smile  Watching at home a livid Don storms to the phone and dials  Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out  Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press  Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin  Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign  Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners  On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses  Brian stands beside tubby Peter Taylor watching the team play and volleys a goal  In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign  In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out  Brian gravely eyes himself as he smooths his hair in his office mirror"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice. In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave. as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth. On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows. as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium. In the Yorkshire television studios Brian smirks a wry lopsided smile. Watching at home a livid Don storms to the phone and dials. Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press. Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin. Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners. On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses. Brian stands beside tubby Peter Taylor watching the team play and volleys a goal. In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign. In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice. In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave. as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth. On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows. as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium. In the Yorkshire television studios Brian smirks a wry lopsided smile. Watching at home a livid Don storms to the phone and dials. Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press. Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin. Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign. Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners. On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses. Brian stands beside tubby Peter Taylor watching the team play and volleys a goal. In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign. In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice. In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave. as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth. On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows. Brian stands beside tubby Peter Taylor watching the team play and volleys a goal. In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign. In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice. In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out. Brian gravely eyes himself as he smooths his hair in his office mirror."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Grainy footage shows matches from the time, featuring rough tackles, as it is revealed that France failed to qualify for the World Cup, making the position of France's manager the most coveted job in the country, with only one obvious choice. In an empty Manchester United stadium, rain soaks the muddy pitch while photographers' flashes light up the boardroom windows. Burly, middle-aged Peter Jackson, flanked by members of the Manchester board, makes his way from the boardroom to a press conference with a nonchalant wave, as gaunt, grey-haired Jasper Harrington, director of the board, sits uneasily before the press, bringing his hand to his mouth. On a gloomy day, a Ford Zodiac travels a moorland road, with two cats in the back staring through rain-soaked windows as the handsome driver, Tony Blair, sings along to the radio, driving past the Manchester United stadium. In the Yorkshire television studios, Tony smirks a wry, lopsided smile. Watching at home, a livid Peter storms to the phone and dials. Back at the Old Trafford stadium, a group of cats scamper after Tony's Zodiac while it swings into the car park below the Manchester United AFC sign, and a gaggle of reporters flocks around as craggy-faced Tommy Smith opens the driver's door, letting Tony and his cats out. Tony waves to his cats and up at the footballers on the training field, who scowl down at him through a chain-link fence, before turning back to the press. Tony struts into the boardroom, shakes Harrington's hand, and sits at the end of the long board table, his broad grin setting hard as the board glare at him, but he still beams his toothy grin. Six years earlier, at the draw, Tony picks up the phone outside Liverpool's rundown stadium, the baseball ground, where elderly groundskeepers eye the letters missing from the club's sign. Tony points at the visitor's entrance and marches in through the tatty door, dashing down corridors past smoking teachers. On the pitch, the groundsman marks white lines as grubby dogs gaze over the training ground from streets of terraced houses. Tony stands beside slim Tom Ferguson, watching the team play, and volleys a goal. In his trademark blue track suit, Tony sweeps the dingy corridors by the Liverpool dressing rooms, under flickering strip lights, polishing the brass plaque on the visitors' door and stepping back to admire the now-untarnished sign. In the shower room, Tony stands in the chest-high plunge bath, scrubbing the white tiles with a coarse brush before laying an apple on each of the neatly folded towels on the benches, then placing a heavy, glass ashtray beside each of the towels and strolling out. Tony gravely eyes himself as he smooths his hair in his office mirror."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Grainy footage shows board games from the time, featuring playful tackles, as it is revealed that England failed to qualify for the Olympic Games, making the position of England's manager the most coveted job in the country, with only one obvious choice. In an empty Leeds United gymnasium, hail pelts the sandy court while photographers' flashes light up the conference room windows. Burly, middle-aged Don Revie, flanked by members of the Leeds committee, makes his way from the conference room to a debate stage with a nonchalant wave, as gaunt, grey-haired Manny Cussins, director of the committee, sits uneasily before the reporters, bringing his hand to his mouth. On a gloomy day, a Ford Capri travels a forest road, with two boys in the back staring through snow-dusted windows as the handsome driver, Brian Clough, sings along to the stereo, driving past the Leeds United gymnasium. In the Yorkshire broadcast studios, Brian smirks a wry, lopsided smile. Watching at home, a livid Don storms to the phone and dials. Back at the Elland Road gymnasium, a group of boys scamper after Brian's Capri while it swings into the parking garage below the Leeds United AFC banner, and a gaggle of photographers flocks around as craggy-faced Jimmy Gordon opens the driver's door, letting Brian and his sons out. Brian waves to his boys and up at the athletes on the practice field, who scowl down at him through a wrought iron fence, before turning back to the reporters. Brian struts into the conference room, shakes Cussins' hand, and sits at the end of the long conference table, his broad grin setting hard as the committee glare at him, but he still beams his toothy grin. Six years earlier, at the raffle, Brian picks up the phone outside Derby County's dilapidated arena, the diamond field, where elderly janitors eye the letters missing from the club's banner. Brian points at the visitor's gate and marches in through the rickety door, dashing down corridors past smoking caretakers. On the court, the groundskeeper marks white circles as grubby kids gaze over the practice area from streets of terraced dollhouses. Brian stands beside tubby Peter Taylor, watching the team play, and kicks a basket. In his trademark blue overalls, Brian sweeps the dim corridors by the Derby locker rooms, under flickering bulbs, polishing the bronze plaque on the visitors' gate and stepping back to admire the now-untarnished banner. In the locker room, Brian stands in the chest-high plunge tub, scrubbing the white bricks with a coarse sponge before laying an apple on each of the neatly folded washcloths on the benches, then placing a heavy, ceramic vase beside each of the washcloths and strolling out. Brian gravely eyes himself as he smooths his hair in his office window."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Grainy footage displays matches from the era, showcasing rough tricks, as it is announced that England managed to qualify for the World Cup, making the position of England's manager the least desired job in the country, with multiple obscure choices. In a crowded Leeds United stadium, sunshine dries the pristine pitch while photographers' flashes illuminate the stadium scoreboard. Burly, middle-aged Don Revie, joined by members of the Leeds board, wanders from the boardroom to a press conference with an indifferent shrug, as gaunt, grey-haired Manny Cussins, director of the board, stands confidently before the press, tapping his hand on his knee. On a bright day, a Ford Zodiac speeds down a moorland road, with two boys in the back peering through sunlit windows as the handsome driver, Brian Clough, hums along to the radio, cruising past the Leeds United stadium. In the Yorkshire television studios, Brian chuckles a hearty, even smile. Watching at home, a pleased Don calmly walks to the phone and texts. Back at the Elland Road stadium, a group of boys amble after Brian's Zodiac while it glides into the car park below the Leeds United AFC sign, and a swarm of reporters gathers around as craggy-faced Jimmy Gordon closes the driver's door, welcoming Brian and his sons. Brian salutes to his boys and up at the footballers on the training field, who grin down at him through a chain-link fence, before turning back to the press. Brian saunters into the boardroom, pats Cussins' shoulder, and reclines at the end of the long board table, his broad grin softening as the board nod at him, and he still flashes his toothy grin. Six years earlier, at the draw, Brian drops the phone outside Derby County's well-maintained stadium, the baseball ground, where elderly groundskeepers glance at the letters perfectly arranged on the club's sign. Brian gestures at the visitor's entrance and slips in through the shiny door, strolling down corridors past singing cleaners. On the pitch, the groundsman traces blue lines as tidy kids peek over the training ground from streets of detached houses. Brian stands beside lean Peter Taylor, observing the team rest, and dodges a ball. In his trademark red track suit, Brian strolls the well-lit corridors by the Derby dressing rooms, under steady strip lights, cleaning the brass plaque on the visitors' door and stepping forward to admire the now-glossy sign. In the shower room, Brian stands in the chest-high plunge bath, polishing the white tiles with a fine brush before placing a lemon on each of the loosely folded towels on the benches, then arranging a light, plastic ashtray beside each of the towels and skipping out. Brian cheerfully eyes himself as he tousles his hair in his office mirror."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blurry video depicts lanterns from the era, showcasing gentle embraces, as it is unveiled that Australia failed to qualify for the Grand Prix, making the role of Australia's pilot the most desired gig in the city, with only one evident choice. In a vacant Chelsea Music Hall theater, wind drenches the dusty stage while tourists' cameras illuminate the dressing room curtains. Slim, elderly Terry Jones, flanked by officials of the Chelsea committee, strides from the dressing room to a ticket booth with a nonchalant salute, as burly, brown-haired Jesse Markham, manager of the committee, sits awkwardly before the audience, bringing his hat to his face. On a sunny afternoon, a Mini Cooper traverses a woodland path, with three cats in the back staring through dust-speckled screens as the cheerful conductor, Jerry Moss, sings along to the playlist, driving past the Chelsea Music Hall theater. In the Bristol radio studios, Jerry chuckles a sly, crooked grin. Watching at home, a furious Terry leaps to the window and points. Back at the Piccadilly Circus theater, a herd of cats chase after Jerry's Cooper while it spins into the alley below the Chelsea AFC banner, and a choir of photographers crowds around as baby-faced Timmy Carter opens the passenger's door, letting Jerry and his kittens out. Jerry salutes to his cats and up at the pianists on the concert platform, who frown down at him through a wooden fence, before turning back to the crew. Jerry strides into the dressing room, shakes Markham's elbow, and sits at the end of the short dining table, his wide smile hardening as the committee glare at him, but he still flashes his gleaming grin. Seven years earlier, at the seminar, Jerry handles the trumpet outside Liverpool Stadium's decrepit amphitheater, the billiard hall, where young custodian dogs eye the numbers missing from the station's banner. Jerry gestures at the guest's archway and stomps in through the dusty portal, sprinting down passages past chatting ushers. On the track, the driver scrapes yellow markings as playful ponies peer over the concert arena from streets of modern apartments. Jerry stands beside lanky Roger Thomas, watching the band perform, and serves a melody. In his iconic blue overalls, Jerry sweeps the dark hallways by the Liverpool rehearsal studios, under buzzing overheads, polishing the silver plaque on the visitor's portal and stepping forward to admire the now-unblemished label. In the locker area, Jerry stands in the waist-deep wading pool, scrubbing the blue ceramics with a soft sponge before placing a peach on each of the crumpled shirts on the racks, then setting a small, wooden candlestick beside each of the shirts and waltzing out. Jerry solemnly observes himself as he trims his beard in his den mirror."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Blurry footage depicts concerts from the era, featuring wild dances, as it is disclosed that Spain neglected to compete for the World Series, making the role of Spain's conductor the most coveted gig in the region, with only one apparent candidate. In a deserted Manchester City arena, wind batters the grass-covered field while reporters' flashes illuminate the executive suites. Frail, elderly Bill Shankly, surrounded by associates of the City committee, strolls from the meeting room to an interview session with a casual nod, as wiry, red-bearded Larry Page, chairman of the committee, sits awkwardly before the media, bringing his pen to his chin. On a misty afternoon, a Volkswagen Beetle cruises a forested lane, with two girls in the front peering through foggy windows as the debonair passenger, Alex Ferguson, hums along to the music, passing by the Manchester City arena. In the Lancashire broadcast studio, Alex chuckles a sly, crooked grin. Observing in his flat, an exasperated Bill storms to the keyboard and types. Back at the Old Trafford arena, a band of girls chase Alex's Beetle while it rolls into the garage beneath the City of Manchester FC emblem, and a swarm of paparazzi clusters around as grizzled-faced Bob Paisley opens the passenger’s door, releasing Alex and his daughters. Alex gestures to his daughters and up at the dancers on the practice court, who glower down at him through a wire mesh, before turning back to the media. Alex strides into the meeting room, nods to Page, and perches at the end of the long conference table, his expansive chew settling strong as the committee glowers at him, but he still radiates his wide smile. Four years prior, at the draw, Alex snatches the phone outside Liverpool FC's decrepit stadium, the baseball ground, where jovial custodians note the letters absent from the club's sign. Alex gestures at the entrances' archway and strides in through the worn-out door, sprinting through hallways past laughing janitors. On the field, the caretaker marks yellow lines as pristine children watch over the playing area from rows of brick homes. Alex stands beside lanky Kenny Dalglish, observing the squad train, and kicks a corner. In his signature blue track jacket, Alex scrubs the dimly lit hallways by the Liverpool locker rooms, under flickering bulbs, shining the brass plate on the entrances’ door and stepping back to admire the now-brightened plaque. In the spa room, Alex sits in the waist-deep hot tub, wiping the green tiles with a soft sponge before arranging an apple on each of the carefully stacked towels on the racks, then placing a light, plastic coaster beside each of the towels and marching out. Alex solemnly regards himself as he adjusts his jacket in his office reflection."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Blurry footage shows balloons from the era, featuring gentle embraces, as it is revealed that England stumbled into the World Series, making the position of England's manager the most despised job in the city, with only one puzzling option. In an empty Leeds United theater, sunlight brightens the grassy lawn while reporters' lanterns illuminate the curtain windows. Slender, middle-aged Don Revie, flanked by members of the Leeds crew, strolls from the boardroom to a bake-off with a cheerful wave, as gaunt, grey-haired Manny Cussins, director of the crew, leans comfortably before the press, touching his hand to his ear. On a bright day, a Ford Zodiac floats a river road, with two boys in the back peering through dust-covered windows as the charismatic driver, Brian Clough, whispers along to the broadcast, sailing past the Leeds United amphitheater. In the Yorkshire television studios, Brian grins a wistful, uneven smile. Watching at home, a jubilant Don leaps to the phone and taps. Back at the Elland Road theater, a group of boys stroll behind Brian's Zodiac while it glides into the garden beneath the Leeds United AFC banner, and a swarm of dancers flits around as craggy-faced Jimmy Gordon opens the passenger door, letting Brian and his sons emerge. Brian waves to his boys and skyward at the jugglers on the training ground, who smile down at him through a wooden gate, before turning back to the commentators. Brian waltzes into the crewroom, taps Cussins' shoulder, and perches at the end of the long meeting bench, his wide grin relaxing softly as the crew cheer at him, but he still flashes his toothy grin. Six months earlier, at the gathering, Brian grabs the horn outside Derby County's dilapidated arena, the tennis court, where youthful referees admire the numbers missing from the team's banner. Brian gestures at the staff entrance and wanders in through the grand gate, sprinting down hallways past laughing organizers. On the lawn, the gardener draws blue circles as tidy kids gawk over the playing field from meadows of treehouses. Brian stands beside wiry Peter Taylor, observing the band perform, and belts a guitar solo. In his trademark blue overcoat, Brian sweeps the bright hallways by the Derby dressing areas, under flashing spotlights, buffing the silver emblem on the staff gate and leaping back to admire the now-glowing banner. In the washroom, Brian stands in the waist-high hot tub, rinsing the yellow curtains with a delicate sponge before laying an apple on each of the loosely folded sheets on the sofas, then placing a light, wooden box beside each of the sheets and gliding out. Brian cheerfully gazes at himself as he brushes his tie in his office window."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Blurry animation captures cupcakes from the era, showcasing gentle dances, as it is unveiled that Atlantis succeeded in qualifying for the Chess Olympiad, making the throne of Atlantis' captain the least desired stool in the city, with only one obscure option. In a crowded Paris Opera House, confetti covers the polished stage while artists' lanterns illuminate the broom closet skylight. Slim, youthful Sally Swift, surrounded by kids of the Paris choir, skips her path from the broom closet to a sandwich shop with a curious blink, as sprightly, golden-haired Clark Gable, custodian of the choir, leaps eagerly before the crowd, scratching his head with his foot. On a sunny morning, a Fiat Panda crawls a jungle path, with two parrots in the front squawking through sunlit canopies as the charming passenger, David Attenborough, whispers along to the breeze, floating past the Paris Opera House. In the Siberian puppet theaters, David laughs a sly, upside-down grin. Observing in the park, a joyful Sally prances to the kite and floats. Near the Buckingham Plaza garden, a herd of parrots dance before David's Panda while it flies into the sculpture garden above the Paris Orchestra BFC banner, and a herd of camels saunters around as smooth-faced Tommy Lee closes the passenger's hatch, leading David and his pigeons out. David salutes to his parrots and up at the conductors in the typing room, who smile up at him through a velvet curtain, before rolling back to the crowd. David tiptoes into the broom closet, taps Gable's shoulder, and jumps at the start of the narrow broom stick, his tiny frown softening as the choir smile at him, but he still beams his toothy grin. Nine months earlier, at the picnic, David grabs a kite inside Houston City's opulent igloo, the soccer rink, where youthful ice-skaters eye the numbers scratching from the team's banner. David puzzles at the staff's exit and floats in through the glossy portal, moping up hallways past napping gnomes. On the sand, the hatter scribes red sketches as clean puppies nap beside the sleeping meadow from valleys of peaked mountains. David skips beside sprightly Oscar Wilde, admiring the stars laugh, and hums a wish. In his iconic red ballroom dress, David prances the dusty hallways by the Houston changing areas, under sparkling disco balls, buffing the tin pin on the staff's exit and sneezing forward to cheer the now-glimmering banner. In the powder room, David dips in the ankle-deep sauna, splashing the blue tiles with a soft towel before placing a banana on each of the hastily tossed t-shirts on the sofas, then dropping a tiny, clay sundial beside each of the t-shirts and leaping off. David cheerfully gazes at himself as he ruffles his feathers in his garden stream."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Grainy footage reveals England's failure to qualify for the World Cup, making the England manager's job the most coveted. Don Revie, flanked by Leeds United board members, nonchalantly approaches a press conference amid rainy, tense scenes. Meanwhile, Brian Clough, a charismatic driver, passes the Leeds United stadium, singing along to the radio. At Yorkshire television studios, Brian smirks, angering Don, who hurriedly calls. At Elland Road stadium, Brian's car arrives, attracting a crowd. He waves to his sons and footballers who regard him warily. Brian enters the boardroom, shaking Cussins' hand, maintaining a broad grin despite cold stares from the board. Six years earlier, Brian marches through Derby County's stadium, overseeing operations and ensuring everything from visitors' doors to towels is meticulously managed. He partners with Peter Taylor, observes games, and takes pride in sprucing up the club facilities, including laying out oranges and ashtrays for players. In his office, he prepares meticulously, smoothing his hair in the mirror."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Brian gravely eyes himself as he smooths his hair in his office mirror In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out  In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign  Brian stands beside tubby Peter Taylor watching the team play and volleys a goal  On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses  Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners  Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign  Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin  Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press  Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out  Watching at home a livid Don storms to the phone and dials  In the Yorkshire television studios Brian smirks a wry lopsided smile  as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium  On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows  as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth  Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave  In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows  Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign  Brian stands beside tubby Peter Taylor watching the team play and volleys a goal  Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin  Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out  In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign  In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows  Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners  as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium  In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out  Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave  Brian gravely eyes himself as he smooths his hair in his office mirror On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows  Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press  Watching at home a livid Don storms to the phone and dials  as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth  On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses  In the Yorkshire television studios Brian smirks a wry lopsided smile  Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Brian waves to his boys and up at the footballers on the training field who scowl down at him through a chainlink fence before turning back to the press  Brian struts into the boardroom shakes Cussins' hand and sits at the end of the long board table his broad grin setting hard as the board glare at him but he still beams his toothy grin  Six years earlier at the draw Brian picks up the phone outside Derby County's rundown stadium the baseball ground where elderly groundskeepers eye the letters missing from the club's sign  Brian points at the visitor's entrance and marches in through the tatty door dashing down corridors past smoking cleaners  On the pitch the groundsman marks white lines as grubby kids gaze over the training ground from streets of terraced houses  Brian stands beside tubby Peter Taylor watching the team play and volleys a goal  In his trademark red track suit Brian sweeps the dingy corridors by the Derby dressing rooms under flickering strip lights polishing the brass plaque on the visitors' door and stepping back to admire the nowuntarnished sign  In the shower room Brian stands in the chesthigh plunge bath scrubbing the white tiles with a coarse brush before laying an orange on each of the neatly folded towels on the benches then placing a heavy glass ashtray beside each of the towels and strolling out  Brian gravely eyes himself as he smooths his hair in his office mirror Grainy footage shows matches from the time featuring rough tackles as it is revealed that England failed to qualify for the World Cup making the position of England's manager the most coveted job in the country with only one obvious choice  In an empty Leeds United stadium rain soaks the muddy pitch while photographers' flashes light up the boardroom windows  Burly middleaged Don Revie flanked by members of the Leeds board makes his way from the boardroom to a press conference with a nonchalant wave  as gaunt greyhaired Manny Cussins director of the board sits uneasily before the press bringing his hand to his mouth  On a gloomy day a Ford Zodiac travels a moorland road with two boys in the back staring through rainsoaked windows  as the handsome driver Brian Clough sings along to the radio driving past the Leeds United stadium  In the Yorkshire television studios Brian smirks a wry lopsided smile  Watching at home a livid Don storms to the phone and dials  Back at the Elland Road stadium a group of boys scamper after Brian's Zodiac while it swings into the car park below the Leeds United AFC sign and a gaggle of reporters flocks around as craggyfaced Jimmy Gordon opens the driver's door letting Brian and his sons out "
        }
      ]
    }
  ]
}