{
  "ground_truth": "She turns to Aberforth, and he nods. Hermione turns to face Harry, and they continue staring at the painting. Hermione screws up her eyes and peers closely, and they step back slightly. The girl resumes her position in the portrait, and the whole frame opens like a door, revealing the entrance to a tunnel. In the tunnel, Neville's face is bruised and battered. A painting with a gold frame reveals a long, dark passage with a pinprick of light in the distance. Neville turns to the others and opens the gold-framed painting. Neville steps aside, revealing Harry, who sees a hoard of students in a large room strung with hammocks. He steps down, and they take it in turn to hug him. Neville approaches a student, who runs to a radio. Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room, ignoring Ron. Everyone turns to Harry. At the grand staircase at Hogwarts, lines of students, closely watched by Death Eater Amycus Carrow, march across the courtyard and tramp down the staircase towards the great hall. Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape slowly turns to face the gathering. Students turn to each other as he stalks between them. The students who met Harry, including Cho, Ginny, and Seamus, stand looking at the floor. One student wearing a gown steps forward to stand in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus march in. Snape draws his wand, but Professor McGonagall pushes Harry aside and faces the headmaster. Those at the door also raise their wands. McGonagall fires a burst of energy, and Snape repels McGonagall's ferocious assault. The Carrows are hauled, hit by the deflected energy. Spinning, Snape twists his black cloak around himself and swirls up towards the high window. He flies off. Harry discards his gown as torches burn and students celebrate. Harry sits down suddenly, and McGonagall goes to him as the room darkens. Ashen-faced, Harry is wide-eyed and tense, and the students look up apprehensively. The sky is dark with ominous clouds, and McGonagall stares anxiously. Harry steps towards the screaming girl, then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. The students move away from Harry, but Ginny immediately moves protectively in front of him. Hermione steps up, as do more students. Filch, the caretaker, runs in, and Harry strides up to McGonagall. On his way out, Harry stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through them, handing Ron the Marauder's Map as he sets off again.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She rotates to Aberforth, and he acknowledges. Hermione rotates to confront Harry, and they persist in gazing at the depiction. Hermione scrunches up her eyes and peers intently, and they step backward slightly. The girl resumes her stance in the illustration, and the entire structure opens like a portal, revealing the entrance to a tunnel. In the tunnel, Neville's visage is bruised and battered. A depiction with a golden frame discloses a lengthy, dim corridor with a speck of illumination in the distance. Neville rotates to the others and opens the golden-bordered depiction. Neville steps aside, unveiling Harry, who perceives a multitude of pupils in a vast chamber festooned with hammocks. He descends, and they take it in succession to embrace him. Neville approaches a pupil, who dashes to a radio. Harry shifts uneasily and rotates to the anticipated visages as Ginny Weasley dashes into the chamber, disregarding Ron. Everyone rotates to Harry. At the grand staircase at Hogwarts, lines of pupils, closely monitored by Death Eater Amycus Carrow, march across the courtyard and stomp down the staircase towards the great hall. Faculty and pupils are gathered in the hall as Severus Snape strides between the rows and stands at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape gradually rotates to confront the assembly. Pupils rotate to each other as he stalks between them. The pupils who met Harry, including Cho, Ginny, and Seamus, stand looking at the floor. One pupil wearing a gown steps forward to stand in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus march in. Snape draws his wand, but Professor McGonagall pushes Harry aside and confronts the headmaster. Those at the entryway also raise their wands. McGonagall fires a burst of energy, and Snape repels McGonagall's ferocious attack. The Carrows are dragged, hit by the deflected energy. Spinning, Snape twists his black cloak around himself and swirls up towards the tall window. He flies off. Harry discards his gown as torches blaze and pupils celebrate. Harry sits down abruptly, and McGonagall goes to him as the room dims. Pallid-faced, Harry is wide-eyed and tense, and the pupils look up apprehensively. The sky is dark with threatening clouds, and McGonagall stares anxiously. Harry steps towards the shrieking girl, then a second girl shrieks as the gray gloom fades and the blazing torches in the great hall illuminate brilliantly again. The pupils move away from Harry, but Ginny instantly shifts protectively in front of him. Hermione advances, as do more pupils. Filch, the caretaker, dashes in, and Harry strides up to McGonagall. On his way out, Harry pauses and then guides the way out of the hall. Characters desert the illustrations and scuttle away as pupils rush down the stairs. Harry fights his way up through them, handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Aberforth is turned to by her, and a nod is given by him. Harry is turned to face by Hermione, and the painting is continuously stared at by them. Her eyes are screwed up by Hermione, and she peers closely, causing them to be stepped back slightly. The position in the portrait is resumed by the girl, and like a door, the whole frame is opened, revealing the entrance to a tunnel. In the tunnel, a bruised and battered face is possessed by Neville. A long, dark passage with a pinprick of light in the distance is revealed by a painting with a gold frame. The others are turned to by Neville, and the gold-framed painting is opened by him. Harry is revealed by Neville stepping aside, seeing a hoard of students in a large room strung with hammocks. He is stepped down by him, and it is taken by them in turn to hug Harry. A student is approached by Neville, who runs to a radio. The expectant faces are turned to by Harry uncomfortably as Ginny Weasley, ignoring Ron, rushes into the room. Harry is turned to by everyone. At the grand staircase at Hogwarts, the courtyard is marched across by lines of students, who are closely watched by Death Eater Amycus Carrow, and the staircase is tramped down towards the great hall. Staff and students assemble in the hall as Severus Snape strides between the rows and stands at the front. The gathering is faced by Snape, who slowly turns with Amycus Carrow and his sister, Alecto, on either side of him. Each other is turned to by the students as he stalks between them. The floor is looked at by the students who met Harry, including Cho, Ginny, and Seamus. A gown is worn by one student, who steps forward to stand in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus march in. His wand is drawn by Snape, but Professor McGonagall pushes Harry aside and faces the headmaster. Wands are also raised by those at the door. A burst of energy is fired by McGonagall, and McGonagall's ferocious assault is repelled by Snape. The Carrows are hauled, hit by the deflected energy. Snape spins, twisting his black cloak around himself and swirls up towards the high window. Off he flies. His gown is discarded by Harry as torches burn and students celebrate. Harry suddenly sits down, and McGonagall goes to him as the room darkens. Harry is wide-eyed and tense, appearing ashen-faced, and the students apprehensively look up. Dark, ominous clouds fill the sky, and McGonagall stares anxiously. A screaming girl is stepped towards by Harry, then another scream is let out by a second girl as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. Away from Harry, the students move, but in front of him, Ginny immediately moves protectively. Hermione steps up, as do more students. The caretaker, Filch, runs in, and up to McGonagall strides Harry. His way out is stopped by Harry, and then the way out of the hall is led by him. The portraits are abandoned by characters and scuttled away as the stairs are rushed down by students. His way up through them is fought by Harry, who hands Ron the Marauder's Map as he sets off again."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hermione turns to Aberforth, who nods, then faces Harry as they stare at the painting. Hermione peers closely, and they step back. The girl in the portrait resumes her position, and the frame opens like a door, revealing a tunnel entrance. Inside, Neville's face is bruised. A gold-framed painting shows a dark passage with distant light. Neville opens the painting, revealing Harry to a room full of students with hammocks. They hug him in turn. Neville approaches a student who runs to a radio. Harry shifts uncomfortably as Ginny Weasley rushes in, ignoring Ron. Everyone turns to Harry. At Hogwarts, students, watched by Death Eater Amycus Carrow, march to the great hall. Staff and students are assembled as Severus Snape stands at the front with Amycus and Alecto Carrow. Students, including Cho, Ginny, and Seamus, look down. A student steps forward to Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus enter. Snape draws his wand, but McGonagall pushes Harry aside and confronts Snape. Others raise their wands. McGonagall attacks, and Snape repels her, hitting the Carrows. Snape spins, cloaks himself, and flies out a window. Harry discards his gown as students celebrate. He sits, and McGonagall approaches as the room darkens. Harry is tense, and students look up. The sky is ominous, and McGonagall is anxious. Harry steps towards a screaming girl, then another screams as the gloom vanishes and torches burn brightly. Students move away, but Ginny stands protectively in front of Harry. Hermione and others join. Filch runs in, and Harry approaches McGonagall. Harry leads the way out of the hall. Characters abandon portraits as students rush down the stairs. Harry fights through them, handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Aberforth nods to her, and Hermione turns to Harry, both staring at the painting. Hermione peers closely, and they step back. The girl in the portrait resumes her position, and the frame opens like a door, revealing a tunnel entrance. Inside, Neville's bruised face appears. A gold-framed painting reveals a dark passage with distant light. Neville opens the painting, revealing Harry, who sees students in a room with hammocks. They hug him in turn. Neville approaches a student who runs to a radio. Harry shifts uncomfortably as Ginny Weasley rushes in, ignoring Ron. Everyone turns to Harry. At Hogwarts, students, watched by Death Eater Amycus Carrow, march to the great hall. Staff and students are assembled as Severus Snape stands at the front with Amycus and Alecto Carrow. Snape faces the gathering, and students, including Cho, Ginny, and Seamus, look down. A student steps forward to Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus enter. Snape draws his wand, but McGonagall pushes Harry aside and confronts Snape. Others raise their wands. McGonagall attacks, and Snape repels it, hitting the Carrows. Snape spins, cloaks himself, and flies out the window. Harry discards his gown as students celebrate. McGonagall approaches Harry as the room darkens. Ashen-faced, Harry is tense, and students look up. The sky is ominous, and McGonagall is anxious. Harry steps towards a screaming girl, then another screams as the gloom vanishes and torches burn brightly. Students move away, but Ginny stands protectively in front of Harry. Hermione and more students step up. Filch runs in, and Harry approaches McGonagall. Harry stops, then leads the way out. Characters abandon portraits as students rush down the stairs. Harry fights through them, handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She turns her attention to Aberforth, who gives her a confirming nod. Hermione then shifts her gaze to Harry, and together they continue to fix their eyes on the intriguing painting before them. Hermione squints her eyes tightly, peering intently and closely at the artwork, and they both take a small step back. The girl in the portrait resumes her original position, and suddenly, the entire frame swings open like a door, unveiling the entrance to a hidden tunnel. Within this tunnel, Neville's face appears, bruised and battered from previous encounters. The painting, adorned with a gold frame, reveals a long, dark passageway with a tiny pinprick of light visible in the far distance. Neville turns to the others, opening the gold-framed painting further. As Neville steps aside, Harry is revealed, and he sees a large room filled with a hoard of students, all surrounded by hammocks strung up around them. Harry steps down into the room, and the students take turns to embrace him warmly. Neville approaches one of the students, who quickly runs over to a radio. Harry shifts uncomfortably, turning to face the expectant faces of those around him, just as Ginny Weasley rushes into the room, completely ignoring Ron in her haste. Everyone's attention turns to Harry. \n\nMeanwhile, at the grand staircase of Hogwarts, lines of students, closely monitored by the watchful eyes of Death Eater Amycus Carrow, march across the courtyard and tramp down the staircase towards the great hall. Both staff and students are assembled in the hall as Severus Snape strides confidently between the rows and takes his place at the front. With Amycus Carrow and his sister, Alecto, positioned on either side of him, Snape slowly turns to face the gathered assembly. Students turn to one another as he stalks between them, his presence commanding attention. The students who had met Harry earlier, including Cho, Ginny, and Seamus, stand quietly, their eyes cast downwards to the floor. One student, wearing a gown, steps forward to stand directly in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus all march in with determination. Snape draws his wand, but Professor McGonagall quickly pushes Harry aside and bravely faces the headmaster. Those standing at the door also raise their wands in readiness. McGonagall unleashes a powerful burst of energy, and Snape skillfully repels McGonagall's ferocious assault. The Carrows are caught in the crossfire, hit by the deflected energy. Spinning rapidly, Snape twists his black cloak around himself and swirls up towards the high window, making his escape as he flies off. \n\nHarry discards his gown as the torches burn brightly and students begin to celebrate. Harry suddenly sits down, and McGonagall approaches him as the room darkens ominously. Ashen-faced, Harry is wide-eyed and tense, while the students look up apprehensively. The sky outside is darkened with ominous clouds, and McGonagall stares anxiously at the scene. Harry steps forward towards a screaming girl, and then a second girl screams as the gray gloom vanishes, and the flaming torches in the great hall burn brightly once again. The students move away from Harry, but Ginny immediately steps forward, protectively positioning herself in front of him. Hermione steps up as well, followed by more students. Filch, the caretaker, runs in, and Harry strides up to McGonagall. On his way out, Harry pauses momentarily and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through the crowd, handing Ron the Marauder's Map as he sets off once more."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She slowly shifts her attention towards Aberforth, who in turn gives her a confirming nod of assurance. After taking a moment, Hermione redirects her gaze towards Harry, and together, the two of them continue to focus their eyes intently on the intriguing painting that stands prominently before them. Hermione squints her eyes tightly, peering intently and scrutinizingly at the intricate artwork, and then they both subtly take a small step back. The girl portrayed within the elaborate portrait gracefully resumes her original position, and in an unexpected turn of events, the entire frame swings open like a hidden door, revealing the entrance to a mysterious tunnel concealed behind it. Within this tunnel, Neville's familiar face emerges, noticeably bruised and battered from his previous encounters, yet still resolute. The painting, which is adorned with an ornate gold frame, reveals a long, dark passageway, with a tiny pinprick of light faintly visible in the far distance. Neville motions to the others, opening the gold-framed painting even further. As Neville steps to the side, Harry comes into view, and he sees a large room filled to the brim with a hoard of students, all surrounded by hammocks strung up around them like a makeshift camp. Harry steps down into the room, and the students eagerly take turns to embrace him warmly and enthusiastically. Neville approaches one of the students, who promptly runs over to a radio. Harry shifts uncomfortably, turning to face the expectant faces surrounding him, just as Ginny Weasley bursts into the room, moving swiftly and completely ignoring Ron in her hurried entrance. Instantly, everyone's attention shifts and turns to focus on Harry.\n\nMeanwhile, within the grand and imposing staircase of Hogwarts, lines of students, who are being closely monitored under the watchful eyes of Death Eater Amycus Carrow, march in disciplined rows across the expansive courtyard and descend down the staircase towards the great hall. Both staff and students are already assembled there in the hall as Severus Snape strides confidently down the aisle between the rows, eventually taking his place at the front of the gathering. With Amycus Carrow and his sister, Alecto, dutifully positioned on either side of him, Snape slowly turns to face the gathered assembly with an air of authority. Students exchange glances with one another as he stalks between them, his presence demanding their undivided attention. The students who had met Harry earlier, including Cho, Ginny, and Seamus, stand quietly and solemnly, their eyes cast downwards to the floor in thoughtful silence. One student, dressed in a flowing gown, bravely steps forward to stand directly in front of Snape. At the same time, Ron, Hermione, the Weasleys, Shacklebolt, and Remus all march in with a sense of determination and purpose. Snape draws his wand, but Professor McGonagall quickly steps in, courageously pushing Harry aside and standing face to face with the headmaster. Those standing at the door also raise their wands, readying themselves for the confrontation. McGonagall unleashes a powerful burst of energy, and Snape skillfully repels her ferocious assault. The Carrows are caught in the crossfire, struck by the deflected energy. In a rapid motion, Snape spins, twisting his black cloak around himself and swirling up towards the high window, making his escape as he deftly flies away.\n\nHarry discards his gown as the torches around the room suddenly burn brightly, casting a warm glow, and students begin to celebrate the victory. Harry quickly sits down, and McGonagall approaches him just as the room darkens ominously. With an ashen face, Harry is wide-eyed and tense, while the other students look up apprehensively around the room. The sky outside is shrouded by dark clouds, and McGonagall stares anxiously at the foreboding scene. Harry steps forward as a girl nearby screams, and then a second girl cries out as the gray gloom suddenly vanishes, and the flaming torches in the great hall resume burning brightly once again. The students start to move away from Harry, but Ginny instantly steps forward, protectively positioning herself in front of him. Hermione joins her, stepping up as well, followed by more supportive students. Filch, the caretaker, rushes in, and Harry strides up to meet McGonagall. On his way out, Harry pauses momentarily at the doorway before leading the way out of the hall. Characters in the portraits abandon their frames and scuttle away as students rush down the stairs. Harry fights his way up through the crowd, handing Ron the Marauder's Map as he sets off once more on his determined path."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She turns her attention to Aberforth, who acknowledges her with a nod, prompting Hermione to pivot and face Harry. Together, they fix their gaze on the painting, with Hermione narrowing her eyes and leaning in for a closer inspection before they both take a small step back. As they do so, the girl in the portrait resumes her original stance, causing the entire frame to swing open like a door, unveiling the entrance to a tunnel. Within this tunnel, Neville's face appears, marked with bruises and signs of a struggle. The painting, encased in a gold frame, reveals a lengthy, shadowy passageway with a tiny speck of light visible in the far distance. Neville turns to the others, opening the gold-framed painting to reveal Harry, who is greeted by the sight of a large room filled with students and hammocks. He steps down into the room, where the students take turns embracing him warmly. Neville approaches another student, who quickly runs to a radio. Meanwhile, Harry shifts uneasily, turning to face the expectant crowd just as Ginny Weasley bursts into the room, bypassing Ron entirely. All eyes turn to Harry. At Hogwarts, lines of students, under the watchful eyes of Death Eater Amycus Carrow, march across the courtyard and descend the grand staircase towards the great hall. Inside, staff and students are gathered as Severus Snape strides purposefully between the rows, coming to a stop at the front. With Amycus Carrow and his sister, Alecto, flanking him, Snape slowly turns to address the assembly. As he moves among them, students exchange glances. Those who had met Harry, including Cho, Ginny, and Seamus, stand with their eyes cast downward. A student in a gown steps forward to confront Snape. At that moment, Ron, Hermione, the Weasleys, Shacklebolt, and Remus enter with determination. Snape draws his wand, but Professor McGonagall intervenes, pushing Harry aside to confront the headmaster herself. Those at the door raise their wands in solidarity. McGonagall unleashes a powerful burst of energy, which Snape deflects with equal force, causing the Carrows to be struck by the ricochet. In a swift motion, Snape spins, wrapping his black cloak around himself, and ascends towards the high window, making his escape. As he departs, Harry discards his gown, and the room erupts in celebration as torches blaze. Harry suddenly sits down, and McGonagall approaches him as the room dims. With an ashen face, Harry remains wide-eyed and tense, while the students look up with apprehension. The sky outside is dark and foreboding, and McGonagall gazes anxiously. Harry steps forward towards a screaming girl, and as another girl screams, the gray gloom dissipates, and the torches in the great hall flare brightly once more. The students retreat from Harry, but Ginny quickly steps in front of him protectively. Hermione joins her, followed by more students. Filch, the caretaker, rushes in, and Harry strides over to McGonagall. On his way out, Harry pauses momentarily before leading the way out of the hall. Characters abandon their portraits and scurry away as students hurry down the stairs. Harry pushes his way through the crowd, handing Ron the Marauder's Map as he sets off once again."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hermione and Harry, after exchanging nods with Aberforth, focus on a painting that opens to reveal a tunnel entrance. Inside, they find Neville, bruised but determined, who unveils a passage leading to a room filled with students. As Harry enters, he is warmly embraced by the students, and Ginny Weasley rushes in, ignoring Ron. Meanwhile, at Hogwarts, students are monitored by Death Eater Amycus Carrow as they march to the great hall, where Severus Snape stands with the Carrows. Snape confronts the assembly, but Professor McGonagall intervenes, challenging him with a powerful spell. Snape deflects the attack, inadvertently hitting the Carrows, and escapes through a window. As students celebrate Snape's departure, Harry, tense and wide-eyed, is comforted by McGonagall. The atmosphere darkens ominously, but the hall brightens again as students rally around Harry, led by Ginny and Hermione. Filch rushes in, and Harry, after a brief pause, leads the group out of the hall. As students descend the stairs, Harry pushes through, handing Ron the Marauder's Map before continuing on his mission."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She turns to Aberforth, the grizzled barman of the Hog's Head Inn known for his connections to the Order of the Phoenix, and he nods. Hermione turns to face Harry, the Boy Who Lived and a leader in the fight against the dark forces, and they continue staring at the painting. Hermione screws up her eyes and peers closely, known for her keen intellect and attention to detail, and they step back slightly. The girl, who is depicted in the portrait as Ariana Dumbledore, resumes her position in the portrait, and the whole frame opens like a door, revealing the entrance to a secret tunnel used during the resistance against Voldemort. In the tunnel, Neville's face is bruised and battered, evidence of the ongoing battle at Hogwarts. A painting with a gold frame reveals a long, dark passage with a pinprick of light in the distance, suggesting the hope that lies at the end of their struggle. Neville turns to the others and opens the gold-framed painting, which is enchanted to allow entry for allies. Neville steps aside, revealing Harry, who sees a hoard of students in a large room strung with hammocks, a makeshift refuge for those at Hogwarts standing against tyranny. He steps down, and they take it in turn to hug him, expressing relief and solidarity. Neville approaches a student, who runs to a radio broadcasting messages from the resistance. Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley, who is fiercely loyal and brave, rushes into the room, ignoring Ron. Everyone turns to Harry, looking to him for guidance. At the grand staircase at Hogwarts, lines of students, closely watched by Death Eater Amycus Carrow, a cruel enforcer of Voldemort's regime, march across the courtyard and tramp down the staircase towards the great hall. Staff and students are assembled in the hall as Severus Snape, who for years deceived others as a double agent, strides between the rows and stands at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape slowly turns to face the gathering. Students turn to each other as he stalks between them, filled with uncertainty and fear. The students who met Harry, including Cho, Ginny, and Seamus, stand looking at the floor, aware of the tense environment. One student wearing a gown steps forward to stand in front of Snape, defying the oppressive rule. Ron, Hermione, the Weasleys, Shacklebolt, a respected Auror, and Remus, a werewolf and member of the Order, march in. Snape draws his wand, but Professor McGonagall, a formidable witch and Deputy Headmistress, pushes Harry aside and faces the headmaster. Those at the door also raise their wands, ready to defend against any threat. McGonagall fires a burst of energy, and Snape repels McGonagall's ferocious assault with his skillful dueling techniques. The Carrows are hauled, hit by the deflected energy. Spinning, Snape twists his black cloak around himself and swirls up towards the high window, using magic to escape. He flies off into the night sky. Harry discards his gown as torches burn and students celebrate the beginning of their liberation. Harry sits down suddenly, overwhelmed by the events, and McGonagall goes to him as the room darkens, understanding the weight on his shoulders. Ashen-faced, Harry is wide-eyed and tense, knowing the final battle is approaching, and the students look up apprehensively. The sky is dark with ominous clouds, a reflection of the turmoil ahead, and McGonagall stares anxiously, aware of the challenges they face. Harry steps towards the screaming girl, offering comfort, then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again, signaling a temporary respite. The students move away from Harry, but Ginny immediately moves protectively in front of him, a testament to her courage and love. Hermione steps up, as do more students, showing their unity and readiness. Filch, the caretaker known for his dislike of students, runs in, and Harry strides up to McGonagall. On his way out, Harry stops and then leads the way out of the hall, determined to face the challenges head-on. Characters abandon the portraits and scuttle away as students rush down the stairs, eager to take action. Harry fights his way up through them, handing Ron the Marauder's Map, an invaluable magical document showing the real-time locations of everyone at Hogwarts, as he sets off again."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She turns to Aberforth and he nods  The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel  In the tunnel Neville's face is bruised and battered  A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance  Neville turns to the others and opens the goldframed painting  Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks  He steps down and they take it in turn to hug him  Neville approaches a student who runs to a radio  Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron  Everyone turns to Harry  At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall  Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front  With Amycus Carrow and his sister Alecto on either side of him  Snape slowly turns to face the gathering  Students turn to each other as he stalks between them  The students who met Harry including Cho Ginny and Seamus stand looking at the floor  One student wearing a gown steps forward to stand in front of Snape  Ron Hermione the Weasleys Shacklebolt and Remus march in  Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster  Those at the door also raise their wands  Hermione turns to face Harry and they continue staring at the painting  Hermione screws up her eyes and peers closely and they step back slightly  The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel  In the tunnel Neville's face is bruised and battered  A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance  Neville turns to the others and opens the goldframed painting  Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks  He steps down and they take it in turn to hug him  Neville approaches a student who runs to a radio  Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron  Everyone turns to Harry  At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall  Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front  With Amycus Carrow and his sister Alecto on either side of him  Snape slowly turns to face the gathering  Students turn to each other as he stalks between them  The students who met Harry including Cho Ginny and Seamus stand looking at the floor  One student wearing a gown steps forward to stand in front of Snape  Ron Hermione the Weasleys Shacklebolt and Remus march in  Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster  Those at the door also raise their wands  McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault  The Carrows are hauled hit by the deflected energy  Spinning Snape twists his black cloak around himself and swirls up towards the high window  He flies off  Harry discards his gown as torches burn and students celebrate  Harry sits down suddenly and McGonagall goes to him as the room darkens  Ashenfaced Harry is wideeyed and tense and the students look up apprehensively  The sky is dark with ominous clouds and McGonagall stares anxiously  Harry steps towards the screaming girl  then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again  The students move away from Harry but Ginny immediately moves protectively in front of him  Hermione steps up as do more students  Filch the caretaker runs in and Harry strides up to McGonagall  On his way out Harry stops and then leads the way out of the hall  Characters abandon the portraits and scuttle away as students rush down the stairs  Harry fights his way up through them handing Ron the Marauder's Map as he sets off again"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She turns to Aberforth and he nods. Hermione turns to face Harry and they continue staring at the painting. Hermione screws up her eyes and peers closely and they step back slightly. The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel. In the tunnel Neville's face is bruised and battered. A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance. Neville turns to the others and opens the goldframed painting. Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks. He steps down and they take it in turn to hug him. Neville approaches a student who runs to a radio. Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron. Everyone turns to Harry. At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall. Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front. With Amycus Carrow and his sister Alecto on either side of him. Snape slowly turns to face the gathering. Students turn to each other as he stalks between them. The students who met Harry including Cho Ginny and Seamus stand looking at the floor. One student wearing a gown steps forward to stand in front of Snape. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Ron Hermione the Weasleys Shacklebolt and Remus march in. Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster. Those at the door also raise their wands. McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault. The Carrows are hauled hit by the deflected energy. Spinning Snape twists his black cloak around himself and swirls up towards the high window. He flies off. Harry discards his gown as torches burn and students celebrate. Harry sits down suddenly and McGonagall goes to him as the room darkens. Ashenfaced Harry is wideeyed and tense and the students look up apprehensively. The sky is dark with ominous clouds and McGonagall stares anxiously. Harry steps towards the screaming girl. then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. The students move away from Harry but Ginny immediately moves protectively in front of him. Hermione steps up as do more students. Filch the caretaker runs in and Harry strides up to McGonagall. On his way out Harry stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through them handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She turns to Aberforth and he nods. Hermione turns to face Harry and they continue staring at the painting. Hermione screws up her eyes and peers closely and they step back slightly. The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel. In the tunnel Neville's face is bruised and battered. A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance. Neville turns to the others and opens the goldframed painting. Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks. He steps down and they take it in turn to hug him. Neville approaches a student who runs to a radio. Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron. Everyone turns to Harry. At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall. Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front. With Amycus Carrow and his sister Alecto on either side of him. Snape slowly turns to face the gathering. Students turn to each other as he stalks between them. The students who met Harry including Cho Ginny and Seamus stand looking at the floor. One student wearing a gown steps forward to stand in front of Snape. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Ron Hermione the Weasleys Shacklebolt and Remus march in. Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster. Those at the door also raise their wands. McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault. The Carrows are hauled hit by the deflected energy. Spinning Snape twists his black cloak around himself and swirls up towards the high window. He flies off. Harry discards his gown as torches burn and students celebrate. Harry sits down suddenly and McGonagall goes to him as the room darkens. Ashenfaced Harry is wideeyed and tense and the students look up apprehensively. The sky is dark with ominous clouds and McGonagall stares anxiously. Harry steps towards the screaming girl. then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. The students move away from Harry but Ginny immediately moves protectively in front of him. Hermione steps up as do more students. Filch the caretaker runs in and Harry strides up to McGonagall. On his way out Harry stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through them handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She turns to Aberforth and he nods. Hermione turns to face Harry and they continue staring at the painting. Hermione screws up her eyes and peers closely and they step back slightly. The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel. In the tunnel Neville's face is bruised and battered. A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance. Neville turns to the others and opens the goldframed painting. Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks. He steps down and they take it in turn to hug him. Neville approaches a student who runs to a radio. The sky is dark with ominous clouds and McGonagall stares anxiously. Harry steps towards the screaming girl. then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. The students move away from Harry but Ginny immediately moves protectively in front of him. Hermione steps up as do more students. Filch the caretaker runs in and Harry strides up to McGonagall. On his way out Harry stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through them handing Ron the Marauder's Map as he sets off again."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She turns to Aberforth and he nods. Hermione turns to face Harry and they continue staring at the painting. Hermione screws up her eyes and peers closely and they step back slightly. The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel. Filch the caretaker runs in and Harry strides up to McGonagall. On his way out Harry stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. Harry fights his way up through them handing Ron the Marauder's Map as he sets off again."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon turns to the baker, and it nods. The squirrel turns to face the dolphin, and they continue staring at the painting. The squirrel screws up its eyes and peers closely, and they step back slightly. The bird resumes its position in the portrait, and the whole frame opens like a door, revealing the entrance to a tunnel. In the tunnel, the lion's face is bruised and battered. A painting with a gold frame reveals a long, dark passage with a pinprick of light in the distance. The lion turns to the others and opens the gold-framed painting. The lion steps aside, revealing the dolphin, who sees a hoard of students in a large room strung with hammocks. It steps down, and they take it in turn to hug it. The lion approaches a student, who runs to a radio. The dolphin shifts uncomfortably and turns to the expectant faces as the rabbit rushes into the room, ignoring the elephant. Everyone turns to the dolphin. At the grand staircase at Hogwarts, lines of students, closely watched by Death Eater the fox, march across the courtyard and tramp down the staircase towards the great hall. Staff and students are assembled in the hall as the penguin strides between the rows and stands at the front. With the fox and its sister, the hawk, on either side of it, the penguin slowly turns to face the gathering. Students turn to each other as it stalks between them. The students who met the dolphin, including the owl, the rabbit, and the koala, stand looking at the floor. One student wearing a gown steps forward to stand in front of the penguin. The elephant, the squirrel, the giraffes, Shacklebolt, and Remus march in. The penguin draws its wand, but Professor the zebra pushes the dolphin aside and faces the headmaster. Those at the door also raise their wands. The zebra fires a burst of energy, and the penguin repels the zebra's ferocious assault. The hawks are hauled, hit by the deflected energy. Spinning, the penguin twists its black cloak around itself and swirls up towards the high window. It flies off. The dolphin discards its gown as torches burn and students celebrate. The dolphin sits down suddenly, and the zebra goes to it as the room darkens. Ashen-faced, the dolphin is wide-eyed and tense, and the students look up apprehensively. The sky is dark with ominous clouds, and the zebra stares anxiously. The dolphin steps towards the screaming bird, then a second bird screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again. The students move away from the dolphin, but the rabbit immediately moves protectively in front of it. The squirrel steps up, as do more students. The owl, the caretaker, runs in, and the dolphin strides up to the zebra. On its way out, the dolphin stops and then leads the way out of the hall. Characters abandon the portraits and scuttle away as students rush down the stairs. The dolphin fights its way up through them, handing the elephant the Marauder's Map as it sets off again."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She turns to Aberforth, and he nods. Hermione turns to face Harry, and they continue staring at the sculpture. Hermione screws up her eyes and peers closely, and they step back slightly. The girl resumes her position in the mural, and the whole surface opens like a gate, revealing the entrance to a cavern. In the cavern, Neville's face is bruised and battered. A mural with a silver frame reveals a long, dark corridor with a glimmer of light in the distance. Neville turns to the others and opens the silver-framed mural. Neville steps aside, revealing Harry, who sees a group of students in a large chamber strung with tapestries. He steps down, and they take it in turn to embrace him. Neville approaches a student, who runs to a cassette player. Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the chamber, ignoring Ron. Everyone turns to Harry. At the grand ladder at Hogwarts, lines of students, closely watched by Death Eater Amycus Carrow, march across the terrace and tramp down the ladder towards the great auditorium. Staff and students are assembled in the auditorium as Severus Snape strides between the rows and stands at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape slowly turns to face the gathering. Students turn to each other as he stalks between them. The students who met Harry, including Cho, Ginny, and Seamus, stand looking at the floor. One student wearing a robe steps forward to stand in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus march in. Snape draws his staff, but Professor McGonagall pushes Harry aside and faces the headmaster. Those at the entrance also raise their staffs. McGonagall fires a burst of energy, and Snape repels McGonagall's ferocious assault. The Carrows are hauled, hit by the deflected energy. Spinning, Snape twists his gray cape around himself and swirls up towards the high balcony. He flies off. Harry discards his robe as lanterns burn and students celebrate. Harry sits down suddenly, and McGonagall goes to him as the chamber darkens. Ashen-faced, Harry is wide-eyed and tense, and the students look up apprehensively. The sky is dark with ominous mist, and McGonagall stares anxiously. Harry steps towards the wailing girl, then a second girl screams as the gray fog vanishes and the blazing lanterns in the great auditorium burn brightly again. The students move away from Harry, but Ginny immediately moves protectively in front of him. Hermione steps up, as do more students. Filch, the caretaker, runs in, and Harry strides up to McGonagall. On his way out, Harry stops and then leads the way out of the auditorium. Characters abandon the murals and scuttle away as students rush down the ladders. Harry fights his way up through them, handing Ron the Marauder's Blueprint as he sets off again."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She whispers to Aberforth, and he winks. Hermione pivots to glance at Harry, and they keep gaping at the painting. Hermione squints her eyes and glances closely, and they edge back slightly. The girl reclines in her position in the portrait, and the whole frame slides like a curtain, unveiling the entrance to a tunnel. In the tunnel, Neville's face is scratched and swollen. A painting with a gold frame exposes a narrow, bright passage with a speck of light in the distance. Neville gestures to the others and slides the gold-framed painting. Neville moves aside, displaying Harry, who discovers a crowd of students in a large room lined with bunk beds. He jumps down, and they take turns to shake his hand. Neville beckons to a student, who darts to a radio. Harry fidgets awkwardly and glances at the eager faces as Ginny Weasley bursts into the room, overlooking Ron. Everyone looks at Harry. At the grand staircase at Hogwarts, lines of students, carefully observed by Death Eater Amycus Carrow, shuffle across the courtyard and skip down the staircase towards the great hall. Staff and students are gathered in the hall as Severus Snape paces between the rows and pauses at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape slowly pivots to observe the crowd. Students glance at each other as he ambles between them. The students who met Harry, including Cho, Ginny, and Seamus, stand staring at the floor. One student wearing a gown steps forward to pose in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus stride in. Snape displays his wand, but Professor McGonagall nudges Harry away and confronts the headmaster. Those at the door also display their wands. McGonagall launches a spark of energy, and Snape blocks McGonagall's intense attack. The Carrows are shoved, struck by the deflected energy. Twisting, Snape drapes his black cloak around himself and drifts up towards the high window. He glides off. Harry discards his gown as torches illuminate and students cheer. Harry flops down suddenly, and McGonagall approaches him as the room dims. Ashen-faced, Harry is wide-eyed and tense, and the students gaze up apprehensively. The sky is thick with ominous clouds, and McGonagall watches anxiously. Harry steps towards the wailing girl, then a second girl yells as the gray gloom dissolves and the flaming torches in the great hall blaze brilliantly again. The students drift away from Harry, but Ginny quickly stands protectively in front of him. Hermione steps forward, as do more students. Filch, the caretaker, dashes in, and Harry strides over to McGonagall. On his way out, Harry hesitates, then guides the way out of the hall. Characters flee the portraits and scurry away as students dash down the stairs. Harry maneuvers his way up through them, handing Ron the Marauder's Map as he rushes off again."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She turns to the ostrich, and it nods. The mailbox turns to face the calculator, and they continue staring at the hammock. The mailbox screws up its eyes and peers closely, and they step back slightly. The lamp resumes its position in the wallpaper, and the whole bookshelf opens like a door, revealing the entrance to a wardrobe. In the wardrobe, the tiger's face is bruised and battered. A wallpaper with a silver pillow reveals a long, dark meadow with a pinprick of light in the distance. The tiger turns to the umbrellas and opens the silver-pillow wallpaper. The tiger steps aside, revealing the calculator, who sees a hoard of bananas in a large maze strung with violins. It steps down, and they take it in turn to hug it. The tiger approaches a banana, who runs to a television. The calculator shifts uncomfortably and turns to the expectant ears as the wrench rushes into the maze, ignoring the wrench. Everyone turns to the calculator. At the grand ladder at Atlantis, lines of bananas, closely watched by the jackal Elephantus Sparrow, march across the aquarium and tramp down the ladder towards the enormous barn. Paintings and bananas are assembled in the barn as the pineapple strides between the rows and stands at the front. With Elephantus Sparrow and its sibling, Echo, on either side of it, the pineapple slowly turns to face the gathering. Bananas turn to each other as it stalks between them. The bananas who met the calculator, including Calendar, Wrench, and Ceiling, stand looking at the carpet. One banana wearing a hat steps forward to stand in front of the pineapple. The wrench, the mailbox, the giraffes, Sunglasses, and Helicopter march in. The pineapple draws its ruler, but Professor Microwave pushes the calculator aside and faces the ruler. Those at the gate also raise their rulers. Microwave fires a burst of wind, and the pineapple repels Microwave's ferocious breeze. The Sparrows are hauled, hit by the deflected wind. Spinning, the pineapple twists its brown cape around itself and swirls up towards the high mirror. It flies off. The calculator discards its hat as lamps burn and bananas celebrate. The calculator sits down suddenly, and Microwave goes to it as the maze darkens. Ashen-faced, the calculator is wide-eyed and tense, and the bananas look up apprehensively. The ceiling is dark with ominous alarms, and Microwave stares anxiously. The calculator steps towards the yelling lamp, then a second lamp yells as the white drizzle vanishes and the flickering lamps in the enormous barn burn brightly again. The bananas move away from the calculator, but Calendar immediately moves protectively in front of it. The mailbox steps up, as do more bananas. Pillow, the gardener, runs in, and the calculator strides up to Microwave. On its way out, the calculator stops and then leads the way out of the barn. Antennas abandon the wallpapers and scuttle away as bananas rush down the ladders. The calculator fights its way up through them, handing the wrench the Adventurer's Compass as it sets off again."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She pivots to Bartholomew, and he shrugs. Luna rotates to face Draco, and they continue examining the sculpture. Luna squints her eyes and inspects meticulously, and they shuffle forward slightly. The woman resumes her posture in the fresco, and the entire panel slides like a gate, revealing the entrance to a passage. In the passage, Cedric's visage is scarred and weary. A sculpture with a silver edge displays a long, dim corridor with a glimmer of light in the distance. Cedric glances at the group and shuts the silver-edged sculpture. Cedric moves aside, uncovering Draco, who notices a crowd of children in a vast chamber adorned with rugs. He climbs up, and they take turns to pat him. Cedric approaches a boy, who sprints to a phonograph. Draco shifts uneasily and glances at the expectant expressions as Luna Lovegood dashes into the chamber, bypassing Hagrid. Everyone eyes Draco. At the regal atrium at Durmstrang, rows of children, meticulously observed by Rogue Wizard Felix Green, parade across the plaza and plod up the atrium towards the enormous hall. Faculty and children are gathered in the chamber as Lucius Malfoy strides among the lines and stands at the forefront. With Felix Green and his brother, Victor, flanking him, Malfoy slowly swivels to face the congregation. Children glance at each other as he prowls amongst them. The children who met Draco, including Marietta, Luna, and Dean, stand gazing at the ceiling. One child sporting a robe steps forward to stand before Malfoy. Hagrid, Luna, the Potters, Moody, and Tonks trot in. Malfoy brandishes his staff, but Professor Sprout nudges Draco aside and confronts the principal. Those at the portal also lift their staffs. Sprout releases a wave of magic, and Malfoy deflects Sprout's intense attack. The Greens are dragged, struck by the rebounded magic. Whirling, Malfoy twirls his emerald cloak around himself and whisks up towards the tall window. He bounds away. Draco discards his robe as lanterns flicker and children rejoice. Draco reclines abruptly, and Sprout approaches him as the chamber dims. Pale-faced, Draco is alert and tense, and the children gaze upwards nervously. The atmosphere is thick with threatening fog, and Sprout gazes worriedly. Draco advances towards the wailing boy, then another boy wails as the murky mist dissipates and the blazing lanterns in the enormous hall illuminate brightly once more. The children retreat from Draco, but Luna promptly steps protectively in front of him. Luna advances, as do more children. Peeves, the phantom, dashes in, and Draco marches up to Sprout. As he exits, Draco halts and then guides the exit from the chamber. Phantoms desert the statues and bustle away as children hurry down the passage. Draco struggles his way up through them, passing Hermione the Invisibility Cloak as he departs again."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She glances at Aberforth, and he winks. Hermione turns to glance at Harry, and they continue gazing at the sculpture. Hermione furrows her brow and squints intensely, and they shuffle back a bit. The girl resumes her position in the tapestry, and the entire frame swings like a gate, disclosing the opening to a cavern. In the cavern, Neville's face is scraped and swollen. A sculpture with a silver frame exposes a long, bright corridor with a glimmer of shadow in the distance. Neville glances at the others and unveils the silver-framed sculpture. Neville shuffles aside, uncovering Harry, who notices a crowd of pupils in a massive space draped with lanterns. He descends, and they each take a moment to shake his hand. Neville approaches a pupil, who dashes to a television. Harry squirms uneasily and turns to the eager faces as Ginny Weasley bursts into the area, overlooking Ron. Everyone turns to Harry. At the magnificent staircase at Hogwarts, lines of pupils, closely observed by Death Eater Amycus Carrow, march around the courtyard and stomp up the staircase towards the great library. Staff and pupils are gathered in the library as Severus Snape glides between the rows and halts at the front. With Amycus Carrow and his sister, Alecto, on either side of him, Snape gradually turns to face the assembly. Pupils glance at each other as he strides between them. The pupils who met Harry, including Cho, Ginny, and Seamus, stand gazing at the ceiling. One pupil wearing a mask steps forward to stand in front of Snape. Ron, Hermione, the Weasleys, Shacklebolt, and Remus trot in. Snape draws his quill, but Professor McGonagall nudges Harry aside and confronts the headmaster. Those at the entrance also lift their quills. McGonagall unleashes a surge of water, and Snape deflects McGonagall's intense torrent. The Carrows are tossed, struck by the diverted water. Pirouetting, Snape wraps his crimson cape around himself and whirls up towards the high balcony. He glides away. Harry casts off his jacket as lanterns flicker and pupils rejoice. Harry plops down suddenly, and McGonagall approaches him as the space dims. Pale-faced, Harry is wide-eyed and nervous, and the pupils glance up anxiously. The sky is bright with foreboding stars, and McGonagall glances anxiously. Harry strides towards the laughing girl, then a second girl chuckles as the gray haze appears and the extinguished lanterns in the great library glow dimly again. The pupils drift away from Harry, but Ginny promptly moves protectively behind him. Hermione steps back, as do more pupils. Filch, the janitor, saunters in, and Harry strolls up to McGonagall. On his way in, Harry pauses and then follows the path into the library. Characters spill from the tapestries and scurry away as pupils rush up the stairs. Harry pushes his way down through them, handing Ron the Marauder's Scroll as he continues onward."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She swivels to Bartholomew, and he winks. Samantha spins to face Leonard, and they continue gazing at the photograph. Samantha squints her eyes and inspects closely, and they shuffle back slightly. The young boy resumes his stance in the sketch, and the entire frame swings open like a window, uncovering the entrance to a tunnel. Within the passageway, Oliver's nose is scratched and bruised. A drawing with a silver border unveils a lengthy, dim corridor with a flicker of light far away. Oliver swivels to the rest and unlocks the silver-bordered drawing. Oliver sidesteps, unveiling Leonard, who spots a crowd of teenagers in a gigantic chamber festooned with lanterns. He climbs down, and they take turns to clasp him. Oliver advances to a teenager, who dashes to a television. Leonard fidgets restlessly and turns to the expectant expressions as Ruby Jacobson dashes into the chamber, overlooking Jasper. Everyone rotates to Leonard. At the majestic escalator at Elderbridge, rows of teenagers, closely observed by Shadow Weaver Malcolm Thorn, saunter across the square and clomp down the escalator towards the grand atrium. Teachers and pupils are gathered in the atrium as Victor Sparks strides between the columns and pauses at the forefront. With Malcolm Thorn and his sibling, Mirabel, flanking him, Sparks gradually rotates to gaze at the assembly. Teenagers glance at each other as he prowls between them. The teenagers who encountered Leonard, including Jade, Ruby, and Duncan, stand gazing at the ground. One teenager clad in a cloak steps forward to stand before Sparks. Jasper, Samantha, the Jacobsons, Lanternlight, and Lupus parade in. Sparks draws his cane, but Professor Maplewood nudges Leonard aside and confronts the principal. Those at the portal also raise their canes. Maplewood unleashes a streak of power, and Sparks deflects Maplewood's fierce barrage. The Weavers are swept away, struck by the rebounded force. Twirling, Sparks wraps his white robe around himself and spirals up towards the towering window. He soars away. Leonard casts off his cloak as lamps blaze and teenagers rejoice. Leonard slumps suddenly, and Maplewood approaches him as the chamber dims. Pale-faced, Leonard is wide-eyed and jittery, and the teenagers glance up apprehensively. The heavens are ominous with threatening shadows, and Maplewood gazes worriedly. Leonard paces towards the shouting young man, then another boy yells as the gray murk disappears and the blazing lamps in the grand atrium blaze vividly once again. The teenagers drift away from Leonard, but Ruby promptly steps protectively before him. Samantha strides up, as do more teenagers. Finch, the custodian, bolts in, and Leonard marches up to Maplewood. On his way out, Leonard pauses and then heads the passage out of the atrium. Characters desert the drawings and scurry away as teenagers bolt down the steps. Leonard battles his way up through them, handing Jasper the Explorer’s Blueprint as he proceeds anew."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Aberforth nods to Hermione, who joins Harry in examining a painting that opens to reveal a tunnel entrance. Inside, Neville, bruised and battered, shows them a room filled with students in hammocks. They warmly greet Harry, with Ginny Weasley ignoring Ron's presence. At Hogwarts, students under Death Eater Amycus Carrow's watch gather in the great hall. Snape, flanked by the Carrows, is confronted by McGonagall, who duels him after he draws his wand. Snape escapes, leaving Harry to sit tensely as celebrations spark among students. As the sky darkens ominously, McGonagall casts a worried glance, and students back away from Harry, although Ginny and others stand by him. Filch enters, and Harry leads the way out of the hall, navigating through the crowd and entrusting Ron with the Marauder's Map."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry fights his way up through them handing Ron the Marauder's Map as he sets off again Characters abandon the portraits and scuttle away as students rush down the stairs  On his way out Harry stops and then leads the way out of the hall  Filch the caretaker runs in and Harry strides up to McGonagall  Hermione steps up as do more students  The students move away from Harry but Ginny immediately moves protectively in front of him  then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again  Harry steps towards the screaming girl  The sky is dark with ominous clouds and McGonagall stares anxiously  Ashenfaced Harry is wideeyed and tense and the students look up apprehensively  Harry sits down suddenly and McGonagall goes to him as the room darkens  Harry discards his gown as torches burn and students celebrate  He flies off  Spinning Snape twists his black cloak around himself and swirls up towards the high window  The Carrows are hauled hit by the deflected energy  McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault  Those at the door also raise their wands  Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster  Ron Hermione the Weasleys Shacklebolt and Remus march in  One student wearing a gown steps forward to stand in front of Snape  The students who met Harry including Cho Ginny and Seamus stand looking at the floor  Students turn to each other as he stalks between them  Snape slowly turns to face the gathering  With Amycus Carrow and his sister Alecto on either side of him  Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front  At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall  Everyone turns to Harry  Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron  Neville approaches a student who runs to a radio  He steps down and they take it in turn to hug him  Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks  Neville turns to the others and opens the goldframed painting  A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance  In the tunnel Neville's face is bruised and battered  The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel  Hermione screws up her eyes and peers closely and they step back slightly  Hermione turns to face Harry and they continue staring at the painting  She turns to Aberforth and he nods "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Spinning Snape twists his black cloak around himself and swirls up towards the high window  One student wearing a gown steps forward to stand in front of Snape  A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance  McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault  Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron  Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks  then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again  He flies off  In the tunnel Neville's face is bruised and battered  Hermione steps up as do more students  She turns to Aberforth and he nods  The Carrows are hauled hit by the deflected energy  Snape slowly turns to face the gathering  Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster  Students turn to each other as he stalks between them  Harry discards his gown as torches burn and students celebrate  Filch the caretaker runs in and Harry strides up to McGonagall  The students move away from Harry but Ginny immediately moves protectively in front of him  Harry steps towards the screaming girl  The sky is dark with ominous clouds and McGonagall stares anxiously  Ashenfaced Harry is wideeyed and tense and the students look up apprehensively  On his way out Harry stops and then leads the way out of the hall  With Amycus Carrow and his sister Alecto on either side of him  Hermione turns to face Harry and they continue staring at the painting  He steps down and they take it in turn to hug him  Ron Hermione the Weasleys Shacklebolt and Remus march in  Harry fights his way up through them handing Ron the Marauder's Map as he sets off again Everyone turns to Harry  The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel  At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall  Hermione screws up her eyes and peers closely and they step back slightly  Neville turns to the others and opens the goldframed painting  Characters abandon the portraits and scuttle away as students rush down the stairs  Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front  Neville approaches a student who runs to a radio  The students who met Harry including Cho Ginny and Seamus stand looking at the floor  Those at the door also raise their wands  Harry sits down suddenly and McGonagall goes to him as the room darkens "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ron Hermione the Weasleys Shacklebolt and Remus march in  Snape draws his wand but Professor McGonagall pushes Harry aside and faces the headmaster  Those at the door also raise their wands  McGonagall fires a burst of energy and Snape repels McGonagall's ferocious assault  The Carrows are hauled hit by the deflected energy  Spinning Snape twists his black cloak around himself and swirls up towards the high window  He flies off  Harry discards his gown as torches burn and students celebrate  Harry sits down suddenly and McGonagall goes to him as the room darkens  Ashenfaced Harry is wideeyed and tense and the students look up apprehensively  The sky is dark with ominous clouds and McGonagall stares anxiously  Harry steps towards the screaming girl  then a second girl screams as the gray gloom vanishes and the flaming torches in the great hall burn brightly again  The students move away from Harry but Ginny immediately moves protectively in front of him  Hermione steps up as do more students  Filch the caretaker runs in and Harry strides up to McGonagall  On his way out Harry stops and then leads the way out of the hall  Characters abandon the portraits and scuttle away as students rush down the stairs  Harry fights his way up through them handing Ron the Marauder's Map as he sets off again She turns to Aberforth and he nods  Hermione turns to face Harry and they continue staring at the painting  Hermione screws up her eyes and peers closely and they step back slightly  The girl resumes her position in the portrait and the whole frame opens like a door revealing the entrance to a tunnel  In the tunnel Neville's face is bruised and battered  A painting with a gold frame reveals a long dark passage with a pinprick of light in the distance  Neville turns to the others and opens the goldframed painting  Neville steps aside revealing Harry who sees a hoard of students in a large room strung with hammocks  He steps down and they take it in turn to hug him  Neville approaches a student who runs to a radio  Harry shifts uncomfortably and turns to the expectant faces as Ginny Weasley rushes into the room ignoring Ron  Everyone turns to Harry  At the grand staircase at Hogwarts lines of students closely watched by Death Eater Amycus Carrow march across the courtyard and tramp down the staircase towards the great hall  Staff and students are assembled in the hall as Severus Snape strides between the rows and stands at the front  With Amycus Carrow and his sister Alecto on either side of him  Snape slowly turns to face the gathering  Students turn to each other as he stalks between them  The students who met Harry including Cho Ginny and Seamus stand looking at the floor  One student wearing a gown steps forward to stand in front of Snape "
        }
      ]
    }
  ]
}