{
  "ground_truth": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. Mike's SUV drives down the empty streets. Mike drives with Klaatu in the passenger seat, while in the back, Helen and Jacob look anxiously at each other. Mike glances at Klaatu then accelerates. They hurtle towards the military roadblock, and soldiers dive out of the way. They are pursued by hummers with machine guns. Mike looks tense, and Helen looks nervously out of the back window, while Klaatu seems calm. The pursuers fall back as they turn into leafy, wooded Central Park and drive across the grass towards the sphere. An explosion lifts the car, rolling it over several times before it comes to rest against the tree. Fighters streak overhead as the sphere is engulfed in a great fireball. Regina watches the attack on a monitor and closes her eyes in relief. As the smoke clears, the sphere is completely intact. Meanwhile, the swarm reaches the edge of Manhattan. In the car, Mike is dead. Helen frantically undoes her seat belt, looks at Mike, and notices the windscreen is being eaten. Klaatu pulls himself out of the car, then lifts out Jacob. Helen emerges and looks up to see the swarm swirling around the sphere as more gray clouds of bugs arrive, darkening the skies. Klaatu looks around, then grabbing Jacob's hand, he leads them in a sprint across the grass. Just ahead of the hedge, they run into a tunnel and the swarm stays outside. Klaatu frowns, thinking hard. Jacob's nose is bleeding. As Helen crouches to examine him, he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at Klaatu pleadingly. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and concentrates. Bugs begin to run up Klaatu's wrist, coming out through Helen and Jacob's skin and burrowing bloodily into him. Jacob wakes up, Klaatu opens his eyes, and the pair look at each other while Helen stares wide-eyed. Klaatu stands up and walks towards the mouth of the tunnel. He looks back at Helen comforting Jacob, and she stares back at him. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud, hand raised, vainly trying to protect his face and head. Holes appear in his suit, and his hands and face are bloody. As he approaches the sphere, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the sphere. Light blazes as he is absorbed into it, and the sphere emits a beaming pulse of energy, causing the swarms, millions of bugs, to begin falling like rain to the ground.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A display indicates the mass spreading out across the Eastern coastline of the United States. New York City is entirely abandoned. The lights and advertisements of Times Square have no one to view them. Mike's SUV travels down the vacant roads. Mike drives with Klaatu in the passenger seat, while in the back, Helen and Jacob gaze anxiously at one another. Mike glances at Klaatu then speeds up. They race towards the military barrier, and soldiers dive out of the way. They are chased by hummers with machine guns. Mike looks tense, and Helen looks nervously out of the back window, while Klaatu seems tranquil. The pursuers fall back as they turn into leafy, wooded Central Park and drive across the grass towards the sphere. An explosion lifts the vehicle, rolling it over multiple times before it comes to rest against the tree. Fighters streak overhead as the sphere is engulfed in a great fireball. Regina observes the assault on a monitor and closes her eyes in relief. As the smoke clears, the sphere is completely unscathed. Meanwhile, the swarm reaches the boundary of Manhattan. In the car, Mike is dead. Helen frantically releases her seat belt, looks at Mike, and notices the windscreen is being eaten. Klaatu pulls himself out of the car, then lifts out Jacob. Helen emerges and looks up to see the swarm swirling around the sphere as more gray clouds of bugs arrive, darkening the skies. Klaatu looks around, then grabbing Jacob's hand, he leads them in a sprint across the grass. Just ahead of the hedge, they dash into a tunnel and the swarm remains outside. Klaatu frowns, thinking hard. Jacob's nose is bleeding. As Helen crouches to examine him, he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at Klaatu imploringly. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and focuses. Bugs begin to run up Klaatu's wrist, emerging through Helen and Jacob's skin and burrowing bloodily into him. Jacob awakens, Klaatu opens his eyes, and the pair gaze at each other while Helen stares wide-eyed. Klaatu stands up and walks towards the entrance of the tunnel. He looks back at Helen comforting Jacob, and she stares back at him. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud, hand raised, futilely trying to protect his face and head. Openings appear in his suit, and his hands and face are bloody. As he approaches the sphere, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the sphere. Light blazes as he is absorbed into it, and the sphere emits a radiant pulse of energy, causing the swarms, millions of bugs, to begin falling like rain to the ground."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A screen is shown displaying the mass spreading out across the Eastern seaboard of the United States. New York City has been completely deserted. No one is there to see the lights and advertisements of Times Square. The empty streets are driven down by Mike's SUV. Klaatu is driven by Mike, who is in the passenger seat, while in the back, Helen and Jacob are looked at anxiously by each other. Klaatu is glanced at by Mike then the acceleration is increased. The military roadblock is hurtled towards by them, and the way is dived out of by soldiers. Hummers with machine guns pursue them. A tense look is given by Mike, and out of the back window, Helen nervously looks, while calmness is shown by Klaatu. As they turn into leafy, wooded Central Park, the pursuers fall back and the drive across the grass towards the sphere is continued by them. An explosion lifts the car, rolls it over several times, before it rests against the tree. As fighters streak overhead, a great fireball engulfs the sphere. The attack is watched by Regina on a monitor, and her eyes are closed in relief. As the smoke clears, the sphere remains completely intact. Meanwhile, the edge of Manhattan is reached by the swarm. In the car, Mike has died. Her seat belt is frantically undone by Helen, Mike is looked at, and the windscreen being eaten is noticed by her. The car is exited by Klaatu, then Jacob is lifted out. Helen emerges, looks up, and sees the swarm swirling around the sphere while more gray clouds of bugs arrive, darkening the skies. A glance around is given by Klaatu, and Jacob's hand is grabbed, leading them in a sprint across the grass. Just ahead of the hedge, a tunnel is run into by them, and the swarm stays outside. Klaatu frowns, thinking hard. Blood runs from Jacob's nose. Helen crouches to examine him, he collapses in her arms. Her nose is wiped, and blood is found on her finger. A pleading look is given to Klaatu by her. Jacob’s hand is gently taken by Klaatu in Helen's, his eyes are closed, and concentration is shown. Up Klaatu's wrist, bugs begin to run, coming out through Helen and Jacob's skin and bloodily burrowing into him. Jacob wakes up, Klaatu's eyes are opened, and the pair look at each other while Helen's wide-eyed stare is directed at them. Klaatu stands up and the tunnel's mouth is walked towards. Helen comforting Jacob is looked back at by him, and she stares back at him. The raging swarm is stepped out into by Klaatu and through the swirling gray cloud, he walks slowly, his hand raised, trying vainly to protect his face and head. Holes appear in his suit, and blood covers his hands and face. The sphere is approached by him, and he slowly sinks to his knees. With final effort, standing and reaching up, the sphere is touched by him. Light blazes as he is absorbed into it, and a beaming pulse of energy is emitted by the sphere, causing the swarms, millions of bugs, to begin falling like rain to the ground."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A screen displays the mass spreading across the Eastern seaboard of the U.S. New York City is deserted, with Times Square's lights unseen. Mike's SUV navigates the empty streets with Klaatu beside him, while Helen and Jacob exchange anxious glances in the back. Mike accelerates toward a military roadblock, soldiers diving aside, pursued by hummers with machine guns. Mike appears tense, Helen nervously watches the back window, and Klaatu remains calm. The pursuers fall back as they enter Central Park, driving across grass toward the sphere. An explosion flips the car, resting it against a tree. Fighters streak overhead as the sphere is engulfed in a fireball. Regina watches the attack on a monitor, relieved. As smoke clears, the sphere remains intact. The swarm reaches Manhattan's edge. In the car, Mike is dead. Helen frantically unbuckles, sees the windscreen being eaten. Klaatu exits, lifts Jacob out. Helen emerges, seeing the swarm around the sphere as more bugs darken the skies. Klaatu grabs Jacob's hand, leading them across the grass. They enter a tunnel, the swarm staying outside. Klaatu frowns, thinking. Jacob's nose bleeds, and he collapses in Helen's arms. She wipes her nose, finding blood. She pleads with Klaatu, who takes Jacob’s hand, concentrating. Bugs emerge from Helen and Jacob, burrowing into Klaatu. Jacob wakes, Klaatu opens his eyes, and they exchange looks while Helen stares. Klaatu walks to the tunnel's mouth, looks back at Helen comforting Jacob, and steps into the swarm, shielding his face. Holes appear in his suit, his hands and face bloody. Nearing the sphere, he sinks to his knees, stands, touches it. Light blazes as he is absorbed, the sphere emitting energy, causing the swarms to fall like rain."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A screen shows the mass spreading across the Eastern seaboard of the U.S. New York City is deserted, with Times Square's lights unseen. Mike drives an SUV with Klaatu, Helen, and Jacob. They speed towards a military roadblock, pursued by hummers. In Central Park, an explosion flips the car. Fighters fly overhead as the sphere is engulfed in flames. Regina watches the attack, relieved, but the sphere remains intact. The swarm reaches Manhattan. Mike is dead; Helen frees herself, sees the windscreen being eaten, and Klaatu pulls Jacob out. They sprint to a tunnel, avoiding the swarm. Jacob's nose bleeds, and he collapses. Klaatu transfers bugs from Helen and Jacob into himself, reviving Jacob. Klaatu exits into the swarm, bloodied, and reaches the sphere. He touches it, is absorbed, and a pulse causes the bugs to fall like rain."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A screen prominently displays the mass as it spreads out extensively across the Eastern seaboard of the United States. The bustling metropolis of New York City is now eerily deserted. The once-vibrant lights and flashing advertisements of Times Square shine brightly, yet there is no one present to witness them. Mike's SUV navigates the empty streets with ease. Mike is at the wheel, driving with Klaatu seated beside him in the passenger seat, while in the back, Helen and Jacob exchange anxious glances. Mike casts a quick glance at Klaatu before pressing down on the accelerator. They speed towards the military roadblock, causing soldiers to dive out of their path. They are pursued by hummers equipped with machine guns. Mike's expression is tense, and Helen nervously peers out of the back window, while Klaatu remains calm and composed. The pursuers gradually fall back as they veer into the leafy, wooded expanse of Central Park, driving across the grass towards the sphere. An explosion suddenly lifts the car, sending it rolling over multiple times before it finally comes to rest against a sturdy tree. Fighters streak across the sky overhead as the sphere becomes engulfed in a massive fireball. Regina observes the attack unfold on a monitor and closes her eyes in a moment of relief. As the smoke begins to clear, the sphere remains completely intact. Meanwhile, the swarm reaches the very edge of Manhattan. Inside the car, Mike is lifeless. Helen frantically unbuckles her seat belt, glances at Mike, and notices the windshield being consumed. Klaatu pulls himself out of the wrecked car, then carefully lifts out Jacob. Helen emerges and looks up to see the swarm swirling ominously around the sphere as more gray clouds of bugs arrive, darkening the skies further. Klaatu surveys the scene, then, grabbing Jacob's hand, he leads them in a swift sprint across the grass. Just ahead of the hedge, they dash into a tunnel, and the swarm remains outside. Klaatu frowns, deep in thought. Jacob's nose begins to bleed. As Helen crouches to examine him, he collapses into her arms. She wipes her nose and discovers blood on her finger. She looks at Klaatu with a pleading expression. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and focuses intently. Bugs start to crawl up Klaatu's wrist, emerging through Helen and Jacob's skin and burrowing bloodily into him. Jacob awakens, Klaatu opens his eyes, and the pair exchange a meaningful look while Helen stares wide-eyed. Klaatu stands up and walks purposefully towards the mouth of the tunnel. He glances back at Helen comforting Jacob, and she returns his gaze. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud, raising his hand in a vain attempt to shield his face and head. Holes appear in his suit, and his hands and face become bloody. As he approaches the sphere, he gradually sinks to his knees. With a final, determined effort, he stands, reaches up, and touches the sphere. Light blazes brilliantly as he is absorbed into it, and the sphere emits a powerful pulse of energy, causing the swarms, millions of bugs, to begin falling like rain to the ground."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A large screen prominently displays the ominous mass as it spreads extensively across the expansive Eastern seaboard of the United States. The bustling metropolis of New York City, known for its unceasing activity, now lies eerily deserted, a ghost town in its own right. The once-vibrant lights and the flashy neon advertisements of Times Square continue to shine brightly with their usual intensity, yet there is not a single soul present to witness their dazzling display. Mike's SUV moves smoothly along the empty streets with ease and agility. At the wheel, Mike is driving with Klaatu seated beside him in the front passenger seat, while in the back, Helen and Jacob exchange anxious glances, their worry palpable. Mike casts a quick, assessing glance at Klaatu, a hint of determination in his eyes, before he presses down firmly on the accelerator. They speed away towards the looming military roadblock, causing soldiers stationed there to dive hurriedly out of their determined path. They are pursued by hummers, which are equipped with intimidating machine guns. Mike's expression is tense and focused, while Helen nervously peers out of the back window, her eyes wide with fear, and Klaatu remains calm and composed, a picture of serenity. The pursuers gradually fall back, unable to keep up as they veer into the leafy, wooded expanse of Central Park, driving boldly across the grass towards the sphere. Without warning, an explosion suddenly lifts the car off the ground, sending it rolling violently over multiple times before it finally comes to rest against a sturdy, unyielding tree. Fighters streak dramatically across the sky overhead as the sphere becomes engulfed in a massive, fiery explosion. Regina observes the intense attack unfold on a monitor and closes her eyes momentarily in a brief moment of relief. As the smoke and chaos begin to clear away, the sphere remains completely and miraculously intact. Meanwhile, the relentless swarm reaches the very edge of Manhattan. Inside the battered car, Mike is lifeless. Helen frantically unbuckles her seat belt, urgency in her every move, glances at Mike, seeing the windshield being consumed by the chaos. Klaatu pulls himself out of the wrecked car, then skillfully and carefully lifts out Jacob. Helen emerges as well and looks upwards to see the swarm swirling ominously around the sphere as more gray clouds of bugs arrive, darkening the skies further with their ominous presence. Klaatu surveys the chaotic scene, then, grabbing Jacob's hand firmly, leads them in a swift, determined sprint across the grass. Just ahead of the hedge, they dash into a tunnel, where the swarm remains outside, seemingly unable to follow. Klaatu frowns, deep in thought and concentration. Jacob's nose begins to bleed alarmingly. As Helen crouches urgently to examine him, he collapses limply into her arms. She wipes her nose and discovers blood staining her finger. She looks at Klaatu with a pleading, desperate expression. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and focuses intently, channeling his energy. Bugs start to crawl ominously up Klaatu's wrist, emerging painfully through Helen and Jacob's skin and burrowing bloodily into him. Jacob awakens, Klaatu opens his eyes, and the pair exchange a meaningful look of understanding while Helen stares wide-eyed, filled with awe and disbelief. Klaatu stands up, composed and steady, and walks purposefully towards the mouth of the tunnel. He glances back at Helen comforting Jacob, and she returns his gaze, a look of gratitude and hope in her eyes. Klaatu steps bravely out into the raging swarm and walks slowly through the swirling gray cloud, raising his hand in a vain attempt to shield his face and head from the onslaught. Holes appear in his suit, and his hands and face become bloody from the relentless swarm. As he approaches the sphere, he gradually sinks to his knees, exhaustion evident in his movements. With a final, determined effort, he stands tall, reaches up, and touches the sphere. Light blazes brilliantly as he is absorbed into it, and the sphere emits a powerful, resounding pulse of energy, causing the swarms, the millions of bugs, to begin falling like rain to the ground, a testament to Klaatu's sacrifice."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A screen displays a visual of the mass expanding across the Eastern seaboard of the United States, highlighting the complete desertion of New York City. The once-bustling lights and advertisements of Times Square now shine with no audience to witness them. Mike's SUV navigates through the vacant streets, with Mike at the wheel and Klaatu seated beside him in the passenger seat. In the back, Helen and Jacob exchange anxious glances, their faces reflecting the tension of the moment. Mike casts a quick glance at Klaatu, then presses down on the accelerator, causing the vehicle to speed up. They race towards a military roadblock, prompting soldiers to leap out of their path to avoid being hit. Behind them, hummers equipped with machine guns give chase, adding to the intensity of the pursuit. Mike's expression is tense, while Helen nervously peers out the back window, contrasting with Klaatu's calm demeanor. As they veer into the leafy expanse of Central Park, the hummers begin to fall back, and the SUV drives across the grass, heading straight for the sphere. Suddenly, an explosion erupts, lifting the car off the ground and sending it tumbling over multiple times before it finally comes to a halt against a tree. Overhead, fighter jets streak through the sky as the sphere becomes engulfed in a massive fireball. Regina, observing the attack unfold on a monitor, closes her eyes in a moment of relief. As the smoke dissipates, the sphere remains completely intact, unscathed by the assault. Meanwhile, the swarm reaches the outskirts of Manhattan. Inside the car, Mike is lifeless. Helen, in a state of panic, hurriedly unfastens her seat belt, glances at Mike, and notices the windshield being consumed. Klaatu extricates himself from the vehicle, then carefully lifts Jacob out. Helen emerges from the car and looks up to witness the swarm swirling around the sphere, as additional gray clouds of bugs arrive, casting a shadow over the skies. Klaatu surveys the scene, then, taking Jacob's hand, he leads them in a sprint across the grass. Just before reaching a hedge, they dash into a tunnel, where the swarm halts outside. Klaatu frowns, deep in thought. Jacob's nose begins to bleed, and as Helen crouches to tend to him, he collapses into her arms. She wipes her own nose and discovers blood on her finger, then turns to Klaatu with a pleading look. Klaatu gently places Jacob’s hand in Helen's, closes his eyes, and focuses intently. Bugs start to crawl up Klaatu's wrist, emerging from Helen and Jacob's skin and burrowing into him with a bloody trail. Jacob regains consciousness, Klaatu opens his eyes, and they exchange a meaningful look while Helen watches in astonishment. Klaatu rises to his feet and walks towards the tunnel's entrance. He glances back at Helen, who is comforting Jacob, and she returns his gaze. Klaatu steps out into the ferocious swarm, moving slowly through the swirling gray mass, raising his hand in a futile attempt to shield his face and head. His suit begins to tear, and his hands and face become bloodied. As he nears the sphere, he gradually sinks to his knees. With a final surge of determination, he stands, reaches up, and touches the sphere. A brilliant light erupts as he is absorbed into it, and the sphere releases a radiant pulse of energy, causing the swarms, millions of bugs, to cascade to the ground like rain."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A screen displays the mass spreading across the Eastern seaboard of the United States, with New York City completely deserted and Times Square's lights and advertisements left unseen. Mike drives his SUV through the empty streets with Klaatu in the passenger seat, while Helen and Jacob exchange anxious glances in the back. Accelerating towards a military roadblock, they narrowly avoid soldiers and are pursued by hummers with machine guns. As they enter Central Park, an explosion flips the car, leaving it against a tree. Fighters fly overhead as the sphere is engulfed in a fireball, but remains intact, much to Regina's relief as she watches on a monitor. Meanwhile, the swarm reaches Manhattan's edge. Inside the car, Mike is dead. Helen, noticing the windscreen being eaten, frantically unbuckles her seatbelt. Klaatu exits the car, helps Jacob out, and Helen follows, witnessing the swarm around the sphere. Klaatu leads them in a sprint across the grass into a tunnel, where the swarm halts outside. As Jacob collapses with a nosebleed, Helen pleads with Klaatu, who takes Jacob's hand, concentrating as bugs transfer from Helen and Jacob into him. Jacob awakens, and Klaatu, now bloodied, walks towards the tunnel's mouth. He steps into the swarm, enduring its assault as he approaches the sphere. Kneeling, he stands with effort, touches the sphere, and is absorbed into it. A pulse of energy from the sphere causes the swarms to fall like rain."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A digital screen displays the mass spreading out across the Eastern seaboard of the United States, a densely populated region stretching from Maine to Florida. New York City, known for its bustling streets and iconic skyline, is completely deserted. The usually vibrant lights and advertisements of Times Square, a major commercial intersection famous for its bright marquees, have no one to see them. Mike's SUV, a rugged vehicle built for both urban and off-road travel, drives down the empty streets. Mike drives with Klaatu, an enigmatic visitor whose origins are not of this world, in the passenger seat, while in the back, Helen and Jacob look anxiously at each other. Sensing the urgency, Mike glances at Klaatu then accelerates. They hurtle towards the military roadblock set up by national defense forces, and soldiers dive out of the way. They are pursued by hummers, which are military vehicles equipped with machine guns for rapid deployment. Mike looks tense, and Helen looks nervously out of the back window, while Klaatu remains calm, his demeanor unshaken by the chaos. The pursuers fall back as they turn into leafy, wooded Central Park, a renowned urban park in Manhattan, and drive across the grass towards the sphere, a mysterious object of extraterrestrial origin. An explosion lifts the car, rolling it over several times before it comes to rest against an ancient tree. Fighters streak overhead, leaving contrails in the sky, as the sphere is engulfed in a great fireball. Regina, stationed at a control center, watches the attack on a high-definition monitor and closes her eyes in relief. As the smoke clears, the sphere is completely intact, its advanced technology rendering it impervious to attack. Meanwhile, the swarm reaches the edge of Manhattan, its numbers darkening the skies like a living storm. In the car, Mike is dead, having sacrificed himself in the escape. Helen frantically undoes her seat belt, looks at Mike, and notices the windscreen is being eaten by the swarm, a multitude of nanobots consuming everything in their path. Klaatu pulls himself out of the car, then lifts out Jacob. Helen emerges and looks up to see the swarm swirling around the sphere as more gray clouds of bugs arrive. Klaatu looks around, quickly assessing the situation, then grabbing Jacob's hand, he leads them in a sprint across the grass. Just ahead of the hedge, they run into a tunnel, likely an old service access route, and the swarm stays outside. Klaatu frowns, thinking hard about the next step. Jacob's nose is bleeding, a sign of the swarm's detrimental effects. As Helen crouches to examine him, he collapses in her arms. She wipes her nose and finds blood on her finger, her concern escalating. She looks at Klaatu pleadingly for help. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and concentrates, channeling an energy unfamiliar to Earth. Bugs begin to run up Klaatu's wrist, coming out through Helen and Jacob's skin and burrowing bloodily into him, his alien physiology able to absorb and disarm them. Jacob wakes up, Klaatu opens his eyes, and the pair look at each other while Helen stares wide-eyed at the miraculous recovery. Klaatu stands up and walks towards the mouth of the tunnel. He looks back at Helen comforting Jacob, and she stares back at him, grateful yet fearful. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud, hand raised, vainly trying to protect his face and head from the relentless assault. Holes appear in his suit, and his hands and face are bloody, a testament to his sacrifice. As he approaches the sphere, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the sphere, which contains the key to halting the swarm. Light blazes as he is absorbed into it, and the sphere emits a beaming pulse of energy, causing the swarms, millions of bugs, to begin falling like rain to the ground, neutralized by Klaatu's selfless act."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States  New York City is completely deserted  The lights and advertisements of Times Square have no one to see them  Mike's SUV drives down the empty streets  Mike drives with Klaatu in the passenger seat while in the back  Helen and Jacob look anxiously at each other  Mike glances at Klaatu then accelerates  as more gray clouds of bugs arrive darkening the skies  Klaatu looks around then grabbing Jacob's hand  he leads them in a sprint across the grass  Just ahead of the hedge they run into a tunnel and the swarm stays outside  Klaatu frowns thinking hard  Jacob's nose is bleeding  As Helen crouches to examine him he collapses in her arms  She wipes her nose and finds blood on her finger  She looks at Klaatu pleadingly  Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates  Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him  Jacob wakes up  Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed  Klaatu stands up and walks towards the mouth of the tunnel  He looks back at Helen comforting Jacob and she stares back at him  Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head  Holes appear in his suit and his hands and face are bloody  As he approaches the sphere he slowly sinks to his knees  With a final effort he stands reaches up and touches the sphere  Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground They hurtle towards the military roadblock and soldiers dive out of the way  They are pursued by hummers with machine guns  Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm  The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere  An explosion lifts the car rolling it over several times before it comes to rest against the tree  Fighters streak overhead as the sphere is engulfed in a great fireball  Regina watches the attack on a monitor and closes her eyes in relief  As the smoke clears the sphere is completely intact  Meanwhile the swarm reaches the edge of Manhattan  In the car Mike is dead  Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten  Klaatu pulls himself out of the car then lifts out Jacob  Helen emerges and looks up to see the swarm swirling around the sphere  as more gray clouds of bugs arrive darkening the skies  Klaatu looks around then grabbing Jacob's hand  he leads them in a sprint across the grass  Just ahead of the hedge they run into a tunnel and the swarm stays outside  Klaatu frowns thinking hard  Jacob's nose is bleeding  As Helen crouches to examine him he collapses in her arms  She wipes her nose and finds blood on her finger  She looks at Klaatu pleadingly  Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates  Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him  Jacob wakes up  Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed  Klaatu stands up and walks towards the mouth of the tunnel  He looks back at Helen comforting Jacob and she stares back at him  Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head  Holes appear in his suit and his hands and face are bloody  As he approaches the sphere he slowly sinks to his knees  With a final effort he stands reaches up and touches the sphere  Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. Mike's SUV drives down the empty streets. Mike drives with Klaatu in the passenger seat while in the back. Helen and Jacob look anxiously at each other. Mike glances at Klaatu then accelerates. They hurtle towards the military roadblock and soldiers dive out of the way. They are pursued by hummers with machine guns. Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm. The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere. An explosion lifts the car rolling it over several times before it comes to rest against the tree. Fighters streak overhead as the sphere is engulfed in a great fireball. Regina watches the attack on a monitor and closes her eyes in relief. As the smoke clears the sphere is completely intact. Meanwhile the swarm reaches the edge of Manhattan. In the car Mike is dead. Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten. Klaatu pulls himself out of the car then lifts out Jacob. Helen emerges and looks up to see the swarm swirling around the sphere. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. as more gray clouds of bugs arrive darkening the skies. Klaatu looks around then grabbing Jacob's hand. he leads them in a sprint across the grass. Just ahead of the hedge they run into a tunnel and the swarm stays outside. Klaatu frowns thinking hard. Jacob's nose is bleeding. As Helen crouches to examine him he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at Klaatu pleadingly. Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates. Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him. Jacob wakes up. Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed. Klaatu stands up and walks towards the mouth of the tunnel. He looks back at Helen comforting Jacob and she stares back at him. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head. Holes appear in his suit and his hands and face are bloody. As he approaches the sphere he slowly sinks to his knees. With a final effort he stands reaches up and touches the sphere. Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. Mike's SUV drives down the empty streets. Mike drives with Klaatu in the passenger seat while in the back. Helen and Jacob look anxiously at each other. Mike glances at Klaatu then accelerates. They hurtle towards the military roadblock and soldiers dive out of the way. They are pursued by hummers with machine guns. Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm. The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere. An explosion lifts the car rolling it over several times before it comes to rest against the tree. Fighters streak overhead as the sphere is engulfed in a great fireball. Regina watches the attack on a monitor and closes her eyes in relief. As the smoke clears the sphere is completely intact. Meanwhile the swarm reaches the edge of Manhattan. In the car Mike is dead. Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten. Klaatu pulls himself out of the car then lifts out Jacob. Helen emerges and looks up to see the swarm swirling around the sphere. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. as more gray clouds of bugs arrive darkening the skies. Klaatu looks around then grabbing Jacob's hand. he leads them in a sprint across the grass. Just ahead of the hedge they run into a tunnel and the swarm stays outside. Klaatu frowns thinking hard. Jacob's nose is bleeding. As Helen crouches to examine him he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at Klaatu pleadingly. Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates. Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him. Jacob wakes up. Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed. Klaatu stands up and walks towards the mouth of the tunnel. He looks back at Helen comforting Jacob and she stares back at him. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head. Holes appear in his suit and his hands and face are bloody. As he approaches the sphere he slowly sinks to his knees. With a final effort he stands reaches up and touches the sphere. Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. Mike's SUV drives down the empty streets. Mike drives with Klaatu in the passenger seat while in the back. Helen and Jacob look anxiously at each other. Mike glances at Klaatu then accelerates. They hurtle towards the military roadblock and soldiers dive out of the way. They are pursued by hummers with machine guns. Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm. Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him. Jacob wakes up. Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed. Klaatu stands up and walks towards the mouth of the tunnel. He looks back at Helen comforting Jacob and she stares back at him. Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head. Holes appear in his suit and his hands and face are bloody. As he approaches the sphere he slowly sinks to his knees. With a final effort he stands reaches up and touches the sphere. Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. Mike's SUV drives down the empty streets. Holes appear in his suit and his hands and face are bloody. As he approaches the sphere he slowly sinks to his knees. With a final effort he stands reaches up and touches the sphere. Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A screen shows the mass spreading out across the Eastern seaboard of the United States. New York City is completely deserted. The lights and advertisements of Times Square have no one to see them. A horse's SUV drives down the empty streets. The horse drives with a robot in the passenger seat, while in the back, a cat and a bear look anxiously at each other. The horse glances at the robot then accelerates. They hurtle towards the military roadblock, and soldiers dive out of the way. They are pursued by hummers with machine guns. The horse looks tense, and the cat looks nervously out of the back window, while the robot seems calm. The pursuers fall back as they turn into leafy, wooded Central Park and drive across the grass towards the sphere. An explosion lifts the car, rolling it over several times before it comes to rest against the tree. A dolphin watches the attack on a monitor and closes her eyes in relief. As the smoke clears, the sphere is completely intact. Meanwhile, the swarm reaches the edge of Manhattan. In the car, the horse is dead. The cat frantically undoes her seat belt, looks at the horse, and notices the windscreen is being eaten. The robot pulls himself out of the car, then lifts out the bear. The cat emerges and looks up to see the swarm swirling around the sphere as more gray clouds of bugs arrive, darkening the skies. The robot looks around, then grabbing the bear's hand, he leads them in a sprint across the grass. Just ahead of the hedge, they run into a tunnel and the swarm stays outside. The robot frowns, thinking hard. The bear's nose is bleeding. As the cat crouches to examine him, he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at the robot pleadingly. The robot gently takes the bear’s hand in the cat's, closes his eyes, and concentrates. Bugs begin to run up the robot's wrist, coming out through the cat and the bear's skin and burrowing bloodily into him. The bear wakes up, the robot opens his eyes, and the pair look at each other while the cat stares wide-eyed. The robot stands up and walks towards the mouth of the tunnel. He looks back at the cat comforting the bear, and she stares back at him. The robot steps out into the raging swarm and walks slowly through the swirling gray cloud, hand raised, vainly trying to protect his face and head. Holes appear in his suit, and his hands and face are bloody. As he approaches the sphere, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the sphere. Light blazes as he is absorbed into it, and the sphere emits a beaming pulse of energy, causing the swarms, millions of bugs, to begin falling like rain to the ground."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A display shows the flock spreading out across the Western coastline of Canada. Vancouver is completely deserted. The lights and signs of Granville Island have no one to see them. Mike's motorcycle drives down the empty avenues. Mike rides with Klaatu in the sidecar, while in the back, Helen and Jacob look anxiously at each other. Mike glances at Klaatu then accelerates. They hurtle towards the police checkpoint, and officers dive out of the way. They are pursued by scooters with paintball guns. Mike looks tense, and Helen looks nervously out of the back mirror, while Klaatu seems calm. The pursuers fall back as they turn into sandy, expansive Stanley Park and drive across the beach towards the dome. A blast lifts the motorcycle, rolling it over several times before it comes to rest against the statue. Helicopters streak overhead as the dome is engulfed in a great firestorm. Regina watches the attack on a screen and closes her eyes in relief. As the dust clears, the dome is completely intact. Meanwhile, the flock reaches the edge of Victoria Island. In the motorcycle, Mike is dead. Helen frantically undoes her helmet, looks at Mike, and notices the windshield is being devoured. Klaatu pulls himself out of the motorcycle, then lifts out Jacob. Helen emerges and looks up to see the flock circling around the dome as more dark clouds of birds arrive, darkening the skies. Klaatu looks around, then grabbing Jacob's hand, he leads them in a sprint across the beach. Just ahead of the boulder, they run into a cave and the flock stays outside. Klaatu frowns, thinking hard. Jacob's nose is bleeding. As Helen crouches to examine him, he collapses in her arms. She wipes her nose and finds blood on her finger. She looks at Klaatu pleadingly. Klaatu gently takes Jacob’s hand in Helen's, closes his eyes, and concentrates. Birds begin to climb up Klaatu's wrist, coming out through Helen and Jacob's skin and burrowing bloodily into him. Jacob wakes up, Klaatu opens his eyes, and the pair look at each other while Helen stares wide-eyed. Klaatu stands up and walks towards the mouth of the cave. He looks back at Helen comforting Jacob, and she stares back at him. Klaatu steps out into the raging flock and walks slowly through the swirling dark cloud, hand raised, vainly trying to protect his face and head. Tears appear in his coat, and his hands and face are bloody. As he approaches the dome, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the dome. Light blazes as he is absorbed into it, and the dome emits a beaming pulse of energy, causing the flocks, millions of birds, to begin falling like leaves to the ground."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A screen displays the mass settling over the Eastern seaboard of the United States. New York City is completely abandoned. The lights and advertisements of Times Square await an audience. Mike's SUV glides down the vacant streets. Mike coasts with Klaatu in the passenger seat, while in the back, Helen and Jacob exchange uneasy glances. Mike peers at Klaatu then decelerates. They meander towards the military roadblock, and soldiers leap aside unscathed. They are monitored by hummers with machine guns. Mike appears tense, and Helen gazes nervously out of the back window, while Klaatu remains placid. The pursuers diverge as they veer into leafy, wooded Central Park and roll across the grass towards the sphere. A sudden gust lifts the car, flipping it over several times before it settles against the tree. Jets soar overhead as the sphere is enveloped in an enormous plume of smoke. Regina observes the attack on a monitor and opens her eyes in disbelief. As the haze clears, the sphere remains unscathed. Meanwhile, the swarm drifts to the edge of Manhattan. In the car, Mike is unresponsive. Helen frantically fastens her seat belt, gazes at Mike, and observes the windscreen disintegrating. Klaatu eases himself out of the car, then reaches for Jacob. Helen appears and glances up to see the swarm encircling the sphere as more gray clouds of bugs gather, dimming the skies. Klaatu surveys the area, then taking Jacob's hand, he guides them in a sprint across the grass. Just beyond the hedge, they stumble into a tunnel, and the swarm stays outside. Klaatu furrows his brow, contemplating deeply. Jacob's nose is dripping. As Helen kneels to inspect him, he collapses into her embrace. She wipes her forehead and discovers blood on her palm. She looks at Klaatu imploringly. Klaatu gently places Jacob’s hand in Helen's, opens his eyes, and focuses. Bugs begin to descend Klaatu's wrist, emerging from Helen and Jacob's skin and piercing into him. Jacob awakens, Klaatu opens his eyes, and the pair exchange glances while Helen observes in shock. Klaatu rises and strides towards the mouth of the tunnel. He glances back at Helen consoling Jacob, and she stares back at him. Klaatu steps into the turbulent swarm and strides slowly through the swirling gray cloud, hand poised, futilely shielding his face and head. Gashes appear in his suit, and his hands and face are raw. As he nears the sphere, he gradually sags to his knees. With one last effort, he rises, extends his arm, and contacts the sphere. Light erupts as he is enveloped into it, and the sphere releases a radiant wave of energy, causing the swarms, millions of bugs, to start descending like rain to the ground."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A keyboard shows the confetti spreading out across the Western countryside of Australia. Tokyo Tower is completely flooded. The candles and posters of Tiananmen Square have no one to see them. Lisa's bicycle rolls down the empty sidewalks. Lisa pedals with Thor in the passenger basket, while in the back, Luna and Oliver glance anxiously at each other. Lisa glances at Thor then accelerates. They hurtle towards the grocery store gate, and astronauts hop out of the way. They are pursued by scooters with water pistols. Lisa looks tense, and Luna looks nervously out of the rearview mirror, while Thor seems calm. The pursuers fall back as they turn into sandy, open Hyde Park and pedal across the gravel towards the pyramid. A thunderstorm lifts the bicycle, rolling it over several times before it comes to rest against the statue. Kites drift overhead as the pyramid is engulfed in a great wave. Penelope watches the chaos on a television and closes her eyes in relief. As the waves recede, the pyramid is completely intact. Meanwhile, the parade reaches the edge of Sydney. In the bicycle, Lisa is asleep. Luna frantically unclips her helmet, looks at Lisa, and notices the wheel is being eaten. Thor pulls himself out of the bicycle, then lifts out Oliver. Luna emerges and looks up to see the parade swirling around the pyramid as more black clouds of birds arrive, shadowing the skies. Thor looks around, then grabbing Oliver's hand, he leads them in a sprint across the gravel. Just ahead of the sculpture, they run into a cavern and the parade stays outside. Thor frowns, pondering intensely. Oliver's hand is bleeding. As Luna crouches to examine him, he collapses in her lap. She wipes her cheek and finds blood on her thumb. She looks at Thor imploringly. Thor gently takes Oliver’s hand in Luna's, closes his eyes, and reflects. Birds begin to run up Thor's arm, coming out through Luna and Oliver's skin and burrowing bloodily into him. Oliver wakes up, Thor opens his eyes, and the pair look at each other while Luna stares wide-eyed. Thor stands up and walks towards the opening of the cavern. He looks back at Luna hugging Oliver, and she stares back at him. Thor steps out into the clashing parade and walks slowly through the swirling black flock, hand raised, vainly trying to shield his face and head. Holes appear in his jacket, and his arms and face are bloody. As he approaches the pyramid, he slowly sinks to his knees. With a final effort, he stands, reaches up, and touches the pyramid. Light blazes as he is absorbed into it, and the pyramid emits a blazing pulse of sound, causing the parade, thousands of birds, to begin falling like leaves to the ground."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "An aquarium reveals the herd scattering across the Western coast of Australia. Sydney is entirely bustling. The shadows and trees of Hyde Park have no one to admire them. Lucy's bicycle glides down the busy intersections. Lucy pedals with Gort in the sidecar, while on the trailer, Sarah and Ethan glance cheerfully at each other. Lucy swerves toward Gort then decelerates. They meander toward the civilian picnic area, and children dash into the fray. They are followed by scooters with water balloons. Lucy looks calm, and Sarah peers excitedly out of the side mirror, while Gort seems anxious. The followers pause as they veer into a sunlit, open field and pedal across the path toward the sunflower. A burst of laughter jostles the bike, tipping it over multiple times before it settles against the bench. Balloons race overhead as the sunflower is surrounded by a dazzling rainbow. Benjamin observes the spectacle on a television and nods with joy. As the mist fades, the sunflower is completely unscathed. Meanwhile, the herd reaches the center of Sydney. On the bike, Lucy is dreaming. Sarah hurriedly fastens her helmet, gazes at Lucy, and notices the handlebars are being covered. Gort frees himself from the bike, then carries out Ethan. Sarah appears and gazes up to see the herd converging around the sunflower as more white flocks of sparrows arrive, filling the skies. Gort scans the area, then clutching Ethan's collar, he guides them in a hop across the field. Just beyond the fence, they stumble into a gazebo and the herd remains outside. Gort grins, considering deeply. Ethan's cheek is bruised. As Sarah kneels to assess him, he faints in her embrace. She cleans her cheek and smudges ink on her thumb. She gawks at Gort imploringly. Gort tenderly places Ethan’s collar in Sarah's, bows his head, and meditates. Sparrows start to flit up Gort's sleeve, emerging through Sarah and Ethan's hair and weaving tangledly into him. Ethan stirs, Gort raises his eyes, and the duo gaze at each other while Sarah blinks astonished. Gort rises and ambles toward the edge of the gazebo. He glances back at Sarah holding Ethan, and she gazes back at him. Gort steps into the gentle herd and strolls slowly through the drifting white flock, arm extended, cautiously trying to guard his body. Holes tear in his jacket, and his arms and neck are scarred. As he nears the sunflower, he gradually lowers to his knees. With one last act, he stretches, touches the sunflower. Light flares as he vanishes into it, and the sunflower radiates a warm wave of illumination, prompting the herds, thousands of sparrows, to begin falling like petals to the earth."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A monitor displays the fabric unfurling across the Western coastline of Brazil. Sao Paulo is entirely uninhabited. The lanterns and posters of Paulista Avenue have nobody to watch them. Mike's bicycle pedals down the vacant alleys. Mike cycles with Klaatu in the sidecar, while in the trailer, Helen and Jacob glance worriedly at each other. Mike peeks at Klaatu then decelerates. They glide towards the civilian barrier, and pedestrians step out of the way. They are chased by mopeds with water balloons. Mike feels calm, and Helen peers nervously out of the side mirror, while Klaatu seems anxious. The pursuers drift back as they veer into lush, verdant Central Park and glide over the sand towards the dome. A gust lifts the bicycle, tumbling it several times before it settles against the bush. Drones soar overhead as the dome is wrapped in a great mist. Regina sees the event on a tablet and shuts her eyes in anguish. As the mist disperses, the dome is completely untouched. Meanwhile, the storm pauses at the riverbank of Brooklyn. In the bicycle, Mike is unconscious. Helen hurriedly fastens her helmet, checks on Mike, and notices the windshield is being soaked. Klaatu drags himself out of the bicycle, then lowers out Jacob. Helen emerges and glances up to see the storm swirling around the dome as more white flurries of insects gather, brightening the skies. Klaatu glances around, then seizing Jacob's shoulder, he guides them in a dash over the sand. Just ahead of the railing, they dive into a cave and the storm remains outside. Klaatu smiles, considering deeply. Jacob's cheek is bruised. As Helen kneels to inspect him, he crumples in her embrace. She wipes her cheek and finds ink on her fingertip. She gazes at Klaatu imploringly. Klaatu softly places Jacob’s palm in Helen's, closes his eyes, and meditates. Insects begin to crawl up Klaatu's elbow, emerging through Helen and Jacob's skin and nestling deeply into him. Jacob awakens, Klaatu opens his eyes, and the two gaze at each other while Helen watches wide-eyed. Klaatu stands up and approaches the entrance of the cave. He glances back at Helen embracing Jacob, and she looks back at him. Klaatu steps into the chaotic storm and walks leisurely through the swirling white flurry, arm raised, futilely attempting to shield his torso and legs. Tears appear in his clothing, and his arms and chest are bruised. As he nears the dome, he gradually lowers to his feet. With a final surge, he rises, extends a hand, and taps the dome. Light flares as he is engulfed into it, and the dome releases a radiant wave of force, causing the storms, thousands of insects, to begin drifting like snow to the ground."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A mural exhibits the drizzle scattering across the Southern coastline of Brazil. Rio de Janeiro is entirely populated. The music and dancers of the Carnival have everyone to entertain them. Emma's bicycle rolls up the crowded avenues. Emma cycles with Zog in the median path, while in the basket, Flora and Ben examine gleefully at each other. Emma peeks at Zog then decelerates. They crawl towards the carnival barrier, and acrobats leap into the air. They are followed by scooters with speakers. Emma looks relaxed, and Flora looks cheerfully out of the front handlebar, while Zog appears excited. The followers drift away as they pedal into dense, urban Ibirapuera Park and cycle across the path towards the pyramid. A shower propels the bicycle, flipping it over several times before it settles against the fountain. Drones hover overhead as the pyramid is overcome in a bright rainstorm. Marta observes the performance on a telescope and opens her eyes in surprise. As the mist settles, the pyramid is perfectly preserved. Meanwhile, the parade reaches the center of Rio. On the bicycle, Emma is asleep. Flora calmly refastens her helmet, gazes at Emma, and observes the windshield is being cleaned. Zog pushes himself off the bicycle, then helps off Ben. Flora appears and glances up to witness the parade circling around the pyramid as more colorful balloons of confetti arrive, brightening the skies. Zog observes his surroundings, then grabbing Ben's foot, he drags them in a crawl across the path. Just beyond the archway, they crawl into a cave and the parade stops outside. Zog grins, pondering deeply. Ben's elbow is itching. As Flora kneels to massage him, he falls in her embrace. She rubs her elbow and finds dirt on her thumb. She glances at Zog questioningly. Zog delicately places Ben’s foot in Flora's, opens his eyes, and meditates. Confetti begins to fly off Zog's ankle, bursting out through Flora and Ben's arms and embedding colorfully into him. Ben wakens, Zog closes his eyes, and the duo glance at each other while Flora marvels joyously. Zog rises and meanders towards the end of the cave. He glances back at Flora supporting Ben, and she gazes back at him. Zog meanders out into the joyous parade and strides slowly through the whirling colorful mist, hand lifted, triumphantly trying to shield his smile and chest. Patterns emerge in his jacket, and his arms and cheeks are shiny. As he nears the pyramid, he leisurely slides to his feet. With a final leap, he jumps, reaches over, and taps the pyramid. Colors glow as he is absorbed into it, and the pyramid releases a dazzling wave of confetti, causing the parades, thousands of balloons, to start ascending like bubbles to the sky."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A screen displays the mass spreading across the Eastern U.S., leaving New York City deserted. Mike drives an SUV with Klaatu, Helen, and Jacob through empty streets toward a military roadblock, pursued by armed hummers. They reach Central Park just as an explosion flips their vehicle near a sphere engulfed in a fireball, but the sphere remains intact. Regina watches this on a monitor, relieved. The swarm reaches Manhattan as Helen, finding Mike dead, escapes the car with Klaatu and Jacob. They run to a tunnel where the swarm stops. Jacob collapses with a nosebleed, and Klaatu transfers the bugs from Jacob and Helen into himself, healing him. Klaatu steps into the swarm, bloody and tattered, and reaches the sphere. He touches it, emitting energy that causes the swarm to fall to the ground."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground With a final effort he stands reaches up and touches the sphere  As he approaches the sphere he slowly sinks to his knees  Holes appear in his suit and his hands and face are bloody  Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head  He looks back at Helen comforting Jacob and she stares back at him  Klaatu stands up and walks towards the mouth of the tunnel  Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed  Jacob wakes up  Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him  Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates  She looks at Klaatu pleadingly  She wipes her nose and finds blood on her finger  As Helen crouches to examine him he collapses in her arms  Jacob's nose is bleeding  Klaatu frowns thinking hard  Just ahead of the hedge they run into a tunnel and the swarm stays outside  he leads them in a sprint across the grass  Klaatu looks around then grabbing Jacob's hand  as more gray clouds of bugs arrive darkening the skies  Helen emerges and looks up to see the swarm swirling around the sphere  Klaatu pulls himself out of the car then lifts out Jacob  Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten  In the car Mike is dead  Meanwhile the swarm reaches the edge of Manhattan  As the smoke clears the sphere is completely intact  Regina watches the attack on a monitor and closes her eyes in relief  Fighters streak overhead as the sphere is engulfed in a great fireball  An explosion lifts the car rolling it over several times before it comes to rest against the tree  The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere  Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm  They are pursued by hummers with machine guns  They hurtle towards the military roadblock and soldiers dive out of the way  Mike glances at Klaatu then accelerates  Helen and Jacob look anxiously at each other  Mike drives with Klaatu in the passenger seat while in the back  Mike's SUV drives down the empty streets  The lights and advertisements of Times Square have no one to see them  New York City is completely deserted  A screen shows the mass spreading out across the Eastern seaboard of the United States "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As the smoke clears the sphere is completely intact  Meanwhile the swarm reaches the edge of Manhattan  Regina watches the attack on a monitor and closes her eyes in relief  A screen shows the mass spreading out across the Eastern seaboard of the United States  Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed  Fighters streak overhead as the sphere is engulfed in a great fireball  She wipes her nose and finds blood on her finger  They are pursued by hummers with machine guns  Jacob's nose is bleeding  Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him  Jacob wakes up  The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere  As he approaches the sphere he slowly sinks to his knees  Mike drives with Klaatu in the passenger seat while in the back  Just ahead of the hedge they run into a tunnel and the swarm stays outside  Mike's SUV drives down the empty streets  She looks at Klaatu pleadingly  Klaatu looks around then grabbing Jacob's hand  Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head  Klaatu stands up and walks towards the mouth of the tunnel  New York City is completely deserted  Holes appear in his suit and his hands and face are bloody  With a final effort he stands reaches up and touches the sphere  Mike glances at Klaatu then accelerates  Klaatu pulls himself out of the car then lifts out Jacob  An explosion lifts the car rolling it over several times before it comes to rest against the tree  Helen emerges and looks up to see the swarm swirling around the sphere  as more gray clouds of bugs arrive darkening the skies  As Helen crouches to examine him he collapses in her arms  Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm  Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten  Helen and Jacob look anxiously at each other  Klaatu frowns thinking hard  They hurtle towards the military roadblock and soldiers dive out of the way  He looks back at Helen comforting Jacob and she stares back at him  Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates  The lights and advertisements of Times Square have no one to see them  In the car Mike is dead  Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground he leads them in a sprint across the grass "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "as more gray clouds of bugs arrive darkening the skies  Klaatu looks around then grabbing Jacob's hand  he leads them in a sprint across the grass  Just ahead of the hedge they run into a tunnel and the swarm stays outside  Klaatu frowns thinking hard  Jacob's nose is bleeding  As Helen crouches to examine him he collapses in her arms  She wipes her nose and finds blood on her finger  She looks at Klaatu pleadingly  Klaatu gently takes Jacob’s hand in Helen's closes his eyes and concentrates  Bugs begin to run up Klaatu's wrist coming out through Helen and Jacob's skin and burrowing bloodily into him  Jacob wakes up  Klaatu opens his eyes and the pair look at each other while Helen stares wideeyed  Klaatu stands up and walks towards the mouth of the tunnel  He looks back at Helen comforting Jacob and she stares back at him  Klaatu steps out into the raging swarm and walks slowly through the swirling gray cloud hand raised vainly trying to protect his face and head  Holes appear in his suit and his hands and face are bloody  As he approaches the sphere he slowly sinks to his knees  With a final effort he stands reaches up and touches the sphere  Light blazes as he is absorbed into it and the sphere emits a beaming pulse of energy causing the swarms millions of bugs to begin falling like rain to the ground A screen shows the mass spreading out across the Eastern seaboard of the United States  New York City is completely deserted  The lights and advertisements of Times Square have no one to see them  Mike's SUV drives down the empty streets  Mike drives with Klaatu in the passenger seat while in the back  Helen and Jacob look anxiously at each other  Mike glances at Klaatu then accelerates  They hurtle towards the military roadblock and soldiers dive out of the way  They are pursued by hummers with machine guns  Mike looks tense and Helen looks nervously out of the back window while Klaatu seems calm  The pursuers fall back as they turn into leafy wooded Central Park and drive across the grass towards the sphere  An explosion lifts the car rolling it over several times before it comes to rest against the tree  Fighters streak overhead as the sphere is engulfed in a great fireball  Regina watches the attack on a monitor and closes her eyes in relief  As the smoke clears the sphere is completely intact  Meanwhile the swarm reaches the edge of Manhattan  In the car Mike is dead  Helen frantically undoes her seat belt looks at Mike and notices the windscreen is being eaten  Klaatu pulls himself out of the car then lifts out Jacob  Helen emerges and looks up to see the swarm swirling around the sphere "
        }
      ]
    }
  ]
}