{
  "ground_truth": "She illustrates by making a rounded gesture near her stomach, while in the background, Keith the teacher is talking to some science kids, sporting a Wild America beard. He lifts a cup of coffee to his lips and slurps lustily. Bleeker retrieves a book from his open locker as Juno marches up to him, belly leading the way, clearly affronted. A girl, obviously Katrina, strides past with a sour look aimed squarely at Juno. Juno starts to walk away, picking up her backpack dejectedly and sliding it over her shoulder, but she's about to walk away when she climbs ungracefully into the van. Mark is seated at the computer, surfing a horror movie website, with a blank expression of a bored obsessive. He breaks into a grin and opens the door as Juno stands there, looking radiantly knocked-up, holding a stack of CDs. He gestures for Juno to follow him into the house, where the Lorings' basement is dank, cluttered, unfinished, and unattractive, much like Paulie Bleeker's. Mark pulls a chain to illuminate a bare bulb as Juno examines the comic. There's a battered portable CD player in the corner. Juno mockingly places her hands on Mark's waist and moves back and forth stiffly, then they sway slowly to the music until Juno's belly bumps up against Mark. Juno rests her head on Mark's chest and they dance in silence for a few moments, then stop moving. Juno backs away, and Mark suddenly sees Juno for what she is—a teenage girl. Juno turns to leave and shoots one furious look back at Mark. She reaches the top of the stairs and scrambles toward the front door, only to be intercepted by Vanessa, who's returning home from work, carrying her briefcase and a freshly purchased nursing pillow. It's obvious from Juno's tears and flushed face that she's lying. She rushes toward the door, then halts, looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying, and as Juno's face continues to fall, Vanessa notices, sighs, and looks defeated. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing, and it's quiet after the storm. Juno buckles over the steering wheel, crying, unwinding for the first time since she became pregnant. Meanwhile, Bleeker is sitting next to his bed, noodling on the guitar, playing a theme that we will soon recognize. Juno lays on the hood of her Previa, contemplating her future. After a beat, she begins to gather herself, hops off the hood, and scurries into the Previa where she finds a crumpled-up Jiffy Lube receipt. She unfolds it and pulls out a pen, ready to write something.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She depicts by creating a circular motion near her abdomen, while in the backdrop, Keith the instructor is conversing with some science youths, sporting a Wild America beard. He raises a mug of espresso to his mouth and sips eagerly. Bleeker retrieves a tome from his exposed cupboard as Juno strides up to him, belly leading the way, clearly offended. A girl, obviously Katrina, marches past with a bitter expression aimed squarely at Juno. Juno starts to walk away, picking up her backpack disconsolately and sliding it over her shoulder, but she's about to walk away when she climbs awkwardly into the van. Mark is seated at the computer, browsing a horror film website, with a vacant expression of a bored obsessive. He breaks into a smile and opens the entryway as Juno stands there, looking radiantly pregnant, holding a stack of discs. He motions for Juno to trail him into the house, where the Lorings' cellar is damp, cluttered, unfinished, and unattractive, much like Paulie Bleeker's. Mark pulls a cord to illuminate a bare bulb as Juno inspects the comic. There's a battered portable CD player in the corner. Juno mockingly places her hands on Mark's waist and shifts back and forth stiffly, then they sway slowly to the melody until Juno's abdomen bumps up against Mark. Juno rests her head on Mark's chest and they dance in silence for a few moments, then cease moving. Juno backs away, and Mark suddenly sees Juno for what she is—a youthful girl. Juno turns to depart and shoots one furious look back at Mark. She reaches the top of the stairs and rushes toward the front door, only to be intercepted by Vanessa, who's returning home from work, carrying her briefcase and a newly purchased nursing pillow. It's obvious from Juno's tears and flushed face that she's lying. She rushes toward the door, then halts, looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying, and as Juno's face continues to fall, Vanessa notices, sighs, and looks defeated. Vanessa and Mark notice that Juno has escaped the confrontation as Juno runs up to her vehicle sobbing, and it's quiet after the tempest. Juno buckles over the steering wheel, weeping, unwinding for the first time since she became pregnant. Meanwhile, Bleeker is sitting next to his bed, noodling on the guitar, playing a melody that we will soon recognize. Juno lies on the hood of her Previa, contemplating her future. After a pause, she begins to gather herself, hops off the hood, and scurries into the Previa where she finds a crumpled-up Jiffy Lube receipt. She unfolds it and pulls out a pen, ready to jot something."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is illustrated by making a rounded gesture near her stomach, while some science kids are talked to by Keith the teacher, sporting a Wild America beard, in the background. A cup of coffee is lifted to his lips and lustily slurped by him. A book is retrieved by Bleeker from his open locker as Juno is marched up to by him, belly leading the way, clearly affronted. A sour look aimed squarely at Juno is given by a girl, obviously Katrina, who strides past. Away is about to be walked by Juno, her backpack being picked up dejectedly and slid over her shoulder by her, when she ungracefully climbs into the van. At the computer, Mark is surfing a horror movie website, with a blank expression of a bored obsessive seated on his face. A grin is broken into by him and the door is opened as Juno stands there, looking radiantly knocked-up, holding a stack of CDs. Juno is gestured by him to follow him into the house, where the Lorings' basement, much like Paulie Bleeker's, is dank, cluttered, unfinished, and unattractive. A chain is pulled by Mark to illuminate a bare bulb as the comic is examined by Juno. In the corner, a battered portable CD player is found by them. Mockingly, Juno places her hands on Mark's waist and they are moved back and forth stiffly by her, then the music is swayed to slowly until Mark is bumped up against by Juno's belly. Her head is rested by Juno on Mark's chest and silence is danced in by them for a few moments, with the movement being stopped by them. Away is backed by Juno, and suddenly Juno is seen by Mark for what she is—a teenage girl. To leave is turned by Juno and one furious look is shot back at Mark by her. The top of the stairs is reached by her and the front door is scrambled toward, only to be intercepted by Vanessa, who's returning home from work, carrying her briefcase and a freshly purchased nursing pillow. It's obvious that Juno is lying, evident from her tears and flushed face. Toward the door is rushed by her, then halted, looking totally betrayed. At Juno's expression, Vanessa looks and knows Mark is lying, and as Juno's face continues to fall, Vanessa notices, sighs, and is looked at defeatedly by her. Vanessa and Mark notice that the conflict is escaped by Juno as her car is run up to by her, sobbing, and it's quiet after the storm. Over the steering wheel, Juno buckles, crying, unwinding for the first time since her pregnancy began. Meanwhile, next to his bed, Bleeker is noodling on the guitar, playing a theme that we will soon recognize. On the hood of her Previa, Juno is laid, contemplating her future. After a beat, herself is gathered by her, the hood is hopped off by her, and the Previa is scurried into by her where a crumpled-up Jiffy Lube receipt is found. It is unfolded by her and a pen is pulled out, ready to write something."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She gestures near her stomach as Keith, the teacher with a Wild America beard, talks to some science kids, sipping coffee. Bleeker retrieves a book from his locker as Juno approaches, visibly upset. Katrina passes by with a sour look at Juno. Juno slings her backpack over her shoulder and awkwardly climbs into the van. Mark, browsing a horror movie site, greets her with a grin and invites her inside. The Lorings' basement is cluttered and similar to Bleeker's. Mark turns on a light, and Juno examines the comics. She mock-dances with Mark until they sway quietly. Juno then sees herself as a teenage girl and leaves, shooting Mark a furious look. As she reaches the door, Vanessa arrives with a briefcase and nursing pillow. It's clear Juno's lying from her tears, and Vanessa realizes Mark's deceit. Juno escapes, sobbing toward her car. Quiet ensues as Juno cries over the steering wheel, releasing emotion since her pregnancy. Meanwhile, Bleeker plays a tune on his guitar. Juno lies on her car hood, contemplating her future, then hops off to find a crumpled Jiffy Lube receipt and a pen, ready to write."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She gestures near her stomach as Keith talks to science kids, sporting a beard, and sips coffee. Bleeker retrieves a book from his locker as Juno, visibly upset, approaches him. Katrina passes by with a sour look at Juno. Juno dejectedly picks up her backpack and enters a van. Mark, browsing a horror movie site, grins and welcomes her. In the cluttered basement, Juno examines a comic; they sway to music until her belly touches Mark. Juno rests on Mark's chest, then steps back, and Mark recognizes her as a teenage girl. Juno angrily leaves but is intercepted by Vanessa, returning home with a nursing pillow. Juno's tears reveal her lies and she feels betrayed. Vanessa realizes Mark is lying as Juno runs to her car in tears. Juno cries at the wheel, unwinding for the first time since her pregnancy. Meanwhile, Bleeker plays guitar. Juno, on her car hood, gathers herself, finds a receipt inside, and prepares to write."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She visually conveys her point by making a rounded gesture near her stomach, subtly indicating a significant aspect of her condition. Meanwhile, in the background, Keith, who is the science teacher, is engaging in an animated conversation with some enthusiastic science students. He proudly sports a Wild America-style beard that adds to his character. During this interaction, he nonchalantly lifts a cup of steaming coffee to his lips and takes a long slurp, savoring it lustily. At the same time, Bleeker casually retrieves a book from his open, cluttered locker, just as Juno approaches him, an air of confrontation surrounding her as her belly leads the way, signaling that she is clearly affronted. \n\nAs this unfolds, a girl, unmistakably Katrina, strides past them, her expression sour and aimed squarely at Juno, leaving no doubt about her disapproval. Juno, feeling dejected and disheartened, begins to walk away, lifting her backpack with resignation and sliding it over her shoulder. However, before she fully departs, she awkwardly climbs into the van, her movements lacking grace. Inside the van, Mark is engrossed at the computer, browsing a horror movie website with the detached expression of a bored obsessive. His mood shifts, and he breaks into a grin as he notices Juno standing there, radiantly exuding the unmistakable look of someone who is expectantly pregnant, while clutching a stack of CDs. He gestures for Juno to follow him into the house, leading her down to the Lorings' basement. The basement is notably dank, cluttered, unfinished, and fairly unattractive, bearing resemblance to Paulie Bleeker’s space.\n\nMark pulls a chain that illuminates a bare bulb, casting light as Juno examines a comic book. In the corner sits a battered portable CD player, a relic from the past. With a touch of mockery, Juno places her hands on Mark's waist, moving back and forth stiffly. They begin to sway slowly to the music until Juno’s belly gently bumps against Mark. She then rests her head on Mark’s chest, and together, they dance in silence for a few moments before coming to a stop. Juno then backs away, and at that moment, Mark suddenly perceives Juno’s true nature—realizing she is, in fact, just a teenage girl. Juno turns to leave, delivering a furious look back at Mark, one that speaks volumes. \n\nShe reaches the top of the stairs, making her way hastily toward the front door, only to be intercepted by Vanessa, who is returning home from work, her briefcase in one hand and a freshly purchased nursing pillow in the other. It is evident from Juno's tear-streaked face and flushed cheeks that she is not being truthful. She hurriedly heads for the door but then halts, appearing completely betrayed. Vanessa takes in Juno's expression and instantly discerns that Mark is not being truthful, and as Juno’s face continues to show her distress, Vanessa acknowledges the situation, resigns with a sigh, and appears utterly defeated. Both Vanessa and Mark notice Juno hastily escaping the ongoing conflict as she runs up to her car, her sobs indicating the quiet aftermath of the emotional storm. Juno collapses over the steering wheel, crying and unwinding for the first time since her pregnancy began. \n\nMeanwhile, Bleeker is sitting quietly next to his bed, gently noodling on the guitar and playing a melodic theme that we will soon come to recognize. Juno reclines on the hood of her Previa, contemplating the uncertain expanse of her future. After a reflective moment, she starts to gather herself together, hops off the hood, and scurries into the Previa where she discovers a crumpled-up Jiffy Lube receipt. She carefully unfolds it and retrieves a pen, poised and ready to write something of significance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a soft and deliberate motion of her hands, she visually conveys her point by making a rounded gesture near her stomach, subtly indicating a significant and meaningful aspect of her condition. Meanwhile, in the lively background, Keith, who holds the esteemed position of the science teacher, is actively engaging in an animated and lively conversation with a group of enthusiastic and eager science students. He proudly sports a Wild America-style beard that adds a distinct and memorable touch to his overall character. During the course of this energetic interaction, he nonchalantly lifts a cup of steaming, aromatic coffee to his lips and takes a long, savoring slurp, appreciating it lustily. At the same time, Bleeker casually retrieves a book from his open and cluttered locker, just as Juno approaches him, an air of confrontation surrounding her as her prominent belly leads the way, signaling quite clearly that she is affronted.\n\nAs this scene unfolds, a girl, unmistakably Katrina, strides past them with a deliberate pace, her expression sour and aimed squarely at Juno, leaving no doubt about her obvious disapproval. Juno, feeling dejected and disheartened by the encounter, begins to walk away, lifting her backpack with a sense of resignation and sliding it over her shoulder. However, before she fully departs, she awkwardly climbs into the van, her movements lacking any semblance of grace. Inside the van, Mark is engrossed at the computer, absorbed in browsing a horror movie website with the detached expression of a bored obsessive. His mood shifts, and suddenly he breaks into a grin as he notices Juno standing there, radiantly exuding the unmistakable look of someone who is expectantly pregnant, while clutching a haphazard stack of CDs. He gestures for Juno to follow him into the house, leading her down to the Lorings' basement. The basement is notably dank, cluttered, unfinished, and fairly unattractive, bearing a resemblance to Paulie Bleeker’s own space.\n\nMark pulls a chain that illuminates a lone, bare bulb, casting a dim light as Juno examines a comic book. In the corner of the space sits a battered and worn-out portable CD player, a relic from the past. With a touch of playful mockery, Juno places her hands on Mark's waist, moving back and forth in a stiff manner. They begin to sway slowly to the music until Juno’s belly gently bumps against Mark. She then rests her head on Mark’s chest, and together, they share a silent dance for a few moments before coming to a natural stop. Juno then backs away, and at that very moment, Mark suddenly perceives Juno’s true nature—realizing she is, in fact, just a teenage girl. Juno turns to leave, delivering a furious look back at Mark, one that speaks volumes without uttering a word.\n\nShe reaches the top of the stairs, making her way hastily toward the front door, only to be intercepted by Vanessa. Vanessa is returning home from work with her briefcase in one hand and a freshly purchased nursing pillow in the other. It becomes evident from Juno's tear-streaked face and flushed cheeks that she is not being truthful. She hurriedly heads for the door but then halts, appearing completely betrayed and confused. Vanessa takes in Juno's expression and instantly discerns that Mark is not being truthful either, and as Juno’s face continues to reveal her distress, Vanessa acknowledges the situation, resigns with a heavy sigh, and appears utterly defeated. Both Vanessa and Mark notice Juno hastily escaping the ongoing conflict as she runs to her car, her sobs indicating the quiet aftermath of the emotional storm. Juno collapses over the steering wheel, crying and unwinding for the first time since her pregnancy began.\n\nMeanwhile, Bleeker is sitting quietly next to his bed, gently noodling on the guitar and playing a melodic theme that will soon become familiar. Juno reclines on the hood of her Previa, contemplating the vast and uncertain expanse of her future. After a reflective moment, she starts to gather herself together, hops off the hood, and scurries into the Previa where she discovers a crumpled-up Jiffy Lube receipt. She carefully unfolds it and retrieves a pen, poised and ready to write something of significance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she illustrates, she makes a rounded gesture near her stomach, her hand moving in a circular motion close to her midsection, while in the background, Keith, the teacher, engages in conversation with some science students, who seem captivated by his presence and the distinctive Wild America beard he's sporting. With a casual motion, Keith lifts a cup of coffee to his lips and indulges in a loud, satisfying slurp. Meanwhile, Bleeker, standing by his open locker, retrieves a book with one hand, his fingers curling around its spine as Juno approaches with determined strides, her belly preceding her as she walks, clearly conveying her affronted state. As she nears him, a girl who is unmistakably Katrina strides past, her sour expression directed sharply at Juno. In response to the situation, Juno begins to walk away, her movements slow and reflective as she picks up her backpack, feeling the weight of it as she slides it over one shoulder dejectedly. She seems ready to leave, but instead, she changes her mind, awkwardly climbing into the van with a lack of grace. Inside the house, Mark sits at the computer, his eyes scanning the screen with the intent focus of someone engrossed in a horror movie website, the blank expression on his face betraying his boredom-tinged obsession. His demeanor shifts as he breaks into a grin upon noticing Juno standing there, radiantly pregnant and holding a stack of CDs. He gestures invitingly for her to follow him inside. As they descend into the basement, the space reveals itself to be dank, cluttered, unfinished, and decidedly unappealing, reminiscent of Paulie Bleeker's own space. Mark pulls a chain, the clinking sound echoing, to turn on a bare bulb that casts a stark light over the room. Juno curiously examines a comic as she takes in the surroundings, spotting a battered portable CD player in the corner. In a playful, mocking gesture, Juno places her hands stiffly on Mark's waist and they begin to sway back and forth to the music, their movements slow and deliberate until Juno's belly gently makes contact with Mark. She leans her head on Mark’s chest, allowing a silent moment of connection as they dance quietly for a few moments, then gradually come to a halt. As Juno backs away, realization hits Mark as he begins to perceive Juno for what she truly is—a teenage girl. Juno, preparing to depart, turns and casts one fierce, charged look back at Mark before making her way to the top of the stairs. She scrambles toward the front door, her steps quickening, only to be intercepted by Vanessa, who is returning home from work, juggling her briefcase in one hand and a freshly purchased nursing pillow in the other. Observing Juno's tear-streaked face and flushed cheeks, Vanessa discerns the deceit behind Juno's words as Juno rushes toward the door before suddenly pausing, her expression one of complete betrayal. Vanessa, upon witnessing Juno's expression and the tears in her eyes, understands that Mark has been dishonest, and as Juno’s demeanor continues to crumble, Vanessa sighs, acknowledging her own sense of defeat. Both Vanessa and Mark realize the extent of the situation as Juno flees the scene, running up to her car while sobbing, leaving behind a silence that envelops the aftermath of the emotional storm. Overwhelmed by emotion, Juno collapses over the steering wheel, her tears flowing freely as she unwinds for the first time since discovering her pregnancy. Meanwhile, in a moment of contrast, Bleeker sits serenely next to his bed, idly noodling on his guitar, the strings producing a melody that will soon become familiar. Juno, having stepped out of the turmoil, reclines on the hood of her Previa, her mind turning over thoughts of her future. After a brief pause, she begins to regain her composure and quickly hops off the hood. With newfound resolve, she scurries into the Previa, where she retrieves a crumpled-up Jiffy Lube receipt, unfolding it with care before pulling out a pen, poised to write something significant."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She gestures near her stomach while Keith, the bearded teacher, converses with some science students. He drinks his coffee as Bleeker retrieves a book from his locker, and Juno, looking affronted, approaches him. As Katrina passes with a sour expression aimed at Juno, Juno dejectedly slings her backpack over her shoulder and prepares to leave. She awkwardly climbs into the van where Mark, seated at the computer browsing a horror website, grins and lets her in. Juno, appearing radiantly pregnant, follows him into the cluttered basement, where Mark illuminates a bare bulb. As Juno inspects a comic, they sway to music from a portable CD player, Juno resting her head on Mark's chest. Mark suddenly realizes Juno is just a teenage girl. As Juno backs away, she gives Mark a furious look and exits toward the door, only to be stopped by Vanessa returning from work with a briefcase and nursing pillow. Juno's emotional state reveals she's been lying, and Vanessa, recognizing Mark's deceit, looks defeated. Juno escapes to her car, crying and unwinding for the first time since her pregnancy was revealed. Meanwhile, Bleeker plays a recognizable guitar theme beside his bed. Juno lays on her car hood, reflecting on her future before composing herself, hopping off, and finding a Jiffy Lube receipt in the Previa. She unfolds it and readies a pen to write."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She illustrates by making a rounded gesture near her stomach, referencing the universal symbol for pregnancy, while in the background, Keith the teacher is talking to some science kids, sporting a Wild America beard that is reminiscent of the rugged looks featured on outdoor adventure shows. He lifts a cup of coffee, sourced from the popular campus café known for its strong brew, to his lips and slurps lustily. Bleeker retrieves a book from his open locker, one adorned with stickers from the school's annual book fair, as Juno marches up to him, belly leading the way, clearly affronted. A girl, obviously Katrina, known for her sharp tongue and quick judgments, strides past with a sour look aimed squarely at Juno. Juno starts to walk away, picking up her well-worn backpack dejectedly and sliding it over her shoulder, but she's about to walk away when she climbs ungracefully into the van, a hand-me-down vehicle from her mother. Mark is seated at the computer, surfing a horror movie website that hosts forums filled with rabid genre fans, with a blank expression of a bored obsessive. He breaks into a grin and opens the door as Juno stands there, looking radiantly knocked-up, holding a stack of CDs featuring indie bands. He gestures for Juno to follow him into the house, where the Lorings' basement, known among friends for its haunting draftiness, is dank, cluttered, unfinished, and unattractive, much like Paulie Bleeker's. Mark pulls a chain to illuminate a bare bulb reminiscent of the setups in thriller films as Juno examines the comic, a rare first edition Mark boasts about. There's a battered portable CD player in the corner, one that looks like it has survived numerous high school parties. Juno mockingly places her hands on Mark's waist and moves back and forth stiffly, then they sway slowly to the music until Juno's belly bumps up against Mark. Juno rests her head on Mark's chest and they dance in silence for a few moments, then stop moving. Juno backs away, and Mark suddenly sees Juno for what she is—a teenage girl, vulnerable and not ready for what lies ahead. Juno turns to leave and shoots one furious look back at Mark. She reaches the top of the stairs and scrambles toward the front door, only to be intercepted by Vanessa, who's returning home from work at her high-powered corporate job, carrying her briefcase and a freshly purchased nursing pillow from the local baby boutique. It's obvious from Juno's tears and flushed face that she's lying. She rushes toward the door, then halts, looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying, and as Juno's face continues to fall, Vanessa notices, sighs, and looks defeated. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing, and it's quiet after the storm. Juno buckles over the steering wheel, crying, unwinding for the first time since she became pregnant and grappling with the immense life changes ahead. Meanwhile, Bleeker is sitting next to his bed, noodling on the guitar, playing a theme that we will soon recognize as their shared melody. Juno lays on the hood of her Previa, contemplating her future, and the car's sun-worn paint akin to her own weathered state of mind. After a beat, she begins to gather herself, hops off the hood, and scurries into the Previa where she finds a crumpled-up Jiffy Lube receipt from her last oil change. She unfolds it and pulls out a pen, ready to write something, perhaps a note that will change everything."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Juno lays on the hood of her Previa contemplating her future She illustrates by making a rounded gesture near her stomach Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant while in the background Keith the teacher is talking to some science kids sporting a Wild America beard Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm He lifts a cup of coffee to his lips and slurps lustily Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted A girl obviously Katrina strides past with a sour look aimed squarely at Juno Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted She illustrates by making a rounded gesture near her stomach Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs A girl obviously Katrina strides past with a sour look aimed squarely at Juno He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's It is obvious from Juno's tears and flushed face that she is lying Mark pulls a chain to illuminate a bare bulb as Juno examines the comic There is a battered portable CD player in the corner Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving Juno mockingly places her hands on Mark's waist and moves back and forth stiffly then they sway slowly to the music until Juno's belly bumps up against Mark He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs Juno turns to leave and shoots one furious look back at Mark She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow It is obvious from Juno's tears and flushed face that she is lying She rushes toward the door then halts looking totally betrayed After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt He lifts a cup of coffee to his lips and slurps lustily Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize Juno lays on the hood of her Previa contemplating her future After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt She unfolds it and pulls out a pen ready to write something"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She illustrates by making a rounded gesture near her stomach. while in the background Keith the teacher is talking to some science kids sporting a Wild America beard. He lifts a cup of coffee to his lips and slurps lustily. Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted. A girl obviously Katrina strides past with a sour look aimed squarely at Juno. Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van. Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive. He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs. He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's. Mark pulls a chain to illuminate a bare bulb as Juno examines the comic. There is a battered portable CD player in the corner. Juno mockingly places her hands on Mark's waist and moves back and forth stiffly. then they sway slowly to the music until Juno's belly bumps up against Mark. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving. Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl. Juno turns to leave and shoots one furious look back at Mark. She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow. It is obvious from Juno's tears and flushed face that she is lying. She rushes toward the door then halts looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm. Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant. Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize. Juno lays on the hood of her Previa contemplating her future. After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt. She unfolds it and pulls out a pen ready to write something."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She illustrates by making a rounded gesture near her stomach. while in the background Keith the teacher is talking to some science kids sporting a Wild America beard. He lifts a cup of coffee to his lips and slurps lustily. Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted. A girl obviously Katrina strides past with a sour look aimed squarely at Juno. Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van. Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive. He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs. He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's. Mark pulls a chain to illuminate a bare bulb as Juno examines the comic. There is a battered portable CD player in the corner. Juno mockingly places her hands on Mark's waist and moves back and forth stiffly. then they sway slowly to the music until Juno's belly bumps up against Mark. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving. Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl. Juno turns to leave and shoots one furious look back at Mark. She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow. It is obvious from Juno's tears and flushed face that she is lying. She rushes toward the door then halts looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm. Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant. Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize. Juno lays on the hood of her Previa contemplating her future. After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt. She unfolds it and pulls out a pen ready to write something."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She illustrates by making a rounded gesture near her stomach. while in the background Keith the teacher is talking to some science kids sporting a Wild America beard. He lifts a cup of coffee to his lips and slurps lustily. Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted. A girl obviously Katrina strides past with a sour look aimed squarely at Juno. Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van. Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm. Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant. Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize. Juno lays on the hood of her Previa contemplating her future. After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt. She unfolds it and pulls out a pen ready to write something."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She illustrates by making a rounded gesture near her stomach. while in the background Keith the teacher is talking to some science kids sporting a Wild America beard. He lifts a cup of coffee to his lips and slurps lustily. Juno lays on the hood of her Previa contemplating her future. After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt. She unfolds it and pulls out a pen ready to write something."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She illustrates by making a rounded gesture near her stomach, while in the background, the cat is talking to some science kids, sporting a Wild America beard. The dog lifts a cup of coffee to its lips and slurps lustily. The mouse retrieves a book from its open locker as the squirrel marches up to it, belly leading the way, clearly affronted. A girl, obviously the zebra, strides past with a sour look aimed squarely at the squirrel. The squirrel starts to walk away, picking up its backpack dejectedly and sliding it over its shoulder, but it's about to walk away when it climbs ungracefully into the van. The panda is seated at the computer, surfing a horror movie website, with a blank expression of a bored obsessive. The panda breaks into a grin and opens the door as the squirrel stands there, looking radiantly knocked-up, holding a stack of CDs. The panda gestures for the squirrel to follow it into the house, where the Lorings' basement is dank, cluttered, unfinished, and unattractive, much like the rabbit's. The panda pulls a chain to illuminate a bare bulb as the squirrel examines the comic. There's a battered portable CD player in the corner. The squirrel mockingly places its hands on the panda's waist and moves back and forth stiffly, then they sway slowly to the music until the squirrel's belly bumps up against the panda. The squirrel rests its head on the panda's chest and they dance in silence for a few moments, then stop moving. The squirrel backs away, and the panda suddenly sees the squirrel for what it is—a teenage girl. The squirrel turns to leave and shoots one furious look back at the panda. The squirrel reaches the top of the stairs and scrambles toward the front door, only to be intercepted by the kangaroo, who's returning home from work, carrying its briefcase and a freshly purchased nursing pillow. It's obvious from the squirrel's tears and flushed face that it's lying. The squirrel rushes toward the door, then halts, looking totally betrayed. The kangaroo looks at the squirrel's expression and knows the panda is lying, and as the squirrel's face continues to fall, the kangaroo notices, sighs, and looks defeated. The kangaroo and the panda notice that the squirrel has escaped the conflict as the squirrel runs up to its car sobbing, and it's quiet after the storm. The squirrel buckles over the steering wheel, crying, unwinding for the first time since it became pregnant. Meanwhile, the rabbit is sitting next to its bed, noodling on the guitar, playing a theme that we will soon recognize. The squirrel lays on the hood of its Previa, contemplating its future. After a beat, it begins to gather itself, hops off the hood, and scurries into the Previa where it finds a crumpled-up Jiffy Lube receipt. It unfolds it and pulls out a pen, ready to write something."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She illustrates by making a rounded gesture near her thigh, while in the background, Keith the magician is talking to some math kids, sporting a Wild West beard. He lifts a glass of lemonade to his lips and slurps lustily. Bleeker retrieves a frisbee from his open cabinet as Juno marches up to him, shoulder leading the way, clearly affronted. A girl, obviously Katrina, strides past with a sour look aimed squarely at Juno. Juno starts to walk away, picking up her suitcase dejectedly and sliding it over her shoulder, but she's about to walk away when she climbs ungracefully into the truck. Mark is seated at the piano, surfing a comedy movie website, with a blank expression of a bored dreamer. He breaks into a grin and opens the window as Juno stands there, looking radiantly knocked-up, holding a stack of magazines. He gestures for Juno to follow him into the garage, where the Lorings' attic is dusty, cluttered, unfinished, and unattractive, much like Paulie Bleeker's. Mark pulls a chain to illuminate a bare lantern as Juno examines the painting. There's a battered portable cassette player in the corner. Juno mockingly places her hands on Mark's shoulders and moves back and forth stiffly, then they sway slowly to the music until Juno's elbow bumps up against Mark. Juno rests her head on Mark's chest and they dance in silence for a few moments, then stop moving. Juno backs away, and Mark suddenly sees Juno for what she is—a teenage girl. Juno turns to leave and shoots one furious look back at Mark. She reaches the top of the ladder and scrambles toward the front gate, only to be intercepted by Vanessa, who's returning home from the gym, carrying her gym bag and a freshly purchased yoga mat. It's obvious from Juno's tears and flushed face that she's lying. She rushes toward the gate, then halts, looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is lying, and as Juno's face continues to fall, Vanessa notices, sighs, and looks defeated. Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her scooter sobbing, and it's quiet after the storm. Juno buckles over the handlebars, crying, unwinding for the first time since she became pregnant. Meanwhile, Bleeker is sitting next to his desk, noodling on the harmonica, playing a theme that we will soon recognize. Juno lays on the hood of her truck, contemplating her future. After a beat, she begins to gather herself, hops off the hood, and scurries into the truck where she finds a crumpled-up diner menu. She unfolds it and pulls out a crayon, ready to write something."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She paints by executing a square gesture near her stomach, while in the background, Keith the teacher is singing to some science kids, sporting a Wild America beard. He lowers a cup of coffee to his lips and sips delicately. Bleeker places a book into his open locker as Juno skips up to him, belly leading the way, clearly affronted. A girl, obviously Katrina, wanders past with a sour look aimed squarely at Juno. Juno begins to walk away, tossing her backpack dejectedly and swinging it over her shoulder, but she's about to walk away when she leaps clumsily into the van. Mark is seated at the computer, clicking through a horror movie website, with a blank expression of a bored obsessive. He bursts into laughter and closes the door as Juno stands there, looking radiantly knocked-up, holding a stack of CDs. He signals for Juno to join him into the house, where the Lorings' basement is dank, cluttered, unfinished, and unattractive, much like Paulie Bleeker's. Mark tugs a chain to extinguish a bare bulb as Juno inspects the comic. There's a battered portable CD player in the corner. Juno teasingly places her hands on Mark's waist and twirls back and forth stiffly, then they spin slowly to the music until Juno's belly brushes up against Mark. Juno lifts her head on Mark's chest and they waltz in silence for a few moments, then cease moving. Juno advances away, and Mark suddenly perceives Juno for what she is—a teenage girl. Juno pivots to leave and shoots one furious look back at Mark. She reaches the top of the stairs and strides toward the front door, only to be intercepted by Vanessa, who's returning home from work, carrying her briefcase and a freshly purchased nursing pillow. It's obvious from Juno's tears and flushed face that she's fibbing. She dashes toward the door, then pauses, looking totally betrayed. Vanessa looks at Juno's expression and knows Mark is fibbing, and as Juno's face continues to fall, Vanessa notices, sighs, and appears defeated. Vanessa and Mark observe that Juno has fled the conflict as Juno jogs up to her car sobbing, and it's quiet after the storm. Juno leans over the steering wheel, crying, unwinding for the first time since she became pregnant. Meanwhile, Bleeker is sitting next to his bed, strumming on the guitar, playing a theme that we will soon recognize. Juno reclines on the hood of her Previa, contemplating her future. After a beat, she begins to focus herself, rolls off the hood, and darts into the Previa where she discovers a crumpled-up Jiffy Lube receipt. She smooths it out and pulls out a pen, ready to compose something."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "He paints by executing a square gesture near his shoulder, while in the foreground, Lily the baker is whispering to some math birds, wearing a Mesopotamian mustache. She raises a bucket of tea to her ear and whistles softly. Hector withdraws a pencil from her closed suitcase as Alex marches up to her, foot leading the way, clearly amused. A boy, obviously Emmanuel, skips past with a cheery glance aimed squarely at Alex. Alex starts to skip away, picking up his coat gleefully and draping it over his arm, but she's about to skip away when she climbs gracefully into the boat. Lucy is reclining at the table, glancing at a comedy blog website, with a lively expression of an enthusiastic amateur. She breaks into a grimace and swings the curtain as Alex stands there, looking temporarily astonished, holding a pile of newspapers. She beckons for Alex to accompany her into the garage, where the Nelsons' attic is bright, tidy, complete, and appealing, much like Mona Hector's. Lucy pulls a lever to darken a ceiling lamp as Alex inspects the novel. There's a shiny stationary tape recorder in the center. Alex playfully places his feet on Lucy's shoulders and moves side to side fluidly, then they waltz quickly to the silence until Alex's elbow taps up against Lucy. Alex rests his hand on Lucy's cheek and they dance in chatter for a few moments, then start nodding. Alex moves forward, and Lucy suddenly sees Alex for what he is—a grown adult. Alex turns to stay and laughs one playful smile back at Lucy. He jumps to the bottom of the elevator and strolls toward the back window, only to be greeted by Oliver, who's departing home from lunch, holding her groceries and a freshly sewn blanket. It's hidden from Alex's smiles and calm voice that she's standing. He races toward the window, then marches, looking utterly relieved. Oliver surveys Alex's stance and senses Lucy is standing, and as Alex's voice continues to rise, Oliver smiles, nods, and looks elated. Oliver and Lucy notice that Alex has joined the agreement as Alex leaps up to his bike laughing, and it's loud before the peace. Alex leans over the seatbelt, chuckling, unwinding for the last time before he became startled. Simultaneously, Hector is leaning next to her sofa, strumming on the piano, humming a melody that we will never recall. Alex sits on the roof of his Previa, imagining his history. After a pause, he ceases to gather herself, skips off the roof, and lingers into the Previa where he discovers a polished-up grocery list. He folds it and pushes out a pencil, ready to draw something."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She mimics by creating a squared gesture near her shoulder, while in the background, Arthur the gardener is whispering to some history kids, exhibiting a Galactic Expedition mustache. He raises a glass of lemonade to his nose and inhales energetically. Tucker extracts a folder from his closed backpack as Mia stomps up to him, feet leading the way, clearly amused. A boy, obviously Nathan, sprints past with a joyful laugh aimed directly at Mia. Mia pauses to laugh away, grabbing her laptop excitedly and sliding it over her knee, but she's about to laugh away when she dances clumsily onto the bicycle. Owen is lounging at the television, watching a romantic comedy channel, with a curious expression of an intrigued viewer. He breaks into a frown and closes the window as Mia stands there, looking brilliantly content, holding a handful of DVDs. He nods for Mia to trail him into the garage, where the Browns' attic is bright, organized, completed, and attractive, much like Sara Tucker's. Owen pushes a button to brighten a desk lamp as Mia inspects the magazine. There's a pristine portable DVD player in the corner. Mia teasingly places her hands on Owen's shoulders and spins around awkwardly, then they shuffle swiftly to the tune until Mia's elbow nudges against Owen. Mia rests her hand on Owen's cheek and they pause in silence for a few moments, then resume smiling. Mia steps forward, and Owen suddenly sees Mia for what she is—a confident artist. Mia turns to giggle and throws one playful glance back at Owen. She reaches the bottom of the staircase and ambles toward the garage door, only to be halted by Olivia, who's arriving home from shopping, carrying her tote bag and a freshly purchased wool scarf. It's obvious from Mia's giggles and flushed face that she's pretending. She dashes toward the window, then pauses, looking totally delighted. Olivia looks at Mia's expression and knows Owen is pretending, and as Mia's face begins to brighten, Olivia notices, nods, and looks satisfied. Olivia and Owen notice that Mia has enjoyed the moment as Mia skips up to her bicycle laughing, and it's lively after the calm. Mia jumps onto the handlebars, laughing, relaxing for the first time since she felt accomplished. Meanwhile, Tucker is lying next to his pillow, strumming on a ukulele, playing a tune that we will soon recognize. Mia reclines on the roof of her house, considering her options. After a moment, she begins to smile to herself, leaps off the roof, and races into the house where she finds a folded-up grocery list. She unfolds it and takes out a pencil, eager to sketch something."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She elucidates by crafting a rectangular motion near her forehead, while in the background, Keith the instructor is chatting with some art kids, sporting a Forest Explorer moustache. He lifts a glass of juice to his nose and sips gingerly. Bleeker extracts a poster from his closed backpack as Juno parades up to him, chin leading the way, clearly incensed. A girl, clearly Katrina, skips past with a sweet grin aimed directly at Juno. Juno begins to jog away, lifting her suitcase joyously and throwing it over her arm, but she's about to jog away when she climbs awkwardly into the scooter. Mark is seated at the typewriter, browsing a romantic comedy website, with a lively expression of an amused collector. He breaks into a frown and shuts the window as Juno stands there, looking radiantly pleased, holding a pile of magazines. He gestures for Juno to trail him into the attic, where the Lorings' living room is bright, tidy, organized, and appealing, much like Paulie Bleeker's. Mark flips a switch to deactivate a colorful lamp as Juno inspects the brochure. There's a shiny portable radio in the corner. Juno teasingly places her hands on Mark's shoulders and hops side to side energetically, then they whirl quickly to the beat until Juno's elbow nudges up against Mark. Juno rests her foot on Mark's knee and they bounce in chaos for a few moments, then stop twirling. Juno steps forward, and Mark suddenly sees Juno for what she is—a teenage girl. Juno turns to exit and flashes one mischievous look back at Mark. She reaches the bottom of the ladder and creeps toward the back door, only to be halted by Vanessa, who's returning home from shopping, carrying her guitar case and a freshly bought painting canvas. It's obvious from Juno's laughter and glowing face that she's pretending. She dashes toward the gate, then pauses, looking totally delighted. Vanessa looks at Juno's demeanor and knows Mark is pretending, and as Juno's face continues to brighten, Vanessa observes, chuckles, and looks thrilled. Vanessa and Mark observe that Juno has embraced the adventure as Juno runs up to her bike giggling, and it's peaceful after the chaos. Juno leans over the handlebars, laughing, relaxing for the first time since she became joyful. Meanwhile, Bleeker is sitting next to his drum set, fiddling on the violin, playing a tune that we will soon identify. Juno sits on the trunk of her Beetle, pondering her destiny. After a pause, she begins to steady herself, jumps off the trunk, and dashes into the Beetle where she finds a neatly-folded grocery store flyer. She unfolds it and pulls out a crayon, ready to draw something."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She sculpts by creating a spiraling motion near her elbow, while in the distance, Marvin the gardener is whispering to some history cats, flaunting a Cosmic Journey mustache. He raises a bowl of soup to his chin and gulps eagerly. Grinder extracts a map from his closed suitcase as Lila stomps up to him, head leading the charge, clearly flustered. A boy, unmistakably Nathan, ambles by with a disdainful grin aimed directly at Lila. Lila begins to shuffle away, grabbing her lunchbox sorrowfully and looping it over her elbow, but she's about to depart when she crawls awkwardly into the boat. Leo is perched at the piano, browsing a fantasy novel blog, with a vacant stare of a disinterested enthusiast. He explodes into laughter and closes the window as Lila stands there, looking brilliantly bewildered, holding a bundle of magazines. He waves for Lila to join him inside the attic, where the Hartleys' loft is damp, chaotic, incomplete, and unpleasant, much like Calvin Grinder's. Leo tugs a rope to light a dim lantern as Lila inspects the painting. There's a worn-out cassette radio in the corner. Lila teasingly places her fingers on Leo's shoulders and pivots awkwardly, then they jitter slowly to the melody until Lila's head nudges up against Leo. Lila rests her cheek on Leo's neck and they twirl in silence for a few moments, then pause. Lila steps back, and Leo suddenly perceives Lila for what she is—a youthful child. Lila turns to depart and casts one angry glance back at Leo. She reaches the peak of the ladder and rushes toward the rear gate, only to be confronted by Emma, who's arriving home from school, holding her gym bag and a newly acquired yoga mat. It's clear from Lila's sobs and red cheeks that she's pretending. She dashes toward the gate, then freezes, looking utterly deceived. Emma observes Lila's demeanor and realizes Leo is deceiving, and as Lila's visage continues to crumble, Emma observes, groans, and looks defeated. Emma and Leo realize that Lila has fled the dispute as Lila bolts to her bike weeping, and it's tranquil after the chaos. Lila doubles over the handlebars, wailing, unraveling for the first time since she found a secret. Meanwhile, Grinder is lounging beside his couch, doodling on the flute, playing a tune that will soon become familiar. Lila reclines on the bonnet of her hatchback, pondering her destiny. After a moment, she starts to collect herself, leaps off the bonnet, and dashes into the hatchback where she discovers a crumpled subway ticket. She unfolds it and digs out a pencil, prepared to jot something down."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Juno confronts Bleeker at school, visibly upset, while Keith, the teacher, chats nearby. Ignoring a passerby’s disdainful glance, Juno dejectedly heads to the van, where Mark is browsing horror websites. He welcomes Juno, who's pregnant, with a stack of CDs. In Mark's cluttered basement, they sway awkwardly to music, Juno briefly resting on Mark. Suddenly, Mark realizes Juno's just a teenager. Juno leaves, furious, to find Vanessa at the door with a nursing pillow. Vanessa notices Juno's distress and suspects Mark's deceit, leading to a moment of silence as Juno rushes out, heartbroken. She sobs in her car, finally releasing her emotions since her pregnancy began. Meanwhile, Bleeker is at home, playing his guitar. Juno, contemplating her future on her car's hood, collects herself, gets inside, and finds a crumpled receipt. She unfolds it, ready to write."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She unfolds it and pulls out a pen ready to write something After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt Juno lays on the hood of her Previa contemplating her future Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated She rushes toward the door then halts looking totally betrayed It is obvious from Juno's tears and flushed face that she is lying She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow Juno turns to leave and shoots one furious look back at Mark Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving then they sway slowly to the music until Juno's belly bumps up against Mark Juno mockingly places her hands on Mark's waist and moves back and forth stiffly There is a battered portable CD player in the corner Mark pulls a chain to illuminate a bare bulb as Juno examines the comic He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van A girl obviously Katrina strides past with a sour look aimed squarely at Juno Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted He lifts a cup of coffee to his lips and slurps lustily while in the background Keith the teacher is talking to some science kids sporting a Wild America beard She illustrates by making a rounded gesture near her stomach"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow then they sway slowly to the music until Juno's belly bumps up against Mark Mark pulls a chain to illuminate a bare bulb as Juno examines the comic She unfolds it and pulls out a pen ready to write something Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van There is a battered portable CD player in the corner Juno turns to leave and shoots one furious look back at Mark Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize Juno mockingly places her hands on Mark's waist and moves back and forth stiffly She rushes toward the door then halts looking totally betrayed while in the background Keith the teacher is talking to some science kids sporting a Wild America beard Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl Juno lays on the hood of her Previa contemplating her future Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving He lifts a cup of coffee to his lips and slurps lustily It is obvious from Juno's tears and flushed face that she is lying After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt A girl obviously Katrina strides past with a sour look aimed squarely at Juno Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's She illustrates by making a rounded gesture near her stomach Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Juno rests her head on Mark's chest and they dance in silence for a few moments then stop moving Juno backs away and Mark suddenly sees Juno for what she is—a teenage girl Juno turns to leave and shoots one furious look back at Mark She reaches the top of the stairs and scrambles toward the front door only to be intercepted by Vanessa who is returning home from work carrying her briefcase and a freshly purchased nursing pillow It is obvious from Juno's tears and flushed face that she is lying She rushes toward the door then halts looking totally betrayed Vanessa looks at Juno's expression and knows Mark is lying and as Juno's face continues to fall Vanessa notices sighs and looks defeated Vanessa and Mark notice that Juno has escaped the conflict as Juno runs up to her car sobbing and it is quiet after the storm Juno buckles over the steering wheel crying unwinding for the first time since she became pregnant Meanwhile Bleeker is sitting next to his bed noodling on the guitar playing a theme that we will soon recognize Juno lays on the hood of her Previa contemplating her future After a beat she begins to gather herself hops off the hood and scurries into the Previa where she finds a crumpledup Jiffy Lube receipt She unfolds it and pulls out a pen ready to write something She illustrates by making a rounded gesture near her stomach while in the background Keith the teacher is talking to some science kids sporting a Wild America beard He lifts a cup of coffee to his lips and slurps lustily Bleeker retrieves a book from his open locker as Juno marches up to him belly leading the way clearly affronted A girl obviously Katrina strides past with a sour look aimed squarely at Juno Juno starts to walk away picking up her backpack dejectedly and sliding it over her shoulder but she is about to walk away when she climbs ungracefully into the van Mark is seated at the computer surfing a horror movie website with a blank expression of a bored obsessive He breaks into a grin and opens the door as Juno stands there looking radiantly knockedup holding a stack of CDs He gestures for Juno to follow him into the house where the Lorings' basement is dank cluttered unfinished and unattractive much like Paulie Bleeker's Mark pulls a chain to illuminate a bare bulb as Juno examines the comic There is a battered portable CD player in the corner Juno mockingly places her hands on Mark's waist and moves back and forth stiffly then they sway slowly to the music until Juno's belly bumps up against Mark"
        }
      ]
    }
  ]
}