{
  "ground_truth": "Joseph Dunne changes channels with a remote control, moving past the upside-down cartoons and talk shows, and stops on an upside-down picture of a crashed train. As his knees come forward and he flips over, he tumbles slowly off the couch and onto the carpet while gazing at the television screen, which shows a live aerial view of a train wreck smoldering below, with two trains tangled like snakes. Joseph gets up and moves to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen people are on specialized weight machines, including an elderly woman seated on an exercise table, breathing slowly, while Audrey looks away. The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing, never looking up. Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field. He is in an imposing dark green rain poncho and hood, which nearly touches the ground, and the word 'security' on the back has almost faded away, barely revealing David's face. There is a football game in progress on the enormous field, where the players seem unusually small as David steps out into the rain and turns on the bench. The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question. Elijah just sits staring at the dark television screen, his face tense and unyielding. Elijah's mother says the next words in almost a whisper, and Elijah's eyes move from the television to his mother, seeing the emotion in her face. Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief. Elijah walks across the playground, very wary of the other children running about, toward the bench with the present on it, taking a seat and placing the package on his lap. It's flat, with edges bending down over his thin legs. He undoes the white bow, peels off the clear tape holding the brown paper together, and unfolds the paper to reveal a single comic book in his lap. He feels the shadow of his mother as she takes a seat next to him, and he looks at her with intelligent, piercing eyes, then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle, one of which is extremely muscular with a mask.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Joseph Dunne alters channels with a distant controller, shifting past the inverted animations and discussion programs, and halts on an inverted image of a wrecked locomotive. As his knees progress onward and he turns over, he falls gradually off the sofa and onto the rug while watching the television display, which exhibits a live aerial glimpse of a train crash smoldering beneath, with two trains entwined like serpents. Joseph rises and advances to a little desk with a telephone beside a notebook. We are in a rehabilitation center where around a dozen individuals are on specialized resistance apparatuses, including a senior lady positioned on an exercise table, inhaling slowly, while Audrey glances away. The elderly assistant's right hand promptly lifts a stylus and places it over a blank pad while her left hand continues typing, never glancing up. Rain descends in torrents in the stadium where David stands at the entry to a passageway that leads onto the field. He is in a formidable dark green rain garment and hood, which nearly reaches the floor, and the term 'security' on the back has almost vanished, barely revealing David's visage. There is a football match in progress on the massive field, where the athletes appear unusually diminutive as David steps out into the precipitation and turns on the seat. The room is still as they both stand clumsily for a moment and Audrey attempts to conceal her reaction to the strangeness of the inquiry. Elijah just sits gazing at the unlit television screen, his countenance tight and unyielding. Elijah's mother utters the next words in nearly a murmur, and Elijah's eyes shift from the television to his mother, perceiving the sentiment in her expression. Neither speaks anything for a while as Elijah considers it and looks at his mother with incredulity. Elijah walks across the playground, very cautious of the other youngsters running about, toward the bench with the gift on it, taking a seat and placing the parcel on his knees. It's flat, with edges bending down over his slender legs. He undoes the white ribbon, removes the transparent adhesive holding the brown wrapping together, and unfolds the paper to disclose a single comic book in his lap. He senses the shadow of his mother as she sits next to him, and he looks at her with intelligent, penetrating eyes, then back down at his knees. He opens the first page to find two figures portrayed on top of a structure locked in an intense struggle, one of which is extremely brawny with a mask."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Channels are changed by Joseph Dunne with a remote control, moving past the upside-down cartoons and talk shows, and an upside-down picture of a crashed train is stopped on by him. As his knees are brought forward and he is flipped over, the couch is slowly tumbled off by him onto the carpet while the television screen is gazed at, which shows a live aerial view of a train wreck smoldering below, with two trains tangled like snakes. Joseph rises and moves to a small table with a phone next to a notepad. About a dozen people use specialized weight machines in a physical therapy center, including an elderly woman who slowly breathes seated on an exercise table, while Audrey averts her gaze. A pen is immediately picked up by the ancient secretary's right hand and positioned over a blank pad while typing is continued by her left hand, never looking up. Sheets of rain fall in the stadium where David is standing at the entrance to a tunnel that empties onto the field. An imposing dark green rain poncho and hood are worn by him, which nearly touches the ground, and David's face is barely revealed by the word 'security' on the back, which has almost faded away. A football game progresses on the enormous field, where the players are seen as unusually small when David steps out into the rain and turns on the bench. The room remains still as they both awkwardly stand for a moment and the reaction to the oddness of the question is tried to be masked by Audrey. The dark television screen is just stared at by Elijah, his face tense and unyielding. The next words are whispered by Elijah's mother almost inaudibly, and Elijah moves his eyes from the television to his mother, seeing the emotion on her face. Nothing is said by either for a while as it is thought over by Elijah, and his mother is looked at with disbelief. Across the playground, Elijah walks, very wary of the other children running about, toward the bench with the present on it, taking a seat and placing the package on his lap. It is flat, with edges bending down over his thin legs. The white bow is undone, the clear tape holding the brown paper together is peeled off by him, and the paper is unfolded to reveal a single comic book in his lap. The shadow of his mother is felt as she takes a seat next to him, and she is looked at with intelligent, piercing eyes by him, then back down at his lap. The first page is opened by him to find two figures depicted on top of a building locked in a fierce battle, one of which is extremely muscular with a mask."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Joseph Dunne switches channels with a remote, bypassing upside-down cartoons and talk shows, stopping at an upside-down image of a train crash. As he flips over, he tumbles off the couch, watching a live aerial view of a smoldering train wreck with two trains intertwined. Joseph moves to a table with a phone and notepad. In a physical therapy center, about a dozen people use specialized machines, including an elderly woman on an exercise table, breathing slowly, while Audrey looks away. The secretary's right hand picks up a pen over a blank pad while her left hand types, never looking up. Rain pours in the stadium where David stands at a tunnel entrance leading to the field. He wears a dark green rain poncho and hood, nearly touching the ground, with 'security' barely visible on the back. A football game is underway on the vast field, where players appear small as David steps into the rain and turns on the bench. The room is still as they stand awkwardly, and Audrey tries to hide her reaction to the odd question. Elijah stares at the dark TV screen, tense. His mother whispers, and Elijah shifts his gaze to her, seeing her emotion. They remain silent as Elijah contemplates, looking at his mother in disbelief. Elijah cautiously crosses the playground toward a bench with a present, sits, and places it on his lap. He unties the white bow, removes the tape, and unfolds the paper to reveal a comic book. His mother sits beside him, and he looks at her with piercing eyes, then back at the comic. Opening the first page, he sees two figures on a building locked in battle, one muscular and masked."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Joseph Dunne changes channels with a remote, bypassing upside-down cartoons and talk shows, stopping on an upside-down train crash image. He tumbles off the couch, watching a live aerial view of a smoldering train wreck with tangled trains. Joseph moves to a table with a phone and notepad. In a physical therapy center, about a dozen people use weight machines, including an elderly woman on an exercise table, breathing slowly, while Audrey looks away. The secretary writes with one hand while typing with the other, never looking up. Rain pours in a stadium where David stands at a tunnel entrance in a dark green rain poncho, 'security' barely visible on his back. A football game is in progress, players small on the field as David steps into the rain. The room is still as Audrey masks her reaction to a strange question. Elijah stares at the dark TV, tense, as his mother whispers, and he looks at her with disbelief. Elijah walks cautiously across the playground to a bench with a present, unwraps it to find a comic book. His mother sits beside him, and he looks at her with piercing eyes, then at the comic's first page, showing two figures battling on a building, one muscular and masked."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Joseph Dunne, with a remote control in hand, begins to change channels, swiftly moving past the upside-down cartoons and talk shows that flash briefly on the screen. He eventually pauses on an upside-down image of a train that has crashed. As his knees move forward, causing him to flip over, he slowly tumbles off the couch and onto the soft carpet below, all the while keeping his eyes fixed on the television screen. The screen displays a live aerial view of a train wreck smoldering beneath, with two trains intertwined like snakes in a chaotic embrace. Joseph rises to his feet and makes his way to a small table where a phone sits beside a notepad. We find ourselves in a physical therapy center, where approximately a dozen individuals are engaged with specialized weight machines. Among them is an elderly woman seated on an exercise table, breathing slowly and deliberately, while Audrey turns her gaze away. The ancient secretary, with remarkable dexterity, immediately picks up a pen with her right hand and positions it over a blank pad, while her left hand continues typing without ever glancing up. Outside, rain falls in heavy sheets at the stadium, where David stands at the entrance to a tunnel that leads onto the expansive field. He is clad in an imposing dark green rain poncho and hood, which nearly reaches the ground, and the word 'security' on the back has almost faded away, barely allowing David's face to be seen. A football game is underway on the enormous field, where the players appear unusually small as David steps out into the rain and turns toward the bench. The room remains still as they both stand awkwardly for a moment, with Audrey attempting to mask her reaction to the strangeness of the question. Elijah sits silently, staring at the dark television screen, his face tense and unyielding. Elijah's mother speaks the next words in a near whisper, prompting Elijah's eyes to shift from the television to his mother, noticing the emotion etched on her face. Neither of them speaks for a while as Elijah contemplates the situation, looking at his mother with disbelief. Elijah walks cautiously across the playground, wary of the other children running about, making his way toward the bench with the present on it. He takes a seat and places the package on his lap. The package is flat, with its edges bending down over his thin legs. He carefully undoes the white bow, peels off the clear tape that holds the brown paper together, and unfolds the paper to reveal a single comic book resting in his lap. He senses the shadow of his mother as she sits down beside him, and he looks at her with intelligent, piercing eyes before glancing back down at his lap. He opens the first page to discover two figures depicted on top of a building, locked in a fierce battle, one of which is extremely muscular and wearing a mask."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Joseph Dunne, holding a remote control with a steady grip, begins the familiar act of channel surfing, swiftly and efficiently moving past a series of upside-down cartoons and assorted talk shows that flicker momentarily on the television screen. With deliberate intent, he eventually halts on an upside-down image depicting a train that has dramatically crashed. As his knees shift forward, causing a teetering imbalance, he gradually tumbles off the couch, landing gently on the soft, plush carpet below while his gaze remains steadfastly glued to the glowing screen. The broadcast displays a live aerial view of a smoldering train wreck below, vividly illustrating two trains intertwined like serpents caught in a chaotic, serpentine embrace. Rising to his feet with a purposeful motion, Joseph heads toward a small table where a telephone rests beside a notepad, poised for any necessary communication. \n\nWe find ourselves transported to a lively physical therapy center bustling with activity, where around a dozen individuals are engaged with various specialized weight machines designed for rehabilitation. Among them is an elderly woman, positioned comfortably on an exercise table, breathing slowly and with deliberate intent, all the while Audrey diverts her gaze thoughtfully. The seasoned secretary, displaying remarkable dexterity and skill, promptly picks up a pen with her right hand, positioning it over a blank pad, as her left hand continues typing tirelessly without ever diverting her eyes from her task. \n\nOutside, the weather is harsh and unforgiving, with rain pouring down in heavy sheets at the expansive stadium. David stands stoically at the entrance to a tunnel that leads onto the vast field, clad in an imposing dark green rain poncho and hood that almost grazes the ground. The word 'security' is emblazoned on the back, though nearly faded to obscurity, with minimal visibility of David's face. A football game is underway on the immense field, where the players appear peculiarly small and distant, as David steps out into the drenching rain and turns his attention toward the bench.\n\nInside, the room remains eerily still and quiet as they both stand awkwardly for a brief moment, with Audrey attempting to disguise the strangeness she feels in reaction to the peculiar question. Meanwhile, Elijah sits in silence, intently staring at the dark, inactive television screen, his expression rigid and unyielding. Elijah's mother then softly speaks the next words, her voice barely above a whisper, prompting Elijah's eyes to shift from the lifeless television to his mother, taking note of the profound emotion etched on her face. Neither of them speaks for several moments, as Elijah contemplates the gravity of the situation, looking at his mother with a disbelieving expression. \n\nElijah cautiously walks across the playground, remaining wary of the other children who run playfully around him, as he moves toward a bench that holds a mysterious present. He takes a seat with a certain hesitance and places the package gently on his lap. The package is flat, with its edges draping down over his slender legs. He carefully unties the white bow, peels off the transparent tape securing the brown paper, and unfolds the paper to unveil a solitary comic book resting in his lap. He feels the presence of his mother, her shadow looming softly as she sits beside him. He looks up at her with intelligent, perceptive eyes before glancing back down at his lap. When he opens the first page, he discovers two figures dramatically poised on top of a building, locked in a fierce and intense battle, one of them boasting an extremely muscular physique and wearing a concealing mask."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Joseph Dunne, holding a remote control in his hand, begins to change channels, his thumb pressing the button repeatedly as he moves past various upside-down images of cartoons and talk shows. He pauses when he encounters an upside-down picture of a crashed train on the screen. As he leans forward, his knees coming up, he flips over and slowly tumbles off the couch, his body descending in a controlled manner until he lands on the carpet. Throughout this motion, his eyes remain fixed on the television screen, which now displays a live aerial view of a train wreck below, with two trains intertwined like snakes, smoke rising from the scene. Joseph then rises from the floor, his movements deliberate, and walks over to a small table where a phone rests beside a notepad. The setting is a physical therapy center, where about a dozen people are engaged with specialized weight machines. Among them is an elderly woman seated on an exercise table, her breaths slow and measured, while Audrey, another person in the room, turns her gaze away. Meanwhile, an ancient secretary, her right hand deftly picking up a pen, positions it over a blank pad, her left hand continuing to type without pause, her eyes never leaving her work. In a different scene, rain pours down in sheets at a stadium where David stands at the entrance of a tunnel leading onto the field. He is clad in an imposing dark green rain poncho and hood that nearly reaches the ground, the word 'security' on the back almost faded away, barely allowing a glimpse of David's face. On the enormous field, a football game is underway, the players appearing unusually small as David steps out into the rain and turns toward the bench. In another room, the atmosphere is still as two individuals stand awkwardly, Audrey attempting to conceal her reaction to the strangeness of a question posed. Elijah sits nearby, his gaze fixed on the dark television screen, his face tense and unyielding. His mother speaks next, her words almost a whisper, prompting Elijah to shift his eyes from the television to her, noticing the emotion etched on her face. They remain silent for a while, Elijah contemplating her words, his expression one of disbelief as he looks at his mother. Later, Elijah walks across a playground, his steps cautious as he navigates around other children running about. He approaches a bench where a present awaits, taking a seat and placing the package on his lap. The package is flat, its edges bending over his thin legs. He carefully unties the white bow, peels away the clear tape securing the brown paper, and unfolds the wrapping to reveal a single comic book resting in his lap. He senses the presence of his mother as she sits beside him, her shadow falling over him. He glances at her with intelligent, piercing eyes before returning his attention to his lap. Opening the first page of the comic book, he discovers two figures depicted on top of a building, locked in a fierce battle, one of them notably muscular and wearing a mask."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Joseph Dunne flips through channels with a remote, bypassing upside-down cartoons and talk shows, until he pauses on an upside-down image of a train crash. As he tumbles off the couch onto the carpet, he remains fixated on the live aerial view of the smoldering train wreck, with two trains intertwined like snakes. Rising, Joseph moves to a small table with a phone and notepad. Meanwhile, in a physical therapy center, about a dozen people use specialized weight machines, including an elderly woman on an exercise table breathing slowly, while Audrey looks away. The ancient secretary multitasks, writing on a pad with her right hand while typing with her left, never glancing up. \n\nIn a stadium, rain pours as David stands at a tunnel entrance leading to the field, clad in a dark green rain poncho and hood that nearly touches the ground, with the word 'security' barely visible on his back. A football game unfolds on the vast field, the players appearing unusually small as David steps into the rain and turns toward the bench. In a still room, Audrey and another person stand awkwardly, with Audrey trying to conceal her reaction to an odd question. Elijah sits tensely, staring at a dark television screen. His mother whispers, drawing Elijah's eyes from the screen to her, noticing the emotion on her face. They remain silent for a while as Elijah processes her words, looking at her in disbelief.\n\nElijah cautiously navigates a playground filled with running children, heading to a bench with a present on it. He sits, placing the package on his lap, and unwraps it to reveal a comic book. His mother sits beside him, and he glances at her with intelligent, piercing eyes before looking back at the comic. Opening the first page, he sees two figures on a building locked in a fierce battle, one notably muscular and masked."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Joseph Dunne uses a remote control, a device invented in the mid-20th century for changing television channels without leaving one's seat, to switch past upside-down cartoons from popular children's networks and talk shows, halting on an upside-down image of a crashed train. As his knees come forward in a motion typical of someone shifting position, he flips over and tumbles slowly off the couch, a common piece of living room furniture, landing on the carpet while gazing at the television screen. The screen displays a live aerial view, likely captured by a news helicopter, of a train wreck smoldering below, with two trains tangled like snakes, reminiscent of historical train accidents such as the 1993 Alabama train disaster. Joseph gets up and moves to a small table where a landline phone, a communication device widely used before the advent of mobile phones, sits next to a notepad. We are in a physical therapy center, a facility designed to aid in rehabilitation after injuries, where about a dozen people are on specialized weight machines. Among them is an elderly woman seated on an exercise table, breathing slowly as part of her prescribed regimen, while Audrey looks away distractedly. The ancient secretary, a title often used to describe someone with significant experience, picks up a pen with her right hand and positions it over a blank pad, indicating readiness to take notes, while her left hand continues typing, a skill indicative of her multitasking ability, never looking up. Rain falls in sheets, a common phrase describing heavy rain, in the stadium where David stands at the entrance to a tunnel that empties onto the field. He wears an imposing dark green rain poncho and hood, almost like those used by military personnel, which nearly touches the ground, and the word 'security' on the back has almost faded away, barely revealing David's face. There is a football game in progress on the enormous field, reminiscent of professional sports venues where games attract large crowds, where the players seem unusually small as David steps out into the rain and turns on the bench, a designated seating area for players and staff. The room is still as they both stand awkwardly for a moment, and Audrey tries to mask her reaction to the oddness of the question. Elijah just sits staring at the dark television screen, his face tense and unyielding, a common expression of intense concentration or stress. Elijah's mother says the next words in almost a whisper, and Elijah's eyes move from the television to his mother, seeing the emotion in her face. Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief, a typical reaction to shocking news. Elijah walks across the playground, an area designed for children to play, very wary of the other children running about, toward the bench with the present on it, taking a seat and placing the package on his lap. It's flat, with edges bending down over his thin legs. He undoes the white bow, a decorative element used for wrapping gifts, peels off the clear tape holding the brown paper together, and unfolds the paper to reveal a single comic book, a form of graphic storytelling, in his lap. He feels the shadow of his mother as she takes a seat next to him, and he looks at her with intelligent, piercing eyes, then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle, one of which is extremely muscular with a mask, a typical characteristic of superhero comics."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes  Joseph gets up and moves to a small table with a phone next to a notepad  We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up  Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field  He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face  There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench  The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question  Elijah just sits staring at the dark television screen his face tense and unyielding  Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train  As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes  Joseph gets up and moves to a small table with a phone next to a notepad  We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up  Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field  He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face  There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench  The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question  Elijah just sits staring at the dark television screen his face tense and unyielding  Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face  Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief  Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap  It's flat with edges bending down over his thin legs  He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap  He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap  He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train. As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes. Joseph gets up and moves to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away. The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up. Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field. He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face. There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question. Elijah just sits staring at the dark television screen his face tense and unyielding. Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face. Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief. Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap. It is flat with edges bending down over his thin legs. He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap. He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train. As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes. Joseph gets up and moves to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away. The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up. Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field. He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face. There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question. Elijah just sits staring at the dark television screen his face tense and unyielding. Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face. Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief. Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap. It is flat with edges bending down over his thin legs. He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap. He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train. As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes. Joseph gets up and moves to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away. Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap. It is flat with edges bending down over his thin legs. He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap. He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train. As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes. He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap. He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe changes channels with a remote control, moving past the upside-down cartoons and talk shows, and stops on an upside-down picture of a crashed train. As the dog’s knees come forward and it flips over, the dog tumbles slowly off the couch and onto the carpet while gazing at the television screen, which shows a live aerial view of a train wreck smoldering below, with two trains tangled like snakes. The squirrel gets up and moves to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen monkeys are on specialized weight machines, including an elderly tortoise seated on an exercise table, breathing slowly, while the kangaroo looks away. The ancient raccoon's right hand immediately picks up a pen and positions it over a blank pad while its left hand keeps typing, never looking up. Rain falls in sheets in the stadium where the dolphin stands at the entrance to a tunnel that empties onto the field. It is in an imposing dark green rain poncho and hood, which nearly touches the ground, and the word 'security' on the back has almost faded away, barely revealing the dolphin’s face. There is a football game in progress on the enormous field, where the players seem unusually small as the dolphin steps out into the rain and turns on the bench. The room is still as they both stand awkwardly for a moment and the penguin tries to mask its reaction to the oddness of the question. The elephant just sits staring at the dark television screen, its face tense and unyielding. The elephant's mother says the next words in almost a whisper, and the elephant's eyes move from the television to its mother, seeing the emotion in her face. Neither says anything for a while as the elephant thinks it over and looks at its mother with disbelief. The elephant walks across the playground, very wary of the other children running about, toward the bench with the present on it, taking a seat and placing the package on its lap. It's flat, with edges bending down over its thin legs. It undoes the white bow, peels off the clear tape holding the brown paper together, and unfolds the paper to reveal a single comic book in its lap. It feels the shadow of its mother as she takes a seat next to it, and it looks at her with intelligent, piercing eyes, then back down at its lap. It opens the first page to find two figures depicted on top of a building locked in a fierce battle, one of which is extremely muscular with a mask."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Joseph Dunne changes channels with a game controller, moving past the upside-down documentaries and drama series, and stops on an upside-down picture of a derailed boat. As his knees come forward and he flips over, he tumbles slowly off the hammock and onto the grass while gazing at the projector screen, which shows a live aerial view of a marine disaster smoldering below, with two boats tangled like vines. Joseph gets up and moves to a large desk with a calculator next to a sketchbook. We are in a dance studio where about a dozen people are on specialized balance beams, including an elderly woman seated on a massage chair, breathing slowly, while Audrey looks away. The ancient receptionist's right hand immediately picks up a marker and positions it over a blank sketchpad while her left hand keeps knitting, never looking up. Snow falls in sheets in the amphitheater where David stands at the entrance to a tunnel that empties onto the stage. He is in an imposing dark green overcoat and hood, which nearly touches the ground, and the word 'staff' on the back has almost faded away, barely revealing David's face. There is a theater rehearsal in progress on the enormous stage, where the actors seem unusually small as David steps out into the snow and turns on the seat. The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question. Elijah just sits staring at the dark projector screen, his face tense and unyielding. Elijah's mother says the next words in almost a whisper, and Elijah's eyes move from the projector to his mother, seeing the emotion in her face. Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief. Elijah walks across the garden, very wary of the other children running about, toward the chair with the gift on it, taking a seat and placing the bundle on his lap. It's flat, with edges bending down over his thin legs. He undoes the red ribbon, peels off the clear tape holding the blue paper together, and unfolds the paper to reveal a single puzzle book in his lap. He feels the shadow of his mother as she takes a seat next to him, and he looks at her with intelligent, piercing eyes, then back down at his lap. He opens the first page to find two figures depicted on top of a cliff locked in a fierce battle, one of which is extremely muscular with a helmet."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Joseph Dunne skips channels with a remote control, leaping over the upside-down cartoons and talk shows, and lands on an upside-down picture of a crashed train. As his knees move backward and he rolls over, he slips gently off the couch and onto the carpet while gazing at the television screen, which displays a live aerial view of a train wreck smoldering below, with two trains entwined like vines. Joseph sits down and shifts to a small table with a phone next to a notepad. We are in a physical therapy center where about a dozen people are on specialized weight machines, including an elderly woman lying on an exercise table, sighing slowly, while Audrey glances away. The ancient secretary's right hand swiftly grabs a pen and hovers it over a blank pad while her left hand continues typing, never glancing up. Rain pours in sheets in the stadium where David stands at the entrance to a tunnel that flows onto the field. He is in a commanding dark green rain poncho and hood, which nearly brushes the ground, and the word 'security' on the back has almost disappeared, barely revealing David's face. There is a football game progressing on the enormous field, where the players appear unusually tiny as David strides out into the rain and turns on the bench. The room remains still as they both linger awkwardly for a moment and Audrey tries to hide her reaction to the strangeness of the question. Elijah just leans back staring at the dark television screen, his face rigid and unyielding. Elijah's mother whispers the next words in a near silence, and Elijah's eyes drift from the television to his mother, perceiving the emotion in her face. Neither speaks for a while as Elijah mulls it over and glances at his mother with disbelief. Elijah meanders across the playground, very cautious of the other children darting about, toward the bench with the present on it, taking a seat and setting the package on his lap. It's flat, with edges drooping over his thin legs. He unties the white bow, removes the clear tape securing the brown paper together, and unwraps the paper to expose a single comic book in his lap. He senses the shadow of his mother as she takes a seat beside him, and he gazes at her with intelligent, piercing eyes, then back down at his lap. He flips open the first page to find two figures illustrated on top of a building engaged in a fierce standoff, one of which is extremely muscular with a mask."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Giraffe Lawson switches clocks with a calculator, gliding past the sideways sculptures and radio stations, and halts on a sideways photograph of a fallen submarine. As its elbows move backward and it twirls up, it rolls quickly off the ottoman and onto the tiles while staring at the microwave door, which displays a live aquatic view of a submarine accident steaming above, with two submarines coiled like ribbons. Giraffe stands up and strides to a large lamp with an eraser beside a sketchbook. We are in an art gallery where about a dozen animals are on colorful canvases, including a juvenile kangaroo perched on a drawing board, inhaling deeply, while Penelope averts her gaze. The prehistoric janitor's left foot instantly grabs a ruler and places it over a marked map while its right foot keeps scribbling, never glancing down. Lightning strikes in waves in the library where Hector waits at the threshold to an attic that empties onto the roof. He is in a towering purple velvet cape and hat, which nearly brushes the ceiling, and the word 'chef' on the front has almost blended in, barely exposing Hector's mouth. There is a tennis class in session on the tiny rooftop, where the dancers seem surprisingly large as Hector steps out into the wind and lounges on the hammock. The hallway is lively as they both sit comfortably for a moment and Penelope attempts to camouflage her reaction to the strangeness of the answer. Orion merely lies focusing on the bright computer monitor, his demeanor calm and observant. Orion's father murmurs the next phrases in almost a shout, and Orion's fingers glide from the computer to his father, noting the seriousness in his expression. Neither moves anything for a moment as Orion ponders it and gazes at his father with suspicion. Orion skips around the museum, very cautious of the other statues swaying nearby, toward the hammock with the cookie on it, taking a nap and setting the doughnut on his arm. It's shiny, with corners wrapping around his bulky arms. He unties the red cord, removes the sticky glue binding the blue cloth together, and unwraps the cloth to display a thin stamp book on his arm. He senses the presence of his father as he rests beside him, and he gazes at him with sharp, thoughtful ears, then back down at his arm. He turns the last page to uncover three vehicles illustrated beneath a bridge engaged in a gentle debate, one of which is extremely feathery with a hat."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Angela Bradshaw shifts windows with a remote control, drifting past the upside-down documentaries and game shows, and pauses on an upside-down image of a floating ship. As her elbows swing backward and she spins over, she slides slowly off the couch and onto the carpet while peering at the television screen, which displays a live aerial shot of a shipwreck steaming below, with two ships coiled like vines. Angela stands and saunters to a small desk with a tablet next to a journal. We are in a dance studio where about a dozen individuals are on intricate balance boards, including an elderly man seated on a stretching mat, blinking slowly, while Marcus looks away. The ancient librarian's right hand casually picks up a marker and hovers it over a blank notepad while her left hand keeps scrolling, never looking up. Snow falls in cascades in the arena where Sarah waits at the mouth of a tunnel that extends onto the track. She is in a towering dark green snow coat and hood, which nearly drags on the ground, and the word 'marshal' on the back has almost vanished, barely revealing Sarah's face. There is a relay race underway on the vast track, where the athletes seem unusually small as Sarah steps into the snow and perches on the barrier. The hall remains silent as they both stand uncomfortably for a moment and Marcus tries to hide his response to the oddness of the silence. Leonard just sits scrutinizing the dim television screen, his expression rigid and unyielding. Leonard's father utters the next words in almost a murmur, and Leonard's eyes shift from the television to his father, recognizing the sentiment in his face. Neither speaks for a while as Leonard reflects on it and gazes at his father with skepticism. Leonard strolls across the courtyard, very cautious of the other students darting about, toward the bench with the parcel on it, settling down and placing the package on his knees. It's flat, with corners folding down over his thin legs. He unties the white ribbon, peels off the clear adhesive securing the brown paper together, and unwraps the paper to uncover a single comic book on his knees. He senses the presence of his father as he takes a position next to him, and he glances at him with wise, piercing eyes, then back down at his knees. He opens the first page to find two characters illustrated atop a skyscraper locked in an intense contest, one of which is extremely agile with a mask."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Joseph Dunne fiddles with a music player, gliding past the inverted paintings and radio stations, and lands on an upside-down image of a toppled sculpture. As his elbows bend backward and he spins around, he glides gently off the armchair and onto the parquet while surveying the smartphone display, which shows a live drone view of a sculpture garden billowing with dust, with two statues coiled like ropes. Joseph rises and strolls to a small bookshelf with a candle beside a notebook. We are in a rehabilitation clinic where about a dozen individuals are on customized rowing machines, including an elderly gentleman perched on a massage bench, exhaling slowly, while Audrey glances aside. The ancient receptionist's right hand instantly seizes a marker and hovers it over a blank page while her left hand keeps texting, never glancing up. Snow falls in blankets in the arena where David stands at the mouth of a tunnel that spills onto the ice. He is in a formidable dark blue parka and cap, which nearly grazes the floor, and the word 'safety' on the back has almost vanished, barely showing David's face. There is a hockey match underway on the vast rink, where the players seem oddly tiny as David steps into the snow and perches on the bleachers. The room remains still as they both stand clumsily for a moment and Audrey attempts to conceal her response to the strangeness of the inquiry. Elijah just sits glaring at the blank smartphone display, his expression tense and unwavering. Elijah's mother murmurs the following words almost inaudibly, and Elijah's gaze shifts from the phone to his mother, noticing the sentiment in her expression. Neither speaks for some time as Elijah ponders and looks at his mother with skepticism. Elijah strides across the courtyard, very cautious of the other children strolling about, toward the swing with the envelope on it, taking a position and setting the package on his knees. It's flat, with corners curling over his slim thighs. He unfastens the blue ribbon, strips away the sticky film securing the grey wrapper, and unwraps the cover to reveal a single magazine on his knees. He senses the presence of his mother as she takes a place beside him, and he gazes at her with insightful, piercing eyes, then back down at his knees. He flips open the first sheet to discover two figures illustrated atop a skyscraper engaged in an intense duel, one of which is exceptionally athletic with a hood."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gillian Baxter flips recipes with a spatula, drifting past the sideways paintings and poetry readings, and pauses on a sideways sketch of a burning bridge. As her elbows swing backward and she twirls around, she glides softly off the stool and onto the tiles while staring at the computer monitor, which displays a live underwater view of a shipwreck shimmering above, with two boats entwined like vines. Gillian stands up and heads to a large shelf with a candle beside a sketchbook. We are in a dance studio where about a dozen birds are on colorful trampolines, including a young girl perched on a spinning chair, humming softly, while Nora stares intently. The youthful assistant's left foot instantly catches a brush and hovers it over a blank canvas while her right foot keeps painting, never glancing down. Snow falls in drifts in the auditorium where Michael leans against the entrance to a staircase that spirals into the basement. He is in a striking bright blue raincoat and umbrella, which barely touches the ceiling, and the word 'guardian' on the sleeve has almost faded away, hardly exposing Michael's hands. There is a chess tournament in progress on the vast platform, where the pieces seem unusually large as Michael skips into the freezer and spins on the mat. The garden is quiet as they both stand confidently for a moment and Nora tries to hide her response to the peculiarity of the answer. Vincent just lounges observing the lit radio dial, his posture loose and resolute. Vincent's brother mumbles the last lyrics in almost a shout, and Vincent's ears shift from the radio to his brother, sensing the energy in his tone. Neither sings anything for a while as Vincent ponders it through and watches his brother with amazement. Vincent skips across the library, very skeptical of the other teachers jumping about, toward the sofa with the blanket on it, lying down and draping the quilt over his belly. It's bumpy, with corners stretching up over his wide waist. He unties the red ribbon, tears off the shiny foil holding the golden fabric together, and unwraps the fabric to reveal a single novel in his grip. He senses the presence of his brother as he lies down beside him, and he gazes at him with curious, searching eyes, then back up at his grip. He turns the last page to uncover two animals perched under a bridge locked in a gentle embrace, one of which is quite slender with a cape."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joseph Dunne flips through TV channels and pauses on a live broadcast of a train crash. In a physical therapy center, a dozen people exercise, including Audrey, who looks away from the scene. An old secretary continues typing and writing simultaneously. Meanwhile, rain pours in a stadium where David, in a faded security poncho, watches a football game from the tunnel entrance. In a tense moment, Elijah, sitting silently in front of a dark TV, turns to his emotional mother. Elijah, wary of children playing, approaches a bench with a present. He unwraps it to find a comic book, glancing at his mother before opening it to a scene of two figures battling on a rooftop, one muscular and masked."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap  He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap  It's flat with edges bending down over his thin legs  Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap  Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief  Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face  Elijah just sits staring at the dark television screen his face tense and unyielding  The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question  There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench  He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face  Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up  We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away  Joseph gets up and moves to a small table with a phone next to a notepad  As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes  Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field  Joseph gets up and moves to a small table with a phone next to a notepad  Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap  Elijah just sits staring at the dark television screen his face tense and unyielding  As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes  He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask It's flat with edges bending down over his thin legs  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up  There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench  We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away  He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap  The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question  He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap  Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face  Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief  He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face  Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Elijah just sits staring at the dark television screen his face tense and unyielding  Elijah's mother says the next words in almost a whisper and Elijah's eyes move from the television to his mother seeing the emotion in her face  Neither says anything for a while as Elijah thinks it over and looks at his mother with disbelief  Elijah walks across the playground very wary of the other children running about toward the bench with the present on it taking a seat and placing the package on his lap  It's flat with edges bending down over his thin legs  He undoes the white bow peels off the clear tape holding the brown paper together and unfolds the paper to reveal a single comic book in his lap  He feels the shadow of his mother as she takes a seat next to him and he looks at her with intelligent piercing eyes then back down at his lap  He opens the first page to find two figures depicted on top of a building locked in a fierce battle one of which is extremely muscular with a mask Joseph Dunne changes channels with a remote control moving past the upsidedown cartoons and talk shows and stops on an upsidedown picture of a crashed train  As his knees come forward and he flips over he tumbles slowly off the couch and onto the carpet while gazing at the television screen which shows a live aerial view of a train wreck smoldering below with two trains tangled like snakes  Joseph gets up and moves to a small table with a phone next to a notepad  We are in a physical therapy center where about a dozen people are on specialized weight machines including an elderly woman seated on an exercise table breathing slowly while Audrey looks away  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad while her left hand keeps typing never looking up  Rain falls in sheets in the stadium where David stands at the entrance to a tunnel that empties onto the field  He is in an imposing dark green rain poncho and hood which nearly touches the ground and the word 'security' on the back has almost faded away barely revealing David's face  There is a football game in progress on the enormous field where the players seem unusually small as David steps out into the rain and turns on the bench  The room is still as they both stand awkwardly for a moment and Audrey tries to mask her reaction to the oddness of the question "
        }
      ]
    }
  ]
}