{
  "ground_truth": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins, one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus makes his way through, eliciting gasps and cheers from the kids. Playing to the crowd, Marcus takes a bottle from the floor and swigs from it while Marcus stares at him. He then grabs the hat, slams it into Willie's chest, and as Willie rises, kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot, a city bus stops with a hiss and the doors open to reveal a pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of pee. As the kid nears the mall entrance, he passes a group of older children doing skateboard stunts, who notice him. Marcus puts another young boy on his lap and then walks over to the rope. The snot-nosed Kid is next in line, frozen by fear, but Marcus's actions penetrate the Kid's fear and he moves. Marcus leads the Kid up to the throne and places him on Willie's lap. The Kid just stares, motionless except for the flowing rivulet of snot, which Willie can't help but stare at. Suddenly, the Kid yanks Willie's beard, holding it stretched below Willie's chin. Willie shoves the Kid, who backs away, looking at him in awe and never breaking his reverent stare. The Kid sits on a bench, watching the entrance to Chamberlain's. After a beat, Willie and Marcus walk out in costume and cross toward the parking lot, with the Kid following from a safe distance. Willie and Marcus walk across the huge empty parking lot, followed at a great distance by the Kid, who creeps closer to hear their conversation. A large faux rustic bar is filled to capacity with loosened-tie middle-management as we follow someone's gaze around the room until it connects with the drunken, glowering face of a Hindustani Troublemaker sitting right across from him, startling Willie for a moment. She pours two drinks, and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs, allowing Willie a chance to regain composure. The Kid sits in the front seat next to Willie, who drives while stewing and answering absently, with his head slightly ducked and his eyes darting side to side, checking for road signs. Willie escorts the Kid along a long walkway leading to the front door of a large, opulent, new-money Southwestern home, admiring the surroundings.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Rudolfo the Crimson Snouted Burro is cared for by numerous Santa's elf figures, one dressed in cowboy attire and another in a poncho and sombrero. A queue of awaiting youngsters is present as Marcus makes his path through, eliciting gasps and cheers from the children. Playing to the audience, Marcus seizes a bottle from the ground and swigs from it while Marcus gazes at him. He then grasps the hat, slams it into Willie's chest, and as Willie rises, kicks him in the backside. On the fringes of the Saguaro Square Mall's parking lot, a city bus halts with a hiss and the doors open to reveal a pitiful EIGHT-YEAR-OLD KID, overweight, snot-nosed, poorly dressed, and probably smelling of urine. As the youngster nears the mall entrance, he passes a cluster of older children doing skateboard tricks, who notice him. Marcus places another young boy on his lap and then walks over to the rope. The snot-nosed Kid is next in queue, frozen by terror, but Marcus's actions penetrate the Kid's fear and he moves. Marcus guides the Kid up to the throne and places him on Willie's lap. The Kid just stares, motionless except for the flowing rivulet of mucus, which Willie can't help but stare at. Suddenly, the Kid yanks Willie's beard, holding it stretched below Willie's chin. Willie pushes the Kid, who backs away, looking at him in awe and never breaking his reverent stare. The Kid sits on a bench, watching the entrance to Chamberlain's. After a beat, Willie and Marcus walk out in attire and cross toward the parking lot, with the Kid following from a safe distance. Willie and Marcus walk across the vast vacant parking lot, followed at a great distance by the Kid, who creeps closer to overhear their conversation. A large faux rustic bar is filled to capacity with loosened-tie middle-management as we follow someone's gaze around the room until it connects with the drunken, glowering face of a Hindustani Troublemaker sitting right across from him, startling Willie for a moment. She pours two drinks, and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs, allowing Willie a chance to recover composure. The Kid sits in the front seat next to Willie, who drives while stewing and answering absently, with his head slightly ducked and his eyes darting side to side, checking for road indicators. Willie escorts the Kid along a long walkway leading to the front door of a large, opulent, nouveau-riche Southwestern home, admiring the surroundings."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins, one dressed in cowboy wear and another in a poncho and sombrero. As Marcus makes his way through a line of waiting children, gasps and cheers are elicited by him from the kids. Playing to the crowd, a bottle is taken from the floor by Marcus, who swigs from it while Marcus stares at him. The hat is then grabbed by him and slammed into Willie's chest, and as Willie rises, his ass is kicked by Marcus. On the outskirts of the Saguaro Square Mall's parking lot, a city bus stops with a hiss and opens its doors, revealing a pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of pee. A group of older children doing skateboard stunts notice him as he passes by near the mall entrance. Another young boy is put on Marcus's lap, and then he walks over to the rope. Next in line is the snot-nosed Kid, frozen by fear, but the Kid's fear is penetrated by Marcus's actions, and he moves. The Kid is led up to the throne by Marcus, who places him on Willie's lap. The Kid just stares, motionless except for the flowing rivulet of snot, which Willie can't help but stare at. Suddenly, Willie's beard is yanked by the Kid, holding it stretched below Willie's chin. The Kid is shoved by Willie, who backs away, looking at him in awe and never breaking his reverent stare. On a bench, the Kid sits, watching the entrance to Chamberlain's. After a beat, Willie and Marcus walk out in costume and cross toward the parking lot, with the Kid following from a safe distance. The Kid follows Willie and Marcus across the huge empty parking lot at a great distance, creeping closer to hear their conversation. A large faux rustic bar is filled to capacity with loosened-tie middle-management as someone's gaze is followed around the room until it connects with the drunken, glowering face of a Hindustani Troublemaker sitting right across from him, startling Willie for a moment. Two drinks are poured by her, and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Kid is found beating on the Troublemaker's legs after he stops and looks down, allowing Willie a chance to regain composure. In the front seat next to Willie, the Kid sits, driving while stewing and answering absently, with his head slightly ducked and his eyes darting side to side, checking for road signs. The Kid is escorted by Willie along a long walkway leading to the front door of a large, opulent, new-money Southwestern home, admiring the surroundings."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rudolfo the Red Nosed Burro is attended by Santa's elf mannequins, one in cowboy attire and another in a poncho and sombrero. A line of children waits as Marcus moves through, drawing gasps and cheers. Marcus plays to the crowd, swigs from a bottle, grabs a hat, and slams it into Willie's chest, then kicks him. At the Saguaro Square Mall's parking lot, a city bus arrives, revealing a pathetic EIGHT-YEAR-OLD KID, overweight and poorly dressed. As he nears the mall, he passes older kids doing skateboard stunts. Marcus places another boy on his lap, then leads the snot-nosed Kid to the throne, placing him on Willie's lap. The Kid stares, pulling Willie's beard, who shoves him away. The Kid watches the entrance to Chamberlain's. Willie and Marcus exit in costume, crossing the parking lot, followed by the Kid. In a crowded bar, a Hindustani Troublemaker startles Willie. She pours drinks, and they both down them. The Troublemaker stops as the Kid beats on his legs, giving Willie a moment to regain composure. The Kid sits next to Willie, who drives while distracted. Willie escorts the Kid to a large, opulent Southwestern home, admiring the surroundings."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rudolfo the Red Nosed Burro is tended by Santa's elf mannequins, one in cowboy attire and another in a poncho and sombrero. Marcus navigates through a line of children, eliciting gasps and cheers. He swigs from a bottle, grabs a hat, slams it into Willie's chest, and kicks him as he rises. A city bus stops at Saguaro Square Mall, revealing a pathetic eight-year-old kid, overweight and snot-nosed. As he nears the entrance, older children doing skateboard stunts notice him. Marcus places a young boy on his lap, then leads the snot-nosed Kid, frozen by fear, to the throne, placing him on Willie's lap. The Kid yanks Willie's beard, then backs away, staring in awe. The Kid sits on a bench, watching Chamberlain's entrance. Willie and Marcus exit in costume, crossing the parking lot, with the Kid following at a distance. In a crowded bar, a Hindustani Troublemaker startles Willie. The Kid beats on the Troublemaker's legs, allowing Willie to regain composure. The Kid sits next to Willie, who drives while distracted. Willie escorts the Kid to a large, opulent Southwestern home, admiring the surroundings."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Rudolfo the Red Nosed Burro, a charming and whimsical character, is attentively cared for by several mannequin elves, each dressed in distinctive attire. One mannequin is outfitted in traditional cowboy gear, while another sports a colorful poncho and a wide-brimmed sombrero, adding a festive flair to the scene. A line of eager children waits in anticipation as Marcus makes his way through the crowd, his presence eliciting a chorus of gasps and cheers from the excited youngsters. Playing to the audience, Marcus theatrically picks up a bottle from the floor and takes a swig, all while Marcus watches him intently. In a sudden burst of action, he grabs a hat, forcefully slams it into Willie's chest, and as Willie rises, delivers a swift kick to his backside.\n\nMeanwhile, on the outskirts of the expansive Saguaro Square Mall's parking lot, a city bus comes to a halt with a loud hiss, and the doors swing open to reveal a rather pitiful sight: an EIGHT-YEAR-OLD KID, who is overweight, with a snotty nose, poorly dressed, and likely carrying the unpleasant odor of urine. As this unfortunate child approaches the mall entrance, he passes by a group of older kids performing skateboard stunts, who take notice of him. Marcus, in the meantime, places another young boy on his lap before making his way over to the rope. The snot-nosed Kid is next in line, frozen in place by fear, but Marcus's actions manage to break through the Kid's apprehension, prompting him to move forward. Marcus gently guides the Kid up to the throne and carefully places him on Willie's lap. The Kid simply stares, motionless except for the continuous stream of snot, which Willie can't help but fixate on.\n\nIn a sudden and unexpected move, the Kid yanks on Willie's beard, stretching it below Willie's chin. Willie reacts by shoving the Kid, who retreats, still gazing at him in awe and never breaking his reverent stare. The Kid then takes a seat on a nearby bench, his eyes fixed on the entrance to Chamberlain's. After a brief pause, Willie and Marcus emerge in costume and make their way across the parking lot, with the Kid trailing them at a safe distance. Willie and Marcus continue their walk across the vast, empty parking lot, with the Kid following from afar, inching closer to catch snippets of their conversation.\n\nInside a large faux rustic bar, filled to capacity with middle-management types who have loosened their ties, we follow someone's gaze as it sweeps around the room until it locks onto the drunken, glowering face of a Hindustani Troublemaker sitting directly across from him, momentarily startling Willie. The Troublemaker pours two drinks, and they both down them quickly as she continues to pour. Willie stares at her while the man returns his gaze for a moment. The Troublemaker pauses and looks down to find the Kid beating on his legs, providing Willie with a chance to regain his composure.\n\nThe Kid now sits in the front seat next to Willie, who is driving while lost in thought, answering absently, his head slightly ducked and his eyes darting side to side, vigilantly checking for road signs. Willie escorts the Kid along a long, winding walkway leading to the front door of a large, opulent, new-money Southwestern home, taking in the impressive surroundings with a sense of admiration."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Rudolfo the Red Nosed Burro is a delightful and enchanting character that captures the imagination. He is meticulously attended to by a number of mannequin elves, each adorned in uniquely styled outfits that reflect their whimsical personalities. One mannequin is dressed in authentic cowboy apparel, complete with all the traditional gear, while another is wearing a vibrant, multicolored poncho and a wide-brimmed sombrero, which adds an extra touch of festivity and charm to the scene. Meanwhile, an eager queue of children stands waiting with anticipation as Marcus makes his way through the buzzing crowd, his presence evoking a symphony of gasps and cheers from the young audience, who are visibly excited. Playing up to the enthusiastic crowd, Marcus dramatically picks up a bottle from the floor, theatrically taking a swig, all the while, Marcus' gaze remains fixed on him with intense interest. In a sudden and energetic burst of movement, Marcus grabs a hat and slams it decisively into Willie's chest, and as Willie stands up, delivers a swift and comical kick to his backside, adding to the humor of the moment.\n\nMeanwhile, situated on the outskirts of the sprawling Saguaro Square Mall’s vast parking lot, a city bus pulls to a stop with a loud, distinctive hiss. The doors open wide to reveal a rather woeful sight: an EIGHT-YEAR-OLD KID, who is overweight, with an unfortunate snotty nose and wearing shabby clothing, likely carrying with him the unpleasant odor of urine. As this unfortunate child approaches the expansive mall entrance, he passes by a group of slightly older kids who are skillfully performing skateboard stunts, and they quickly take notice of him. At the same time, Marcus places yet another young boy onto his lap before moving purposefully over to the rope. The snot-nosed Kid is next in line, appearing frozen in place by a paralyzing sense of fear. However, Marcus's well-timed actions manage to break through the Kid's apprehension, gently coaxing him to move forward. Marcus carefully guides the anxious Kid up to the throne, where he places him delicately on Willie's lap. The Kid simply stares in awe, remaining motionless except for the continuous stream of snot that Willie can't help but fixate on, unable to look away.\n\nIn a sudden and unexpected twist, the Kid grabs hold of Willie's beard, yanking it downwards below Willie's chin. Willie quickly reacts by pushing the Kid, who swiftly retreats but continues to gaze at Willie with admiration and never breaks his reverent stare. The Kid then takes a seat on a nearby bench, his eyes firmly fixed on the entrance to Chamberlain's, deep in thought. After a brief pause, Willie and Marcus, now in costume, emerge and proceed to make their way across the expansive parking lot while the Kid trails behind them at a safe and respectful distance. Willie and Marcus continue their journey across the vast, empty parking lot, with the Kid following from afar, inching closer and closer in an attempt to catch snippets of their conversation.\n\nInside a large faux rustic bar, teeming with middle-management types who have loosened their ties in relaxation, we follow someone’s gaze sweeping around the lively room until it stops abruptly on the clearly inebriated and glowering face of a Hindustani Troublemaker sitting directly opposite him. This unexpected sight momentarily startles Willie. The Troublemaker pours two drinks, and both quickly down them as she continues to pour more. Willie stares at her intently while the man briefly returns his gaze. The Troublemaker pauses to look down and finds the Kid beating rhythmically on his legs, providing Willie with the perfect opportunity to regain his composure.\n\nAt this moment, the Kid finds himself seated in the front passenger seat next to Willie, who is driving while seemingly lost in thought. He answers the Kid's questions absently, his head slightly ducked, eyes darting from side to side, vigilantly checking for road signs. Willie then escorts the Kid along a long, winding walkway leading up to the front door of a grand, opulent, new-money Southwestern-style home. As they approach, Willie takes in the impressive surroundings with an undeniable sense of admiration and appreciation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Rudolfo the Red Nosed Burro stands under the attentive care of several Santa's elf mannequins, each uniquely dressed, with one sporting cowboy attire and another adorned in a poncho and sombrero. A line of eager children waits nearby, their excitement palpable as Marcus navigates through them, his presence eliciting gasps and cheers from the young crowd. Seizing the moment to entertain, Marcus theatrically picks up a bottle from the floor, taking a swig from it while maintaining eye contact with Willie, who watches him intently. In a swift motion, Marcus grabs a hat and forcefully thrusts it into Willie's chest, and as Willie begins to rise, Marcus delivers a playful kick to his backside. Meanwhile, on the outskirts of the Saguaro Square Mall's parking lot, a city bus comes to a halt with a loud hiss, its doors parting to reveal a forlorn eight-year-old kid, noticeably overweight, with a runny nose, poorly dressed, and likely carrying the faint odor of urine. As the kid approaches the mall entrance, he passes a group of older children performing skateboard stunts, who take notice of him. Marcus, meanwhile, places another young boy on his lap before making his way over to the rope. The snot-nosed kid stands next in line, paralyzed by fear, but Marcus's confident actions manage to break through the kid's apprehension, prompting him to move forward. Marcus gently guides the kid up to the throne, carefully placing him on Willie's lap. The kid remains motionless, his eyes fixed on Willie, except for the continuous stream of snot that captures Willie's reluctant attention. In an unexpected move, the kid tugs on Willie's beard, stretching it beneath Willie's chin. Reacting instinctively, Willie shoves the kid, who retreats, his eyes wide with awe, never breaking his reverent gaze. The kid then finds a seat on a bench, his eyes glued to the entrance of Chamberlain's. After a brief pause, Willie and Marcus emerge in costume, making their way across the parking lot, with the kid trailing at a cautious distance. Willie and Marcus traverse the expansive, empty parking lot, the kid shadowing them from afar, inching closer to eavesdrop on their conversation. Inside a large faux rustic bar, filled to capacity with middle-management types loosening their ties, someone's gaze sweeps across the room until it lands on the drunken, glowering face of a Hindustani Troublemaker seated directly opposite, momentarily startling Willie. The Troublemaker pours two drinks, and they both down them quickly as she continues to pour. Willie locks eyes with her while the man briefly stares at him. The Troublemaker pauses, glancing down to discover the kid beating on his legs, providing Willie a moment to regain his composure. The kid then sits in the front seat next to Willie, who drives with a brooding demeanor, responding absently, his head slightly lowered, eyes darting side to side, vigilantly checking for road signs. Willie escorts the kid along an extended walkway leading to the front door of a grand, opulent, new-money Southwestern home, taking in the impressive surroundings with admiration."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rudolfo the Red Nosed Burro is attended by Santa's elf mannequins, one in cowboy attire and another in a poncho and sombrero. As Marcus navigates through a line of excited children, he engages them by theatrically drinking from a bottle and interacting with Willie, culminating in a playful kick. Meanwhile, a city bus arrives at the Saguaro Square Mall, revealing a disheveled eight-year-old boy who awkwardly approaches the entrance, passing older kids on skateboards. Marcus, after placing another boy on his lap, guides the nervous Kid to the throne, where he sits on Willie's lap and unexpectedly tugs his beard. Willie reacts by pushing the Kid, who retreats in awe. The Kid then observes Willie and Marcus as they exit Chamberlain's and head across the parking lot, trailing them at a distance to overhear their conversation. Inside a bustling bar, Willie is momentarily startled by a Hindustani Troublemaker, but the Kid's intervention allows Willie to regain his composure. Later, the Kid rides in the front seat with Willie, who drives distractedly, scanning for road signs. Finally, Willie escorts the Kid along a walkway to a grand Southwestern home, taking in the opulent surroundings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rudolfo the Red Nosed Burro, a playful twist on the famous Christmas character Rudolf the Red-Nosed Reindeer, is tended by several Santa's elf mannequins, one dressed in cowboy wear reminiscent of the Wild West and another in a poncho and sombrero, reflecting the Southwestern cultural influences. A line of waiting children is present as Marcus, known for his showmanship at festive events, makes his way through, eliciting gasps and cheers from the kids as if they were at a live circus performance. Playing to the crowd, Marcus takes a bottle from the floor, likely intended to embody the comical yet mischievous antics of a circus clown, and swigs from it while Marcus stares at him. He then grabs the hat, slams it into Willie's chest, and as Willie rises, kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot, named after the iconic Saguaro cactus native to the Sonoran Desert, a city bus stops with a hiss, echoing the desert winds, and the doors open to reveal a pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of pee, a stereotype often used to elicit both humor and sympathy. As the kid nears the mall entrance, he passes a group of older children doing skateboard stunts, a common scene at popular malls, who notice him. Marcus puts another young boy on his lap and then walks over to the rope. The snot-nosed Kid is next in line, frozen by fear, but Marcus's actions penetrate the Kid's fear and he moves, inspired by the showmanship around him. Marcus leads the Kid up to the throne, a tradition during holiday events for children to meet Santa, and places him on Willie's lap. The Kid just stares, motionless except for the flowing rivulet of snot, which Willie can't help but stare at, almost as if caught in a moment of surreal comedy. Suddenly, the Kid yanks Willie's beard, holding it stretched below Willie's chin, a classic childlike test of authenticity to see if he's the real Santa. Willie shoves the Kid, who backs away, looking at him in awe and never breaking his reverent stare, as if in disbelief at Santa's unexpected behavior. The Kid sits on a bench, watching the entrance to Chamberlain's, a high-end retail store known for its luxury gifts and stylish decorations. After a beat, Willie and Marcus walk out in costume, resembling characters out of a holiday-themed movie, and cross toward the parking lot, with the Kid following from a safe distance. Willie and Marcus walk across the huge empty parking lot, a vast expanse reflecting the sprawling nature of American malls, followed at a great distance by the Kid, who creeps closer to hear their conversation, his curiosity piqued by their mysterious actions. A large faux rustic bar, styled to mimic an Old West saloon, is filled to capacity with loosened-tie middle-management, often seen unwinding after long workdays, as we follow someone's gaze around the room until it connects with the drunken, glowering face of a Hindustani Troublemaker sitting right across from him, startling Willie for a moment, highlighting the cultural diversity often celebrated in urban settings. She pours two drinks, and they both pound them back as she pours, in a scene reminiscent of a convivial Old West bar showdown. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs, allowing Willie a chance to regain composure. The Kid sits in the front seat next to Willie, who drives while stewing and answering absently, with his head slightly ducked and his eyes darting side to side, checking for road signs, a natural action when navigating unfamiliar areas. Willie escorts the Kid along a long walkway leading to the front door of a large, opulent, new-money Southwestern home, admiring the surroundings, typical of the luxurious homes often found in desert regions where modern architecture meets traditional styles."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero  A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids  Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him  Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin  Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare  The Kid sits on a bench watching the entrance to Chamberlain's  After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance  Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation  A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow someone's gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment  She pours two drinks and they both pound them back as she pours  Willie stares at her while the man stares at him for a beat  The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure  The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs  Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass  On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee  As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him  Marcus puts another young boy on his lap and then walks over to the rope  The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves  Marcus leads the Kid up to the throne and places him on Willie's lap  The Kid just stares motionless except for the flowing rivulet of snot which Willie can't help but stare at  Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin  Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare  The Kid sits on a bench watching the entrance to Chamberlain's  After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance  Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation  A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow someone's gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment  She pours two drinks and they both pound them back as she pours  Willie stares at her while the man stares at him for a beat  The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure  The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs  Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids. Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him. He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee. As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him. Marcus puts another young boy on his lap and then walks over to the rope. The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves. Marcus leads the Kid up to the throne and places him on Willie's lap. The Kid just stares motionless except for the flowing rivulet of snot which Willie cannot help but stare at. Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare. The Kid sits on a bench watching the entrance to Chamberlain's. After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance. Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation. A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow. someone is gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment. She pours two drinks and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure. The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs. Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids. Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him. He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee. As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him. Marcus puts another young boy on his lap and then walks over to the rope. The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves. Marcus leads the Kid up to the throne and places him on Willie's lap. The Kid just stares motionless except for the flowing rivulet of snot which Willie cannot help but stare at. Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare. The Kid sits on a bench watching the entrance to Chamberlain's. After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance. Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation. A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow. someone is gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment. She pours two drinks and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure. The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs. Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids. Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him. He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee. As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him. She pours two drinks and they both pound them back as she pours. Willie stares at her while the man stares at him for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure. The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs. Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids. Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him. The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs. Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Rudolfo the Red Nosed Burro is tended by several mischievous gnomes, one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as a rabbit makes its way through, eliciting gasps and cheers from the kids. Playing to the crowd, the rabbit takes a bottle from the floor and swigs from it while a rabbit stares at him. It then grabs the hat, slams it into a dragon's chest, and as the dragon rises, kicks him in the ass. On the outskirts of the Saguaro Square Mall's parking lot, a city bus stops with a hiss and the doors open to reveal a pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of pee. As the kid nears the mall entrance, the kid passes a group of older children doing skateboard stunts, who notice the kid. The rabbit puts another young boy on its lap and then walks over to the rope. The snot-nosed Kid is next in line, frozen by fear, but the rabbit's actions penetrate the Kid's fear and the Kid moves. The rabbit leads the Kid up to the throne and places the Kid on the dragon's lap. The Kid just stares, motionless except for the flowing rivulet of snot, which the dragon can't help but stare at. Suddenly, the Kid yanks the dragon's beard, holding it stretched below the dragon's chin. The dragon shoves the Kid, who backs away, looking at the dragon in awe and never breaking the Kid's reverent stare. The Kid sits on a bench, watching the entrance to Chamberlain's. After a beat, the dragon and the rabbit walk out in costume and cross toward the parking lot, with the Kid following from a safe distance. The dragon and the rabbit walk across the huge empty parking lot, followed at a great distance by the Kid, who creeps closer to hear their conversation. A large faux rustic bar is filled to capacity with loosened-tie middle-management as we follow a cat's gaze around the room until it connects with the drunken, glowering face of a Hindustani Troublemaker sitting right across from a cat, startling the dragon for a moment. A horse pours two drinks, and they both pound them back as a horse pours. The dragon stares at a horse while the man stares at the dragon for a beat. The Troublemaker stops and looks down to find the Kid beating on his legs, allowing the dragon a chance to regain composure. The Kid sits in the front seat next to the dragon, who drives while stewing and answering absently, with the dragon's head slightly ducked and the dragon's eyes darting side to side, checking for road signs. The dragon escorts the Kid along a long walkway leading to the front door of a large, opulent, new-money Southwestern home, admiring the surroundings."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Rudolfo the Red Nosed Donkey is tended by several Santa's elf statues, one dressed in astronaut gear and another in a kimono and top hat. A line of waiting children is present as Marcus makes his way through, eliciting gasps and cheers from the kids. Playing to the crowd, Marcus takes a balloon from the table and swigs from it while Marcus stares at him. He then grabs the scarf, slams it into Willie's chest, and as Willie rises, kicks him in the shin. On the outskirts of the Mesquite Plaza Park's playground, a city tram stops with a hiss and the doors open to reveal a pathetic EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of garlic. As the kid nears the park entrance, he passes a group of older children doing BMX tricks, who notice him. Marcus puts another young boy on his lap and then walks over to the pillar. The snot-nosed Kid is next in line, frozen by fear, but Marcus's actions penetrate the Kid's fear and he moves. Marcus leads the Kid up to the stage and places him on Willie's lap. The Kid just stares, motionless except for the flowing rivulet of snot, which Willie can't help but stare at. Suddenly, the Kid yanks Willie's scarf, holding it stretched below Willie's chin. Willie shoves the Kid, who backs away, looking at him in awe and never breaking his reverent stare. The Kid sits on a chair, watching the entrance to Thompson's. After a beat, Willie and Marcus walk out in costume and cross toward the playground, with the Kid following from a safe distance. Willie and Marcus walk across the huge empty playground, followed at a great distance by the Kid, who creeps closer to hear their conversation. A large faux vintage diner is filled to capacity with loosened-tie executives as we follow someone's gaze around the room until it connects with the drunken, glowering face of a Bengali Mischief-Maker sitting right across from him, startling Willie for a moment. She pours two sodas, and they both pound them back as she pours. Willie stares at her while the woman stares at him for a beat. The Mischief-Maker stops and looks down to find the Kid beating on his shoes, allowing Willie a chance to regain composure. The Kid sits in the back seat next to Willie, who drives while stewing and answering absently, with his head slightly ducked and his eyes darting side to side, checking for landmarks. Willie escorts the Kid along a long trail leading to the front door of a large, opulent, new-money Midwestern villa, admiring the surroundings."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Rudolfo the Red Nosed Burro is examined by several Santa's elf mannequins, one dressed in cowboy wear and another in a poncho and sombrero. A line of waiting children is present as Marcus edges his way through, prompting murmurs and giggles from the kids. Engaging with the crowd, Marcus retrieves a bottle from the floor and examines it while Marcus glances at him. He then snatches the hat, throws it toward Willie's chest, and as Willie stands, nudges him in the shoulder. On the outskirts of the Saguaro Square Mall's parking lot, a city bus rolls to a stop with a hiss and the doors open to reveal a timid EIGHT-YEAR-OLD KID, overweight, snot-nosed, badly dressed, and probably smelling of pee. As the kid approaches the mall entrance, he bypasses a group of older children performing skateboard stunts, who recognize him. Marcus places another young boy beside him and then strolls over to the rope. The snot-nosed Kid is next in line, paralyzed by fear, but Marcus's actions break through the Kid's fear and he advances. Marcus guides the Kid to the throne and sets him on Willie's lap. The Kid just gazes, motionless except for the flowing rivulet of snot, which Willie can't help but fixate on. Suddenly, the Kid tugs at Willie's beard, holding it taut below Willie's chin. Willie pushes the Kid, who retreats, gazing at him in awe and never breaking his reverent gaze. The Kid rests on a bench, observing the entrance to Chamberlain's. After a moment, Willie and Marcus emerge in costume and stride toward the parking lot, with the Kid trailing from a safe distance. Willie and Marcus proceed across the vast empty parking lot, trailed at a great distance by the Kid, who inches closer to overhear their conversation. A large faux rustic bar is bustling with loosened-tie middle-management as we trace someone's gaze around the room until it lands on the drunken, glowering face of a Hindustani Troublemaker seated right across from him, startling Willie momentarily. She prepares two drinks, and they both gulp them down as she prepares more. Willie regards her while the man observes him for a beat. The Troublemaker halts and glances down to find the Kid tapping on his legs, giving Willie an opportunity to regain composure. The Kid perches in the front seat next to Willie, who steers while brooding and responding absentmindedly, with his head slightly inclined and his eyes darting side to side, scanning for road signs. Willie guides the Kid along a long walkway leading to the front door of a large, opulent, new-money Southwestern home, admiring the surroundings."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Albert the Blue Eared Rabbit is tended by several Merlin's troll statues, one dressed in astronaut gear and another in a toga and turban. A line of waiting flamingos is present as Cynthia makes her way through, eliciting gasps and cheers from the frogs. Playing to the crowd, Cynthia takes a suitcase from the ceiling and swigs from it while Cynthia stares at her. She then grabs the sock, slams it into Harry's foot, and as Harry rises, kicks him in the knee. On the outskirts of the Cedar Leaf Stadium's parking lot, a freight train stops with a sigh and the doors open to reveal a magnificent ELEVEN-YEAR-OLD FLAMINGO, underweight, beak-dripping, elegantly dressed, and definitely smelling of roses. As the flamingo nears the stadium entrance, it passes a group of younger flamingos doing juggling stunts, who notice it. Cynthia puts another young penguin on her lap and then walks over to the branch. The beak-dripping Flamingo is next in line, frozen by surprise, but Cynthia's actions penetrate the Flamingo's surprise and it moves. Cynthia leads the Flamingo up to the couch and places it on Harry's lap. The Flamingo just stares, motionless except for the flowing cascade of feathers, which Harry can't help but stare at. Suddenly, the Flamingo pulls Harry's scarf, holding it stretched below Harry's chin. Harry shoves the Flamingo, who backs away, looking at him in admiration and never breaking its intrigued stare. The Flamingo sits on a chair, watching the entrance to Montgomery's. After a pause, Harry and Cynthia walk out in disguise and cross toward the parking lot, with the Flamingo following from a cautious distance. Harry and Cynthia walk across the huge empty parking lot, followed at a great distance by the Flamingo, who creeps closer to hear their music. A small imitation industrial kitchen is filled to capacity with tight-hat senior engineering as we follow someone's whisper around the room until it connects with the sober, smiling face of a Lithuanian Peacemaker sitting right across from her, startling Harry for a moment. He pours two soups, and they both gulp them back as he pours. Harry stares at him while the woman stares at her for a pause. The Peacemaker stops and looks down to find the Flamingo patting on its wings, allowing Harry a chance to regain perspective. The Flamingo sits in the back seat next to Harry, who flies while reflecting and answering absently, with his head slightly tilted and his eyes darting side to side, checking for clouds. Harry escorts the Flamingo along a short bridge leading to the side window of a small dilapidated, old-money Northern cottage, admiring the decorations."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tobias the Blue Tailed Zebra is accompanied by several Mrs. Claus puppet dancers, one dressed in astronaut gear and another in a toga and laurel wreath. A line of waiting adults is present as Fiona skips her way through, eliciting whispers and giggles from the adults. Performing for the audience, Fiona picks up a book from the floor and flips through it while Fiona glances at her. She then seizes the scarf, tosses it into Tim's arms, and as Tim stands, nudges him in the knee. On the outskirts of the Jungle Plaza Market's parking area, a school bus arrives with a roar and the doors swing open to disclose a jubilant FORTY-TWO-YEAR-OLD WOMAN, cheerful, well-groomed, elegantly dressed, and probably smelling of roses. As the woman approaches the mall entrance, she passes a group of younger adults doing bicycle tricks, who ignore her. Fiona places another young girl on her back and then dances over to the fence. The cheerful Woman is next in line, paralyzed by surprise, but Fiona's movements pierce the Woman's hesitation and she proceeds. Fiona guides the Woman up to the pedestal and sets her on Tim's back. The Woman just gazes, still except for the flowing tear of joy, which Tim can't help but notice. Suddenly, the Woman tugs Tim's hair, holding it taut under Tim's nose. Tim nudges the Woman, who moves away, gazing at him in admiration and never breaking her respectful gaze. The Woman rests on a bench, observing the entrance to Wellington's. After a moment, Tim and Fiona emerge in costume and walk toward the parking area, with the Woman trailing from a safe distance. Tim and Fiona traverse the expansive empty parking area, followed distantly by the Woman, who edges closer to overhear their conversation. A large fake nautical café is packed to the brim with loosened-shirt upper-management as we track someone's vision around the space until it meets with the sober, smiling face of a Scandinavian Peacemaker sitting right across from her, surprising Tim for an instant. She pours two teas, and they both sip them as she serves. Tim glances at her while the woman observes him for a moment. The Peacemaker pauses and looks down to find the Woman tapping on his toes, giving Tim a moment to regain composure. The Woman sits in the back seat next to Tim, who navigates while pondering and commenting thoughtfully, with his head slightly tilted and his eyes scanning side to side, searching for landmarks. Tim leads the Woman along a winding path leading to the front gate of a vast, elegant, old-money Victorian estate, marveling at the scenery."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Rudolfo the Red Nosed Sardine is shepherded by several Santa's elf sculptures, one dressed in pirate attire and another in a toga and laurel wreath. A line of waiting pigeons is present as Marcus meanders his way through, eliciting giggles and claps from the birds. Engaging the audience, Marcus picks up a lantern from the grass and sips from it while Marcus stares at him. He then yanks the balloon, stuffs it into Willie's pocket, and as Willie stands, pats him on the knee. On the fringes of the Saguaro Square Mall's bus station, a city tram halts with a screech and the doors slide open to reveal a menacing EIGHT-YEAR-OLD CAT, scrawny, drool-faced, brightly dressed, and probably smelling of cheese. As the cat nears the garden entrance, it passes a group of older swans doing yo-yo tricks, who glance at it. Marcus places another young squirrel on his shoulder and then hops over to the ribbon. The drool-faced cat is next in line, frozen by curiosity, but Marcus's antics deflate the cat's confusion and it advances. Marcus directs the cat up to the hammock and drops it on Willie's back. The cat just blinks, motionless except for the dribbling stream of drool, which Willie can't help but blink at. Abruptly, the cat tugs Willie's shoelace, holding it taut above Willie's shoe. Willie nudges the cat, who retreats, gawking at him with wonder and never breaking its awestruck gaze. The cat lounges on a swing, observing the entrance to Watson's. After a moment, Willie and Marcus stroll out in disguise and stride toward the garden, with the cat lurking from a cautious distance. Willie and Marcus stride across the vast deserted garden, trailed at a safe distance by the cat, who slinks closer to catch their dialogue. A large faux rustic café is packed to bursting with loosened-tie senior executives as we trace someone's gaze around the space until it meets the scowling, glaring face of a Martian Mischief-Maker sitting right across from him, surprising Willie momentarily. She concocts two potions, and they both gulp them down as she concocts. Willie glances at her while the giant glances at him for a moment. The Mischief-Maker halts and looks down to discover the cat tapping on his toes, granting Willie an opportunity to regain balance. The cat rests in the back seat beside Willie, who explores while brooding and responding distantly, with his head slightly tilted and his eyes darting back and forth, checking for traffic lights. Willie leads the cat along a winding trail leading to the back gate of a small, humble, old-money Coastal apartment, inspecting the scenery."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Teddy the Spotted Unicorn is watched over by numerous Queen's goblin statues, one dressed in astronaut gear and another in a toga and crown. A queue of curious adults is visible as Brenda tiptoes through, provoking laughter and applause from the elders. Pandering to the audience, Brenda picks a book from the table and sips from it while Brenda glares at him. She then snatches the scarf, throws it into Joey's shoulder, and as Joey leaps, nudges him in the shin. On the edge of the Pineapple Circle Park's driveway, a bicycle halts with a honk and the tires part to expose a cheerful TEENAGER, lanky, freckle-faced, well-dressed, and probably smelling of flowers. As the teenager approaches the park entrance, he walks past a gang of younger adults doing cartwheel maneuvers, who glance at him. Brenda places another little girl on her hat and then dances over to the gate. The freckle-faced Teenager is next in queue, paralyzed by excitement, but Brenda's gestures pierce the Teenager's excitement and she advances. Brenda guides the Teenager up to the podium and situates him on Joey's shoulder. The Teenager just gazes, motionless except for the trickling stream of freckles, which Joey can't help but gaze at. Abruptly, the Teenager tugs Joey's jacket, holding it dangling beneath Joey's shoulder. Joey nudges the Teenager, who retreats, looking at him in wonder and continually maintaining his admiring gaze. The Teenager reclines on a chair, observing the gateway to Anderson's. After a moment, Joey and Brenda skip out in disguises and proceed toward the driveway, with the Teenager trailing from a cautious distance. Joey and Brenda skip across the vast vacant driveway, followed at a far-off distance by the Teenager, who inches closer to overhear their dialogue. A massive faux vintage café is packed to the brim with loosened-scarf senior executives as we observe someone's eyes around the venue until it locks with the inebriated, glowering expression of an Icelandic Peacemaker sitting right aside from him, surprising Joey briefly. He pours two juices, and they both slam them down as he pours. Joey gazes at him while the woman gazes at him for a moment. The Peacemaker halts and glances up to notice the Teenager tapping on his elbows, letting Joey a moment to gather composure. The Teenager reclines in the back seat next to Joey, who sails while musing and replying absent-mindedly, with his head slightly raised and his eyes darting up and down, searching for street signals. Joey guides the Teenager along a short bridge leading to the back entrance of a tiny, extravagant, old-money Northeastern palace, appreciating the scenery."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rudolfo the Red Nosed Burro is surrounded by Santa's elf mannequins, and a line of excited children watches as Marcus entertains them by theatrically swigging from a bottle. Meanwhile, a pathetic eight-year-old boy, nervous and snot-nosed, approaches Marcus and is placed on Willie's lap, where he tugs Willie's beard, showing awe. The Kid follows Willie and Marcus as they exit the mall and head across the parking lot. In a crowded bar, Willie is briefly startled by a Hindustani Troublemaker, who stares at him. The Kid's interference gives Willie a moment to recover. Later, Willie drives with the Kid next to him, cautiously checking road signs. Finally, Willie guides the Kid along a path to a grand Southwestern home, taking in its opulent surroundings."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs  The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure  Willie stares at her while the man stares at him for a beat  She pours two drinks and they both pound them back as she pours  A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow someone's gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment  Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation  After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance  The Kid sits on a bench watching the entrance to Chamberlain's  Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare  Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin  The Kid just stares motionless except for the flowing rivulet of snot which Willie can't help but stare at  Marcus leads the Kid up to the throne and places him on Willie's lap  The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves  Marcus puts another young boy on his lap and then walks over to the rope  As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him  On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee  He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass  Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him  A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids  Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She pours two drinks and they both pound them back as she pours  Marcus leads the Kid up to the throne and places him on Willie's lap  He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass  Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare  Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin  A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow someone's gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment  A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids  The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure  As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him  The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs  Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him  Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero  The Kid sits on a bench watching the entrance to Chamberlain's  On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee  The Kid just stares motionless except for the flowing rivulet of snot which Willie can't help but stare at  Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation  The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves  After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance  Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings Marcus puts another young boy on his lap and then walks over to the rope  Willie stares at her while the man stares at him for a beat "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Willie shoves the Kid who backs away looking at him in awe and never breaking his reverent stare  The Kid sits on a bench watching the entrance to Chamberlain's  After a beat Willie and Marcus walk out in costume and cross toward the parking lot with the Kid following from a safe distance  Willie and Marcus walk across the huge empty parking lot followed at a great distance by the Kid who creeps closer to hear their conversation  A large faux rustic bar is filled to capacity with loosenedtie middlemanagement as we follow someone's gaze around the room until it connects with the drunken glowering face of a Hindustani Troublemaker sitting right across from him startling Willie for a moment  She pours two drinks and they both pound them back as she pours  Willie stares at her while the man stares at him for a beat  The Troublemaker stops and looks down to find the Kid beating on his legs allowing Willie a chance to regain composure  The Kid sits in the front seat next to Willie who drives while stewing and answering absently with his head slightly ducked and his eyes darting side to side checking for road signs  Willie escorts the Kid along a long walkway leading to the front door of a large opulent newmoney Southwestern home admiring the surroundings Rudolfo the Red Nosed Burro is tended by several Santa's elf mannequins one dressed in cowboy wear and another in a poncho and sombrero  A line of waiting children is present as Marcus makes his way through eliciting gasps and cheers from the kids  Playing to the crowd Marcus takes a bottle from the floor and swigs from it while Marcus stares at him  He then grabs the hat slams it into Willie's chest and as Willie rises kicks him in the ass  On the outskirts of the Saguaro Square Mall's parking lot a city bus stops with a hiss and the doors open to reveal a pathetic EIGHTYEAROLD KID overweight snotnosed badly dressed and probably smelling of pee  As the kid nears the mall entrance he passes a group of older children doing skateboard stunts who notice him  Marcus puts another young boy on his lap and then walks over to the rope  The snotnosed Kid is next in line frozen by fear but Marcus's actions penetrate the Kid's fear and he moves  Marcus leads the Kid up to the throne and places him on Willie's lap  The Kid just stares motionless except for the flowing rivulet of snot which Willie can't help but stare at  Suddenly the Kid yanks Willie's beard holding it stretched below Willie's chin "
        }
      ]
    }
  ]
}