{
  "ground_truth": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie, wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck, while he watches as the senile old woman innocently putters away. He yanks off his mask and turns to the Kid, who shakes his head. The sound of a tumbler tripping is heard, and suddenly, light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and, in the foreground, a few stacks of cash and a folio. Willie reaches in, grabs the folio, and flips through it. A new Mercedes screeches through the frame, and as it recedes, we are left looking at the Kid, who stands at the curb, waving happily, while Willie and Marcus walk to their cars. Opal looks at him with disdain and reluctantly sidles over. Willie is at a pay phone, and the Kid swings the door open to Willie, who stands on the stoop holding a small grip. The Kid follows Willie like a puppy dog as Willie checks out the house, bumping open doors and looking around. Willie has discovered the master bedroom, which appears long unused, and he tosses his grip onto the double bed. Willie lies in the tub, motionless, with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under his washcloth, he drags the washcloth off his face and looks at the Kid, who looks at him unperturbed. She glances in as the person passes, and still chewing, gets out her notebook and jots something down. Willie stares at the board for a long beat, then leaps up screaming and flings the board across the room, while the Kid's face remains unfazed and still smiling. The kid lies in bed, sleeping peacefully as Willie bangs Sue in the Jacuzzi, wearing his Santa hat, while blearily, she gazes back. He closes the door, then tips back the bottle and polishes it off with a series of quick gulps. Ever so daintily, he puts the bottle down, and a beat later -- WHAM! -- he faints dead away, hitting the floor like a felled tree. Willie wakes on the floor to the sound of the scream, a bedroom door crashes open, and the Kid emerges screaming and runs right into Willie, immediately caroms off, and goes screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints down one side of the hall while the Kid, screaming, is just disappearing at the far end.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Grandmother ascends from her seat with the aid of her walker and commences to move toward Willie, wearing a bathrobe and thick spectacles with another pair of spectacles on a chain around her neck, while he observes as the forgetful elderly woman innocently putters away. He yanks off his mask and turns to the Youth, who shakes his head. The noise of a tumbler tripping is heard, and suddenly, illumination sweeps in as the vault door opens to reveal a smiling Willie with his stethoscope in his ears and, in the foreground, a few piles of currency and a portfolio. Willie reaches in, seizes the portfolio, and flips through it. A new Mercedes screeches through the frame, and as it recedes, we are left observing the Youth, who stands at the curb, waving happily, while Willie and Marcus stroll to their vehicles. Opal looks at him with scorn and reluctantly edges over. Willie is at a pay telephone, and the Youth swings the portal open to Willie, who stands on the stoop holding a small grip. The Youth follows Willie like a puppy dog as Willie inspects the residence, nudging open doors and looking around. Willie has discovered the master bedroom, which seems long unused, and he tosses his grip onto the double bed. Willie reclines in the tub, motionless, with a wet washcloth over his visage and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under his washcloth, he drags the washcloth off his visage and looks at the Youth, who looks at him nonchalantly. She glances in as the person passes, and still chewing, retrieves her notebook and jots something down. Willie gazes at the board for a long moment, then leaps up yelling and flings the board across the chamber, while the Youth's face remains unfazed and still smiling. The youth lies in bed, sleeping peacefully as Willie bangs Sue in the Jacuzzi, wearing his Santa hat, while groggily, she gazes back. He closes the portal, then tips back the bottle and drains it with a series of swift gulps. Ever so delicately, he places the bottle down, and a moment later -- WHAM! -- he faints dead away, hitting the floor like a felled tree. Willie awakes on the floor to the sound of the shriek, a bedroom portal crashes open, and the Youth emerges shrieking and runs right into Willie, immediately caroms off, and goes shrieking down the corridor, turning the corner to see a row of fresh, bloody palm-prints down one side of the corridor while the Youth, shrieking, is just disappearing at the far extremity."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Grandma is assisted by her walker to rise from her chair and to begin moving toward Willie. She wears a bathrobe and thick glasses with another pair of glasses on a chain around her neck, while Willie watches the senile old woman innocently putter away. The mask is yanked off by him, and he turns to the Kid, who shakes his head. Willie hears the sound of a tumbler tripping, and suddenly, light sweeps in as the safe door is opened, revealing a smiling Willie with his stethoscope in his ears and, in the foreground, a few stacks of cash and a folio. The folio is reached for by Willie, who grabs it and flips through it. A new Mercedes screeches through the frame, and as it recedes, the Kid is left standing at the curb, waving happily, while Willie and Marcus walk to their cars. Opal looks at him with disdain and reluctantly sidles over. At a pay phone, Willie is stood by him, and the door is swung open to Willie by the Kid, who stands on the stoop holding a small grip. Willie is followed by the Kid like a puppy dog as the house is checked out by Willie, who bumps open doors and looks around. The master bedroom, which appears long unused, has been discovered by Willie, and his grip is tossed onto the double bed by him. In the tub, motionless, Willie lies with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under his washcloth, he drags it off his face and looks at the Kid, who remains unperturbed as he looks at him. As the person passes, a glance is given by her while still chewing, she gets out her notebook and jots something down. The board is stared at by Willie for a long beat, then he leaps up screaming and flings the board across the room, while the Kid's face remains unfazed and still smiling. The kid is sleeping peacefully in bed as Willie bangs Sue in the Jacuzzi, wearing his Santa hat, while blearily, she gazes back. The door is closed by him, then the bottle is tipped back and polished off with a series of quick gulps. Ever so daintily, he puts the bottle down, and a beat later -- WHAM! -- he faints dead away, hitting the floor like a felled tree. Willie wakes on the floor to the sound of the scream, crashes open a bedroom door, and the Kid emerges screaming and runs right into Willie. He immediately caroms off and goes screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints down one side of the hall while the Kid, screaming, is just disappearing at the far end."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Grandma rises with her walker, wearing a bathrobe and thick glasses, while Willie watches her putter away. He removes his mask and turns to the Kid, who shakes his head. A tumbler clicks, light floods in, and the safe door opens to reveal Willie with a stethoscope, stacks of cash, and a folio. Willie grabs the folio and flips through it. A new Mercedes screeches by, leaving the Kid waving happily at the curb as Willie and Marcus head to their cars. Opal looks disdainfully and reluctantly approaches. Willie is at a pay phone, and the Kid opens the door for him. The Kid follows Willie, who checks out the house, discovering the unused master bedroom and tossing his grip onto the bed. Willie lies motionless in the tub, a washcloth on his face, fingers resting on a tumbler of ice and amber liquid. He removes the washcloth and looks at the unperturbed Kid. She glances in, takes notes, and Willie stares at the board, then screams and flings it across the room, while the Kid remains unfazed. The Kid sleeps peacefully as Willie, in a Santa hat, is with Sue in the Jacuzzi. He finishes a bottle, sets it down, and faints, hitting the floor. Willie wakes to a scream, a door crashes open, and the Kid runs into him, then down the hall, seeing fresh, bloody palm prints as he disappears at the far end."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Grandma rises with her walker, wearing a bathrobe and thick glasses, while Willie watches her putter away. He removes his mask and turns to the Kid, who shakes his head. A tumbler trips, light floods in, and the safe opens, revealing Willie with a stethoscope, cash, and a folio. Willie grabs the folio and flips through it. A Mercedes screeches by, leaving the Kid waving happily as Willie and Marcus head to their cars. Opal looks disdainfully and reluctantly approaches. Willie is at a pay phone, and the Kid opens the door for him. The Kid follows Willie, who checks the house, discovering the unused master bedroom and tossing his grip on the bed. Willie lies in the tub with a washcloth over his face, holding a tumbler of amber liquid. He removes the washcloth and looks at the unperturbed Kid. She glances in, jots something in her notebook, and Willie stares at the board before flinging it across the room, while the Kid remains unfazed. The Kid sleeps peacefully as Willie, in a Santa hat, is with Sue in the Jacuzzi. He closes the door, finishes a bottle, and faints. Willie wakes to a scream, a door crashes open, and the Kid runs into him, then down the hall, seeing fresh, bloody palm prints as the Kid disappears."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Grandma, with a slow and deliberate effort, rises from her comfortable chair, relying on the steady support of her walker to assist her. She begins to make her way toward Willie, who observes her with a watchful eye. She is dressed in a cozy bathrobe and wears thick glasses, with an additional pair of spectacles hanging on a chain around her neck. As the senile old woman innocently putters away, Willie watches her with a mix of amusement and patience. He then abruptly yanks off his mask and turns his attention to the Kid, who simply shakes his head in response. The sound of a tumbler tripping is suddenly heard, and in an instant, light floods the room as the safe door swings open. This reveals a smiling Willie, who has a stethoscope in his ears, and in the foreground, there are a few stacks of cash and a folio. Willie eagerly reaches into the safe, grabs the folio, and begins to flip through its contents. Meanwhile, a new Mercedes screeches through the frame, and as it recedes into the distance, we are left with the image of the Kid standing at the curb, waving happily. Willie and Marcus then proceed to walk to their cars. Opal, looking at him with disdain, reluctantly sidles over. Willie is seen at a pay phone, and the Kid swings the door open to him, as Willie stands on the stoop holding a small grip. The Kid follows Willie closely, like a loyal puppy dog, as Willie checks out the house, bumping open doors and looking around with curiosity. Willie eventually discovers the master bedroom, which appears to have been long unused, and he casually tosses his grip onto the double bed. Later, Willie is lying motionless in the tub, with a wet washcloth draped over his face. The fingers of one hand rest against a tumbler filled with ice and amber liquid, which sits precariously on the edge of the tub. From beneath the washcloth, he drags it off his face and looks at the Kid, who remains unperturbed by the scene. She glances in as a person passes by, and while still chewing, she gets out her notebook and jots something down. Willie stares at the board for a long, tense moment, then suddenly leaps up, screaming, and flings the board across the room in a fit of frustration, while the Kid's face remains unfazed and still smiling. The Kid lies in bed, sleeping peacefully, as Willie engages in a passionate moment with Sue in the Jacuzzi, wearing his Santa hat, while she gazes back at him blearily. He then closes the door, tips back the bottle, and polishes it off with a series of quick gulps. Ever so daintily, he places the bottle down, and a beat later—WHAM!—he faints dead away, hitting the floor like a felled tree. Willie eventually wakes up on the floor to the sound of a scream. A bedroom door crashes open, and the Kid emerges, screaming, and runs right into Willie. The Kid immediately caroms off and continues screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints down one side of the hall, while the Kid, still screaming, is just disappearing at the far end."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Grandma, with a slow and deliberate effort, painstakingly rises from the comfort of her favorite, cushioned chair, relying heavily on the steady and dependable support provided by her walker to assist her. She begins to make her gradual way toward Willie, who observes her movements with a careful and watchful eye. She is dressed in a cozy and warm bathrobe and wears thick glasses, with an additional pair of spectacles stylishly hanging on a delicate chain around her neck. As the senile old woman innocently putters away at her own unhurried pace, Willie watches her with a mix of amusement and patience. He then abruptly and without warning yanks off his mask and turns his attention to the Kid, who responds simply by shaking his head in a silent reply. \n\nSuddenly, the sound of a tumbler tripping is heard, and in an instant that seems almost magical, light floods the room as the safe door swings open with a soft creak. This dramatic reveal shows a smiling Willie, who has a stethoscope snugly positioned in his ears, and in the foreground, there are a few neat stacks of cash and a folio. Willie eagerly reaches into the open safe, grabs the folio with anticipation, and begins to flip through its contents with interest. Meanwhile, a new Mercedes screeches through the frame, and as it recedes into the distance, we are left with the heartwarming image of the Kid standing at the curb, waving happily. Willie and Marcus then proceed to walk briskly toward their cars. Opal, looking at him with disdain and reluctance, sidles over with hesitation. Willie is later seen at a pay phone, and the Kid swings the door open to him, as Willie stands on the stoop, carrying a small grip in his hand. The Kid follows Willie closely, like a loyal puppy dog, as Willie checks out the house, methodically bumping open doors and looking around with curiosity and interest.\n\nWillie eventually discovers the master bedroom, which appears to have been long unused, and he casually tosses his grip onto the expansive double bed. Later, Willie is found lying motionless in the tub, with a wet washcloth draped over his face. The fingers of one hand rest lazily against a tumbler filled with ice and amber liquid, which sits precariously close to the edge of the tub. From beneath the washcloth, he drags it off his face and looks at the Kid, who remains unperturbed by the scene. She glances in as a person passes by, and while still chewing, she retrieves her notebook and jots something down. Willie stares at the board for a long, tense moment, then suddenly leaps up, screaming loudly, and flings the board across the room in a fit of frustration, while the Kid's face remains unfazed and still wearing a smile.\n\nThe Kid lies in bed, sleeping peacefully and undisturbed, as Willie engages in a passionate and intimate moment with Sue in the bubbling Jacuzzi, wearing his Santa hat, while she gazes back at him blearily. He then closes the door, tips back the bottle, and polishes it off with a series of quick gulps. Ever so daintily, he places the bottle down, and a beat later—WHAM!—he faints dead away, hitting the floor with a thud like a felled tree. Willie eventually wakes up on the floor to the sudden and startling sound of a scream. A bedroom door crashes open, and the Kid emerges, screaming loudly, and runs right into Willie. The Kid immediately caroms off and continues screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints ominously down one side of the hall, while the Kid, still screaming, is just disappearing at the far end, leaving chaos in their wake."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Grandma slowly rises from her chair, using her walker for support, and begins to shuffle toward Willie. She is dressed in a bathrobe and wears thick glasses, with another pair of glasses hanging on a chain around her neck. Willie watches as the senile old woman innocently putters away, her movements slow and deliberate. He then abruptly yanks off his mask and turns to face the Kid, who simply shakes his head in response. Suddenly, the sound of a tumbler tripping is heard, and light floods the room as the safe door swings open. Inside, Willie stands smiling, with a stethoscope in his ears, and in the foreground, a few stacks of cash and a folio are visible. Willie reaches into the safe, grabs the folio, and begins to flip through its contents. Meanwhile, a new Mercedes screeches through the frame, and as it recedes, the scene shifts to the Kid, who stands at the curb, waving happily. Willie and Marcus walk toward their cars, and Opal looks at the Kid with disdain before reluctantly sidling over. Willie is then seen at a pay phone, and the Kid swings the door open to him, revealing Willie standing on the stoop holding a small grip. The Kid follows Willie closely, like a puppy dog, as Willie checks out the house, bumping open doors and looking around with curiosity. Willie eventually discovers the master bedroom, which appears long unused, and he casually tosses his grip onto the double bed. Later, Willie lies motionless in the tub, a wet washcloth draped over his face, while the fingers of one hand rest against a tumbler filled with ice and amber liquid that sits precariously on the edge of the tub. From beneath the washcloth, he drags it off his face and looks at the Kid, who remains unperturbed by the scene. As someone passes by, she glances in, still chewing, and retrieves her notebook to jot something down. Willie stares at the board for a long moment, then suddenly leaps up, screaming, and flings the board across the room in a fit of rage, while the Kid's face remains unfazed and still smiling. The Kid lies in bed, sleeping peacefully, as Willie engages in a passionate encounter with Sue in the Jacuzzi, wearing his Santa hat, while she gazes back at him blearily. Afterward, he closes the door, tips back a bottle, and polishes it off with a series of quick gulps. Ever so daintily, he places the bottle down, but a beat later -- WHAM! -- he faints dead away, collapsing to the floor like a felled tree. Willie eventually wakes on the floor to the sound of a scream, and a bedroom door crashes open as the Kid emerges, screaming, and runs directly into Willie. The Kid immediately caroms off and continues screaming down the hall, turning the corner to witness a row of fresh, bloody palm-prints smeared down one side of the hall, while the Kid, still screaming, disappears at the far end."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Grandma, wearing a bathrobe and thick glasses with another pair on a chain, rises with her walker and moves toward Willie, who watches her putter away. Willie removes his mask and exchanges a glance with the Kid. The sound of a tumbler signals the safe door opening, revealing Willie with a stethoscope, smiling at the sight of cash and a folio. He retrieves the folio and flips through it. A new Mercedes speeds by, leaving the Kid waving happily at the curb as Willie and Marcus head to their cars. Opal looks disdainfully at the Kid and reluctantly approaches. Willie, at a pay phone, is joined by the Kid, who follows him into the house, exploring and bumping open doors. In the master bedroom, Willie tosses his grip onto the bed. Later, he lies motionless in the tub with a washcloth over his face, a tumbler of amber liquid nearby. He removes the washcloth and looks at the unperturbed Kid. As someone passes by, she notes something in her notebook. Willie stares at a board, then suddenly screams and throws it across the room, while the Kid remains unfazed. The Kid sleeps peacefully as Willie, wearing a Santa hat, is with Sue in the Jacuzzi. Afterward, he finishes a bottle with quick gulps, sets it down, and faints, hitting the floor. Willie wakes to a scream, and the Kid crashes into him before running down the hall, where fresh, bloody palm prints are visible as the Kid disappears at the far end."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Grandma rises from her chair with the assistance of her walker, a common mobility aid for the elderly to ensure stability, and begins to move toward Willie, wearing a bathrobe typical of someone enjoying comfort at home, and thick glasses with another pair of reading glasses on a chain around her neck, while he watches as the senile old woman, suffering from age-related cognitive decline, innocently putters away. He yanks off his mask and turns to the Kid, who shakes his head, signaling disapproval or disbelief. The sound of a tumbler tripping, a mechanism often used in safes to lock or unlock them, is heard, and suddenly, light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears, a tool often used by safecrackers to listen for the tumbler's clicks, and, in the foreground, a few stacks of cash and a folio possibly containing important documents or financial information. Willie reaches in, grabs the folio, and flips through it. A new Mercedes, a luxury car brand known for its sleek design and powerful engines, screeches through the frame, and as it recedes, we are left looking at the Kid, who stands at the curb, waving happily, while Willie and Marcus, possibly his accomplice, walk to their cars. Opal looks at him with disdain and reluctantly sidles over, clearly uncomfortable with the situation or people involved. Willie is at a pay phone, an increasingly rare sight due to the prevalence of mobile phones, and the Kid swings the door open to Willie, who stands on the stoop holding a small grip, a term sometimes used for a carry-on bag. The Kid follows Willie like a puppy dog as Willie checks out the house, possibly assessing it for valuables or planning, bumping open doors and looking around. Willie has discovered the master bedroom, which appears long unused, and he tosses his grip onto the double bed. Willie lies in the tub, motionless, with a wet washcloth over his face, a common practice for cooling or soothing headaches, and the fingers of one hand resting against a tumbler filled with ice and amber liquid, likely a whiskey or bourbon, that sits on the edge of the tub. From under his washcloth, he drags the washcloth off his face and looks at the Kid, who looks at him unperturbed, demonstrating a calm or indifferent demeanor. She glances in as the person passes, and still chewing, gets out her notebook and jots something down, possibly taking notes or documenting something important. Willie stares at the board for a long beat, then leaps up screaming and flings the board across the room, indicating a moment of intense frustration or realization, while the Kid's face remains unfazed and still smiling. The Kid lies in bed, sleeping peacefully as Willie bangs Sue in the Jacuzzi, a luxury item often associated with relaxation or indulgence, wearing his Santa hat, a whimsical or absurd element given the context, while blearily, she gazes back. He closes the door, then tips back the bottle and polishes it off with a series of quick gulps, indicative of heavy drinking perhaps due to stress or lifestyle. Ever so daintily, he puts the bottle down, and a beat later -- WHAM! -- he faints dead away, hitting the floor like a felled tree, a simile emphasizing the suddenness and completeness of his collapse. Willie wakes on the floor to the sound of the scream, a bedroom door crashes open, and the Kid emerges screaming and runs right into Willie, immediately caroms off, and goes screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints down one side of the hall, a gruesome sight implying violence or danger, while the Kid, screaming, is just disappearing at the far end."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away  He yanks off his mask and turns to the Kid who shakes his head  The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio  Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed  Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub  From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed  She glances in as the person passes and still chewing gets out her notebook and jots something down  Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling  The kid lies in bed sleeping peacefully  as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back  He closes the door then tips back the bottle and polishes it off with a series of quick gulps  Ever so daintily he puts the bottle down and a beat later  WHAM   he faints dead away hitting the floor like a felled tree  Willie wakes on the floor to the sound of the scream  a bedroom door crashes open and the Kid emerges screaming and runs right into  Willie reaches in grabs the folio and flips through it  A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily  while Willie and Marcus walk to their cars  Opal looks at him with disdain and reluctantly sidles over  Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip  The Kid follows Willie like a puppy dog  as Willie checks out the house bumping open doors and looking around  Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed  Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub  From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed  She glances in as the person passes and still chewing gets out her notebook and jots something down  Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling  The kid lies in bed sleeping peacefully  as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back  He closes the door then tips back the bottle and polishes it off with a series of quick gulps  Ever so daintily he puts the bottle down and a beat later  WHAM   he faints dead away hitting the floor like a felled tree  Willie wakes on the floor to the sound of the scream  a bedroom door crashes open and the Kid emerges screaming and runs right into  Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away. He yanks off his mask and turns to the Kid who shakes his head. The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio. Willie reaches in grabs the folio and flips through it. A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily. while Willie and Marcus walk to their cars. Opal looks at him with disdain and reluctantly sidles over. Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip. The Kid follows Willie like a puppy dog. as Willie checks out the house bumping open doors and looking around. Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed. She glances in as the person passes and still chewing gets out her notebook and jots something down. Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling. The kid lies in bed sleeping peacefully. as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back. He closes the door then tips back the bottle and polishes it off with a series of quick gulps. Ever so daintily he puts the bottle down and a beat later  WHAM. he faints dead away hitting the floor like a felled tree. Willie wakes on the floor to the sound of the scream. a bedroom door crashes open and the Kid emerges screaming and runs right into. Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away. He yanks off his mask and turns to the Kid who shakes his head. The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio. Willie reaches in grabs the folio and flips through it. A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily. while Willie and Marcus walk to their cars. Opal looks at him with disdain and reluctantly sidles over. Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip. The Kid follows Willie like a puppy dog. as Willie checks out the house bumping open doors and looking around. Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed. She glances in as the person passes and still chewing gets out her notebook and jots something down. Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling. The kid lies in bed sleeping peacefully. as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back. He closes the door then tips back the bottle and polishes it off with a series of quick gulps. Ever so daintily he puts the bottle down and a beat later  WHAM. he faints dead away hitting the floor like a felled tree. Willie wakes on the floor to the sound of the scream. a bedroom door crashes open and the Kid emerges screaming and runs right into. Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away. He yanks off his mask and turns to the Kid who shakes his head. The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio. Willie reaches in grabs the folio and flips through it. A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily. while Willie and Marcus walk to their cars. He closes the door then tips back the bottle and polishes it off with a series of quick gulps. Ever so daintily he puts the bottle down and a beat later  WHAM. he faints dead away hitting the floor like a felled tree. Willie wakes on the floor to the sound of the scream. a bedroom door crashes open and the Kid emerges screaming and runs right into. Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away. He yanks off his mask and turns to the Kid who shakes his head. Willie wakes on the floor to the sound of the scream. a bedroom door crashes open and the Kid emerges screaming and runs right into. Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Grandpa rises from his chair with the assistance of his walker and begins to move toward the squirrel, wearing a bathrobe and thick glasses with another pair of glasses on a chain around his neck, while it watches as the senile old man innocently putters away. It yanks off its mask and turns to the giraffe, who shakes its head. The sound of a tumbler tripping is heard, and suddenly, light sweeps in as the safe door opens to reveal a smiling squirrel with its stethoscope in its ears and, in the foreground, a few stacks of cash and a folio. The rabbit reaches in, grabs the folio, and flips through it. A new Mercedes screeches through the frame, and as it recedes, we are left looking at the giraffe, who stands at the curb, waving happily, while the rabbit and Marcus walk to their cars. Opal looks at it with disdain and reluctantly sidles over. The squirrel is at a pay phone, and the giraffe swings the door open to the squirrel, who stands on the stoop holding a small grip. The giraffe follows the squirrel like a puppy dog as the squirrel checks out the house, bumping open doors and looking around. The rabbit has discovered the master bedroom, which appears long unused, and it tosses its grip onto the double bed. The squirrel lies in the tub, motionless, with a wet washcloth over its face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub. From under its washcloth, it drags the washcloth off its face and looks at the giraffe, who looks at it unperturbed. It glances in as the person passes, and still chewing, gets out its notebook and jots something down. The rabbit stares at the board for a long beat, then leaps up screaming and flings the board across the room, while the giraffe's face remains unfazed and still smiling. The giraffe lies in bed, sleeping peacefully as the rabbit bangs Sue in the Jacuzzi, wearing its Santa hat, while blearily, she gazes back. It closes the door, then tips back the bottle and polishes it off with a series of quick gulps. Ever so daintily, it puts the bottle down, and a beat later -- WHAM! -- it faints dead away, hitting the floor like a felled tree. The squirrel wakes on the floor to the sound of the scream, a bedroom door crashes open, and the giraffe emerges screaming and runs right into the squirrel, immediately caroms off, and goes screaming down the hall, turning the corner to see a row of fresh, bloody palm-prints down one side of the hall while the giraffe, screaming, is just disappearing at the far end."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Grandma rises from her stool with the assistance of her cane and begins to move toward Willie, wearing a cardigan and thick sunglasses with another pair of binoculars on a chain around her neck, while he watches as the senile old woman innocently putters away. He yanks off his cap and turns to the Kid, who shakes his head. The sound of a wheel spinning is heard, and suddenly, light sweeps in as the cabinet door opens to reveal a smiling Willie with his headphones in his ears and, in the foreground, a few stacks of coins and a ledger. Willie reaches in, grabs the ledger, and flips through it. A new bicycle screeches through the frame, and as it recedes, we are left looking at the Kid, who stands at the sidewalk, waving happily while Willie and Marcus walk to their scooters. Opal looks at him with disdain and reluctantly sidles over. Willie is at a mailbox, and the Kid swings the flap open to Willie, who stands on the stoop holding a small backpack. The Kid follows Willie like a puppy dog as Willie checks out the apartment, bumping open windows and looking around. Willie has discovered the guest room, which appears long unused, and he tosses his backpack onto the single bed. Willie lies in the shower, motionless, with a wet towel over his face and the fingers of one hand resting against a goblet filled with ice and clear liquid that sits on the edge of the shower. From under his towel, he drags the towel off his face and looks at the Kid, who looks at him unperturbed. She glances in as the person passes, and still chewing, gets out her laptop and jots something down. Willie stares at the chalkboard for a long beat, then leaps up screaming and flings the chalkboard across the room, while the Kid's face remains unfazed and still smiling. The kid lies in bed, sleeping peacefully as Willie bangs Sue in the pool, wearing his cowboy hat, while blearily, she gazes back. He closes the curtain, then tips back the glass and polishes it off with a series of quick gulps. Ever so daintily, he puts the glass down, and a beat later -- WHAM! -- he faints dead away, hitting the rug like a felled tree. Willie wakes on the rug to the sound of the crash, a closet door crashes open, and the Kid emerges screaming and runs right into Willie, immediately caroms off, and goes screaming down the corridor, turning the corner to see a row of fresh, bloody footprints down one side of the corridor while the Kid, screaming, is just disappearing at the far end."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Grandma descends from her chair with the assistance of her walker and starts to shuffle toward Willie, wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck, while he observes as the senile old woman cheerfully drifts away. He removes his mask and glances at the Kid, who nods solemnly. The sound of a clock chiming is heard, and suddenly, darkness envelops as the safe door closes to reveal a frowning Willie with his stethoscope in his ears and, in the foreground, a few stacks of homework and a folio. Willie reaches in, leaves the folio, and flips it shut. A new Mercedes glides through the frame, and as it advances, we are left gazing at the Kid, who stands at the curb, shaking his head, while Willie and Marcus stride to their cars. Opal looks at him with admiration and eagerly edges over. Willie is at a bench, and the Kid slides the door shut to Willie, who stands on the stoop holding a large box. The Kid follows Willie like a shadow as Willie inspects the house, nudging closed doors and glancing around. Willie has inspected the master bedroom, which appears frequently used, and he flings his box onto the double bed. Willie sits in the tub, quietly, with a wet towel over his face and the fingers of one hand brushing a tumbler filled with ice and amber liquid that rests on the edge of the tub. From under his towel, he pulls the towel onto his face and listens to the Kid, who watches him curiously. She peers in as the person departs, and still writing, takes out her notebook and writes something down. Willie glares at the board for a long breath, then sits down muttering and drops the board onto the carpet, while the Kid's face remains surprised and still expressionless. The kid lies in bed, tossing fitfully as Willie massages Sue in the Jacuzzi, wearing his Santa hat, while dreamily, she looks away. He opens the door, then sets down the bottle and seals it off with a series of slow twists. Ever so clumsily, he picks the bottle up, and a beat later -- THUD! -- he stands upright, feeling dizzy like a spinning top. Willie rises on the floor to the sound of silence, a bedroom door creaks open, and the Kid walks calmly to Willie, promptly bumps off, and strolls silently down the hall, turning the corner to see a row of neat, clean handprints down one side of the hall while the Kid, whispering, is just appearing at the far end."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The refrigerator rises from its skateboard with the assistance of its hammer and begins to move toward the blanket, wearing a lampshade and thick binoculars with another pair of binoculars on a chain around its neck, while it watches as the senile young tree innocently putters away. It yanks off its helmet and turns to the frisbee, who shakes its head. The sound of a blender tripping is heard, and suddenly, light sweeps in as the oven door opens to reveal a smiling blanket with its telescope in its ears and, in the foreground, a few stacks of pencils and a lantern. The blanket reaches in, grabs the lantern, and flips through it. A new bicycle screeches through the frame, and as it recedes, we are left looking at the frisbee, who stands at the pool, waving happily, while the blanket and the suitcase walk to their scooters. The pig looks at it with disdain and reluctantly sidles over. The blanket is at a treehouse, and the frisbee swings the door open to the blanket, who stands on the sidewalk holding a small boot. The frisbee follows the blanket like a goldfish as the blanket checks out the igloo, bumping open windows and looking around. The blanket has discovered the laundry room, which appears long unused, and it tosses its boot onto the double oven. The blanket lies in the hammock, motionless, with a wet towel over its face and the fingers of one hand resting against a teapot filled with ice and amber liquid that sits on the edge of the hammock. From under its towel, it drags the towel off its face and looks at the frisbee, who looks at it unperturbed. It glances in as the bat passes, and still chewing, gets out its laptop and jots something down. The blanket stares at the calendar for a long beat, then leaps up screaming and flings the calendar across the attic, while the frisbee's face remains unfazed and still smiling. The frisbee lies in the closet, sleeping peacefully as the blanket bangs the sandwich in the bathtub, wearing its pirate hat, while blearily, it gazes back. It closes the window, then tips back the mug and polishes it off with a series of quick gulps. Ever so daintily, it puts the mug down, and a beat later -- WHAM! -- it faints dead away, hitting the carpet like a felled cactus. The blanket wakes on the carpet to the sound of the whistle, a closet door crashes open, and the frisbee emerges screaming and runs right into the blanket, immediately caroms off, and goes screaming down the corridor, turning the corner to see a row of fresh, bloody socks down one side of the corridor while the frisbee, screaming, is just disappearing at the far end."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The penguin hops from her iceberg with the assistance of her flippers and begins to paddle toward Marvin, dressed in a tuxedo and thick glasses with another pair of glasses on a strap around her beak, while he observes as the forgetful old bird innocently flaps away. He peels off his mask and glances to the Rabbit, who nods his ears. The sound of a cuckoo clock chiming is heard, and suddenly, light glances in as the treasure chest lid opens to reveal a grinning Marvin with his monocle in his eyepiece and, in the foreground, a pile of jelly beans and a pamphlet. Marvin reaches in, snatches the pamphlet, and fans through it. A flashy skateboard zips through the frame, and as it departs, we are left gazing at the Rabbit, who stands at the curb, clapping quietly, while Marvin and Alice stroll to their scooters. Daisy glowers at him with disapproval and reluctantly shuffles over. Marvin is at a water fountain, and the Rabbit swings the door open to Marvin, who stands on the porch holding a small satchel. The Rabbit follows Marvin like a duckling as Marvin checks out the garden, nudging open doors and peering around. Marvin has stumbled upon the living room, which appears long abandoned, and he hurls his satchel onto the couch. Marvin reclines in the tub, still, with a wet sponge over his eyes and the fingertips of one hand touching a glass filled with ice and red juice that sits on the edge of the tub. From beneath his sponge, he slides the sponge off his face and glances at the Rabbit, who gazes at him unflustered. She peeks in as the squirrel scurries by, and still munching, retrieves her camera and snaps a photo. Marvin examines the painting for a long moment, then springs up chattering and hurls the painting across the room, while the Rabbit's expression remains unmoved and still grinning. The rabbit lies on the hammock, sleeping comfortably as Marvin tickles Sue in the hot tub, sporting his top hat, while sleepily, she peers back. He slides the curtain, then leans back the goblet and gulps it down with a series of swift sips. Ever so gently, he sets the goblet down, and a moment later -- BAM! -- he collapses instantly, striking the floor like a toppled statue. Marvin revives on the floor to the noise of the alarm, a closet door flies open, and the Rabbit appears squealing and dashes directly into Marvin, promptly bounces off, and goes squealing down the corridor, turning the corner to glimpse a line of fresh, chocolate paw-prints down one side of the hall while the Rabbit, squealing, is just vanishing at the far end."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Grandma ascends from her sofa with the guidance of her umbrella and begins to glide toward Willie, wearing a nightgown and thick goggles with another pair of spectacles on a string around her neck, while he observes as the absent-minded old woman cheerfully wanders away. He pulls off his hat and turns to the Kid, who shrugs his shoulders. The sound of a doorbell ringing is heard, and suddenly, shadows flood in as the vault lid opens to reveal a grinning Willie with his headphones on his head and, in the foreground, a few piles of books and a folder. Willie reaches in, snatches the folder, and flips through it. A new bicycle whizzes through the frame, and as it vanishes, we are left observing the Kid, who stands at the sidewalk, clapping enthusiastically, while Willie and Marcus stroll to their scooters. Opal looks at him with disgust and reluctantly shuffles over. Willie is at an ATM, and the Kid pushes the door open to Willie, who stands on the porch holding a small duffel. The Kid trails Willie like a shadow as Willie inspects the apartment, nudging open windows and peeking around. Willie has located the guest room, which appears long unoccupied, and he tosses his duffel onto the twin bed. Willie reclines in the hot tub, still, with a dry towel over his face and the fingers of one hand resting against a goblet filled with milk and clear liquid that rests on the rim of the tub. From under his towel, he pulls the towel off his face and glances at the Kid, who looks at him unconcerned. She peeks in as the individual passes, and still chewing, fetches her diary and scribbles something down. Willie gazes at the map for a long pause, then leaps up yelling and hurls the map across the space, while the Kid's face remains unbothered and still beaming. The kid lies in bed, dozing contentedly as Willie strums a guitar in the hot tub, wearing his elf hat, while wearily, she peers back. He shuts the window, then chugs back the mug and drains it with a sequence of rapid sips. Ever so gracefully, he places the mug down, and a moment later -- BAM! -- he collapses face down, hitting the carpet like a fallen log. Willie comes to on the carpet to the sound of the shout, a closet door bursts open, and the Kid appears shouting and dashes right into Willie, immediately bounces off, and goes yelling down the corridor, rounding the corner to spot a line of fresh, red footprints down one side of the corridor while the Kid, shouting, is just vanishing at the far end."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Nana levitates from her hammock with the aid of her scooter and starts to drift toward Leo, dressed in a jumpsuit and oversized goggles with another pair of binoculars on a string around her wrist, while he listens as the forgetful young man cluelessly tinkers away. He peels off his wig and spins to the Cat, who nods his tail. The sound of a bell ringing is heard, and suddenly, darkness falls in as the wardrobe door closes to reveal a frowning Leo with his microphone in his paws and, in the background, a few piles of marbles and a ledger. Leo dives in, snatches the ledger, and flicks through it. A shiny bicycle zooms through the window, and as it approaches, we are left watching the Cat, who rests at the fence, meowing cheerfully, while Leo and Harry stroll to their bikes. Jade frowns at him with envy and hesitantly waddles over. Leo is at an ATM, and the Cat swings the gate closed to Leo, who stands on the lawn holding a large suitcase. The Cat trails Leo like a duckling as Leo inspects the garden, kicking open gates and snooping around. Leo has located the laundry room, which seems often crowded, and he slings his suitcase onto the single cot. Leo floats in the pool, lifeless, with a dry towel over his head and the claws of one paw resting against a glass filled with milk and clear liquid that perches on the brink of the pool. From beneath his towel, he drags the towel off his head and glances at the Cat, who stares at him indifferent. He peers in as the creature dashes by, and still chomping, pulls out his planner and scribbles something down. Leo observes the shelf for a long pause, then vaults up giggling and hurls the shelf into the ceiling, while the Cat's eyes remain unblinking and still grinning. The cat rests on a rug, napping soundly as Leo splashes Jen in the fountain, wearing his clown wig, while hazily, she peers back. He slams the lid, then pulls forward the flask and finishes it with a set of gentle sips. Ever so clumsily, he places the flask up, and a pause later -- BAM! -- he collapses breathlessly, hitting the rug like a toppled statue. Leo stirs on the rug to the noise of a whistle, a living room window slides shut, and the Cat appears whistling and collides straight with Leo, promptly bounces off, and dashes whistling through the garden, rounding the hedge to notice a line of old, dusty shoe-prints along one edge of the garden while the Cat, whistling, is just fading at the near end."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Grandma, aided by her walker, approaches Willie, wearing a bathrobe and thick glasses. Meanwhile, Willie removes his mask and opens a safe, revealing cash and a folio. A new Mercedes drives by as the Kid waves happily, and Willie and Marcus head to their cars. Opal disapprovingly joins them. Later, Willie, followed by the Kid, inspects a house, discovering an unused master bedroom. He lounges in a tub with a drink when the Kid arrives. Willie then angrily flings a board across the room, the Kid unfazed. While the Kid sleeps peacefully, Willie is in a Jacuzzi with Sue, wearing a Santa hat. Willie drinks heavily, faints, and wakes to the Kid's screams. The Kid runs into Willie and down a hall marked with bloody palm prints."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end a bedroom door crashes open and the Kid emerges screaming and runs right into  Willie wakes on the floor to the sound of the scream  he faints dead away hitting the floor like a felled tree  Ever so daintily he puts the bottle down and a beat later  WHAM   He closes the door then tips back the bottle and polishes it off with a series of quick gulps  as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back  The kid lies in bed sleeping peacefully  Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling  She glances in as the person passes and still chewing gets out her notebook and jots something down  From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed  Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub  Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed  as Willie checks out the house bumping open doors and looking around  The Kid follows Willie like a puppy dog  Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip  Opal looks at him with disdain and reluctantly sidles over  while Willie and Marcus walk to their cars  A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily  Willie reaches in grabs the folio and flips through it  The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio  He yanks off his mask and turns to the Kid who shakes his head  Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He closes the door then tips back the bottle and polishes it off with a series of quick gulps  Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip  he faints dead away hitting the floor like a felled tree  Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub  A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily  The kid lies in bed sleeping peacefully  Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end as Willie checks out the house bumping open doors and looking around  Opal looks at him with disdain and reluctantly sidles over  as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back  He yanks off his mask and turns to the Kid who shakes his head  a bedroom door crashes open and the Kid emerges screaming and runs right into  From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed  Willie reaches in grabs the folio and flips through it  The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio  Willie wakes on the floor to the sound of the scream  Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed  She glances in as the person passes and still chewing gets out her notebook and jots something down  while Willie and Marcus walk to their cars  Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away  The Kid follows Willie like a puppy dog  Ever so daintily he puts the bottle down and a beat later  WHAM   Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "From under his washcloth he drags the washcloth off his face and looks at the Kid who looks at him unperturbed  She glances in as the person passes and still chewing gets out her notebook and jots something down  Willie stares at the board for a long beat then leaps up screaming and flings the board across the room while the Kid's face remains unfazed and still smiling  The kid lies in bed sleeping peacefully  as Willie bangs Sue in the Jacuzzi wearing his Santa hat while blearily she gazes back  He closes the door then tips back the bottle and polishes it off with a series of quick gulps  Ever so daintily he puts the bottle down and a beat later  WHAM   he faints dead away hitting the floor like a felled tree  Willie wakes on the floor to the sound of the scream  a bedroom door crashes open and the Kid emerges screaming and runs right into  Willie immediately caroms off and goes screaming down the hall turning the corner to see a row of fresh bloody palmprints down one side of the hall while the Kid screaming is just disappearing at the far end Grandma rises from her chair with the assistance of her walker and begins to move toward Willie wearing a bathrobe and thick glasses with another pair of glasses on a chain around her neck while he watches as the senile old woman innocently putters away  He yanks off his mask and turns to the Kid who shakes his head  The sound of a tumbler tripping is heard and suddenly light sweeps in as the safe door opens to reveal a smiling Willie with his stethoscope in his ears and in the foreground a few stacks of cash and a folio  Willie reaches in grabs the folio and flips through it  A new Mercedes screeches through the frame and as it recedes we are left looking at the Kid who stands at the curb waving happily  while Willie and Marcus walk to their cars  Opal looks at him with disdain and reluctantly sidles over  Willie is at a pay phone and the Kid swings the door open to Willie who stands on the stoop holding a small grip  The Kid follows Willie like a puppy dog  as Willie checks out the house bumping open doors and looking around  Willie has discovered the master bedroom which appears long unused and he tosses his grip onto the double bed  Willie lies in the tub motionless with a wet washcloth over his face and the fingers of one hand resting against a tumbler filled with ice and amber liquid that sits on the edge of the tub "
        }
      ]
    }
  ]
}