{
  "ground_truth": "Valjean and Cosette turn into a street that is walled in by high windowless houses, and then Valjean sees a nearby lamp bracket. The narrow street turns and opens out onto the river, but they follow it around a corner to find a dead end, so Valjean stops. A high wall is before them and they are trapped. Valjean looks around, and once on the top, he hauls Cosette up by the rope. A cloister appears as he sings, he walks out onto the roof and stands by the symbol of the HQ, a monumental stone eagle. He looks down at the lights reflected in the river below and then up at the great city. The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Gavroche, bounding over their heads and evading the swipes of liveried footmen, lands on the running board of one particularly grand carriage and begs or taunts the rich. Still running with Gavroche as he hops onto the back of another very grand carriage, the traffic now moving at last, he hitches a ride on the back—one or two of his gang hop on back of the carriage with him, while others run panting after to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness. The carriage stops as its occupant wants to watch what is going on. Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris, student revolutionaries, the poor, and beggars. The students hand out printed leaflets and try to excite the crowd, and a student, Enjolras, stands on a raised step making an impassioned speech with fellow student Marius. A priest is seen hurrying into the house accompanied by two altar boys. In the crowd, a young street girl, Eponine, has her eyes fixed longingly on the handsome Marius. The occupant of the stopped carriage is Monsieur Gillenormand, Marius' grandfather, who is clearly deeply unhappy to see his grandson engaged in such an activity. Mounted police ride in to break up the crowd, and Marius turns to see his grandfather staring him down, furious. Gillenormand turns to get back in his carriage. Through a crack in a door, we see Marius sitting on a tatty mattress in a tiny hovel of a room, taking out a hunting rifle from under the mattress, wrapped in a rag. His eye is caught by the family crest ring on his finger, and close on a signet ring, Marius stares at it then takes it off his finger.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Valjean and Cosette change into a road that is barricaded in by tall windowless dwellings, and then Valjean notices a nearby lamp bracket. The cramped road twists and opens out onto the river, but they trail it around a bend to discover a dead end, so Valjean halts. A tall barrier is before them and they are ensnared. Valjean glances around, and once on the peak, he lifts Cosette up by the cord. A convent appears as he sings, he strides out onto the rooftop and stands by the symbol of the HQ, a monumental stone raptor. He gazes down at the lights reflected in the river beneath and then up at the vast metropolis. The fine ladies and grand gentlemen in the carriages divert their eyes or raise the blinds of their carriage panes to block out the view of the outcasts of their realm. Gavroche, leaping over their heads and dodging the swipes of liveried footmen, lands on the running board of one particularly grand carriage and implores or mocks the wealthy. Still rushing with Gavroche as he hops onto the rear of another very grand carriage, the traffic now proceeding at last, he hitches a ride on the back—one or two of his crew hop on back of the carriage with him, while others run gasping after to hear his political discourse. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is assembled outside a house of illness. The carriage halts as its occupant desires to observe what is transpiring. Gavroche leaps off as the carriage halts and joins the crowd composed of citizens of Paris, student revolutionaries, the destitute, and mendicants. The students distribute printed leaflets and attempt to incite the crowd, and a student, Enjolras, stands on a raised step making an fervent speech with fellow student Marius. A cleric is seen rushing into the house accompanied by two altar boys. In the crowd, a young street girl, Eponine, has her eyes fixed yearningly on the attractive Marius. The occupant of the halted carriage is Monsieur Gillenormand, Marius' grandfather, who is evidently profoundly discontented to see his grandson involved in such an activity. Mounted police ride in to disperse the crowd, and Marius turns to see his grandfather glaring him down, irate. Gillenormand turns to climb back in his carriage. Through a crack in a door, we see Marius sitting on a shabby mattress in a tiny hovel of a chamber, taking out a hunting rifle from under the mattress, wrapped in a cloth. His gaze is caught by the family crest ring on his finger, and close on a signet ring, Marius gazes at it then removes it off his finger."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Valjean and Cosette are turned onto a street that high windowless houses wall in, and then a nearby lamp bracket is seen by Valjean. The narrow street is turned by them and opened out onto the river, but it is followed around a corner to find a dead end, so Valjean stops. A high wall is before them and they trap themselves. Around is looked by Valjean, and once on the top, Cosette is hauled up by him using the rope. A cloister is sung by him as it appears, he walks out onto the roof and is stood by the symbol of the HQ, a monumental stone eagle. The lights reflected in the river below are looked down at by him and then he looks up at the great city. The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Gavroche, bounding over their heads and evading the swipes of liveried footmen, is landed on the running board of one particularly grand carriage and the rich are begged or taunted by him. Still running with Gavroche as another very grand carriage is hopped onto by him, the traffic now moving at last, a ride is hitched by him on the back—one or two of his gang hop on back of the carriage with him, while after it others run panting to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred gathers outside a house of sickness. The carriage is stopped as its occupant wants to watch what is going on. Gavroche jumps off as the carriage is stopped and the crowd is joined by him made up of citizens of Paris, student revolutionaries, the poor, and beggars. Printed leaflets are handed out by the students and the crowd is tried to be excited by them, and a student, Enjolras, is stood on a raised step and makes an impassioned speech with fellow student Marius. A priest hurries into the house accompanied by two altar boys. In the crowd, a young street girl, Eponine, fixes her eyes longingly on the handsome Marius. The occupant of the stopped carriage, Monsieur Gillenormand, Marius' grandfather, is clearly deeply unhappy to see his grandson engaged in such an activity. The crowd is broken up by mounted police as they ride in, and his grandfather is turned to see by Marius staring him down, furious. Gillenormand turns to get back in his carriage. Through a crack in a door, Marius is seen sitting on a tatty mattress in a tiny hovel of a room, taking out a hunting rifle from under the mattress, wrapped in a rag. His eye is caught by the family crest ring on his finger, and close on a signet ring, it is stared at by Marius then it is taken off his finger by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Valjean and Cosette enter a narrow street lined with tall, windowless houses. Valjean spots a lamp bracket as the street leads to the river, but they hit a dead end. Trapped by a high wall, Valjean climbs up, pulls Cosette with a rope, and finds a cloister. As he sings on the roof near a stone eagle symbol, he observes the city and river lights. Elegant carriage passengers ignore the less fortunate. Gavroche jumps onto the back of a grand carriage, mocking the rich, with some of his gang joining. The carriage stops at a courtyard where hundreds gather outside a house of sickness. Gavroche joins citizens, students, and beggars as Enjolras and Marius distribute leaflets and rally the crowd. Eponine gazes at Marius, while his grandfather, Monsieur Gillenormand, looks on disapprovingly. Police disperse the crowd, and Marius sees his grandfather's anger. Back in his small room, Marius removes a signet ring after noticing his family crest."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Valjean and Cosette enter a windowless high-walled street, spotting a lamp bracket. The street leads to the river but then dead-ends, trapping them. Valjean climbs the wall, hoisting Cosette with a rope. They reach a cloister roof and stand by a stone eagle, observing the city's lights. Carriage passengers ignore the poor. Gavroche jumps on a grand carriage, taunting the rich, and hitches a ride with his gang to a courtyard near a house of sickness. He joins a crowd of Parisians, student revolutionaries, and beggars. Students distribute leaflets, with Enjolras giving a speech alongside Marius. Eponine watches Marius, while his grandfather, Monsieur Gillenormand, disapproves. Mounted police disperse the crowd, and Marius sees his angry grandfather. Returning to his tiny room, Marius retrieves a hunting rifle from under a mattress, noting his family crest ring before removing it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Valjean and Cosette find themselves turning into a narrow, secluded street, which is closely hemmed in by imposing high walls of windowless houses. As they continue, Valjean's observant eyes catch sight of a nearby lamp bracket. The narrow street takes a turn and opens out before them, offering a view of the river. However, they decide to follow the street as it winds around a corner, only to be met with a dead end, at which point Valjean comes to a halt. Confronted with a towering wall before them, they realize they are effectively trapped in this confined space. Valjean, seeking a way out, carefully surveys the area, and, once he reaches the top, he uses a sturdy rope to haul Cosette up behind him. \n\nAs they make their escape, a cloister comes into view and Valjean begins to sing. He strides out onto the roof, where he stands proudly next to a significant symbol of the headquarters, an impressive monumental stone eagle. Gazing down, he admires the flickering lights reflected in the river below, and then his eyes lift to behold the sprawling great city. The fine ladies and grand gentlemen passing by in luxurious carriages either avert their eyes or hastily raise the blinds of their carriage windows, choosing to shut out the distressing sight of those they consider the losers in their society. Meanwhile, Gavroche, with his boundless energy, leaps over their heads and cleverly dodges the swipes of liveried footmen. He boldly lands on the running board of one particularly opulent carriage, engaging in begging or perhaps taunting the wealthy occupants. Still sprinting with Gavroche, as he agilely hops onto the back of yet another illustriously grand carriage, they find the traffic is finally beginning to move. He skillfully hitches a ride on the back of the carriage, joined by one or two members of his gang who also hop onto the back, while others frantically run after them, panting, eager to catch his spirited political lecture.\n\nEventually, the carriage approaches an arch that leads into a bustling courtyard where a large crowd, numbering a couple of hundred, is gathered outside a house of sickness. The carriage comes to a stop because its occupant wants to observe the proceedings. As it halts, Gavroche jumps off the carriage and merges with the crowd, which consists of diverse groups: citizens of Paris, fervent student revolutionaries, the underprivileged, and beggars. The students distribute printed leaflets, making efforts to rouse the crowd, while a passionate student, Enjolras, stands on an elevated step, delivering an impassioned speech alongside his fellow student Marius. Nearby, a priest is seen hurrying into the house, accompanied by two solemn altar boys. Amidst the crowd, a young street girl named Eponine gazes longingly at the dashing Marius, her eyes full of deep admiration. The occupant of the halted carriage is none other than Monsieur Gillenormand, Marius' grandfather, who is clearly distressed and deeply unhappy to witness his grandson involved in such activities. Mounted police arrive on the scene, determined to disperse the crowd, and Marius, sensing the commotion, turns to find his grandfather glaring at him intensely, filled with fury. Displeased, Gillenormand turns away to re-enter his carriage.\n\nThrough a small crack in a door, a glimpse is offered of Marius as he sits on a worn-out, tattered mattress in a diminutive, shabby room. He reaches under the mattress and retrieves a hunting rifle wrapped in a ragged piece of cloth. As he does so, his eye catches on the family crest ring adorning his finger. Staring intently at the signet ring, Marius is contemplative, and after a brief moment, he decisively removes it from his finger."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Valjean and Cosette find themselves venturing into a narrow, secluded street, which is closely hemmed in by the imposing high walls of windowless houses on either side. As they continue walking down this confined path, Valjean's observant eyes skillfully catch sight of a nearby lamp bracket. The narrow street takes an unexpected turn and opens out before them, offering a striking view of the river. However, despite this serene vista, they decide to follow the street as it winds around yet another corner, only to be met with a dead-end situation, at which point Valjean comes to a sudden halt. Confronted with a towering wall standing before them, they quickly realize they are effectively trapped in this tight, enclosed space. Valjean, seeking an immediate way out, carefully surveys the surrounding area, and once he reaches the top, he deftly uses a sturdy rope to haul Cosette up behind him.\n\nAs they successfully make their escape from this predicament, a cloister unexpectedly comes into view, and Valjean begins to sing with a sense of relief and triumph. He strides out onto the roof, where he stands proudly next to a significant symbol of the headquarters, an impressive monumental stone eagle. Gazing down, he admires the flickering lights that are beautifully reflected in the river below, and then his eyes lift to behold the sprawling great city beyond. The fine ladies and grand gentlemen passing by in their luxurious carriages either avert their eyes or hastily raise the blinds of their carriage windows, deciding to shut out the distressing sight of those they consider the losers in their society. Meanwhile, Gavroche, with his boundless energy, fearlessly leaps over their heads and cleverly dodges the swipes of liveried footmen. He boldly lands on the running board of one particularly opulent carriage, engaging in either begging or perhaps taunting the wealthy occupants within. Still sprinting with Gavroche, as he agilely hops onto the back of yet another illustriously grand carriage, they find the traffic is finally beginning to move slowly. He skillfully hitches a ride on the back of the carriage, joined by one or two members of his gang who also boldly hop onto the back, while others frantically run after them, panting and eager to catch his spirited political lecture.\n\nEventually, the carriage approaches an arch that leads into a bustling courtyard where a large crowd, numbering a couple of hundred people, is gathered outside a notable house of sickness. The carriage comes to a stop because its occupant wants to observe the proceedings taking place. As it halts, Gavroche jumps off the carriage and seamlessly merges with the crowd, which consists of diverse groups: citizens of Paris, fervent student revolutionaries, the underprivileged, and beggars. The students energetically distribute printed leaflets, making concerted efforts to rouse the crowd, while a passionate student, Enjolras, stands on an elevated step, delivering an emotionally charged and impassioned speech alongside his fellow student, Marius. Nearby, a priest is seen hurrying into the house, accompanied by two solemn altar boys. Amidst the crowd, a young street girl named Eponine gazes longingly at the dashing Marius, her eyes filled with deep admiration and longing. The occupant of the halted carriage is none other than Monsieur Gillenormand, Marius' grandfather, who is clearly distressed and deeply unhappy to witness his grandson involved in such activities. Mounted police arrive on the scene, determined to disperse the gathered crowd, and Marius, sensing the commotion, turns to find his grandfather glaring at him intensely, filled with fury and disappointment. Displeased, Gillenormand turns away to re-enter his carriage.\n\nThrough a small crack in a door, a glimpse is offered of Marius as he sits on a worn-out, tattered mattress in a diminutive, shabby room. He reaches under the mattress and retrieves a hunting rifle wrapped in a ragged piece of cloth. As he does so, his eye catches on the family crest ring adorning his finger. Staring intently at the signet ring, Marius becomes contemplative, and after a brief moment, he decisively removes it from his finger."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Valjean and Cosette find themselves entering a narrow street flanked by imposing, high windowless houses, heightening the sense of enclosure and isolation around them. As Valjean walks forward, his gaze shifts to a nearby lamp bracket, an ordinary yet noticeable feature in the dimly lit street. The street itself narrows and begins to curve, eventually expanding its path until it opens out onto the glistening river. However, Valjean and Cosette decide to veer with it around a corner only to be met with an unexpected dead end. Realizing that they are trapped by a high wall, Valjean halts their progress. He quickly surveys their surroundings before managing to climb to the top of the wall. Once perched above, he diligently hauls Cosette up by a rope, ensuring her safety and ascent. As they climb onto the roof, a cloister reveals itself, and Valjean, filled with a sense of achievement and overcoming adversity, begins to sing. Standing there on the roof, Valjean's attention is drawn to the symbol of the HQ, a commanding stone eagle, under which he stands silently. From this vantage point, he gazes downward at the shimmering reflections of lights dancing upon the surface of the river below. His eyes then lift to take in the vast expanse of the great city stretching out before him. Meanwhile, the elite of society, comprised of fine ladies and grand gentlemen ensconced in luxurious carriages, avert their eyes or discreetly raise the blinds over their carriage windows, shutting out the unsettling sight of those less fortunate. Amidst this scene, Gavroche, with youthful energy and a mischievous spirit, deftly evades the swipes of uniformed footmen as he leaps over their heads. His agile movements land him on the running board of a particularly grand carriage. Here, he either implores or mocks its wealthy occupants with youthful defiance. Continuing his playful escapade, he nimbly hops onto the back of another equally grand carriage. As the congested traffic finds motion, Gavroche hitchhikes on the carriage's rear, joined by one or two of his fellow companions who leap onto the back beside him, while others sprint behind, eager to catch his spirited political discourse. The carriage soon passes through an arch that leads into a courtyard, a passageway bustling with a gathering of several hundred people outside a house known for sickness. The carriage then comes to a halt as its occupant is drawn by curiosity to observe the unfolding events. Seizing the opportunity, Gavroche jumps off and melds into the crowd, which is a vibrant mix of Parisian citizens, passionate student revolutionaries, the impoverished, and beggars. The students, determined to incite change, distribute printed leaflets, rousing the crowd with their fervor. Among them, a student named Enjolras, standing on a step to command attention, delivers an impassioned speech alongside his fellow student, Marius. Nearby, a priest, in haste to attend to spiritual duties, rushes into the house, flanked by two altar boys. Amidst the throng, a young street girl named Eponine gazes longingly at the handsome Marius, her eyes fixed with unspoken desire. The stately carriage's occupant is revealed to be Monsieur Gillenormand, Marius' disapproving grandfather, visibly troubled by the sight of his grandson partaking in such fervent activities. Mounted police arrive, their presence intended to disperse the gathering, prompting Marius to turn, locking eyes with his grandfather's disapproving and furious stare. As Gillenormand turns away to re-enter his carriage, a brief glimpse through a door crack shows Marius seated on a worn-out mattress within a cramped, run-down room. He retrieves a hunting rifle from beneath the mattress, carefully unwrapping it from a rag. His attention is momentarily captured by the glint of the family crest ring on his finger; he stares at the signet ring, contemplating it before finally slipping it off his finger."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Valjean and Cosette enter a narrow street lined by high, windowless houses. Upon reaching a dead end at a high wall, Valjean lifts Cosette up using a rope. They find a cloister, and Valjean stands by a monumental stone eagle, contemplating the lights of the city and the river. Meanwhile, fine ladies and gentlemen in carriages ignore the less fortunate around them. Gavroche, evading footmen, leaps onto a grand carriage, mocking the wealthy as he hitches a ride with some of his gang following. The carriage enters a courtyard where a large crowd has gathered outside a house of sickness. As the carriage halts, Gavroche joins the gathering, composed of citizens, student revolutionaries, and beggars listening to the students distributing leaflets. Enjolras, alongside Marius, delivers an impassioned speech from a raised step while Eponine gazes at Marius longingly. Marius' grandfather, Monsieur Gillenormand, sits in the carriage, displeased with his grandson's involvement. Police arrive to disperse the crowd, and Marius notices his grandfather's disapproving stare before Gillenormand withdraws. Later, in a small room, Marius retrieves a hunting rifle from under a mattress and is momentarily caught by the sight of his family crest ring, before removing it thoughtfully."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Valjean and Cosette turn into a street walled in by high windowless houses reminiscent of the old Parisian architecture that often concealed inner courtyards, and then Valjean sees a nearby lamp bracket, a relic of the gas-lit streets of 19th-century Paris. The narrow street turns and opens out onto the Seine River, which winds through Paris and has seen countless tales of love and revolution, but they follow it around a corner to find a dead end, so Valjean stops. A high wall, typical of the city's maze-like alleys designed for privacy, is before them and they are trapped. Valjean looks around, and once on the top, he hauls Cosette up by the rope. A cloister, often a sanctuary for those escaping the chaos of the city, appears as he sings, he walks out onto the roof and stands by the symbol of the HQ, a monumental stone eagle, emblematic of imperial power and authority. He looks down at the lights reflected in the river below, a mirror to the splendor and struggles of Paris, and then up at the great city. The fine ladies and grand gentlemen in the carriages, a common sight on the grand boulevards like the Champs-Élysées, avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Gavroche, a street-smart urchin representing the resilient spirit of the city's downtrodden, bounds over their heads and evades the swipes of liveried footmen, lands on the running board of one particularly grand carriage and begs or taunts the rich. Still running with Gavroche as he hops onto the back of another very grand carriage, the traffic now moving at last along the cobblestone roads, he hitches a ride on the back—one or two of his gang hop on back of the carriage with him, while others run panting after to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness, indicating the widespread poverty and disease in the city. The carriage stops as its occupant wants to watch what is going on. Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris, student revolutionaries inspired by the ideals of liberty, equality, and fraternity, the poor, and beggars. The students hand out printed leaflets, a method of spreading revolutionary ideas, and try to excite the crowd, and a student, Enjolras, known for his idealistic zeal and leadership, stands on a raised step making an impassioned speech with fellow student Marius. A priest is seen hurrying into the house accompanied by two altar boys, often a sign of last rites being delivered. In the crowd, a young street girl, Eponine, has her eyes fixed longingly on the handsome Marius. The occupant of the stopped carriage is Monsieur Gillenormand, Marius' grandfather, who is clearly deeply unhappy to see his grandson engaged in such an activity that he perceives as rebellious and dangerous. Mounted police ride in to break up the crowd, enforcing the strict public order measures of the time, and Marius turns to see his grandfather staring him down, furious. Gillenormand turns to get back in his carriage. Through a crack in a door, we see Marius sitting on a tatty mattress in a tiny hovel of a room, indicative of the impoverished student lodgings of the era, taking out a hunting rifle from under the mattress, wrapped in a rag. His eye is caught by the family crest ring on his finger, a symbol of his aristocratic heritage, and close on a signet ring, Marius stares at it then takes it off his finger, symbolizing his internal conflict and rejection of his privileged past."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket furious The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down A high wall is before them and they are trapped Valjean looks around and once on the top he hauls Cosette up by the rope A cloister appears as he sings Valjean looks around and once on the top he hauls Cosette up by the rope Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle He looks down at the lights reflected in the river below and then up at the great city The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world A cloister appears as he sings Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius Still running with Gavroche as he hops onto the back of another very grand carriage the traffic now moving at last The carriage stops as its occupant wants to watch what is going on he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich The carriage stops as its occupant wants to watch what is going on Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius A priest is seen hurrying into the house accompanied by two altar boys In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius The occupant of the stopped carriage is Monsieur Gillenormand His eye is caught by the family crest ring on his finger and close on a signet ring A high wall is before them and they are trapped Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down furious Gillenormand turns to get back in his carriage Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag His eye is caught by the family crest ring on his finger and close on a signet ring Marius stares at it then takes it off his finger"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket. The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops. A high wall is before them and they are trapped. Valjean looks around and once on the top he hauls Cosette up by the rope. A cloister appears as he sings. he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle. He looks down at the lights reflected in the river below and then up at the great city. The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich. Still running with Gavroche as he hops onto the back of another very grand carriage. the traffic now moving at last. he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The carriage stops as its occupant wants to watch what is going on. Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars. The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius. A priest is seen hurrying into the house accompanied by two altar boys. In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius. The occupant of the stopped carriage is Monsieur Gillenormand. Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity. Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down. furious. Gillenormand turns to get back in his carriage. Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag. His eye is caught by the family crest ring on his finger and close on a signet ring. Marius stares at it then takes it off his finger."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket. The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops. A high wall is before them and they are trapped. Valjean looks around and once on the top he hauls Cosette up by the rope. A cloister appears as he sings. he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle. He looks down at the lights reflected in the river below and then up at the great city. The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich. Still running with Gavroche as he hops onto the back of another very grand carriage. the traffic now moving at last. he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The carriage stops as its occupant wants to watch what is going on. Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars. The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius. A priest is seen hurrying into the house accompanied by two altar boys. In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius. The occupant of the stopped carriage is Monsieur Gillenormand. Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity. Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down. furious. Gillenormand turns to get back in his carriage. Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag. His eye is caught by the family crest ring on his finger and close on a signet ring. Marius stares at it then takes it off his finger."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket. The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops. A high wall is before them and they are trapped. Valjean looks around and once on the top he hauls Cosette up by the rope. A cloister appears as he sings. he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle. He looks down at the lights reflected in the river below and then up at the great city. Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down. furious. Gillenormand turns to get back in his carriage. Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag. His eye is caught by the family crest ring on his finger and close on a signet ring. Marius stares at it then takes it off his finger."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket. The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops. A high wall is before them and they are trapped. Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag. His eye is caught by the family crest ring on his finger and close on a signet ring. Marius stares at it then takes it off his finger."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Javert and Javert turn into a street that is walled in by high windowless houses, and then Javert sees a nearby lamp bracket. The narrow street turns and opens out onto the river, but they follow it around a corner to find a dead end, so Javert stops. A high wall is before them and they are trapped. Javert looks around, and once on the top, he hauls Javert up by the rope. A bridge appears as he sings, he walks out onto the roof and stands by the symbol of the HQ, a monumental stone eagle. He looks down at the lights reflected in the river below and then up at the great city. The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world. Marius, bounding over their heads and evading the swipes of liveried footmen, lands on the running board of one particularly grand carriage and begs or taunts the rich. Still running with Marius as he hops onto the back of another very grand carriage, the traffic now moving at last, he hitches a ride on the back—one or two of his gang hop on back of the carriage with him, while others run panting after to hear his political lecture. The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness. The carriage stops as its occupant wants to watch what is going on. Marius jumps off as the carriage stops and joins the crowd made up of citizens of Paris, student revolutionaries, the poor, and beggars. The students hand out printed leaflets and try to excite the crowd, and a teacher, Enjolras, stands on a raised step making an impassioned speech with fellow teacher Javert. A merchant is seen hurrying into the house accompanied by two altar boys. In the crowd, a young street girl, Cosette, has her eyes fixed longingly on the handsome Javert. The occupant of the stopped carriage is Madame Thenardier, Javert's grandmother, who is clearly deeply unhappy to see her grandson engaged in such an activity. Mounted police ride in to break up the crowd, and Javert turns to see his grandmother staring him down, furious. Madame Thenardier turns to get back in her carriage. Through a crack in a door, we see Javert sitting on a tatty mattress in a tiny hovel of a room, taking out a hunting rifle from under the mattress, wrapped in a rag. His eye is caught by the family crest ring on his finger, and close on a signet ring, Javert stares at it then takes it off his finger."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Valjean and Cosette turn into an alley that is walled in by high windowless barns, and then Valjean sees a nearby lantern post. The narrow alley turns and opens out onto the harbor, but they follow it around a bend to find a cul-de-sac, so Valjean stops. A tall gate is before them and they are trapped. Valjean looks around, and once on the peak, he hauls Cosette up by the chain. A terrace appears as he sings, he walks out onto the balcony and stands by the emblem of the lodge, a monumental stone lion. He looks down at the lights reflected in the harbor below and then up at the great metropolis. The sophisticated women and noble men in the chariots avert their eyes or raise the curtains of their chariot windows to shut out the sight of the outcasts of their world. Gavroche, leaping over their heads and evading the swipes of liveried guards, lands on the footrest of one particularly grand chariot and begs or taunts the wealthy. Still running with Gavroche as he hops onto the back of another very grand chariot, the traffic now moving at last, he hitches a ride on the back—one or two of his gang hop on back of the chariot with him, while others run panting after to hear his philosophical monologue. The chariot reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a home of healing. The chariot stops as its occupant wants to observe what is going on. Gavroche jumps off as the chariot stops and joins the crowd made up of residents of Paris, rebel scholars, the needy, and vagrants. The scholars hand out printed flyers and try to rally the crowd, and a scholar, Enjolras, stands on a raised platform making an impassioned speech with fellow scholar Marius. A monk is seen hurrying into the home accompanied by two choir boys. In the crowd, a young street girl, Eponine, has her eyes fixed longingly on the handsome Marius. The occupant of the stopped chariot is Monsieur Gillenormand, Marius' grandfather, who is clearly deeply unhappy to see his grandson engaged in such an activity. Mounted soldiers ride in to disperse the crowd, and Marius turns to see his grandfather staring him down, furious. Gillenormand turns to get back in his chariot. Through a crack in a door, we see Marius sitting on a rugged cot in a tiny den of a room, taking out a fishing spear from under the cot, wrapped in a cloth. His eye is caught by the family seal amulet on his finger, and close on a signet amulet, Marius stares at it then takes it off his finger."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Valjean and Cosette wander into a street that is surrounded by high windowless houses, and then Valjean notices a nearby lamp bracket. The narrow street twists and merges onto the river, but they continue around a corner to discover a dead end, so Valjean pauses. A high wall is before them and they are confined. Valjean surveys the surroundings, and once on the top, he lowers Cosette up by the rope. A cloister emerges as he mumbles, he steps out onto the roof and leans by the symbol of the HQ, a monumental stone eagle. He gazes down at the lights mirrored in the river below and then across at the great city. The fine ladies and grand gentlemen in the carriages glance away or pull down the blinds of their carriage windows to filter out the sight of the losers of their world. Gavroche, skipping over their heads and dodging the swipes of liveried footmen, lands on the footboard of one particularly grand carriage and mocks or jeers the rich. Still dodging with Gavroche as he leaps onto the front of another very grand carriage, the traffic now flowing at last, he catches a ride on the front—one or two of his gang leap on front of the carriage with him, while others trot panting after to hear his political joke. The carriage enters an arch into a courtyard where a crowd of a couple of hundred is assembled outside a house of sickness. The carriage halts as its occupant wishes to ignore what is happening. Gavroche bounds off as the carriage halts and joins the crowd made up of citizens of Paris, student revolutionaries, the poor, and beggars. The students distribute printed leaflets and try to alarm the crowd, and a student, Enjolras, stands on a raised step delivering an indifferent speech with fellow student Marius. A priest is seen racing into the house accompanied by two altar boys. In the crowd, a young street girl, Eponine, has her eyes fixed longingly on the handsome Marius. The occupant of the halted carriage is Monsieur Gillenormand, Marius' grandfather, who is clearly deeply displeased to see his grandson involved in such an activity. Mounted police ride in to disperse the crowd, and Marius glances to see his grandfather glaring him down, furious. Gillenormand turns to slip back in his carriage. Through a crack in a door, we see Marius resting on a tatty mattress in a tiny hovel of a room, pulling out a hunting rifle from under the mattress, wrapped in a rag. His eye is attracted by the family crest ring on his finger, and close on a signet ring, Marius glimpses at it then slips it off his finger."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blinken and Winslet turn into a hallway that is walled in by towering doorless barns, and then Blinken sees a nearby candle sconce. The narrow hallway turns and opens out onto the ocean, but they follow it around a bend to find a cul-de-sac, so Blinken stops. A tall fence is before them and they are trapped. Blinken looks around, and once on the top, he hauls Winslet up by the leash. A tower appears as he hums, he walks out onto the balcony and stands by the emblem of the HQ, a monumental stone dolphin. He looks down at the stars reflected in the ocean below and then up at the vast metropolis. The elegant swans and majestic flamingos in the gondolas avert their eyes or raise the shades of their gondola panels to shut out the sight of the dreamers of their land. Puck, leaping over their heads and dodging the swats of uniformed guards, lands on the footrest of one particularly splendid gondola and pleads or mocks the affluent. Still running with Puck as he hops onto the back of another very magnificent gondola, the procession now moving at last, he hitches a ride on the back—one or two of his crew hop on back of the gondola with him, while others run puffing after to hear his poetic soliloquy. The gondola reaches an entrance into a patio where a throng of a couple of hundred is assembled outside a chamber of healing. The gondola halts as its passenger wants to observe what is happening. Puck leaps off as the gondola halts and joins the throng made up of folks of Rome, young reformers, the destitute, and vagrants. The reformers distribute printed pamphlets and try to stir the throng, and a reformer, Damian, stands on a raised platform delivering a passionate sermon with fellow reformer Marcus. A monk is seen scurrying into the chamber escorted by two choir boys. In the throng, a young alley cat, Ariane, has her gaze fixed ardently on the dashing Marcus. The passenger of the halted gondola is Monsieur Callahan, Marcus' uncle, who is visibly deeply displeased to see his nephew involved in such an endeavor. Mounted guardians ride in to disperse the throng, and Marcus turns to see his uncle glaring at him, livid. Callahan turns to get back in his gondola. Through a gap in a hatch, we see Marcus sitting on a worn blanket in a cramped shack of a nook, pulling out a fishing net from under the blanket, wrapped in a scarf. His eye is caught by the ancestral emblem pin on his cap, and close on a family crest pin, Marcus stares at it then removes it from his cap."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Frodo and Samwise drift into a corridor that is flanked by towering windowless towers, and then Frodo notices a distant flagpole. The narrow corridor twists and opens out onto the ocean, but they trail it around a bend to encounter a cul-de-sac, so Frodo pauses. A towering fence is in front of them, and they are ensnared. Frodo scans the surroundings, and once on the summit, he lifts Samwise up by the rope. A castle emerges as he whistles, he strides out onto the balcony and perches by the emblem of the HQ, a gigantic stone lion. He gazes down at the lanterns mirrored in the ocean below and then up at the sprawling metropolis. The fashionable gentlemen and elegant ladies in the carriages avert their faces or elevate the curtains of their carriage windows to exclude the glimpse of the failures of their universe. Pippin, leaping over their heads and dodging the lunges of uniformed butlers, lands on the footboard of one exceptionally lavish carriage and mocks or jeers at the wealthy. Still strolling with Pippin as he skips onto the rear of another quite lavish carriage, the convoy now advancing finally, he grasps a lift on the rear—one or two of his cohort leap onto the back of the carriage with him, while others dash gasping after to catch his revolutionary speech. The carriage arrives at a gate into a courtyard where a throng of a few hundred is assembled outside a residence of misery. The carriage pauses as its passenger wishes to observe what is unfolding. Pippin leaps off as the carriage halts and mingles with the throng composed of residents of Middle-earth, wizard apprentices, the destitute, and wanderers. The apprentices distribute printed notices and endeavor to rouse the throng, and an apprentice, Gandalf, stands on an elevated step delivering a fervent address with fellow apprentice Legolas. A sorcerer is glimpsed scurrying into the residence escorted by two accomplice wizards. Among the throng, a young market girl, Arwen, has her eyes fixed yearningly on the charming Legolas. The passenger of the halted carriage is Saruman, Legolas' elder, who is evidently profoundly discontented to witness his kin involved in such a pursuit. Mounted guards trot in to disperse the throng, and Legolas pivots to glimpse his elder glaring him down, infuriated. Saruman pivots to reboard his carriage. Through a chink in a barrier, we perceive Legolas squatting on a shabby cot in a diminutive chamber of a dwelling, extracting a crossbow from underneath the cot, ensconced in a sack. His attention is seized by the family emblem charm on his neck, and close to an amulet, Legolas gapes at it then removes it from his neck."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Valjean and Cosette stroll into a path lined with tall treeless murals, and then Valjean notices a nearby signpost. The narrow alleyway curves and reveals a park, but they stick with it around a bend to discover a cul-de-sac, so Valjean pauses. A towering barrier is facing them, and they are ensnared. Valjean scans the area, and once at the peak, he pulls Cosette up with the chain. A chapel emerges as he hums, he strides out onto the ledge and stands by the emblem of the HQ, a gigantic wooden owl. He gazes down at the candles mirrored in the lake below and then up at the sprawling metropolis. The elegant gentlemen and dazzling ladies in the wagons avert their gazes or close the drapes of their wagon windows to block out the view of the failures of their society. Gavroche, leaping over their heads and dodging the slaps of uniformed butlers, lands on the footrest of one particularly elegant wagon and mocks or interrogates the wealthy. Still dashing with Gavroche as he jumps onto the rear of another overly elegant wagon, the procession now progressing finally, he catches a lift on the back—one or two of his crew leap onto the wagon with him, while others sprint breathlessly after to listen to his social debate. The wagon arrives at an opening into a yard where a throng of a couple of hundred is congregated outside a home of wellness. The wagon halts as its passenger wishes to observe the proceedings. Gavroche leaps off as the wagon pauses and merges with the mob composed of citizens of Paris, youthful rebels, the destitute, and vagabonds. The scholars distribute illustrated pamphlets and seek to rouse the crowd, and a scholar, Enjolras, ascends a heightened platform delivering an fervent address with fellow scholar Marius. A monk is spotted rushing into the home accompanied by two choir boys. In the gathering, a juvenile street lass, Eponine, fixes her gaze wistfully on the dashing Marius. The passenger of the halted wagon is Monsieur Gillenormand, Marius’ ancestor, who is evidently extremely displeased to see his descendant partaking in such an affair. Mounted guards trot in to disperse the mob, and Marius pivots to see his ancestor glaring at him, enraged. Gillenormand turns to climb back into his wagon. Through a gap in a barrier, we view Marius resting on a tattered cushion in a small shack of a dwelling, withdrawing a fishing rod from beneath the cushion, wrapped in a sheet. His attention is drawn by the family badge bracelet on his wrist, and close on a signet bracelet, Marius gazes at it then removes it from his wrist."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Baxter and Lulu wander into an alley that is enclosed by towering faceless statues, and then Baxter notices a distant flagpole bracket. The narrow alleyway twists and leads out onto the meadow, but they trail it around a bend to find a cul-de-sac, so Baxter pauses. A tall fence is in front of them and they are cornered. Baxter glances around, and once atop the barrier, he hoists Lulu up by the twine. A garden appears as he chants, he strides out onto the terrace and stands by the insignia of the base, a gigantic wooden falcon. He gazes down at the shadows mirrored in the meadow below and then up at the mighty metropolis. The elegant dames and noble sirs in the wagons avert their glances or pull down the curtains of their compartment windows to block out the view of the misfits of their society. Charlie, leaping over their hats and dodging the slaps of uniformed butlers, lands on the footrest of one particularly elegant wagon and pleads or mocks the affluent. Still dashing with Charlie as he skips onto the bumper of another exceedingly luxurious wagon, the procession now advancing at last, he catches a lift on the bumper—one or two of his crew jump onto the bumper with him, while others sprint gasping after to hear his social critique. The wagon arrives at an arch leading to a plaza where a throng of a few hundred is amassed outside a hall of healing. The wagon halts as its traveler wants to observe the proceedings. Charlie hops off as the wagon halts and merges with the throng comprised of residents of Rome, academic insurgents, the destitute, and vagabonds. The scholars distribute printed flyers and attempt to stimulate the throng, and a scholar, Lancelot, stands on an elevated platform delivering an emotional address with fellow scholar Arthur. A monk is observed rushing into the hall escorted by two choir boys. In the throng, a young street boy, Clara, has her gaze fixed wistfully on the charming Arthur. The traveler of the halted wagon is Sir Lancel, Arthur's patriarch, who is evidently profoundly displeased to see his descendant involved in such an endeavor. Mounted guards trot in to disperse the throng, and Arthur pivots to see his patriarch glaring at him, livid. Lancel pivots to return to his wagon. Through a gap in a gate, we see Arthur reclining on a shabby cot in a cramped shack of a chamber, extracting a crossbow from beneath the cot, swathed in cloth. His attention is captured by the clan emblem band on his hand, and close on a signet band, Arthur gazes at it then removes it from his hand."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Valjean and Cosette find themselves trapped in a narrow street leading to a dead end. Valjean manages to climb a high wall with Cosette, reaching a rooftop with a monumental stone eagle. Below, opulent carriages pass, ignoring the impoverished. Gavroche, a street child, taunts the wealthy and hitchhikes on a carriage. The carriage halts at a crowded courtyard outside a house of sickness. Within the gathering of citizens, students, and beggars, student leader Enjolras delivers a speech with Marius, whose gaze captures street girl Eponine. Marius's grandfather, Monsieur Gillenormand, disapproves of his involvement. Mounted police disperse the crowd, and Marius, back in his shabby room, removes his family crest ring while contemplating his rifle."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Marius stares at it then takes it off his finger His eye is caught by the family crest ring on his finger and close on a signet ring Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag Gillenormand turns to get back in his carriage furious Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity The occupant of the stopped carriage is Monsieur Gillenormand In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius A priest is seen hurrying into the house accompanied by two altar boys The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars The carriage stops as its occupant wants to watch what is going on The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture the traffic now moving at last Still running with Gavroche as he hops onto the back of another very grand carriage Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world He looks down at the lights reflected in the river below and then up at the great city he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle A cloister appears as he sings Valjean looks around and once on the top he hauls Cosette up by the rope A high wall is before them and they are trapped The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A priest is seen hurrying into the house accompanied by two altar boys The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness Still running with Gavroche as he hops onto the back of another very grand carriage Marius stares at it then takes it off his finger Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity He looks down at the lights reflected in the river below and then up at the great city he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle the traffic now moving at last The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius Gillenormand turns to get back in his carriage he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture The occupant of the stopped carriage is Monsieur Gillenormand The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag The carriage stops as its occupant wants to watch what is going on A high wall is before them and they are trapped In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius His eye is caught by the family crest ring on his finger and close on a signet ring A cloister appears as he sings furious The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket Valjean looks around and once on the top he hauls Cosette up by the rope Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The carriage stops as its occupant wants to watch what is going on Gavroche jumps off as the carriage stops and joins the crowd made up of citizens of Paris student revolutionaries the poor and beggars The students hand out printed leaflets and try to excite the crowd and a student Enjolras stands on a raised step making an impassioned speech with fellow student Marius A priest is seen hurrying into the house accompanied by two altar boys In the crowd a young street girl Eponine has her eyes fixed longingly on the handsome Marius The occupant of the stopped carriage is Monsieur Gillenormand Marius' grandfather who is clearly deeply unhappy to see his grandson engaged in such an activity Mounted police ride in to break up the crowd and Marius turns to see his grandfather staring him down furious Gillenormand turns to get back in his carriage Through a crack in a door we see Marius sitting on a tatty mattress in a tiny hovel of a room taking out a hunting rifle from under the mattress wrapped in a rag His eye is caught by the family crest ring on his finger and close on a signet ring Marius stares at it then takes it off his finger Valjean and Cosette turn into a street that is walled in by high windowless houses and then Valjean sees a nearby lamp bracket The narrow street turns and opens out onto the river but they follow it around a corner to find a dead end so Valjean stops A high wall is before them and they are trapped Valjean looks around and once on the top he hauls Cosette up by the rope A cloister appears as he sings he walks out onto the roof and stands by the symbol of the HQ a monumental stone eagle He looks down at the lights reflected in the river below and then up at the great city The fine ladies and grand gentlemen in the carriages avert their eyes or raise the blinds of their carriage windows to shut out the sight of the losers of their world Gavroche bounding over their heads and evading the swipes of liveried footmen lands on the running board of one particularly grand carriage and begs or taunts the rich Still running with Gavroche as he hops onto the back of another very grand carriage the traffic now moving at last he hitches a ride on the back—one or two of his gang hop on back of the carriage with him while others run panting after to hear his political lecture The carriage reaches an arch into a courtyard where a crowd of a couple of hundred is gathered outside a house of sickness"
        }
      ]
    }
  ]
}