{
  "ground_truth": "In a modest Ohio house in 1979, Charles, in an ill-fitting black suit, and Martin, dressed in a shirt and tie, are at the buffet. The scene includes forty-odd friends and neighbors dressed darkly, engaging in quiet discussions, with some crying on a grey, snowy day in early February in Lillian, Ohio. Many cars are parked outside, including a Sheriff's Department squad car in the driveway. Joe, dressed in a too-big black suit, solemnly sits on a swing set, holding a locket. He looks up when a distinct 1968 Buick GSX, a yellow muscle car with a black racing stripe, arrives. A man in his early 40s, wearing jeans and a work shirt, exits the car. Joe watches carefully as Louis moves to the house and inside. Joe's focus returns to the locket as tears fill his eyes, but the moment is broken by raised voices from the house. The sound of breaking glass follows, and the back door bursts open, revealing Joe's father, Jack, leading a handcuffed and in-pain Louis Dainard to the squad car. Their eyes lock briefly, but Jack, visibly uncomfortable, drives away. Joe watches them depart, looks back at the locket, and finally closes it. As winter becomes a memory, hundreds of kids celebrate leaving their last day of school. Girls emphatically embrace goodbye while boys run off happily. Charles, red-faced, hands Joe pages, and they head to the 7-Eleven. Cary, with a burn wrap on his arm, joins them as they scan the candy aisle. Joe nods at a magazine while a hectic family scene unfolds at Charles' house: his mother cooks, his sister Jen angrily sets the table, his father pays bills, his sister Peg works on a puzzle, and twin 9-year-old boys bicker over an action figure, as the TV plays a Match Game in the living room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In a humble Ohio dwelling in 1979, Charles, in an ill-fitting ebony suit, and Martin, clad in a shirt and tie, are at the smorgasbord. The tableau includes forty-odd companions and neighbors dressed somberly, engaging in quiet dialogues, with some weeping on a grey, snowy day in early February in Lillian, Ohio. Many automobiles are parked outside, including a Sheriff's Department patrol car in the driveway. Joe, clad in a too-large ebony suit, solemnly perches on a swing set, holding a pendant. He gazes up when a distinct 1968 Buick GSX, a yellow muscle automobile with a black racing stripe, arrives. A man in his early 40s, wearing denim and a work shirt, exits the automobile. Joe observes intently as Louis proceeds to the house and inside. Joe's focus returns to the pendant as tears fill his eyes, but the moment is shattered by raised voices from the house. The sound of shattering glass follows, and the back door bursts open, revealing Joe's father, Jack, leading a handcuffed and in-pain Louis Dainard to the patrol car. Their eyes lock briefly, but Jack, visibly uneasy, drives away. Joe watches them depart, looks back at the pendant, and finally closes it. As winter becomes a memory, hundreds of children celebrate departing their last day of school. Girls emphatically embrace farewell while boys dash off joyfully. Charles, red-faced, hands Joe sheets, and they head to the 7-Eleven. Cary, with a burn wrap on his limb, joins them as they scan the confectionery aisle. Joe nods at a periodical while a hectic family scene unfolds at Charles' residence: his mother cooks, his sister Jen irritably sets the table, his father pays bills, his sister Peg works on a jigsaw, and twin 9-year-old boys squabble over an action figure, as the TV plays a Match Game in the living room."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In a modest Ohio house in 1979, the buffet is attended by Charles, in an ill-fitting black suit, and Martin, dressed in a shirt and tie. The scene is comprised of forty-odd friends and neighbors who are dressed darkly and engage in quiet discussions, with some crying on a grey, snowy day in early February in Lillian, Ohio. Outside, many cars, including a Sheriff's Department squad car, are parked in the driveway. On a swing set, Joe, dressed in a too-big black suit, solemnly sits while holding a locket. His attention is drawn upwards when a distinct 1968 Buick GSX, a yellow muscle car with a black racing stripe, arrives. A man in his early 40s, who wears jeans and a work shirt, gets out of the car. Joe carefully watches as Louis moves to the house and enters. Tears fill his eyes as Joe's focus returns to the locket, but raised voices from the house break the moment. The sound of breaking glass follows, and then the back door bursts open, showing Joe's father, Jack, who leads a handcuffed and in-pain Louis Dainard to the squad car. Their eyes briefly lock, but visibly uncomfortable, Jack drives away. Joe, as he watches them depart, looks back at the locket and finally closes it. As winter is remembered only as a memory, the last day of school is celebrated by hundreds of kids. Girls emphatically embrace goodbye while boys happily run off. Red-faced, Charles hands pages to Joe, and they head to the 7-Eleven. As they scan the candy aisle, Cary, with a burn wrap on his arm, joins them. Joe nods at a magazine while a hectic family scene is created at Charles' house: his mother cooks, his sister Jen angrily sets the table, his father pays bills, his sister Peg works on a puzzle, and twin 9-year-old boys bicker over an action figure, as a Match Game is played on the TV in the living room."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In a modest Ohio house in 1979, Charles in an ill-fitting suit and Martin in a shirt and tie attend a buffet. Amidst forty friends and neighbors in dark attire, some cry quietly on a grey, snowy February day in Lillian, Ohio. Several cars, including a Sheriff's squad car, are parked outside. Joe, in an oversized black suit, sits on a swing, holding a locket. He looks up as a 1968 yellow Buick GSX with a black stripe arrives. A man in his 40s, wearing jeans and a work shirt, exits the car. Joe watches as Louis enters the house. Tearfully focused on the locket, Joe is interrupted by raised voices and breaking glass; the back door bursts open as his father, Jack, leads a handcuffed Louis Dainard to the squad car. Their eyes briefly meet before Jack drives away uncomfortably. Joe watches them leave, closes the locket, and shifts to the joy of kids celebrating the last day of school—girls embrace while boys run joyfully. Charles hands Joe pages, and they head to 7-Eleven. Cary, with a burn wrap, joins them as they browse candy. At Charles’ house, his mother cooks, sister Jen angrily sets the table, his father pays bills, sister Peg does a puzzle, and twin boys bicker over a toy as the TV plays Match Game."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In a modest Ohio house in 1979, Charles in an ill-fitting black suit and Martin in a shirt and tie are at the buffet among forty-odd darkly dressed friends and neighbors engaging in quiet discussions on a grey, snowy February day in Lillian, Ohio. Many cars are parked outside, including a Sheriff's squad car. Joe, in a too-big black suit, sits on a swing set, holding a locket. He looks up as a distinct 1968 Buick GSX, a yellow muscle car, arrives. A man in his 40s, wearing jeans and a work shirt, exits. Joe watches Louis move inside the house. Joe focuses back on the locket, tears in his eyes, but raised voices and breaking glass from the house interrupt. The back door bursts open, revealing Joe's father, Jack, leading a handcuffed Louis Dainard to the squad car. Their eyes briefly lock before Jack, visibly uncomfortable, drives away. Joe watches them leave, closes the locket. As winter fades, kids celebrate their last school day. Girls embrace goodbye while boys run happily. Charles, red-faced, gives Joe pages, and they head to the 7-Eleven. Cary, with a burn wrap, joins them in the candy aisle. Joe nods at a magazine as a chaotic family scene unfolds at Charles' house: cooking, Jen angrily setting the table, his father paying bills, Peg puzzling, and twins bickering over a toy, as the TV plays Match Game."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a modest house located in Ohio in the year 1979, Charles, who is wearing a black suit that doesn't quite fit him properly, and Martin, attired in a shirt and tie, are seen standing at the buffet table. The scene is set among approximately forty friends and neighbors, all dressed in somber dark clothing. They are engaged in quiet discussions, with some individuals softly crying amidst the backdrop of a grey, snowy day that has settled over Lillian, Ohio in the early days of February. Outside, a variety of cars are parked, crowding the area, including a Sheriff's Department squad car prominently positioned in the driveway. Joe, clad in a black suit that is noticeably too large for him, sits solemnly on a swing set, clutching a locket in his hand. He looks up with curiosity when he hears the arrival of a distinctive 1968 Buick GSX, a striking yellow muscle car adorned with a bold black racing stripe. A man, appearing to be in his early 40s, steps out of the car dressed casually in jeans and a work shirt. Joe watches intently as Louis makes his way toward the house and enters inside. Joe's focus then shifts back to the locket, and emotions well up in his eyes, but the poignant moment is shattered by the sudden sound of raised voices emanating from the house. This is followed by the crashing noise of breaking glass, and soon the back door bursts open. Joe's father, Jack, emerges, leading a handcuffed and visibly distressed Louis Dainard toward the squad car. For a brief moment, their eyes meet, but Jack, appearing visibly uneasy, proceeds to drive away. Joe watches them as they depart, then shifts his gaze back to the locket before finally closing it thoughtfully. As winter gradually fades into memory, giving way to the warmth of a new season, hundreds of jubilant children can be seen celebrating the end of their last day of school. Enthusiastic girls exchange heartfelt embraces as they say goodbye, while boys dash off excitedly. Charles, with a flushed face, hands a set of pages to Joe, and together they make their way to the nearby 7-Eleven. Cary, with a noticeable burn wrap on his arm, joins them as they continue to survey the candy aisle. Joe gives a nod of acknowledgment toward a magazine, while at the same time, a chaotic family scene unfolds at Charles' house. Inside, his mother is busy cooking, his sister Jen is setting the table with a look of frustration, his father is absorbed in paying bills, his sister Peg is working diligently on a puzzle, and the twin 9-year-old boys are in the midst of a heated argument over an action figure, all while the TV broadcasts a lively episode of Match Game in the living room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a modest yet welcoming house situated in the serene landscape of Ohio during the year 1979, Charles, dressed in a black suit that admittedly doesn't quite fit him properly, and Martin, attired in a more formal shirt and tie, are present, standing at the buffet table. The scene unfolds amidst a gathering of roughly forty friends and neighbors, all of whom are attired in somber, dark-colored clothing. They are engaged in quiet, subdued discussions, while some individuals softly weep, creating a poignant atmosphere against the backdrop of a grey, snowy day that has settled over the town of Lillian, Ohio, during the early days of February. Outside the house, a variety of vehicles are parked, crowding the area, including a Sheriff's Department squad car prominently stationed in the driveway, standing out among the others. Joe, wearing a black suit that is noticeably too large for his frame, sits with a solemn expression on a swing set, clutching a small, precious locket in his hand. His gaze lifts with curiosity when he hears the distinct rumble of a 1968 Buick GSX arriving, a striking yellow muscle car boldly adorned with a dramatic black racing stripe. A man, seemingly in his early 40s, emerges from the car, casually dressed in jeans and a work shirt, and Joe watches him with keen interest as Louis makes his way toward the house and steps inside. Joe's focus then returns to the locket, and as he contemplates its significance, emotions begin to well up in his eyes. However, the poignant moment is abruptly interrupted by the sudden sound of raised voices emanating from within the house, followed by the crashing noise of breaking glass. Moments later, the back door bursts open. Joe's father, Jack, emerges, leading a handcuffed and visibly distressed Louis Dainard toward the squad car. For a brief moment, their eyes meet, but Jack, who appears visibly uneasy, continues on to drive away. Joe watches them as they depart, then shifts his gaze back to the locket, closing it thoughtfully. As the cold grasp of winter gradually fades into memory, making way for the warmth and renewal of a new season, hundreds of jubilant children can be seen joyfully celebrating the end of their last day of school. Enthusiastic girls exchange heartfelt embraces as they bid one another goodbye, while boys dash off excitedly, full of energy and anticipation. Charles, with a rosy, flushed face from excitement, hands a set of pages to Joe, and together, they proceed to the nearby 7-Eleven. Cary, sporting a noticeable burn wrap on his arm, joins them as they continue to peruse the candy aisle. Joe gives a nod of acknowledgment toward a magazine, while a lively yet chaotic family scene unfolds at Charles' house. Inside, his mother is busy cooking, his sister Jen is setting the table with a look of frustration, his father is engrossed in the task of paying bills, his sister Peg is diligently working on a puzzle, and the twin 9-year-old boys are in the midst of a heated argument over an action figure, all while the TV broadcasts a lively and entertaining episode of Match Game in the living room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In a modest Ohio house in 1979, the scene unfolds with Charles, clad in an ill-fitting black suit, and Martin, smartly dressed in a shirt and tie, standing by the buffet table, their movements deliberate as they navigate the somber atmosphere. Around them, a gathering of forty-some friends and neighbors, all dressed in dark attire, engage in subdued conversations, while some individuals quietly weep, their expressions reflecting the heavy emotions surrounding them on this grey, snowy day in early February in Lillian, Ohio. Outside, numerous cars are parked, including a Sheriff's Department squad car stationed prominently in the driveway, its presence adding to the gravity of the occasion. Nearby, Joe, donning a black suit that is noticeably too large for him, sits silently and solemnly on a swing set, the chains creaking slightly under his weight as he holds a locket in his hand. His gaze lifts when he hears the rumble of an engine, and with keen interest, he observes a distinctive 1968 Buick GSX, its yellow body accentuated by a black racing stripe, as it pulls up. From the car emerges a man in his early 40s, casually dressed in jeans and a work shirt, who purposefully moves toward the house and disappears inside. Joe, after watching Louis with keen concentration, shifts his attention back to the locket, his eyes welling up with tears that threaten to overflow. This quiet moment of contemplation is suddenly disrupted by the escalating sound of raised voices emanating from within the house, quickly followed by the unmistakable crash of breaking glass. With a forceful push, the back door swings open, and Joe's father, Jack, steps out, leading a grimacing and handcuffed Louis Dainard toward the squad car. Their eyes meet fleetingly, a shared moment of recognition filled with tension, but Jack, despite his evident discomfort, quickly ushers Louis into the car and drives away, leaving Joe to watch them disappear down the road. As the car fades from view, Joe's gaze returns to the locket, and with a poignant sense of finality, he closes it shut. Time moves forward, and the harshness of winter gives way to the warmth of new beginnings, as hundreds of jubilant children spill out of school, celebrating the last day with unrestrained joy. Girls embrace each other with emphatic goodbyes, while boys dash off with laughter and excitement. Amidst this energetic scene, Charles, his face flushed with enthusiasm, hands some pages to Joe, and together they make their way to the local 7-Eleven. As they peruse the candy aisle, Cary, who sports a burn wrap on his arm, joins their little group. Joe, momentarily distracted, nods toward a magazine, his attention partially drawn to a hectic scene back at Charles' house. There, his mother busily cooks in the kitchen, the sound of pots and pans clattering around her. His sister Jen moves about the dining room, setting the table with an air of indignation, each placement of dishware punctuated by her irritation. In the living room, Charles' father sits with bills spread before him, his brow furrowed in concentration as he methodically works through them. Meanwhile, his sister Peg, intent and focused, pieces together a puzzle, her concentration undisturbed by the twin 9-year-old boys who energetically bicker over the possession of an action figure, their dispute filling the space with animated chatter. Through it all, the familiar sounds of a Match Game episode play on the TV, providing a consistent hum that underscores the bustling familial environment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In a modest Ohio house in February 1979, Charles in an ill-fitting black suit and Martin in a shirt and tie are at the buffet, among forty-odd friends and neighbors engaged in quiet conversations or crying. Outside, many cars are parked, including a Sheriff's Department squad car. Joe, dressed in a too-big black suit, sits solemnly on a swing set, holding a locket, and observes a 1968 Buick GSX arrive. A man in his early 40s, Louis Dainard, exits the car and enters the house. Joe's attention returns to the locket until raised voices and breaking glass from inside interrupt him. Jack, Joe's father, emerges from the house, leading a handcuffed Louis to the squad car amid discomfort, and drives away after a brief, tense lock of eyes with Joe. Joe watches them depart, then closes his locket. As winter fades and school ends, children joyously celebrate, with girls embracing and boys running off. Charles hands Joe some pages, and they head to the 7-Eleven, joined by Cary with a burn wrap, as they browse the candy aisle. Meanwhile, at Charles' house, a lively scene unfolds: his mother cooks, sister Jen sets the table angrily, his father pays bills, sister Peg works on a puzzle, twin brothers argue, and the TV plays Match Game in the living room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In a modest Ohio house in 1979, a year remembered for its cultural shifts and growing technological advancements, Charles, in an ill-fitting black suit indicative of a small-town upbringing, and Martin, dressed in a shirt and tie, are at the buffet set up for a somber gathering. The scene includes forty-odd friends and neighbors dressed darkly, engaging in quiet discussions reminiscent of communal support during tough times, with some crying on a grey, snowy day in early February in Lillian, Ohio, a small town with a tight-knit community. Many cars are parked outside, including a Sheriff's Department squad car in the driveway, signifying official presence. Joe, dressed in a too-big black suit handed down from his older brother, solemnly sits on a swing set in the backyard, holding a locket containing a picture of his late mother. He looks up when a distinct 1968 Buick GSX, a classic yellow muscle car with a black racing stripe known for its powerful engine, arrives. A man in his early 40s, wearing jeans and a work shirt as if coming straight from a mechanic's job, exits the car. Joe watches carefully as Louis, known in town for his troubled past, moves to the house and inside. Joe's focus returns to the locket as tears fill his eyes, but the moment is broken by raised voices from the house. The sound of breaking glass follows, and the back door bursts open, revealing Joe's father, Jack, an officer known for his fairness and dedication, leading a handcuffed and in-pain Louis Dainard to the squad car. Their eyes lock briefly, but Jack, visibly uncomfortable with arresting someone he once considered a friend, drives away. Joe watches them depart, looks back at the locket, and finally closes it, remembering happier times. As winter becomes a memory, hundreds of kids in the area celebrate leaving their last day of school with the joy only summer can bring. Girls emphatically embrace goodbye while boys, eager for the freedom of summer adventures, run off happily. Charles, red-faced from excitement, hands Joe pages of a script they've been working on, and they head to the 7-Eleven, a popular local hangout spot for kids. Cary, with a burn wrap on his arm from a recent science experiment gone awry, joins them as they scan the candy aisle, seeking the perfect snack. Joe nods at a magazine filled with news of the upcoming Star Wars sequel while a hectic family scene unfolds at Charles' house: his mother cooks a traditional family recipe, his sister Jen angrily sets the table after a disagreement with a friend, his father pays bills with a focused frown, his sister Peg works on a puzzle that reminds her of their summer vacation spot, and twin 9-year-old boys bicker over an action figure inspired by their favorite Saturday morning cartoon, as the TV plays a Match Game in the living room, a popular game show of the era."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Joe pages and they head to the 7Eleven In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet Many cars are parked outside including a Sheriff's Department squad car in the driveway his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket As winter becomes a memory hundreds of kids celebrate leaving their last day of school The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio Many cars are parked outside including a Sheriff's Department squad car in the driveway Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives A man in his early 40s wearing jeans and a work shirt exits the car Joe watches carefully as Louis moves to the house and inside Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car Their eyes lock briefly but Jack visibly uncomfortable drives away Cary with a burn wrap on his arm joins them as they scan the candy aisle Joe watches them depart looks back at the locket and finally closes it As winter becomes a memory hundreds of kids celebrate leaving their last day of school The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car Girls emphatically embrace goodbye while boys run off happily Charles redfaced hands Joe pages and they head to the 7Eleven Cary with a burn wrap on his arm joins them as they scan the candy aisle Joe nods at a magazine while a hectic family scene unfolds at Charles' house In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet. The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio. Many cars are parked outside including a Sheriff's Department squad car in the driveway. Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket. He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives. A man in his early 40s wearing jeans and a work shirt exits the car. Joe watches carefully as Louis moves to the house and inside. Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house. The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Their eyes lock briefly but Jack visibly uncomfortable drives away. Joe watches them depart looks back at the locket and finally closes it. As winter becomes a memory hundreds of kids celebrate leaving their last day of school. Girls emphatically embrace goodbye while boys run off happily. Charles redfaced hands. Joe pages and they head to the 7Eleven. Cary with a burn wrap on his arm joins them as they scan the candy aisle. Joe nods at a magazine while a hectic family scene unfolds at Charles' house. his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet. The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio. Many cars are parked outside including a Sheriff's Department squad car in the driveway. Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket. He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives. A man in his early 40s wearing jeans and a work shirt exits the car. Joe watches carefully as Louis moves to the house and inside. Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house. The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Their eyes lock briefly but Jack visibly uncomfortable drives away. Joe watches them depart looks back at the locket and finally closes it. As winter becomes a memory hundreds of kids celebrate leaving their last day of school. Girls emphatically embrace goodbye while boys run off happily. Charles redfaced hands. Joe pages and they head to the 7Eleven. Cary with a burn wrap on his arm joins them as they scan the candy aisle. Joe nods at a magazine while a hectic family scene unfolds at Charles' house. his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet. The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio. Many cars are parked outside including a Sheriff's Department squad car in the driveway. Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket. He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives. Joe pages and they head to the 7Eleven. Cary with a burn wrap on his arm joins them as they scan the candy aisle. Joe nods at a magazine while a hectic family scene unfolds at Charles' house. his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet. The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio. Joe nods at a magazine while a hectic family scene unfolds at Charles' house. his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In a modest Ohio house in 1979, a parrot, in an ill-fitting black suit, and a giraffe, dressed in a shirt and tie, are at the buffet. The scene includes forty-odd friends and neighbors dressed darkly, engaging in quiet discussions, with some crying on a grey, snowy day in early February in Lillian, Ohio. Many cars are parked outside, including a Sheriff's Department squad car in the driveway. A penguin, dressed in a too-big black suit, solemnly sits on a swing set, holding a locket. The penguin looks up when a distinct 1968 Buick GSX, a yellow muscle car with a black racing stripe, arrives. A kangaroo in his early 40s, wearing jeans and a work shirt, exits the car. The penguin watches carefully as an elephant moves to the house and inside. The penguin's focus returns to the locket as tears fill its eyes, but the moment is broken by raised voices from the house. The sound of breaking glass follows, and the back door bursts open, revealing the penguin's father, a goat, leading a handcuffed and in-pain zebra to the squad car. Their eyes lock briefly, but the goat, visibly uncomfortable, drives away. The penguin watches them depart, looks back at the locket, and finally closes it. As winter becomes a memory, hundreds of kids celebrate leaving their last day of school. Giraffes emphatically embrace goodbye while parrots run off happily. A parrot, red-faced, hands the penguin pages, and they head to the 7-Eleven. A cat, with a burn wrap on its arm, joins them as they scan the candy aisle. The penguin nods at a magazine while a hectic family scene unfolds at the parrot's house: its mother cooks, its sister Jen angrily sets the table, its father pays bills, its sister Peg works on a puzzle, and twin 9-year-old foxes bicker over an action figure, as the TV plays a Match Game in the living room."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In a modest Michigan cabin in 1985, Charles, in an ill-fitting green jacket, and Martin, dressed in a polo shirt and slacks, are at the picnic table. The scene includes forty-odd colleagues and acquaintances dressed brightly, engaging in quiet discussions, with some crying on a sunny, rainy day in late March in Lillian, Michigan. Many bicycles are parked outside, including a Sheriff's Department firetruck in the driveway. Joe, dressed in a too-big green jacket, solemnly sits on a hammock, holding a keychain. He looks up when a distinct 1972 Dodge Charger, a blue sports car with a white racing stripe, arrives. A woman in her early 30s, wearing a skirt and a blouse, exits the car. Joe watches carefully as Louis moves to the cabin and inside. Joe's focus returns to the keychain as tears fill his eyes, but the moment is broken by raised voices from the cabin. The sound of breaking plates follows, and the side door bursts open, revealing Joe's father, Jack, leading a shackled and in-distress Louis Dainard to the firetruck. Their eyes lock briefly, but Jack, visibly uncomfortable, pedals away. Joe watches them depart, looks back at the keychain, and finally pockets it. As spring becomes a memory, hundreds of teenagers celebrate leaving their first day of summer camp. Girls emphatically wave hello while boys skip off happily. Charles, red-faced, hands Joe comic books, and they head to the arcade. Cary, with a cast on his leg, joins them as they scan the snack rack. Joe nods at a brochure while a hectic family scene unfolds at Charles' cabin: his mother sews, his sister Jen angrily waters the plants, his father reads magazines, his sister Peg works on a collage, and twin 9-year-old boys argue over a teddy bear, as the radio plays a quiz show in the den."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In a modest Ohio house in 1979, Charles, in an ill-fitting black suit, and Martin, dressed in a shirt and tie, are near the buffet. The scene includes forty-odd friends and neighbors dressed darkly, participating in quiet card games, with some laughing on a grey, snowy day in early February in Lillian, Ohio. Many cars are parked outside, including a Sheriff's Department squad car in the driveway. Joe, dressed in a too-big black suit, cheerfully swings on a swing set, holding a locket. He glances up when a distinct 1968 Buick GSX, a yellow muscle car with a black racing stripe, parks. A man in his early 40s, wearing jeans and a work shirt, enters the car. Joe observes carefully as Louis walks to the house and outside. Joe's focus shifts to the locket as smiles fill his face, but the moment is interrupted by laughter from the house. The sound of clinking glasses follows, and the back door swings open, revealing Joe's father, Jack, guiding a handcuffed and annoyed Louis Dainard to the squad car. Their eyes meet briefly, but Jack, visibly amused, drives away. Joe watches them leave, looks back at the locket, and finally opens it. As winter fades away, hundreds of kids celebrate entering their first day of summer. Girls enthusiastically cheer hello while boys chase each other excitedly. Charles, flushed, passes Joe pages, and they head to the 7-Eleven. Cary, with a colorful bandana on his arm, joins them as they browse the candy aisle. Joe points at a magazine while a calm family scene unfolds at Charles' house: his mother sings, his sister Jen joyfully sets the table, his father watches TV, his sister Peg reads a book, and twin 9-year-old boys share an action figure, as the TV plays a cartoon in the living room."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In a towering Nevada skyscraper in 1987, a sunflower, in a well-tailored orange jacket, and a dolphin, dressed in a dress and scarf, are at the library. The scene includes ninety-odd calculators and washing machines dressed brightly, engaging in loud debates, with some laughing on a bright, sunny day in late August in Springfield, Nevada. Many bicycles are parked outside, including an Ice Cream Truck in the garage. A panda, dressed in a too-small red dress, casually sits on a roller coaster, holding a compass. It looks up when a distinctive 1972 Volkswagen Beetle, a blue convertible with a white floral pattern, arrives. A cat in its late 60s, wearing shorts and a tank top, exits the vehicle. The panda observes keenly as a kangaroo hops to the library and inside. The panda's attention returns to the compass as joy fills its eyes, but the moment is interrupted by whispered giggles from the library. The sound of clattering pans follows, and the front door swings open, revealing the panda's best friend, Jessica, escorting a laughing and energetic kangaroo Smith to the Ice Cream Truck. Their glances meet fleetingly, but Jessica, visibly amused, drives away. The panda watches them leave, glances back at the compass, and finally pockets it. As autumn becomes a memory, thousands of robots celebrate entering their first day at the factory. Fish passionately wave goodbye while unicorns skip off joyfully. The sunflower, out of breath, hands the panda pencils, and they head to the pizza parlor. An eagle, with a cast on its leg, flaps along as they admire the book section. The panda smiles at a newspaper while a serene garden scene unfolds at the sunflower's skyscraper: its aunt sews, its cousin Lily cheerfully waters plants, its uncle reads newspapers, its cousin Sam paints a mural, and twin 15-year-old girls argue over a comic book, as the radio plays a jazz concert in the garden."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In a modest Ohio house in 1979, Harold, in an ill-fitting black suit, and Edgar, dressed in a shirt and tie, are at the piano. The scene includes forty-odd relatives and coworkers dressed darkly, engaging in quiet card games, with some laughing on a grey, rainy day in early March in Lillian, Ohio. Many bicycles are parked outside, including a Fire Department truck in the driveway. Sam, dressed in a too-big black suit, nervously stands on a trampoline, holding a compass. He gazes up when a distinct 1968 Pontiac GTO, a green muscle car with a white racing stripe, departs. A woman in her early 40s, wearing a skirt and a blouse, enters the car. Sam listens intently as Walter strolls to the house and inside. Sam's attention returns to the compass as laughter fills his eyes, but the moment is broken by whispered voices from the house. The sound of shattering china follows, and the front door swings open, revealing Sam's uncle, Harry, escorting a handcuffed and distraught Walter Englewood to the fire truck. Their eyes meet briefly, but Harry, visibly confused, drives away. Sam observes them leave, glances at the compass, and finally pockets it. As winter fades into imagination, hundreds of teenagers mourn leaving their last day of school. Boys reluctantly shake goodbye while girls skip off excitedly. Harold, teary-eyed, hands Sam envelopes, and they head to the diner. Marcus, with a cast on his leg, joins them as they browse the ice cream aisle. Sam grins at a poster while a tranquil family scene unfolds at Harold's house: his father bakes, his brother Tom happily stacks the chairs, his mother knits, his brother Max builds a model, and twin 9-year-old girls argue over a comic book, as the radio plays a baseball game in the backyard."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In a modest Ohio zoo in 1979, Charles, in an ill-fitting black robe, and Martin, dressed in a jersey and scarf, are at the bonfire. The scene includes forty-odd friends and neighbors dressed brightly, engaging in cheerful stories, with some laughing on a sunny, windy day in early August in Lillian, Ohio. Many scooters are lined outside, including a Fire Department fire truck in the driveway. Joe, dressed in a too-big black robe, cheerfully stands on a trampoline, holding a harmonica. He gazes up when a distinct 1968 VW Beetle, a pink flower car with a green polka dot, arrives. A woman in her early 40s, wearing a sundress and sandals, enters the car. Joe observes intently as Louis wanders to the zoo and outside. Joe's attention shifts to the harmonica as giggles fill his face, but the moment is disrupted by soft songs from the zoo. The sound of tinkling bells follows, and the front gate swings open, revealing Joe's brother, Jack, leading a dancing and joyful Louis Dainard to the fire truck. Their eyes meet briefly, but Jack, visibly ecstatic, pedals away. Joe watches them retreat, glances back at the harmonica, and finally plays it. As autumn becomes a reality, hundreds of kids ponder entering their first day of summer camp. Girls gracefully dance goodbye while boys skip off cheerfully. Charles, blue-faced, tosses Joe feathers, and they fly to the bakery. Cary, with a sticker on his toe, joins them as they scan the soup aisle. Joe glances at a calendar while a tranquil park scene unfolds at Charles' zoo: his mother relaxes, his sister Jen joyfully digs the sand, his father waters plants, his sister Peg paints a canvas, and twin 9-year-old boys giggle over a snow globe, as the radio plays a Match Game in the sandbox."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In a spacious Florida villa in 1985, Victoria, in an oversized orange jumpsuit, and Larry, dressed in a hoodie and shorts, are at the petting zoo. The scene includes twenty-odd classmates and relatives dressed brightly, engaging in loud debates, with some laughing on a sunny, windy day in late September in Harmony, Florida. Many bicycles are parked outside, including a Fire Department fire truck in the garage. Sam, dressed in a too-small clown costume, cheerfully stands on a trampoline, holding a seashell. He gazes up when a shiny 1975 Ford Bronco, a purple convertible with a white polka dot pattern, arrives. A woman in her late 30s, wearing a sundress and sandals, exits the vehicle. Sam listens intently as Grace dances to the barn and inside. Sam's mind returns to the seashell as giggles fill his ears, but the moment is interrupted by muffled giggles from the barn. The sound of shattering ceramics follows, and the front gate swings open, revealing Sam's aunt, Ruth, leading a bandaged and laughing Grace Pemberton to the fire truck. Their eyes meet briefly, but Ruth, visibly amused, drives away. Sam observes them leave, glances back at the seashell, and finally sets it down. As spring becomes a reality, dozens of toddlers celebrate arriving at their first day of kindergarten. Boys fiercely fist-bump hello while girls skip off gleefully. Victoria, red-faced, hands Sam balloons, and they glide to the Baskin-Robbins. Ricky, with a bandaged nose, joins them as they explore the fruit aisle. Sam gestures at a comic while a peaceful picnic unfolds at Victoria's villa: her father grills, her brother Tom eagerly sets the chairs, her mother reads emails, her brother Andy practices on a jigsaw, and twin 6-year-old girls chant over a puppet, as the radio plays a quiz show in the backyard."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a modest Ohio house in 1979, Charles and Martin are at a buffet surrounded by forty friends and neighbors, some crying quietly on a snowy February day in Lillian, Ohio. Cars line the driveway, including a Sheriff’s squad car. Joe, wearing an oversized black suit, sits on a swing with a locket. A 1968 Buick GSX arrives, and Louis exits. Joe notices raised voices and breaking glass from the house. His father, Jack, leads a handcuffed Louis to the squad car, their eyes briefly meeting before Jack drives away. Joe closes the locket, tears in his eyes. As winter fades, kids celebrate the end of school. Charles gives Joe pages at a 7-Eleven, joined by Cary, sporting a burn wrap. Meanwhile, a busy family scene unfolds at Charles’ home, with his mother cooking, Jen setting the table angrily, his father paying bills, Peg working on a puzzle, twins fighting, and a TV playing Match Game in the background."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room Joe nods at a magazine while a hectic family scene unfolds at Charles' house Cary with a burn wrap on his arm joins them as they scan the candy aisle Joe pages and they head to the 7Eleven Charles redfaced hands Girls emphatically embrace goodbye while boys run off happily As winter becomes a memory hundreds of kids celebrate leaving their last day of school Joe watches them depart looks back at the locket and finally closes it Their eyes lock briefly but Jack visibly uncomfortable drives away The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house Joe watches carefully as Louis moves to the house and inside A man in his early 40s wearing jeans and a work shirt exits the car He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket Many cars are parked outside including a Sheriff's Department squad car in the driveway The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Charles redfaced hands Girls emphatically embrace goodbye while boys run off happily He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives Their eyes lock briefly but Jack visibly uncomfortable drives away A man in his early 40s wearing jeans and a work shirt exits the car Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house Joe nods at a magazine while a hectic family scene unfolds at Charles' house Joe watches carefully as Louis moves to the house and inside Joe watches them depart looks back at the locket and finally closes it Cary with a burn wrap on his arm joins them as they scan the candy aisle The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio As winter becomes a memory hundreds of kids celebrate leaving their last day of school Many cars are parked outside including a Sheriff's Department squad car in the driveway Joe pages and they head to the 7Eleven his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Their eyes lock briefly but Jack visibly uncomfortable drives away Joe watches them depart looks back at the locket and finally closes it As winter becomes a memory hundreds of kids celebrate leaving their last day of school Girls emphatically embrace goodbye while boys run off happily Charles redfaced hands Joe pages and they head to the 7Eleven Cary with a burn wrap on his arm joins them as they scan the candy aisle Joe nods at a magazine while a hectic family scene unfolds at Charles' house his mother cooks his sister Jen angrily sets the table his father pays bills his sister Peg works on a puzzle and twin 9yearold boys bicker over an action figure as the TV plays a Match Game in the living room In a modest Ohio house in 1979 Charles in an illfitting black suit and Martin dressed in a shirt and tie are at the buffet The scene includes fortyodd friends and neighbors dressed darkly engaging in quiet discussions with some crying on a grey snowy day in early February in Lillian Ohio Many cars are parked outside including a Sheriff's Department squad car in the driveway Joe dressed in a toobig black suit solemnly sits on a swing set holding a locket He looks up when a distinct 1968 Buick GSX a yellow muscle car with a black racing stripe arrives A man in his early 40s wearing jeans and a work shirt exits the car Joe watches carefully as Louis moves to the house and inside Joe's focus returns to the locket as tears fill his eyes but the moment is broken by raised voices from the house The sound of breaking glass follows and the back door bursts open revealing Joe's father Jack leading a handcuffed and inpain Louis Dainard to the squad car"
        }
      ]
    }
  ]
}