{
  "ground_truth": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away, he turns back for a moment, then keeps walking. Abby looks away haughtily. Abby sits on the couch staring at a box of ELECTRIC. She opens the box, dumping out a pair of underwear and a REMOTE CONTROL. Abby checks herself out in the mirror. As Abby, Mike, and Colin walk into the bar, two buxom blonde twin JELLO GIRLS, BAMBI and CANDI, rush up to Mike. They slap him on the back, eyeing the twins. The group sits down at the table. Abby tries to kick Mike. As she does, she unwittingly knocks over her purse. The contents spill out, and the REMOTE for her vibrating underwear rolls away, stopping UNDER THE TABLE. A PRECOCIOUS KID, 8, sits with his parents. A small RED LIGHT turns on. As Harold and Bob laugh, Stuart slaps Mike on the back. Suddenly, her smile quickly changes to horror. She shifts in her seat, trying to control her NOW-VIBRATING. She leans down to grab her purse. She pokes her head under the table to see that the contents of her purse have spilled. Mike's head appears next to hers. Mike starts laughing. Stuart watches, worried, as Abby rises from underneath the table, clutching her head and looking around frantically, trying to figure out who has the remote. The kid has flicked up the speed on the remote even higher. Abby's eyes roll back. She starts to get up when Stuart stops her. Candi looks at Harold, intrigued by Abby's display. As Stuart frowns, concerned, Abby spasms, then rushes through it as fast as she can. She leaps to her feet. As they all walk out, Mike grabs the remote from the kid. Abby spots this and snatches the remote out of Mike's hand. She shoots him a look. Colin walks up. On set, Mike addresses the camera. NEARBY, a confused Joy looks at Abby. Georgia winks at him. Abby looks at the agent, confused. The CAB DRIVER looks at her. Mike walks out of the lobby, as Abby gets out of a cab, suitcase in hand. Abby glares at him, about to show her true feelings, but then quickly covers. Abby and Mike sit in the backseat. Abby looks down at her notes. Mike studies her. Abby sits there, fuming that he's right. Mike looks at her, surprised. The audience applauds as Mike takes a deep breath and heads on stage. Abby now sits in the audience, watching as Jay interviews Mike on stage. Abby talks on the phone. Abby's surprised, then suspicious. The waiter arrives with mojitos. Abby looks at him. Abby sips her mojito, studying Mike.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Abby rotates her eyes with a grin and proceeds inside. As Mike is strolling away, he rotates back for a second, then continues strolling. Abby glances away arrogantly. Abby perches on the sofa gazing at a package of ELECTRIC. She unseals the package, emptying out a duo of lingerie and a REMOTE CONTROL. Abby inspects herself in the reflector. As Abby, Mike, and Colin saunter into the pub, a pair of voluptuous fair-haired twin JELLO GIRLS, BAMBI and CANDI, dash up to Mike. They smack him on the rear, observing the duplicates. The troupe settles down at the table. Abby attempts to nudge Mike. As she does, she inadvertently topples over her bag. The contents scatter out, and the REMOTE for her vibrating lingerie rolls away, halting UNDER THE TABLE. A PRECOCIOUS CHILD, 8, perches with his guardians. A petite RED LIGHT activates. As Harold and Bob chuckle, Stuart smacks Mike on the shoulder. Instantly, her grin swiftly shifts to terror. She maneuvers in her position, attempting to regulate her NOW-VIBRATING. She leans down to seize her bag. She peers her head under the table to observe that the contents of her bag have scattered. Mike's head emerges adjacent to hers. Mike begins chuckling. Stuart observes, anxious, as Abby ascends from beneath the table, clutching her head and glancing around frenetically, attempting to deduce who possesses the remote. The child has increased the pace on the remote even higher. Abby's eyes rotate backward. She begins to rise when Stuart halts her. Candi observes Harold, intrigued by Abby's exhibition. As Stuart scowls, worried, Abby convulses, then dashes through it as rapidly as she can. She springs to her feet. As they all exit, Mike seizes the remote from the child. Abby notices this and grabs the remote out of Mike's grasp. She shoots him a glance. Colin approaches. On set, Mike addresses the camera. NEARBY, a bewildered Joy gazes at Abby. Georgia winks at him. Abby glances at the agent, bewildered. The CAB DRIVER gazes at her. Mike strides out of the foyer, as Abby exits a taxi, suitcase in hand. Abby glares at him, about to reveal her genuine emotions, but then swiftly conceals. Abby and Mike sit in the rear seat. Abby gazes down at her notes. Mike examines her. Abby remains there, seething that he's correct. Mike glances at her, astonished. The spectators cheer as Mike takes a deep breath and proceeds on stage. Abby now perches in the spectators, observing as Jay interviews Mike on stage. Abby converses on the phone. Abby's astonished, then distrustful. The server arrives with mojitos. Abby gazes at him. Abby sips her mojito, examining Mike."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike walks away, he turns back for a moment, then keeps walking. Abby looks away haughtily. On the couch, a box of ELECTRIC is stared at by Abby. The box is opened by her, and a pair of underwear and a REMOTE CONTROL are dumped out. In the mirror, Abby checks herself out. As the bar is entered by Abby, Mike, and Colin, two buxom blonde twin JELLO GIRLS, BAMBI and CANDI, rush up to Mike. He is slapped on the back by them, as they eye the twins. At the table, the group sits down. Mike is tried to be kicked by Abby. As this is done by her, her purse is unwittingly knocked over. The contents spill out, and UNDER THE TABLE, the REMOTE for her vibrating underwear rolls. With his parents, a PRECOCIOUS KID, 8, sits. A small RED LIGHT turns on. As Harold and Bob laugh, Mike is slapped on the back by Stuart. Suddenly, Abby's smile quickly changes to horror. In her seat, she shifts, trying to control her NOW-VIBRATING. She leans down to grab her purse. Under the table, she pokes her head to see that the contents of her purse have spilled. Next to hers, Mike's head appears. Laughter is started by Mike. Worried, Stuart watches as Abby rises from underneath the table, clutching her head and looking around frantically, trying to figure out who has the remote. The speed on the remote has been flicked up even higher by the kid. Abby's eyes roll back. She starts to get up when Stuart stops her. Harold is looked at by Candi, intrigued by Abby's display. As Stuart frowns, concerned, Abby spasms, then rushes through it as fast as she can. To her feet, she leaps. As they all walk out, the remote is grabbed from the kid by Mike. This is spotted by Abby, and the remote is snatched out of Mike's hand by her. A look is shot at him by her. Colin walks up. On set, the camera is addressed by Mike. Nearby, Abby is looked at by a confused Joy. At him, Georgia winks. At the agent, Abby looks, confused. At her, the CAB DRIVER looks. Out of the lobby, Mike walks, as a cab is exited by Abby, suitcase in hand. Mike is glared at by her, about to show her true feelings, but they are quickly covered by her. In the backseat, Abby and Mike sit. Down at her notes, Abby looks. At her, Mike studies. Abby sits there, fuming that he's right. At her, Mike looks, surprised. By the audience, applause is given as Mike takes a deep breath and heads on stage. Now Abby sits in the audience, watching as Jay interviews Mike on stage. On the phone, Abby talks. Abby is surprised, then suspicious. With mojitos, the waiter arrives. At him, Abby looks. Her mojito is sipped by Abby, studying Mike."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike walks away, he briefly turns back. Abby looks away haughtily. She sits on the couch, staring at a box labeled ELECTRIC, and dumps out underwear and a REMOTE CONTROL. Checking herself in the mirror, Abby, Mike, and Colin enter a bar where twin JELLO GIRLS, BAMBI and CANDI, rush to Mike. They sit at a table, and Abby accidentally knocks over her purse, spilling its contents. The REMOTE for her vibrating underwear rolls under the table. A PRECOCIOUS KID, 8, sits nearby. A RED LIGHT turns on. As Harold and Bob laugh, Stuart slaps Mike's back. Abby's smile turns to horror as she shifts, trying to control the vibrations. She leans under the table, seeing her spilled purse. Mike laughs beside her. Stuart watches, worried, as Abby rises, clutching her head, trying to find the remote. The kid increases the speed, and Abby's eyes roll back. She starts to get up, but Stuart stops her. Candi is intrigued by Abby's display. Abby spasms, then quickly stands. As they leave, Mike grabs the remote from the kid. Abby snatches it from Mike, shooting him a look. Colin approaches. On set, Mike addresses the camera. Nearby, Joy looks confused at Abby. Georgia winks at him. Abby looks confused at the agent. The CAB DRIVER looks at her. Mike exits the lobby as Abby gets out of a cab with a suitcase. Abby glares at him, almost revealing her feelings, but quickly covers. Abby and Mike sit in the backseat. Abby looks at her notes while Mike studies her. Abby fumes, knowing he's right. Mike is surprised. The audience applauds as Mike takes a deep breath and goes on stage. Abby watches from the audience as Jay interviews Mike. Abby talks on the phone, surprised and suspicious. The waiter brings mojitos. Abby sips hers, studying Mike."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Abby rolls her eyes with a smile and enters. Mike turns back briefly, then continues walking. Abby looks away haughtily. She sits on the couch, staring at a box labeled ELECTRIC, which contains underwear and a REMOTE CONTROL. Abby checks herself in the mirror. At the bar, Abby, Mike, and Colin are approached by twin JELLO GIRLS, BAMBI and CANDI, who greet Mike. Abby tries to kick Mike but knocks over her purse, spilling its contents, including the REMOTE, which stops UNDER THE TABLE. A PRECOCIOUS KID, 8, sits nearby. A RED LIGHT turns on. As Harold and Bob laugh, Stuart slaps Mike's back. Abby's smile turns to horror as she shifts, trying to control her NOW-VIBRATING underwear. She leans down to retrieve her purse, seeing its contents spilled. Mike laughs beside her. Stuart watches, worried, as Abby rises, clutching her head, searching for the remote. The kid increases the speed, and Abby's eyes roll back. She starts to rise, but Stuart stops her. Candi is intrigued by Abby's display. Stuart frowns, concerned, as Abby spasms, then quickly stands. As they leave, Mike grabs the remote from the kid. Abby snatches it from Mike, shooting him a look. Colin approaches. On set, Mike addresses the camera. Nearby, Joy looks confused at Abby. Georgia winks at him. Abby looks confused at the agent. The CAB DRIVER looks at her. Mike exits the lobby as Abby gets out of a cab, suitcase in hand. Abby glares at him, then quickly covers her feelings. Abby and Mike sit in the backseat. Abby looks at her notes while Mike studies her. Abby fumes, realizing he's right. Mike is surprised. The audience applauds as Mike takes the stage. Abby watches as Jay interviews Mike. Abby talks on the phone, surprised and suspicious. The waiter brings mojitos. Abby sips hers, studying Mike."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Abby, with a playful roll of her eyes and a smile on her face, makes her way inside. Meanwhile, as Mike begins to walk away, he pauses momentarily to glance back before continuing on his path. Abby, with an air of haughtiness, turns her gaze away. She then settles herself on the couch, her eyes fixed intently on a box labeled ELECTRIC. Curiosity piqued, she opens the box, revealing a pair of underwear and a REMOTE CONTROL, which she promptly dumps out. Abby takes a moment to admire her reflection in the mirror. Later, as Abby, Mike, and Colin make their entrance into the lively bar, they are immediately approached by two buxom blonde twin JELLO GIRLS, known as BAMBI and CANDI, who eagerly rush up to Mike. With playful enthusiasm, they slap him on the back, their eyes lingering on the twins. The group then settles down at a table. Abby, attempting to kick Mike under the table, inadvertently causes her purse to topple over. The contents spill out, and the REMOTE for her vibrating underwear rolls away, coming to a stop UNDER THE TABLE. Nearby, a PRECOCIOUS KID, around 8 years old, sits with his parents. Suddenly, a small RED LIGHT flickers on. As Harold and Bob share a laugh, Stuart gives Mike a friendly slap on the back. In an instant, Abby's smile transforms into a look of horror. She shifts uncomfortably in her seat, trying to manage the NOW-VIBRATING sensation. Leaning down, she attempts to retrieve her purse. Peering under the table, she sees the scattered contents. Mike's head appears beside hers, and he starts laughing. Stuart, observing the situation with concern, watches as Abby emerges from beneath the table, clutching her head and looking around frantically, trying to identify who has control of the remote. The kid, with mischievous intent, has increased the speed on the remote even further. Abby's eyes roll back as she begins to rise, only to be stopped by Stuart. Candi, intrigued by Abby's unusual display, glances at Harold. Stuart frowns, his concern evident, as Abby experiences a spasm, then quickly pushes through it. She leaps to her feet with urgency. As the group makes their way out, Mike manages to grab the remote from the kid. Abby, noticing this, swiftly snatches the remote from Mike's hand, shooting him a pointed look. Colin approaches. On set, Mike addresses the camera with confidence. NEARBY, a confused Joy observes Abby. Georgia gives him a playful wink. Abby, puzzled, looks at the agent. The CAB DRIVER glances at her. As Mike exits the lobby, Abby steps out of a cab, suitcase in hand. She glares at him, on the verge of revealing her true feelings, but quickly masks them. Abby and Mike find themselves seated in the backseat. Abby glances down at her notes, while Mike studies her intently. Abby sits there, fuming internally, knowing he's right. Mike, surprised, looks at her. The audience erupts in applause as Mike takes a deep breath and steps onto the stage. Abby now sits among the audience, watching as Jay conducts an interview with Mike on stage. Abby engages in a phone conversation, her expression shifting from surprise to suspicion. The waiter arrives, serving mojitos. Abby looks at him, then takes a sip of her mojito, her eyes studying Mike closely."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Abby, with a playful roll of her eyes and a bright, inviting smile gracing her face, makes her way inside with a buoyant step. Meanwhile, as Mike begins to walk away, he pauses momentarily, casting a thoughtful glance back before resolutely continuing on his path. Abby, with an air of haughtiness and a smirk, turns her gaze deliberately away from him. She then gracefully settles herself onto the couch, her eyes fixated intently on a curious box labeled ELECTRIC. Curiosity thoroughly piqued, she opens the box, which reveals a pair of underwear and a somewhat unexpected REMOTE CONTROL. With a swift movement, she promptly dumps out its contents. Abby then takes a brief moment to admire her reflection in a nearby mirror, a satisfied look on her face. Later on, as Abby, Mike, and Colin make their grand entrance into the lively, spirited bar, they are immediately approached by two buxom blonde twin JELLO GIRLS, who go by the names BAMBI and CANDI. These twins, with eager excitement, rush up to greet Mike. With playful enthusiasm, they give him a friendly slap on the back, their eyes lingering mischievously on the twins. The trio then settles down comfortably at a table. Abby, attempting to surreptitiously kick Mike under the table, inadvertently causes her purse to topple over noisily. The purse's scattered contents spill out haphazardly, and the REMOTE for her vibrating underwear mischievously rolls away, eventually coming to a complete stop UNDER THE TABLE. Nearby, a PRECOCIOUS KID, approximately 8 years old, sits with his parents, his eyes gleaming with curiosity. Suddenly, a small RED LIGHT begins to flicker on. As Harold and Bob continue to share a hearty laugh, Stuart gives Mike a friendly slap on the back. In an unexpected instant, Abby's smile transforms into a look of sheer horror. She shifts uncomfortably in her seat, trying to manage the NOW-VIBRATING sensation which has taken her by surprise. Leaning down cautiously, she attempts to retrieve her fallen purse. Peering intently under the table, she sees the scattered contents. Mike's head appears beside hers, and he starts laughing heartily. Stuart, observing the unfolding situation with concern, watches as Abby emerges from beneath the table, clutching her head and frantically looking around, trying to discern who holds control of the elusive remote. The kid, with mischievous intent, has cruelly increased the speed on the remote even further. Abby's eyes roll back dramatically as she begins to rise from her seat, only to be gently stopped by Stuart. Candi, intrigued by Abby's peculiar display, glances over at Harold. Stuart frowns deeply, his concern evident, as Abby experiences a sudden spasm, then quickly pushes through it with determination. She leaps to her feet with a sense of urgency. As the group makes their way out of the bar, Mike, with some difficulty, manages to grab the remote from the mischievous kid. Abby, noticing this, swiftly snatches the remote from Mike's hand, shooting him a pointed, knowing look. Colin approaches them. On set, Mike addresses the camera with confidence and charisma. NEARBY, a confused Joy looks at Abby with curiosity. Georgia gives him a playful, teasing wink. Abby, puzzled and slightly overwhelmed, looks at the agent. The CAB DRIVER glances at her with mild interest. As Mike exits the lobby, Abby steps out of a cab, suitcase firmly in hand. She glares at him, on the verge of revealing her true feelings, but quickly masks them with a practiced indifference. Abby and Mike find themselves seated together in the backseat. Abby glances down at her notes, poring over them intently, while Mike studies her with quiet admiration. Abby sits there, fuming internally, knowing, despite herself, that he's right. Mike, surprised by her reaction, looks at her with newfound appreciation. The audience erupts in enthusiastic applause as Mike takes a deep, steadying breath and confidently steps onto the stage. Abby now sits among the audience, watching intently as Jay conducts an engaging interview with Mike on stage. Abby engages in a phone conversation, her expression shifting noticeably from surprise to growing suspicion. The waiter arrives promptly, serving mojitos with a flourish. Abby looks at him briefly, then takes a contemplative sip of her mojito, her eyes studying Mike closely and intently."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Abby, with a playful roll of her eyes and a smile, steps inside, leaving Mike behind. As Mike begins to walk away, he pauses momentarily, glancing back before continuing on his path. Meanwhile, Abby, with a dismissive air, turns her gaze away. She then settles onto the couch, her eyes fixed on a box labeled ELECTRIC. Curiosity piqued, she opens the box, allowing a pair of underwear and a REMOTE CONTROL to tumble out. She takes a moment to admire herself in the mirror. Later, as Abby, Mike, and Colin enter the bar, they are greeted by two buxom blonde twins, BAMBI and CANDI, who rush up to Mike, enthusiastically slapping him on the back while eyeing the twins. The group finds a table and sits down. Abby, attempting to kick Mike playfully, inadvertently knocks over her purse, causing its contents to spill out. The REMOTE for her vibrating underwear rolls away, coming to a stop under the table. Nearby, a PRECOCIOUS KID, aged 8, sits with his parents. Suddenly, a small RED LIGHT on the remote turns on. As Harold and Bob share a laugh, Stuart gives Mike a friendly slap on the back. Abby's smile quickly morphs into horror as she feels the vibrations, shifting uncomfortably in her seat in an attempt to regain control. She leans down to retrieve her purse, poking her head under the table to assess the situation. Mike's head appears next to hers, and he starts laughing. Stuart, observing the scene with concern, watches as Abby emerges from under the table, clutching her head and scanning the room frantically to identify who has the remote. The kid, meanwhile, has increased the speed on the remote, causing Abby's eyes to roll back. She begins to rise from her seat, but Stuart stops her. Candi, intrigued by Abby's behavior, glances at Harold. Stuart frowns with concern as Abby experiences a spasm, then quickly pushes through it, leaping to her feet. As the group exits, Mike manages to grab the remote from the kid, but Abby notices and swiftly snatches it from Mike's hand, shooting him a pointed look. Colin approaches as Mike addresses the camera on set. Nearby, Joy looks at Abby with confusion, while Georgia gives him a wink. Abby, puzzled, looks at the agent, and the CAB DRIVER glances at her. As Mike exits the lobby, Abby steps out of a cab, suitcase in hand, and glares at him, momentarily on the verge of revealing her true feelings before quickly masking them. Abby and Mike find themselves sitting in the backseat, where Abby glances down at her notes while Mike studies her intently. Abby sits there, simmering with frustration, acknowledging that Mike is right. Mike, taken aback, looks at her with surprise. The audience erupts in applause as Mike takes a deep breath and strides onto the stage. Abby now sits among the audience, watching as Jay interviews Mike on stage. Abby engages in a phone conversation, her expression shifting from surprise to suspicion. The waiter arrives with mojitos, and Abby looks at him before taking a sip, all the while studying Mike closely."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Abby enters the house with a playful eye roll as Mike momentarily turns back before continuing on his way. Inside, Abby examines a box labeled ELECTRIC, revealing a pair of underwear and a REMOTE CONTROL. She checks her reflection in the mirror. Later, Abby, Mike, and Colin arrive at a bar where they are greeted by the JELLO GIRLS, BAMBI and CANDI, who enthusiastically approach Mike. As they settle at a table, Abby accidentally knocks over her purse, causing the remote for her vibrating underwear to roll under the table. A nearby PRECOCIOUS KID, 8, activates the remote, leading to Abby's discomfort. Amid laughter and concern from the group, Abby attempts to discreetly retrieve her belongings, but the kid increases the remote's speed, intensifying her predicament. Abby, struggling to maintain composure, eventually stands up, and as they leave, Mike retrieves the remote from the kid. Abby quickly takes it from Mike, giving him a pointed look. \n\nOn set, Mike addresses the camera while Abby, confused, interacts with various people, including a CAB DRIVER and an agent. As Mike exits the lobby, Abby arrives with her suitcase, masking her true feelings with a glare. In the backseat of a cab, Abby reviews her notes while Mike observes her, leading to a moment of realization for Abby. The scene shifts to an audience applauding as Mike takes the stage for an interview with Jay, with Abby watching from the audience. Later, Abby is on the phone, her expression shifting from surprise to suspicion as a waiter brings mojitos. She sips her drink, thoughtfully observing Mike."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Abby, who has always been known for her playful yet sarcastic demeanor, rolls her eyes with a smile and goes inside her apartment. As Mike, her colleague at a local television station, is walking away, he turns back for a moment, then keeps walking. Abby looks away haughtily, dismissing his glance. Abby sits on the couch staring at a box of ELECTRIC, a popular brand in electronic novelty items. She opens the box, dumping out a pair of underwear and a REMOTE CONTROL that seems to belong to the same novelty set. Abby checks herself out in the mirror, examining her appearance before heading out for the evening. As Abby, Mike, and Colin walk into ZanziBar, a trendy nightclub known for its lively atmosphere, two buxom blonde twin JELLO GIRLS, BAMBI and CANDI, performers frequently hired for special events, rush up to Mike. They slap him on the back, eyeing the twins with familiarity. The group sits down at the table. Abby tries to kick Mike playfully under the table. As she does, she unwittingly knocks over her purse. The contents spill out, and the REMOTE for her vibrating underwear rolls away, stopping UNDER THE TABLE, right next to where a PRECOCIOUS KID, about 8 years old, sits with his parents enjoying their dinner. A small RED LIGHT on the remote control turns on, signaling activation. As Harold, a regular at the bar known for his hearty laugh, and Bob share a joke, Stuart slaps Mike on the back. Suddenly, Abby's smile quickly changes to horror. She shifts in her seat, trying to control her NOW-VIBRATING undergarments. She leans down to grab her purse. She pokes her head under the table to see that the contents of her purse have spilled out. Mike's head appears next to hers as he assesses the chaos. Mike starts laughing at the unfolding situation. Stuart watches, worried, as Abby rises from underneath the table, clutching her head and looking around frantically, trying to figure out who has the remote. The kid, intrigued by the device, has flicked up the speed on the remote even higher. Abby's eyes roll back in response. She starts to get up when Stuart stops her, concerned for her well-being. Candi looks at Harold, intrigued by Abby's display. As Stuart frowns, concerned for his friend, Abby spasms, then rushes through it as fast as she can. She leaps to her feet with urgency. As they all walk out, Mike, usually unruffled, grabs the remote from the kid with a swift motion. Abby spots this and snatches the remote out of Mike's hand, determined to regain control. She shoots him a look, signaling her disapproval. Colin walks up, amused by the scene. On set, behind the scenes of their latest show, Mike addresses the camera with a practiced ease. NEARBY, a confused Joy, an intern learning the ropes at the station, looks at Abby. Georgia, a fellow production assistant, winks at him, indicating the camaraderie within the group. Abby looks at the agent, confused about the unfolding dynamics. The CAB DRIVER looks at her, waiting for directions. Mike walks out of the lobby, as Abby gets out of a cab, suitcase in hand, preparing for her next assignment. Abby glares at him, about to show her true feelings, but then quickly covers in an attempt to maintain professionalism. Abby and Mike sit in the backseat of the cab as it moves through the city streets. Abby looks down at her notes, reviewing details for their upcoming project. Mike studies her, reflecting on their complex yet productive partnership. Abby sits there, fuming that he's right about something important. Mike looks at her, surprised by her acknowledgment. The audience, a live studio crowd, applauds as Mike takes a deep breath and heads on stage for his segment. Abby now sits in the audience, watching as Jay, a well-known talk show host famous for his engaging interviews, converses with Mike on stage. Abby talks on the phone, coordinating logistics and schedules. Abby's surprised, then suspicious, reacting to unexpected news. The waiter arrives with mojitos, a refreshing cocktail popular at the bar. Abby looks at him, acknowledging the service. Abby sips her mojito, studying Mike and pondering their ongoing work relationship."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Abby rolls her eyes with a smile and goes inside  As Mike is walking away he turns back for a moment then keeps walking  Abby looks away haughtily  Abby sits on the couch staring at a box of ELECTRIC  She opens the box dumping out a pair of underwear and a REMOTE  CONTROL  Abby checks herself out in the mirror  She pokes her head under the table to see that the contents of her purse have spilled  Mike's head appears next to hers  Mike starts laughing  Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote  The kid has flicked up the speed on the remote even higher  Abby's eyes roll back  She starts to get up when Stuart stops her  Candi looks at Harold intrigued by Abby's display  As Stuart frowns concerned Abby spasms then rushes through it as fast as she can  She leaps to her feet  As they all walk out Mike grabs the remote from the kid  Abby spots this and snatches the remote out of Mike's hand  She shoots him a look  Colin walks up  On set Mike addresses the camera  NEARBY a confused Joy looks at Abby  Georgia winks at him  Abby looks at the agent confused  The CAB DRIVER looks at her  Mike walks out of the lobby as Abby gets out of a cab suitcase in hand  Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat  Abby looks down at her notes  Mike studies her  Abby sits there fuming that he's right  Mike looks at her surprised  The audience applauds as Mike takes a deep breath and heads on stage  Abby now sits in the audience watching as Jay interviews Mike on stage  As Abby Mike and Colin walk into the bar  two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike  They slap him on the back eyeing the twins  The group sits down at the table  Abby tries to kick Mike  As she does she unwittingly knocks over her purse  The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE  A PRECOCIOUS KID 8 sits with his parents  A small RED LIGHT turns on  As Harold and Bob laugh Stuart slaps Mike on the back  Suddenly her smile quickly changes to horror  She shifts in her seat trying to control her NOWVIBRATING  She leans down to grab her purse  She pokes her head under the table to see that the contents of her purse have spilled  Mike's head appears next to hers  Mike starts laughing  Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote  The kid has flicked up the speed on the remote even higher  Abby's eyes roll back  She starts to get up when Stuart stops her  Candi looks at Harold intrigued by Abby's display  As Stuart frowns concerned Abby spasms then rushes through it as fast as she can  She leaps to her feet  As they all walk out Mike grabs the remote from the kid  Abby spots this and snatches the remote out of Mike's hand  She shoots him a look  Colin walks up  On set Mike addresses the camera  NEARBY a confused Joy looks at Abby  Georgia winks at him  Abby looks at the agent confused  The CAB DRIVER looks at her  Mike walks out of the lobby as Abby gets out of a cab suitcase in hand  Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat  Abby looks down at her notes  Mike studies her  Abby sits there fuming that he's right  Mike looks at her surprised  The audience applauds as Mike takes a deep breath and heads on stage  Abby now sits in the audience watching as Jay interviews Mike on stage  Abby talks on the phone  Abby's surprised then suspicious  The waiter arrives with mojitos  Abby looks at him  Abby sips her mojito studying  Mike"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away he turns back for a moment then keeps walking. Abby looks away haughtily. Abby sits on the couch staring at a box of ELECTRIC. She opens the box dumping out a pair of underwear and a REMOTE. CONTROL. Abby checks herself out in the mirror. As Abby Mike and Colin walk into the bar. two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike. They slap him on the back eyeing the twins. The group sits down at the table. Abby tries to kick Mike. As she does she unwittingly knocks over her purse. The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE. A PRECOCIOUS KID 8 sits with his parents. A small RED LIGHT turns on. As Harold and Bob laugh Stuart slaps Mike on the back. Suddenly her smile quickly changes to horror. She shifts in her seat trying to control her NOWVIBRATING. She leans down to grab her purse. She pokes her head under the table to see that the contents of her purse have spilled. Mike's head appears next to hers. Mike starts laughing. Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote. The kid has flicked up the speed on the remote even higher. Abby's eyes roll back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. She starts to get up when Stuart stops her. Candi looks at Harold intrigued by Abby's display. As Stuart frowns concerned Abby spasms then rushes through it as fast as she can. She leaps to her feet. As they all walk out Mike grabs the remote from the kid. Abby spots this and snatches the remote out of Mike's hand. She shoots him a look. Colin walks up. On set Mike addresses the camera. NEARBY a confused Joy looks at Abby. Georgia winks at him. Abby looks at the agent confused. The CAB DRIVER looks at her. Mike walks out of the lobby as Abby gets out of a cab suitcase in hand. Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat. Abby looks down at her notes. Mike studies her. Abby sits there fuming that he is right. Mike looks at her surprised. The audience applauds as Mike takes a deep breath and heads on stage. Abby now sits in the audience watching as Jay interviews Mike on stage. Abby talks on the phone. Abby's surprised then suspicious. The waiter arrives with mojitos. Abby looks at him. Abby sips her mojito studying. Mike."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away he turns back for a moment then keeps walking. Abby looks away haughtily. Abby sits on the couch staring at a box of ELECTRIC. She opens the box dumping out a pair of underwear and a REMOTE. CONTROL. Abby checks herself out in the mirror. As Abby Mike and Colin walk into the bar. two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike. They slap him on the back eyeing the twins. The group sits down at the table. Abby tries to kick Mike. As she does she unwittingly knocks over her purse. The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE. A PRECOCIOUS KID 8 sits with his parents. A small RED LIGHT turns on. As Harold and Bob laugh Stuart slaps Mike on the back. Suddenly her smile quickly changes to horror. She shifts in her seat trying to control her NOWVIBRATING. She leans down to grab her purse. She pokes her head under the table to see that the contents of her purse have spilled. Mike's head appears next to hers. Mike starts laughing. Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote. The kid has flicked up the speed on the remote even higher. Abby's eyes roll back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. She starts to get up when Stuart stops her. Candi looks at Harold intrigued by Abby's display. As Stuart frowns concerned Abby spasms then rushes through it as fast as she can. She leaps to her feet. As they all walk out Mike grabs the remote from the kid. Abby spots this and snatches the remote out of Mike's hand. She shoots him a look. Colin walks up. On set Mike addresses the camera. NEARBY a confused Joy looks at Abby. Georgia winks at him. Abby looks at the agent confused. The CAB DRIVER looks at her. Mike walks out of the lobby as Abby gets out of a cab suitcase in hand. Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat. Abby looks down at her notes. Mike studies her. Abby sits there fuming that he is right. Mike looks at her surprised. The audience applauds as Mike takes a deep breath and heads on stage. Abby now sits in the audience watching as Jay interviews Mike on stage. Abby talks on the phone. Abby's surprised then suspicious. The waiter arrives with mojitos. Abby looks at him. Abby sips her mojito studying. Mike."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away he turns back for a moment then keeps walking. Abby looks away haughtily. Abby sits on the couch staring at a box of ELECTRIC. She opens the box dumping out a pair of underwear and a REMOTE. CONTROL. Abby checks herself out in the mirror. As Abby Mike and Colin walk into the bar. two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike. They slap him on the back eyeing the twins. The group sits down at the table. Abby tries to kick Mike. As she does she unwittingly knocks over her purse. Mike walks out of the lobby as Abby gets out of a cab suitcase in hand. Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat. Abby looks down at her notes. Mike studies her. Abby sits there fuming that he is right. Mike looks at her surprised. The audience applauds as Mike takes a deep breath and heads on stage. Abby now sits in the audience watching as Jay interviews Mike on stage. Abby talks on the phone. Abby's surprised then suspicious. The waiter arrives with mojitos. Abby looks at him. Abby sips her mojito studying. Mike."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away he turns back for a moment then keeps walking. Abby looks away haughtily. Abby sits on the couch staring at a box of ELECTRIC. She opens the box dumping out a pair of underwear and a REMOTE. Abby talks on the phone. Abby's surprised then suspicious. The waiter arrives with mojitos. Abby looks at him. Abby sips her mojito studying. Mike."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat rolls her eyes with a smile and goes inside. As the dog is walking away, the dog turns back for a moment, then keeps walking. The cat looks away haughtily. The cat sits on the couch staring at a box of ELECTRIC. She opens the box, dumping out a pair of underwear and a REMOTE CONTROL. The cat checks herself out in the mirror. As the cat, the rabbit, and the fox walk into the bar, two buxom blonde twin JELLO GIRLS, BAMBI and CANDI, rush up to the dog. They slap him on the back, eyeing the twins. The group sits down at the table. The cat tries to kick the dog. As she does, she unwittingly knocks over her purse. The contents spill out, and the REMOTE for her vibrating underwear rolls away, stopping UNDER THE TABLE. A PRECOCIOUS KID, 8, sits with his parents. A small RED LIGHT turns on. As the giraffe and the zebra laugh, the elephant slaps the dog on the back. Suddenly, her smile quickly changes to horror. She shifts in her seat, trying to control her NOW-VIBRATING. She leans down to grab her purse. She pokes her head under the table to see that the contents of her purse have spilled. The dog's head appears next to hers. The dog starts laughing. The elephant watches, worried, as the cat rises from underneath the table, clutching her head and looking around frantically, trying to figure out who has the remote. The kid has flicked up the speed on the remote even higher. The cat's eyes roll back. She starts to get up when the elephant stops her. Candi looks at the giraffe, intrigued by the cat's display. As the elephant frowns, concerned, the cat spasms, then rushes through it as fast as she can. She leaps to her feet. As they all walk out, the dog grabs the remote from the kid. The cat spots this and snatches the remote out of the dog's hand. She shoots him a look. The fox walks up. On set, the dog addresses the camera. NEARBY, a confused owl looks at the cat. The squirrel winks at him. The cat looks at the agent, confused. The CAB DRIVER looks at her. The dog walks out of the lobby, as the cat gets out of a cab, suitcase in hand. The cat glares at him, about to show her true feelings, but then quickly covers. The cat and the dog sit in the backseat. The cat looks down at her notes. The dog studies her. The cat sits there, fuming that he's right. The dog looks at her, surprised. The audience applauds as the dog takes a deep breath and heads on stage. The cat now sits in the audience, watching as the parrot interviews the dog on stage. The cat talks on the phone. The cat's surprised, then suspicious. The waiter arrives with mojitos. The cat looks at him. The cat sips her mojito, studying the dog."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Abby rolls her eyes with a smile and goes inside. As Mike is walking away, he turns back for a moment, then keeps walking. Abby looks away haughtily. Abby sits on the armchair staring at a box of SPARKLES. She opens the box, dumping out a pair of socks and a GAME CONTROLLER. Abby checks herself out in the window. As Abby, Mike, and Colin walk into the cafe, two buxom blonde twin GUM GIRLS, LISA and TRACY, rush up to Mike. They slap him on the shoulder, eyeing the twins. The group sits down at the booth. Abby tries to kick Mike. As she does, she unwittingly knocks over her backpack. The contents spill out, and the CONTROLLER for her vibrating socks rolls away, stopping UNDER THE CHAIR. A CURIOUS TODDLER, 3, sits with his parents. A small GREEN LIGHT turns on. As Harold and Bob laugh, Stuart slaps Mike on the shoulder. Suddenly, her smile quickly changes to horror. She shifts in her seat, trying to control her NOW-VIBRATING. She leans down to grab her backpack. She pokes her head under the chair to see that the contents of her backpack have spilled. Mike's head appears next to hers. Mike starts laughing. Stuart watches, worried, as Abby rises from underneath the chair, clutching her head and looking around frantically, trying to figure out who has the controller. The toddler has flicked up the speed on the controller even higher. Abby's eyes roll back. She starts to get up when Stuart stops her. Tracy looks at Harold, intrigued by Abby's display. As Stuart frowns, concerned, Abby spasms, then rushes through it as fast as she can. She leaps to her feet. As they all walk out, Mike grabs the controller from the toddler. Abby spots this and snatches the controller out of Mike's hand. She shoots him a look. Colin walks up. On set, Mike addresses the camera. NEARBY, a confused Lila looks at Abby. Georgia winks at him. Abby looks at the officer, confused. The BUS DRIVER looks at her. Mike walks out of the lobby, as Abby gets out of a rickshaw, backpack in hand. Abby glares at him, about to show her true feelings, but then quickly covers. Abby and Mike sit in the backseat. Abby looks down at her list. Mike studies her. Abby sits there, fuming that he's right. Mike looks at her, surprised. The audience applauds as Mike takes a deep breath and heads on stage. Abby now sits in the audience, watching as Ray interviews Mike on stage. Abby talks on the TV. Abby's surprised, then suspicious. The chef arrives with milkshakes. Abby looks at him. Abby sips her milkshake, studying Mike."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Abby chuckles to herself and heads inside. As Mike is strolling away, he glances back briefly, then continues strolling. Abby averts her gaze indifferently. Abby lounges on the couch, examining a box of ELECTRIC. She closes the box, tossing aside a pair of underwear and a REMOTE CONTROL. Abby admires herself in the mirror. As Abby, Mike, and Colin enter the bar, two buxom blonde twin JELLO GIRLS, BAMBI and CANDI, approach Mike. They pat him on the back, glancing at the twins. The group settles at the table. Abby attempts to pinch Mike. As she does, she unintentionally tips over her purse. The contents scatter, and the REMOTE for her vibrating underwear rolls away, pausing UNDER THE TABLE. A PRECOCIOUS KID, 8, sits with his parents. A small RED LIGHT flashes on. As Harold and Bob chuckle, Stuart pats Mike on the back. Suddenly, her expression shifts rapidly to panic. She squirms in her seat, attempting to maneuver her NOW-VIBRATING. She bends down to retrieve her purse. She peeks under the table to observe that the contents of her purse have scattered. Mike's head appears beside hers. Mike begins chuckling. Stuart observes, anxious, as Abby rises from beneath the table, clutching her head and scanning the area urgently, trying to identify who has the remote. The kid has increased the speed on the remote even further. Abby's eyes roll back. She begins to stand up when Stuart halts her. Candi glances at Harold, intrigued by Abby's behavior. As Stuart furrows his brow, uneasy, Abby convulses, then pushes through it as swiftly as possible. She bounds to her feet. As they all exit, Mike retrieves the remote from the kid. Abby notices this and grabs the remote out of Mike's hand. She gives him a look. Colin approaches. On set, Mike speaks to the camera. NEARBY, a perplexed Joy gazes at Abby. Georgia winks at him. Abby regards the agent, baffled. The CAB DRIVER stares at her. Mike departs the lobby, as Abby steps out of a cab, suitcase in hand. Abby scowls at him, about to reveal her true emotions, but then quickly conceals them. Abby and Mike sit in the backseat. Abby glances at her notes. Mike observes her. Abby sits there, infuriated that he's correct. Mike looks at her, astonished. The audience cheers as Mike exhales deeply and steps onto the stage. Abby now sits in the audience, watching as Jay converses with Mike on stage. Abby chats on the phone. Abby's startled, then skeptical. The waiter appears with mojitos. Abby glances at him. Abby sips her mojito, analyzing Mike."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Clara nods with a frown and goes outside. As Jonah is jogging nearby, he turns forward for a second, then keeps jogging. Clara looks forward thoughtfully. Clara sits on the chair staring at a pile of NOVELS. She opens the pile, dumping out a pair of gloves and a CALCULATOR. Clara checks herself out in the window. As Clara, Jonah, and Derek walk into the café, two skinny redheaded twin COOKING PANS, DIXIE and PIXIE, rush up to Jonah. They pat him on the shoulder, eyeing the cooking pans. The crowd sits down at the booth. Clara tries to nudge Jonah. As she does, she inadvertently knocks over her backpack. The items spill out, and the CALCULATOR for her vibrating gloves rolls away, stopping BY THE COUNTER. A GRUMPY TEEN, 15, sits with his siblings. A small BLUE BUTTON lights up. As Simon and Jake laugh, Oliver pats Jonah on the shoulder. Suddenly, her expression quickly changes to panic. She shifts in her seat, trying to control her NOW-BUZZING. She leans forward to grab her backpack. She pokes her head by the counter to see that the items of her backpack have spilled. Jonah's head appears next to hers. Jonah starts giggling. Oliver watches, worried, as Clara rises from underneath the counter, clutching her neck and looking around frantically, trying to figure out who has the calculator. The teen has pushed up the volume on the calculator even higher. Clara's eyes roll back. She starts to get up when Oliver stops her. Pixie looks at Simon, intrigued by Clara's reaction. As Oliver frowns, uneasy, Clara trembles, then rushes through it as fast as she can. She leaps to her feet. As they all stroll out, Jonah grabs the calculator from the teen. Clara spots this and snatches the calculator out of Jonah's grip. She shoots him a glance. Derek walks toward. On screen, Jonah addresses the lens. NEARBY, a puzzled Amy looks at Clara. Samantha winks at him. Clara looks at the representative, puzzled. The PILOT looks at her. Jonah walks out of the corridor, as Clara gets out of a bus, backpack in hand. Clara glares at him, about to reveal her true intentions, but then quickly conceals. Clara and Jonah sit in the front seat. Clara looks up at her slides. Jonah examines her. Clara sits there, fuming that he's correct. Jonah looks at her, amazed. The audience cheers as Jonah takes a deep breath and moves on stage. Clara now sits in the audience, watching as Rick interviews Jonah on stage. Clara chats on the radio. Clara's amazed, then skeptical. The bartender arrives with cappuccinos. Clara looks at him. Clara sips her cappuccino, examining Jonah."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Clara shrugs her shoulders with a grin and enters inside. As James is skipping away, he glances back for a moment, then continues skipping. Clara averts her gaze smugly. Clara lounges on the chair gazing at a stack of ELECTRIC. She empties the stack, releasing a pair of socks and a REMOTE CONTROL. Clara inspects her reflection in the mirror. As Clara, James, and Chris wander into the bar, two buxom blonde twin JELLO GIRLS, BUNNY and CINDY, dash up to James. They pat him on the back, eyeing the twins. The group settles down at the table. Clara attempts to nudge James. As she does, she inadvertently upends her bag. The contents tumble out, and the REMOTE for her vibrating socks rolls away, halting UNDER THE TABLE. A PRECOCIOUS KID, 8, sits with his family. A small RED LIGHT flickers on. As Gerald and Tom chuckle, Frank pats James on the back. Abruptly, her grin swiftly morphs into terror. She wriggles in her seat, attempting to manage her NOW-VIBRATING. She bends down to retrieve her bag. She peeks her head under the table to see that the contents of her bag have tumbled. James's head surfaces next to hers. James bursts into laughter. Frank observes, uneasy, as Clara emerges from underneath the table, holding her head and glancing around frantically, trying to determine who has the remote. The kid has cranked up the speed on the remote even higher. Clara's eyes glaze over. She begins to rise when Frank halts her. Cindy gazes at Gerald, fascinated by Clara's performance. As Frank scowls, worried, Clara convulses, then dashes through it as swiftly as she can. She bounds to her feet. As they all exit, James seizes the remote from the kid. Clara notices this and snatches the remote from James's hand. She gives him a look. Chris approaches. On set, James talks to the camera. NEARBY, a puzzled Joy glances at Clara. Georgia gives him a wink. Clara glances at the representative, bewildered. The CAB DRIVER glances at her. James exits the lobby, as Clara disembarks from a cab, suitcase in hand. Clara scowls at him, on the verge of revealing her true emotions, but then swiftly conceals them. Clara and James recline in the backseat. Clara glances down at her papers. James examines her. Clara sits there, frustrated that he's correct. James glances at her, taken aback. The crowd cheers as James takes a deep breath and strides on stage. Clara now sits among the audience, observing as Jay talks with James on stage. Clara chats on the phone. Clara's startled, then distrustful. The server arrives with mojitos. Clara glances at him. Clara sips her mojito, observing James."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Abby twirls her hair with a smirk and steps outside. As Mike is climbing up, he glances back for a second, then continues climbing. Abby gazes away dismissively. Abby perches on the bench glaring at a bag of PASTA. She unwraps the bag, spilling out a pair of socks and a TOY CAR. Abby examines herself in the window. As Abby, Mike, and Colin jump into the zoo, two skinny brunette twin COTTON CANDY VENDORS, BAMBI and CANDI, dash up to Mike. They push him on the shoulder, observing the twins. The group perches around a couch. Abby attempts to tap Mike. As she does, she inadvertently tips over her mug. The contents cascade out, and the RATTLE for her buzzing socks rolls away, halting UNDER THE COUCH. A PRECOCIOUS CAT, 8, sits with its owners. A small GREEN BUTTON lights up. As Harold and Bob snicker, Stuart pats Mike on the arm. Suddenly, her grin swiftly turns to shock. She wriggles in her spot, attempting to control her NOW-JIGGLING. She crouches down to retrieve her mug. She peeks her head under the couch to see that the contents of her mug have scattered. Mike's head appears beside hers. Mike starts chuckling. Stuart observes, anxious, as Abby emerges from under the couch, holding her head and looking around wildly, trying to identify who has the rattle. The cat has nudged up the intensity on the rattle even further. Abby's eyes flutter back. She starts to stand when Stuart halts her. Candi glances at Harold, intrigued by Abby's performance. As Stuart pouts, uneasy, Abby jolts, then pushes through it as fast as she can. She springs to her feet. As they all leap out, Mike retrieves the rattle from the cat. Abby notices this and snatches the rattle out of Mike's grasp. She glares at him. Colin strolls up. On site, Mike addresses the microphone. NEARBY, a baffled Joy stares at Abby. Georgia nods at him. Abby gazes at the musician, puzzled. The BAKER looks at her. Mike struts out of the restaurant, as Abby steps out of a bus, backpack in hand. Abby scowls at him, about to reveal her true emotions, but then quickly masks. Abby and Mike sit in the front seat. Abby glances down at her cards. Mike examines her. Abby sits there, irritated that he's correct. Mike glances at her, astonished. The audience giggles as Mike takes a sigh and dances on stage. Abby now sits in the audience, observing as Jay narrates Mike on stage. Abby whispers on the phone. Abby's amazed, then doubtful. The chef arrives with lemonades. Abby glances at him. Abby sips her lemonade, examining Mike."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Daisy flutters her hands with a giggle and heads outside. As Sam is skipping away, he glances forward for a second, then continues skipping. Daisy glances down bashfully. Daisy reclines on the floor gazing at a crate of SPARKLE. She shuts the crate, dumping out a pair of socks and a COMIC BOOK. Daisy checks herself out in the window. As Daisy, Sam, and Louis hop into the cafe, two lanky brunette twin COOKIE BOYS, CHIP and SCOUT, skitter up to Sam. They nudge him on the arm, eyeing the twins. The crowd leans in against the counter. Daisy tries to nudge Sam. As she does, she unknowingly topples over her backpack. The belongings pour out, and the COMIC BOOK for her humming socks rolls away, stopping ON THE COUNTER. A TIMID CAT, 8, lounges with his siblings. A tiny GREEN BUTTON blinks on. As Fred and Bill snicker, Trevor nudges Sam on the arm. Suddenly, her giggle swiftly shifts to panic. She bounces in her position, attempting to manage her NOW-HUMMING. She crouches down to grab her backpack. She pokes her nose on the counter to see that the belongings of her backpack have toppled. Sam's nose appears next to hers. Sam begins chuckling. Trevor watches, anxious, as Daisy rises from beneath the counter, clutching her nose and looking around nervously, trying to figure out who has the comic book. The cat has cranked up the volume on the comic book even more. Daisy's hands flap around. She begins to stand when Trevor halts her. Scout glances at Fred, captivated by Daisy's exhibition. As Trevor grimaces, uneasy, Daisy convulses, then dashes through it as fast as she can. She springs to her toes. As they all hop out, Sam snatches the comic book from the cat. Daisy notices this and yanks the comic book out of Sam's fingers. She shoots him a glare. Louis hops up. On set, Sam addresses the potted plant. NEARBY, a bewildered Jill gazes at Daisy. Taylor nods at him. Daisy gazes at the producer, puzzled. The MECHANIC glances at her. Sam hops out of the hallway, as Daisy hops out of a van, backpack in hand. Daisy scowls at him, about to reveal her true thoughts, but then quickly hides. Daisy and Sam sit in the trunk. Daisy gazes up at her calendar. Sam examines her. Daisy sits there, brooding that he's wrong. Sam gazes at her, startled. The guests cheer as Sam takes a shallow breath and steps off platform. Daisy now sits with the guests, observing as Lee questions Sam off platform. Daisy chats on the horn. Daisy's startled, then wary. The chef arrives with iced teas. Daisy gazes at him. Daisy sips her iced tea, examining Sam."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Abby enters with a smile while Mike walks away. She soon finds herself at a bar with Mike and Colin when twin JELLO GIRLS, Bambi and Candi, approach Mike. Abby accidentally spills her purse, and the remote for her vibrating underwear falls under the table. A precocious kid plays with the remote, activating the underwear. Abby panics and tries to retrieve the remote, with Mike observing and laughing. As the situation worsens, Abby confronts Mike, snatching the remote from him. Later, Abby and Mike share a cab ride, where Abby hides her true feelings. Mike surprises the audience on stage, with Abby in attendance, and she scrutinizes him throughout."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Mike Abby sips her mojito studying  Abby looks at him  The waiter arrives with mojitos  Abby's surprised then suspicious  Abby talks on the phone  Abby now sits in the audience watching as Jay interviews Mike on stage  The audience applauds as Mike takes a deep breath and heads on stage  Mike looks at her surprised  Abby sits there fuming that he's right  Mike studies her  Abby looks down at her notes  Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat  Mike walks out of the lobby as Abby gets out of a cab suitcase in hand  The CAB DRIVER looks at her  Abby looks at the agent confused  Georgia winks at him  NEARBY a confused Joy looks at Abby  On set Mike addresses the camera  Colin walks up  She shoots him a look  Abby spots this and snatches the remote out of Mike's hand  As they all walk out Mike grabs the remote from the kid  She leaps to her feet  As Stuart frowns concerned Abby spasms then rushes through it as fast as she can  Candi looks at Harold intrigued by Abby's display  She starts to get up when Stuart stops her  Abby's eyes roll back  The kid has flicked up the speed on the remote even higher  Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote  Mike starts laughing  Mike's head appears next to hers  She pokes her head under the table to see that the contents of her purse have spilled  She leans down to grab her purse  She shifts in her seat trying to control her NOWVIBRATING  Suddenly her smile quickly changes to horror  As Harold and Bob laugh Stuart slaps Mike on the back  A small RED LIGHT turns on  A PRECOCIOUS KID 8 sits with his parents  The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE  As she does she unwittingly knocks over her purse  Abby tries to kick Mike  The group sits down at the table  They slap him on the back eyeing the twins  two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike  As Abby Mike and Colin walk into the bar  Abby checks herself out in the mirror  CONTROL  She opens the box dumping out a pair of underwear and a REMOTE  Abby sits on the couch staring at a box of ELECTRIC  Abby looks away haughtily  As Mike is walking away he turns back for a moment then keeps walking  Abby rolls her eyes with a smile and goes inside "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Harold and Bob laugh Stuart slaps Mike on the back  They slap him on the back eyeing the twins  As Mike is walking away he turns back for a moment then keeps walking  Abby's surprised then suspicious  Abby spots this and snatches the remote out of Mike's hand  A small RED LIGHT turns on  On set Mike addresses the camera  The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE  Abby rolls her eyes with a smile and goes inside  She starts to get up when Stuart stops her  Abby sits on the couch staring at a box of ELECTRIC  Candi looks at Harold intrigued by Abby's display  As they all walk out Mike grabs the remote from the kid  She shoots him a look  Abby sits there fuming that he's right  Mike looks at her surprised  The CAB DRIVER looks at her  Abby's eyes roll back  As Abby Mike and Colin walk into the bar  Abby looks at him  Abby talks on the phone  The audience applauds as Mike takes a deep breath and heads on stage  She leans down to grab her purse  Mike studies her  She pokes her head under the table to see that the contents of her purse have spilled  As Stuart frowns concerned Abby spasms then rushes through it as fast as she can  Mike starts laughing  two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike  Mike's head appears next to hers  Abby looks at the agent confused  Abby tries to kick Mike  Colin walks up  The group sits down at the table  Abby now sits in the audience watching as Jay interviews Mike on stage  She leaps to her feet  Suddenly her smile quickly changes to horror  Mike Abby checks herself out in the mirror  Abby looks down at her notes  Abby sips her mojito studying  The waiter arrives with mojitos  A PRECOCIOUS KID 8 sits with his parents  Abby looks away haughtily  She opens the box dumping out a pair of underwear and a REMOTE  As she does she unwittingly knocks over her purse  Georgia winks at him  Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote  Mike walks out of the lobby as Abby gets out of a cab suitcase in hand  Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat  She shifts in her seat trying to control her NOWVIBRATING  NEARBY a confused Joy looks at Abby  CONTROL  The kid has flicked up the speed on the remote even higher "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Candi looks at Harold intrigued by Abby's display  As Stuart frowns concerned Abby spasms then rushes through it as fast as she can  She leaps to her feet  As they all walk out Mike grabs the remote from the kid  Abby spots this and snatches the remote out of Mike's hand  She shoots him a look  Colin walks up  On set Mike addresses the camera  NEARBY a confused Joy looks at Abby  Georgia winks at him  Abby looks at the agent confused  The CAB DRIVER looks at her  Mike walks out of the lobby as Abby gets out of a cab suitcase in hand  Abby glares at him about to show her true feelings but then quickly covers Abby and Mike sit in the backseat  Abby looks down at her notes  Mike studies her  Abby sits there fuming that he's right  Mike looks at her surprised  The audience applauds as Mike takes a deep breath and heads on stage  Abby now sits in the audience watching as Jay interviews Mike on stage  Abby talks on the phone  Abby's surprised then suspicious  The waiter arrives with mojitos  Abby looks at him  Abby sips her mojito studying  Mike Abby rolls her eyes with a smile and goes inside  As Mike is walking away he turns back for a moment then keeps walking  Abby looks away haughtily  Abby sits on the couch staring at a box of ELECTRIC  She opens the box dumping out a pair of underwear and a REMOTE  CONTROL  Abby checks herself out in the mirror  As Abby Mike and Colin walk into the bar  two buxom blonde twin JELLO GIRLS BAMBI and CANDI rush up to Mike  They slap him on the back eyeing the twins  The group sits down at the table  Abby tries to kick Mike  As she does she unwittingly knocks over her purse  The contents spill out and the REMOTE for her vibrating underwear rolls away stopping UNDER THE TABLE  A PRECOCIOUS KID 8 sits with his parents  A small RED LIGHT turns on  As Harold and Bob laugh Stuart slaps Mike on the back  Suddenly her smile quickly changes to horror  She shifts in her seat trying to control her NOWVIBRATING  She leans down to grab her purse  She pokes her head under the table to see that the contents of her purse have spilled  Mike's head appears next to hers  Mike starts laughing  Stuart watches worried as Abby rises from underneath the table clutching her head and looking around frantically trying to figure out who has the remote  The kid has flicked up the speed on the remote even higher  Abby's eyes roll back  She starts to get up when Stuart stops her "
        }
      ]
    }
  ]
}