{
  "ground_truth": "Oliver gets up, and Charlotte, Sadie, and Desi run off, followed by Oliver. Desi gracefully swims underwater, looking gorgeous, and she sees Jason and Ronnie underwater, appearing grotesque, red-faced, and awkward. As they reach for each other and surface, Desi swims away. Larry talks to Oliver, who smiles, amused, while Jason and Ronnie are talking to Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are eating as Ronnie, Jason, and Desi talk. Oliver gets up to leave, walks out, and the party becomes tense. Debbie notices that Oliver never actually left; he stands at the back, looking uncomfortable and quietly singing, which shocks Debbie. She smokes a cigarette at the side of the house when Sadie appears, and Debbie, caught, turns and walks towards the house, with Sadie following. Sadie storms through the front door after Debbie, who continues down the hall, still followed by Sadie. Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge. Debbie storms off towards the foyer, where Larry stops her, and Claire and the triplets are right behind him. Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete walks away, stunning Debbie, who follows him out to the front porch, closing the door behind them and looking at him for a moment. Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer. From the side of the house, Pete is seen riding his bike in his street clothes and helmet, exiting home, very angry and riding with great emotion to release frustration. Pete rides his bike onto San Vicente Boulevard and down the street; a car passes, and a teenager yells to scare him, causing Pete to almost fall. Debbie and Barb clean up and see Oliver picking up glasses, Sadie walking in with Joseph. Sadie walks off, followed by Joseph. The traffic clogs up and a car honks, almost causing Pete to ride into it as it makes a right turn; he pulls up alongside Jason's van, where Desi is riding with Jason, and they speed off. Oliver plays with the kids and an iPhone, Debbie walks outside, and exits.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Oliver rises, and Charlotte, Sadie, and Desi dash off, trailed by Oliver. Desi elegantly dives underwater, appearing stunning, and she spots Jason and Ronnie submerged, seeming hideous, flushed, and clumsy. As they grasp for one another and emerge, Desi glides away. Larry chats with Oliver, who grins, entertained, while Jason and Ronnie converse with Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are dining as Ronnie, Jason, and Desi converse. Oliver rises to depart, strolls out, and the gathering turns uneasy. Debbie observes that Oliver never actually departed; he stands at the rear, appearing uneasy and softly crooning, which startles Debbie. She puffs a cigarette at the side of the house when Sadie materializes, and Debbie, caught, pivots and strides toward the house, with Sadie trailing. Sadie charges through the front door after Debbie, who proceeds down the corridor, still trailed by Sadie. Barb is in the kitchen with Pete and Charlotte as Debbie rounds the corner and discovers Pete stress-eating before the fridge. Debbie storms off toward the entrance, where Larry halts her, and Claire and the triplets are right behind him. Pete hurls his cupcake against the wall as Larry and Claire stroll away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete strides away, startling Debbie, who follows him out to the front porch, sealing the door behind them and gazing at him for a moment. Larry opens the door and peers out to disclose everyone at the gathering except Pete still in the entrance. From the side of the house, Pete is observed riding his bicycle in his street attire and helmet, departing home, very furious and riding with great emotion to vent frustration. Pete pedals his bicycle onto San Vicente Boulevard and along the street; a vehicle passes, and an adolescent shouts to alarm him, causing Pete to nearly topple. Debbie and Barb tidy up and see Oliver gathering glasses, Sadie strolling in with Joseph. Sadie saunters off, trailed by Joseph. The traffic jams up and a vehicle honks, almost causing Pete to ride into it as it makes a right turn; he pulls up beside Jason's van, where Desi is riding with Jason, and they zoom off. Oliver plays with the children and an iPhone, Debbie strolls outside, and departs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Oliver gets up, and Charlotte, Sadie, and Desi run off, and Oliver follows them. Desi gracefully swims underwater, looking gorgeous, and Jason and Ronnie are seen by her underwater, appearing grotesque, red-faced, and awkward. As they reach for each other and surface, Desi swims away. Oliver is talked to by Larry, who is smiled at by Oliver, amused, while Desi is talked to by Jason and Ronnie. Debbie, Pete, Larry, Oliver, Barb, and Barry are eating as Ronnie, Jason, and Desi talk. Oliver gets up to leave, walks out, and the party's atmosphere is made tense. Debbie notices that Oliver never actually left; he stands at the back, looking uncomfortable and quietly singing, which shocks Debbie. A cigarette is smoked by her at the side of the house when Sadie appears, and Debbie, caught, turns and walks towards the house and is followed by Sadie. The front door is stormed through by Sadie after Debbie, who continues down the hall and is still followed by Sadie. Pete and Charlotte are found in the kitchen with Barb as Debbie turns the corner and finds Pete stress eating in front of the fridge. Debbie storms off towards the foyer, where she is stopped by Larry, and Claire and the triplets are right behind him. His cupcake is thrown against the wall by Pete as Larry and Claire walk away and Pete storms in. As Pete walks away, Oliver turns to Debbie after passing Pete, stunning her, who follows him out to the front porch, closes the door behind them, and looks at him for a moment. The door is opened by Larry, who peeks out to reveal everyone at the party except Pete still in the foyer. From the side of the house, Pete is seen riding his bike in his street clothes and helmet, exiting home, very angry and riding with great emotion to release frustration. Pete rides his bike onto San Vicente Boulevard and down the street; a car passes, and to scare him, a teenager yells, causing Pete to almost fall. Debbie and Barb clean up and see glasses being picked up by Oliver, and Joseph walks in with Sadie. Sadie walks off, and Joseph follows her. The traffic clogs up and a car honks, almost causing Pete to ride into it as it makes a right turn; he pulls up alongside Jason's van, where Desi is riding with Jason, and they speed off. The kids and an iPhone are played with by Oliver, and Debbie walks outside and exits."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Oliver gets up, and Charlotte, Sadie, and Desi run off, with Oliver following. Desi swims underwater, spotting Jason and Ronnie, who look awkward and red-faced. They reach for each other and surface as Desi swims away. Larry talks to Oliver, who smiles, while Jason and Ronnie converse with Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are eating as Ronnie, Jason, and Desi talk. Oliver gets up to leave, causing tension, but Debbie notices he stands at the back, uncomfortable and singing, surprising her. Outside, Debbie smokes a cigarette when Sadie appears, prompting Debbie to head inside with Sadie following. Sadie storms through the door after Debbie, who finds Pete stress eating at the fridge. Larry stops Debbie in the foyer with Claire and the triplets. Pete throws a cupcake and storms off. Oliver approaches Debbie as Pete leaves, startling her, and she follows him to the porch. Larry peeks out to show everyone except Pete still inside. Pete is outside, riding his bike angrily to vent frustration, almost colliding with a car after a teenager scares him. Debbie and Barb clean up, watching Oliver pick up glasses as Sadie and Joseph enter. Sadie walks off with Joseph. Traffic clogs, and Pete nearly rides into a car turning; he pulls alongside Jason's van with Desi, speeding off. Oliver plays with the kids and an iPhone, while Debbie exits."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Oliver rises, prompting Charlotte, Sadie, and Desi to run off, with Oliver following. Desi swims underwater gracefully, seeing Jason and Ronnie, who appear awkward and red-faced, and she swims away as they surface. Larry amuses Oliver, while Jason and Ronnie talk to Desi. At mealtime, Oliver leaves, but the atmosphere tenses as Debbie sees Oliver standing at the back, looking uncomfortable and softly singing. She smokes outside, encounters Sadie, and heads inside with Sadie following. In the kitchen, Barb is with Pete and Charlotte. Debbie finds Pete stress-eating, storms towards the foyer, where Larry and others are present. Pete throws a cupcake as Larry and Claire leave, and Pete storms in. Oliver passes Pete and turns to Debbie, who follows him to the porch. Larry opens the door, revealing everyone except Pete, who is riding his bike away angrily on San Vicente Boulevard, nearly falling from a car scare. Debbie and Barb clean up, watching Oliver pick up glasses, Sadie arrives with Joseph, and leaves with him. Traffic clogs as Pete nearly collides with a car and rides alongside Jason's van, where Desi is, and they speed off. Oliver plays with kids as Debbie exits."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Oliver rises from his seat, and almost immediately, Charlotte, Sadie, and Desi swiftly make their way elsewhere, with Oliver following swiftly behind them. In the water, Desi moves with an elegant grace as she swims beneath the surface, where she looks stunningly beautiful. It is at this moment that her eyes catch sight of Jason and Ronnie, who appear grotesque and awkward, their faces flushed a deep red. As the two reach out toward one another and emerge at the surface, Desi quietly swims away, choosing to distance herself. Meanwhile, Larry engages Oliver in conversation, and Oliver responds with a smile, finding amusement in the exchange. At the same time, Jason and Ronnie engage in conversation with Desi. Elsewhere, Debbie, Pete, Larry, Oliver, Barb, and Barry are eating together as Ronnie, Jason, and Desi continue their discussion. Oliver then rises, preparing to leave, and as he heads towards the exit, the atmosphere at the gathering grows tense. However, it becomes evident to Debbie that Oliver has not truly departed; instead, he stands quietly at the back of the room, appearing uncomfortable as he softly sings to himself, a sight that leaves Debbie taken aback. As she smokes a cigarette at the side of the house, Sadie suddenly appears, catching Debbie off guard. In response, Debbie turns around and heads back towards the house, with Sadie trailing behind her. Sadie bursts through the front door, continuing her pursuit as Debbie makes her way down the hallway, still with Sadie on her heels. Inside the kitchen, Barb is with Pete and Charlotte when Debbie rounds the corner and spots Pete, who is anxiously snacking right in front of the refrigerator. Frustrated, Debbie storms off towards the foyer, where she encounters Larry positioned in her path, with Claire and the triplets close behind him. In a fit of frustration, Pete throws his cupcake against the wall as Larry and Claire walk away, and Pete storms into the room. Oliver crosses paths with Pete and then turns his attention to Debbie, an action that leaves Debbie momentarily stunned. She follows him out to the front porch, and after stepping outside, she closes the door behind them and takes a moment to look at him. Meanwhile, Larry opens the door slightly and peers outside, revealing that everyone attending the party, with the exception of Pete, remains gathered in the foyer. From a vantage point at the side of the house, Pete can be seen riding his bicycle, wearing his street clothes and helmet. Filled with anger, he rides away from home with intense emotion, seeking to release his pent-up frustration. Pete cycles onto San Vicente Boulevard, continuing down the street when a car passes by. A teenager within the vehicle yells out to startle him, nearly causing Pete to lose his balance. Inside, Debbie and Barb are tidying up and observe Oliver picking up glasses, with Sadie entering in the company of Joseph. Sadie makes her exit, followed closely by Joseph. Meanwhile, in the street, traffic becomes congested, and the blaring of a car horn nearly causes Pete to ride directly into another vehicle as it makes a right turn. He then pulls up alongside Jason's van, where Desi is traveling with Jason, and together, they speed away. Back at the party, Oliver engages the kids with a playful interaction involving an iPhone, while Debbie steps outside and departs from the scene."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Oliver rises gracefully from his seat, and almost immediately, Charlotte, Sadie, and Desi promptly make their way elsewhere, with Oliver quickly following closely behind them. In the clear water, Desi moves with an elegant grace, swimming with poise beneath the surface, where she looks stunningly beautiful and serene. It is at this moment that her eyes catch sight of Jason and Ronnie, who appear grotesque and awkward, their faces flushed a deep red from either exertion or embarrassment. As the two reach out toward one another, emerging at the surface, Desi quietly swims away, choosing to distance herself from the awkwardness. Meanwhile, Larry engages Oliver in a light-hearted conversation, and Oliver responds with a warm smile, finding genuine amusement in their exchange. At the same time, Jason and Ronnie engage in a somewhat awkward conversation with Desi. Elsewhere, Debbie, Pete, Larry, Oliver, Barb, and Barry are eating together, sharing a meal as Ronnie, Jason, and Desi continue their discussion. Oliver then rises from his seat, preparing to leave the gathering, and as he heads towards the exit, the atmosphere at the gathering grows tense with anticipation. However, it becomes evident to Debbie that Oliver has not truly departed; instead, he stands quietly at the back of the room, appearing uncomfortable as he softly sings to himself, a sight that leaves Debbie feeling taken aback and surprised. As she smokes a cigarette at the side of the house, Sadie suddenly appears out of nowhere, catching Debbie off guard with her sudden presence. In response, Debbie turns around abruptly and heads back towards the house, with Sadie diligently trailing behind her. Sadie bursts through the front door, continuing her determined pursuit as Debbie makes her way down the hallway, with Sadie still on her heels, not giving up. Inside the kitchen, Barb is in the company of Pete and Charlotte when Debbie rounds the corner and spots Pete, who is anxiously snacking right in front of the refrigerator. Frustrated by the scene, Debbie storms off towards the foyer, where she encounters Larry positioned inconveniently in her path, with Claire and the triplets close behind him. In a fit of frustration, Pete throws his cupcake violently against the wall as Larry and Claire walk away, and Pete storms into the room, obviously upset. Oliver crosses paths with Pete and then turns his attention to Debbie, an action that leaves Debbie momentarily stunned and unsure. She follows him out to the front porch, and after stepping outside, she closes the door behind them, taking a moment to look at him with curiosity. Meanwhile, Larry opens the door slightly and peers outside cautiously, revealing that everyone attending the party, with the exception of Pete, remains gathered in the foyer. From a vantage point at the side of the house, Pete can be seen riding his bicycle, dressed in his street clothes and helmet. Filled with anger, he rides away from home with intense emotion, seeking a way to release his pent-up frustration and find some solace. Pete cycles onto San Vicente Boulevard, continuing down the street with determination when a passing car comes by unexpectedly. A teenager within the vehicle yells out to startle him, nearly causing Pete to lose his balance and potentially fall. Inside the house, Debbie and Barb are tidying up diligently and observe Oliver picking up glasses, with Sadie entering in the company of Joseph. Sadie makes her exit without delay, followed closely by Joseph. Meanwhile, in the street, traffic becomes congested, and the incessant blaring of a car horn nearly causes Pete to ride directly into another vehicle as it makes a right turn. He then pulls up alongside Jason's van, where Desi is traveling with Jason, and together, they speed away into the distance. Back at the party, Oliver engages the kids with a playful interaction involving an iPhone, while Debbie steps outside and quietly departs from the scene, leaving the atmosphere behind."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Oliver gradually rises from his seated position as Charlotte, Sadie, and Desi energetically sprint away, their footsteps echoing with excitement, and Oliver follows in pursuit, joining their lively chase. Meanwhile, Desi plunges gracefully into the water, moving effortlessly below the surface, her form sleek and fluid, capturing a stunning visual that exudes elegance. Her gaze shifts through the water, where she perceives Jason and Ronnie submerged nearby, their appearances distorted, their faces reddened and expressions awkwardly contorted under the rippling surface. As they awkwardly extend their arms towards one another and begin to emerge from the water, Desi instinctively veers away, propelling herself forward with deliberate strokes. Above water, Larry engages Oliver in conversation, his words sparking amusement in Oliver, who responds with an easy smile, a hint of laughter in his eyes. Simultaneously, Jason and Ronnie's animated conversation with Desi unfolds nearby, their voices a backdrop to the lively scene. Amidst this, Debbie, Pete, Larry, Oliver, Barb, and Barry gather, savoring their meal, the clinking of cutlery punctuating their dialogue, while Ronnie, Jason, and Desi continue their exchange. The moment shifts as Oliver decides to rise, methodically pushing his chair back, signaling his intention to depart, and strides purposefully towards the exit. The atmosphere subtly shifts, a ripple of tension coursing through the party as his absence is noted. Yet Debbie, observant and keen-eyed, discerns that Oliver has not truly left; he stands at the periphery, a figure shadowed at the back of the room, his discomfort unveiled as he quietly hums a tune, his unexpected singing stirring a jolt of surprise in Debbie. Seeking solitude, she retreats to the side of the house, cigarette in hand, lost in thought, until Sadie unexpectedly materializes, catching her off guard. Startled, Debbie pivots, abandoning her spot, and strides purposefully towards the house, her movements brisk as Sadie trails close behind, a silent shadow. With determination, Sadie bursts through the front door, her pace hurried as she doggedly follows Debbie, who navigates the hallway with resolute steps, Sadie's persistent presence never faltering. In the kitchen resides Barb, engaged in conversation with Pete and Charlotte, their chatter blending with the surroundings, when Debbie abruptly swings around the corner, drawn by the sight of Pete indulging in stress-induced snacking in front of the fridge, his demeanor reflecting his inner turmoil. Unsettled, Debbie storms away, her pace brisk towards the foyer, where Larry intercepts her, his presence unexpectedly obstructing her path, with Claire and the triplets close behind him, adding to the crowd. Amidst this intersection, Pete's frustration culminates in a dramatic gesture, hurling his cupcake against the wall in a moment of uncontained emotion as Larry and Claire retreat, their departure orchestrating a retreat. Amidst the chaos, Pete forces his way past, his movements depicting barely contained agitation, while Oliver crosses paths with Pete, glancing back at Debbie just as Pete makes his exit, leaving Debbie momentarily stunned, prompting her to follow him onto the front porch, where she gently closes the door, sealing the moment as she pauses to gaze at him. The moment is interrupted as Larry cautiously opens the door, peering out to disclose the scene within the foyer where every party guest, except for Pete, remains gathered. From a vantage point beside the house, Pete can be seen pedaling his bicycle, attired in his usual street clothes and helmet, his demeanor radiating anger as he rides away from home with impassioned energy, seeking release from his frustrations. His journey leads him onto San Vicente Boulevard, where he skillfully navigates down the street, his focus unwavering until a car speeds past, and a teenage passenger's shout pierces the air, startling Pete and nearly causing him to lose his balance. Oblivious to the turmoil behind them, Debbie and Barb diligently clear the remnants of the party, watching as Oliver assists by collecting glasses, his actions deliberate and efficient, while Sadie reappears accompanied by Joseph. As Sadie strides away, Joseph trails closely behind, mirroring her steps. Meanwhile, traffic congestion intensifies on the road, a piercing car horn sounding as Pete's bike veers dangerously close to an oncoming car making a right turn, narrowly avoiding collision. Undeterred, Pete aligns himself alongside Jason's van, where Desi is seated beside Jason, and the van surges forward, their journey continuing. Back at the party, Oliver engages with the children, playfully interacting with an iPhone, embodying a sense of lightheartedness, while Debbie steps outside, her figure receding into the distance as she makes her exit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Oliver rises as Charlotte, Sadie, and Desi dash off, with him following. Desi swims underwater elegantly, seeing Jason and Ronnie looking grotesque and awkward in the water. She moves away as they reach for each other and come up for air. Meanwhile, Larry chats with Oliver, who finds amusement in their conversation, while Jason and Ronnie talk to Desi. During a meal with Debbie, Pete, Larry, Oliver, Barb, and Barry, Oliver steps away, causing a tense shift in the party. Debbie later notices Oliver, who never left but stands at the back singing quietly, surprising her. She smokes by the house as Sadie catches her, prompting Debbie to head indoors with Sadie in pursuit. Inside, she walks past Barb with Pete and Charlotte in the kitchen, finds Pete stressed by the fridge, and then storms toward the foyer. Larry stops her, with Claire and the triplets close behind. Pete, agitated, throws a cupcake and storms off, passing Oliver, who stuns Debbie as she follows Pete out to the porch. Larry reveals everyone, except Pete, still in the foyer. Pete, in street clothes and a helmet, rides his bike away angrily, releasing his frustration as he navigates San Vicente Boulevard. A passing car and a yelling teenager nearly cause him to fall, and as traffic jams up, a honking car forces him closer to another vehicle. Spotting Desi with Jason in a van, Pete watches them speed off. Back at the house, Oliver plays with the kids using an iPhone while Debbie and Barb clean up, observing Sadie and Joseph as they enter."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Oliver gets up, and Charlotte, Sadie, and Desi, all friends since elementary school, run off, followed by Oliver. Desi, a champion swimmer known for her grace in the water, swims underwater, looking gorgeous, and she sees Jason and Ronnie underwater, appearing grotesque, red-faced, and awkward like fish out of their element. As they reach for each other and surface, Desi, feeling uncomfortable with their antics, swims away. Larry, who has been friends with Oliver since college days, talks to Oliver, who smiles, amused by Larry's witty remarks, while Jason and Ronnie are talking to Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are eating as Ronnie, Jason, and Desi talk over plates of delicious barbecue cooked by a local chef. Oliver gets up to leave, walks out, and the party, which was initially lively, becomes tense. Debbie notices that Oliver never actually left; he stands at the back, looking uncomfortable and quietly singing a song from his high school band days, which shocks Debbie. She smokes a cigarette at the side of the house, an old habit she picked up during stressful college exams, when Sadie appears, and Debbie, caught, turns and walks towards the house, with Sadie following. Sadie storms through the front door after Debbie, who continues down the hall, still followed by Sadie, who is her younger and inquisitive cousin. Barb is in the kitchen with Pete and Charlotte, discussing new recipes, as Debbie turns the corner and finds Pete stress eating in front of the fridge, a habit he developed during his first job. Debbie storms off towards the foyer, where Larry stops her, and Claire and the triplets, who just returned from soccer practice, are right behind him. Pete throws his cupcake, his favorite indulgence, against the wall as Larry and Claire walk away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete walks away, stunning Debbie, who follows him out to the front porch, closing the door behind them and looking at him for a moment, both reflecting on the night's events. Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer. From the side of the house, Pete is seen riding his bike, his usual method to clear his mind, in his street clothes and helmet, exiting home, very angry and riding with great emotion to release frustration. Pete rides his bike onto San Vicente Boulevard, a bustling street known for its traffic, and down the street; a car passes, and a teenager yells to scare him, causing Pete to almost fall. Debbie and Barb, who have been friends since they met at a book club, clean up and see Oliver picking up glasses, Sadie walking in with Joseph, her new college friend. Sadie walks off, followed by Joseph, who is eager to share his love for jazz music. The traffic clogs up and a car honks, almost causing Pete to ride into it as it makes a right turn; he pulls up alongside Jason's van, where Desi is riding with Jason, and they speed off, eager to catch the evening concert. Oliver plays with the kids and an iPhone, entertaining them with a new game, while Debbie walks outside, and exits, seeking a moment of quiet reflection."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer Oliver gets up and Charlotte Sadie walks off followed by Joseph Sadie and Desi run off followed by Oliver Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward As they reach for each other and surface Desi swims away Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi As they reach for each other and surface Desi swims away Oliver gets up and Charlotte Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie Jason and Desi talk Oliver gets up to leave walks out and the party becomes tense Debbie notices that Oliver never actually left Debbie notices that Oliver never actually left Sadie walking in with Joseph he pulls up alongside Jason's van where Desi is riding with Jason and they speed off he stands at the back looking uncomfortable and quietly singing which shocks Debbie She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following Oliver plays with the kids and an iPhone Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie Sadie and Desi run off followed by Oliver Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in Oliver passes Pete and turns to Debbie as Pete walks away stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him From the side of the house Pete is seen riding his bike in his street clothes and helmet exiting home very angry and riding with great emotion to release frustration Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall Oliver gets up to leave walks out and the party becomes tense Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi Debbie and Barb clean up and see Oliver picking up glasses Sadie walking in with Joseph Sadie walks off followed by Joseph The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn he pulls up alongside Jason's van where Desi is riding with Jason and they speed off Oliver plays with the kids and an iPhone Debbie walks outside and exits"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Oliver gets up and Charlotte. Sadie and Desi run off followed by Oliver. Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward. As they reach for each other and surface Desi swims away. Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi. Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie. Jason and Desi talk. Oliver gets up to leave walks out and the party becomes tense. Debbie notices that Oliver never actually left. he stands at the back looking uncomfortable and quietly singing which shocks Debbie. She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following. Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie. Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge. Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete walks away. stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment. Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer. From the side of the house Pete is seen riding his bike in his street clothes and helmet. exiting home very angry and riding with great emotion to release frustration. Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall. Debbie and Barb clean up and see Oliver picking up glasses. Sadie walking in with Joseph. Sadie walks off followed by Joseph. The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn. he pulls up alongside Jason's van where Desi is riding with Jason and they speed off. Oliver plays with the kids and an iPhone. Debbie walks outside and exits."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Oliver gets up and Charlotte. Sadie and Desi run off followed by Oliver. Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward. As they reach for each other and surface Desi swims away. Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi. Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie. Jason and Desi talk. Oliver gets up to leave walks out and the party becomes tense. Debbie notices that Oliver never actually left. he stands at the back looking uncomfortable and quietly singing which shocks Debbie. She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following. Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie. Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge. Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete walks away. stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment. Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer. From the side of the house Pete is seen riding his bike in his street clothes and helmet. exiting home very angry and riding with great emotion to release frustration. Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall. Debbie and Barb clean up and see Oliver picking up glasses. Sadie walking in with Joseph. Sadie walks off followed by Joseph. The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn. he pulls up alongside Jason's van where Desi is riding with Jason and they speed off. Oliver plays with the kids and an iPhone. Debbie walks outside and exits."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Oliver gets up and Charlotte. Sadie and Desi run off followed by Oliver. Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward. As they reach for each other and surface Desi swims away. Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi. Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie. Jason and Desi talk. Debbie and Barb clean up and see Oliver picking up glasses. Sadie walking in with Joseph. Sadie walks off followed by Joseph. The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn. he pulls up alongside Jason's van where Desi is riding with Jason and they speed off. Oliver plays with the kids and an iPhone. Debbie walks outside and exits."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Oliver gets up and Charlotte. Sadie and Desi run off followed by Oliver. Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward. he pulls up alongside Jason's van where Desi is riding with Jason and they speed off. Oliver plays with the kids and an iPhone. Debbie walks outside and exits."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Charlotte gets up, and Oliver, Jason, and Ronnie run off, followed by Charlotte. Ronnie gracefully swims underwater, looking gorgeous, and she sees Sadie and Debbie underwater, appearing grotesque, red-faced, and awkward. As they reach for each other and surface, Ronnie swims away. Claire talks to Charlotte, who smiles, amused, while Sadie and Debbie are talking to Ronnie. Desi, Barb, Claire, Charlotte, Pete, and Barry are eating as Debbie, Sadie, and Ronnie talk. Charlotte gets up to leave, walks out, and the party becomes tense. Desi notices that Charlotte never actually left; she stands at the back, looking uncomfortable and quietly singing, which shocks Desi. She smokes a cigarette at the side of the house when Oliver appears, and Desi, caught, turns and walks towards the house, with Oliver following. Oliver storms through the front door after Desi, who continues down the hall, still followed by Oliver. Claire is in the kitchen with Barry and Jason as Desi turns the corner and finds Barry stress eating in front of the fridge. Desi storms off towards the foyer, where Claire stops her, and Jason and the triplets are right behind him. Barry throws his cupcake against the wall as Claire and Jason walk away and Barry storms in. Charlotte passes Barry and turns to Desi as Barry walks away, stunning Desi, who follows him out to the front porch, closing the door behind them and looking at him for a moment. Claire opens the door and peeks out to reveal everyone at the party except Barry still in the foyer. From the side of the house, Barry is seen riding his bike in his street clothes and helmet, exiting home, very angry and riding with great emotion to release frustration. Barry rides his bike onto San Vicente Boulevard and down the street; a car passes, and a teenager yells to scare him, causing Barry to almost fall. Desi and Claire clean up and see Charlotte picking up glasses, Oliver walking in with Pete. Oliver walks off, followed by Pete. The traffic clogs up and a car honks, almost causing Barry to ride into it as it makes a right turn; he pulls up alongside Debbie's van, where Ronnie is riding with Debbie, and they speed off. Charlotte plays with the kids and an iPhone, Desi walks outside, and exits."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Oliver gets up, and Charlotte, Sadie, and Desi run off, followed by Oliver. Desi gracefully glides over the ice, looking gorgeous, and she sees Jason and Ronnie behind the glass, appearing grotesque, flushed, and awkward. As they reach for each other and enter the rink, Desi skates away. Larry talks to Oliver, who smiles, amused, while Jason and Ronnie are chatting with Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are munching as Ronnie, Jason, and Desi converse. Oliver gets up to leave, strolls out, and the gathering becomes tense. Debbie notices that Oliver never actually left; he stands at the back, looking uncomfortable and quietly humming, which shocks Debbie. She sips a drink at the edge of the patio when Sadie appears, and Debbie, caught, turns and walks towards the patio doors, with Sadie following. Sadie storms through the sliding door after Debbie, who continues down the corridor, still pursued by Sadie. Barb is in the den with Pete and Charlotte as Debbie turns the corner and finds Pete nervously sorting mail in front of the shelves. Debbie storms off towards the entrance, where Larry stops her, and Claire and the triplets are right behind him. Pete throws his napkin against the wall as Larry and Claire walk away and Pete storms in. Oliver passes Pete and turns to Debbie as Pete walks away, stunning Debbie, who follows him out to the garden, closing the gate behind them and looking at him for a moment. Larry opens the gate and peeks out to reveal everyone at the gathering except Pete still in the entranceway. From the side of the patio, Pete is seen riding his skateboard in his street clothes and helmet, exiting home, very angry and riding with great emotion to release frustration. Pete skates onto Elm Street and down the lane; a bus passes, and a teenager yells to scare him, causing Pete to almost fall. Debbie and Barb tidy up and see Oliver picking up books, Sadie walking in with Joseph. Sadie walks off, followed by Joseph. The pedestrians clog up and a bike bell rings, almost causing Pete to ride into it as it makes a right turn; he pulls up alongside Jason's moped, where Desi is riding with Jason, and they speed off. Oliver plays with the kids and a tablet, Debbie walks outside, and exits."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Oliver rises, and Charlotte, Sadie, and Desi trot off, followed by Oliver. Desi effortlessly drifts underwater, looking stunning, and she spots Jason and Ronnie submerged, appearing bizarre, red-faced, and awkward. As they grasp for each other and ascend, Desi glides away. Larry converses with Oliver, who grins, entertained, while Jason and Ronnie are chatting to Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are feasting as Ronnie, Jason, and Desi converse. Oliver rises to depart, strides out, and the gathering becomes uneasy. Debbie observes that Oliver never actually departed; he stands at the back, looking uneasy and quietly humming, which surprises Debbie. She snacks on a biscuit at the side of the house when Sadie appears, and Debbie, caught, pivots and marches towards the house, with Sadie trailing. Sadie bursts through the front door after Debbie, who proceeds down the hall, still followed by Sadie. Barb is in the kitchen with Pete and Charlotte as Debbie rounds the corner and finds Pete nibbling in front of the fridge. Debbie dashes off towards the foyer, where Larry halts her, and Claire and the triplets are right behind him. Pete tosses his cupcake against the wall as Larry and Claire stroll away and Pete charges in. Oliver overtakes Pete and turns to Debbie as Pete departs, astonishing Debbie, who trails him out to the front porch, shutting the door behind them and gazing at him for a moment. Larry swings the door open and peeks out to reveal everyone at the gathering except Pete still in the foyer. From the side of the house, Pete is seen flying his kite in his street clothes and helmet, leaving home, very upset and flying with great vigor to release frustration. Pete flies his kite onto San Vicente Boulevard and down the street; a car zooms by, and a teenager shouts to startle him, causing Pete to almost stumble. Debbie and Barb tidy up and spot Oliver gathering glasses, Sadie strolling in with Joseph. Sadie strides off, trailed by Joseph. The traffic muddles up, and a car blares its horn, almost causing Pete to steer into it as it makes a right turn; he pulls up alongside Jason's van, where Desi is driving with Jason, and they zoom off. Oliver dances with the kids and an iPhone, Debbie steps outside, and exits."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster gets up, and the mailbox, pencil, and cushion run off, followed by the toaster. The cushion gracefully swims underwater, looking magnificent, and it sees the stapler and notebook underwater, appearing peculiar, red-faced, and awkward. As they reach for each other and surface, the cushion swims away. The umbrella talks to the toaster, who smiles, amused, while the stapler and notebook are talking to the cushion. The kiwi, drum, umbrella, toaster, tangerine, and drawer are eating as the notebook, stapler, and cushion talk. The toaster gets up to leave, walks out, and the orchestra becomes tense. The kiwi notices that the toaster never actually left; it stands at the back, looking uncomfortable and quietly singing, which shocks the kiwi. It smokes a cigarette at the side of the lamp when the pencil appears, and the kiwi, caught, turns and walks towards the lamp, with the pencil following. The pencil storms through the front door after the kiwi, who continues down the hallway, still followed by the pencil. The tangerine is in the kitchen with the drum and mailbox as the kiwi turns the corner and finds the drum stress eating in front of the aquarium. The kiwi storms off towards the wardrobe, where the umbrella stops it, and the plant and the paper clips are right behind it. The drum throws its cupcake against the wall as the umbrella and plant walk away and the drum storms in. The toaster passes the drum and turns to the kiwi as the drum walks away, stunning the kiwi, who follows it out to the front porch, closing the door behind them and looking at it for a moment. The umbrella opens the door and peeks out to reveal everyone at the orchestra except the drum still in the wardrobe. From the side of the lamp, the drum is seen riding its skateboard in its street clothes and helmet, exiting labyrinth, very angry and riding with great emotion to release frustration. The drum rides its skateboard onto Peppermint Street and down the avenue; a van passes, and a squirrel yells to scare it, causing the drum to almost tumble. The kiwi and tangerine clean up and see the toaster picking up vases, the pencil walking in with the giraffe. The pencil walks off, followed by the giraffe. The congestion clogs up and a van honks, almost causing the drum to ride into it as it makes a right turn; it pulls up alongside the stapler's truck, where the cushion is riding with the stapler, and they speed off. The toaster plays with the trees and a laptop, the kiwi walks outside, and exits."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "George stirs, and Amelia, Lucy, and Felix dash off, trailed by George. Felix elegantly sails through the sky, looking fabulous, and he spots Max and Danny in the sky, appearing peculiar, purple-faced, and clumsy. As they aim for each other and soar higher, Felix sails away. Ben chats with George, who laughs, entertained, while Max and Danny are chatting with Felix. Sharon, Ted, Ben, George, Donna, and Ryan are dining as Danny, Max, and Felix chat. George stands to depart, strides out, and the gathering becomes uneasy. Sharon notices that George never truly departed; he lingers at the rear, appearing uneasy and quietly humming, which astonishes Sharon. She knits a scarf at the edge of the house when Lucy emerges, and Sharon, surprised, spins and strolls toward the house, with Lucy trailing. Lucy charges through the main entrance after Sharon, who proceeds down the corridor, still pursued by Lucy. Donna is in the pantry with Ted and Amelia as Sharon rounds the bend and discovers Ted anxiously nibbling in front of the freezer. Sharon charges off toward the atrium, where Ben intercepts her, and Hannah and the triplets are directly behind him. Ted hurls his sandwich against the wall as Ben and Hannah stride away and Ted charges in. George glides past Ted and turns to Sharon as Ted hurries away, startling Sharon, who trails him out to the veranda, sealing the door behind them and gazing at him momentarily. Ben swings the door open and peeks out to disclose everyone at the gathering except Ted still in the atrium. From the edge of the house, Ted is glimpsed zooming on his skateboard in his casual attire and helmet, leaving home, very irate and zooming with intense passion to release tension. Ted zooms his skateboard onto Main Street and down the road; a scooter zips past, and an adolescent shouts to startle him, nearly causing Ted to stumble. Sharon and Donna tidy up and see George gathering cups, Lucy strolling in with Michael. Lucy strides off, accompanied by Michael. The congestion swells and a vehicle beeps, almost causing Ted to veer into it as it swerves right; he pulls alongside Max's truck, where Felix is riding with Max, and they zoom onward. George frolics with the pets and a tablet, Sharon steps outside, and departs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Oliver rises up, and Charlotte, Sadie, and Desi dash away, trailed by Oliver. Desi elegantly dances on the surface, looking radiant, and she spots Jason and Ronnie floating above, appearing peculiar, purple-faced, and uneasy. As they drift toward each other and dive, Desi glides away. Larry chats with Oliver, who grins, entertained, while Jason and Ronnie are conversing with Desi. Debbie, Pete, Larry, Oliver, Barb, and Barry are chatting as Ronnie, Jason, and Desi converse. Oliver rises to depart, sneaks out, and the gathering becomes strained. Debbie observes that Oliver never really departed; he lingers at the rear, looking unsettled and softly humming, which startles Debbie. She munches on a cookie at the side of the house when Sadie shows up, and Debbie, caught, turns and paces toward the house, with Sadie trailing. Sadie bursts through the back door after Debbie, who continues down the corridor, still trailed by Sadie. Barb is in the living room with Pete and Charlotte as Debbie rounds the corner and finds Pete nervously rearranging items in front of the cupboard. Debbie storms off toward the vestibule, where Larry intercepts her, and Claire and the triplets are right behind him. Pete launches his sandwich at the ceiling as Larry and Claire stroll away and Pete charges in. Oliver crosses paths with Pete and turns to Debbie as Pete stomps away, astonishing Debbie, who follows him out to the backyard, shutting the door behind them and gazing at him for a moment. Larry opens the door and peers out to reveal everyone at the gathering except Pete still in the vestibule. From the back of the house, Pete is seen skating in his pajamas and goggles, leaving the property, very upset and gliding with great vigor to release tension. Pete skates onto Santa Monica Boulevard and down the pavement; a bus passes, and a child shouts to startle him, causing Pete to nearly tip over. Debbie and Barb tidy up and see Oliver collecting plates, Sadie strolling in with Joseph. Sadie wanders off, trailed by Joseph. The avenue backs up and a truck honks, nearly causing Pete to swerve into it as it takes a left turn; he veers beside Jason's truck, where Desi is dining with Jason, and they dash away. Oliver entertains the kids and a tablet, Debbie strolls outside, and retreats."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Elijah hops up, and Miranda, Sophie, and Leo fly in, chased by Elijah. Leo awkwardly flies in the sky, appearing wobbly, and he spots Ryan and Max soaring through the air, looking elegant, blue-skinned, and fluid. As they drift towards each other and glide down, Leo drifts away. Frank chats with Elijah, who laughs, entertained, while Ryan and Max are whispering to Leo. Carla, Tom, Frank, Elijah, Alice, and Greg are carving as Max, Ryan, and Leo murmur. Elijah stands to dance, skips out, and the concert turns chaotic. Carla realizes that Elijah never actually danced away; he crouches at the front, feeling ecstatic and loudly singing, which thrills Carla. She juggles a torch at the edge of the garden when Sophie arrives, and Carla, halted, spins and skips towards the garden, with Sophie trailing. Sophie whirls through the back gate after Carla, who continues up the path, still trailed by Sophie. Alice is in the lounge with Tom and Miranda as Carla spins around and finds Tom nervously painting on the patio. Carla twirls off towards the atrium, where Frank halts her, and Jenna and the quartet are right beside him. Tom tosses his sandwich into the pool as Frank and Jenna dance away and Tom pirouettes in. Elijah skips past Tom and whirls to Carla as Tom pirouettes away, wowing Carla, who glides out to the back terrace, shutting the gate behind them and gazing at him for a moment. Frank swings the gate and sneaks out to show everyone at the concert except Tom still in the atrium. From the ledge of the garden, Tom is seen skipping his scooter in his hoodie and sandals, exiting the yard, very giddy and leaping with great flair to express excitement. Tom skips his scooter onto Main Street and up the lane; a horse gallops, and a child giggles to amuse him, causing Tom to almost soar. Carla and Alice tidy up and spot Elijah arranging puzzles, Sophie strolling in with Mark. Sophie strolls off, pursued by Mark. The horses trot along and a wagon creaks, almost causing Tom to leap onto it as it takes a left turn; he glides alongside Ryan's truck, where Leo is soaring with Ryan, and they soar away. Elijah sketches with the cats and an iPad, Carla leaps outside, and prances away."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Oliver, followed by Charlotte, Sadie, and Desi, engages in a pool encounter where Desi swims gracefully, contrasting with the awkwardness of Jason and Ronnie. Tension arises at a party when Oliver leaves and then reappears, singing quietly at the back, surprising Debbie. A sequence of tense motions follows, with Debbie, chased by Sadie, moving through the house, encountering stress-eater Pete. In frustration, Pete exits dramatically, riding his bike angrily down San Vicente Boulevard, narrowly avoiding collisions. Meanwhile, the party continues with Debbie and Barb cleaning up, noticing Oliver and Sadie accompanied by Joseph. Amidst the bustling traffic, Pete rides with intensity and sees Desi and Jason, who speed away. Oliver entertains kids with an iPhone as Debbie exits."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Debbie walks outside and exits Oliver plays with the kids and an iPhone he pulls up alongside Jason's van where Desi is riding with Jason and they speed off The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn Sadie walks off followed by Joseph Sadie walking in with Joseph Debbie and Barb clean up and see Oliver picking up glasses Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall exiting home very angry and riding with great emotion to release frustration From the side of the house Pete is seen riding his bike in his street clothes and helmet Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment Oliver passes Pete and turns to Debbie as Pete walks away Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following he stands at the back looking uncomfortable and quietly singing which shocks Debbie Debbie notices that Oliver never actually left Oliver gets up to leave walks out and the party becomes tense Jason and Desi talk Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi As they reach for each other and surface Desi swims away Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward Sadie and Desi run off followed by Oliver Oliver gets up and Charlotte"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "From the side of the house Pete is seen riding his bike in his street clothes and helmet stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following Debbie and Barb clean up and see Oliver picking up glasses Debbie walks outside and exits Jason and Desi talk Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in he stands at the back looking uncomfortable and quietly singing which shocks Debbie The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge exiting home very angry and riding with great emotion to release frustration Oliver passes Pete and turns to Debbie as Pete walks away he pulls up alongside Jason's van where Desi is riding with Jason and they speed off Sadie and Desi run off followed by Oliver Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer Oliver plays with the kids and an iPhone Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi Sadie walking in with Joseph Oliver gets up to leave walks out and the party becomes tense Debbie notices that Oliver never actually left Sadie walks off followed by Joseph Oliver gets up and Charlotte As they reach for each other and surface Desi swims away Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Pete throws his cupcake against the wall as Larry and Claire walk away and Pete storms in Oliver passes Pete and turns to Debbie as Pete walks away stunning Debbie who follows him out to the front porch closing the door behind them and looking at him for a moment Larry opens the door and peeks out to reveal everyone at the party except Pete still in the foyer From the side of the house Pete is seen riding his bike in his street clothes and helmet exiting home very angry and riding with great emotion to release frustration Pete rides his bike onto San Vicente Boulevard and down the street a car passes and a teenager yells to scare him causing Pete to almost fall Debbie and Barb clean up and see Oliver picking up glasses Sadie walking in with Joseph Sadie walks off followed by Joseph The traffic clogs up and a car honks almost causing Pete to ride into it as it makes a right turn he pulls up alongside Jason's van where Desi is riding with Jason and they speed off Oliver plays with the kids and an iPhone Debbie walks outside and exits Oliver gets up and Charlotte Sadie and Desi run off followed by Oliver Desi gracefully swims underwater looking gorgeous and she sees Jason and Ronnie underwater appearing grotesque redfaced and awkward As they reach for each other and surface Desi swims away Larry talks to Oliver who smiles amused while Jason and Ronnie are talking to Desi Debbie Pete Larry Oliver Barb and Barry are eating as Ronnie Jason and Desi talk Oliver gets up to leave walks out and the party becomes tense Debbie notices that Oliver never actually left he stands at the back looking uncomfortable and quietly singing which shocks Debbie She smokes a cigarette at the side of the house when Sadie appears and Debbie caught turns and walks towards the house with Sadie following Sadie storms through the front door after Debbie who continues down the hall still followed by Sadie Barb is in the kitchen with Pete and Charlotte as Debbie turns the corner and finds Pete stress eating in front of the fridge Debbie storms off towards the foyer where Larry stops her and Claire and the triplets are right behind him"
        }
      ]
    }
  ]
}