{
  "ground_truth": "Fred you said. They roll around fighting on the floor, and the crowd cheers. The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame. He looks at Hermione, and she smiles. Dumbledore approaches the blue flame, and it glows red. A name comes out. Everyone looks on anxiously. The Durmstrang crowd cheers. Another name comes out. The Beauxbatons girls cheer as Fleur walks up. Another name comes out. Hogwarts pupils cheer as Cedric takes the stage. People cheer, but the goblet glows red once more, and another name flies out. Dumbledore takes it and reads. Harry slowly walks up. Dumbledore gives him the paper. Harry is in a room with the other champions. Dumbledore bursts in and grabs Harry. Harry is silent. A woman appears in a puff of smoke. She's well-groomed and dressed colorfully. The four Triwizard champions are stood together in a group. She walks over to them and shakes each of their hands. She takes Harry by the hand into a closet. An owl flies in with a letter for Harry; he takes it and begins to read. The owl nips Harry's finger. The fire flares up a little, a face appears in it. Ron enters the room. Ron leaves. Harry goes to the fire again, but Sirius is gone. Neville waves. Hermione and Ron walk up to them. Ron whispers some words to Hermione. It's clear Ron and Harry are not on speaking terms with each other. Hermione walks up to Harry. Harry and Hagrid are walking through a dark forest. Hagrid is looking more dapper than usual and is carrying a big red flower. Madame Maxime calls out to Hagrid. Harry does as he's told. A huge flame fires up. We're zoomed in on a badge; it depicts Cedric on a bright yellow background. As Harry walks along, other pupils aim insults at him, saying he stinks. A young boy runs past. Harry gets to a doorway; two pupils stand in his way. They laugh, and Harry pushes his way through. He approaches Cedric, who is standing around with his friends. Cedric's friends hurl off more insults. Ron and Seamus are walking along. Harry approaches them. Draco calls out, he's sitting up a tree. Harry walks away, and Draco angrily tries casting a spell. Mad-Eye appears and quickly turns Malfoy into a ferret. Mad-Eye is making the ferret hover around. He sends it up the trouser leg of one of Draco's friends. He squirms and looks uncomfortable. Everyone else is laughing. Mad-Eye winks to Harry, and he laughs. Eventually, it comes back out, and McGonagall turns Draco back to normal. Draco runs away. Mad-Eye shouts after him. Mad-Eye takes off his prosthetic leg and takes a seat.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Fred you uttered. They tumble around grappling on the ground, and the audience cheers. The chamber suddenly becomes quiet as Viktor Krum strides in and places his designation in the blaze. He glances at Hermione, and she grins. Dumbledore approaches the cerulean flame, and it gleams crimson. A moniker emerges. Everyone gazes on apprehensively. The Durmstrang audience cheers. Another designation emerges. The Beauxbatons girls applaud as Fleur strides up. Another moniker emerges. Hogwarts students applaud as Cedric takes the platform. People applaud, but the chalice gleams crimson once more, and another designation flies out. Dumbledore takes it and recites. Harry gradually strides up. Dumbledore gives him the parchment. Harry is in a chamber with the other contenders. Dumbledore bursts in and seizes Harry. Harry is silent. A woman materializes in a puff of vapor. She's well-groomed and attired vividly. The four Triwizard contenders are stood together in a cluster. She strides over to them and shakes each of their hands. She takes Harry by the hand into a cupboard. An owl flies in with a missive for Harry; he takes it and begins to peruse. The owl pecks Harry's finger. The fire flares up a little, a visage appears in it. Ron enters the chamber. Ron exits. Harry goes to the fire again, but Sirius is gone. Neville waves. Hermione and Ron stride up to them. Ron murmurs some phrases to Hermione. It's clear Ron and Harry are not on speaking terms with each other. Hermione strides up to Harry. Harry and Hagrid are walking through a dim woodland. Hagrid is looking more dapper than usual and is bearing a big crimson blossom. Madame Maxime calls out to Hagrid. Harry does as he's told. A huge blaze erupts. We're zoomed in on a badge; it portrays Cedric on a bright yellow backdrop. As Harry strides along, other students aim affronts at him, saying he reeks. A youthful boy dashes past. Harry gets to a portal; two students stand in his way. They chuckle, and Harry pushes his way through. He approaches Cedric, who is standing around with his companions. Cedric's companions hurl off more affronts. Ron and Seamus are striding along. Harry approaches them. Draco calls out, he's sitting up a tree. Harry strides away, and Draco angrily tries casting a spell. Mad-Eye materializes and swiftly turns Malfoy into a ferret. Mad-Eye is making the ferret levitate around. He sends it up the trouser leg of one of Draco's companions. He squirms and looks uncomfortable. Everyone else is laughing. Mad-Eye winks to Harry, and he chuckles. Eventually, it comes back out, and McGonagall turns Draco back to normal. Draco dashes away. Mad-Eye shouts after him. Mad-Eye removes his prosthetic limb and takes a seat."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Fred you said. Fighting is rolled around on the floor by them, and cheering is done by the crowd. Silence suddenly falls over the room as Viktor Krum walks in and places his name in the flame. Hermione is looked at by him, and a smile is given by her. The blue flame is approached by Dumbledore, and it is made to glow red. A name emerges. Anxious looks are given by everyone. Cheering is done by the Durmstrang crowd. Another name emerges. As Fleur walks up, cheering is done by the Beauxbatons girls. Another name emerges. As Cedric takes the stage, cheering is done by Hogwarts pupils. Cheering is done by people, but once more the goblet glows red, and another name is flown out. It is taken by Dumbledore and read. Slowly, Harry walks up. The paper is given to him by Dumbledore. Harry is in a room with the other champions. Dumbledore bursts in and grabs Harry. Silence is maintained by Harry. A woman appears in a puff of smoke. She's well-groomed and dressed colorfully. Together in a group are stood the four Triwizard champions. To them, she walks over and shakes each of their hands. By the hand, she takes Harry into a closet. An owl flies in with a letter for Harry; and it is taken by him and read. Harry's finger is nipped by the owl. The fire flares up a little, and a face appears in it. The room is entered by Ron. Ron leaves. Harry goes to the fire again, but Sirius is gone. Waving is done by Neville. Up to them, Hermione and Ron walk. To Hermione, some words are whispered by Ron. It's clear Ron and Harry are not speaking with each other. Up to Harry, Hermione walks. Through a dark forest, Harry and Hagrid are walking. More dapper than usual is Hagrid looking, and a big red flower is carried by him. Out to Hagrid, Madame Maxime calls. What he is told is done by Harry. A huge flame is fired up. Zooming in on a badge is done by us; a depiction of Cedric on a bright yellow background is given by it. As Harry walks along, he is aimed at with insults by other pupils, saying he stinks. Past runs a young boy. At a doorway, Harry gets; in his way stand two pupils. They laugh, and his way through is pushed by Harry. He approaches Cedric, who is standing around with his friends. More insults are hurled off by Cedric's friends. Along are Ron and Seamus walking. Approached by Harry they are. Out calls Draco; sitting up a tree, he is. Away Harry walks, and with anger, Draco tries casting a spell. Mad-Eye appears and turns Malfoy into a ferret quickly. Hovering around is done by Mad-Eye with the ferret. It is sent up the trouser leg of one of Draco's friends by him. Squirming and looking uncomfortable is done by him. Everyone else laughs. Winking is done by Mad-Eye to Harry, and laughing is done by him. Eventually, out it comes, and Draco is turned back to normal by McGonagall. Away Draco runs. After him, shouting is done by Mad-Eye. His prosthetic leg is taken off, and Mad-Eye takes a seat."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Fred you said. They roll on the floor fighting as the crowd cheers. Silence falls when Viktor Krum enters and places his name in the flame. He looks at Hermione, she smiles. Dumbledore approaches the blue flame, it glows red. A name emerges; the Durmstrang crowd cheers. Another name appears, and Beauxbatons girls cheer as Fleur steps forward. Hogwarts pupils cheer for Cedric. The goblet glows red once more, and another name flies out. Dumbledore reads it. Harry walks up and receives the paper. Harry is with the other champions. Dumbledore rushes in and grabs Harry, who is silent. A woman appears in smoke, well-groomed and colorfully dressed, and shakes hands with the champions. She takes Harry into a closet. An owl delivers a letter to Harry, it nips his finger, and the fire flares, showing a face. Ron enters, then leaves. Harry looks again, but Sirius is gone. Neville waves. Hermione and Ron approach; it's clear Ron and Harry aren't speaking. Hermione talks to Harry. He walks through a dark forest with Hagrid, who is dressed well, carrying a large red flower. Madame Maxime calls Hagrid. Harry follows directions, a huge flame ignites. A badge shows Cedric on a yellow background. Other pupils taunt Harry. A boy runs past. Harry reaches a doorway; two pupils block him, laughing, and he pushes through. He finds Cedric and his friends, who insult him. Ron and Seamus walk by. Harry approaches them as Draco, perched in a tree, calls out. Harry walks away, and Draco tries to cast a spell. Mad-Eye appears, transforming Draco into a ferret, making it hover and sending it up the leg of Draco's friend, who squirms as others laugh. Mad-Eye winks at Harry, who laughs. McGonagall turns Draco back, and he runs off. Mad-Eye shouts after him, removes his prosthetic leg, and sits."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Fred you said. They roll around fighting, the crowd cheers. Silence falls as Viktor Krum enters and submits his name to the flame. He looks at Hermione, who smiles. Dumbledore approaches the blue flame, it turns red, and a name emerges. Anxiously, everyone watches. Durmstrang cheers. Another name appears, and Beauxbatons cheers for Fleur. Another name emerges, and Hogwarts cheers for Cedric. The goblet glows red again, another name flies out. Dumbledore reads it, and Harry walks up slowly to receive the paper. In a room with other champions, Dumbledore grabs Harry, who remains silent. A well-dressed woman appears in smoke, shakes each champion's hand, and takes Harry to a closet. An owl arrives with a letter, nips Harry’s finger, and fire flares, revealing a face. Ron enters, leaves, and Harry returns to the fire, but Sirius is gone. Neville waves. Ron whispers to Hermione, indicating tension with Harry. Hermione approaches Harry. Harry and Hagrid walk in a dark forest; Hagrid holds a large red flower. Madame Maxime calls Hagrid. Harry follows orders as a huge flame erupts. A badge shows Cedric on a yellow background. Pupils insult Harry as he walks, reaching Cedric, whose friends hurl more insults. Ron and Seamus walk along. Harry approaches them. Draco, in a tree, calls out. Mad-Eye transforms Draco into a ferret, making it hover and go up a friend’s trouser leg. Everyone laughs. Mad-Eye winks at Harry, who laughs. McGonagall restores Draco, who runs. Mad-Eye shouts, removes his prosthetic leg, and takes a seat."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Fred, the name you mentioned earlier, echoed in the space. In an instant, they began to roll around on the floor, grappling and tussling as the surrounding crowd erupted in enthusiastic cheers and shouts. Suddenly, the room fell into an unexpected silence when Viktor Krum, the famed Durmstrang student, walked in with a confident stride. He proceeded to drop his name into the flickering blue flame, his eyes briefly meeting Hermione's, who responded with a warm smile. Dumbledore, the revered headmaster, approached the mystical blue flame, which shimmered and transformed into a vibrant red hue. A name emerged from the fiery glow, and everyone present observed with bated breath and eager anticipation. The Durmstrang crowd broke out into celebratory cheers. Then, another name appeared. The girls from Beauxbatons, elegantly poised, cheered enthusiastically as Fleur walked up gracefully. Yet again, a name surfaced. This time, the students from Hogwarts erupted in jubilant cheers as Cedric confidently took the stage. Amidst the applause, the goblet blazed red once more, and another name was unexpectedly produced. Dumbledore took the slip and read aloud, prompting Harry to walk slowly forward. Dumbledore handed him the paper with a firm yet reassuring hand. Soon, Harry found himself in a room alongside the other champions. Without warning, Dumbledore burst into the room and seized Harry's attention. Harry remained silent, absorbing the unfolding events. Out of nowhere, a well-groomed woman, dressed in vibrant and colorful attire, appeared in a dramatic puff of smoke. The four Triwizard champions stood together in a distinguished group. She approached them with an air of confidence, graciously shaking each of their hands in turn. She then gently took Harry by the hand, leading him into a nearby closet. At that moment, an owl swooped in, delivering a letter addressed to Harry. He accepted it and began to read. The owl, with a sense of feistiness, nipped at Harry's finger. Simultaneously, the fire flared up, briefly revealing a face within the flames. Ron made his entrance into the room but soon departed. Harry approached the fire once again, hoping to find Sirius, but he was gone. Neville offered a friendly wave in the distance. Hermione and Ron walked over to join them. Ron leaned in and whispered something to Hermione, clearly indicating that he and Harry weren't currently speaking to each other. Hermione then approached Harry. Together, Harry and Hagrid wandered through the shadowy forest, with Hagrid appearing more dapper than usual while carrying a substantial red flower. Madame Maxime called out to Hagrid, her voice echoing through the trees. Harry, obedient and attentive, did as he was instructed. A colossal flame suddenly roared to life. The camera zoomed in on a badge, which prominently featured Cedric against a bright yellow background. As Harry walked along, other students targeted him with cruel taunts, accusing him of having an unpleasant odor. A young boy sprinted past. Upon reaching a doorway, Harry encountered two pupils who blocked his path. They laughed mockingly as Harry resolutely pushed his way through. He made his way towards Cedric, who was surrounded by his group of friends. Cedric's friends wasted no time in flinging more insults. Meanwhile, Ron and Seamus were strolling along together. As Harry approached them, Draco called out from his perch high up in a tree. Harry chose to walk away, prompting Draco to angrily attempt casting a spell. However, Mad-Eye Moody appeared and swiftly transformed Malfoy into a ferret. Amused, Mad-Eye made the ferret float in the air and sent it up the trouser leg of one of Draco's friends, who squirmed uncomfortably. Laughter erupted from everyone else present. Mad-Eye winked at Harry, eliciting a laugh from him as well. Eventually, the ferret returned, and McGonagall restored Draco to his normal self. Draco swiftly retreated, running away from the scene. Mad-Eye loudly shouted after him, removing his prosthetic leg before sitting down comfortably."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Fred, the name you mentioned earlier, reverberated through the vast and bustling space, echoing with a curious persistence. In what felt like a fleeting moment, they began to energetically roll around on the floor, grappling and tussling intensely, as the surrounding crowd erupted into enthusiastic cheers and boisterous shouts of encouragement. Suddenly, the room was engulfed in an unexpected silence when Viktor Krum, the famed and accomplished student from Durmstrang, strode in with an air of confidence. He proceeded with an unwavering purpose to drop his name into the flickering blue flame, his eyes momentarily meeting Hermione's, who acknowledged him with a warm, heartfelt smile. Dumbledore, the revered and wise headmaster, approached the mystical blue flame, which shimmered and magically transformed into a vibrant and intense red hue. A name emerged from the fiery glow, compelling everyone present to watch with bated breath and eager anticipation. The Durmstrang crowd erupted into celebratory cheers. Then, yet another name appeared. The girls from Beauxbatons, elegantly poised and graceful, cheered with enthusiasm as Fleur walked up with grace. Yet again, another name surfaced. This time, the students from Hogwarts erupted in jubilant and joyous cheers as Cedric confidently took to the stage. Amidst the thunderous applause, the goblet blazed red once more, and another name was unexpectedly produced. Dumbledore took the slip of paper and read aloud, prompting Harry to walk slowly forward. Dumbledore handed him the paper with a firm yet reassuring hand, maintaining a sense of calm authority. Soon, Harry found himself in a room alongside the other champions. Without warning, Dumbledore burst into the room, seizing Harry's attention with urgency. Harry remained silent, absorbing the unfolding series of events. Out of nowhere, a well-groomed woman, dressed in vibrant and colorful attire, appeared dramatically in a puff of smoke. The four Triwizard champions stood together as a distinguished group. She approached them with an air of confidence and authority, graciously shaking each of their hands in turn. She then gently took Harry by the hand, leading him into a nearby closet. At that precise moment, an owl swooped in with precision, delivering a letter addressed specifically to Harry. He accepted it with curiosity and began to read. The owl, with a feisty attitude, nipped at Harry's finger playfully. Simultaneously, the fire flared up, briefly revealing a face within the dancing flames. Ron made his entrance into the room but soon departed quietly. Harry approached the fire once again, hoping to find Sirius, but he was gone. Neville offered a friendly wave from the distance. Hermione and Ron walked over to join them. Ron leaned in closely and whispered something to Hermione, clearly indicating that he and Harry weren't currently speaking to each other. Hermione then approached Harry, offering her support. Together, Harry and Hagrid wandered through the shadowy and mysterious forest, with Hagrid appearing more dapper than usual, carrying a substantial and vibrant red flower. Madame Maxime called out to Hagrid, her voice echoing through the trees. Harry, obedient and attentive to his surroundings, did as he was instructed. Suddenly, a colossal flame roared to life with a captivating intensity. The camera zoomed in on a badge, which prominently featured Cedric against a bright and cheerful yellow background. As Harry walked along, other students targeted him with cruel taunts, accusing him of having an unpleasant odor. A young boy sprinted past with urgency. Upon reaching a doorway, Harry encountered two pupils who blocked his path with playful defiance. They laughed mockingly as Harry resolutely pushed his way through with determination. He made his way towards Cedric, who was surrounded by his supportive group of friends. Cedric's friends wasted no time in flinging more insults. Meanwhile, Ron and Seamus were strolling along together, engaged in conversation. As Harry approached them, Draco called out from his perch high up in a tree. Harry chose to walk away, prompting Draco to angrily attempt casting a spell. However, Mad-Eye Moody appeared with impeccable timing and swiftly transformed Malfoy into a ferret. Amused, Mad-Eye made the ferret float effortlessly in the air and sent it up the trouser leg of one of Draco's friends, who squirmed uncomfortably. Laughter erupted from everyone else present, filling the air with amusement. Mad-Eye winked at Harry, eliciting a laugh from him as well. Eventually, the ferret returned, and McGonagall restored Draco to his normal self. Draco swiftly retreated in haste, running away from the scene. Mad-Eye loudly shouted after him, removing his prosthetic leg before sitting down comfortably with a sense of satisfaction."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Fred you said, and the scene immediately erupts into chaos as they engage in a vigorous bout of wrestling on the floor, causing the crowd gathered around them to erupt in cheers and encouragement. Amidst the commotion, the atmosphere in the room shifts dramatically as a hush falls over the crowd with the entrance of Viktor Krum, who strides in with a determined air and approaches the legendary goblet to place his name into the flickering blue flame. As he completes his task, Viktor looks over at Hermione, who meets his gaze with a warm smile, acknowledging his presence. In response to Viktor's action, Dumbledore moves with purpose towards the goblet, drawing everyone's attention as the blue flame suddenly ignites into a vivid red, signaling that a name is about to be revealed. As the parchment emerges from the flame, the room is filled with a palpable sense of anticipation as all eyes focus intently on the unfolding event. The moment of suspense culminates in a burst of excitement from the Durmstrang crowd, who erupt in loud cheers, happy with the announcement. Following this, another slip of paper emerges, prompting a joyous reaction from the Beauxbatons girls as Fleur makes her way forward with grace and poise. Shortly thereafter, the goblet produces yet another name, prompting a wave of cheers from the Hogwarts students as Cedric steps confidently onto the stage. Just as the excitement appears to reach a peak, the room is once again captivated as the goblet flares red once more, releasing a final name that Dumbledore reads aloud, leading Harry to make his way forward slowly, taking the paper from Dumbledore with a mix of surprise and apprehension. Harry finds himself in a room alongside the other Triwizard champions, and the atmosphere is charged with tension. Suddenly, Dumbledore bursts into the room and approaches Harry with urgency, placing a firm hand on his shoulder, while Harry remains silent and contemplative. In a dramatic twist, a woman materializes in a puff of smoke, her appearance impeccably well-groomed and her attire vivid and colorful, capturing the attention of everyone present. She approaches the group of champions, extending her hand to each one in a gesture of formal greeting, before taking Harry by the hand and leading him into a nearby closet, leaving questions lingering in the air. As this occurs, an owl swoops into the room, delivering a letter addressed to Harry, who opens it and begins reading its contents, only to be momentarily distracted as the owl playfully nips at his finger. Meanwhile, the fireplace suddenly flares up, and a face materializes within the flames, prompting Harry's immediate attention. Ron makes a brief entrance into the room, only to leave shortly thereafter, and when Harry turns back to the fire, the apparition of Sirius has already vanished. Nearby, Neville waves, signaling his presence, as Hermione and Ron approach. Ron leans in closer to Hermione, whispering something to her that remains inaudible to those around. It becomes evident that a rift has formed between Ron and Harry, as the two remain distant and uncommunicative. Hermione takes the opportunity to approach Harry directly, attempting to bridge the gap between them. Later, Harry and Hagrid are seen trudging through a shadowy forest, with Hagrid looking notably more dapper than usual, clutching a large, vibrant red flower in his hand. Their progress is interrupted by Madame Maxime, who calls out to Hagrid in a commanding tone, prompting Harry to obediently follow whatever instructions he's been given. Abruptly, a massive flame erupts, capturing the scene in a dramatic visual moment that transitions the focus to a badge bearing the image of Cedric set against a striking bright yellow backdrop. As Harry continues to navigate the surroundings, he becomes the target of derisive comments from other students who direct their insults at him, accusing him of having an unpleasant odor. A young boy dashes past, adding to the bustling activity. Harry arrives at a doorway where two students, with smug expressions, deliberately block his path. Laughing at his discomfort, Harry musters the resolve to push past them, determined to reach Cedric, who stands nearby, surrounded by his circle of friends. Cedric's companions unleash a fresh wave of taunting remarks, but Harry remains undeterred. Simultaneously, Ron and Seamus are strolling along a path, and Harry approaches them, seeking some form of solidarity. From a nearby tree, Draco calls out in a mocking tone, but Harry chooses to walk away, leaving Draco fuming and impulsively attempting to cast a spell in his direction. Before anything can happen, Mad-Eye Moody intercedes, demonstrating his own formidable magic by transforming Malfoy into a ferret and making it levitate humorously. The ferret darts up the trouser leg of one of Draco's friends, causing a wave of squirming and discomfort, while onlookers burst into laughter at the spectacle. Mad-Eye then acknowledges Harry with a playful wink, eliciting a laugh from him as well. Ultimately, the ferret returns to the ground, and McGonagall steps in to restore Draco to his original form. Humiliated and furious, Draco runs off, with Mad-Eye calling after him. Finally, Mad-Eye removes his prosthetic leg and takes a seat, exuding an air of satisfaction as events begin to settle once more."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fred and the others fight on the floor as the crowd cheers, which falls silent when Viktor Krum enters to submit his name to the Goblet of Fire. He exchanges a glance with Hermione, who smiles back. Dumbledore approaches the Goblet, which turns red and releases names one by one, prompting cheers from Durmstrang for Viktor, Beauxbatons for Fleur, and Hogwarts for Cedric. When Harry's name unexpectedly emerges, he joins the other champions. A colorful woman appears, greeting each champion before taking Harry aside. An owl delivers a letter to Harry, nipping his finger, as a face appears in the fire briefly. Ron enters and leaves, and it's clear he and Harry are not speaking. Harry walks with Hagrid through a dark forest, where Hagrid, looking dapper, carries a large red flower. They encounter Madame Maxime. Harry, facing insults from other pupils, makes his way to Cedric while enduring taunts. As Ron and Seamus walk along, Draco, perched in a tree, calls out to Harry. Mad-Eye Moody intervenes, transforming Draco into a ferret, causing laughter all around. McGonagall eventually returns Draco to normal, and he runs off. Mad-Eye shouts after him before taking a seat, removing his prosthetic leg."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Fred you said. They roll around fighting on the floor, and the crowd gathered for the event, perhaps a dueling club session, cheers. The room suddenly becomes silent as Viktor Krum, the famous Bulgarian Seeker known for his role in the Quidditch World Cup, walks in and puts his name in the flame. He looks at Hermione, who is an exceptionally talented young witch, and she smiles. Dumbledore, the revered headmaster of Hogwarts known for his wisdom and power, approaches the blue flame, and it glows red. A name comes out. Everyone looks on anxiously, knowing the Goblet of Fire only selects the most capable. The Durmstrang crowd, representing the school famous for its emphasis on the Dark Arts, cheers. Another name comes out. The Beauxbatons girls, students of Madame Maxime's elegance-focused academy, cheer as Fleur walks up. Another name comes out. Hogwarts pupils cheer as Cedric Diggory, known for his fairness and talent, takes the stage. People cheer, but the goblet glows red once more, and another name flies out. Dumbledore takes it and reads. Harry, the only known survivor of the Killing Curse, slowly walks up. Dumbledore gives him the paper, signaling he is now a champion. Harry is in a room with the other champions of the prestigious Triwizard Tournament. Dumbledore bursts in and grabs Harry, a gesture filled with urgency. Harry is silent. A woman, Rita Skeeter, the notorious journalist known for her sensational stories, appears in a puff of smoke. She's well-groomed and dressed colorfully. The four Triwizard champions are stood together in a group. She walks over to them and shakes each of their hands, eager to get a scoop. She takes Harry by the hand into a closet, likely for a private interview. An owl, often used for magical correspondence, flies in with a letter for Harry; he takes it and begins to read. The owl nips Harry's finger, a sign of impatience. The fire flares up a little, and the face of Sirius Black, Harry's godfather and a key figure in the fight against Voldemort, appears in it. Ron enters the room, looking conflicted. Ron leaves without a word. Harry goes to the fire again, but Sirius is gone, leaving Harry feeling alone. Neville, the brave and loyal friend, waves. Hermione and Ron walk up to them. Ron whispers some words to Hermione, reflecting the tension between him and Harry. It's clear Ron and Harry are not on speaking terms with each other, a rift caused by jealousy and pressure. Hermione walks up to Harry, trying to mediate the dispute. Harry and Hagrid, the beloved gamekeeper with a love for magical creatures, are walking through a dark forest. Hagrid is looking more dapper than usual and is carrying a big red flower, perhaps as a token for Madame Maxime. Madame Maxime calls out to Hagrid, signaling her presence. Harry does as he's told by Hagrid, always one to respect his advice. A huge flame fires up, possibly from one of Hagrid's magical creatures. We're zoomed in on a badge; it depicts Cedric on a bright yellow background, symbolizing his house, Hufflepuff, known for its values of loyalty and hard work. As Harry walks along, other pupils aim insults at him, saying he stinks, a backlash from the belief that he cheated to enter the tournament. A young boy runs past, caught up in the excitement. Harry gets to a doorway; two pupils stand in his way. They laugh, and Harry pushes his way through, determined to confront Cedric. He approaches Cedric, who is standing around with his friends, a sign of their strong camaraderie. Cedric's friends hurl off more insults, protective of their champion. Ron and Seamus are walking along, the tension between Ron and Harry still unresolved. Harry approaches them, seeking reconciliation. Draco Malfoy calls out, he's sitting up a tree, ever the instigator. Harry walks away, and Draco angrily tries casting a spell, his jealousy palpable. Mad-Eye Moody, the retired Auror famous for his dark wizard-catching prowess, appears and quickly turns Malfoy into a ferret. Mad-Eye is making the ferret hover around, using his well-known magical skills. He sends it up the trouser leg of one of Draco's friends. He squirms and looks uncomfortable, embarrassed by the situation. Everyone else is laughing, entertained by the spectacle. Mad-Eye winks to Harry, and he laughs, sharing the moment of levity. Eventually, it comes back out, and Professor McGonagall, the stern yet fair Transfiguration teacher, turns Draco back to normal. Draco runs away, disgraced. Mad-Eye shouts after him, never one to shy from making a point. Mad-Eye takes off his prosthetic leg, a testament to his battles, and takes a seat, ready to share more stories."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Fred you said They roll around fighting on the floor and the crowd cheers The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame He looks at Hermione and she smiles Dumbledore approaches the blue flame and it glows red Harry gets to a doorway A name comes out A name comes out Everyone looks on anxiously The owl nips Harry's finger Another name comes out The Durmstrang crowd cheers Another name comes out Draco calls out The Beauxbatons girls cheer as Fleur walks up Another name comes out Another name comes out Everyone looks on anxiously Hogwarts pupils cheer as Cedric takes the stage The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame People cheer but the goblet glows red once more and another name flies out MadEye takes off his prosthetic leg and takes a seat Dumbledore takes it and reads Harry slowly walks up Dumbledore gives him the paper Harry is in a room with the other champions Dumbledore bursts in and grabs Harry People cheer but the goblet glows red once more and another name flies out Harry is silent Ron and Seamus are walking along They laugh and Harry pushes his way through Eventually it comes back out and McGonagall turns Draco back to normal A woman appears in a puff of smoke She is wellgroomed and dressed colorfully The four Triwizard champions are stood together in a group She walks over to them and shakes each of their hands She takes Harry by the hand into a closet An owl flies in with a letter for Harry he takes it and begins to read Fred you said Dumbledore bursts in and grabs Harry The owl nips Harry's finger The fire flares up a little It is clear Everyone else is laughing a face appears in it Ron enters the room Ron leaves Harry goes to the fire again but Sirius is gone Neville waves Hermione and Ron walk up to them Ron whispers some words to Hermione It is clear He looks at Hermione and she smiles He approaches Cedric who is standing around with his friends Ron and Harry are not on speaking terms with each other Hermione walks up to Harry Harry and Hagrid are walking through a dark forest He sends it up the trouser leg of one of Draco's friends They roll around fighting on the floor and the crowd cheers Hagrid is looking more dapper than usual and is carrying a big red flower As Harry walks along other pupils aim insults at him saying he stinks Madame Maxime calls out to Hagrid Dumbledore gives him the paper Harry does as he is told A huge flame fires up Draco runs away We are zoomed in on a badge it depicts Cedric on a bright yellow background Harry slowly walks up As Harry walks along other pupils aim insults at him saying he stinks A young boy runs past Harry and Hagrid are walking through a dark forest Harry gets to a doorway two pupils stand in his way They laugh and Harry pushes his way through He approaches Cedric who is standing around with his friends Cedric's friends hurl off more insults Ron and Seamus are walking along Harry approaches them Draco calls out Dumbledore takes it and reads Ron and Harry are not on speaking terms with each other he is sitting up a tree The fire flares up a little Harry walks away and Draco angrily tries casting a spell MadEye appears and quickly turns Malfoy into a ferret MadEye is making the ferret hover around He sends it up the trouser leg of one of Draco's friends He squirms and looks uncomfortable a face appears in it Hagrid is looking more dapper than usual and is carrying a big red flower Everyone else is laughing Neville waves Hermione and Ron walk up to them MadEye winks to Harry and he laughs Eventually it comes back out and McGonagall turns Draco back to normal Draco runs away MadEye shouts after him MadEye takes off his prosthetic leg and takes a seat he is sitting up a tree"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Fred you said. They roll around fighting on the floor and the crowd cheers. The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame. He looks at Hermione and she smiles. Dumbledore approaches the blue flame and it glows red. A name comes out. Everyone looks on anxiously. The Durmstrang crowd cheers. Another name comes out. The Beauxbatons girls cheer as Fleur walks up. Another name comes out. Hogwarts pupils cheer as Cedric takes the stage. People cheer but the goblet glows red once more and another name flies out. Dumbledore takes it and reads. Harry slowly walks up. Dumbledore gives him the paper. Harry is in a room with the other champions. Dumbledore bursts in and grabs Harry. Harry is silent. A woman appears in a puff of smoke. She is wellgroomed and dressed colorfully. The four Triwizard champions are stood together in a group. She walks over to them and shakes each of their hands. She takes Harry by the hand into a closet. An owl flies in with a letter for Harry. he takes it and begins to read. The owl nips Harry's finger. The fire flares up a little. a face appears in it. Ron enters the room. Ron leaves. Harry goes to the fire again but Sirius is gone. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Neville waves Hermione and Ron walk up to them. Ron whispers some words to Hermione. It is clear. Ron and Harry are not on speaking terms with each other. Hermione walks up to Harry. Harry and Hagrid are walking through a dark forest. Hagrid is looking more dapper than usual and is carrying a big red flower. Madame Maxime calls out to Hagrid. Harry does as he is told. A huge flame fires up. We are zoomed in on a badge it depicts Cedric on a bright yellow background. As Harry walks along other pupils aim insults at him saying he stinks. A young boy runs past. Harry gets to a doorway. two pupils stand in his way. They laugh and Harry pushes his way through. He approaches Cedric who is standing around with his friends. Cedric's friends hurl off more insults. Ron and Seamus are walking along. Harry approaches them. Draco calls out. he is sitting up a tree. Harry walks away and Draco angrily tries casting a spell. MadEye appears and quickly turns Malfoy into a ferret. MadEye is making the ferret hover around. He sends it up the trouser leg of one of Draco's friends. He squirms and looks uncomfortable. Everyone else is laughing. MadEye winks to Harry and he laughs. Eventually it comes back out and McGonagall turns Draco back to normal. Draco runs away. MadEye shouts after him. MadEye takes off his prosthetic leg and takes a seat."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Fred you said. They roll around fighting on the floor and the crowd cheers. The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame. He looks at Hermione and she smiles. Dumbledore approaches the blue flame and it glows red. A name comes out. Everyone looks on anxiously. The Durmstrang crowd cheers. Another name comes out. The Beauxbatons girls cheer as Fleur walks up. Another name comes out. Hogwarts pupils cheer as Cedric takes the stage. People cheer but the goblet glows red once more and another name flies out. Dumbledore takes it and reads. Harry slowly walks up. Dumbledore gives him the paper. Harry is in a room with the other champions. Dumbledore bursts in and grabs Harry. Harry is silent. A woman appears in a puff of smoke. She is wellgroomed and dressed colorfully. The four Triwizard champions are stood together in a group. She walks over to them and shakes each of their hands. She takes Harry by the hand into a closet. An owl flies in with a letter for Harry. he takes it and begins to read. The owl nips Harry's finger. The fire flares up a little. a face appears in it. Ron enters the room. Ron leaves. Harry goes to the fire again but Sirius is gone. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Neville waves Hermione and Ron walk up to them. Ron whispers some words to Hermione. It is clear. Ron and Harry are not on speaking terms with each other. Hermione walks up to Harry. Harry and Hagrid are walking through a dark forest. Hagrid is looking more dapper than usual and is carrying a big red flower. Madame Maxime calls out to Hagrid. Harry does as he is told. A huge flame fires up. We are zoomed in on a badge it depicts Cedric on a bright yellow background. As Harry walks along other pupils aim insults at him saying he stinks. A young boy runs past. Harry gets to a doorway. two pupils stand in his way. They laugh and Harry pushes his way through. He approaches Cedric who is standing around with his friends. Cedric's friends hurl off more insults. Ron and Seamus are walking along. Harry approaches them. Draco calls out. he is sitting up a tree. Harry walks away and Draco angrily tries casting a spell. MadEye appears and quickly turns Malfoy into a ferret. MadEye is making the ferret hover around. He sends it up the trouser leg of one of Draco's friends. He squirms and looks uncomfortable. Everyone else is laughing. MadEye winks to Harry and he laughs. Eventually it comes back out and McGonagall turns Draco back to normal. Draco runs away. MadEye shouts after him. MadEye takes off his prosthetic leg and takes a seat."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Fred you said. They roll around fighting on the floor and the crowd cheers. The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame. He looks at Hermione and she smiles. Dumbledore approaches the blue flame and it glows red. A name comes out. Everyone looks on anxiously. The Durmstrang crowd cheers. Another name comes out. The Beauxbatons girls cheer as Fleur walks up. Another name comes out. Hogwarts pupils cheer as Cedric takes the stage. People cheer but the goblet glows red once more and another name flies out. Dumbledore takes it and reads. Harry slowly walks up. Dumbledore gives him the paper. He approaches Cedric who is standing around with his friends. Cedric's friends hurl off more insults. Ron and Seamus are walking along. Harry approaches them. Draco calls out. he is sitting up a tree. Harry walks away and Draco angrily tries casting a spell. MadEye appears and quickly turns Malfoy into a ferret. MadEye is making the ferret hover around. He sends it up the trouser leg of one of Draco's friends. He squirms and looks uncomfortable. Everyone else is laughing. MadEye winks to Harry and he laughs. Eventually it comes back out and McGonagall turns Draco back to normal. Draco runs away. MadEye shouts after him. MadEye takes off his prosthetic leg and takes a seat."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Fred you said. They roll around fighting on the floor and the crowd cheers. The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame. He looks at Hermione and she smiles. Dumbledore approaches the blue flame and it glows red. A name comes out. He squirms and looks uncomfortable. Everyone else is laughing. MadEye winks to Harry and he laughs. Eventually it comes back out and McGonagall turns Draco back to normal. Draco runs away. MadEye shouts after him. MadEye takes off his prosthetic leg and takes a seat."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Alice you said. They roll around fighting on the floor, and the crowd cheers. The room suddenly becomes silent as a dragon walks in and puts its name in the flame. It looks at Luna, and she smiles. Gandalf approaches the blue flame, and it glows red. A name comes out. Everyone looks on anxiously. The Rivendell crowd cheers. Another name comes out. The Shire hobbits cheer as Bilbo walks up. Another name comes out. Narnia pupils cheer as Aslan takes the stage. People cheer, but the goblet glows red once more, and another name flies out. Gandalf takes it and reads. Frodo slowly walks up. Gandalf gives him the paper. Frodo is in a room with the other champions. Gandalf bursts in and grabs Frodo. Frodo is silent. A penguin appears in a puff of smoke. It's well-groomed and dressed colorfully. The four Triwizard champions are stood together in a group. It walks over to them and shakes each of their hands. It takes Frodo by the hand into a closet. A parrot flies in with a letter for Frodo; he takes it and begins to read. The parrot nips Frodo's finger. The fire flares up a little, a face appears in it. Legolas enters the room. Legolas leaves. Frodo goes to the fire again, but Aragorn is gone. Gollum waves. Luna and Draco walk up to them. Draco whispers some words to Luna. It's clear Draco and Frodo are not on speaking terms with each other. Luna walks up to Frodo. Frodo and Aragorn are walking through a dark forest. Aragorn is looking more dapper than usual and is carrying a big red flower. Galadriel calls out to Aragorn. Frodo does as he's told. A huge flame fires up. We're zoomed in on a badge; it depicts Aslan on a bright yellow background. As Frodo walks along, other pupils aim insults at him, saying he stinks. A young elf runs past. Frodo gets to a doorway; two griffins stand in his way. They laugh, and Frodo pushes his way through. He approaches Aslan, who is standing around with his friends. Aslan's friends hurl off more insults. Legolas and Gimli are walking along. Frodo approaches them. Smaug calls out, he's sitting up a tree. Frodo walks away, and Smaug angrily tries casting a spell. Saruman appears and quickly turns Smaug into a ferret. Saruman is making the ferret hover around. He sends it up the trouser leg of one of Smaug's friends. He squirms and looks uncomfortable. Everyone else is laughing. Saruman winks to Frodo, and he laughs. Eventually, it comes back out, and Galadriel turns Smaug back to normal. Smaug runs away. Saruman shouts after him. Saruman takes off his prosthetic leg and takes a seat."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Fred you said. They roll around grappling on the carpet, and the spectators shout. The hallway suddenly becomes silent as Viktor Krum walks in and puts his name in the cauldron. He looks at Hermione, and she beams. Dumbledore approaches the green cauldron, and it glows violet. A scroll comes out. Everyone watches anxiously. The Durmstrang crowd applauds. Another scroll emerges. The Beauxbatons girls applaud as Fleur strides forward. Another scroll appears. Hogwarts students applaud as Cedric steps forward. People cheer, but the cauldron glows violet once more, and another scroll flies out. Dumbledore catches it and reads. Harry slowly steps up. Dumbledore hands him the parchment. Harry is in a chamber with the other contestants. Dumbledore bursts in and seizes Harry. Harry remains quiet. A woman materializes in a cloud of glitter. She's well-groomed and dressed vibrantly. The four Triwizard contestants stand together in a cluster. She approaches them and shakes each of their hands. She leads Harry by the hand into a cupboard. A raven flies in with a note for Harry; he takes it and starts to read. The raven pecks Harry's finger. The candle flares up briefly, a face appears in it. Ron enters the chamber. Ron departs. Harry goes to the candle again, but Sirius is gone. Neville waves. Hermione and Ron approach them. Ron murmurs some words to Hermione. It's evident Ron and Harry are not on speaking terms with each other. Hermione approaches Harry. Harry and Hagrid are walking through a dense jungle. Hagrid is looking more refined than usual and is carrying a large blue mushroom. Madame Maxime calls out to Hagrid. Harry follows instructions. A tremendous bonfire ignites. We're focused on a patch; it depicts Cedric on a bright green background. As Harry strolls along, other students hurl insults at him, saying he reeks. A young girl scurries past. Harry reaches a gateway; two students block his path. They chuckle, and Harry forces his way through. He approaches Cedric, who is standing around with his companions. Cedric's companions throw additional insults. Ron and Seamus are strolling along. Harry approaches them. Draco calls out, he's tucked up a branch. Harry walks away, and Draco angrily attempts casting a hex. Mad-Eye appears and swiftly transforms Malfoy into a hamster. Mad-Eye is making the hamster hover around. He sends it up the sleeve of one of Draco's companions. He wriggles and appears uncomfortable. Everyone else is laughing. Mad-Eye winks to Harry, and he chuckles. Eventually, it comes back out, and McGonagall turns Draco back to normal. Draco flees. Mad-Eye shouts after him. Mad-Eye removes his prosthetic eye and takes a seat."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Fred you said. They tumble around giggling on the floor, and the crowd claps. The room suddenly becomes noisy as Viktor Krum dances in and drops his name in the flame. He glances at Hermione, and she waves. Dumbledore strolls to the blue flame, and it changes green. A name pops out. Everyone watches on curiously. The Durmstrang crowd laughs. Another name appears. The Beauxbatons girls clap as Fleur dances up. Another name floats out. Hogwarts pupils laugh as Cedric hops onto the stage. People clap, but the goblet changes green once more, and another name drifts out. Dumbledore snatches it and announces. Harry slowly tiptoes up. Dumbledore hands him the paper. Harry is in a room with the other champions. Dumbledore rushes in and nudges Harry. Harry is quiet. A woman arrives in a swirl of mist. She's polished and dressed vibrantly. The four Triwizard champions are lined up together in a group. She strides over to them and bows to each of them. She leads Harry by the hand into a closet. An owl swoops in with a letter for Harry; he grabs it and starts to skim. The owl pecks Harry's hand. The fire flickers a little, a face emerges in it. Ron bursts into the room. Ron exits. Harry returns to the fire again, but Sirius is missing. Neville gestures. Hermione and Ron stroll up to them. Ron mutters some words to Hermione. It's evident Ron and Harry are ignoring each other. Hermione nears Harry. Harry and Hagrid are wandering through a dim forest. Hagrid is looking more stylish than usual and is holding a large red bouquet. Madame Maxime calls out to Hagrid. Harry complies. A huge spark ignites. We're zoomed in on a badge; it shows Cedric on a bright yellow background. As Harry strides along, other pupils direct taunts at him, calling him obnoxious. A young boy dashes past. Harry arrives at a doorway; two pupils block his path. They chuckle, and Harry sneaks his way through. He approaches Cedric, who is lingering around with his friends. Cedric's friends shout off more taunts. Ron and Seamus are strolling along. Harry nears them. Draco calls out, he's perched up a tree. Harry wanders away, and Draco angrily tries waving a wand. Mad-Eye appears and promptly turns Malfoy into a rabbit. Mad-Eye is making the rabbit skip around. He sends it rolling up the trouser leg of one of Draco's friends. He wriggles and appears uncomfortable. Everyone else is giggling. Mad-Eye nods to Harry, and he chuckles. Eventually, it hops back out, and McGonagall changes Draco back to normal. Draco darts away. Mad-Eye calls after him. Mad-Eye removes his hat and takes a seat."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Steve you mentioned. They bounce around wrestling on the carpet, and the stadium applauds. The hall suddenly becomes still as Nikita Korsakov strides in and places his signature in the vortex. He glances at Penelope, and she grins. Archibald steps up to the orange vortex, and it shines purple. An alias emerges. Everyone observes intently. The Salem Institute crowd applauds. Another alias emerges. The Birchwood girls clap as Jasmine strides forward. Another alias emerges. Cougars students clap as Ian steps onto the platform. Bystanders applaud, but the chalice lights up purple once more, and another alias shoots out. Archibald grabs it and announces. Oliver slowly steps forward. Archibald hands him the parchment. Oliver finds himself in a chamber with the other contenders. Archibald storms in and seizes Oliver. Oliver is mute. A gentleman appears in a plume of mist. He's sharply dressed and vibrantly adorned. The four Intercontinental finalists are gathered together in a cluster. He strides over to them and greets each with a handshake. He takes Oliver by the hand into a pantry. A raven swoops in with a parcel for Oliver; he accepts it and starts to peruse. The raven pecks Oliver's thumb. The hearth blazes slightly, a visage materializes in it. Louise enters the chamber. Louise departs. Oliver returns to the hearth again, but Simon has vanished. Ethan gestures. Penelope and Louise approach them. Louise murmurs some phrases to Penelope. It's evident Louise and Oliver are not conversing with each other. Penelope approaches Oliver. Oliver and Walter are wandering through a dim canopy. Walter is appearing more spruced up than usual and bearing a large blue blossom. Madame Tremblay hollers out to Walter. Oliver complies. An enormous blaze ignites. We're focused on a button; it illustrates Ian on a vivid green backdrop. As Oliver strolls onward, other students cast taunts at him, claiming he reeks. A juvenile girl darts by. Oliver reaches an archway; two students block his path. They chuckle, and Oliver forces his passage through. He confronts Ian, who is lingering with his companions. Ian's companions fling more jeers. Louise and Jasper are strolling alongside. Oliver confronts them. Augustus calls out, he's perched in a shrub. Oliver departs, and Augustus irately attempts chanting an incantation. Crazy-Eye materializes and swiftly transforms Augustus into a vole. Crazy-Eye is making the vole float about. He directs it up the pant leg of one of Augustus's companions. The companion wiggles and appears uneasy. Everyone else is chortling. Crazy-Eye winks at Oliver, and he chuckles. Eventually, it retreats, and Ms. Goodall converts Augustus back to human. Augustus dashes away. Crazy-Eye hollers after him. Crazy-Eye removes his artificial arm and takes a perch."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Michael you mentioned. They tumble around laughing on the floor, and the audience applauds. The hall suddenly becomes still as Luna Lovegood dances in and places her book in the cauldron. She gazes at Neville, and he chuckles. Snape approaches the red cauldron, and it turns green. A word appears. Everyone stares on eagerly. The Ravenclaw audience applauds. Another word appears. The Hufflepuff boys applaud as Cho skips up. Yet another word appears. Slytherin students applaud as Draco takes the platform. People applaud, but the cauldron turns green once more, and another word shoots out. Snape catches it and announces. Ron slowly shuffles up. Snape hands him the scroll. Ron is in a tent with the other participants. Snape storms in and snatches Ron. Ron is quiet. A man emerges in a burst of glitter. He's impeccably styled and dressed vibrantly. The four Goblet champions are standing together in a circle. He strides over to them and pats each of their shoulders. He leads Ron by the elbow into a pantry. A cat struts in with a scroll for Ron; he takes it and starts to study it. The cat swats Ron's hand. The cauldron flickers a bit, a silhouette materializes in it. Ginny enters the tent. Ginny exits. Ron moves to the cauldron again, but Remus is gone. Luna waves. Neville and Ginny stroll up to them. Ginny murmurs a few phrases to Neville. It's evident Neville and Ron are not on cordial terms with each other. Neville walks up to Ron. Ron and Firenze are wandering through a bright meadow. Firenze is looking more jovial than usual and is holding a massive blue flower. Professor Sprout calls out to Firenze. Ron goes along as instructed. A giant spark ignites. We're zoomed in on a pin; it depicts Draco on a dark blue background. As Ron strolls along, fellow students shout praises at him, saying he shines. A young girl dashes past. Ron reaches an archway; two students block his path. They snicker, and Ron forces his way past. He nears Cho, who is lounging around with her companions. Cho's companions toss off more praises. Ginny and Luna are strolling along. Ron heads towards them. Neville calls out, he's perched on a rock. Ron turns away, and Neville furiously attempts casting a jinx. Snape appears and instantly transforms Longbottom into a rabbit. Snape is making the rabbit bounce around. He sends it up the coat sleeve of one of Neville's companions. He shudders and looks uneasy. Everyone else is grinning. Snape nods to Ron, and he chuckles. Eventually, it hops back out, and Flitwick transforms Longbottom back to his usual self. Neville flees. Snape calls after him. Snape removes his cloak and leans against a tree."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Fred you said. They tumble around swimming on the carpet, and the crowd applauds. The hall suddenly becomes loud as Viktor Krum strolls in and places his book in the fireplace. He glances at Hermione, and she waves. Dumbledore approaches the green candle, and it shines orange. A ticket floats out. Everyone peers on eagerly. The Durmstrang crowd applauds. Another ticket floats out. The Beauxbatons girls clap as Fleur skips up. Another ticket floats out. Hogwarts pupils clap as Cedric takes the spotlight. People clap, but the candle shines orange once more, and another ticket drifts out. Dumbledore catches it and whispers. Harry slowly skips up. Dumbledore hands him the scroll. Harry is in a library with the other champions. Dumbledore storms in and picks Harry up. Harry is quiet. A woman materializes in a swirl of mist. She's elegantly dressed and wearing pastels. The four Triwizard champions are gathered together in a circle. She strides over to them and twists each of their ears. She takes Harry by the ear into a cupboard. A bat flutters in with a package for Harry; he grabs it and starts to write. The bat pecks Harry's toe. The candle flickers a little, a portrait appears in it. Ron jumps into the library. Ron exits. Harry returns to the candle again, but Sirius is absent. Neville salutes. Hermione and Ron skip over to them. Ron mutters some sentences to Hermione. It's apparent Ron and Harry are feuding. Hermione skips up to Harry. Harry and Hagrid are wandering through a bright meadow. Hagrid is appearing more radiant than usual and is holding a big blue umbrella. Madame Maxime calls over to Hagrid. Harry does as he's instructed. A huge water spout erupts. We're zoomed in on a painting; it features Cedric on a bright green background. As Harry skips along, other pupils throw compliments at him, saying he excels. A young girl gallops past. Harry reaches a window; two pupils block his path. They chuckle, and Harry slides his way through. He nears Cedric, who is lounging around with his friends. Cedric's friends toss off more compliments. Ron and Seamus are skipping along. Harry nears them. Draco yells out, he's hanging from a kite. Harry skips away, and Draco furiously tries flinging a ball. Mad-Eye appears and swiftly turns Malfoy into a rabbit. Mad-Eye is making the rabbit hop around. He sends it up the sleeve of one of Draco's friends. He giggles and looks pleased. Everyone else is dancing. Mad-Eye bows to Harry, and he laughs. Eventually, it hops back out, and McGonagall changes Draco back to normal. Draco skips away. Mad-Eye calls after him. Mad-Eye takes off his prosthetic arm and takes a nap."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "George you muttered. They tumble through juggling on the stage, and the assembly giggles. The garden suddenly becomes noisy as Captain Hook waltzes in and tosses his breadstick in the fountain. He glares at Luna, and she frowns. Gandalf wanders near the violet waterfall, and it shimmers orange. A recipe pops out. Everyone gapes eagerly. The Rivendell assembly giggles. Another recipe pops out. The Andorian folks snicker as Gollum skips forward. Another recipe pops out. Middle-earth residents snicker as Legolas takes the microphone. The crowd giggles, but the cauldron shimmers orange once again, and another recipe soars out. Gandalf catches it and dances. Bilbo slowly skips forward. Gandalf hands him the scroll. Bilbo is in a garden with the other contenders. Gandalf flutters in and bites Bilbo. Bilbo is silent. A dancer appears in a gust of bubbles. She's stylish and adorned brightly. The four talent show contenders are gathered in a cluster. She skips over to them and bows to each of their hats. She takes Bilbo by the wrist into a tent. A parrot flutters in with a postcard for Bilbo; he grabs it and starts to sketch. The parrot nips Bilbo's nose. The fountain flickers slightly, a hat appears in it. Hermione enters the garden. Hermione departs. Bilbo skips to the fountain again, but Frodo is missing. Sam waves. Luna and Hermione stroll up to them. Hermione murmurs some lyrics to Luna. It's evident Luna and Bilbo are not communicating with each other. Luna skips up to Bilbo. Bilbo and Aragorn are striding through a bright desert. Aragorn is looking more rugged than usual and is carrying a tiny blue umbrella. Tinker Bell yells out to Aragorn. Bilbo acts as he's informed. A small fountain spills up. We're zoomed out on a map; it portrays Legolas on a dull green foreground. As Bilbo skips along, other residents toss praises at him, saying he shines. A young girl dances past. Bilbo arrives at a bridge; two residents block his route. They chuckle, and Bilbo squeezes his route through. He skips to Legolas, who is lounging around with his siblings. Legolas's siblings hurl forth more praises. Luna and Pippin are skipping along. Bilbo skips to them. Gimli calls out, he's perched in a meadow. Bilbo skips away, and Gimli joyfully tries solving a puzzle. Robin Hood springs up and swiftly transforms Gimli into a rabbit. Robin Hood is making the rabbit glide around. He sends it up the sleeve of one of Gimli's siblings. He giggles and feels awkward. Everyone else is snickering. Robin Hood blinks to Bilbo, and he snickers. Eventually, it hops back out, and Galadriel transforms Gimli back to usual. Gimli skips away. Robin Hood hollers after him. Robin Hood removes his peg arm and hops on a hammock."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fred and another person are fighting on the floor as the crowd cheers. The room falls silent when Viktor Krum enters and submits his name to the Goblet of Fire, exchanging a smile with Hermione. Dumbledore approaches the Goblet, and it reveals names: Viktor, Fleur from Beauxbatons, Cedric from Hogwarts, and unexpectedly, Harry. The crowd reacts, and Harry joins the other champions. In a room, Dumbledore urgently takes Harry aside. A well-dressed woman greets the champions, taking Harry into a closet. An owl delivers a letter to Harry, which he reads as Ron enters and leaves the room, hinting at tension between them. While walking with Hagrid, Harry observes tensions and rivalries, including students mocking him. Harry approaches Cedric, facing more insults, and encounters Ron and Seamus. Draco taunts Harry from a tree, attempting a spell. Mad-Eye intervenes, turning Draco into a ferret and amusing the crowd before McGonagall restores him. Mad-Eye winks at Harry, and they share a laugh."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "MadEye takes off his prosthetic leg and takes a seat MadEye shouts after him Draco runs away Eventually it comes back out and McGonagall turns Draco back to normal MadEye winks to Harry and he laughs Everyone else is laughing He squirms and looks uncomfortable He sends it up the trouser leg of one of Draco's friends MadEye is making the ferret hover around MadEye appears and quickly turns Malfoy into a ferret Harry walks away and Draco angrily tries casting a spell he is sitting up a tree Draco calls out Harry approaches them Ron and Seamus are walking along Cedric's friends hurl off more insults He approaches Cedric who is standing around with his friends They laugh and Harry pushes his way through two pupils stand in his way Harry gets to a doorway A young boy runs past As Harry walks along other pupils aim insults at him saying he stinks We are zoomed in on a badge it depicts Cedric on a bright yellow background A huge flame fires up Harry does as he is told Madame Maxime calls out to Hagrid Hagrid is looking more dapper than usual and is carrying a big red flower Harry and Hagrid are walking through a dark forest Hermione walks up to Harry Ron and Harry are not on speaking terms with each other It is clear Ron whispers some words to Hermione Neville waves Hermione and Ron walk up to them Harry goes to the fire again but Sirius is gone Ron leaves Ron enters the room a face appears in it The fire flares up a little The owl nips Harry's finger he takes it and begins to read An owl flies in with a letter for Harry She takes Harry by the hand into a closet She walks over to them and shakes each of their hands The four Triwizard champions are stood together in a group She is wellgroomed and dressed colorfully A woman appears in a puff of smoke Harry is silent Dumbledore bursts in and grabs Harry Harry is in a room with the other champions Dumbledore gives him the paper Harry slowly walks up Dumbledore takes it and reads People cheer but the goblet glows red once more and another name flies out Hogwarts pupils cheer as Cedric takes the stage Another name comes out The Beauxbatons girls cheer as Fleur walks up Another name comes out The Durmstrang crowd cheers Everyone looks on anxiously A name comes out Dumbledore approaches the blue flame and it glows red He looks at Hermione and she smiles The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame They roll around fighting on the floor and the crowd cheers Fred you said"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A young boy runs past MadEye appears and quickly turns Malfoy into a ferret The Durmstrang crowd cheers She takes Harry by the hand into a closet two pupils stand in his way Madame Maxime calls out to Hagrid She is wellgroomed and dressed colorfully MadEye winks to Harry and he laughs Harry walks away and Draco angrily tries casting a spell The Beauxbatons girls cheer as Fleur walks up Ron enters the room Harry is silent A huge flame fires up Hermione walks up to Harry Harry is in a room with the other champions She walks over to them and shakes each of their hands Harry approaches them We are zoomed in on a badge it depicts Cedric on a bright yellow background Ron leaves A woman appears in a puff of smoke Harry goes to the fire again but Sirius is gone Hogwarts pupils cheer as Cedric takes the stage he takes it and begins to read Harry does as he is told Cedric's friends hurl off more insults MadEye shouts after him Ron whispers some words to Hermione An owl flies in with a letter for Harry MadEye is making the ferret hover around Dumbledore approaches the blue flame and it glows red He squirms and looks uncomfortable The four Triwizard champions are stood together in a group Ron and Seamus are walking along Another name comes out Fred you said Eventually it comes back out and McGonagall turns Draco back to normal a face appears in it Harry gets to a doorway The owl nips Harry's finger he is sitting up a tree People cheer but the goblet glows red once more and another name flies out Ron and Harry are not on speaking terms with each other He approaches Cedric who is standing around with his friends Hagrid is looking more dapper than usual and is carrying a big red flower Neville waves Hermione and Ron walk up to them Everyone else is laughing Dumbledore takes it and reads Draco calls out They roll around fighting on the floor and the crowd cheers The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame The fire flares up a little Harry and Hagrid are walking through a dark forest A name comes out It is clear He sends it up the trouser leg of one of Draco's friends As Harry walks along other pupils aim insults at him saying he stinks Everyone looks on anxiously Draco runs away Another name comes out MadEye takes off his prosthetic leg and takes a seat Dumbledore gives him the paper Dumbledore bursts in and grabs Harry They laugh and Harry pushes his way through He looks at Hermione and she smiles Harry slowly walks up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ron whispers some words to Hermione It is clear Ron and Harry are not on speaking terms with each other Hermione walks up to Harry Harry and Hagrid are walking through a dark forest Hagrid is looking more dapper than usual and is carrying a big red flower Madame Maxime calls out to Hagrid Harry does as he is told A huge flame fires up We are zoomed in on a badge it depicts Cedric on a bright yellow background As Harry walks along other pupils aim insults at him saying he stinks A young boy runs past Harry gets to a doorway two pupils stand in his way They laugh and Harry pushes his way through He approaches Cedric who is standing around with his friends Cedric's friends hurl off more insults Ron and Seamus are walking along Harry approaches them Draco calls out he is sitting up a tree Harry walks away and Draco angrily tries casting a spell MadEye appears and quickly turns Malfoy into a ferret MadEye is making the ferret hover around He sends it up the trouser leg of one of Draco's friends He squirms and looks uncomfortable Everyone else is laughing MadEye winks to Harry and he laughs Eventually it comes back out and McGonagall turns Draco back to normal Draco runs away MadEye shouts after him MadEye takes off his prosthetic leg and takes a seat Fred you said They roll around fighting on the floor and the crowd cheers The room suddenly becomes silent as Viktor Krum walks in and puts his name in the flame He looks at Hermione and she smiles Dumbledore approaches the blue flame and it glows red A name comes out Everyone looks on anxiously The Durmstrang crowd cheers Another name comes out The Beauxbatons girls cheer as Fleur walks up Another name comes out Hogwarts pupils cheer as Cedric takes the stage People cheer but the goblet glows red once more and another name flies out Dumbledore takes it and reads Harry slowly walks up Dumbledore gives him the paper Harry is in a room with the other champions Dumbledore bursts in and grabs Harry Harry is silent A woman appears in a puff of smoke She is wellgroomed and dressed colorfully The four Triwizard champions are stood together in a group She walks over to them and shakes each of their hands She takes Harry by the hand into a closet An owl flies in with a letter for Harry he takes it and begins to read The owl nips Harry's finger The fire flares up a little a face appears in it Ron enters the room Ron leaves Harry goes to the fire again but Sirius is gone Neville waves Hermione and Ron walk up to them"
        }
      ]
    }
  ]
}