{
  "ground_truth": "Gandhi is approaching with Nehru and Azad, with Pyarelal trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car, a Hindu youth with a black flag calls to him. They are all awed, timid even in his presence, and the mood of their gathering has changed altogether. Gandhi looks at the youth and the line of others, sweeping them sternly with his eyes, showing all his fatigue and strain. He lowers his head and moves on to the car, where Kallenbach holds the door for him, with Nehru, Azad, and Pyarelal following. As they get into the car, we see the car that sits by the two trucks that have brought the youths. In the back seat are two men, one of whom is Prakash. Jinnah is on the small balcony of an elaborate room, looking down in a slightly supercilious manner, impeccably dressed as usual. He has been looking at Gandhi, who sits on the floor of the large room some distance from him, just lifting his head from prayers. Nehru, Patel, and Azad are on the same side of the room as Gandhi. They rise from prayer as Jinnah comes down the steps to them. Gandhi hesitates, then begins, and Jinnah has drawn himself up, his vanity too great not to be touched by that prospect. He measures Gandhi to see that he is sincere, and when satisfied, turns slowly to Nehru, Patel, and Azad. Nehru glances at Patel, all taken by surprise by the offer and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth. Gandhi's eyes sag with despair, as if his last hope, his faith, has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground, Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly, and there's the roar of a tremendous crowd as India's flag is raised on the flagpole. On another platform, Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly, and there's the roar of a tremendous crowd as Pakistan's flag is raised. The little flagpole is empty, the rope dangling, flapping loosely down the pole. Gandhi sits on the porch of his bungalow, spinning, the hum of the spinning wheel audible. Inside, we can just see Mirabehn spinning too, but apart from that, he is alone; the whole ashram seems deserted.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandhi is nearing with Nehru and Azad, with Pyarelal trailing close behind. Azad and Pyarelal emerge on the veranda behind Nehru. As Gandhi approaches the vehicle, a Hindu youth with a dark banner calls to him. They are all awed, timid even in his presence, and the mood of their assembly has shifted completely. Gandhi gazes at the youth and the line of others, sweeping them sternly with his eyes, showing all his exhaustion and strain. He lowers his head and moves on to the vehicle, where Kallenbach holds the door for him, with Nehru, Azad, and Pyarelal following. As they get into the vehicle, we see the vehicle that rests by the two lorries that have brought the youths. In the rear seat are two men, one of whom is Prakash. Jinnah is on the small gallery of an ornate room, gazing down in a slightly condescending manner, impeccably dressed as always. He has been observing Gandhi, who sits on the floor of the spacious room some distance from him, just raising his head from prayers. Nehru, Patel, and Azad are on the same side of the room as Gandhi. They rise from prayer as Jinnah descends the steps to them. Gandhi hesitates, then begins, and Jinnah has drawn himself up, his pride too great not to be touched by that prospect. He measures Gandhi to see that he is genuine, and when convinced, turns slowly to Nehru, Patel, and Azad. Nehru glances at Patel, all taken by surprise by the offer and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth. Gandhi's eyes droop with despair, as if his last hope, his faith, has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground, Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly, and there's the roar of a tremendous throng as India's banner is hoisted on the flagpole. On another platform, Jinnah and a British representative are present as a band plays the new Pakistani National Anthem loudly, and there's the roar of a tremendous throng as Pakistan's banner is hoisted. The little flagpole is vacant, the rope dangling, flapping loosely down the pole. Gandhi sits on the porch of his bungalow, spinning, the hum of the spinning wheel audible. Inside, we can just see Mirabehn spinning too, but apart from that, he is alone; the whole ashram seems deserted."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandhi is being approached by Nehru and Azad, with Pyarelal trailing close behind them. Nehru is followed by Azad and Pyarelal as they come out on the porch. As the car is neared by Gandhi, he is called to by a Hindu youth with a black flag. They all are awed, timid even in his presence, and altogether the mood of their gathering is changed. The youth and the line of others are looked at by Gandhi, who sternly sweeps them with his eyes, all his fatigue and strain being shown. His head is lowered, and he moves on to the car, where the door is held for him by Kallenbach, with Nehru, Azad, and Pyarelal following him. As the car is entered by them, the car that sits by the two trucks which have brought the youths is seen by us. In the back seat are sitting two men, one of whom is Prakash. On the small balcony of an elaborate room, Jinnah looks down in a slightly supercilious manner, impeccably dressed as usual. Gandhi is being looked at by him, as he sits on the floor of the large room some distance from him, just lifting his head from prayers. On the same side of the room as Gandhi sit Nehru, Patel, and Azad. From prayer, they rise as Jinnah comes down the steps to them. Gandhi hesitates, then begins, and Jinnah draws himself up, his vanity too great not to be touched by that prospect. Gandhi is measured by him to see that he is sincere, and when satisfied, he slowly turns to Nehru, Patel, and Azad. Nehru glances at Patel, who is all taken by surprise by the offer and does not feel what Gandhi feels. Gandhi is looked at hesitantly by Nehru. It stamps the truth with undeniable authenticity. With despair, Gandhi's eyes sag, as if his last hope, his faith, has crumbled around him. Numbly, Gandhi stares at him. On a platform in the foreground, Mountbatten and Nehru are present as the Indian National Anthem is played loudly by a band, and as India's flag is raised on the flagpole, there's the roar of a tremendous crowd. On another platform, a British plenipotentiary and Jinnah are present as the new Pakistani National Anthem is played loudly by a band, and as Pakistan's flag is raised, there's the roar of a tremendous crowd. The little flagpole is empty, the rope flaps loosely down the pole, dangling. On the porch of his bungalow, Gandhi spins, the hum of the spinning wheel being audible. Inside, Mirabehn can just be seen spinning too, but apart from that, he is there alone; the whole ashram seems deserted."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandhi approaches with Nehru and Azad, followed closely by Pyarelal. Azad and Pyarelal step onto the porch behind Nehru. As Gandhi nears the car, a Hindu youth with a black flag calls out. Awed and timid, the group's mood shifts. Gandhi sternly surveys them, showing fatigue, then moves to the car, where Kallenbach holds the door, followed by Nehru, Azad, and Pyarelal. Nearby, a car and two trucks have brought the youths. In the back seat are two men, including Prakash. Jinnah, on a balcony, looks down superciliously, impeccably dressed. He watches Gandhi, who sits on the floor, lifting his head from prayers. Nehru, Patel, and Azad rise as Jinnah descends. Gandhi hesitates, begins, and Jinnah, touched by the prospect, assesses Gandhi's sincerity, then turns to Nehru, Patel, and Azad. Nehru, surprised by the offer, looks hesitantly at Gandhi, sensing undeniable truth. Gandhi's eyes show despair, his hope crumbling. On a platform, Mountbatten and Nehru are present as a band plays the Indian National Anthem, and a crowd roars as India's flag is raised. On another platform, Jinnah and a British plenipotentiary witness Pakistan's flag-raising. The little flagpole is empty, rope dangling. Gandhi sits on his bungalow porch, spinning, the wheel's hum audible. Inside, Mirabehn spins too, but the ashram seems deserted."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandhi approaches with Nehru and Azad, Pyarelal trailing. Azad and Pyarelal follow Nehru onto the porch. A Hindu youth with a black flag calls to Gandhi, who sternly surveys them, showing fatigue. He moves to the car, where Kallenbach holds the door, followed by Nehru, Azad, and Pyarelal. Nearby, a car and two trucks with youths are visible. In the back seat are two men, including Prakash. Jinnah, on a balcony, watches Gandhi, who sits on the floor after prayers. Nehru, Patel, and Azad rise as Jinnah approaches. Gandhi hesitates, then begins, and Jinnah, touched by the prospect, assesses Gandhi's sincerity before turning to Nehru, Patel, and Azad. Nehru, surprised, looks at Gandhi, whose eyes show despair. On a platform, Mountbatten and Nehru witness India's flag raised to the anthem and crowd's roar. On another platform, Jinnah and a British plenipotentiary witness Pakistan's flag raised similarly. An empty flagpole flaps loosely. Gandhi sits on his bungalow porch, spinning, with Mirabehn visible inside, but the ashram seems deserted."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandhi is steadily approaching with Nehru and Azad by his side, while Pyarelal follows closely behind them. Azad and Pyarelal make their way out onto the porch, trailing just behind Nehru. As Gandhi draws nearer to the waiting car, a young Hindu man holding a black flag calls out to him. The entire group is filled with awe, and they seem timid, almost reverent, in his presence, as the atmosphere of their gathering has shifted completely. Gandhi casts a stern gaze at the youth and the line of others, his eyes sweeping over them, revealing all the fatigue and strain he carries. He lowers his head and continues moving toward the car, where Kallenbach stands ready, holding the door open for him. Nehru, Azad, and Pyarelal follow closely behind. As they all get into the car, we notice the vehicle parked beside two trucks that have transported the youths. In the back seat of the car, there are two men, one of whom is identified as Prakash. Meanwhile, Jinnah stands on a small balcony of an elaborate room, looking down with a slightly supercilious expression, impeccably dressed as always. He has been observing Gandhi, who is seated on the floor of the large room some distance away, just lifting his head from prayer. Nehru, Patel, and Azad are positioned on the same side of the room as Gandhi. They rise from their prayer as Jinnah descends the steps toward them. Gandhi hesitates momentarily, then begins, and Jinnah draws himself up, his vanity too great not to be touched by the prospect. He measures Gandhi carefully to ensure his sincerity, and once satisfied, he turns slowly to Nehru, Patel, and Azad. Nehru exchanges a glance with Patel, all of them taken by surprise by the offer, not fully sharing Gandhi's feelings. Nehru looks hesitantly at Gandhi, recognizing the undeniable truth in the situation. Gandhi's eyes droop with despair, as if his last hope, his faith, has crumbled around him. He stares numbly at Jinnah. On a platform in the foreground, Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly, and the roar of a tremendous crowd fills the air as India's flag is raised high on the flagpole. On another platform, Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly, and the roar of a tremendous crowd echoes as Pakistan's flag is raised. The little flagpole stands empty, the rope dangling and flapping loosely down the pole. Gandhi sits quietly on the porch of his bungalow, spinning, with the hum of the spinning wheel audible in the background. Inside, we can just make out Mirabehn spinning as well, but apart from that, he is alone; the entire ashram seems deserted."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gandhi is gradually and steadily making his way forward, with Nehru and Azad walking closely by his side, while Pyarelal follows just a step or two behind them. Azad and Pyarelal then proceed out onto the porch, trailing just behind Nehru in a slightly staggered formation. As Gandhi approaches with purposeful steps toward the patiently waiting car, a young Hindu man, who is clutching a black flag, calls out to him in a bold manner. The entire assembly of people is filled with a sense of awe, and they seem almost timid, if not wholly reverent, in his commanding presence, for the atmosphere of their gathering has shifted dramatically. Gandhi casts a stern, unwavering gaze upon the youth and the line of others, his eyes sweeping over them deliberately, revealing all the fatigue and strain etched on his face. He lowers his head thoughtfully and continues moving toward the car, where Kallenbach stands prepared, holding the door open for him with readiness. Nehru, Azad, and Pyarelal follow closely behind him. As they all settle into the car, it becomes noticeable that the vehicle is parked beside two sizable trucks that have transported the enthusiastic youths. In the back seat of the car, there are two men, one of whom is specifically identified as Prakash. Meanwhile, Jinnah stands on a small, elevated balcony of an elaborate room, gazing down with a slightly supercilious expression, impeccably dressed with his usual attention to sartorial detail. He has been intently observing Gandhi, who is seated on the floor of the spacious room a bit of a distance away, just lifting his head from a moment of silent prayer. Nehru, Patel, and Azad are stationed on the same side of the room as Gandhi, sharing the same space. They rise from their prayer positions as Jinnah begins to descend the steps toward them. Gandhi hesitates briefly, then begins, and Jinnah draws himself up with a sense of dignity, his vanity too great not to be stirred by the prospect. He measures Gandhi with care to ensure the sincerity of his intentions, and once he is satisfied, he slowly turns to Nehru, Patel, and Azad. Nehru exchanges a significant glance with Patel, all of them taken aback by the suddenness of the offer, not fully sharing in Gandhi's feelings of the moment. Nehru looks hesitantly at Gandhi, recognizing the undeniable truth of the situation they find themselves in. Gandhi's eyes droop visibly with despair, as if his last hope and his faith have crumbled entirely around him. He stares numbly at Jinnah, who seems unfazed. On a platform in the immediate foreground, Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and proudly, and the roar of a tremendous crowd fills the air as India's flag is raised high on the flagpole with pride. On another platform, Jinnah and a British plenipotentiary are present as a band plays the newly composed Pakistani National Anthem loudly, and the roar of a tremendous crowd echoes as Pakistan's flag is raised alongside it. The little flagpole stands empty, with the rope dangling and flapping loosely down the pole, devoid of any flag. Gandhi sits quietly on the porch of his secluded bungalow, engaged in the meditative act of spinning, with the gentle hum of the spinning wheel audible in the background as a soothing constant. Inside, it is possible to just make out Mirabehn spinning as well, but aside from that, he is alone; the entire ashram seems deserted, bereft of its usual activity and liveliness."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandhi is steadily approaching with Nehru and Azad walking alongside him, while Pyarelal follows closely behind, maintaining a respectful distance. As they move forward, Azad and Pyarelal step out onto the porch, trailing behind Nehru, who leads the way. As Gandhi draws nearer to the car, a Hindu youth holding a black flag calls out to him, capturing his attention. The group surrounding Gandhi is visibly awed, their demeanor shifting to one of timidity in his presence, and the atmosphere of their gathering transforms entirely. Gandhi directs his gaze at the youth and the line of others, his eyes sweeping over them with a stern expression that reveals the fatigue and strain etched on his face. He then lowers his head, signaling his intent to move forward, and proceeds towards the car, where Kallenbach stands ready, holding the door open for him. Nehru, Azad, and Pyarelal follow closely behind, preparing to enter the vehicle. As they all settle into the car, the scene reveals another car parked beside two trucks, which have transported the youths to this location. In the back seat of this car, two men are seated, one of whom is identified as Prakash. Meanwhile, Jinnah stands on a small balcony of an ornate room, gazing down with a slightly supercilious expression, impeccably dressed as is his custom. His attention has been fixed on Gandhi, who is seated on the floor of a large room some distance away, just lifting his head from a moment of prayer. Nehru, Patel, and Azad are positioned on the same side of the room as Gandhi, and as Jinnah descends the steps towards them, they rise from their prayerful positions. Gandhi hesitates momentarily before beginning to speak, while Jinnah, with his vanity too great to ignore the situation, draws himself up, assessing Gandhi to determine the sincerity of his words. Once satisfied with Gandhi's earnestness, Jinnah turns slowly to face Nehru, Patel, and Azad. Nehru exchanges a glance with Patel, both caught off guard by the unexpected offer and not fully sharing in Gandhi's sentiments. Nehru then looks hesitantly at Gandhi, recognizing the undeniable truth in the situation. Gandhi's eyes reflect a deep despair, as if his last hope and faith have crumbled around him, leaving him to stare numbly at the unfolding events. On a platform in the foreground, Mountbatten and Nehru stand as a band plays the Indian National Anthem loudly, accompanied by the roar of a tremendous crowd as India's flag is ceremoniously raised on the flagpole. On another platform, Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly, with a similar roar from the crowd as Pakistan's flag is hoisted. Meanwhile, a little flagpole stands empty, its rope dangling and flapping loosely down the pole. In a quieter setting, Gandhi sits on the porch of his bungalow, engaged in spinning, the gentle hum of the spinning wheel audible in the background. Inside, Mirabehn can be seen spinning as well, but apart from her presence, Gandhi is alone, and the entire ashram appears deserted, adding to the sense of solitude."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandhi approaches with Nehru and Azad, followed closely by Pyarelal. As they reach the porch, a Hindu youth with a black flag calls out to Gandhi, whose presence alters the mood of the gathering. Gandhi, showing signs of fatigue, sternly surveys the youth and others before proceeding to the car, where Kallenbach holds the door for him. Nehru, Azad, and Pyarelal follow him into the car, parked beside two trucks that brought the youths. In the back seat are two men, including Prakash. Meanwhile, Jinnah observes from a balcony, dressed impeccably, as Gandhi, Nehru, Patel, and Azad conclude their prayers in a large room. Jinnah descends to join them, assessing Gandhi's sincerity before turning to Nehru, Patel, and Azad, who are surprised by Gandhi's offer. Nehru hesitantly looks at Gandhi, sensing the weight of truth in his words, while Gandhi's eyes reflect despair. On a platform, Mountbatten and Nehru witness the raising of India's flag to the sound of the national anthem and a cheering crowd. Simultaneously, Jinnah and a British plenipotentiary oversee the raising of Pakistan's flag amid similar fanfare. Later, Gandhi sits on his bungalow's porch, spinning, with the hum of the wheel audible, while Mirabehn spins inside, highlighting the ashram's solitude."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandhi is approaching with Nehru, the future first Prime Minister of independent India, and Azad, a prominent freedom fighter and educationist, with Pyarelal, Gandhi's close aide and biographer, trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car, a Hindu youth with a black flag, a symbol of protest, calls to him. They are all awed, timid even in his presence, and the mood of their gathering has changed altogether. Gandhi looks at the youth and the line of others, sweeping them sternly with his eyes, showing all his fatigue and strain from his relentless struggle for independence and peace. He lowers his head and moves on to the car, where Kallenbach, his friend and a devoted supporter of the Satyagraha movement, holds the door for him, with Nehru, Azad, and Pyarelal following. As they get into the car, we see the car that sits by the two trucks that have brought the youths, likely members of a political group. In the back seat are two men, one of whom is Prakash, a fictional character representing the young activists of the time. Jinnah, the leader of the Muslim League and a key figure in the partition of India, is on the small balcony of an elaborate room, looking down in a slightly supercilious manner, impeccably dressed as usual in his characteristic sherwani. He has been looking at Gandhi, who sits on the floor of the large room some distance from him, just lifting his head from prayers, a practice Gandhi often undertook for inner peace. Nehru, Patel, and Azad are on the same side of the room as Gandhi. They rise from prayer as Jinnah comes down the steps to them. Gandhi hesitates, then begins, and Jinnah has drawn himself up, his vanity too great not to be touched by that prospect. He measures Gandhi to see that he is sincere, and when satisfied, turns slowly to Nehru, Patel, and Azad. Nehru glances at Patel, the architect of India's political integration, all taken by surprise by the offer and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth, a moment steeped in historic significance. Gandhi's eyes sag with despair, as if his last hope, his faith in non-violence and unity, has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground, Mountbatten, the last Viceroy of India, and Nehru are present as a band plays the Indian National Anthem loudly, and there's the roar of a tremendous crowd as India's flag is raised on the flagpole, marking the birth of a new nation. On another platform, Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly, and there's the roar of a tremendous crowd as Pakistan's flag is raised, symbolizing the partition. The little flagpole is empty, the rope dangling, flapping loosely down the pole, a poignant reminder of change and loss. Gandhi sits on the porch of his bungalow, spinning, the hum of the spinning wheel audible, a symbol of self-reliance and simplicity. Inside, we can just see Mirabehn, Gandhi’s devoted British disciple, spinning too, but apart from that, he is alone; the whole ashram seems deserted, a silent testament to the turbulent times."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind  Azad and Pyarelal come out on the porch behind Nehru  As Gandhi nears the car a Hindu youth with a black flag calls to him  Nehru Patel and Azad are on the same side of the room as Gandhi  They rise from prayer as Jinnah comes down the steps to them  Gandhi hesitates  then begins and Jinnah has drawn himself up his vanity too great not to be touched by that prospect  He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad  Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels  Nehru looks hesitantly at Gandhi  It bears the stamp of undeniable truth  Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him  Gandhi stares numbly at him  On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there's the roar of a tremendous crowd as India's flag is raised on the flagpole  On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there's the roar of a tremendous crowd as Pakistan's flag is raised  The little flagpole is empty  the rope dangling flapping loosely down the pole  They are all awed timid even in his presence and the mood of their gathering has changed altogether  Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain  He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following  As they get into the car we see the car that sits by the two trucks that have brought the youths  In the back seat are two men one of whom is Prakash  Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual  He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers  Nehru Patel and Azad are on the same side of the room as Gandhi  They rise from prayer as Jinnah comes down the steps to them  Gandhi hesitates  then begins and Jinnah has drawn himself up his vanity too great not to be touched by that prospect  He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad  Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels  Nehru looks hesitantly at Gandhi  It bears the stamp of undeniable truth  Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him  Gandhi stares numbly at him  On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there's the roar of a tremendous crowd as India's flag is raised on the flagpole  On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there's the roar of a tremendous crowd as Pakistan's flag is raised  The little flagpole is empty  the rope dangling flapping loosely down the pole  Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible  Inside we can just see Mirabehn spinning too but apart from that he is alone  the whole ashram seems deserted"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car a Hindu youth with a black flag calls to him. They are all awed timid even in his presence and the mood of their gathering has changed altogether. Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain. He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following. As they get into the car we see the car that sits by the two trucks that have brought the youths. In the back seat are two men one of whom is Prakash. Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual. He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers. Nehru Patel and Azad are on the same side of the room as Gandhi. They rise from prayer as Jinnah comes down the steps to them. Gandhi hesitates. then begins. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. and Jinnah has drawn himself up his vanity too great not to be touched by that prospect. He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad. Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth. Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there is the roar of a tremendous crowd as India's flag is raised on the flagpole. On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there is the roar of a tremendous crowd as Pakistan's flag is raised. The little flagpole is empty. the rope dangling flapping loosely down the pole. Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible. Inside we can just see Mirabehn spinning too but apart from that he is alone. the whole ashram seems deserted."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car a Hindu youth with a black flag calls to him. They are all awed timid even in his presence and the mood of their gathering has changed altogether. Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain. He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following. As they get into the car we see the car that sits by the two trucks that have brought the youths. In the back seat are two men one of whom is Prakash. Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual. He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers. Nehru Patel and Azad are on the same side of the room as Gandhi. They rise from prayer as Jinnah comes down the steps to them. Gandhi hesitates. then begins. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. and Jinnah has drawn himself up his vanity too great not to be touched by that prospect. He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad. Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth. Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there is the roar of a tremendous crowd as India's flag is raised on the flagpole. On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there is the roar of a tremendous crowd as Pakistan's flag is raised. The little flagpole is empty. the rope dangling flapping loosely down the pole. Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible. Inside we can just see Mirabehn spinning too but apart from that he is alone. the whole ashram seems deserted."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car a Hindu youth with a black flag calls to him. They are all awed timid even in his presence and the mood of their gathering has changed altogether. Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain. He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following. As they get into the car we see the car that sits by the two trucks that have brought the youths. On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there is the roar of a tremendous crowd as India's flag is raised on the flagpole. On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there is the roar of a tremendous crowd as Pakistan's flag is raised. The little flagpole is empty. the rope dangling flapping loosely down the pole. Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible. Inside we can just see Mirabehn spinning too but apart from that he is alone. the whole ashram seems deserted."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind. Azad and Pyarelal come out on the porch behind Nehru. As Gandhi nears the car a Hindu youth with a black flag calls to him. Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible. Inside we can just see Mirabehn spinning too but apart from that he is alone. the whole ashram seems deserted."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A tiger is approaching with a zebra and a parrot, with a dolphin trailing close behind. The parrot and the dolphin come out on the porch behind the zebra. As the tiger nears the car, an elephant youth with a black flag calls to him. They are all awed, timid even in the tiger's presence, and the mood of their gathering has changed altogether. The tiger looks at the youth and the line of others, sweeping them sternly with his eyes, showing all his fatigue and strain. He lowers his head and moves on to the car, where a kangaroo holds the door for him, with the zebra, the parrot, and the dolphin following. As they get into the car, we see the car that sits by the two trucks that have brought the youths. In the back seat are two men, one of whom is a giraffe. A panda is on the small balcony of an elaborate room, looking down in a slightly supercilious manner, impeccably dressed as usual. The panda has been looking at the tiger, who sits on the floor of the large room some distance from the panda, just lifting his head from prayers. The zebra, a penguin, and the parrot are on the same side of the room as the tiger. They rise from prayer as the panda comes down the steps to them. The tiger hesitates, then begins, and the panda has drawn himself up, his vanity too great not to be touched by that prospect. The panda measures the tiger to see that he is sincere, and when satisfied, turns slowly to the zebra, the penguin, and the parrot. The zebra glances at the penguin, all taken by surprise by the offer and not feeling what the tiger feels. The zebra looks hesitantly at the tiger. It bears the stamp of undeniable truth. The tiger's eyes sag with despair, as if his last hope, his faith, has crumbled around him. The tiger stares numbly at the panda. On a platform in the foreground, a peacock and the zebra are present as a band plays the Indian National Anthem loudly, and there's the roar of a tremendous crowd as India's flag is raised on the flagpole. On another platform, the panda and a British flamingo are present as a band plays the new Pakistani National Anthem loudly, and there's the roar of a tremendous crowd as Pakistan's flag is raised. The little flagpole is empty, the rope dangling, flapping loosely down the pole. The tiger sits on the porch of his bungalow, spinning, the hum of the spinning wheel audible. Inside, we can just see a swan spinning too, but apart from that, he is alone; the whole ashram seems deserted."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gandhi is approaching with Nehru and Azad, with Pyarelal trailing close behind. Azad and Pyarelal come out on the deck behind Nehru. As Gandhi nears the bicycle, a Hindu youth with a red kite calls to him. They are all awed, timid even in his presence, and the mood of their gathering has changed altogether. Gandhi looks at the youth and the row of others, sweeping them sternly with his eyes, showing all his fatigue and strain. He lowers his head and moves on to the bicycle, where Kallenbach holds the handlebars for him, with Nehru, Azad, and Pyarelal following. As they get onto the bicycle, we see the bicycle that sits by the two wagons that have brought the youths. In the sidecar are two men, one of whom is Prakash. Jinnah is on the small veranda of an elaborate garden, looking down in a slightly supercilious manner, impeccably dressed as usual. He has been looking at Gandhi, who sits on the ground of the large patio some distance from him, just lifting his head from meditation. Nehru, Patel, and Azad are on the same side of the patio as Gandhi. They rise from meditation as Jinnah comes down the ladder to them. Gandhi hesitates, then begins, and Jinnah has drawn himself up, his vanity too great not to be touched by that prospect. He measures Gandhi to see that he is sincere, and when satisfied, turns slowly to Nehru, Patel, and Azad. Nehru glances at Patel, all taken by surprise by the proposal and not feeling what Gandhi feels. Nehru looks hesitantly at Gandhi. It bears the stamp of undeniable truth. Gandhi's eyes sag with despair, as if his last hope, his faith, has crumbled around him. Gandhi stares numbly at him. On a platform in the foreground, Mountbatten and Nehru are present as a choir sings the Indian National Anthem loudly, and there's the roar of a tremendous crowd as India's banner is raised on the mast. On another platform, Jinnah and a British ambassador are present as a choir sings the new Pakistani National Anthem loudly, and there's the roar of a tremendous crowd as Pakistan's banner is raised. The little mast is empty, the rope dangling, flapping loosely down the pole. Gandhi sits on the bench of his villa, weaving, the hum of the loom audible. Inside, we can just see Mirabehn weaving too, but apart from that, he is alone; the whole compound seems deserted."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gandhi is skipping with Nehru and Azad, with Pyarelal dancing close behind. Azad and Pyarelal leap out on the porch behind Nehru. As Gandhi approaches the car, a Hindu youth with a black flag whispers to him. They are all bewildered, nervous even in his presence, and the mood of their gathering has shifted altogether. Gandhi gazes at the youth and the line of others, scanning them gently with his eyes, revealing all his exhaustion and burden. He raises his head and glides on to the car, where Kallenbach shuts the door for him, with Nehru, Azad, and Pyarelal trailing. As they settle into the car, we observe the car that idles by the two trucks that have brought the youths. In the back seat are two men, one of whom is Prakash. Jinnah is on the small balcony of an ornate room, peering down in a slightly amused manner, impeccably dressed as usual. He has been watching Gandhi, who stands on the floor of the large room some distance from him, just lowering his head from prayers. Nehru, Patel, and Azad are on the same side of the room as Gandhi. They sit down from prayer as Jinnah ascends the steps to them. Gandhi pauses, then whispers, and Jinnah has shrunk himself down, his vanity too great not to be amused by that prospect. He weighs Gandhi to see that he is genuine, and when convinced, turns quickly to Nehru, Patel, and Azad. Nehru nods at Patel, all amazed by the offer and not feeling what Gandhi senses. Nehru looks boldly at Gandhi. It carries the mark of undeniable honesty. Gandhi's eyes beam with delight, as if his last hope, his faith, has grown around him. Gandhi gazes joyfully at him. On a platform in the foreground, Mountbatten and Nehru are resting as a band hums the Indian National Anthem quietly, and there's the whisper of a tremendous crowd as India's flag is lowered on the flagpole. On another platform, Jinnah and a British plenipotentiary are seated as a band whispers the new Pakistani National Anthem softly, and there's the murmur of a tremendous crowd as Pakistan's flag is lowered. The little flagpole is filled, the rope taut, flapping firmly down the pole. Gandhi stands on the porch of his bungalow, weaving, the hum of the weaving wheel audible. Inside, we can just see Mirabehn weaving too, but apart from that, he is surrounded; the whole ashram seems bustling."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A giraffe is approaching with an elephant and a bear, with a rabbit trailing close behind. The bear and the rabbit come out on the balcony behind the elephant. As the giraffe nears the bicycle, a tiger cub with a red kite calls to it. They are all awed, timid even in its presence, and the mood of their gathering has changed altogether. The giraffe looks at the cub and the line of others, sweeping them sternly with its eyes, showing all its fatigue and strain. It lowers its head and moves on to the bicycle, where a penguin holds the door for it, with the elephant, bear, and rabbit following. As they get into the bicycle, we see the bicycle that sits by the three sleds that have brought the cubs. In the back seat are two cats, one of whom is a parrot. A squirrel is on the small veranda of a dilapidated cabin, looking down in a slightly supercilious manner, impeccably dressed as usual. It has been looking at the giraffe, who sits on the floor of the narrow corridor some distance from it, just lifting its head from nodding off. The elephant, a koala, and the bear are on the same side of the corridor as the giraffe. They rise from napping as the squirrel comes down the hill to them. The giraffe hesitates, then begins, and the squirrel has drawn itself up, its vanity too great not to be touched by that prospect. It measures the giraffe to see that it is sincere, and when satisfied, turns slowly to the elephant, koala, and the bear. The elephant glances at the koala, all taken by surprise by the offer and not feeling what the giraffe feels. The elephant looks hesitantly at the giraffe. It bears the stamp of undeniable mystery. The giraffe's eyes sag with exhaustion, as if its last hope, its patience, has crumbled around it. The giraffe stares numbly at it. On a platform in the clearing, a horse and the elephant are present as a band plays the Martian Anthem loudly, and there's the roar of a tremendous audience as Neptune’s symbol is raised on the lamppost. On another platform, the squirrel and an American ambassador are present as a band plays the new Venusian Anthem loudly, and there's the roar of a tremendous audience as Venus’s symbol is raised. The tiny lamppost is empty, the rope dangling, flapping loosely down the post. The giraffe sits on the veranda of its cabin, reading, the hum of the fan audible. Inside, we can just see a hamster reading too, but apart from that, it is alone; the entire forest seems deserted."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tesla is departing with Edison and Bell, with Curie trailing close behind. Bell and Curie stroll onto the porch behind Edison. As Tesla approaches the boat, a Viking youth with a red flag shouts to him. They are all mesmerized, cautious even in his presence, and the mood of their gathering has shifted entirely. Tesla glances at the youth and the line of others, scanning them sharply with his eyes, exhibiting all his exhaustion and weariness. He tilts his head and walks on to the boat, where Einstein holds the door for him, with Edison, Bell, and Curie trailing. As they step onto the boat, we see the boat that rests beside the two carriages that have transported the youths. In the back seat are two women, one of whom is Marie. Churchill is on the small veranda of an extravagant chamber, gazing down in a slightly disdainful manner, flawlessly dressed as usual. He has been observing Tesla, who stands on the floor of the expansive room some distance from him, just raising his head from meditation. Edison, Newton, and Bell are on the same side of the room as Tesla. They rise from meditation as Churchill comes up the steps to them. Tesla hesitates, then speaks, and Churchill has straightened himself up, his pride too immense not to be intrigued by that possibility. He evaluates Tesla to ensure he is genuine, and when assured, turns slowly to Edison, Newton, and Bell. Edison glances at Newton, all caught off guard by the proposal and not perceiving what Tesla perceives. Edison looks uncertainly at Tesla. It bears the imprint of undeniable fact. Tesla's eyes droop with despondency, as if his final hope, his conviction, has shattered around him. Tesla gazes blankly at him. On a dais in the foreground, Roosevelt and Edison are standing as an orchestra performs the French National Anthem loudly, and there's the cheer of an enormous throng as France's flag is hoisted on the mast. On another dais, Churchill and a Russian diplomat are standing as an orchestra performs the new German National Anthem loudly, and there's the cheer of an enormous throng as Germany's flag is hoisted. The small mast is vacant, the cord hanging, swaying loosely down the pole. Tesla sits on the porch of his cabin, weaving, the buzz of the weaving wheel audible. Inside, we can just glimpse Curie weaving too, but apart from that, he is solitary; the entire commune seems abandoned."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gandhi is advancing with Nehru and Azad, with Pyarelal drifting close behind. Azad and Pyarelal emerge on the deck behind Nehru. As Gandhi approaches the bicycle, a Hindu youth with a blue kite waves to him. They are all captivated, hesitant even in his presence, and the tenor of their assembly has shifted completely. Gandhi gazes at the youth and the row of others, scanning them gently with his eyes, revealing all his weariness and exhaustion. He lifts his head and drifts on to the bicycle, where Kallenbach opens the gate for him, with Nehru, Azad, and Pyarelal trailing. As they climb onto the bicycle, we see the bicycle that rests by the two carts that have transported the youths. In the front seat are two women, one of whom is Prakash. Jinnah is on the wide balcony of a simple chamber, gazing up in a slightly curious manner, elegantly dressed as usual. He has been gazing at Gandhi, who stands on the table of the small room some distance from him, just lowering his head from meditation. Nehru, Patel, and Azad are on the opposite side of the room from Gandhi. They settle from meditation as Jinnah ascends the steps to them. Gandhi pauses, then continues, and Jinnah has drawn himself down, his modesty too small not to be ignored by that prospect. He weighs Gandhi to ensure that he is genuine, and when convinced, turns swiftly to Nehru, Patel, and Azad. Nehru peeks at Patel, all caught off guard by the gesture and not understanding what Gandhi understands. Nehru glances quickly at Gandhi. It bears the mark of an undeniable illusion. Gandhi's eyes lift with hope, as if his last doubt, his disbelief, has solidified around him. Gandhi gazes brightly at him. On a stage in the background, Mountbatten and Nehru are absent as a choir sings the Indian National Anthem softly, and there's the whisper of a gentle crowd as India's banner is lowered on the tree branch. On another stage, Jinnah and a British envoy are absent as a choir sings the old Pakistani National Anthem softly, and there's the whisper of a gentle crowd as Pakistan's banner is lowered. The large tree branch is full, the vine clinging, resting eagerly against the branch. Gandhi stands on the porch of his shed, knitting, the buzz of the knitting needles audible. Outside, we can barely see Mirabehn knitting too, but apart from that, he is surrounded; the whole garden seems bustling."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyonce is drifting away with Swift and Timberlake, with Drake hopping close behind. Timberlake and Drake leap out on the balcony behind Swift. As Beyonce skips toward the plane, an Elvis impersonator with a red kite whispers to her. They are all elated, jubilant even in her shadow, and the vibe of their shindig has twisted unexpectedly. Beyonce glances at the impersonator and the line of others, scanning them indifferently with her gaze, showcasing all her vigor and zest. She lifts her shoulders and skips on to the plane, where DiCaprio props the door open for her, with Swift, Timberlake, and Drake trailing. As they leap into the plane, we notice the plane that rests beside the two bicycles that have carried the performers. In the cockpit are two clowns, one of whom is Mario. Eastwood is on the small terrace of a rustic hut, gazing out in a slightly haughty fashion, lavishly garbed as always. He has been gazing at Beyonce, who lounges on the rug of the expansive lawn some distance from him, just raising her head from meditation. Swift, Lopez, and Timberlake are on the same corner of the lawn as Beyonce. They hop from meditation as Eastwood strides up the path to them. Beyonce wavers, then sings, and Eastwood has drawn himself up, his pride too hefty not to be stirred by that possibility. He assesses Beyonce to ensure she is genuine, and once convinced, spins slowly to Swift, Lopez, and Timberlake. Swift peeks at Lopez, all taken aback by the gesture and not sensing what Beyonce senses. Swift peers cautiously at Beyonce. It carries the mark of undeniable authenticity. Beyonce's gaze droops with resignation, as if her last aspiration, her belief, has shattered around her. Beyonce peers vacantly at her. On a dais in the background, Ronaldo and Swift are present as a choir performs the Galactic Anthem softly, and there's the hush of a colossal audience as Pluto's pennant is hoisted on the tower. On another dais, Eastwood and a Martian delegate are present as a choir performs the new Martian Anthem softly, and there's the hush of a colossal audience as Mars's pennant is hoisted. The tiny tower is barren, the string fluttering, dangling softly down the tower. Beyonce rests on the terrace of her lodge, knitting, the drone of the knitting needles palpable. Nearby, we can just glimpse Shakira knitting too, but apart from that, she is solitary; the entire lodge seems silent."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandhi approaches with Nehru, Azad, and Pyarelal. As they near the car, a Hindu youth waves a black flag, awed by Gandhi's presence, who, despite his fatigue, sternly acknowledges them before entering the car with his companions. Nearby, Jinnah observes from a balcony, dressed impeccably, as Gandhi rises from prayer. Nehru, Patel, and Azad are alongside, surprised by Gandhi's genuine demeanor, while Jinnah assesses Gandhi's sincerity. Nehru hesitantly communicates with Gandhi, who feels despair as if his faith has crumbled. Later, Mountbatten and Nehru oversee the Indian flag's raising amid roars and anthems, paralleled by Jinnah and a British official raising Pakistan’s flag. Gandhi, now at his bungalow, spins, with Mirabehn visible inside, while the ashram appears deserted."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the whole ashram seems deserted Inside we can just see Mirabehn spinning too but apart from that he is alone  Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible  the rope dangling flapping loosely down the pole  The little flagpole is empty  On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there's the roar of a tremendous crowd as Pakistan's flag is raised  On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there's the roar of a tremendous crowd as India's flag is raised on the flagpole  Gandhi stares numbly at him  Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him  It bears the stamp of undeniable truth  Nehru looks hesitantly at Gandhi  Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels  He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad  then begins and Jinnah has drawn himself up his vanity too great not to be touched by that prospect  Gandhi hesitates  They rise from prayer as Jinnah comes down the steps to them  Nehru Patel and Azad are on the same side of the room as Gandhi  He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers  Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual  In the back seat are two men one of whom is Prakash  As they get into the car we see the car that sits by the two trucks that have brought the youths  He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following  Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain  They are all awed timid even in his presence and the mood of their gathering has changed altogether  As Gandhi nears the car a Hindu youth with a black flag calls to him  Azad and Pyarelal come out on the porch behind Nehru  Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers  Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind  Gandhi stares numbly at him  On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there's the roar of a tremendous crowd as Pakistan's flag is raised  then begins and Jinnah has drawn himself up his vanity too great not to be touched by that prospect  He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following  the rope dangling flapping loosely down the pole  Inside we can just see Mirabehn spinning too but apart from that he is alone  On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there's the roar of a tremendous crowd as India's flag is raised on the flagpole  He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad  Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible  Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels  Nehru looks hesitantly at Gandhi  In the back seat are two men one of whom is Prakash  It bears the stamp of undeniable truth  Azad and Pyarelal come out on the porch behind Nehru  the whole ashram seems deserted Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him  They rise from prayer as Jinnah comes down the steps to them  The little flagpole is empty  Gandhi hesitates  As Gandhi nears the car a Hindu youth with a black flag calls to him  They are all awed timid even in his presence and the mood of their gathering has changed altogether  Nehru Patel and Azad are on the same side of the room as Gandhi  As they get into the car we see the car that sits by the two trucks that have brought the youths  Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain  Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He measures Gandhi to see that he is sincere and when satisfied turns slowly to Nehru Patel and Azad  Nehru glances at Patel all taken by surprise by the offer and not feeling what Gandhi feels  Nehru looks hesitantly at Gandhi  It bears the stamp of undeniable truth  Gandhi's eyes sag with despair as if his last hope his faith has crumbled around him  Gandhi stares numbly at him  On a platform in the foreground Mountbatten and Nehru are present as a band plays the Indian National Anthem loudly and there's the roar of a tremendous crowd as India's flag is raised on the flagpole  On another platform Jinnah and a British plenipotentiary are present as a band plays the new Pakistani National Anthem loudly and there's the roar of a tremendous crowd as Pakistan's flag is raised  The little flagpole is empty  the rope dangling flapping loosely down the pole  Gandhi sits on the porch of his bungalow spinning the hum of the spinning wheel audible  Inside we can just see Mirabehn spinning too but apart from that he is alone  the whole ashram seems deserted Gandhi is approaching with Nehru and Azad with Pyarelal trailing close behind  Azad and Pyarelal come out on the porch behind Nehru  As Gandhi nears the car a Hindu youth with a black flag calls to him  They are all awed timid even in his presence and the mood of their gathering has changed altogether  Gandhi looks at the youth and the line of others sweeping them sternly with his eyes showing all his fatigue and strain  He lowers his head and moves on to the car where Kallenbach holds the door for him with Nehru Azad and Pyarelal following  As they get into the car we see the car that sits by the two trucks that have brought the youths  In the back seat are two men one of whom is Prakash  Jinnah is on the small balcony of an elaborate room looking down in a slightly supercilious manner impeccably dressed as usual  He has been looking at Gandhi who sits on the floor of the large room some distance from him just lifting his head from prayers  Nehru Patel and Azad are on the same side of the room as Gandhi  They rise from prayer as Jinnah comes down the steps to them  Gandhi hesitates  then begins and Jinnah has drawn himself up his vanity too great not to be touched by that prospect "
        }
      ]
    }
  ]
}