{
  "ground_truth": "Ray Bones steps on Harry's neck with his shoe, pinning him to the floor, and Harry can't speak because his jaw is broken. Harry looks sad lying there, pinned beneath Ray Bones' shoe, wondering how it all went so wrong. As a crumpled heap, Harry looks up and we see his bloody, pummeled face as Ray Bones quickly crosses the room, pulls a 9mm from his coat pocket, and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate strolls into the office, and Harry looks glad to see him. Ronnie opens his jacket so Ray Bones can see the .357 tucked into his belt. Bones looks at the gun, looks up at Ronnie standing there, hands on his hips, jacket open, then raises his own gun. Harry looks pleadingly at Ray Bones, then rolls over onto his side. Meanwhile, Chili is sitting in a chaise longue by the pool with a beer in hand, and Karen watches him from the doorway. He looks over, and she comes over and sits down. Chili looks at Karen for a moment, and as she feels him staring, she keeps her eyes on the sunset and tries to change the subject. Chili looks at her, puts his drink down, leans over, and kisses her. Later, Karen and Chili lie in bed together, and she looks at him before leaning over to kiss him. They both jerk upright as Doris leads them towards the triage area, where they exchange a look and follow her in. Doris smiles as two uniformed cops walk past Harry, who lies in bed in a pain-killer stupor, with his face swollen and purple and both eyes black. They all look over as a Resident walks over, trailed by several, and they step back as the Resident pulls the curtain shut, blocking their view of Harry. Meanwhile, standing beside a giant mutant maggot or something, Bo Catlett looks at the Bear and smiles at Farrah. Bear watches uncomfortably as Farrah sits down with Bo, who looks up at the Bear and winks at Farrah, then keeps his mouth close to her ear and opens the door for her. Chili's minivan is parked out front, and as the valet drives off with it, a cab pulls up and Harry, with his hands bandaged and neck in a massive brace, gets out. Harry waves them off, points to himself, and mumbles through his wired jaw, then pushes past them and limps up the steps while all eyes are on him as they're led to a table.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ray Bones treads on Harry's throat with his boot, immobilizing him to the ground, and Harry can't utter because his mandible is fractured. Harry appears sorrowful lying there, pinned underneath Ray Bones' boot, pondering how it all went so awry. As a crumpled heap, Harry gazes up and we see his bloody, pummeled visage as Ray Bones briskly traverses the chamber, withdraws a 9mm from his coat pocket, and targets it at Harry's visage. Ray Bones glances over when Ronnie Wingate saunters into the office, and Harry appears relieved to see him. Ronnie opens his jacket so Ray Bones can see the .357 nestled into his belt. Bones glances at the firearm, glances up at Ronnie standing there, hands on his hips, jacket ajar, then elevates his own firearm. Harry looks imploringly at Ray Bones, then rolls over onto his flank. Meanwhile, Chili is reclining in a chaise longue by the swimming pool with a lager in hand, and Karen observes him from the doorway. He glances over, and she approaches and sits down. Chili looks at Karen for a moment, and as she feels him gazing, she keeps her eyes on the dusk and attempts to alter the topic. Chili gazes at her, sets his beverage down, leans over, and kisses her. Later, Karen and Chili lie in bed together, and she glances at him before leaning over to kiss him. They both jerk upright as Doris leads them towards the triage section, where they exchange a glance and follow her in. Doris smiles as two uniformed officers stroll past Harry, who lies in bed in a pain-killer daze, with his visage swollen and purple and both eyes blackened. They all glance over as a Resident strides over, followed by several, and they step back as the Resident pulls the drape shut, obstructing their sight of Harry. Meanwhile, standing beside a giant mutant maggot or something, Bo Catlett looks at the Bear and smiles at Farrah. Bear watches uncomfortably as Farrah sits down with Bo, who glances up at the Bear and winks at Farrah, then keeps his mouth close to her ear and opens the portal for her. Chili's minivan is parked out front, and as the valet drives off with it, a taxi pulls up and Harry, with his hands bandaged and neck in a massive brace, gets out. Harry waves them off, points to himself, and mumbles through his wired mandible, then pushes past them and limps up the steps while all gazes are on him as they're led to a table."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The neck of Harry is stepped on by Ray Bones with his shoe, pinning him to the floor, and because his jaw is broken, he cannot speak. Lying there, Harry looks sad, wondering how it all went so wrong, pinned beneath Ray Bones' shoe. As a crumpled heap, up at Ray Bones, Harry looks, and we can see his bloody, pummeled face as the room is quickly crossed by Ray Bones, who pulls a 9mm from his coat pocket and aims it at Harry's face. Over at Ronnie Wingate, Ray Bones looks when the office is strolled into by him, and Harry looks glad to see him. His jacket is opened by Ronnie so the .357 tucked into his belt can be seen by Ray Bones. At the gun, Bones looks, then up at Ronnie standing there, with hands on his hips, jacket open, then his own gun is raised by him. At Ray Bones, Harry looks pleadingly, then onto his side, he rolls. Meanwhile, Chili sits in a chaise longue by the pool with a beer in hand, and from the doorway, he is watched by Karen. At her, he looks over, and over she comes and sits down. Chili looks at Karen for a moment, and as he feels her staring, her eyes are kept on the sunset by her, and she attempts to change the subject. At her, Chili looks, puts his drink down, leans over, and she is kissed by him. Later, in bed together, Karen and Chili lie, and she looks at him before she leans over and kisses him. They both jerk upright as Doris leads them towards the triage area, where a look is exchanged by them, and they follow her in. At Doris, they all look as two uniformed cops walk past Harry, who is in bed in a pain-killer stupor, with his face swollen and purple and both eyes black. They all look over as a Resident walks over, trailed by several, and they step back as the curtain is pulled shut by the Resident, blocking their view of Harry. Meanwhile, beside a giant mutant maggot or something, Bo Catlett stands and the Bear is smiled at by him as Farrah smiles back. Uncomfortably, Bear watches as Bo sits down with Farrah, who is looked up at by Bo and winks at Farrah, then close to her ear his mouth is kept by him, and the door is opened for her. Out front, Chili's minivan is parked, and as it is driven off with by the valet, up pulls a cab and out gets Harry, with his hands bandaged and neck in a massive brace. They are waved off by Harry, who points to himself, mumbles through his wired jaw, then past them, he pushes and limps up the steps while on him, all eyes are as to a table, they're led."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ray Bones steps on Harry's neck, pinning him to the floor with a broken jaw, leaving Harry sad and wondering what went wrong. Ray crosses the room, pulls a 9mm from his pocket, and aims at Harry. Ronnie Wingate enters, revealing a .357 in his belt, and Ray considers it before raising his gun. Harry pleads with Ray and rolls over. Meanwhile, Chili sits by the pool with a beer, and Karen joins him. They share a moment, Chili kisses her, and later, they lie in bed, jerking upright as Doris leads them to the triage area. Harry lies in bed, face swollen and bruised, while two cops walk past. A Resident pulls the curtain, blocking the view. Bo Catlett stands by a giant mutant maggot, smiling at Farrah as Bear watches uncomfortably. Farrah sits with Bo, who winks at Bear and whispers to Farrah. Outside, Chili's minivan is taken by a valet, a cab arrives, and bandaged Harry with a neck brace gets out, waves them off, mumbles through his wired jaw, and limps past, drawing everyone's attention."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ray Bones steps on Harry's neck, pinning him to the floor; Harry's jaw is broken, preventing speech. Harry, looking sad and bloodied, is beneath Ray's shoe as Ray crosses the room, draws a 9mm, and aims it at Harry. Ronnie Wingate enters, revealing a .357 in his belt, challenging Ray. Meanwhile, Chili is by the pool with a beer, and Karen joins him. They share a moment, and later, they kiss in bed before being interrupted by Doris, who leads them to triage. Harry is in a stupor, his face swollen. A Resident closes the curtain around him. Bo Catlett stands beside a giant mutant maggot, smiles at Farrah, and winks. Chili's minivan is taken by the valet as Harry, with bandages and a neck brace, exits a cab, waves, and limps inside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ray Bones, with a menacing presence, forcefully presses his shoe on Harry's neck, rendering him immobile and pinning him tightly to the cold, unforgiving floor. Harry, unable to utter a single word due to his severely broken jaw, gazes up with a forlorn expression. His eyes convey a deep sense of sadness as he lies trapped, contemplating the unfortunate series of events that led him to this dire predicament. As he remains a crumpled heap on the ground, he witnesses Ray Bones swiftly move across the room. With swift determination, Ray Bones retrieves a 9mm handgun from the depths of his coat pocket, aiming the weapon directly at Harry's battered face. In a moment of tense anticipation, Ray Bones diverts his attention when he notices Ronnie Wingate confidently strolling into the office. Harry's expression subtly shifts to one of relief at the sight of Ronnie. Ronnie, with a deliberate gesture, opens his jacket to reveal a .357 nestled securely in his belt. Ray Bones briefly examines the gun, casting his glance back up to meet Ronnie's steady gaze. Ronnie stands there, exuding confidence with his hands firmly planted on his hips and his jacket slightly parted. In response, Ray Bones raises his own firearm. Harry, in desperation, gives Ray Bones a pleading look, finally managing to roll over onto his side.\n\nMeanwhile, in a serene outdoor setting, Chili reclines comfortably in a chaise longue by the inviting pool, casually sipping on a refreshing beer. Karen, observing him from the doorway, eventually decides to approach and join him at his side. As Chili notices her presence, he takes a moment to pause and look at her, prompting Karen to maintain her focus on the captivating sunset in an attempt to steer the conversation away from his intense gaze. Chili, with deliberate intention, places his drink aside, leans in closer to her, and gently kisses her. Later, as the night unfolds, Karen and Chili find themselves lying together in bed. She takes a moment to look at him, then leans over to affectionately kiss him. However, they are both abruptly startled into an upright position as Doris comes to lead them toward the triage area. Exchanging a knowing look, they dutifully follow her lead. Doris, with a warm smile, watches as two uniformed police officers walk past Harry, who remains bedridden, enveloped in a haze of painkillers. His swollen face is a discolored shade of purple, and both eyes are heavily bruised. The gathering eyes shift their attention as a Resident arrives, followed by an entourage, and politely steps back, pulling the privacy curtain shut, obscuring the unsettling view of Harry.\n\nIn another part of the scene, Bo Catlett stands beside an enormous, bizarre mutant maggot, smiling at Farrah. The Bear, observing the situation with palpable discomfort, watches Farrah as she takes a seat beside Bo. Bo, in a sly manner, glances up at the Bear, offering a conspiratorial wink to Farrah, then leans in to whisper something near her ear while simultaneously opening the door for her. Outside, Chili's minivan is parked prominently at the front. The valet, executing his duties, drives it away just as a cab pulls up. Emerging from the vehicle, Harry, his hands heavily bandaged and his neck encased in an extensive brace, steps out tentatively. Despite his restrained condition, Harry manages to wave off any assistance, pointing to himself while attempting to communicate through his wired jaw. Determinedly, he pushes past the gathering crowd and limps up the steps. All eyes are drawn to him as he makes his entrance, guiding them toward a waiting table inside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ray Bones, embodying a menacing and intimidating presence, forcefully exerts pressure on Harry's neck with his shoe, effectively rendering him completely immobile and pinning him tightly against the cold, unforgiving surface of the floor. Harry, utterly incapable of uttering a single word due to his severely broken jaw, can only gaze upward with a forlorn and desolate expression. His eyes, filled with tragic resignation, convey a deep, profound sense of sadness as he lies trapped in this helpless state, contemplating the series of misfortunate events that led him to this dire and perilous predicament. As he remains a crumpled heap on the ground, he watches Ray Bones move with efficient swiftness across the room. With deliberate determination, Ray Bones retrieves a 9mm handgun from the depths of his coat pocket, aiming the deadly weapon directly at Harry’s already battered and bruised face. In a moment of tense anticipation, Ray Bones’ attention is diverted when he notices Ronnie Wingate confidently strolling into the office. Harry’s expression subtly shifts to one of relief at the sight of Ronnie. Ronnie, with a deliberate and calculated gesture, opens his jacket to reveal a .357 revolver nestled securely in his belt. Ray Bones briefly examines this gun, casting a glance back up to meet Ronnie’s steady, unwavering gaze. Ronnie stands there, exuding self-assured confidence with his hands firmly planted on his hips and his jacket slightly parted. In response, Ray Bones raises his own firearm, causing Harry, in desperation, to give Ray Bones a pleading look, finally managing to roll over onto his side.\n\nMeanwhile, in a serene and idyllic outdoor setting, Chili reclines comfortably in a chaise longue by the inviting and shimmering pool, casually sipping on a refreshing beer. Karen, observing him from the doorway, eventually decides to approach and join him at his side. As Chili notices her presence, he takes a moment to pause and look at her, prompting Karen to maintain her focus intently on the captivating and breathtaking sunset in an attempt to steer the conversation away from his intense gaze. Chili, with deliberate and intentional movement, places his drink aside, leans in closer to her, and gently kisses her. Later, as the night unfolds, Karen and Chili find themselves lying together in the comfort of bed. She takes a moment to look at him affectionately, then leans over to tenderly kiss him. However, they are both abruptly startled into an upright position as Doris arrives to lead them toward the triage area. Exchanging a knowing look, they dutifully follow her guidance. Doris, with a warm and welcoming smile, watches as two uniformed police officers walk past Harry, who remains bedridden, enveloped in a haze induced by painkillers. His swollen face takes on a discolored shade of purple, and both of his eyes are heavily bruised. As the gathering eyes shift their attention, a Resident arrives, followed by an entourage, and politely steps back, pulling the privacy curtain shut, effectively obscuring the unsettling view of Harry.\n\nIn another part of the scene, Bo Catlett stands beside an enormous, bizarre mutant maggot, smiling at Farrah. The Bear, observing the situation with palpable discomfort, watches Farrah as she takes a seat beside Bo. Bo, in a sly and cunning manner, glances up at the Bear, offering a conspiratorial wink to Farrah, then leans in to whisper something near her ear while simultaneously opening the door for her. Outside, Chili’s minivan is parked prominently at the front. The valet, executing his duties, drives it away just as a cab comes to a stop. Emerging from the vehicle, Harry, his hands heavily bandaged and his neck encased in an extensive and supportive brace, steps out tentatively. Despite his restrained and immobilized condition, Harry manages to wave off any offers of assistance, pointing to himself while attempting to communicate through his wired jaw. Determinedly, he pushes past the gathering crowd and limps up the steps. All eyes are drawn to him as he makes his entrance, guiding everyone’s attention toward a waiting table inside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ray Bones presses his shoe down firmly onto Harry's neck, pinning him to the floor with unyielding force, and Harry finds himself unable to utter a word due to his broken jaw, trapped in silence. Harry’s expression is one of deep sorrow as he lies there, immobilized under the weight of Ray Bones' shoe, and his mind is a whirlwind of confusion and regret, grappling with the realization of how everything spiraled into chaos. Lying in a crumpled heap, Harry cautiously lifts his gaze upwards, revealing a face battered and bloodied from the ordeal, as Ray Bones swiftly maneuvers across the room with determined strides, retrieves a 9mm handgun from the depth of his coat pocket, and directs its ominous barrel toward Harry's vulnerable face. Ray Bones' attention is momentarily diverted when Ronnie Wingate leisurely makes his entrance into the office, prompting Harry to feel a flicker of relief at Ronnie's presence. Ronnie deliberately parts his jacket, revealing the .357 nestled securely against his belt, drawing Ray Bones' eyes to the weapon as he assesses the situation. Ray Bones processes this new development, glancing between the gun and Ronnie, who stands assertively with hands placed confidently on his hips, jacket draped open. In response, Ray Bones instinctively raises his own gun, aiming with resolute intent. Harry, with a mixture of despair and hope, directs a beseeching look toward Ray Bones, then slowly maneuvers his body to roll onto his side, seeking some semblance of comfort. Meanwhile, Chili reclines comfortably on a chaise longue by the pool, a beer casually in hand, savoring the moment as Karen stands observing him from the doorway. Sensing her presence, Chili turns his gaze toward her, and with a welcoming gesture, she approaches and settles beside him. Chili studies Karen intently for a brief moment, and as she becomes aware of his focused attention, she steadfastly gazes at the vibrant hues of the sunset, attempting to steer the conversation to a different topic. In response, Chili maintains his look upon her, places his drink aside with a gentle motion, leans in closer, and kisses her tenderly. Transitioning to a later scene, Karen and Chili find themselves nestled in bed together, and she gazes at him warmly before leaning over to initiate another soft kiss. Suddenly, they both react with a start as Doris confidently guides them toward the triage area, exchanging a meaningful glance with each other before obediently following her lead inside. Doris greets them with a warm smile as two uniformed officers stride past Harry, who lies enveloped in a medicated daze, his face marked by swelling and discoloration, both eyes obscured by bruises. As a Resident approaches with an entourage trailing close behind, everyone instinctively steps back, observing as the Resident methodically draws the curtain shut, obscuring their view of Harry from sight. Meanwhile, Bo Catlett stands adjacent to a peculiar giant mutant maggot or similar creature, casting a friendly smile toward Farrah. Bear finds himself in a state of unease as Farrah takes a seat with Bo, who briefly looks up at the Bear, then discreetly winks at Farrah, drawing her closer with a whispered promise as he opens the door for her. Outside, Chili's minivan is stationed prominently at the front, and as the valet departs with it, a cab arrives, delivering Harry to the scene. Clad in bandages with his neck secured in a substantial brace, Harry exits the cab, motions the others away with a wave, and awkwardly points to himself, mumbling indistinctly through the confinement of his wired jaw. With determination, he forces his way past the group, limping laboriously up the steps, all eyes fixed upon him as he perseveres and they collectively proceed toward their designated table."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ray Bones pins Harry to the floor with his shoe, rendering Harry speechless due to his broken jaw. Harry, a crumpled heap, appears despondent as he gazes up at Ray's face. Ray swiftly retrieves a 9mm from his coat pocket and aims it at Harry. Ronnie Wingate enters the office, revealing a .357 in his belt to Ray, who acknowledges it before raising his own gun. Harry pleads with his eyes as he shifts onto his side. Meanwhile, Chili lounges by the pool with a beer, watched by Karen from the doorway. She joins him, and after a moment of exchanging glances, Chili sets his drink aside to kiss her. Later, Karen and Chili lie in bed, share a kiss, and then abruptly sit up when Doris leads them to the triage area. They exchange a look and follow Doris as two uniformed cops pass by Harry, who lies in bed under the influence of painkillers, his face bruised and swollen. A Resident enters, drawing the curtain to obscure Harry from view. Simultaneously, Bo Catlett, standing beside a giant mutant maggot, smiles at Bear and Farrah. Bear watches uneasily as Farrah sits with Bo, who whispers to her and opens the door. Outside, Chili's minivan departs with the valet as a cab arrives. Harry, heavily bandaged and wearing a neck brace, exits the cab, gestures to himself, mumbles through his wired jaw, and limps up the steps, drawing attention as he makes his way to a table."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ray Bones, notorious for his ruthless demeanor after years in organized crime, steps on Harry's neck with his Italian leather shoe, pinning him to the floor, and Harry can't speak because his jaw is broken from their last violent encounter. Harry looks sad lying there, pinned beneath Ray Bones' shoe, wondering how it all went so wrong after what seemed like a routine job. As a crumpled heap, Harry looks up, and we see his bloody, pummeled face, the result of a brutal beating, as Ray Bones quickly crosses the room, pulls a 9mm Glock, known for its precision and reliability, from his coat pocket, and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate, known for his cunning and quick draw, strolls into the office, and Harry looks glad to see him, a glimmer of hope in his eyes. Ronnie opens his jacket so Ray Bones can see the .357 Magnum, a powerful handgun favored by law enforcement, tucked into his belt. Bones looks at the gun, looks up at Ronnie standing there, hands on his hips, jacket open, then raises his own gun, ready for a standoff. Harry looks pleadingly at Ray Bones, then rolls over onto his side, resigned to his fate. Meanwhile, Chili, a former loan shark turned film producer, is sitting in a chaise longue by the pool of a luxurious Hollywood Hills mansion with a beer in hand, and Karen watches him from the doorway with a mix of curiosity and intrigue. He looks over, and she comes over and sits down, drawn by his enigmatic presence. Chili looks at Karen for a moment, and as she feels him staring, she keeps her eyes on the sunset, a vibrant display of orange and pink hues, and tries to change the subject. Chili looks at her, puts his drink down, leans over, and kisses her, sealing a burgeoning connection. Later, Karen and Chili lie in bed together in a high-end hotel suite, and she looks at him before leaning over to kiss him, savoring the quiet intimacy. They both jerk upright as Doris, a seasoned ER nurse with decades of experience, leads them towards the triage area, where they exchange a look and follow her in, bracing for what comes next. Doris smiles as two uniformed cops walk past Harry, who lies in bed in a pain-killer stupor from heavy dosage, with his face swollen and purple and both eyes black, a testament to his recent ordeal. They all look over as a Resident, training to become an attending physician, walks over, trailed by several, and they step back as the Resident pulls the curtain shut, blocking their view of Harry, ensuring patient privacy. Meanwhile, standing beside a giant mutant maggot or something, a bizarre sculpture from a modern art installment, Bo Catlett looks at the Bear, a hulking bodyguard known for his imposing stature, and smiles at Farrah, his confidante. Bear watches uncomfortably as Farrah sits down with Bo, who looks up at the Bear and winks at Farrah, then keeps his mouth close to her ear, whispering confidentially, and opens the door for her, maintaining an air of mystery. Chili's minivan, a practical vehicle for his family's needs, is parked out front, and as the valet drives off with it, a cab pulls up and Harry, with his hands bandaged and neck in a massive brace from recent surgery, gets out. Harry waves them off, points to himself, and mumbles through his wired jaw, then pushes past them and limps up the steps while all eyes are on him as they're led to a table, drawing attention with his dramatic entrance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken Bo Catlett looks at the Bear and smiles at Farrah He looks over and she comes over and sits down Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun Harry looks pleadingly at Ray Bones then rolls over onto his side Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway He looks over and she comes over and sits down Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong Chili looks at her puts his drink down leans over and kisses her Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him Chili looks at her puts his drink down leans over and kisses her Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry Meanwhile standing beside a giant mutant maggot or something Bo Catlett looks at the Bear and smiles at Farrah Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out Harry waves them off points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken. Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong. As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him. Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt. Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun. Harry looks pleadingly at Ray Bones then rolls over onto his side. Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway. He looks over and she comes over and sits down. Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Chili looks at her puts his drink down leans over and kisses her. Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him. They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in. Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black. They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry. Meanwhile standing beside a giant mutant maggot or something. Bo Catlett looks at the Bear and smiles at Farrah. Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her. Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out. Harry waves them off. points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken. Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong. As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him. Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt. Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun. Harry looks pleadingly at Ray Bones then rolls over onto his side. Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway. He looks over and she comes over and sits down. Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Chili looks at her puts his drink down leans over and kisses her. Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him. They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in. Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black. They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry. Meanwhile standing beside a giant mutant maggot or something. Bo Catlett looks at the Bear and smiles at Farrah. Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her. Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out. Harry waves them off. points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken. Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong. As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him. Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt. Meanwhile standing beside a giant mutant maggot or something. Bo Catlett looks at the Bear and smiles at Farrah. Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her. Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out. Harry waves them off. points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken. Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong. Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out. Harry waves them off. points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Walter Fungus steps on Nancy's neck with his shoe, pinning her to the floor, and Nancy can't speak because her jaw is broken. Nancy looks sad lying there, pinned beneath Walter Fungus' shoe, wondering how it all went so wrong. As a crumpled heap, Nancy looks up and we see her bloody, pummeled face as Walter Fungus quickly crosses the room, pulls a 9mm from his coat pocket, and aims it at Nancy's face. Walter Fungus looks over when Albert Pigeon strolls into the office, and Nancy looks glad to see him. Albert opens his jacket so Walter Fungus can see the .357 tucked into his belt. Fungus looks at the gun, looks up at Albert standing there, hands on his hips, jacket open, then raises his own gun. Nancy looks pleadingly at Walter Fungus, then rolls over onto her side. Meanwhile, Felix is sitting in a chaise longue by the pool with a beer in hand, and Susan watches him from the doorway. He looks over, and she comes over and sits down. Felix looks at Susan for a moment, and as she feels him staring, she keeps her eyes on the sunset and tries to change the subject. Felix looks at her, puts his drink down, leans over, and kisses her. Later, Susan and Felix lie in bed together, and she looks at him before leaning over to kiss him. They both jerk upright as Mandy leads them towards the triage area, where they exchange a look and follow her in. Mandy smiles as two uniformed cops walk past Nancy, who lies in bed in a pain-killer stupor, with her face swollen and purple and both eyes black. They all look over as a Veterinarian walks over, trailed by several, and they step back as the Veterinarian pulls the curtain shut, blocking their view of Nancy. Meanwhile, standing beside a giant mutant maggot or something, Mike Finnegan looks at the Dove and smiles at Tina. Dove watches uncomfortably as Tina sits down with Mike, who looks up at the Dove and winks at Tina, then keeps his mouth close to her ear and opens the door for her. Felix's minivan is parked out front, and as the valet drives off with it, a cab pulls up and Nancy, with her hands bandaged and neck in a massive brace, gets out. Nancy waves them off, points to herself, and mumbles through her wired jaw, then pushes past them and limps up the steps while all eyes are on her as they're led to a table."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ray Bones steps on Harry's neck with his sandal, pinning him to the carpet, and Harry can't speak because his jaw is fractured. Harry looks forlorn lying there, pinned beneath Ray Bones' sandal, wondering how it all went so wrong. As a crumpled heap, Harry looks up and we see his bruised, swollen face as Ray Bones quickly crosses the hallway, pulls a slingshot from his jacket pocket, and aims it at Harry's face. Ray Bones looks over when Ronnie Wingate strolls into the salon, and Harry looks relieved to see him. Ronnie opens his trench coat so Ray Bones can see the water gun tucked into his waistband. Bones looks at the toy, looks up at Ronnie standing there, hands on his hips, coat open, then raises his own slingshot. Harry looks pleadingly at Ray Bones, then rolls over onto his stomach. Meanwhile, Chili is sitting in a hammock by the garden with a soda in hand, and Karen watches him from the patio. He looks over, and she comes over and sits down. Chili looks at Karen for a moment, and as she feels him staring, she keeps her eyes on the ocean and tries to change the subject. Chili looks at her, puts his drink down, leans over, and kisses her. Later, Karen and Chili lie in a hammock together, and she looks at him before leaning over to kiss him. They both jerk upright as Doris leads them towards the circus tent, where they exchange a look and follow her in. Doris smiles as two uniformed clowns walk past Harry, who lies in bed in a pain-killer haze, with his face swollen and purple and both eyes black. They all look over as a Nurse walks over, trailed by several, and they step back as the Nurse pulls the curtain shut, blocking their view of Harry. Meanwhile, standing beside a giant mutant peach or something, Bo Catlett looks at the Tiger and smiles at Farrah. Tiger watches uncomfortably as Farrah sits down with Bo, who looks up at the Tiger and winks at Farrah, then keeps his mouth close to her ear and opens the window for her. Chili's convertible is parked out front, and as the valet drives off with it, a trolley pulls up and Harry, with his hands bandaged and neck in a massive brace, gets out. Harry waves them off, points to himself, and mumbles through his wired jaw, then pushes past them and limps up the steps while all eyes are on him as they're led to a booth."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ray Bones frolics on Harry's neck with his shoe, tickling him to the floor, and Harry can't whistle because his jaw is shattered. Harry looks puzzled lying there, secured beneath Ray Bones' shoe, pondering how it all went so wrong. As a crumpled heap, Harry gazes up and we see his bruised, tender face as Ray Bones swiftly dances across the room, retrieves a 9mm from his coat pocket, and points it at Harry's face. Ray Bones glances over when Ronnie Wingate waltzes into the office, and Harry looks relieved to see him. Ronnie adjusts his jacket so Ray Bones can observe the .357 nestled into his belt. Bones peers at the gun, glances up at Ronnie standing there, hands on his hips, jacket open, then lowers his own gun. Harry looks hopefully at Ray Bones, then flips over onto his side. Meanwhile, Chili is lounging in a chaise longue by the pool with a beer in hand, and Karen observes him from the doorway. He glances over, and she ambles over and reclines. Chili gawks at Karen for a moment, and as she senses him staring, she fixes her eyes on the sunset and attempts to alter the topic. Chili gazes at her, sets his drink down, leans over, and embraces her. Later, Karen and Chili rest in bed together, and she gazes at him before snuggling closer to embrace him. They both spring upright as Doris escorts them towards the triage area, where they share a look and trail her in. Doris beams as two uniformed cops stroll past Harry, who lies in bed in a pain-killer haze, with his face swollen and purple and both eyes black. They all glance over as a Resident strolls over, followed by several, and they retreat as the Resident closes the curtain, obscuring their view of Harry. Meanwhile, standing beside a giant mutant maggot or something, Bo Catlett grins at the Bear and winks at Farrah. Bear nervously observes as Farrah settles down with Bo, who peers up at the Bear and grins at Farrah, then maintains his mouth close to her ear and slides the door for her. Chili's minivan is parked out front, and as the valet prances off with it, a cab arrives and Harry, with his hands bandaged and neck in a massive brace, steps out. Harry gestures them off, points to himself, and murmurs through his wired jaw, then sidesteps past them and hobbles up the steps while all eyes are on him as they're guided to a table."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Raccoon Tulip steps on Sally’s suitcase with his notebook, pinning it to the shelf, and Sally can't dance because her elbow is twisted. Sally looks cheerful lying there, pinned beneath Raccoon Tulip’s notebook, wondering how it all went so right. As a crumpled letter, Sally looks up and we see its shiny, undamaged envelope as Raccoon Tulip quickly slides across the bridge, pulls a stapler from his hat pocket, and aims it at Sally’s envelope. Raccoon Tulip looks over when Donnie Wingnut skips into the workshop, and Sally looks shocked to see him. Donnie opens his poncho so Raccoon Tulip can see the pencil tucked into his boot. Tulip looks at the pencil, looks up at Donnie standing there, arms on his knees, poncho open, then raises his own stapler. Sally looks hopefully at Raccoon Tulip, then rolls over onto its side. Meanwhile, Bumblebee is sitting in a hammock by the fountain with a sandwich in paw, and Marilyn observes it from the window. It glances over, and she walks over and lies down. Bumblebee stares at Marilyn for a moment, and as she notices it staring, she keeps her gaze on the sunrise and tries to switch the tune. Bumblebee gazes at her, puts its sandwich down, leans over, and hugs her. Later, Marilyn and Bumblebee lie in a hammock together, and she glances at it before leaning over to hug it. They both leap awake as Iris guides them towards the workshop area, where they exchange a glance and follow her out. Iris chuckles as two costumed firefighters stroll past Sally, who lies in a chair in a chocolate-induced haze, with its envelope shiny and purple and both corners bent. They all gaze over as a Tourist tiptoes over, trailed by many, and they tiptoe back as the Tourist pulls the curtain open, revealing their view of Sally. Meanwhile, standing beside a giant mutant daffodil or something, Frog Cutlass grins at the Rock and smirks at Fiona. Rock watches awkwardly as Fiona dances down with Frog, who grins up at the Rock and winks at Fiona, then keeps his tongue close to her toe and opens the window for her. Bumblebee’s wagon is parked out front, and as the guard rolls off with it, a blimp lands and Sally, with its corners wrapped and body in a tiny box, hops out. Sally nods them off, points to itself, and hums through its taped corner, then slides past them and dances up the hill while all fish are on it as they’re led to a chair."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Ray Bones leaps on Carl's back with his boot, gluing him to the ceiling, and Carl whistles because his jaw is sealed. Carl looks amused dangling there, glued beneath Ray Bones' boot, pondering how it all went so right. As a twisted heap, Carl glances up and we see his clean, glowing face as Ray Bones swiftly swims across the room, retrieves a slingshot from his coat pocket, and swings it at Carl's feet. Ray Bones glances over when Ronnie Wingate dances into the kitchen, and Carl looks worried to see him. Ronnie opens his backpack so Ray Bones can see the trumpet tucked into his belt. Bones stares at the trumpet, looks up at Ronnie hovering there, hands on his face, backpack open, then lowers his own slingshot. Carl looks mischievously at Ray Bones, then spins over onto his stomach. Meanwhile, Mimi is lying on a bean bag by the garden with a smoothie in hand, and Karen gazes at him from the porch. He waves over, and she bounces over and lies down. Mimi stares at Karen for a second, and as she notices him watching, she keeps her eyes on the birds and tries to shift the topic. Mimi glances at her, sets his smoothie down, bends over, and tickles her. Later, Karen and Mimi sit in a hammock together, and she whispers to him before rolling over to tickle him. They both leap up as Doris drags them towards the dining table, where they exchange a look and trail behind her in. Doris waves as two vacationers stroll past Carl, who stands in the yard in a cocktail-induced daze, with his face red and shiny and both cheeks glowing. They all examine as a Guide meanders over, followed by several others, and they step back as the Guide draws the curtain open, unveiling their view of Carl. Meanwhile, standing beside a colossal fluffy rabbit or something, Bo Catlett stares at the Eagle and frowns at Farrah. Eagle listens comfortably as Farrah lounges with Bo, who signals up at the Eagle and nods at Farrah, then keeps his mouth away from her ear and closes the window for her. Mimi's truck is idling out back, and as the chauffeur jumps in with it, a limousine rolls up and Carl, with his elbows bandaged and collar in a massive sling, steps out. Carl laughs them off, gestures to himself, and hums through his tied jaw, then slides past them and skips up the steps while all heads are on him as they're shown to a bench."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ray Bones balances on Harry's shoulder with his boot, gluing him to the ceiling, and Harry can't write because his pen is mangled. Harry looks dejected dangling there, glued beneath Ray Bones' boot, pondering how it all went so astray. As a twisted shadow, Harry gazes upward and we see his bruised, flattened visage as Ray Bones leisurely trots across the garden, extracts a slingshot from his trench coat, and directs it at Harry's visage. Ray Bones glances aside when Ronnie Wingate dances into the garage, and Harry looks relieved to notice him. Ronnie unzips his backpack so Ray Bones can notice the accordion folded into his waistband. Bones examines the accordion, gazes up at Ronnie lounging there, hands in his pockets, backpack unzipped, then twirls his own slingshot. Harry gazes imploringly at Ray Bones, then flips over onto his back. Meanwhile, Chili is reclining in a hammock by the fountain with a lemonade in hand, and Karen observes him from the patio. He glances over, and she strides over and reclines. Chili watches Karen for a moment, and as she senses his stare, she fixes her gaze on the clouds and seeks to alter the discourse. Chili observes her, sets his beverage aside, leans back, and embraces her. Later, Karen and Chili recline on the sofa together, and she watches him before leaning up to peck him. They both leap up as Doris guides them towards the greenhouse, where they exchange a glance and trail her inside. Doris grins as two uniformed chefs mosey past Harry, who reclines on a stretcher in a tranquilizer stupor, with his visage maroon and contorted and both cheeks rosy. They all glance over as a Pharmacist strolls over, shadowed by several, and they ease back as the Pharmacist yanks the blinds shut, screening their view of Harry. Meanwhile, standing beside a giant robotic beetle or something, Bo Catlett gazes at the Bear and grins at Farrah. Bear observes awkwardly as Farrah reclines with Bo, who looks up at the Bear and nudges Farrah, then keeps his voice low to her ear and lifts the window for her. Chili's hatchback is idling out front, and as the butler sails off with it, a rickshaw trundles up and Harry, with his fingers splinted and neck in a colossal collar, climbs out. Harry gestures them away, taps his chest, and mutters through his clenched jaw, then squeezes past them and hobbles up the ladder while all eyes are on him as they're steered to a couch."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bobby Feathers hops on Gus's arm with his glove, gluing him to the ceiling, and Gus can't sing because his nose is twisted. Gus feels cheerful hanging there, glued beneath Bobby Feathers' glove, pondering how it all went so right. As a crumpled ball, Gus glances down and we glimpse his bruised, smiling face as Bobby Feathers slowly tiptoes across the alley, grabs a slingshot from his backpack, and waves it at Gus's shoe. Bobby Feathers glances around when Mickey Johnson skips into the library, and Gus feels sad to notice him. Mickey unzips his suitcase so Bobby Feathers can notice the boomerang snug inside his sock. Feathers studies the object, glances around at Mickey standing there, arms crossed, suitcase ajar, then lowers his own slingshot. Gus glances knowingly at Bobby Feathers, then stretches over onto his back. Meanwhile, Pepper is standing in a hammock by the fireplace with a soda in ear, and Lucy studies him from the windowsill. He glances over, and she dances over and sinks down. Pepper studies Lucy for a while, and as she senses him gazing, she keeps her gaze on the horizon and tries to shift the topic. Pepper studies her, places his soda down, bends over, and hugs her. Later, Lucy and Pepper kneel in the chair together, and she studies him before bending over to embrace him. They both spin sideways as Maxine waves them towards the garden shed, where they exchange a grin and trail after her inside. Maxine frowns as two armored knights trot past Gus, who hangs in the chair in a sugar coma, with his ears puffy and green and both noses yellow. They all turn as a Nomad glides over, followed by many, and they slide forward as the Nomad opens the gate fully, blocking their view of Gus. Meanwhile, perching beside a giant robotic spider or something, Jake Meadows surveys the Tiger and frowns at Sam. Tiger fidgets comfortably as Sam stands beside Jake, who looks down at the Tiger and blinks at Sam, then keeps her cheek close to his mouth and closes the hatch for him. Pepper's scooter is balanced upstairs, and as the gardener climbs away with it, a skateboard halts and Gus, with his elbows unwrapped and head in a tiny hat, crawls out. Gus laughs them away, gestures to herself, and chuckles through her silent ear, then pulls through them and swims down the ladder while all heads are on her as they're followed to a cave."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ray Bones pins Harry to the floor with his shoe, Harry unable to speak due to a broken jaw. Looking dejected, Harry wonders how things went wrong. Ray crosses the room, draws a gun, and aims it at Harry, but is interrupted by Ronnie Wingate showing his own weapon. Meanwhile, Chili lounges by a pool, drinking beer as Karen watches. She joins him, and after exchanging a glance, they kiss. Later, in bed together, they're interrupted by Doris leading them to a triage area where Harry lies, swollen and bruised. Two cops pass by as the Resident closes the curtain on Harry. Elsewhere, Bo Catlett, with Bear and Farrah, shares a smile. Chili's minivan arrives as Harry, bandaged and neck-braced, emerges from a cab. He dismisses attention, mumbles through his wired jaw, and limps to his destination, drawing all eyes as he's seated at a table."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table Harry waves them off Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her Bo Catlett looks at the Bear and smiles at Farrah Meanwhile standing beside a giant mutant maggot or something They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him Chili looks at her puts his drink down leans over and kisses her Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject He looks over and she comes over and sits down Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway Harry looks pleadingly at Ray Bones then rolls over onto his side Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry waves them off Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black Meanwhile standing beside a giant mutant maggot or something Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out Harry looks pleadingly at Ray Bones then rolls over onto his side They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her Chili looks at her puts his drink down leans over and kisses her Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face Bo Catlett looks at the Bear and smiles at Farrah Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway He looks over and she comes over and sits down Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later Karen and Chili lie in bed together and she looks at him before leaning over to kiss him They both jerk upright as Doris leads them towards the triage area where they exchange a look and follow her in Doris smiles as two uniformed cops walk past Harry who lies in bed in a painkiller stupor with his face swollen and purple and both eyes black They all look over as a Resident walks over trailed by several and they step back as the Resident pulls the curtain shut blocking their view of Harry Meanwhile standing beside a giant mutant maggot or something Bo Catlett looks at the Bear and smiles at Farrah Bear watches uncomfortably as Farrah sits down with Bo who looks up at the Bear and winks at Farrah then keeps his mouth close to her ear and opens the door for her Chili's minivan is parked out front and as the valet drives off with it a cab pulls up and Harry with his hands bandaged and neck in a massive brace gets out Harry waves them off points to himself and mumbles through his wired jaw then pushes past them and limps up the steps while all eyes are on him as they are led to a table Ray Bones steps on Harry's neck with his shoe pinning him to the floor and Harry cannot speak because his jaw is broken Harry looks sad lying there pinned beneath Ray Bones' shoe wondering how it all went so wrong As a crumpled heap Harry looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room pulls a 9mm from his coat pocket and aims it at Harry's face Ray Bones looks over when Ronnie Wingate strolls into the office and Harry looks glad to see him Ronnie opens his jacket so Ray Bones can see the 357 tucked into his belt Bones looks at the gun looks up at Ronnie standing there hands on his hips jacket open then raises his own gun Harry looks pleadingly at Ray Bones then rolls over onto his side Meanwhile Chili is sitting in a chaise longue by the pool with a beer in hand and Karen watches him from the doorway He looks over and she comes over and sits down Chili looks at Karen for a moment and as she feels him staring she keeps her eyes on the sunset and tries to change the subject Chili looks at her puts his drink down leans over and kisses her"
        }
      ]
    }
  ]
}