{
  "ground_truth": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the corner. The shape lunges out at her. He lunges again with the knife. He lunges at her suddenly with the knife. He stands there holding up the piece of material, then raises the butcher knife and moves for her. The hand grasps a piece of Laurie's blouse and rips it. The knife slices across her arm, ripping her flesh. She screams and spins around. Laurie bumps back into the railing. She leaps backward to avoid the blade and slips over the edge of the railing. The camera pounces down from the second floor and slams into the floor. The camera moves with her as she backs away, screaming at the top of her lungs. She hits the floor and rolls over, holding her leg painfully. It is the shape, wearing the mask, the butcher knife in his hand, gleaming. The shape moves to the top of the staircase and starts down toward her. Then she looks up at the staircase. She pulls herself up off the floor and hobbles into the living room. The shape races down the stairs. She moves for the kitchen. She crawls to the kitchen, rolls inside and slams the kitchen door behind her. In a flash, she leaps up and clicks the lock. She sees the kitchen window over the sink. Laurie slowly climbs to her feet and limps toward the back door. Her hand tries the door. Desperately she tries the door, glancing behind her. There is a pounding on the door from the other side. Suddenly, the kitchen door explodes, the middle of it breaking. The shape reaches through, groping for the lock. The shape's hand reaches for the lock. The shape's hand grabs the lock and clicks it open. The shape pushes the door open and leaps into the kitchen. With a heave, she opens it half-way. She can only get it three-fourths open. She drags herself roughly out the window. Laurie picks herself up from the ground and runs as fast as she can, limping across the backyard, camera moving with her. She looks behind her. She trips on the fallen lamp and falls to the floor. She passes the driveway and scurries into the neighbor's backyard, up to the back door of the house. She pounds furiously on the door. Laurie continues to pound on the door. The back porch light comes on. Through the glass in the back door we see an old woman dressed in a nightgown approach.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She can solely gaze in terror at the spectacle of her deceased companion. It is almost as if our eyes have abruptly commenced to adapt to the gloom and we perceive the silhouette of a male positioned right behind her. The silhouette becomes increasingly distinct. Laurie abruptly shifts away from the corner. The figure lunges out at her. He lunges again with the dagger. He lunges at her abruptly with the dagger. He stands there grasping the fragment of fabric, then elevates the butcher dagger and advances toward her. The hand clutches a fragment of Laurie's shirt and tears it. The dagger cuts across her arm, tearing her skin. She shrieks and twirls around. Laurie bumps back into the barrier. She jumps backward to evade the blade and slips over the margin of the barrier. The camera pounces down from the second story and crashes onto the ground. The camera moves with her as she retreats, shrieking at the top of her lungs. She strikes the ground and rolls over, clutching her leg painfully. It is the figure, wearing the disguise, the butcher dagger in his hand, shining. The figure moves to the top of the staircase and begins down toward her. Then she gazes up at the staircase. She pulls herself up off the ground and hobbles into the lounge. The figure dashes down the stairs. She advances toward the kitchenette. She crawls to the kitchenette, rolls inside and slams the kitchenette door behind her. In an instant, she jumps up and clicks the latch. She observes the kitchenette window over the basin. Laurie slowly climbs to her feet and limps toward the rear door. Her hand tries the door. Desperately she attempts the door, glancing behind her. There is a pounding on the door from the opposite side. Suddenly, the kitchenette door bursts, the center of it shattering. The figure reaches through, groping for the latch. The figure's hand reaches for the latch. The figure's hand seizes the latch and clicks it open. The figure pushes the door open and jumps into the kitchenette. With a heave, she opens it partially. She can only get it three-fourths open. She drags herself roughly out the window. Laurie picks herself up from the ground and runs as fast as she can, limping across the backyard, camera accompanying her. She looks behind her. She stumbles on the fallen lamp and falls to the ground. She passes the driveway and scurries into the neighbor's backyard, up to the rear door of the residence. She pounds furiously on the door. Laurie continues to pound on the door. The rear porch light activates. Through the glass in the rear door we observe an elderly woman attired in a nightgown approach."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and the outline of a man standing right behind her is seen by us. The outline becomes more and more clear. The corner is suddenly moved away from by Laurie. She is lunged at by the shape. The knife is lunged again with by him. The knife is suddenly lunged at her with by him. A piece of material is held up by him, then he raises the butcher knife and moves for her. A piece of Laurie's blouse is grasped by the hand and it is ripped. Her arm is sliced across by the knife, ripping her flesh. She screams and spins around. The railing is bumped back into by Laurie. The blade is avoided by her leaping backward, and she slips over the edge of the railing. The floor is slammed into by the camera as it pounces down from the second floor. The camera moves with her as she backs away, screaming at the top of her lungs. The floor is hit by her and she rolls over, holding her leg painfully. It is the shape, wearing the mask, the butcher knife in his hand, gleaming. The top of the staircase is moved to by the shape, and he starts down toward her. Then the staircase is looked up at by her. The floor is pulled herself up off by her, and she hobbles into the living room. The stairs are raced down by the shape. The kitchen is moved for by her. The kitchen is crawled to by her, she rolls inside and the kitchen door is slammed behind her. In a flash, up is leaped by her and the lock is clicked. The kitchen window over the sink is seen by her. Her feet are slowly climbed to by Laurie, and the back door is limped toward. The door is tried by her hand. Desperately the door is tried by her, and she glances behind her. A pounding on the door from the other side is made. Suddenly, the kitchen door explodes, breaking in the middle. The lock is groped for by the shape through the door. The lock is reached for by the shape's hand. The lock is grabbed by the shape's hand and it is clicked open. The door is pushed open by the shape and he leaps into the kitchen. With a heave, it is opened half-way by her. Only three-fourths open can it be gotten by her. Out the window is dragged herself roughly by her. The ground is picked herself up from by Laurie and as fast as she can, limping across the backyard, she runs with the camera moving with her. Behind her is looked by her. The fallen lamp is tripped on by her and she falls to the floor. The driveway is passed by her and the neighbor's backyard is scurried into by her, up to the back door of the house. The door is pounded on furiously by her. The door is continued to be pounded on by Laurie. The back porch light comes on. An old woman dressed in a nightgown is seen through the glass in the back door approaching."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She stares in horror at her dead friend. As if our eyes adjust to the dark, we see the outline of a man behind her, growing clearer. Laurie suddenly moves from the corner. The shape lunges at her with a knife, grasping her blouse and ripping it. The blade slices her arm. She screams, spins, and hits the railing. Leaping to avoid the knife, she slips over the edge. The camera follows her fall, slamming to the floor as she screams. She rolls over, holding her leg in pain. The shape, masked and holding a gleaming knife, appears at the top of the stairs. She looks up, pulls herself up, and hobbles to the living room. The shape races downstairs. She crawls into the kitchen and slams the door. Jumping up, she locks it, then limps toward the back door, trying it desperately. A pounding starts. The door explodes; the shape's hand gropes through, grabs the lock, and clicks it open. The shape bursts in. She pushes the window half open, dragging herself out. Laurie limps across the yard with the camera following. She trips on a fallen lamp, gets up, and runs into the neighbor's backyard. She pounds on their back door. The porch light comes on. Through the glass, an old woman in a nightgown approaches."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Laurie stares in horror at her dead friend. As our eyes adjust to the darkness, we see a man behind her. The outline becomes clear, and Laurie moves away. The shape lunges with a knife, ripping her blouse and slicing her arm. She screams, spins, and slips over the railing. The camera follows her fall. The masked shape with a knife moves down the stairs. Laurie hobbles into the living room, then crawls to the kitchen, locking the door. She limps to the back door, trying it desperately. The kitchen door breaks, and the shape unlocks it, entering. Laurie drags herself out the window, runs limping across the yard, and trips. She reaches a neighbor's house, pounding on the door. The porch light comes on, revealing an old woman in a nightgown approaching."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She can do nothing but stare in utter horror at the terrifying sight of her dear, lifeless friend. It is almost as if our eyes have suddenly begun to adjust to the oppressive darkness, and we can now discern the ominous outline of a man standing menacingly right behind her. Gradually, the outline becomes more and more distinct and clear. In a sudden burst of movement, Laurie quickly moves away from the corner. The shape lunges out at her with alarming speed. He lunges once more with the knife, his intent clear. He lunges at her suddenly, brandishing the knife with deadly precision. He stands there, holding up the piece of material, then raises the gleaming butcher knife and advances toward her with determination. The hand grasps a piece of Laurie's blouse and violently rips it. The knife slices across her arm, tearing her flesh with a brutal cut. She lets out a piercing scream and spins around in panic. Laurie bumps back into the railing, her heart racing. She leaps backward in a desperate attempt to avoid the deadly blade and slips over the edge of the railing. The camera dramatically pounces down from the second floor and slams into the floor with a thud. The camera moves with her as she backs away, screaming at the top of her lungs in sheer terror. She hits the floor hard and rolls over, clutching her leg in excruciating pain. It is the shape, wearing the mask, the butcher knife in his hand, gleaming ominously. The shape moves to the top of the staircase and starts descending toward her with a menacing intent. Then she looks up at the staircase, fear gripping her. She pulls herself up off the floor and hobbles into the living room, her movements frantic. The shape races down the stairs with alarming speed. She makes a desperate move for the kitchen. She crawls to the kitchen, rolls inside, and slams the kitchen door shut behind her with urgency. In a flash, she leaps up and clicks the lock, her heart pounding. She sees the kitchen window over the sink, a potential escape route. Laurie slowly climbs to her feet and limps toward the back door, her determination unwavering. Her hand tries the door, desperately seeking escape. Desperately, she tries the door, glancing behind her with growing fear. There is a pounding on the door from the other side, a relentless force. Suddenly, the kitchen door explodes, the middle of it breaking with a loud crash. The shape reaches through, groping for the lock with a determined hand. The shape's hand reaches for the lock, its intent clear. The shape's hand grabs the lock and clicks it open with a chilling finality. The shape pushes the door open and leaps into the kitchen with a menacing presence. With a heave, she opens it halfway, her strength waning. She can only get it three-fourths open, her desperation mounting. She drags herself roughly out the window, her escape frantic. Laurie picks herself up from the ground and runs as fast as she can, limping across the backyard, the camera moving with her, capturing her every move. She looks behind her, fear etched on her face. She trips on the fallen lamp and falls to the floor, her momentum halted. She passes the driveway and scurries into the neighbor's backyard, up to the back door of the house, her hope renewed. She pounds furiously on the door, her desperation palpable. Laurie continues to pound on the door, her urgency growing. The back porch light comes on, illuminating the scene. Through the glass in the back door, we see an old woman dressed in a nightgown approach, her presence a beacon of hope."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In an overwhelming state of disbelief and absolute terror, she stands frozen, completely unable to do anything other than stare at the horrifying sight of her dear friend lying there, lifeless. It's as though, in that chilling moment, our eyes are finally beginning to adjust to the stifling darkness surrounding us, allowing us to make out the foreboding shape of a man ominously positioned just behind her. Bit by bit, this shadowy figure becomes increasingly clearer and more distinct. Suddenly, with a burst of energy, Laurie swiftly pulls herself away from the corner she was backed into. In an instant, the shape lunges at her, moving with a speed that's both alarming and threatening. His intent becomes unmistakably clear as he lunges once again, brandishing the knife with a deadly precision. He stands, holding a piece of fabric aloft, then raises the gleaming butcher knife, moving forward with a determined menace. He grips a piece of Laurie's blouse with his hand, tearing it violently. The blade slices across her arm, delivering a brutal cut that tears through her flesh. She lets out a blood-curdling scream, spinning around in sheer panic and fear. Her back hits the railing forcefully, her heart racing uncontrollably. In a move of desperation, she leaps back in an attempt to evade the deadly knife, slipping over the edge of the railing. The camera follows dramatically, descending from the second floor with a thunderous thud as it hits the floor. The camera stays with her as she backs away in terror, her screams echoing loudly. She crashes to the floor hard and rolls over, clutching her leg in excruciating pain. It is the shape, now wearing the mask, holding the butcher knife in his hand, gleaming in a menacing way. The shape moves to the top of the staircase and starts descending toward her with an unmistakably menacing intent. She raises her eyes to the staircase, paralyzed with fear. Mustering her strength, she pulls herself up off the floor, hobbling frantically into the living room. The shape races down the stairs with alarming, rapid speed. She makes a desperate dash towards the kitchen. Crawling in a frenzy, she rolls into the kitchen and slams the door shut behind her with a sense of urgency. In a swift movement, she leaps up and clicks the lock, her heart thundering in her chest. Her eyes then catch sight of the kitchen window above the sink, a potential path to freedom. Laurie slowly climbs to her feet, her determination relentless, and limps towards the back door. Desperately, she tries the door, hoping for escape while repeatedly glancing behind her, fear growing with each passing second. There's a pounding on the door from the other side, a relentless and forceful banging. Suddenly, the kitchen door bursts open with a loud crash, the middle splintering violently. The shape's hand reaches through, fervently groping for the lock with undeniable determination. The determined hand of the shape finds the lock, clicking it open with chilling finality. The shape pushes the door open further and leaps into the kitchen, his presence menacing and foreboding. She struggles, heaving the door open halfway, her strength fading fast. Struggling in desperation, she only manages to get it three-fourths open, her anxiety mounting rapidly. She drags herself through the window frantically, her escape a desperate and rough scramble. Laurie picks herself up from the ground, pushing on despite the pain, and starts running as fast as her injured leg allows, limping across the backyard while the camera captures her every anxious move. Looking back, fear is etched deeply on her face. She stumbles over a fallen lamp and crashes to the floor, her momentum suddenly halted. Quickly recovering, she races past the driveway and into the neighbor's backyard, heading straight to the back door of the house, her hope reignited. She pounds furiously on the door, her desperation reaching a fever pitch. Laurie continues to hammer on the door, urgency in every pound, as if her life depends on it. Suddenly, the back porch light flicks on, illuminating the scene. Through the glass of the back door, an elderly woman, dressed in a simple nightgown, approaches, her presence a glimmering sign of hope in this desperate situation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She stands frozen, her eyes wide with horror as she takes in the sight of her dead friend, unable to tear her gaze away. Gradually, as if her eyes are adjusting to the dim light, she begins to discern the faint outline of a man standing ominously behind her. The outline sharpens, becoming more distinct with each passing moment. Suddenly, Laurie jolts away from the corner, her instincts kicking in as the shape lunges at her with a knife. He lunges again, the blade glinting menacingly as it slices through the air toward her. In a swift motion, he holds up a piece of material, then raises the butcher knife with intent and advances toward her. His hand snatches a piece of Laurie's blouse, tearing it with a vicious tug. The knife slashes across her arm, the sharp edge ripping through her flesh, causing her to scream in pain and spin around in a desperate attempt to escape. Laurie stumbles backward, colliding with the railing, and in a frantic bid to evade the blade, she leaps backward, only to slip over the edge of the railing. The camera follows her descent from the second floor, crashing down to the floor below. As she backs away, her screams echo through the space, her voice reaching a fever pitch. She hits the floor hard, rolling over and clutching her leg in agony. The shape, masked and wielding the gleaming butcher knife, moves to the top of the staircase, beginning his descent toward her. Laurie glances up at the staircase, fear propelling her to pull herself off the floor and hobble into the living room. The shape races down the stairs with alarming speed. She makes a desperate move for the kitchen, crawling and rolling inside before slamming the kitchen door shut behind her. In a swift motion, she leaps up and clicks the lock into place. Her eyes dart to the kitchen window above the sink, and she slowly rises to her feet, limping toward the back door. Her hand fumbles with the door handle, trying it desperately while casting nervous glances over her shoulder. A sudden pounding on the door from the other side sends a jolt of terror through her. Without warning, the kitchen door shatters, the middle splintering as the shape's hand reaches through, groping for the lock. His hand finds the lock, clicks it open, and he pushes the door wide, leaping into the kitchen. With a determined heave, she manages to open the door halfway, but can only get it three-fourths open before she drags herself roughly out the window. Laurie picks herself up from the ground, her body aching, and runs as fast as her limping legs will carry her across the backyard, the camera tracking her every move. She glances back, fear driving her forward, but she trips over a fallen lamp and crashes to the floor. Undeterred, she scrambles past the driveway and into the neighbor's backyard, making her way to the back door of the house. She pounds furiously on the door, her fists hammering against the wood in a frantic plea for help. Laurie continues to pound, her desperation palpable, until the back porch light flickers on. Through the glass in the back door, she sees an old woman in a nightgown approaching, her presence a glimmer of hope in the darkness."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Laurie is horrified by the sight of her dead friend and becomes aware of a man standing behind her. As the figure becomes clearer, Laurie moves away, but he lunges at her with a knife, tearing her blouse and slicing her arm. She screams, spins around, and backs into the railing, leaping backward to avoid the blade and slipping over the edge. The camera follows her as she falls, hits the floor, and rolls over in pain. The masked figure with the knife approaches the staircase and descends toward her. Laurie pulls herself up, hobbles into the living room, and heads for the kitchen, slamming and locking the door behind her. She attempts to escape through the back door, but the figure breaks through the kitchen door, unlocks it, and enters. Laurie manages to open the window partially and drags herself out, picking herself up and limping across the backyard. She trips over a lamp but continues to the neighbor's backyard, pounding on the back door. The porch light comes on, and an old woman in a nightgown approaches the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She can only stare in horror at the sight of her dead friend, who had been the life of the neighborhood with her vibrant personality. It is almost as if our eyes have suddenly begun to adjust to the darkness, like when coming indoors from bright sunlight, and we see the outline of a man standing right behind her. The outline becomes more and more clear, much like a photograph slowly developing. Laurie suddenly moves away from the corner, where she had been hiding next to an old wooden dresser. The shape lunges out at her. He lunges again with the knife, a large blade that glints ominously in the dim light. He lunges at her suddenly with the knife that catches the faint illumination from a nearby streetlamp. He stands there holding up the piece of material, frayed and blue, then raises the butcher knife, a tool traditionally used in kitchens for large cuts of meat, and moves for her. The hand grasps a piece of Laurie's blouse, a gift from her late grandmother, and rips it. The knife slices across her arm, ripping her flesh, leaving a trail of blood that glistens like paint on canvas. She screams and spins around, her voice echoing off the walls. Laurie bumps back into the railing, which is splintered from years of neglect. She leaps backward to avoid the blade and slips over the edge of the railing, which is a narrow wooden structure that barely holds her weight. The camera pounces down from the second floor, moving like a predatory animal, and slams into the floor. The camera moves with her as she backs away, screaming at the top of her lungs, her voice a piercing cry for help. She hits the floor and rolls over, holding her leg painfully, where a bruise is already forming. It is the shape, wearing the mask, featureless and blank, the butcher knife in his hand, gleaming with a menacing sheen. The shape moves to the top of the staircase and starts down toward her, each step echoing in the silence. Then she looks up at the staircase, where shadows dance eerily on the walls. She pulls herself up off the floor, gritting her teeth against the pain, and hobbles into the living room, furnished with outdated furniture from the 1970s. The shape races down the stairs, moving with a chilling swiftness. She moves for the kitchen, her sanctuary, cluttered with dishes and old newspapers. She crawls to the kitchen, rolls inside, and slams the kitchen door behind her, a painted white door with peeling edges. In a flash, she leaps up and clicks the lock, a simple deadbolt that seems impossibly flimsy. She sees the kitchen window over the sink, a small square pane that looks out to the quiet backyard. Laurie slowly climbs to her feet and limps toward the back door, an exit that has always been kept locked for safety. Her hand tries the door, which sticks slightly from humidity. Desperately she tries the door, glancing behind her with terror in her eyes. There is a pounding on the door from the other side, like a battering ram in a medieval siege. Suddenly, the kitchen door explodes, the middle of it breaking as if struck by a heavy object. The shape reaches through, groping for the lock with fingers that seem impossibly long. The shape's hand reaches for the lock, brushing against its cool metal. The shape's hand grabs the lock and clicks it open, a sound as loud as thunder in the silence. The shape pushes the door open and leaps into the kitchen, the wood groaning under the pressure. With a heave, she opens it halfway. She can only get it three-fourths open, the hinges groaning in protest. She drags herself roughly out the window, scraping her leg on the sill. Laurie picks herself up from the ground and runs as fast as she can, limping across the backyard, a grassy expanse dotted with dandelions, camera moving with her as if documenting a wildlife escape. She looks behind her, her heart pounding like a drum. She trips on the fallen lamp, an old heirloom her mother cherished, and falls to the floor. She passes the driveway, which is cracked from years of frost, and scurries into the neighbor's backyard, up to the back door of the house, a small colonial-style home. She pounds furiously on the door, her fists creating a steady rhythm of desperation. Laurie continues to pound on the door, each hit echoing her urgent need for safety. The back porch light comes on, illuminating the scene like a stage. Through the glass in the back door, we see an old woman dressed in a nightgown, reminiscent of a bygone era, approach with a look of confusion."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She can only stare in horror at the sight of her dead friend  It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her  The outline becomes more and more clear  Laurie suddenly moves away from the corner  The shape lunges out at her  He lunges again with the knife  He lunges at her suddenly with the knife  The shape races down the stairs  She moves for the kitchen  She crawls to the kitchen rolls inside and slams the kitchen door behind her  In a flash she leaps up and clicks the lock  She sees the kitchen window over the sink  Laurie slowly climbs to her feet and limps toward the back door  Her hand tries the door  Desperately she tries the door glancing behind her  There is a pounding on the door from the other side  Suddenly the kitchen door explodes the middle of it breaking  The shape reaches through groping for the lock  The shape's hand reaches for the lock  The shape's hand grabs the lock and clicks it open  The shape pushes the door open and leaps into the kitchen  With a heave she opens it halfway  She can only get it threefourths open  She drags herself roughly out the window  Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her  She looks behind her  She trips on the fallen lamp and falls to the floor  She passes the driveway and scurries into the neighbor's backyard up to the back door of the house  She pounds furiously on the door  Laurie continues to pound on the door  He stands there holding up the piece of material then raises the butcher knife and moves for her  The hand grasps a piece of Laurie's blouse and rips it  The knife slices across her arm ripping her flesh  She screams and spins around  Laurie bumps back into the railing  She leaps backward to avoid the blade and slips over the edge of the railing  The camera pounces down from the second floor and slams into the floor  The camera moves with her as she backs away screaming at the top of her lungs  She hits the floor and rolls over holding her leg painfully  It is the shape wearing the mask the butcher knife in his hand gleaming  The shape moves to the top of the staircase and starts down toward her  Then she looks up at the staircase  She pulls herself up off the floor and hobbles into the living room  The shape races down the stairs  She moves for the kitchen  She crawls to the kitchen rolls inside and slams the kitchen door behind her  In a flash she leaps up and clicks the lock  She sees the kitchen window over the sink  Laurie slowly climbs to her feet and limps toward the back door  Her hand tries the door  Desperately she tries the door glancing behind her  There is a pounding on the door from the other side  Suddenly the kitchen door explodes the middle of it breaking  The shape reaches through groping for the lock  The shape's hand reaches for the lock  The shape's hand grabs the lock and clicks it open  The shape pushes the door open and leaps into the kitchen  With a heave she opens it halfway  She can only get it threefourths open  She drags herself roughly out the window  Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her  She looks behind her  She trips on the fallen lamp and falls to the floor  She passes the driveway and scurries into the neighbor's backyard up to the back door of the house  She pounds furiously on the door  Laurie continues to pound on the door  The back porch light comes on  Through the glass in the back door  we see an old woman dressed in a nightgown approach"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the corner. The shape lunges out at her. He lunges again with the knife. He lunges at her suddenly with the knife. He stands there holding up the piece of material then raises the butcher knife and moves for her. The hand grasps a piece of Laurie's blouse and rips it. The knife slices across her arm ripping her flesh. She screams and spins around. Laurie bumps back into the railing. She leaps backward to avoid the blade and slips over the edge of the railing. The camera pounces down from the second floor and slams into the floor. The camera moves with her as she backs away screaming at the top of her lungs. She hits the floor and rolls over holding her leg painfully. It is the shape wearing the mask the butcher knife in his hand gleaming. The shape moves to the top of the staircase and starts down toward her. Then she looks up at the staircase. She pulls herself up off the floor and hobbles into the living room. The shape races down the stairs. She moves for the kitchen. She crawls to the kitchen rolls inside and slams the kitchen door behind her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. In a flash she leaps up and clicks the lock. She sees the kitchen window over the sink. Laurie slowly climbs to her feet and limps toward the back door. Her hand tries the door. Desperately she tries the door glancing behind her. There is a pounding on the door from the other side. Suddenly the kitchen door explodes the middle of it breaking. The shape reaches through groping for the lock. The shape's hand reaches for the lock. The shape's hand grabs the lock and clicks it open. The shape pushes the door open and leaps into the kitchen. With a heave she opens it halfway. She can only get it threefourths open. She drags herself roughly out the window. Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her. She looks behind her. She trips on the fallen lamp and falls to the floor. She passes the driveway and scurries into the neighbor's backyard up to the back door of the house. She pounds furiously on the door. Laurie continues to pound on the door. The back porch light comes on. Through the glass in the back door. we see an old woman dressed in a nightgown approach."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the corner. The shape lunges out at her. He lunges again with the knife. He lunges at her suddenly with the knife. He stands there holding up the piece of material then raises the butcher knife and moves for her. The hand grasps a piece of Laurie's blouse and rips it. The knife slices across her arm ripping her flesh. She screams and spins around. Laurie bumps back into the railing. She leaps backward to avoid the blade and slips over the edge of the railing. The camera pounces down from the second floor and slams into the floor. The camera moves with her as she backs away screaming at the top of her lungs. She hits the floor and rolls over holding her leg painfully. It is the shape wearing the mask the butcher knife in his hand gleaming. The shape moves to the top of the staircase and starts down toward her. Then she looks up at the staircase. She pulls herself up off the floor and hobbles into the living room. The shape races down the stairs. She moves for the kitchen. She crawls to the kitchen rolls inside and slams the kitchen door behind her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a flash she leaps up and clicks the lock. She sees the kitchen window over the sink. Laurie slowly climbs to her feet and limps toward the back door. Her hand tries the door. Desperately she tries the door glancing behind her. There is a pounding on the door from the other side. Suddenly the kitchen door explodes the middle of it breaking. The shape reaches through groping for the lock. The shape's hand reaches for the lock. The shape's hand grabs the lock and clicks it open. The shape pushes the door open and leaps into the kitchen. With a heave she opens it halfway. She can only get it threefourths open. She drags herself roughly out the window. Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her. She looks behind her. She trips on the fallen lamp and falls to the floor. She passes the driveway and scurries into the neighbor's backyard up to the back door of the house. She pounds furiously on the door. Laurie continues to pound on the door. The back porch light comes on. Through the glass in the back door. we see an old woman dressed in a nightgown approach."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the corner. The shape lunges out at her. He lunges again with the knife. He lunges at her suddenly with the knife. He stands there holding up the piece of material then raises the butcher knife and moves for her. The hand grasps a piece of Laurie's blouse and rips it. The knife slices across her arm ripping her flesh. She screams and spins around. Laurie bumps back into the railing. She can only get it threefourths open. She drags herself roughly out the window. Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her. She looks behind her. She trips on the fallen lamp and falls to the floor. She passes the driveway and scurries into the neighbor's backyard up to the back door of the house. She pounds furiously on the door. Laurie continues to pound on the door. The back porch light comes on. Through the glass in the back door. we see an old woman dressed in a nightgown approach."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She can only stare in horror at the sight of her dead friend. It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the corner. The shape lunges out at her. She pounds furiously on the door. Laurie continues to pound on the door. The back porch light comes on. Through the glass in the back door. we see an old woman dressed in a nightgown approach."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel can only stare in horror at the sight of her dead friend. It is almost as if the stars have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind the squirrel. The outline becomes more and more clear. The rabbit suddenly moves away from the corner. The shape lunges out at the rabbit. The tree lunges again with the knife. The tree lunges at the rabbit suddenly with the knife. The tree stands there holding up the piece of material, then raises the butcher knife and moves for the rabbit. The branch grasps a piece of the rabbit's blouse and rips it. The knife slices across the rabbit's arm, ripping the rabbit's flesh. The rabbit screams and spins around. The rabbit bumps back into the railing. The rabbit leaps backward to avoid the blade and slips over the edge of the railing. The camera pounces down from the second floor and slams into the floor. The camera moves with the rabbit as the rabbit backs away, screaming at the top of the rabbit's lungs. The rabbit hits the floor and rolls over, holding the rabbit's leg painfully. It is the shape, wearing the mask, the butcher knife in its hand, gleaming. The shape moves to the top of the staircase and starts down toward the rabbit. Then the rabbit looks up at the staircase. The rabbit pulls itself up off the floor and hobbles into the living room. The shape races down the stairs. The rabbit moves for the kitchen. The rabbit crawls to the kitchen, rolls inside and slams the kitchen door behind the rabbit. In a flash, the rabbit leaps up and clicks the lock. The rabbit sees the kitchen window over the sink. The rabbit slowly climbs to its feet and limps toward the back door. The rabbit's hand tries the door. Desperately the rabbit tries the door, glancing behind the rabbit. There is a pounding on the door from the other side. Suddenly, the kitchen door explodes, the middle of it breaking. The shape reaches through, groping for the lock. The shape's hand reaches for the lock. The shape's hand grabs the lock and clicks it open. The shape pushes the door open and leaps into the kitchen. With a heave, the rabbit opens it halfway. The rabbit can only get it three-fourths open. The rabbit drags itself roughly out the window. The rabbit picks itself up from the ground and runs as fast as the rabbit can, limping across the backyard, camera moving with the rabbit. The rabbit looks behind the rabbit. The rabbit trips on the fallen lamp and falls to the floor. The rabbit passes the driveway and scurries into the neighbor's backyard, up to the back door of the house. The rabbit pounds furiously on the door. The rabbit continues to pound on the door. The back porch light comes on. Through the glass in the back door, we see a young cat dressed in a nightgown approach."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She can only stare in horror at the sight of her fallen friend. It is almost as if our eyes have suddenly begun to adjust to the fog and we see the outline of a figure standing right behind her. The outline becomes more and more clear. Laurie suddenly moves away from the wall. The figure lunges out at her. He lunges again with the spear. He lunges at her suddenly with the spear. He stands there holding up the piece of cloth, then raises the carving knife and moves for her. The hand grasps a piece of Laurie's coat and rips it. The spear slices across her arm, tearing her flesh. She screams and spins around. Laurie bumps back into the bookshelf. She leaps backward to avoid the blade and slips over the edge of the bookshelf. The camera pounces down from the balcony and slams into the ground. The camera moves with her as she backs away, screaming at the top of her lungs. She hits the ground and rolls over, holding her foot painfully. It is the figure, wearing the mask, the carving knife in his hand, gleaming. The figure moves to the top of the ladder and starts down toward her. Then she looks up at the ladder. She pulls herself up off the ground and hobbles into the hallway. The figure races down the ladder. She moves for the pantry. She crawls to the pantry, rolls inside and slams the pantry door behind her. In a flash, she leaps up and clicks the lock. She sees the pantry window over the counter. Laurie slowly climbs to her feet and limps toward the side door. Her hand tries the door. Desperately she tries the door, glancing behind her. There is a pounding on the door from the other side. Suddenly, the pantry door explodes, the middle of it breaking. The figure reaches through, groping for the lock. The figure's hand reaches for the lock. The figure's hand grabs the lock and clicks it open. The figure pushes the door open and leaps into the pantry. With a heave, she opens it half-way. She can only get it three-fourths open. She drags herself roughly out the window. Laurie picks herself up from the gravel and runs as fast as she can, limping across the courtyard, camera moving with her. She looks behind her. She trips on the fallen bike and falls to the ground. She passes the garage and scurries into the neighbor's courtyard, up to the side door of the building. She pounds furiously on the door. Laurie continues to pound on the door. The garage light comes on. Through the glass in the side door we see an old man dressed in pajamas approach."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She can only gawk in disbelief at the sight of her dead friend. It is almost as if our eyes have suddenly started to blur in the darkness and we glimpse the shadow of a man hovering right behind her. The shadow becomes more and more faint. Laurie suddenly darts away from the corner. The shape slides out at her. He steps again with the knife. He skips at her suddenly with the knife. He stands there tossing up the piece of material, then lowers the butcher knife and strolls for her. The hand releases a piece of Laurie's blouse and flicks it. The knife brushes across her arm, tapping her flesh. She gasps and twirls around. Laurie squeezes back into the railing. She lunges backward to dodge the blade and stumbles over the edge of the railing. The camera swoops down from the second floor and crashes into the floor. The camera glides with her as she slides away, shouting at the top of her lungs. She touches the floor and flips over, holding her leg gingerly. It is the shape, wearing the mask, the butcher knife in his hand, shimmering. The shape descends to the top of the staircase and steps down toward her. Then she glances up at the staircase. She hauls herself up off the floor and stumbles into the living room. The shape zooms down the stairs. She dashes for the kitchen. She creeps to the kitchen, rolls inside and pulls the kitchen door behind her. In a flash, she springs up and twists the lock. She observes the kitchen window above the sink. Laurie gradually lifts to her feet and ambles toward the back door. Her hand pushes the door. Desperately she shoves the door, peering behind her. There is a thumping on the door from the other side. Suddenly, the kitchen door implodes, the middle of it shattering. The shape reaches through, grasping for the lock. The shape's hand snatches for the lock. The shape's hand flips the lock and swings it open. The shape slides the door open and hops into the kitchen. With a nudge, she pushes it half-way. She can only get it three-fourths open. She hauls herself swiftly out the window. Laurie gets herself up from the ground and hurries as fast as she can, limping across the backyard, camera gliding with her. She peeks behind her. She stumbles on the fallen lamp and crashes to the floor. She skips past the driveway and rushes into the neighbor's backyard, up to the back door of the house. She taps lightly on the door. Laurie continues to tap on the door. The back porch light flicks on. Through the glass in the back door, we spot an old woman dressed in a nightgown advancing."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mug can only stare in horror at the sight of its shattered plate. It is almost as if our carrots have suddenly begun to adjust to the fog and we see the outline of a tree standing right behind it. The outline becomes more and more distinct. The ribbon suddenly floats away from the bookshelf. The cloud lunges out at it. The cloud lunges again with the shovel. The cloud lunges at it suddenly with the shovel. The cloud stands there holding up the string, then raises the garden hoe and moves for it. The cloud's branch grasps a piece of the ribbon's fabric and rips it. The shovel slices across its bark, ripping its surface. The mug screams and spins around. The ribbon bumps back into the fence. The ribbon leaps backward to avoid the blade and slips over the edge of the fence. The teapot pounces down from the second floor and slams into the ground. The teapot moves with it as it backs away, screaming at the top of its lungs. The ribbon hits the ground and rolls over, holding its twig painfully. It is the cloud, wearing the pirate hat, the garden hoe in its branch, gleaming. The cloud moves to the top of the escalator and starts down toward it. Then the ribbon looks up at the escalator. The ribbon pulls itself up off the ground and hobbles into the dining room. The cloud races down the stairs. The ribbon moves for the pantry. The ribbon crawls to the pantry, rolls inside and slams the pantry door behind it. In a flash, the ribbon leaps up and clicks the lock. The ribbon sees the pantry window over the counter. The ribbon slowly climbs to its wheels and limps toward the hatch. Its branch tries the hatch. Desperately it tries the hatch, glancing behind it. There is a pounding on the hatch from the other side. Suddenly, the pantry door explodes, the middle of it breaking. The cloud reaches through, groping for the latch. The cloud's branch reaches for the latch. The cloud's branch grabs the latch and clicks it open. The cloud pushes the door open and leaps into the pantry. With a heave, the ribbon opens it half-way. The ribbon can only get it three-fourths open. The ribbon drags itself roughly out the window. The ribbon picks itself up from the ground and runs as fast as it can, limping across the courtyard, teapot moving with it. The ribbon looks behind it. The ribbon trips on the fallen umbrella and falls to the carpet. The ribbon passes the pathway and scurries into the neighbor's courtyard, up to the hatch of the barn. The ribbon pounds furiously on the hatch. The ribbon continues to pound on the hatch. The back lantern light comes on. Through the glass in the back hatch we see an old orange dressed in a nightcap approach."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He can only gape in surprise at the sight of his lost pet. It is almost as if our senses have suddenly begun to adapt to the sound and we hear the murmur of a ghost whispering right beside him. The murmur becomes more and more distinct. Mark abruptly stumbles away from the window. The figure darts out at him. She darts again with the broom. She darts at him suddenly with the broom. She stands there waving around the piece of cloth, then lifts the rolling pin and charges at him. The foot snags a piece of Mark's jacket and tears it. The rolling pin glides across his shoulder, bruising his skin. He gasps and twists away. Mark knocks back into the bookshelf. He springs backward to evade the swing and tumbles over the edge of the bookshelf. The spotlight swoops down from the second floor and crashes into the ground. The spotlight follows him as he retreats, shouting at the top of his voice. He hits the ground and flips over, clutching his ankle painfully. It is the figure, wearing the hat, the rolling pin in her grasp, shining. The figure steps to the top of the ladder and descends toward him. Then he gazes up at the ladder. He hauls himself up off the ground and stumbles into the hallway. The figure dashes down the steps. He marches for the garage. He crawls to the garage, rolls inside and slams the garage door behind him. In an instant, he jumps up and fastens the bolt. He notices the garage window above the toolbox. Mark gradually rises to his feet and hobbles toward the front door. His foot tries the door. Frantically he tries the door, peering behind him. There is a thumping on the door from the opposite side. Suddenly, the garage door bursts, the center of it shattering. The figure reaches through, fumbling for the bolt. The figure's foot reaches for the bolt. The figure's foot snatches the bolt and snaps it open. The figure pushes the door open and bounds into the garage. With a shove, he opens it part-way. He can only get it half-way open. He drags himself awkwardly out the window. Mark lifts himself from the pavement and sprints as quickly as he can, hobbling across the garden, spotlight following him. He glances behind him. He stumbles on the fallen branch and collapses to the pavement. He crosses the driveway and dashes into the neighbor's garden, up to the front door of the building. He knocks frantically on the door. Mark continues to knock on the door. The front porch light switches on. Through the glass in the front door we glimpse an old man dressed in pajamas arriving."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She can only gawk in disbelief at the spectacle of her unconscious friend. It is almost as if our eyes have suddenly started to acclimate to the twilight and we glimpse the outline of a tree standing right behind her. The silhouette becomes more and more distinct. Laurie suddenly shuffles away from the doorway. The shape springs out at her. He springs again with the spoon. He springs at her unexpectedly with the spoon. He stands there holding up the piece of string, then elevates the carving fork and glides for her. The hand clutches a piece of Laurie's scarf and tears it. The spoon skims across her sleeve, tearing her fabric. She shrieks and swirls around. Laurie bumps back into the bookshelf. She bounds backward to evade the prong and slides over the edge of the bookshelf. The camera leaps down from the third floor and thuds onto the carpet. The camera flows with her as she edges away, yelling at the top of her lungs. She strikes the carpet and flips over, clutching her shoe painfully. It is the shape, donning the helmet, the carving fork in his hand, shining. The shape drifts to the top of the ladder and starts up toward her. Then she gazes up at the ladder. She hauls herself up off the carpet and stumbles into the dining room. The shape dashes up the ladder. She glides for the pantry. She shuffles to the pantry, rolls inside and slams the pantry door behind her. In an instant, she bounces up and twists the latch. She notices the pantry window above the counter. Laurie gradually clambers to her feet and hobbles toward the side door. Her hand juggles the door. Frantically she juggles the door, peering behind her. There is a thumping on the door from the other side. Suddenly, the pantry door bursts, the center of it fragmenting. The shape stretches through, groping for the handle. The shape's hand reaches for the handle. The shape's hand snatches the handle and twists it open. The shape shoves the door open and dives into the pantry. With a shove, she opens it partially. She can only get it two-thirds open. She drags herself awkwardly out the window. Laurie lifts herself up from the ground and sprints as quickly as she can, stumbling across the front yard, camera gliding with her. She glances behind her. She stumbles on the fallen branch and collapses onto the rug. She bypasses the garden path and scuttles into the neighbor's front yard, up to the front door of the house. She pounds frantically on the door. Laurie continues to pound on the door. The front porch light flickers on. Through the glass in the front door we see an old man dressed in a robe approaching."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat can only gape in confusion at the spectacle of its vanished reflection. It is almost as if our ears have suddenly begun to adapt to the silence and we hear the silhouette of a giant humming right beside it. The silhouette becomes more and more vivid. Bella suddenly slides away from the shelf. The shadow darts out at it. It darts again with the spoon. It darts at it suddenly with the spoon. It stands there holding up the feather, then raises the gardening hose and strolls toward it. The paw grips a piece of Bella's scarf and tears it. The spoon glides along its tail, tearing its fur. It yowls and flips around. Bella bumps back into the bookshelf. It jumps backward to dodge the spoon and stumbles over the lip of the bookshelf. The drone swoops down from the attic and crashes into the carpet. The drone drifts with it as it edges away, yowling at the top of its voice. It hits the carpet and rolls over, clutching its paw painfully. It is the shadow, wearing the hat, the gardening hose in its paw, shimmering. The shadow saunters to the top of the escalator and strides down toward it. Then it gazes up at the escalator. It hauls itself up off the carpet and hobbles into the dining room. The shadow dashes down the escalator. It ambles for the pantry. It crawls to the pantry, rolls inside and slams the pantry door behind it. In a blink, it jumps up and clicks the latch. It notices the pantry skylight over the counter. Bella slowly climbs to its paws and limps toward the garden gate. Its paw tests the gate. Frantically it tests the gate, peering behind it. There is a thumping on the gate from the opposing side. Suddenly, the pantry door shatters, the center of it fracturing. The shadow reaches through, fumbling for the latch. The shadow's paw fumbles for the latch. The shadow's paw seizes the latch and flips it open. The shadow nudges the gate open and hops into the pantry. With a thrust, it swings it half-way. It can only slide it three-fourths open. It pulls itself awkwardly out the skylight. Bella lifts itself up from the lawn and dashes as swiftly as it can, limping across the meadow, drone drifting with it. It glances behind it. It tumbles on the broken toy and collapses onto the carpet. It skirts the walkway and scuttles into the stranger's meadow, up to the garden gate of the barn. It thumps fervently on the gate. Bella continues to thump on the gate. The garden lantern flicks on. Through the pane in the garden gate we observe a young man dressed in overalls wander over."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Laurie is horrified by her friend's death and notices a man standing behind her. As the figure lunges with a knife, Laurie evades him, but he slices her arm. She screams, stumbles over the railing, and hits the floor painfully. The man, wielding a butcher knife, descends the stairs as Laurie crawls to the kitchen, locks the door, and struggles toward the back door. The man breaks in, unlocks the door, and enters. Laurie manages to open the door halfway and drags herself out. Injured, she limps across the backyard, trips, and reaches a neighbor's house, frantically pounding on the door as an older woman approaches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "we see an old woman dressed in a nightgown approach Through the glass in the back door  The back porch light comes on  Laurie continues to pound on the door  She pounds furiously on the door  She passes the driveway and scurries into the neighbor's backyard up to the back door of the house  She trips on the fallen lamp and falls to the floor  She looks behind her  Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her  She drags herself roughly out the window  She can only get it threefourths open  With a heave she opens it halfway  The shape pushes the door open and leaps into the kitchen  The shape's hand grabs the lock and clicks it open  The shape's hand reaches for the lock  The shape reaches through groping for the lock  Suddenly the kitchen door explodes the middle of it breaking  There is a pounding on the door from the other side  Desperately she tries the door glancing behind her  Her hand tries the door  Laurie slowly climbs to her feet and limps toward the back door  She sees the kitchen window over the sink  In a flash she leaps up and clicks the lock  She crawls to the kitchen rolls inside and slams the kitchen door behind her  She moves for the kitchen  The shape races down the stairs  She pulls herself up off the floor and hobbles into the living room  Then she looks up at the staircase  The shape moves to the top of the staircase and starts down toward her  It is the shape wearing the mask the butcher knife in his hand gleaming  She hits the floor and rolls over holding her leg painfully  The camera moves with her as she backs away screaming at the top of her lungs  The camera pounces down from the second floor and slams into the floor  She leaps backward to avoid the blade and slips over the edge of the railing  Laurie bumps back into the railing  She screams and spins around  The knife slices across her arm ripping her flesh  The hand grasps a piece of Laurie's blouse and rips it  He stands there holding up the piece of material then raises the butcher knife and moves for her  He lunges at her suddenly with the knife  He lunges again with the knife  The shape lunges out at her  Laurie suddenly moves away from the corner  The outline becomes more and more clear  It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her  She can only stare in horror at the sight of her dead friend "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She hits the floor and rolls over holding her leg painfully  She can only stare in horror at the sight of her dead friend  The camera pounces down from the second floor and slams into the floor  She passes the driveway and scurries into the neighbor's backyard up to the back door of the house  She trips on the fallen lamp and falls to the floor  Desperately she tries the door glancing behind her  Her hand tries the door  The shape pushes the door open and leaps into the kitchen  Laurie slowly climbs to her feet and limps toward the back door  The shape reaches through groping for the lock  Through the glass in the back door  The shape races down the stairs  Laurie continues to pound on the door  The shape's hand reaches for the lock  She screams and spins around  He lunges at her suddenly with the knife  The shape moves to the top of the staircase and starts down toward her  She pulls herself up off the floor and hobbles into the living room  She drags herself roughly out the window  Laurie bumps back into the railing  The camera moves with her as she backs away screaming at the top of her lungs  The hand grasps a piece of Laurie's blouse and rips it  The shape's hand grabs the lock and clicks it open  Laurie suddenly moves away from the corner  There is a pounding on the door from the other side  She pounds furiously on the door  The knife slices across her arm ripping her flesh  Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her  The back porch light comes on  She moves for the kitchen  It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her  The shape lunges out at her  She leaps backward to avoid the blade and slips over the edge of the railing  In a flash she leaps up and clicks the lock  Then she looks up at the staircase  She can only get it threefourths open  He lunges again with the knife  She sees the kitchen window over the sink  He stands there holding up the piece of material then raises the butcher knife and moves for her  With a heave she opens it halfway  Suddenly the kitchen door explodes the middle of it breaking  The outline becomes more and more clear  It is the shape wearing the mask the butcher knife in his hand gleaming  She looks behind her  we see an old woman dressed in a nightgown approach She crawls to the kitchen rolls inside and slams the kitchen door behind her "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In a flash she leaps up and clicks the lock  She sees the kitchen window over the sink  Laurie slowly climbs to her feet and limps toward the back door  Her hand tries the door  Desperately she tries the door glancing behind her  There is a pounding on the door from the other side  Suddenly the kitchen door explodes the middle of it breaking  The shape reaches through groping for the lock  The shape's hand reaches for the lock  The shape's hand grabs the lock and clicks it open  The shape pushes the door open and leaps into the kitchen  With a heave she opens it halfway  She can only get it threefourths open  She drags herself roughly out the window  Laurie picks herself up from the ground and runs as fast as she can limping across the backyard camera moving with her  She looks behind her  She trips on the fallen lamp and falls to the floor  She passes the driveway and scurries into the neighbor's backyard up to the back door of the house  She pounds furiously on the door  Laurie continues to pound on the door  The back porch light comes on  Through the glass in the back door  we see an old woman dressed in a nightgown approach She can only stare in horror at the sight of her dead friend  It is almost as if our eyes have suddenly begun to adjust to the darkness and we see the outline of a man standing right behind her  The outline becomes more and more clear  Laurie suddenly moves away from the corner  The shape lunges out at her  He lunges again with the knife  He lunges at her suddenly with the knife  He stands there holding up the piece of material then raises the butcher knife and moves for her  The hand grasps a piece of Laurie's blouse and rips it  The knife slices across her arm ripping her flesh  She screams and spins around  Laurie bumps back into the railing  She leaps backward to avoid the blade and slips over the edge of the railing  The camera pounces down from the second floor and slams into the floor  The camera moves with her as she backs away screaming at the top of her lungs  She hits the floor and rolls over holding her leg painfully  It is the shape wearing the mask the butcher knife in his hand gleaming  The shape moves to the top of the staircase and starts down toward her  Then she looks up at the staircase  She pulls herself up off the floor and hobbles into the living room  The shape races down the stairs  She moves for the kitchen  She crawls to the kitchen rolls inside and slams the kitchen door behind her "
        }
      ]
    }
  ]
}