{
  "ground_truth": "He drops the phone with a crash, grabs Mary by the shoulders, and shakes her. Mary begins to cry. He pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. Mrs. Hatch is at the top of the stairs. She practically faints at what she sees. Cousin Tilly's face fills the screen as she cries. The camera pulls back, and we hear the sound of the Wedding March. People are crowded into the rooms: family, friends, neighbors. There is a din of conversation. Mary and George appear at the top of the stairs in traveling clothes, with Mrs. Hatch, red-eyed, behind them. Mary throws her bouquet, which is caught by Violet Bick. As they come out onto the porch, we see that it is raining. Nevertheless, Cousin Eustace has his camera equipment set up and is taking pictures of the group. George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab, which pulls away from the curb. Mrs. Bailey and Annie, the maid. George and Mary are in each other's arms. Ernie reaches over and hands George a bottle of champagne done up in gift wrappings. The cab passes the bank, and Ernie sees a crowd of people around the door. He stops the cab. Scurrying people under umbrellas are swarming around the bank doors. Panic is in the air. Attendants are trying to close down. Several people come running past the cab. George gets out of the cab and looks down the street. George runs off up the street toward the Building and Loan. They are simply-dressed people, to whom their savings are a matter of life and death. George comes in with an assumed cheerful manner. The people look at him silently, half shamefaced, but grimly determined on their rights. In their hearts there is panic and fear. An iron grill blocks the street entrance to the Building and Loan. A crowd of men and women are waiting around the grill. It has been locked. He quickly unlocks the grill door and pushes it open. Followed by the crowd, George runs upstairs and into the outer offices of the Building and Loan. George, followed by the still-silent people, comes in. Uncle Billy is standing in the doorway to his private office, taking a drink from a bottle. He motions to George to join him. George turns back cheerfully to the crowd. George vaults over the counter. The people ignore George and remain standing in front of the teller's window. They all have their passbooks out. George hurries into his office where Uncle Billy is waiting for him. He points to George's office. The telephone rings.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He lets fall the handset with a smash, seizes Mary by the shoulders, and shakes her. Mary starts to weep. He pulls her to him in a vehement clutch. Two destined for each other find themselves in tearful bliss. Mrs. Hatch is at the top of the stairs. She nearly swoons at what she observes. Cousin Tilly's countenance fills the screen as she sobs. The camera retracts, and we hear the sound of the Wedding March. People are packed into the rooms: family, companions, neighbors. There is a clamor of chatter. Mary and George emerge at the top of the stairs in traveling attire, with Mrs. Hatch, red-eyed, behind them. Mary tosses her bouquet, which is caught by Violet Bick. As they come out onto the porch, we see that it is raining. Nevertheless, Cousin Eustace has his camera apparatus set up and is taking photographs of the group. George and Mary weave through the rain and a sprinkle of rice and get into Ernie's cab, which pulls away from the curb. Mrs. Bailey and Annie, the maid. George and Mary are in each other's arms. Ernie reaches over and hands George a bottle of champagne done up in gift wrappings. The cab passes the bank, and Ernie sees a crowd of people around the door. He stops the cab. Scurrying people under umbrellas are swarming around the bank doors. Panic is in the air. Attendants are trying to close down. Several people come rushing past the cab. George gets out of the cab and looks down the avenue. George sprints off up the avenue toward the Building and Loan. They are simply-dressed people, to whom their savings are a matter of life and death. George comes in with a feigned cheerful manner. The people look at him silently, half ashamed, but grimly resolute on their rights. In their hearts there is panic and dread. An iron grille blocks the street entrance to the Building and Loan. A crowd of men and women are waiting around the grille. It has been locked. He quickly unlocks the grille door and pushes it open. Followed by the crowd, George dashes upstairs and into the outer offices of the Building and Loan. George, followed by the still-silent people, comes in. Uncle Billy is standing in the doorway to his private office, taking a swig from a bottle. He signals to George to join him. George turns back cheerfully to the crowd. George vaults over the counter. The people disregard George and remain standing in front of the teller's window. They all have their bankbooks out. George rushes into his office where Uncle Billy is waiting for him. He gestures to George's office. The telephone rings."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The phone is dropped with a crash, Mary is grabbed by the shoulders, and she is shaken by him. Crying is begun by Mary. She is pulled to him by him in a fierce embrace. Tearful ecstasy is found by two meant for each other. At the top of the stairs, Mrs. Hatch is. She practically faints at what she sees. Cousin Tilly, as she cries, fills the screen with her face. The camera is pulled back, and the sound of the Wedding March is heard. The rooms are crowded by people: family, friends, neighbors. A din of conversation is present. At the top of the stairs, Mary and George appear in traveling clothes, with Mrs. Hatch, red-eyed, behind them. Her bouquet is thrown by Mary, which Violet Bick catches. As they come out onto the porch, the rain is seen. Nevertheless, the camera equipment of Cousin Eustace is set up, and pictures of the group are being taken by him. Through the rain and a shower of rice, George and Mary dodge and get into Ernie's taxicab, which is pulled away from the curb by it. Mrs. Bailey and Annie, the maid, are present. In each other's arms, George and Mary are. A bottle of champagne is handed to George by Ernie, done up in gift wrappings. The cab passes the bank, and a crowd of people around the door is seen by Ernie. The cab is stopped by him. Under umbrellas, people are scurrying around the bank doors, swarming. Panic is felt in the air. The attendants try to close down. Several people run past the cab. The cab is exited by George, and he looks down the street. Up the street toward the Building and Loan, George runs off. Simply-dressed people are they, to whom their savings are a matter of life and death. With an assumed cheerful manner, George comes in. Silently, half shamefaced, but grimly determined on their rights, they look at him. Panic and fear are felt in their hearts. The street entrance to the Building and Loan is blocked by an iron grill. Around the grill, a crowd of men and women is waiting. It is locked. The grill door is quickly unlocked, and it is pushed open by him. Followed by the crowd, the stairs are run up by George and into the outer offices of the Building and Loan. George, followed by the still-silent people, comes in. In the doorway to his private office, Uncle Billy is standing, taking a drink from a bottle. George is motioned by him to join. Cheerfully, back to the crowd, George turns. Over the counter, George vaults. George is ignored by the people as they remain standing in front of the teller's window. Out are all their passbooks. Into his office, where Uncle Billy is waiting, George hurries. To George's office, he points. The telephone rings."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The phone crashes to the floor as he grabs Mary, shaking her until she cries. They embrace intensely, finding tearful joy. Mrs. Hatch appears at the stairs and almost faints at the scene. Cousin Tilly's tearful face fills the screen as the Wedding March plays, with family, friends, and neighbors crowding the rooms. Mary and George, in travel clothes, appear at the stairs; Mary tosses her bouquet to Violet Bick. Despite the rain, Cousin Eustace takes photos. George and Mary, dodging rain and rice, get into Ernie's taxi. Mrs. Bailey and Annie watch as Ernie hands George a champagne bottle gift. Passing the bank, they notice a crowd. Ernie stops the cab, revealing panicked people at the bank. George exits, observing the commotion, and heads toward the Building and Loan. The simply-dressed crowd, desperate about their savings, waits outside the locked entrance. George unlocks it, leading them inside. Uncle Billy, drinking at his office door, gestures at George. Returning to the crowd, George vaults over the counter, but the people stand silently, passbooks ready. George hurries to his office, where Uncle Billy waits. The phone rings."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He drops the phone, grabs Mary, shakes her, and Mary cries. He embraces her fiercely, and they find tearful ecstasy. Mrs. Hatch nearly faints at the sight. Cousin Tilly cries, and the Wedding March plays. Rooms fill with family, friends, and neighbors. Mary, George, and teary Mrs. Hatch are atop the stairs; Mary throws her bouquet to Violet Bick. Despite the rain, Cousin Eustace takes photos as George and Mary, amidst rain and rice, enter Ernie's taxicab. Mrs. Bailey and Annie are there. Ernie gives George champagne as the cab passes a bustling bank. Ernie stops; George sees panic, exits, and runs toward the Building and Loan. People nervously wait at the locked grill. George unlocks it, leading them to the Building and Loan offices. Uncle Billy drinks in his office, signaling George. George leaps over the counter, but the anxious crowd ignores him, holding passbooks ready. George enters his office, where Uncle Billy awaits, as the phone rings."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The phone slips from his grasp and hits the floor with a loud crash, as in a sudden motion, he grabs Mary by her shoulders, shaking her with an air of urgency. In response, Mary begins to cry softly, tears welling up in her eyes. He pulls her close, enveloping her in a fierce, almost desperate embrace. Two souls, destined to be together, find themselves caught up in a whirlwind of tearful ecstasy. At the top of the stairs, Mrs. Hatch is standing in shock, her eyes wide as she practically faints at the unexpected scene unfolding before her. The camera shifts focus to capture Cousin Tilly, whose face fills the screen while she cries, adding to the emotional intensity. As the camera zooms out, the familiar strains of the Wedding March softly fill the air. People are packed tightly into the rooms, comprising family, friends, and neighbors, creating a bustling atmosphere filled with a cacophony of conversation. Appearing at the top of the stairs in their traveling clothes are Mary and George, with Mrs. Hatch, visibly red-eyed, trailing behind them. Mary enthusiastically throws her bouquet, and Violet Bick eagerly catches it with a gleam in her eye. As the couple makes their way onto the porch, raindrops are seen pattering down gently. Despite the drizzle, Cousin Eustace has diligently set up his camera equipment and is busily taking photographs of the cheerful group. George and Mary dash through the rain, dodging a joyous shower of rice, and manage to get into Ernie's waiting taxicab, which promptly pulls away from the curb. Inside the cab, Mrs. Bailey and Annie, the maid, watch warmly. George and Mary are wrapped in each other's arms, enveloped in a shared happiness. Ernie reaches over with a friendly grin and hands George a bottle of champagne, carefully wrapped as a thoughtful gift. As the cab passes by the bank, Ernie notices a crowd of people clustering anxiously around the entrance. Momentarily halting the cab, they observe that scurrying people, clutching umbrellas, are swarming around the bank's doors. The air is saturated with a palpable sense of panic, as attendants inside are desperately trying to close down operations. Several people rush past the halted cab, their faces etched with worry. George steps out of the cab, peering intently down the street, sensing trouble. Without hesitation, George takes off running up the street, towards the Building and Loan, determined and resolute. These are the simply dressed individuals whose life savings are of dire importance, almost a matter of life and death for them. George arrives with an intentionally cheerful facade. The people stand there silently, half ashamed yet resolutely determined to assert their rights. Panic and fear silently gnaw at their hearts. An iron grill blocks the main entrance to the Building and Loan, and a crowd of men and women wait with growing impatience around it, as it remains locked. George quickly unlocks the grill door, thrusting it open with urgency. With the crowd following eagerly behind him, George dashes upstairs and into the outer offices of the Building and Loan. As he enters, the silent crowd tails him closely. Uncle Billy is there, standing in the doorway of his private office, taking a swig from a bottle. He gestures to George in a silent invitation to join him. George turns back towards the crowd with a smile, remaining cheerful, before vaulting effortlessly over the counter in a swift, agile movement. The people remain resolute, stubbornly ignoring George’s cheerful demeanor and standing steadfast in front of the teller's window, each clutching their passbooks tightly in anticipation. George, moving swiftly, heads into his office where Uncle Billy waits patiently for him, pointing to the direction of George’s office. Just then, the telephone rings, breaking the tense silence of the room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The phone, having slipped unexpectedly from his grasp, crashes loudly onto the floor, shattering the silence with its sudden descent. In an immediate, almost instinctive motion, he reaches out, grabbing Mary firmly yet gently by her shoulders. With an air of urgency, he begins to shake her, hoping to convey the intensity of the moment. Mary, in response, starts to cry softly, her tears beginning to well up and spill from her eyes. He draws her in close, pulling her into an embrace that is fierce and almost desperate, as if trying to shield her from the overwhelming emotions. Here, two souls, seemingly meant to be together, find themselves swept up in a whirlwind of intense, tearful ecstasy. \n\nMeanwhile, at the top of the staircase, Mrs. Hatch stands in utter shock, her eyes wide open, as if she is on the verge of fainting at this unexpected and dramatic scene playing out before her eyes. The camera shifts focus, honing in on Cousin Tilly, whose face fills the screen. She is crying, her tears adding another layer of emotional intensity to the unfolding drama. As the camera slowly zooms out, the familiar and gentle strains of the Wedding March begin to fill the air. The rooms are packed tightly with people—family, friends, and neighbors—all contributing to a bustling atmosphere alive with a cacophony of conversation and chatter. At the top of the stairs, appearing in their travel clothes, are Mary and George, while Mrs. Hatch, her eyes visibly red and swollen from crying, trails behind them. With great enthusiasm, Mary throws her bouquet, and Violet Bick catches it eagerly, a gleam of excitement shining in her eye. \n\nAs the couple makes their way out onto the porch, raindrops begin to patter down gently. Despite the drizzle, Cousin Eustace is diligently setting up his camera equipment, busily taking photographs of the cheerful group gathered there. George and Mary dash through the rain, dodging a joyous shower of rice thrown by their well-wishers, and quickly manage to get into Ernie's waiting taxicab, which promptly pulls away from the curb, whisking them away. Inside the cab, Mrs. Bailey and Annie, the maid, watch warmly as George and Mary remain wrapped in each other’s arms, enveloped in a shared and palpable happiness. Ernie, reaching over with a friendly grin, hands George a bottle of champagne. It is carefully wrapped, a thoughtful and generous gift for the happy couple. \n\nAs the cab passes by the bank, Ernie notices a crowd of people clustering anxiously around its entrance. Momentarily halting the cab, they observe the scene, noting how scurrying people, clutching umbrellas, swarm around the bank's doors. The air is saturated with a palpable sense of panic and urgency, as attendants inside the bank are desperately trying to close down operations amid the chaos. Several anxious individuals rush past the halted cab, their faces etched with worry and concern. Sensing trouble, George steps out of the cab and peers intently down the street. Without hesitation, he takes off running up the street, resolute and determined, heading towards the Building and Loan. These people, simply dressed and hardworking, have life savings that are of dire importance, almost a matter of life and death for them. \n\nArriving with an intentionally cheerful facade, George finds people standing there silently, half ashamed yet resolutely determined to assert their rights. Panic and fear gnaw silently at their hearts, even as they outwardly hold their ground. An iron grill blocks the main entrance to the Building and Loan. Around it, a crowd of men and women waits with growing impatience, their eyes fixed on the locked door. Without delay, George quickly unlocks the grill door, thrusting it open with urgency. The crowd eagerly follows him as he dashes upstairs and into the outer offices of the Building and Loan. As he enters, the silently hopeful crowd tails him closely, seeking reassurance. Inside, Uncle Billy stands in the doorway of his private office, taking a swig from a bottle. He gestures to George, extending a silent invitation to join him. \n\nTurning back towards the crowd, George smiles, maintaining his cheerful demeanor, before vaulting over the counter with a swift and agile movement. The people remain resolute, stubbornly ignoring George’s attempts to lighten the mood. They stand steadfastly in front of the teller's window, each person clutching their passbooks tightly in anticipation. Moving swiftly, George heads into his office where Uncle Billy waits patiently, pointing toward the direction of George’s office. Just then, the telephone rings, interrupting and breaking the tense silence that hangs heavily in the room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the phone slips from his grasp, crashing to the ground, he swiftly reaches out and grasps Mary firmly by the shoulders, shaking her with a sense of urgency. As the situation overwhelms her, Mary begins to cry, tears streaming down her face. In response, he pulls her close, wrapping her in a fierce and protective embrace. In this moment of raw emotion, both realize they're meant for each other and find themselves swept up in tearful ecstasy. At the top of the stairs, Mrs. Hatch becomes a silent witness to the scene below, her shock causing her to nearly faint at the sight. Meanwhile, the camera captures Cousin Tilly's face, filled with emotion as she cries, before slowly pulling back to reveal the larger scene. The sound of the Wedding March plays in the background, and the rooms are filled with people—family, friends, and neighbors—all engaged in a lively hum of conversation. Mary and George come into view at the top of the stairs, now dressed in their traveling clothes, with Mrs. Hatch, her eyes red from crying, following closely behind. As they make their way down, Mary playfully tosses her bouquet into the air, where it is caught by Violet Bick, who stands among the crowd. Stepping out onto the porch, they are met by the sight of rain falling from the sky. Nevertheless, Cousin Eustace is undeterred by the weather and has his camera equipment set up, capturing the joyous group in photographs. George and Mary, laughing and dodging through the rain and a shower of rice thrown by well-wishers, quickly make their way to Ernie's taxicab, which is waiting for them at the curb. Once inside the cab, they hold each other closely, savoring the moment. Ernie leans over from his seat and hands George a bottle of champagne, wrapped elegantly as a gift. As the cab drives past the bank, Ernie notices a crowd gathered at its doors, causing him to bring the vehicle to a stop. The scene outside is frantic, with people scurrying under umbrellas, swarming around the bank in a palpable state of panic, as attendants inside attempt to close the doors. Several anxious individuals rush past the cab, adding to the commotion. Sensing the urgency, George quickly exits the cab and casts his gaze down the street before making a decision. He breaks into a run, heading swiftly up the street toward the Building and Loan. Along the way, he passes people who are dressed simply, yet their expressions reveal that their savings are of paramount importance, a matter of life and death to them. Upon arriving, George adopts an outwardly cheerful demeanor as he enters, despite the gravity of the situation. The people, half ashamed yet resolute in their cause, meet his gaze in silent anticipation. Their hearts are gripped by panic and fear, though they try to conceal it. An iron grill stands as a barrier at the street entrance to the Building and Loan, and a crowd has gathered around it, waiting anxiously. George quickly unlocks the grill door and pushes it open, allowing the crowd to surge forward as he leads the way. Together, they hurry upstairs and into the outer offices of the Building and Loan. George, with the crowd trailing behind him in silence, steps into the room where Uncle Billy stands at the entrance to his private office, taking a swig from a bottle. Uncle Billy gestures for George to join him, but George turns back to the crowd with a reassuring and cheerful demeanor. In a spontaneous motion, he vaults over the counter with agility. The people, however, remain focused on their objective, standing firm in front of the teller's window, each clutching a passbook that signifies their life's savings and security. As George hurries into his office, he finds Uncle Billy waiting for him there, a look of concern on his face. Uncle Billy points toward George's office, signaling something important. Just then, the telephone rings, breaking the tense silence and hinting at the next stage of this unfolding drama."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He drops the phone with a crash and urgently grabs Mary, shaking her until she cries, then pulls her into a fierce embrace. Experiencing a tearful ecstasy, they are meant for each other. At the top of the stairs, Mrs. Hatch nearly faints at the sight, while Cousin Tilly appears on screen, crying. As the camera pulls back, the sound of the Wedding March fills the room bustling with family, friends, and neighbors engaged in conversation. Mary and George, dressed for travel, appear with a red-eyed Mrs. Hatch behind them. Mary tosses her bouquet, caught by Violet Bick, and despite the rain outside, Cousin Eustace captures the scene with his camera. Dodging through the rain and a shower of rice, George and Mary get into Ernie's taxicab, embracing as Ernie hands George a gift-wrapped champagne bottle. Passing the bank, Ernie notices a crowd gathering in a panic as attendants attempt to close it down. George steps out of the cab, observes the chaos, and runs toward the Building and Loan, acting with assumed cheerfulness to calm the silent, anxious crowd. Unlocking the grill door, George leads them upstairs into the Building and Loan offices. Inside, Uncle Billy takes a drink and motions for George to join him, but George remains focused, vaulting over the counter as the crowd stands with passbooks in hand. He enters his office where Uncle Billy points to the ringing telephone."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He drops the phone with a crash, the sound echoing in the room like breaking glass, grabs Mary by the shoulders, and shakes her. Mary, overwhelmed by the sudden commotion, begins to cry. He pulls her to him in a fierce embrace filled with desperation and love. Two meant for each other find themselves in tearful ecstasy, a moment reminiscent of classic romance novels. Mrs. Hatch is at the top of the stairs, a traditional wooden staircase that creaks with age. She practically faints at what she sees, unable to process the charged emotions unfolding below. Cousin Tilly's face fills the screen as she cries, her tears mirroring those of the happy couple. The camera pulls back, and we hear the sound of the Wedding March, a classic tune first composed by Felix Mendelssohn in 1842. People are crowded into the rooms: family, friends, neighbors gathered from the small, tight-knit community. There is a din of conversation, a lively buzz typical of such joyous gatherings. Mary and George appear at the top of the stairs in traveling clothes, ready for their honeymoon adventure, with Mrs. Hatch, red-eyed, behind them. Mary throws her bouquet, a tradition believed to bring good luck, which is caught by Violet Bick, a local resident known for her vibrant personality. As they come out onto the porch, we see that it is raining, an unexpected shower on this auspicious day. Nevertheless, Cousin Eustace, an amateur photographer with a passion for capturing family moments, has his camera equipment set up and is taking pictures of the group. George and Mary dodge through the rain and a shower of rice, the rice symbolizing prosperity and fertility, and get into Ernie's taxicab, a familiar old vehicle in the community, which pulls away from the curb. Mrs. Bailey and Annie, the maid whose loyalty to the family is renowned, stand watching. George and Mary are in each other's arms, lost in their own world. Ernie reaches over and hands George a bottle of champagne done up in gift wrappings, a celebratory gesture. The cab passes the bank, a local institution facing financial strain, and Ernie sees a crowd of people around the door. He stops the cab, sensing the urgency. Scurrying people under umbrellas are swarming around the bank doors, each concerned about their savings. Panic is in the air, reminiscent of the bank runs during the Great Depression. Attendants are trying to close down to contain the situation. Several people come running past the cab, their faces etched with worry. George gets out of the cab and looks down the street, assessing the situation. George runs off up the street toward the Building and Loan, his workplace known for supporting local families. They are simply-dressed people, to whom their savings are a matter of life and death. George comes in with an assumed cheerful manner, hoping to calm the anxious crowd. The people look at him silently, half shamefaced, but grimly determined on their rights. In their hearts there is panic and fear, emotions that often accompany economic uncertainty. An iron grill blocks the street entrance to the Building and Loan, a security measure to protect the institution. A crowd of men and women are waiting around the grill. It has been locked as a precaution. He quickly unlocks the grill door and pushes it open, demonstrating his commitment to helping his community. Followed by the crowd, George runs upstairs and into the outer offices of the Building and Loan, a place that has served as a financial lifeline for many. George, followed by the still-silent people, comes in. Uncle Billy is standing in the doorway to his private office, taking a drink from a bottle, a habit he's struggled with for years. He motions to George to join him, hoping to offer support. George turns back cheerfully to the crowd, trying to maintain morale. George vaults over the counter, a display of energy and urgency. The people ignore George and remain standing in front of the teller's window, each holding their passbooks, small ledgers crucial for tracking savings. George hurries into his office where Uncle Billy is waiting for him, a trusted if somewhat troubled advisor. He points to George's office, signaling the need for urgent action. The telephone rings, cutting through the tense atmosphere with its demand for attention."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan He drops the phone with a crash grabs Mary by the shoulders and shakes her Mary begins to cry He pulls her to him in a fierce embrace Two meant for each other find themselves in tearful ecstasy Mrs Hatch is at the top of the stairs She practically faints at what she sees Cousin Tilly's face fills the screen as she cries The camera pulls back and we hear the sound of the Wedding March George and Mary are in each other's arms People are crowded into the rooms family friends neighbors An iron grill blocks the street entrance to the Building and Loan Scurrying people under umbrellas are swarming around the bank doors He pulls her to him in a fierce embrace There is a din of conversation They all have their passbooks out He stops the cab Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them Mary throws her bouquet which is caught by Violet Bick As they come out onto the porch we see that it is raining Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group Ernie reaches over and hands George a bottle of champagne done up in gift wrappings He points to George's office George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb Mrs Bailey and Annie the maid People are crowded into the rooms family friends neighbors George and Mary are in each other's arms He motions to George to join him Ernie reaches over and hands George a bottle of champagne done up in gift wrappings The cab passes the bank and Ernie sees a crowd of people around the door He stops the cab Scurrying people under umbrellas are swarming around the bank doors Panic is in the air Attendants are trying to close down George followed by the stillsilent people comes in Several people come running past the cab George gets out of the cab and looks down the street George runs off up the street toward the Building and Loan Mary begins to cry Mrs Bailey and Annie the maid They are simplydressed people to whom their savings are a matter of life and death George comes in with an assumed cheerful manner The people look at him silently half shamefaced but grimly determined on their rights In their hearts there is panic and fear An iron grill blocks the street entrance to the Building and Loan A crowd of men and women are waiting around the grill He drops the phone with a crash grabs Mary by the shoulders and shakes her It has been locked He quickly unlocks the grill door and pushes it open Attendants are trying to close down George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb The camera pulls back and we hear the sound of the Wedding March Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan George followed by the stillsilent people comes in George hurries into his office where Uncle Billy is waiting for him Uncle Billy is standing in the doorway to his private office taking a drink from a bottle He motions to George to join him George turns back cheerfully to the crowd George vaults over the counter The people ignore George and remain standing in front of the teller's window She practically faints at what she sees They all have their passbooks out George hurries into his office where Uncle Billy is waiting for him George comes in with an assumed cheerful manner He points to George's office The people ignore George and remain standing in front of the teller's window Cousin Tilly's face fills the screen as she cries The telephone rings"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He drops the phone with a crash grabs Mary by the shoulders and shakes her. Mary begins to cry. He pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. Mrs Hatch is at the top of the stairs. She practically faints at what she sees. Cousin Tilly's face fills the screen as she cries. The camera pulls back and we hear the sound of the Wedding March. People are crowded into the rooms family friends neighbors. There is a din of conversation. Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them. Mary throws her bouquet which is caught by Violet Bick. As they come out onto the porch we see that it is raining. Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group. George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb. Mrs Bailey and Annie the maid. George and Mary are in each other's arms. Ernie reaches over and hands George a bottle of champagne done up in gift wrappings. The cab passes the bank and Ernie sees a crowd of people around the door. He stops the cab. Scurrying people under umbrellas are swarming around the bank doors. Panic is in the air. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Attendants are trying to close down. Several people come running past the cab. George gets out of the cab and looks down the street. George runs off up the street toward the Building and Loan. They are simplydressed people to whom their savings are a matter of life and death. George comes in with an assumed cheerful manner. The people look at him silently half shamefaced but grimly determined on their rights. In their hearts there is panic and fear. An iron grill blocks the street entrance to the Building and Loan. A crowd of men and women are waiting around the grill. It has been locked. He quickly unlocks the grill door and pushes it open. Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan. George followed by the stillsilent people comes in. Uncle Billy is standing in the doorway to his private office taking a drink from a bottle. He motions to George to join him. George turns back cheerfully to the crowd. George vaults over the counter. The people ignore George and remain standing in front of the teller's window. They all have their passbooks out. George hurries into his office where Uncle Billy is waiting for him. He points to George's office. The telephone rings."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He drops the phone with a crash grabs Mary by the shoulders and shakes her. Mary begins to cry. He pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. Mrs Hatch is at the top of the stairs. She practically faints at what she sees. Cousin Tilly's face fills the screen as she cries. The camera pulls back and we hear the sound of the Wedding March. People are crowded into the rooms family friends neighbors. There is a din of conversation. Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them. Mary throws her bouquet which is caught by Violet Bick. As they come out onto the porch we see that it is raining. Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group. George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb. Mrs Bailey and Annie the maid. George and Mary are in each other's arms. Ernie reaches over and hands George a bottle of champagne done up in gift wrappings. The cab passes the bank and Ernie sees a crowd of people around the door. He stops the cab. Scurrying people under umbrellas are swarming around the bank doors. Panic is in the air. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Attendants are trying to close down. Several people come running past the cab. George gets out of the cab and looks down the street. George runs off up the street toward the Building and Loan. They are simplydressed people to whom their savings are a matter of life and death. George comes in with an assumed cheerful manner. The people look at him silently half shamefaced but grimly determined on their rights. In their hearts there is panic and fear. An iron grill blocks the street entrance to the Building and Loan. A crowd of men and women are waiting around the grill. It has been locked. He quickly unlocks the grill door and pushes it open. Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan. George followed by the stillsilent people comes in. Uncle Billy is standing in the doorway to his private office taking a drink from a bottle. He motions to George to join him. George turns back cheerfully to the crowd. George vaults over the counter. The people ignore George and remain standing in front of the teller's window. They all have their passbooks out. George hurries into his office where Uncle Billy is waiting for him. He points to George's office. The telephone rings."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He drops the phone with a crash grabs Mary by the shoulders and shakes her. Mary begins to cry. He pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. Mrs Hatch is at the top of the stairs. She practically faints at what she sees. Cousin Tilly's face fills the screen as she cries. The camera pulls back and we hear the sound of the Wedding March. People are crowded into the rooms family friends neighbors. There is a din of conversation. Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them. He quickly unlocks the grill door and pushes it open. Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan. George followed by the stillsilent people comes in. Uncle Billy is standing in the doorway to his private office taking a drink from a bottle. He motions to George to join him. George turns back cheerfully to the crowd. George vaults over the counter. The people ignore George and remain standing in front of the teller's window. They all have their passbooks out. George hurries into his office where Uncle Billy is waiting for him. He points to George's office. The telephone rings."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He drops the phone with a crash grabs Mary by the shoulders and shakes her. Mary begins to cry. He pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. The people ignore George and remain standing in front of the teller's window. They all have their passbooks out. George hurries into his office where Uncle Billy is waiting for him. He points to George's office. The telephone rings."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The kangaroo drops the phone with a crash, grabs the librarian by the shoulders, and shakes her. The librarian begins to cry. The kangaroo pulls her to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. The firefighter is at the top of the stairs. He practically faints at what he sees. The squirrel's face fills the screen as he cries. The camera pulls back, and we hear the sound of the Wedding March. People are crowded into the rooms: family, friends, neighbors. There is a din of conversation. The librarian and the astronaut appear at the top of the stairs in traveling clothes, with the firefighter, red-eyed, behind them. The librarian throws her bouquet, which is caught by the artist. As they come out onto the porch, we see that it is raining. Nevertheless, the chef has his camera equipment set up and is taking pictures of the group. The astronaut and the librarian dodge through the rain and a shower of rice and get into the mechanic's taxicab, which pulls away from the curb. The baker and the gardener. The astronaut and the librarian are in each other's arms. The mechanic reaches over and hands the astronaut a bottle of champagne done up in gift wrappings. The cab passes the bank, and the mechanic sees a crowd of people around the door. She stops the cab. Scurrying people under umbrellas are swarming around the bank doors. Panic is in the air. Botanists are trying to close down. Several people come running past the cab. The astronaut gets out of the cab and looks down the street. The astronaut runs off up the street toward the Building and Loan. They are simply-dressed people, to whom their savings are a matter of life and death. The astronaut comes in with an assumed cheerful manner. The people look at her silently, half shamefaced, but grimly determined on their rights. In their hearts there is panic and fear. An iron grill blocks the street entrance to the Building and Loan. A crowd of men and women are waiting around the grill. It has been locked. The dolphin quickly unlocks the grill door and pushes it open. Followed by the crowd, the astronaut runs upstairs and into the outer offices of the Building and Loan. The astronaut, followed by the still-silent people, comes in. The penguin is standing in the doorway to his private office, taking a drink from a bottle. He motions to the astronaut to join him. The astronaut turns back cheerfully to the crowd. The astronaut vaults over the counter. The people ignore the astronaut and remain standing in front of the teller's window. They all have their passbooks out. The astronaut hurries into her office where the penguin is waiting for her. He points to the astronaut's office. The telephone rings."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He drops the book with a crash, grabs Mary by the elbows, and shakes her. Mary begins to laugh. He pulls her to him in a fierce hug. Two meant for each other find themselves in tearful joy. Mrs. Hatch is at the top of the ladder. She practically swoons at what she sees. Cousin Tilly's hat fills the screen as she laughs. The camera pulls back, and we hear the sound of the Jazz Band. People are crowded into the garden: family, friends, neighbors. There is a hum of conversation. Mary and George appear at the top of the ladder in hiking clothes, with Mrs. Hatch, wide-eyed, behind them. Mary throws her scarf, which is caught by Violet Bick. As they come out onto the deck, we see that it is snowing. Nevertheless, Cousin Eustace has his sketchpad set up and is drawing pictures of the group. George and Mary dodge through the snow and a flurry of confetti and get into Ernie's rickshaw, which pulls away from the driveway. Mrs. Bailey and Annie, the cook. George and Mary are in each other's arms. Ernie reaches over and hands George a box of chocolates done up in gift wrappings. The rickshaw passes the bakery, and Ernie sees a crowd of people around the gate. He stops the rickshaw. Scurrying people under parasols are swarming around the bakery gates. Panic is in the air. Clerks are trying to close down. Several people come running past the rickshaw. George gets out of the rickshaw and looks down the avenue. George runs off up the avenue toward the Credit Union. They are modestly-dressed people, to whom their savings are a matter of life and death. George comes in with an assumed cheerful manner. The people look at him silently, half embarrassed, but grimly determined on their rights. In their hearts there is panic and dread. An iron gate blocks the avenue entrance to the Credit Union. A crowd of men and women are waiting around the gate. It has been barred. He quickly unlocks the gate door and pushes it open. Followed by the crowd, George runs upstairs and into the outer rooms of the Credit Union. George, followed by the still-silent people, comes in. Uncle Billy is standing in the doorway to his private library, taking a drink from a mug. He motions to George to join him. George turns back cheerfully to the crowd. George vaults over the desk. The people ignore George and remain standing in front of the teller's counter. They all have their notebooks out. George hurries into his room where Uncle Billy is waiting for him. He points to George's room. The alarm rings."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He tosses the phone with a crash, nudges Mary by the shoulders, and spins her. Mary starts to laugh. He pulls her to him in a gentle gesture. Two meant for each other find themselves in joyful delight. Mrs. Hatch is at the top of the stairs. She nearly dances at what she sees. Cousin Tilly's face fills the screen as she laughs. The camera zooms in, and we hear the sound of applause. People are scattered around the rooms: family, friends, neighbors. There is a hum of music. Mary and George appear at the top of the stairs in traveling clothes, with Mrs. Hatch, beaming, behind them. Mary hands her bouquet, which is caught by Violet Bick. As they come out onto the porch, we see that it is sunny. Nevertheless, Cousin Eustace has his camera equipment set up and is painting pictures of the group. George and Mary stroll through the rain and a shower of rice and climb into Ernie's taxicab, which speeds away from the curb. Mrs. Bailey and Annie, the maid. George and Mary are in each other's arms. Ernie leans over and hands George a bottle of champagne done up in gift wrappings. The cab drives past the bank, and Ernie notices a throng of people around the door. He parks the cab. Wandering people under umbrellas are gathering around the bank doors. Excitement is in the air. Attendants are attempting to open up. Several people walk past the cab. George steps out of the cab and gazes down the street. George strolls off down the street toward the Building and Loan. They are well-dressed people, to whom their savings are a matter of joy and release. George steps in with a genuine cheerful manner. The people glance at him silently, half ashamed, but energetically hopeful for their rights. In their hearts there is confidence and hope. An iron grill shields the street entrance to the Building and Loan. A crowd of men and women are waiting around the grill. It has been opened. He slowly locks the grill door and pulls it closed. Followed by the crowd, George walks downstairs and into the inner offices of the Building and Loan. George, followed by the still-silent people, steps in. Uncle Billy is standing in the doorway to his private office, sipping from a glass. He gestures to George to accompany him. George turns back calmly to the crowd. George crawls over the counter. The people greet George and remain standing in front of the teller's window. They all have their documents out. George strolls into his office where Uncle Billy is waiting for him. He gestures toward George's office. The telephone chimes."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The dresser drops the television with a crash, grabs the toothbrush by the shoulders, and shakes it. The toothbrush begins to cry. The dresser pulls it to him in a fierce embrace. Two meant for each other find themselves in tearful ecstasy. The refrigerator is at the top of the stairs. It practically faints at what it sees. The microwave's face fills the screen as it cries. The camera pulls back, and we hear the sound of the Victory Anthem. Sandwiches are crowded into the rooms: textbooks, pillows, notebooks. There is a din of conversation. The toothbrush and the sandwich appear at the top of the stairs in traveling clothes, with the refrigerator, red-eyed, behind them. The toothbrush throws its bouquet, which is caught by the plant. As they come out onto the porch, we see that it is snowing. Nevertheless, the piano has its camera equipment set up and is taking pictures of the group. The sandwich and the toothbrush dodge through the snow and a shower of cookies and get into the kite's spaceship, which pulls away from the curb. The cookie jar and the hat. The sandwich and the toothbrush are in each other's arms. The kite reaches over and hands the sandwich a vase of lemonade done up in gift wrappings. The spaceship passes the library, and the kite sees a crowd of clouds around the door. It stops the spaceship. Scurrying clouds under umbrellas are swarming around the library doors. Panic is in the air. Attendees are trying to close down. Several clouds come running past the spaceship. The sandwich gets out of the spaceship and looks down the street. The sandwich runs off up the street toward the Notebook and Pencil. They are simply-dressed clouds, to whom their coins are a matter of life and death. The sandwich comes in with an assumed cheerful manner. The clouds look at it silently, half shamefaced, but grimly determined on their rights. In their hearts, there is panic and fear. An iron grill blocks the street entrance to the Notebook and Pencil. A crowd of fruits and vegetables are waiting around the grill. It has been locked. It quickly unlocks the grill door and pushes it open. Followed by the crowd, the sandwich runs upstairs and into the outer offices of the Notebook and Pencil. The sandwich, followed by the still-silent clouds, comes in. The globe is standing in the doorway to its private office, taking a drink from a bottle. It motions to the sandwich to join it. The sandwich turns back cheerfully to the crowd. The sandwich vaults over the counter. The clouds ignore the sandwich and remain standing in front of the teller's window. They all have their notebooks out. The sandwich hurries into its office where the globe is waiting for it. It points to the sandwich's office. The doorbell rings."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat trips the book with a thud, nudges Lucy by the arms, and spins her. Lucy starts to laugh. The cat pulls her to it in a gentle twirl. Two stars meant for each other find themselves in jubilant rapture. Ms. Hargrove is at the bottom of the ladder. She nearly dances at what she notices. Uncle Tim's smile fills the screen as he chuckles. The camera zooms in, and we hear the sound of the wedding bells. Animals are crowded into the garden: cats, birds, hedgehogs. There is a clamor of chirping. Lucy and Peter appear at the bottom of the ladder in party attire, with Ms. Hargrove, wide-grinned, behind them. Lucy tosses her apple, which is snagged by Daisy Duck. As they step onto the boardwalk, we see that it is snowing. Nevertheless, Uncle Joe has his paint supplies set up and is sketching the group. Peter and Lucy tiptoe through the snow and a flurry of feathers and scramble into Max's trolley, which rolls away from the curb. Mrs. Smith and Sam, the butler. Peter and Lucy are in each other's glow. Max reaches over and hands Peter a box of chocolates wrapped in ribbons. The trolley passes the store, and Max sees a throng of animals around the door. He halts the trolley. Dashing animals with hats are hovering around the store doors. Happiness is in the air. Organizers are trying to shut down. Several creatures come strolling past the trolley. Peter steps out of the trolley and gazes down the street. Peter leaps off down the street toward the Arcade and Court. They are casually-dressed animals, to whom their treasures are a matter of joy and fun. Peter enters with an assumed lively gait. The animals glance at him quietly, partially shy, but firmly intent on their fun. In their hearts there is eagerness and anticipation. A silver curtain covers the street entrance to the Arcade and Court. A crowd of cats and dogs are milling around the curtain. It has been tied shut. The cat hastily unties the curtain and flings it wide. Followed by the crowd, Peter skips upstairs and into the inner chambers of the Arcade and Court. Peter, trailed by the still-quiet animals, enters in. Grandpa Ben is leaning in the doorway to his private chamber, sipping from a mug. He gestures for Peter to accompany him. Peter turns back happily to the crowd. Peter leaps across the railing. The animals disregard Peter and remain lounging in front of the vendor's counter. They all have their tickets out. Peter rushes into his chamber where Grandpa Ben is awaiting him. He gestures toward Peter's chamber. The doorbell rings."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He hurls the pillow with a thud, catches Mary by the elbows, and twirls her. Mary starts to giggle. He pulls her to him in a playful spin. Two meant for each other find themselves in joyful chaos. Mrs. Hatch is at the top of the escalator. She practically stumbles at what she sees. Cousin Tilly's face fills the screen as she laughs. The camera zooms in, and we hear the sound of a Victory Anthem. People are packed into the garden: family, friends, neighbors. There is a roar of laughter. Mary and George appear at the top of the escalator in hiking boots, with Mrs. Hatch, beaming, behind them. Mary tosses her scarf, which is caught by Violet Bick. As they step out onto the veranda, we see that it is snowing. Nevertheless, Cousin Eustace has his painting gear set up and is sketching the group. George and Mary skip through the snow and a sprinkle of confetti and climb into Ernie's motorcycle, which zooms away from the driveway. Mrs. Bailey and Annie, the maid. George and Mary are in each other's arms. Ernie reaches over and hands George a bouquet of flowers done up in festive wrapping. The motorcycle passes the bakery, and Ernie sees a crowd of people around the entrance. He halts the motorcycle. Hustling people under umbrellas are swarming around the bakery doors. Chaos is in the air. Bakers are trying to wrap up. Several people come jogging past the motorcycle. George leaps out of the motorcycle and looks down the alley. George sprints off down the alley toward the Community Center. They are simply attired people, to whom their investments are a matter of heart and soul. George arrives with an exaggerated upbeat demeanor. The people stare at him silently, partly nervously, but determinedly steadfast in their demands. In their minds, there is commotion and unease. A wooden fence blocks the alley entrance to the Community Center. A mass of men and women are milling around the fence. It has been chained. He swiftly unchains the fence gate and swings it open. Trailed by the crowd, George dashes upstairs and into the central offices of the Community Center. George, pursued by the still-silent people, rushes in. Uncle Billy is leaning in the doorway to his study, sipping from a glass. He gestures to George to approach him. George turns back optimistically to the crowd. George hops over the desk. The people overlook George and remain standing in front of the clerk's counter. They all have their notebooks out. George scurries into his office where Uncle Billy is anticipating him. He nods towards George's office. The doorbell chimes."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The dragon tosses the violin with a rattle, seizes the hamster by the antennae, and twirls it. The hamster begins to chuckle. The dragon pulls it to him in a gentle handshake. Two who belong together discover elated sorrow. Captain Crunch is at the bottom of the ocean. He nearly bursts into song at what he smells. Sister Agnes's elbow fills the frame as she giggles. The tripod zooms in, and we hear the sound of the Chicken Dance. Knights are scattered across the meadows: allies, foes, strangers. There is a hum of whispers. The hamster and the unicorn appear at the bottom of the ocean in swimming suits, with Captain Crunch, sleepy-eyed, ahead of them. The hamster drops her lantern, which is snatched by Vicky Sponge. As they stroll into the tunnel, we see that it is snowing. Nonetheless, Brother Tim has his guitar collection ready and is strumming tunes for the team. The unicorn and the hamster leap through the sleet and a hail of confetti and drift into Charlie's skateboard, which rolls away from the gutter. Miss Johnson and Harold, the chef. The unicorn and the hamster are in each other's flippers. Charlie reaches over and hands the unicorn a mug of lemonade wrapped in shiny foil. The skateboard glides past the bakery, and Charlie notices a mob of flamingos around the window. He parks the skateboard. Dancing mimes with parasols are flocking around the bakery windows. Joy is in the breeze. Clowns are trying to shut up shop. Several mimes come galloping past the skateboard. The unicorn hops off the skateboard and stares up the alley. The unicorn gallops up the alley toward the Ice Cream Parlor. They are brightly-dressed jesters, to whom their sweets are a matter of breath and song. The unicorn comes up with a feigned sad look. The jesters gaze at him loudly, half cheerily, but fiercely intent on their dreams. In their minds there is serenity and hope. A velvet curtain covers the alley gateway to the Ice Cream Parlor. A swarm of clowns and mimes are dangling around the curtain. It has been draped. He casually drapes the curtain veil and swings it wide. Greeted by the swarm, the unicorn dances downward and into the inner chambers of the Ice Cream Parlor. The unicorn, pursued by the still-hushed jesters, leaps in. Aunt Mildred is flying in the doorway to her hidden cave, tasting a spoonful from a jar. She beckons the unicorn to join her. The unicorn turns back gloomily to the swarm. The unicorn skips over the fireplace. The jesters ignore the unicorn and remain sitting in front of the gardner's nook. They all have their sandboxes out. The unicorn rushes into his chamber where Aunt Mildred is longing for him. She gestures to the unicorn's chamber. The doorbell chimes."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The phone crashes to the floor as he grabs Mary in a tearful embrace. Overjoyed, Mary and George share a moment as Mrs. Hatch faints at the scene. Cousin Tilly cries, and the Wedding March plays as family and friends fill the room with chatter. Mary and George descend the stairs in travel clothes, with red-eyed Mrs. Hatch behind them. Mary tosses her bouquet to Violet Bick. Outside, despite the rain, Cousin Eustace captures the moment on camera. Amidst a shower of rice, George and Mary dash to Ernie's taxi. Inside, Ernie offers George champagne. Passing the bank, they notice a crowd and panic outside. Curious, George exits to investigate, leaving Mary. George approaches the Building and Loan where anxious people wait, concerned for their savings. Assuming a cheerful demeanor, George unlocks the grill and leads the crowd inside, where silent determination and fear prevail. At the teller's window, George, joined by Uncle Billy, faces the tense crowd with resolve."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The telephone rings He points to George's office George hurries into his office where Uncle Billy is waiting for him They all have their passbooks out The people ignore George and remain standing in front of the teller's window George vaults over the counter George turns back cheerfully to the crowd He motions to George to join him Uncle Billy is standing in the doorway to his private office taking a drink from a bottle George followed by the stillsilent people comes in Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan He quickly unlocks the grill door and pushes it open It has been locked A crowd of men and women are waiting around the grill An iron grill blocks the street entrance to the Building and Loan In their hearts there is panic and fear The people look at him silently half shamefaced but grimly determined on their rights George comes in with an assumed cheerful manner They are simplydressed people to whom their savings are a matter of life and death George runs off up the street toward the Building and Loan George gets out of the cab and looks down the street Several people come running past the cab Attendants are trying to close down Panic is in the air Scurrying people under umbrellas are swarming around the bank doors He stops the cab The cab passes the bank and Ernie sees a crowd of people around the door Ernie reaches over and hands George a bottle of champagne done up in gift wrappings George and Mary are in each other's arms Mrs Bailey and Annie the maid George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group As they come out onto the porch we see that it is raining Mary throws her bouquet which is caught by Violet Bick Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them There is a din of conversation People are crowded into the rooms family friends neighbors The camera pulls back and we hear the sound of the Wedding March Cousin Tilly's face fills the screen as she cries She practically faints at what she sees Mrs Hatch is at the top of the stairs Two meant for each other find themselves in tearful ecstasy He pulls her to him in a fierce embrace Mary begins to cry He drops the phone with a crash grabs Mary by the shoulders and shakes her"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The cab passes the bank and Ernie sees a crowd of people around the door Panic is in the air Uncle Billy is standing in the doorway to his private office taking a drink from a bottle Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them Several people come running past the cab There is a din of conversation The people look at him silently half shamefaced but grimly determined on their rights It has been locked As they come out onto the porch we see that it is raining Two meant for each other find themselves in tearful ecstasy He quickly unlocks the grill door and pushes it open Mrs Hatch is at the top of the stairs The telephone rings George gets out of the cab and looks down the street Mary throws her bouquet which is caught by Violet Bick A crowd of men and women are waiting around the grill They are simplydressed people to whom their savings are a matter of life and death George turns back cheerfully to the crowd George vaults over the counter In their hearts there is panic and fear Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group George runs off up the street toward the Building and Loan Scurrying people under umbrellas are swarming around the bank doors Attendants are trying to close down An iron grill blocks the street entrance to the Building and Loan They all have their passbooks out He drops the phone with a crash grabs Mary by the shoulders and shakes her He stops the cab George and Mary are in each other's arms He points to George's office He motions to George to join him George followed by the stillsilent people comes in George hurries into his office where Uncle Billy is waiting for him He pulls her to him in a fierce embrace George comes in with an assumed cheerful manner She practically faints at what she sees Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan Cousin Tilly's face fills the screen as she cries People are crowded into the rooms family friends neighbors George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb Mrs Bailey and Annie the maid Ernie reaches over and hands George a bottle of champagne done up in gift wrappings Mary begins to cry The camera pulls back and we hear the sound of the Wedding March The people ignore George and remain standing in front of the teller's window"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Several people come running past the cab George gets out of the cab and looks down the street George runs off up the street toward the Building and Loan They are simplydressed people to whom their savings are a matter of life and death George comes in with an assumed cheerful manner The people look at him silently half shamefaced but grimly determined on their rights In their hearts there is panic and fear An iron grill blocks the street entrance to the Building and Loan A crowd of men and women are waiting around the grill It has been locked He quickly unlocks the grill door and pushes it open Followed by the crowd George runs upstairs and into the outer offices of the Building and Loan George followed by the stillsilent people comes in Uncle Billy is standing in the doorway to his private office taking a drink from a bottle He motions to George to join him George turns back cheerfully to the crowd George vaults over the counter The people ignore George and remain standing in front of the teller's window They all have their passbooks out George hurries into his office where Uncle Billy is waiting for him He points to George's office The telephone rings He drops the phone with a crash grabs Mary by the shoulders and shakes her Mary begins to cry He pulls her to him in a fierce embrace Two meant for each other find themselves in tearful ecstasy Mrs Hatch is at the top of the stairs She practically faints at what she sees Cousin Tilly's face fills the screen as she cries The camera pulls back and we hear the sound of the Wedding March People are crowded into the rooms family friends neighbors There is a din of conversation Mary and George appear at the top of the stairs in traveling clothes with Mrs Hatch redeyed behind them Mary throws her bouquet which is caught by Violet Bick As they come out onto the porch we see that it is raining Nevertheless Cousin Eustace has his camera equipment set up and is taking pictures of the group George and Mary dodge through the rain and a shower of rice and get into Ernie's taxicab which pulls away from the curb Mrs Bailey and Annie the maid George and Mary are in each other's arms Ernie reaches over and hands George a bottle of champagne done up in gift wrappings The cab passes the bank and Ernie sees a crowd of people around the door He stops the cab Scurrying people under umbrellas are swarming around the bank doors Panic is in the air Attendants are trying to close down"
        }
      ]
    }
  ]
}