{
  "ground_truth": "Potter is now behind his desk. He spreads the newspaper out in front of him, muttering as he does so. He sees the envelope, looks inside at the money. Then, to his goon, indicating the office door. Potter opens the door just a little, and peers through into the bank. He starts thumping his pockets, with increasing panic, and looks in the waste paper basket on the floor. Uncle Billy looks around for the money envelope. He looks puzzled, thinks hard, then a look of concern creeps into his eyes. He finally rushes through the door and out into the street. The goon wheels him back to his desk. He is deep in thought, with a crafty expression on his face. Uncle Billy running across the street in the direction of the Building and Loan. George coming from room where he has just left the bank examiner. He sees Violet Bick standing there. He hears a noise, and sees Uncle Billy entering the office. Uncle Billy comes hurrying in. Uncle Billy picks up the phone and speaks distractedly, without knowing what he is saying. He hangs up agitatedly, muttering to himself as he goes into his own office. Cousin Tilly and Cousin Eustace look after him, dumbfounded. George has just finished writing something, and is slipping the paper into an envelope. She looks at him, then says a strange thing. She reaches up and kisses him on the cheek, leaving lipstick. George opens the door for her. As George and Violet come through the door, they are being watched by Cousin Tilly, Cousin Eustace and the bank examiner, who is still waiting to go to work on the books. Violet sees the lipstick on George's cheek, and dabs at it with her handkerchief. She exits. As George opens the door he sees Uncle Billy frantically looking for the missing envelope. The office is in a mess, drawers are opened, and papers scattered on the floor and on the desk. George stops short, suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the door. Cousin Tilly is at her switchboard, and Cousin Eustace standing beside her. Suddenly the door opens and George comes striding out. He goes directly to the safe and starts searching, but doesn't find the money. Then he goes to the cash drawer in the counter, and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow, looking everywhere for the missing money. They pause for a moment on the sidewalk.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Potter is now behind his bureau. He spreads the gazette out in front of him, muttering as he does so. He sees the packet, looks inside at the cash. Then, to his thug, indicating the workplace portal. Potter opens the portal just a little, and peers through into the depository. He starts thumping his pouches, with increasing panic, and looks in the waste paper receptacle on the floor. Uncle Billy looks around for the cash packet. He looks puzzled, thinks hard, then a look of concern creeps into his eyes. He finally rushes through the portal and out into the street. The thug wheels him back to his bureau. He is deep in thought, with a crafty expression on his face. Uncle Billy running across the street in the direction of the Establishment and Loan. George coming from chamber where he has just left the bank examiner. He sees Violet Bick standing there. He hears a sound, and sees Uncle Billy entering the workplace. Uncle Billy comes hurrying in. Uncle Billy picks up the telephone and speaks distractedly, without knowing what he is saying. He hangs up agitatedly, muttering to himself as he goes into his own workplace. Cousin Tilly and Cousin Eustace look after him, dumbfounded. George has just finished writing something, and is slipping the paper into a packet. She looks at him, then says a strange thing. She reaches up and kisses him on the cheek, leaving lipstick. George opens the portal for her. As George and Violet come through the portal, they are being watched by Cousin Tilly, Cousin Eustace and the bank examiner, who is still waiting to go to labor on the ledgers. Violet sees the lipstick on George's cheek, and dabs at it with her handkerchief. She exits. As George opens the portal he sees Uncle Billy frantically looking for the missing packet. The workplace is in a mess, drawers are opened, and papers scattered on the floor and on the bureau. George stops short, suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the portal. Cousin Tilly is at her switchboard, and Cousin Eustace standing beside her. Suddenly the portal opens and George comes striding out. He goes directly to the safe and starts searching, but doesn't find the cash. Then he goes to the cash drawer in the counter, and looks through it. Carter is still waiting in the doorway to his workplace. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow, looking everywhere for the missing cash. They pause for a moment on the sidewalk."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Potter is now behind his desk. The newspaper is spread out in front of him by Potter, who mutters as it is done. The envelope is seen by him, and the money inside is looked at. Then, he indicates the office door to his goon. The door is opened just a little by Potter, and he peers through into the bank. His pockets are thumped by him with increasing panic, and the waste paper basket on the floor is looked in. The money envelope is looked for by Uncle Billy. He seems puzzled, thinks hard, then a look of concern creeps into his eyes. The door is finally rushed through by him, and he runs out into the street. The goon wheels him back to his desk. A crafty expression is on his face, showing he is deep in thought. Uncle Billy runs across the street in the direction of the Building and Loan. George comes from the room where the bank examiner has just been left by him. Violet Bick is seen standing there by him. A noise is heard by him, and he sees Uncle Billy entering the office. Uncle Billy hurries in. The phone is picked up by Uncle Billy and he speaks distractedly, without knowing what is being said by him. He agitatedly hangs up, muttering to himself as his own office is entered by him. Cousin Tilly and Cousin Eustace look after him, dumbfounded. George has just finished writing something, and an envelope is slipped into by him with the paper. She looks at him, then a strange thing is said by her. He is reached up to and kissed on the cheek by her, leaving lipstick. The door is opened for her by George. As the door is come through by George and Violet, they are watched by Cousin Tilly, Cousin Eustace, and the bank examiner, who waits to work on the books. The lipstick on George's cheek is seen by Violet, and she dabs at it with her handkerchief. She exits. As the door is opened by George, Uncle Billy is seen frantically looking for the missing envelope. The office is in a mess, drawers are opened, and papers are scattered on the floor and on the desk. George stops short, suddenly aware of the tragic old eyes that look up at him. Uncle Billy nervously gestures for George to come in. That is done and the door is closed by him. Cousin Tilly is at her switchboard, and Cousin Eustace stands beside her. Suddenly, the door is opened, and George strides out. The safe is gone to directly by him and searched, but the money isn't found. Then, he goes to the cash drawer in the counter, and it is looked through by him. Carter is still waiting in the doorway to his office. George is run over to by Cousin Eustace. The former's steps through the snow are retraced by Uncle Billy and George, looking everywhere for the missing money. They pause for a moment on the sidewalk."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Potter sits behind his desk, spreading the newspaper out, muttering. He notices the envelope and checks the money inside. He signals his goon and cracks the office door to peer into the bank, patting his pockets in panic and checking the wastebasket. Uncle Billy searches for the money envelope, looks puzzled, then worried, and rushes outside. Returned to his desk by the goon, he thinks craftily. Uncle Billy runs toward the Building and Loan while George exits a room, encountering Violet Bick. Hearing noise, George sees Uncle Billy enter, hurriedly talking on the phone without knowing what he's saying, then agitatedly heads to his office. Cousin Tilly and Cousin Eustace watch, surprised. George finishes writing, slips the paper into an envelope; she kisses his cheek, leaving lipstick, and exits as George opens the door. Tilly, Eustace, and the bank examiner watch. Violet wipes George's cheek with her handkerchief. George sees Uncle Billy frantically searching for the envelope in the messy office and goes in. Tilly and Eustace stay at the switchboard, while George strides out, searches the safe, and checks the cash drawer. Carter waits in the doorway. Eustace runs to George, who retraces Uncle Billy's steps in the snow, searching for the missing money, pausing on the sidewalk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Potter sits at his desk, spreads the newspaper, muttering. He sees the money envelope, checks inside, signals his goon to open the office door slightly, and peers into the bank. Searching his pockets and the wastebasket, Uncle Billy realizes the money is missing and rushes out. The goon returns him to his desk, looking crafty. Billy races towards the Building and Loan where George, leaving the bank examiner, encounters Violet Bick. Billy enters, distractedly speaking into the phone and muttering as he retreats to his office, with Cousin Tilly and Eustace confused. George slips a note into an envelope; Violet kisses him, leaving lipstick. She wipes the lipstick as she exits, while Billy frantically searches for the missing envelope amidst chaos. George, aware of Billy's distress, closes the door. Tilly at her switchboard and Eustace watch as George searches the safe and cash drawer, finding nothing. Carter awaits as Uncle Billy and George retrace steps in the snow, searching for the money."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Potter is now situated behind his imposing desk, a position of authority and contemplation. He meticulously spreads the newspaper out in front of him, all the while muttering under his breath, as if these quiet words would bring clarity. His eyes land on an envelope, which he carefully examines, peeking inside to confirm the presence of money. Then, turning his attention to his loyal goon, he gestures subtly, indicating towards the office door, hinting at a deeper plan. Carefully, Potter eases the door open just a crack, stealing a glance into the bustling bank beyond. Amid this, he starts patting his pockets, first with mild concern, which quickly escalates to a desperate panic, as if something crucial has gone missing. In his mounting anxiety, he checks the waste paper basket on the floor, a last resort in his search. Meanwhile, Uncle Billy is also searching, casting around frantically for the money envelope. A puzzled expression etches across his face, and he pauses, thinking hard, trying to retrace his steps. Suddenly, a look of deep concern clouds his eyes, and realizing the gravity of the situation, he bursts through the door and rushes out into the street. \n\nThe goon, ever watchful, returns him to his desk, where Potter sits deep in thought, a crafty expression dancing across his features. Meanwhile, Uncle Billy, fueled by urgency, is seen sprinting across the street towards the Building and Loan. George, having just departed from a meeting with the bank examiner, emerges from the room, when his eyes land on Violet Bick standing nearby. His attention is then drawn away by a noise, and Uncle Billy's hurried entrance into the office. Uncle Billy, flustered and distracted, picks up the phone, speaking incoherently, the words hardly registering. He then hangs up agitatedly, muttering to himself as he retreats into his own office space, leaving Cousin Tilly and Cousin Eustace watching him with dumbfounded expressions, struggling to comprehend the situation. George, having just completed a task, is seen slipping a piece of paper into an envelope, an action observed by an onlooker. This observer makes a move, suddenly saying something unexpected, before reaching up to place a soft kiss, leaving a trace of lipstick on his cheek. George, ever the gentleman, opens the door for her. \n\nAs George and Violet move through the doorway together, they are subtly scrutinized by the attentive eyes of Cousin Tilly, Cousin Eustace, and the patiently waiting bank examiner, who is ready to dive back into the books. Violet notices the lipstick mark on George's cheek and gently dabs it away with her handkerchief before making her exit. As George reopens the door, he encounters Uncle Billy, who is frantically searching for the elusive envelope. The office is in a state of disarray, with drawers pulled open and papers strewn haphazardly across the floor and desk, evidence of the frantic search. George halts abruptly, suddenly recognizing the deep, troubled gaze of Uncle Billy, who looks up at him with tragic old eyes. Uncle Billy, with nervous gestures, beckons George to enter. George complies, closing the door behind him to maintain privacy. Meanwhile, Cousin Tilly is stationed at her switchboard, with Cousin Eustace standing close by, observing the unfolding drama. \n\nIn a sudden burst of energy, the door flies open and George strides out with determination. He makes his way directly to the safe, searching with a sense of urgency, but his efforts yield no results as the money remains elusive. Undeterred, he moves to the cash drawer within the counter, rifling through it in a last-ditch effort. Carter, steadfast and patient, remains standing in the doorway to his office, observing the proceedings. Cousin Eustace darts over to assist George. Meanwhile, Uncle Billy and George are seen retracing Uncle Billy's previous steps through the snow, meticulously searching every corner for the missing money. They pause momentarily on the sidewalk, sharing a brief exchange as the gravity of their predicament weighs heavily on them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Potter, now comfortably settled behind his large and imposing desk, occupies a position that exudes both authority and contemplative thought. With deliberate care, he spreads the newspaper out meticulously in front of him, his fingers smoothing the pages as he mutters softly under his breath, as if these quiet words might somehow dispel confusion and bring about much-needed clarity. His keen eyes soon focus on an envelope, which he scrutinizes with great care, peeking inside to confirm, with satisfaction, the presence of money. Shifting his attention, he gestures subtly to his ever-loyal goon, a silent indication toward the office door, suggesting the inception of a more intricate plan. With careful precision, Potter eases the door open just a crack, stealing a strategic glance into the bustling activity of the bank beyond. Amidst this scene, he begins patting his pockets with a mild concern that quickly escalates into a desperate panic, as though something vitally important has vanished. In a state of mounting anxiety, he checks the waste paper basket on the floor, resorting to this last-ditch effort in his frantic search. Meanwhile, Uncle Billy is engaged in his own frantic search, casting about in a desperate attempt to locate the critical money envelope. A puzzled expression becomes evident on his face as he pauses, thinking hard, trying to bring back the memory of his previous actions. A look of deep concern suddenly clouds his eyes as he comprehends the gravity of the situation, prompting him to rush out through the door and onto the street.  \n\nThe goon, ever watchful and diligent, guides him back to his desk, where Potter remains consumed by thought, a crafty expression playing across his features. Meanwhile, Uncle Billy, propelled by a sense of urgency, is seen making a determined sprint across the street, heading straight towards the Building and Loan. George, emerging from a recent meeting with the bank examiner, catches sight of Violet Bick standing nearby. However, his attention is soon diverted by a noise, and by Uncle Billy's hasty entrance into the office. Uncle Billy, flustered and visibly distracted, picks up the phone, speaking in a manner that's almost incoherent, with words that barely register. He then hangs up with agitation, muttering to himself as he retreats into his office, leaving Cousin Tilly and Cousin Eustace with dumbfounded expressions, their faces reflecting their struggle to comprehend the unfolding events. George, having just completed a task, is seen slipping a piece of paper into an envelope, an act observed by someone nearby. This observer makes an unexpected move, suddenly saying something surprising before reaching up to place a gentle kiss, leaving a trace of lipstick on his cheek. George, always the gentleman, opens the door graciously for her. \n\nAs George and Violet move through the doorway together, they are subtly scrutinized by the attentive eyes of Cousin Tilly, Cousin Eustace, and the patiently waiting bank examiner, who is ready and eager to delve back into the books. Violet soon notices the lipstick mark on George's cheek and gently dabs it away with her handkerchief before making her graceful exit. As George reopens the door, he encounters Uncle Billy, who is frantically searching for the elusive envelope. The office is in a state of considerable disarray, with drawers pulled open and papers strewn haphazardly across both the floor and the desk, clear evidence of a frantic search effort. George comes to an abrupt halt, suddenly recognizing the deeply troubled gaze of Uncle Billy, who looks up at him with tragic, old eyes. Uncle Billy, with nervous gestures, beckons George to enter the room. George complies, closing the door firmly behind him to maintain a sense of privacy. Meanwhile, Cousin Tilly remains stationed at her switchboard, with Cousin Eustace standing close by, keenly observing the unfolding drama. \n\nIn a sudden burst of energy and determination, the door flies open, and George strides out with clear purpose in his steps. He makes his way directly to the safe, searching with an intense sense of urgency, but unfortunately, his efforts yield no results as the elusive money remains unfound. Undeterred by this setback, he moves swiftly to the cash drawer within the counter, rifling through it in a final, desperate effort. Carter, steadfast and patient, remains standing in the doorway to his office, observing the proceedings with unwavering focus. Cousin Eustace quickly darts over to assist George. Meanwhile, Uncle Billy and George are seen retracing Uncle Billy's previous steps through the snow, meticulously searching every conceivable corner for the missing money. They pause momentarily on the sidewalk, sharing a brief but significant exchange as the gravity of their predicament weighs heavily upon them both."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Potter settles himself comfortably behind his desk, smoothing out the surface of the newspaper in front of him with deliberate care while muttering to himself under his breath, seemingly lost in thought or commentary. His attention is then drawn to an envelope resting on the desk, prompting him to examine it closely, peering inside to confirm that it contains money. Satisfied or perhaps intrigued, he turns his attention to his goon, silently gesturing toward the office door as if indicating a plan or command. With cautious curiosity, Potter partially opens the door, just enough to peer through the narrow gap into the adjacent bank, his eyes scanning the scene with a sense of vigilance. Suddenly, he begins patting his pockets with growing urgency, his movements becoming frantic as he searches for something missing, and his sense of panic intensifies. In his desperation, his eyes dart to the waste paper basket on the floor, checking its contents in hopes of finding what he seeks. Meanwhile, Uncle Billy is equally troubled, scanning his surroundings in a desperate effort to locate the missing money envelope. His face reflects a blend of puzzlement and deep concentration as he tries to piece together the situation, his concern steadily growing. Finally, a realization or decision hits him, prompting him to dash hurriedly through the door and out onto the bustling street beyond. As he crosses the street with urgency in the direction of the Building and Loan, the goon repositions Uncle Billy at Potter's desk, observing as Potter slips into a deep, contemplative state marked by a crafty expression. Concurrently, Uncle Billy moves with purpose across the street, his destination clear in his mind. At the same moment, George exits a room where he has recently concluded a meeting with the bank examiner, stepping out into an area where he spots Violet Bick waiting. Amid their encounter, a noise diverts his attention, drawing his gaze to Uncle Billy as he enters the office in a hurried, flustered manner. Uncle Billy's actions are frantic and distracted, as he picks up the phone, speaking into it without a clear sense of what he is saying, his agitation mounting. After he hangs up, he mutters under his breath, consumed by his thoughts as he retreats into his own office, leaving Cousin Tilly and Cousin Eustace staring after him in stunned silence. Meanwhile, George completes some writing task, methodically slipping the paper into an envelope, his focus momentarily interrupted by a peculiar comment from someone nearby. The interruption is accompanied by an unexpected gesture, as she leans in and plants a kiss on his cheek, leaving a visible trace of lipstick behind. George, taking the interaction in stride, steps forward to open the door for her as a gesture of courtesy. As George and Violet proceed through the doorway, their movements are observed by Cousin Tilly, Cousin Eustace, and the ever-patient bank examiner, who bides his time, eager to resume his review of the financial records. Violet, noticing the lipstick mark left on George's cheek, thoughtfully blots it with her handkerchief before making her exit. As George swings open the door, he is met with the sight of Uncle Billy, who is in the throes of a frantic search for the elusive envelope. The office is in disarray, indicative of Uncle Billy's chaotic search, with drawers left open, and papers scattered haphazardly across both the floor and the desk. George halts abruptly, struck by the sight of Uncle Billy's eyes, filled with a tragic, pleading expression that penetrates him deeply. Sensing the gravity of the moment, Uncle Billy gestures nervously, beckoning George to enter the room. George obliges, stepping inside and closing the door behind him to confer privately. Within the office, Cousin Tilly is stationed at her switchboard, with Cousin Eustace nearby, observing the developing situation. Suddenly, the door swings open once more, as George emerges with renewed purpose, striding confidently toward the safe, his intent to locate the missing money clear. Despite a thorough search, the money remains elusive, driving him to turn his attention to the cash drawer at the counter, scrutinizing its contents with no success. Carter stands patiently in the doorway to his office, awaiting developments. Recognizing the unfolding drama, Cousin Eustace rushes over to George. Meanwhile, Uncle Billy and George begin retracing Uncle Billy's recent steps, their path cutting through the snow as they methodically search every possible location where the money might have been misplaced. Their journey briefly pauses on the sidewalk, as they recalibrate their strategy in their quest to recover the missing funds."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Potter is at his desk, examining the newspaper and the envelope with money inside. He signals his goon toward the office door, opens it slightly to peer into the bank, and begins searching his pockets and wastebasket in increasing panic. Meanwhile, Uncle Billy is puzzled and concerned about the missing money. He rushes out into the street, heading toward the Building and Loan, while the goon returns Potter to his desk. Deep in thought, Potter wears a crafty expression.\n\nUncle Billy hurries into the office as George exits a room where he met with the bank examiner. George notices Violet Bick, hears a noise, and sees Uncle Billy entering, distractedly using the phone and then muttering as he enters his own office. Cousin Tilly and Cousin Eustace are left dumbfounded. George, having finished writing something and placing it in an envelope, receives a surprising kiss on the cheek from Violet, leaving lipstick. As George escorts her out, they're observed by Cousin Tilly, Cousin Eustace, and the bank examiner, who is waiting to examine the books. Violet notices the lipstick on George's cheek, wipes it off, and exits.\n\nGeorge enters to find Uncle Billy frantically searching for the missing envelope amidst a mess of scattered drawers and papers. Uncle Billy, with tragic eyes, gestures nervously for George to join him. George swiftly searches the safe and the cash drawer without success, with Carter still waiting by his office door. Cousin Eustace runs to George as he and Uncle Billy retrace Billy's steps through the snowy streets, desperately searching for the missing money, pausing momentarily on the sidewalk."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Potter, the influential owner of the local bank known for his ruthless business tactics, is now behind his desk. He spreads the newspaper, the Bedford Falls Gazette, out in front of him, muttering as he does so about the latest business news. He sees the envelope, looks inside at the money, a significant amount intended for an important transaction. Then, to his goon, indicating the office door with a sharp nod. Potter opens the door just a little, and peers through into the bustling bank where customers were busy with their transactions. He starts thumping his pockets, with increasing panic, and looks in the waste paper basket on the floor for the lost envelope. Uncle Billy, known for his absent-mindedness, looks around for the money envelope. He looks puzzled, thinks hard, then a look of concern creeps into his eyes as he realizes the gravity of the situation. He finally rushes through the door and out into the street lined with small-town shops and businesses. The goon wheels him back to his desk. He is deep in thought, with a crafty expression on his face, contemplating his next move. Uncle Billy is now running across the street in the direction of the Bedford Falls Building and Loan, a family-run institution struggling against Potter's vast enterprises. George, the kind-hearted manager of Building and Loan, is coming from the room where he has just left the bank examiner, a figure with the power to decide the future of the business. He sees Violet Bick, known throughout Bedford Falls for her vivid personality and colorful wardrobe, standing there. He hears a noise, and sees Uncle Billy entering the office. Uncle Billy comes hurrying in, visibly distressed. Uncle Billy picks up the phone and speaks distractedly, without knowing what he is saying due to his rising panic. He hangs up agitatedly, muttering to himself about the missing money as he goes into his own office. Cousin Tilly and Cousin Eustace, employees at the Building and Loan, look after him, dumbfounded by his behavior. George has just finished writing something, likely a note for the bank examiner, and is slipping the paper into an envelope. Violet looks at him, then says a strange thing, referring to the lipstick imprint she leaves when she reaches up and kisses him on the cheek. George opens the door for her, maintaining his gentlemanly demeanor. As George and Violet come through the door, they are being watched by Cousin Tilly, Cousin Eustace, and the bank examiner, an official tasked with ensuring the company's compliance with financial regulations, who is still waiting to go to work on the books. Violet sees the lipstick on George's cheek and dabs at it with her handkerchief, a lace-edged token she always carries. She exits, leaving a faint scent of her perfume in the air. As George opens the door again, he sees Uncle Billy frantically looking for the missing envelope. The office is in a mess, with drawers opened and papers scattered on the floor and on the desk, evidence of the chaos caused by the missing money. George stops short, suddenly aware of the tragic old eyes of Uncle Billy looking up at him, filled with desperation. Uncle Billy gestures nervously for George to come in. He does so and closes the door, shutting out the curious gazes from the office. Cousin Tilly is at her switchboard, connecting calls with practiced efficiency, and Cousin Eustace stands beside her, worried about the unfolding events. Suddenly the door opens and George comes striding out with determination. He goes directly to the safe, an old but secure relic, and starts searching, but doesn't find the money. Then he goes to the cash drawer in the counter and looks through it, hoping for a miracle. Carter, the bank examiner, is still waiting in the doorway to his office, scribbling notes on his clipboard. Cousin Eustace runs over to George, eager to help. Uncle Billy and George are retracing Uncle Billy's steps through the snow-dusted streets, looking everywhere for the missing money. They pause for a moment on the sidewalk, catching their breath in the crisp winter air, their minds racing with thoughts of what could have gone wrong."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "then a look of concern creeps into his eyes Potter is now behind his desk He spreads the newspaper out in front of him muttering as he does so He sees the envelope looks inside at the money Then to his goon indicating the office door Carter is still waiting in the doorway to his office George has just finished writing something and is slipping the paper into an envelope Potter opens the door just a little and peers through into the bank The office is in a mess drawers are opened and papers scattered on the floor and on the desk He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor Uncle Billy looks around for the money envelope He looks puzzled thinks hard Cousin Tilly is at her switchboard and Cousin Eustace standing beside her then a look of concern creeps into his eyes He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor He finally rushes through the door and out into the street Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money The goon wheels him back to his desk He is deep in thought with a crafty expression on his face Uncle Billy running across the street in the direction of the Building and Loan George coming from room where he has just left the bank examiner He spreads the newspaper out in front of him muttering as he does so He sees the envelope looks inside at the money He sees Violet Bick standing there Cousin Tilly and Cousin Eustace look after him dumbfounded Uncle Billy gestures nervously for George to come in He hears a noise and sees Uncle Billy entering the office He sees Violet Bick standing there Uncle Billy comes hurrying in Potter is now behind his desk Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying He hangs up agitatedly muttering to himself as he goes into his own office Cousin Tilly and Cousin Eustace look after him dumbfounded George has just finished writing something and is slipping the paper into an envelope She looks at him then says a strange thing She reaches up and kisses him on the cheek leaving lipstick Cousin Eustace runs over to George George opens the door for her As George and Violet come through the door they are being watched by Cousin Tilly Cousin Eustace and the bank examiner who is still waiting to go to work on the books He looks puzzled thinks hard Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying Violet sees the lipstick on George's cheek and dabs at it with her handkerchief She exits As George opens the door he sees Uncle Billy frantically looking for the missing envelope The office is in a mess drawers are opened and papers scattered on the floor and on the desk George stops short suddenly aware of the tragic old eyes looking up at him Uncle Billy gestures nervously for George to come in He does so and closes the door Cousin Tilly is at her switchboard and Cousin Eustace standing beside her He hears a noise and sees Uncle Billy entering the office They pause for a moment on the sidewalk Suddenly the door opens and George comes striding out Uncle Billy comes hurrying in He goes directly to the safe and starts searching but does not find the money She exits Then he goes to the cash drawer in the counter and looks through it Carter is still waiting in the doorway to his office Cousin Eustace runs over to George Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money They pause for a moment on the sidewalk Uncle Billy looks around for the money envelope"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Potter is now behind his desk. He spreads the newspaper out in front of him muttering as he does so. He sees the envelope looks inside at the money. Then to his goon indicating the office door. Potter opens the door just a little and peers through into the bank. He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor. Uncle Billy looks around for the money envelope. He looks puzzled thinks hard. then a look of concern creeps into his eyes. He finally rushes through the door and out into the street. The goon wheels him back to his desk. He is deep in thought with a crafty expression on his face. Uncle Billy running across the street in the direction of the Building and Loan. George coming from room where he has just left the bank examiner. He sees Violet Bick standing there. He hears a noise and sees Uncle Billy entering the office. Uncle Billy comes hurrying in. Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying. He hangs up agitatedly muttering to himself as he goes into his own office. Cousin Tilly and Cousin Eustace look after him dumbfounded. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. George has just finished writing something and is slipping the paper into an envelope. She looks at him then says a strange thing. She reaches up and kisses him on the cheek leaving lipstick. George opens the door for her. As George and Violet come through the door they are being watched by Cousin Tilly. Cousin Eustace and the bank examiner who is still waiting to go to work on the books. Violet sees the lipstick on George's cheek and dabs at it with her handkerchief. She exits. As George opens the door he sees Uncle Billy frantically looking for the missing envelope. The office is in a mess drawers are opened and papers scattered on the floor and on the desk. George stops short suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the door. Cousin Tilly is at her switchboard and Cousin Eustace standing beside her. Suddenly the door opens and George comes striding out. He goes directly to the safe and starts searching but does not find the money. Then he goes to the cash drawer in the counter and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money. They pause for a moment on the sidewalk."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Potter is now behind his desk. He spreads the newspaper out in front of him muttering as he does so. He sees the envelope looks inside at the money. Then to his goon indicating the office door. Potter opens the door just a little and peers through into the bank. He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor. Uncle Billy looks around for the money envelope. He looks puzzled thinks hard. then a look of concern creeps into his eyes. He finally rushes through the door and out into the street. The goon wheels him back to his desk. He is deep in thought with a crafty expression on his face. Uncle Billy running across the street in the direction of the Building and Loan. George coming from room where he has just left the bank examiner. He sees Violet Bick standing there. He hears a noise and sees Uncle Billy entering the office. Uncle Billy comes hurrying in. Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying. He hangs up agitatedly muttering to himself as he goes into his own office. Cousin Tilly and Cousin Eustace look after him dumbfounded. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. George has just finished writing something and is slipping the paper into an envelope. She looks at him then says a strange thing. She reaches up and kisses him on the cheek leaving lipstick. George opens the door for her. As George and Violet come through the door they are being watched by Cousin Tilly. Cousin Eustace and the bank examiner who is still waiting to go to work on the books. Violet sees the lipstick on George's cheek and dabs at it with her handkerchief. She exits. As George opens the door he sees Uncle Billy frantically looking for the missing envelope. The office is in a mess drawers are opened and papers scattered on the floor and on the desk. George stops short suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the door. Cousin Tilly is at her switchboard and Cousin Eustace standing beside her. Suddenly the door opens and George comes striding out. He goes directly to the safe and starts searching but does not find the money. Then he goes to the cash drawer in the counter and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money. They pause for a moment on the sidewalk."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Potter is now behind his desk. He spreads the newspaper out in front of him muttering as he does so. He sees the envelope looks inside at the money. Then to his goon indicating the office door. Potter opens the door just a little and peers through into the bank. He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor. Uncle Billy looks around for the money envelope. He looks puzzled thinks hard. then a look of concern creeps into his eyes. He finally rushes through the door and out into the street. George stops short suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the door. Cousin Tilly is at her switchboard and Cousin Eustace standing beside her. Suddenly the door opens and George comes striding out. He goes directly to the safe and starts searching but does not find the money. Then he goes to the cash drawer in the counter and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money. They pause for a moment on the sidewalk."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Potter is now behind his desk. He spreads the newspaper out in front of him muttering as he does so. He sees the envelope looks inside at the money. Then to his goon indicating the office door. Then he goes to the cash drawer in the counter and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money. They pause for a moment on the sidewalk."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Potter is now behind his desk. The raccoon spreads the newspaper out in front of him, muttering as the raccoon does so. The raccoon sees the envelope, looks inside at the money. Then, to the unicorn, indicating the office door. The raccoon opens the door just a little, and peers through into the bank. The raccoon starts thumping its pockets, with increasing panic, and looks in the waste paper basket on the floor. The giraffe looks around for the money envelope. The giraffe looks puzzled, thinks hard, then a look of concern creeps into its eyes. The giraffe finally rushes through the door and out into the street. The unicorn wheels the giraffe back to its desk. The giraffe is deep in thought, with a crafty expression on its face. The giraffe is running across the street in the direction of the Building and Loan. The penguin coming from room where it has just left the bank examiner. The penguin sees Violet Bick standing there. The penguin hears a noise, and sees the giraffe entering the office. The giraffe comes hurrying in. The giraffe picks up the phone and speaks distractedly, without knowing what it is saying. The giraffe hangs up agitatedly, muttering to itself as it goes into its own office. Cousin Tilly and Cousin Eustace look after the giraffe, dumbfounded. The penguin has just finished writing something, and is slipping the paper into an envelope. The fairy looks at the penguin, then says a strange thing. The fairy reaches up and kisses the penguin on the cheek, leaving lipstick. The penguin opens the door for the fairy. As the penguin and Violet come through the door, they are being watched by Cousin Tilly, Cousin Eustace and the bank examiner, who is still waiting to go to work on the books. Violet sees the lipstick on the penguin's cheek, and dabs at it with her handkerchief. Violet exits. As the penguin opens the door it sees the giraffe frantically looking for the missing envelope. The office is in a mess, drawers are opened, and papers scattered on the floor and on the desk. The penguin stops short, suddenly aware of the tragic old eyes looking up at it. The giraffe gestures nervously for the penguin to come in. The penguin does so and closes the door. Cousin Tilly is at her switchboard, and Cousin Eustace standing beside her. Suddenly the door opens and the penguin comes striding out. The penguin goes directly to the safe and starts searching, but doesn't find the money. Then the penguin goes to the cash drawer in the counter, and looks through it. Carter is still waiting in the doorway to his office. Cousin Eustace runs over to the penguin. The giraffe and the penguin are retracing the former's steps through the snow, looking everywhere for the missing money. They pause for a moment on the sidewalk."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Potter is now behind his podium. He spreads the map out in front of him, muttering as he does so. He sees the folder, looks inside at the tickets. Then, to his goon, indicating the library door. Potter opens the door just a little, and peers through into the arcade. He starts thumping his shoes, with increasing panic, and looks in the recycling bin on the floor. Uncle Billy looks around for the ticket folder. He looks puzzled, thinks hard, then a look of concern creeps into his eyes. He finally rushes through the door and out into the alley. The goon wheels him back to his podium. He is deep in thought, with a crafty expression on his face. Uncle Billy running across the avenue in the direction of the Pharmacy and Deli. George coming from the booth where he has just left the accountant. He sees Violet Bick standing there. He hears a noise, and sees Uncle Billy entering the library. Uncle Billy comes hurrying in. Uncle Billy picks up the microphone and speaks distractedly, without knowing what he is saying. He hangs up agitatedly, muttering to himself as he goes into his own booth. Cousin Tilly and Cousin Eustace look after him, dumbfounded. George has just finished writing something, and is slipping the postcard into a folder. She looks at him, then says a strange thing. She reaches up and kisses him on the forehead, leaving lipstick. George opens the gate for her. As George and Violet come through the gate, they are being watched by Cousin Tilly, Cousin Eustace and the accountant, who is still waiting to go to work on the reports. Violet sees the lipstick on George's forehead, and dabs at it with her bandana. She exits. As George opens the gate he sees Uncle Billy frantically looking for the missing folder. The library is in a mess, shelves are opened, and books scattered on the floor and on the podium. George stops short, suddenly aware of the tragic old eyes looking up at him. Uncle Billy gestures nervously for George to come in. He does so and closes the gate. Cousin Tilly is at her keyboard, and Cousin Eustace standing beside her. Suddenly the gate opens and George comes striding out. He goes directly to the locker and starts searching, but doesn't find the tickets. Then he goes to the cash register in the counter, and looks through it. Carter is still waiting in the doorway to his booth. Cousin Eustace runs over to George. Uncle Billy and George are retracing the former's steps through the garden, looking everywhere for the missing tickets. They pause for a moment on the path."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Potter is now behind his desk. He folds the newspaper neatly in front of him, humming as he does so. He notices the envelope, peeks inside at the money. Then, to his goon, gesturing toward the office door. Potter pushes the door open a bit, and glances through into the bank. He starts patting his pockets, with mounting agitation, and peers into the waste paper basket on the floor. Uncle Billy scans the area for the money envelope. He appears confused, ponders intently, then a look of distress appears in his eyes. He ultimately strolls through the door and out into the street. The goon escorts him back to his desk. He is lost in thought, with a sly expression on his face. Uncle Billy skipping across the street in the direction of the Building and Loan. George emerging from the room where he has just spoken with the bank examiner. He notices Violet Bick standing there. He detects a sound, and sees Uncle Billy leaving the office. Uncle Billy comes rushing in. Uncle Billy grabs the phone and speaks incoherently, without understanding what he is saying. He hangs up hurriedly, grumbling to himself as he returns to his own office. Cousin Tilly and Cousin Eustace observe him, astonished. George has just completed scribbling something, and is tucking the paper into an envelope. She glances at him, then remarks something odd. She stretches up and pecks him on the cheek, leaving lipstick. George holds the door for her. As George and Violet step through the door, they are being observed by Cousin Tilly, Cousin Eustace, and the bank examiner, who is still poised to begin working on the books. Violet notices the lipstick on George's cheek, and dabs at it with her handkerchief. She departs. As George pushes the door, he spots Uncle Billy anxiously searching for the missing envelope. The office is in disarray, drawers are ajar, and papers are strewn on the floor and on the desk. George halts abruptly, suddenly aware of the sorrowful old eyes gazing up at him. Uncle Billy motions nervously for George to enter. He does so and latches the door. Cousin Tilly is at her switchboard, and Cousin Eustace standing beside her. Suddenly the door opens and George strides out. He walks directly to the safe and starts rummaging, but doesn't locate the money. Then he moves to the cash drawer in the counter, and searches through it. Carter is still lingering in the doorway to his office. Cousin Eustace dashes over to George. Uncle Billy and George are retracing the former's steps through the snow, scanning everywhere for the missing money. They halt for a moment on the sidewalk."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Wizard is now behind his bookshelf. He spreads the magazine out in front of it, muttering as he does so. It sees the package, looks inside at the jewels. Then, to its henchman, indicating the elevator door. Wizard opens the door just a little, and peers through into the bakery. It starts thumping its sleeves, with increasing panic, and looks in the flower pot on the floor. Aunt Betty looks around for the jewel package. She looks puzzled, thinks hard, then a look of concern creeps into her ears. She finally rushes through the gate and out into the garden. The henchman wheels her back to her bookshelf. She is deep in thought, with a crafty expression on her face. Aunt Betty running across the yard in the direction of the Library and Café. Harold coming from closet where he has just left the professor. He sees Daisy Bloom standing there. He hears a noise, and sees Aunt Betty entering the shop. Aunt Betty comes hurrying in. Aunt Betty picks up the trumpet and speaks distractedly, without knowing what she is saying. She hangs up agitatedly, muttering to herself as she goes into her own pantry. Cousin Lily and Cousin Fergus look after her, dumbfounded. Harold has just finished sketching something, and is slipping the canvas into a folio. He looks at her, then says a strange thing. He reaches up and kisses her on the forehead, leaving ink. Harold opens the gate for her. As Harold and Daisy come through the gate, they are being watched by Cousin Lily, Cousin Fergus and the professor, who is still waiting to go to work on the paintings. Daisy sees the ink on Harold's forehead, and dabs at it with her napkin. She exits. As Harold opens the gate he sees Aunt Betty frantically looking for the missing package. The shop is in a mess, drawers are opened, and canvases scattered on the floor and on the counter. Harold stops short, suddenly aware of the tragic old ears looking up at him. Aunt Betty gestures nervously for Harold to come in. He does so and closes the gate. Cousin Lily is at her microphone, and Cousin Fergus standing beside her. Suddenly the gate opens and Harold comes striding out. He goes directly to the closet and starts searching, but doesn't find the jewels. Then he goes to the cookie jar in the cupboard, and looks through it. Porter is still waiting in the archway to her pantry. Cousin Fergus runs over to Harold. Aunt Betty and Harold are retracing the latter's steps through the meadow, looking everywhere for the missing jewels. They pause for a moment on the patio."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Baxter is now behind his easel. He unfolds the map in front of him, humming as he does so. He spots the necklace, glances inside at the jewels. Then, to his assistant, gesturing toward the workshop door. Baxter cracks the door open slightly, and peeks through into the library. He begins patting his coat, with growing worry, and checks in the recycling bin on the floor. Aunt Betty glances around for the jewel case. She looks confused, thinks deeply, then a look of alarm spreads across her face. She finally dashes through the door and out into the meadow. The assistant wheels her back to her easel. She is lost in thought, with a sly expression on her face. Aunt Betty sprinting across the meadow in the direction of the Bakery and Loan. Henry emerging from the room where he has just left the tax auditor. He spots Lily Drake standing there. He catches a sound, and notices Aunt Betty entering the workshop. Aunt Betty rushes in. Aunt Betty picks up the remote and speaks incoherently, without realizing what she is saying. She hangs up sorrowfully, murmuring to herself as she goes into her own workshop. Cousin Nancy and Cousin Evan watch after her, flabbergasted. Henry has just finished drafting something, and is sliding the canvas into a folder. She glances at him, then says an odd thing. She reaches up and taps him on the cheek, leaving paint. Henry holds the door for her. As Henry and Lily step through the door, they are being observed by Cousin Nancy, Cousin Evan, and the tax auditor, who is still waiting to start on the ledgers. Lily notices the paint on Henry's cheek, and wipes at it with her scarf. She exits. As Henry opens the door he spots Aunt Betty desperately searching for the lost necklace. The workshop is in disarray, drawers are opened, and materials scattered on the floor and on the table. Henry halts abruptly, suddenly aware of the sorrowful old eyes gazing up at him. Aunt Betty signals anxiously for Henry to enter. He does so and closes the door. Cousin Nancy is at her typewriter, and Cousin Evan standing beside her. Suddenly the door swings open and Henry comes marching out. He goes straight to the cabinet and begins digging, but doesn't find the jewels. Then he goes to the register at the counter, and rifles through it. Doug is still lingering in the doorway to his workshop. Cousin Evan hurries over to Henry. Aunt Betty and Henry are retracing the former's steps through the garden, searching everywhere for the lost jewels. They halt briefly on the pathway."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Potter is now behind his counter. He unfurls the blueprint out in front of him, humming as he does so. He notices the parcel, peeks inside at the documents. Then, to his accomplice, signaling the window. Potter cracks the window open just a bit, and glances through into the library. He starts tapping his shoes, with increasing urgency, and checks under the chair on the rug. Uncle Billy scans around for the documents parcel. He looks bewildered, ponders deeply, then a hint of worry fills his eyes. He finally dashes through the window and out onto the lawn. The accomplice rolls him back to his counter. He is lost in thought, with a sly expression on his face. Uncle Billy sprinting across the lawn in the direction of the Bakery and Bridge. George emerging from the chamber where he has just left the book inspector. He notices Violet Bick standing there. He hears a whisper, and observes Uncle Billy entering the chamber. Uncle Billy rushes in. Uncle Billy grabs the camera and speaks absentmindedly, without realizing what he is doing. He puts it down hastily, mumbling to himself as he walks into his own chamber. Cousin Tilly and Cousin Eustace gaze after him, perplexed. George has just finished sketching something, and is tucking the illustration into a parcel. She gazes at him, then utters an odd remark. She stretches up and pecks him on the forehead, leaving a smudge. George closes the window for her. As George and Violet pass through the window, they are being observed by Cousin Tilly, Cousin Eustace, and the book inspector, who is still waiting to dive into the ledgers. Violet spots the smudge on George's forehead and wipes at it with her scarf. She departs. As George closes the window, he notices Uncle Billy feverishly hunting for the lost parcel. The chamber is chaotic, drawers are ajar, and files scattered on the rug and on the counter. George halts abruptly, suddenly attentive to the sorrowful elderly eyes gazing up at him. Uncle Billy motions anxiously for George to enter. He does so and secures the window. Cousin Tilly is at her typewriter, and Cousin Eustace standing beside her. Suddenly the window swings open and George comes marching out. He goes directly to the vault and starts rummaging, but doesn't find the documents. Then he goes to the coin tray on the stand, and sifts through it. Carter is still lingering in the doorframe to his chamber. Cousin Eustace dashes over to George. Uncle Billy and George are backtracking the latter's path through the meadow, scouring everywhere for the lost documents. They halt briefly on the pathway."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Barker is now beneath his hammock. He flings the magazine up above him, grumbling as he does so. He discovers the postcard, peeks inside at the stamps. Then, to his accomplice, gesturing toward the garden gate. Barker cracks the gate just a smidge, and gazes through into the bakery. He starts patting his shoes, with mounting alarm, and inspects the recycling bin on the bench. Aunt Margie glances around for the postcard. She looks bewildered, ponders deeply, then a look of worry creeps into her expression. She eventually darts through the gate and out into the meadow. The accomplice drags her back to her hammock. She is lost in contemplation, with a sly look on her face. Aunt Margie sprinting across the meadow in the direction of the Library and Bistro. Sam emerging from a nook where he has just left the librarian. He notices Betty June standing there. He detects a rustle, and sees Aunt Margie entering the garden. Aunt Margie comes bustling in. Aunt Margie grabs the megaphone and speaks absentmindedly, without realizing what she is saying. She hangs up nervously, grumbling to herself as she moves into her own garden. Cousin Lila and Cousin Archie observe her, bewildered. Sam has just finished sketching something, and is slipping the sketch into a pouch. He glances at her, then says an odd comment. She reaches up and taps him on the shoulder, leaving fingerprints. Sam pulls open the gate for her. As Sam and Betty June pass through the gate, they are being observed by Cousin Lila, Cousin Archie, and the librarian, who is still lingering to start on the garments. Betty June notices the fingerprints on Sam's shoulder, and brushes at it with her scarf. She departs. As Sam pulls open the gate, he sees Aunt Margie desperately searching for the absent postcard. The garden is in disarray, bins are opened, and tools scattered on the ground and by the hammock. Sam halts abruptly, suddenly conscious of the sorrowful old expression gazing up at him. Aunt Margie signals anxiously for Sam to enter. He does so and shuts the gate. Cousin Lila is at her typewriter, and Cousin Archie standing beside her. Suddenly the gate bursts open and Sam comes marching out. He goes directly to the vault and starts rifling, but doesn't find the stamps. Then he moves to the sugar jar in the pantry, and rifles through it. Dylan is still lingering in the archway to his nook. Cousin Archie dashes over to Sam. Aunt Margie and Sam are retracing her steps through the park, scanning everywhere for the absent stamps. They halt for a moment on the path."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Potter sits at his desk, examining the newspaper, and notices an envelope with money. He peers into the bank and starts searching frantically for the lost envelope. Uncle Billy, confused and concerned, rushes out to find it. Meanwhile, George sees Uncle Billy and, after dealing with Violet and a bank examiner, notices Billy's distress. George learns about the missing money and sees the chaotic office with papers scattered. Uncle Billy gestures for George to help, and after realizing the situation, George checks the safe and cash drawer, finding nothing. As Carter waits, Uncle Billy and George retrace their steps through the snow, desperately searching for the lost money."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They pause for a moment on the sidewalk Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money Cousin Eustace runs over to George Carter is still waiting in the doorway to his office Then he goes to the cash drawer in the counter and looks through it He goes directly to the safe and starts searching but does not find the money Suddenly the door opens and George comes striding out Cousin Tilly is at her switchboard and Cousin Eustace standing beside her He does so and closes the door Uncle Billy gestures nervously for George to come in George stops short suddenly aware of the tragic old eyes looking up at him The office is in a mess drawers are opened and papers scattered on the floor and on the desk As George opens the door he sees Uncle Billy frantically looking for the missing envelope She exits Violet sees the lipstick on George's cheek and dabs at it with her handkerchief Cousin Eustace and the bank examiner who is still waiting to go to work on the books As George and Violet come through the door they are being watched by Cousin Tilly George opens the door for her She reaches up and kisses him on the cheek leaving lipstick She looks at him then says a strange thing George has just finished writing something and is slipping the paper into an envelope Cousin Tilly and Cousin Eustace look after him dumbfounded He hangs up agitatedly muttering to himself as he goes into his own office Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying Uncle Billy comes hurrying in He hears a noise and sees Uncle Billy entering the office He sees Violet Bick standing there George coming from room where he has just left the bank examiner Uncle Billy running across the street in the direction of the Building and Loan He is deep in thought with a crafty expression on his face The goon wheels him back to his desk He finally rushes through the door and out into the street then a look of concern creeps into his eyes He looks puzzled thinks hard Uncle Billy looks around for the money envelope He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor Potter opens the door just a little and peers through into the bank Then to his goon indicating the office door He sees the envelope looks inside at the money He spreads the newspaper out in front of him muttering as he does so Potter is now behind his desk"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He finally rushes through the door and out into the street Then to his goon indicating the office door The goon wheels him back to his desk Then he goes to the cash drawer in the counter and looks through it Cousin Eustace and the bank examiner who is still waiting to go to work on the books As George and Violet come through the door they are being watched by Cousin Tilly George stops short suddenly aware of the tragic old eyes looking up at him He is deep in thought with a crafty expression on his face Potter opens the door just a little and peers through into the bank He does so and closes the door She looks at him then says a strange thing As George opens the door he sees Uncle Billy frantically looking for the missing envelope George opens the door for her He hangs up agitatedly muttering to himself as he goes into his own office Uncle Billy running across the street in the direction of the Building and Loan Suddenly the door opens and George comes striding out He goes directly to the safe and starts searching but does not find the money Violet sees the lipstick on George's cheek and dabs at it with her handkerchief George coming from room where he has just left the bank examiner She reaches up and kisses him on the cheek leaving lipstick George has just finished writing something and is slipping the paper into an envelope Uncle Billy gestures nervously for George to come in Carter is still waiting in the doorway to his office The office is in a mess drawers are opened and papers scattered on the floor and on the desk Cousin Tilly and Cousin Eustace look after him dumbfounded Uncle Billy comes hurrying in Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money Cousin Tilly is at her switchboard and Cousin Eustace standing beside her He sees the envelope looks inside at the money Potter is now behind his desk Cousin Eustace runs over to George She exits He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor Uncle Billy looks around for the money envelope then a look of concern creeps into his eyes He sees Violet Bick standing there He hears a noise and sees Uncle Billy entering the office Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying He spreads the newspaper out in front of him muttering as he does so He looks puzzled thinks hard They pause for a moment on the sidewalk"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She looks at him then says a strange thing She reaches up and kisses him on the cheek leaving lipstick George opens the door for her As George and Violet come through the door they are being watched by Cousin Tilly Cousin Eustace and the bank examiner who is still waiting to go to work on the books Violet sees the lipstick on George's cheek and dabs at it with her handkerchief She exits As George opens the door he sees Uncle Billy frantically looking for the missing envelope The office is in a mess drawers are opened and papers scattered on the floor and on the desk George stops short suddenly aware of the tragic old eyes looking up at him Uncle Billy gestures nervously for George to come in He does so and closes the door Cousin Tilly is at her switchboard and Cousin Eustace standing beside her Suddenly the door opens and George comes striding out He goes directly to the safe and starts searching but does not find the money Then he goes to the cash drawer in the counter and looks through it Carter is still waiting in the doorway to his office Cousin Eustace runs over to George Uncle Billy and George are retracing the former's steps through the snow looking everywhere for the missing money They pause for a moment on the sidewalk Potter is now behind his desk He spreads the newspaper out in front of him muttering as he does so He sees the envelope looks inside at the money Then to his goon indicating the office door Potter opens the door just a little and peers through into the bank He starts thumping his pockets with increasing panic and looks in the waste paper basket on the floor Uncle Billy looks around for the money envelope He looks puzzled thinks hard then a look of concern creeps into his eyes He finally rushes through the door and out into the street The goon wheels him back to his desk He is deep in thought with a crafty expression on his face Uncle Billy running across the street in the direction of the Building and Loan George coming from room where he has just left the bank examiner He sees Violet Bick standing there He hears a noise and sees Uncle Billy entering the office Uncle Billy comes hurrying in Uncle Billy picks up the phone and speaks distractedly without knowing what he is saying He hangs up agitatedly muttering to himself as he goes into his own office Cousin Tilly and Cousin Eustace look after him dumbfounded George has just finished writing something and is slipping the paper into an envelope"
        }
      ]
    }
  ]
}