{
  "ground_truth": "Jackie breaks into tears, and they share a helpless half-laugh before Frank appears in the doorway. She starts to hand him a large mirror from her purse but thinks better of it. However, he holds out his hand, and she gives him the mirror. Simon holds the mirror poised for a moment of discovery, takes a breath as if about to dive underwater, and starts to look, giving himself a small, mumbled pep talk. He quickly brings his hand up and looks at the mirror. An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee. Melvin cranes periodically to keep an eye on his dog. When she reaches for the plate of uneaten bacon, he goes nuts, and she is jolted by the insensitivity of his interruption, but he doesn't notice and becomes almost chatty. Melvin nods, slightly frustrated about not being able to finish his dog story, and he pockets the remaining bacon. As Melvin walks Verdell back home, we notice, a beat before Melvin, something remarkable: Verdell is avoiding the cracks in the sidewalk. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks. Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level. Later, Melvin is at his computer, reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard. He reads his writing aloud to the dog, and as he looks over, Verdell trots over, and without realizing it, Melvin smiles at him, surprising Frank. Verdell looks up at him, then Melvin walks to the door, turns the lock, and checks that they are locked. He feels anguished until he briefly breaks down while the dog looks on. Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair. A beat of silence follows as Melvin considers whether to comply with Simon, who pats his leg, trying unsuccessfully to get Verdell to approach him. Instead, the dog goes to the door and scratches at it. Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almost-crowded waiting room, more patients are visible as Melvin passes through, visibly drawn and upset. He stops, eyes on them, and they look stricken. He exits as Cheryl, a heavy-set waitress, reluctantly moves to his table while he, unseen, takes out his utensils and arranges them.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jackie bursts into sobs, and they exchange a powerless half-chuckle before Frank emerges in the entrance. She begins to give him a big looking glass from her handbag but reconsiders. Nevertheless, he extends his palm, and she hands him the looking glass. Simon grasps the looking glass ready for a moment of revelation, inhales as though about to plunge underwater, and begins to peer, offering himself a tiny, murmured pep talk. He swiftly raises his palm and gazes at the looking glass. A wide shot showcases Verdell secured in front as Carol appears utterly exhausted while setting down a mug of coffee. Melvin leans periodically to maintain a watch on his canine. When she reaches for the plate of untouched bacon, he goes berserk, and she is startled by the callousness of his disruption, but he doesn't perceive and becomes nearly talkative. Melvin nods, slightly exasperated about not being able to conclude his canine tale, and he stows the remaining bacon. As Melvin escorts Verdell back home, we observe, a pause before Melvin, something extraordinary: Verdell is sidestepping the fissures in the pavement. Melvin decelerates and witnesses the canine reflecting his actions by meticulously placing his feet to dodge fissures. Melvin chuckles aloud and hastily dons synthetic gloves to raise the canine to eye level. Later, Melvin is at his workstation, perusing to himself with immense gratification as Verdell sits captivated by the pace of his master's digits on the keyboard. He recites his composition aloud to the canine, and as he glances over, Verdell trots over, and unwittingly, Melvin grins at him, startling Frank. Verdell gazes up at him, then Melvin strolls to the entrance, turns the latch, and verifies that they are secured. He feels tormented until he momentarily breaks down while the canine observes. Melvin opens the entrance and shudders when he observes the scarred Simon in a wheelchair. A pause of silence ensues as Melvin ponders whether to conform with Simon, who taps his limb, attempting unsuccessfully to coax Verdell to come to him. Instead, the canine heads to the entrance and scratches at it. Jackie begins to lift the canine as Melvin barges in on the psychiatrist and utters one word. Melvin shakes his cranium and discerns every fresh detail meticulously before settling in. In the nearly-crowded waiting area, more clients are discernible as Melvin traverses through, visibly drained and distressed. He halts, gaze on them, and they appear shaken. He departs as Cheryl, a stocky waitress, unwillingly proceeds to his table while he, unseen, retrieves his cutlery and organizes them."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jackie is brought to tears, and a helpless half-laugh is shared by them before Frank appears in the doorway. A large mirror is started to be handed to him by her from her purse, but she thinks better of it. However, his hand is held out by him, and the mirror is given to him by her. The mirror is held by Simon poised for a moment of discovery; he takes a breath as if about to dive underwater and begins to look, providing himself a small, mumbled pep talk. His hand is quickly brought up, and the mirror is looked at by him. Verdell is featured tied up in front in an establishing shot as Carol, looking totally beat, sets down a cup of coffee. Melvin cranes periodically to keep an eye on his dog. When the plate of uneaten bacon is reached for by her, he goes nuts, and she is jolted by the insensitivity of his interruption, but he doesn't notice and becomes almost chatty. Melvin, slightly frustrated about not being able to finish his dog story, nods and pockets the remaining bacon. As Verdell is walked back home by Melvin, something remarkable is noticed by us a beat before Melvin: the cracks in the sidewalk are being avoided by Verdell. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks. Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level. Later, at the computer, Melvin reads to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard. His writing is read aloud to the dog by him, and, as he looks over, Verdell trots over, and without realizing it, Melvin smiles at him, surprising Frank. Verdell looks up at him, then the door is walked to by Melvin, the lock is turned, and it is checked that they are locked. Anguish is felt by him until a brief breakdown occurs while the dog looks on. The door is opened by Melvin, and he shudders when Simon, scarred and in a wheelchair, is seen by him. A beat of silence follows as Simon is considered by Melvin, who pats his leg, trying unsuccessfully to get Verdell to approach him. Instead, the dog goes to the door and scratches at it. The dog is started to be picked up by Jackie as the psychiatrist is burst in on by Melvin, and one word is emitted by him. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almost-crowded waiting room, more patients are visible as they are passed through by Melvin, visibly drawn and upset. He stops, eyes on them, and they look stricken. He exits as Cheryl, a heavy-set waitress, reluctantly moves to his table while his utensils, unseen, are taken out and arranged by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jackie breaks into tears, sharing a helpless half-laugh when Frank appears. She starts to hand him a large mirror from her purse but hesitates. He reaches out, and she gives him the mirror. Simon holds it for a moment, takes a breath, and looks in, giving himself a small pep talk. He quickly glances at the mirror. An establishing shot shows Verdell tied up in front, with Carol looking exhausted as she sets down a cup of coffee. Melvin keeps an eye on his dog, and when Carol reaches for uneaten bacon, he reacts insensitively, startling her. Oblivious, he becomes chatty, nodding, slightly frustrated about his unfinished dog story, then pockets the bacon. As Melvin walks Verdell home, we notice, just before Melvin, something remarkable: Verdell avoids cracks in the sidewalk. Melvin observes the dog mirroring his behavior, laughs, and hurriedly lifts the dog to eye level. Later, Melvin reads at his computer as Verdell watches, fascinated by his speed. He reads aloud to the dog, smiles at him, surprising Frank. Verdell looks up as Melvin locks the door, feeling anguished until he briefly breaks down. He shudders at seeing scarred Simon in a wheelchair and considers complying with Simon, who pats his leg, unsuccessfully trying to get Verdell’s attention. Instead, Verdell scratches at the door. Jackie picks up the dog as Melvin bursts in on the psychiatrist, emitting one word. Melvin shakes his head, noticing every detail before settling in the crowded waiting room, visibly drawn and upset. He stops, eyes on the stricken onlookers, then exits as Cheryl, a heavy-set waitress, reluctantly approaches his table."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jackie cries and shares a half-laugh with Frank at the door. She hesitates, then hands him a mirror. Simon, poised for discovery, breathes deeply and checks the mirror, giving himself a pep talk. Verdell is tied up as a tired Carol sets down coffee. Melvin watches his dog, reacts to Carol reaching for bacon, and becomes talkative. Frustrated, Melvin pockets the bacon. As Melvin walks Verdell home, he sees the dog avoiding sidewalk cracks and laughs, lifting Verdell with gloves. Later, Melvin reads at his computer, Verdell fascinated by his typing. Melvin smiles unknowingly at the dog, surprising Frank. Checking locks, Melvin feels anguished, then meets scarred Simon in a wheelchair. A silent moment follows as Verdell avoids Simon and scratches at the door. Jackie lifts Verdell as Melvin confronts the psychiatrist. In a busy waiting room, Melvin looks upset at the patients before exiting. Cheryl, a waitress, reluctantly approaches his table as he organizes utensils."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jackie breaks down into tears, and a mix of helplessness and amusement causes them to share a half-hearted laugh before Frank unexpectedly appears in the doorway. She initially considers handing him a large mirror from her purse, but then hesitates and reconsiders. Nevertheless, Frank extends his hand expectantly, and eventually, she decides to give him the mirror. With a mixture of anticipation and curiosity, Simon holds the mirror, ready for a moment of potential discovery. He takes a deep breath, as if he is preparing to dive into deep, unknown waters, and begins to look at his reflection while quietly giving himself a small, mumbled pep talk. He quickly raises his hand to look directly into the mirror.\n\nAn establishing shot showcases Verdell tied up in the front, creating an atmosphere of impatience, while Carol appears utterly exhausted, setting down a much-needed cup of coffee. Melvin remains vigilant, frequently craning his neck to keep a close eye on his beloved dog. When Carol reaches for a plate of uneaten bacon, Melvin reacts with unexpected intensity, and his sudden outburst surprises her with the insensitivity of the interruption. Oblivious to the effect of his behavior, he becomes almost chatty. Melvin nods his head, displaying slight frustration over not being able to finish sharing his cherished dog story, and he discreetly pockets the remaining bacon. As Melvin escorts Verdell back home, we notice something truly remarkable, just a moment before Melvin does: Verdell is meticulously avoiding the cracks in the sidewalk. Slowing his pace, Melvin observes the dog mimicking his behavior, carefully placing his paws to avoid each crack. This amusing imitation makes Melvin burst into laughter, and he hurriedly puts on plastic gloves to lift the dog up to eye level.\n\nLater on, Melvin is sitting at his computer, reading to himself with a deep sense of satisfaction as Verdell watches intently, fascinated by the rapid movement of his master’s fingers on the keyboard. Melvin reads his writing aloud to the attentive dog, and as he glances over, Verdell trots over with eagerness, prompting an unintentional smile from Melvin, which catches Frank by surprise. Verdell gazes up at him, and then Melvin walks over to the door, turning the lock and checking to ensure that it is secure. He feels a pang of anguish and briefly breaks down while the dog looks on with concern. When Melvin opens the door, he shudders at the sight of the scarred Simon sitting in a wheelchair. A moment of silence follows as Melvin ponders whether to comply with Simon's unspoken request. Simon pats his leg in an attempt to attract Verdell's attention, but the effort is unsuccessful, and instead, the dog heads to the door and begins to scratch at it. Jackie starts to pick up the dog just as Melvin bursts in on the psychiatrist, expressing himself with a single word. Melvin shakes his head, taking note of every new element in the room before finally settling into some degree of comfort.\n\nIn the nearly crowded waiting room, more patients come into view as Melvin makes his way through, visibly drawn and emotionally unsettled. He pauses, his eyes fixed on them, while they return his gaze with stricken expressions. He exits the room, and Cheryl, a heavy-set waitress, approaches his table with some reluctance as he, unnoticed by her, removes his utensils and meticulously arranges them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jackie, feeling incredibly overwhelmed by a surge of emotions, begins to break down into tears. In this moment of vulnerability, a strange blend of helplessness and amusement takes over, leading them to share a laugh that seems more half-hearted than genuine. Then, quite unexpectedly, Frank makes an appearance in the doorway, startling them. Initially, Jackie contemplates the idea of handing Frank a large mirror that she has tucked away in her purse, but just before doing so, she hesitates, second-guessing her decision. Despite her moment of uncertainty, Frank extends his hand in an expectant manner, leaving Jackie little choice. Eventually, she makes up her mind to give him the mirror. Simon, watching this exchange with a mix of anticipation and curiosity, takes hold of the mirror, poised for what might be a moment of discovery. Preparing himself mentally, he takes a deep breath, as if readying himself for a plunge into deep, uncharted waters. With a quiet resolve, he begins to look at his reflection, softly mumbling a small pep talk to himself. In a swift motion, he raises his hand to gaze directly into the mirror.\n\nIn a subsequent scene, an establishing shot captures Verdell tied up in the front, setting an atmosphere heavy with impatience. Meanwhile, Carol appears utterly exhausted, finding a moment of solace as she sets down a much-needed cup of steaming coffee. Melvin stands vigilant nearby, frequently craning his neck to keep a close and attentive eye on his beloved dog. As Carol reaches out for a plate of uneaten bacon, Melvin reacts with an unexpected intensity; his sudden outburst startles her, leaving her taken aback by the insensitivity of his interruption. Blissfully unaware of the impact of his behavior, Melvin becomes almost chatty, nodding his head slightly, displaying frustration over his unfulfilled desire to finish sharing his cherished story about the dog. Discreetly, he pockets the remaining pieces of bacon. As Melvin escorts Verdell back home, there is a moment that catches the viewer's attention even before Melvin himself notices: Verdell is meticulously avoiding the cracks in the sidewalk. Melvin slows his pace, observing as the dog imitates his behavior with precision, carefully placing each paw to avoid the cracks. This amusing mimicry causes Melvin to burst into a fit of laughter, and with hurried motions, he puts on plastic gloves to lift the dog up to eye level.\n\nLater on, Melvin finds himself seated at his computer, engaging in the act of reading to himself with a profound sense of satisfaction as Verdell looks on intently, his eyes following the rapid movement of Melvin's fingers on the keyboard. As Melvin reads his writing aloud, Verdell, clearly interested, trots over with eagerness, prompting an unintentional and rare smile from Melvin, a sight that catches Frank off guard. Verdell gazes up at Melvin, and soon after, Melvin walks over to the door, taking a moment to turn the lock and making sure it is securely fastened. He is suddenly hit by a pang of anguish, briefly breaking down while Verdell watches with a sense of concern. When Melvin finally opens the door, he shudders involuntarily at the unexpected sight of the scarred Simon sitting in a wheelchair. A moment of silence unfolds as Melvin contemplates whether to comply with Simon's unspoken request. Simon, trying to garner Verdell's attention, pats his leg in a gentle manner, but the effort proves to be unsuccessful. Instead, the dog makes a beeline for the door and begins to scratch at it. Jackie begins to reach for the dog just as Melvin unexpectedly bursts in on the psychiatrist, expressing himself with a single, emphatic word. Melvin shakes his head, taking careful note of every new element in the room before finally beginning to settle into a sense of comfort.\n\nIn the now crowded waiting room, more patients gradually come into view as Melvin navigates his way through, appearing visibly drawn and emotionally unsettled. He pauses at a point, his eyes fixed on the individuals around him, who return his gaze with equally stricken expressions. As he exits the room, Cheryl, a heavy-set waitress, approaches his table, carrying a sense of reluctance. Meanwhile, Melvin, unnoticed by her, busies himself by removing his utensils from the table, meticulously arranging them to his liking."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jackie’s emotions overwhelm her as she breaks into tears, her distress momentarily mingling with a half-hearted laugh shared with someone beside her. In this fraught moment, Frank unexpectedly appears in the doorway, prompting Jackie to rummage through her purse. She retrieves a large mirror, initially hesitating to hand it over. But when Frank extends his hand, her hesitation fades, and she relinquishes the mirror to him. Simon carefully holds the mirror, preparing himself for a moment of revelation. He pauses, inhaling deeply as though he were about to plunge into deep water, and begins to peer into the mirror while quietly giving himself a motivating pep talk. With a swift motion, he raises his hand and gazes intently at the reflection. The scene shifts as an establishing shot captures Verdell, who is tied up in front, while Carol, looking thoroughly exhausted, sets down a cup of coffee. Meanwhile, Melvin intermittently cranes his neck to keep watch over his dog. When Carol reaches for the plate with uneaten bacon, Melvin reacts with frantic agitation, startling Carol with the insensitivity of his abrupt outburst. Oblivious to her shock, he continues speaking in a suddenly animated manner. Melvin, slightly frustrated by his inability to finish recounting his dog story, gives a resigned nod and discreetly slips the remaining bacon into his pocket. As Melvin walks Verdell back to their home, he gradually notices an intriguing behavior in Verdell that mirrors his own: the dog is precisely avoiding the cracks in the sidewalk. Curious, Melvin slows his pace, attentively observing Verdell's deliberate placement of his paws. Amused and delighted, Melvin laughs aloud, quickly donning plastic gloves to lift Verdell to eye level, sharing a moment of joy. The scene transitions to Melvin seated at his computer, indulging in the satisfaction of reading his work aloud to himself as Verdell gazes in fascination at the rapid movements of his master's fingers typing on the keyboard. Melvin articulates his writing, and without consciously realizing it, he smiles at Verdell as the dog trots over, surprising Frank with this unexpected warmth. Verdell's gaze meets Melvin's, prompting Melvin to rise, walk to the door, and twist the lock, ensuring it is secure. A feeling of anguish grips him until he momentarily succumbs to it, briefly breaking down while Verdell watches sympathetically. Melvin opens the door and recoils slightly upon seeing Simon, who bears visible scars, seated in a wheelchair. A tense silence ensues as Melvin weighs his decision to fulfill Simon’s silent plea, signaled by a pat on his own leg, coaxing Verdell to approach. However, Verdell instead trots to the door and scratches at it with determination. As Jackie moves to pick the dog up, Melvin intrudes abruptly on the psychiatrist, uttering just a single word. He shakes his head, absorbing every new detail of the surroundings before settling into a state of relative comfort. In the almost-crowded waiting room, more patients become visible as Melvin passes, his demeanor visibly strained and upset. He halts momentarily, his gaze fixed upon them, noticing their stricken expressions. Exiting the room, Cheryl, a heavy-set waitress, reluctantly approaches his table, unaware as Melvin discreetly takes out his utensils, meticulously arranging them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jackie breaks into tears, and they share a helpless half-laugh until Frank appears. She initially hesitates but then hands him a large mirror. Simon, preparing for a moment of discovery, gives himself a pep talk before quickly looking at the mirror. Meanwhile, Verdell sits tied up as Carol, looking exhausted, sets down a cup of coffee. Melvin, preoccupied with his dog, reacts strongly when Carol reaches for the bacon, interrupting her. Oblivious, he becomes chatty, pockets the bacon, and walks Verdell home. They both notice Verdell carefully avoiding cracks on the sidewalk, mirroring Melvin's behavior, which makes Melvin laugh. He hurriedly dons gloves to lift the dog to eye level. Later, Melvin reads at his computer with satisfaction as Verdell watches, captivated by the speed of his fingers. Melvin reads aloud, smiles at Verdell, and surprises Frank. After checking the locks, Melvin feels anguished, briefly breaking down while Verdell observes. Opening the door, Melvin is startled by scarred Simon in a wheelchair. After a moment's hesitation, Simon unsuccessfully tries to call Verdell, who instead scratches at the door. Jackie starts to pick up the dog as Melvin interrupts the psychiatrist, shaking his head while absorbing every detail. In a crowded waiting room, Melvin, visibly upset, passes other patients who look stricken. He exits as Cheryl, a reluctant waitress, approaches his table, where he discreetly arranges his utensils."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jackie, overwhelmed by the emotional strain of the moment, breaks into tears, and they share a helpless half-laugh before Frank, known for his calming presence in the group, appears in the doorway. She starts to hand him a large mirror from her purse, an item often associated with self-reflection or revelation, but thinks better of it. However, he holds out his hand with a gentle insistence, and she gives him the mirror. Simon, who has been grappling with a recent personal crisis, holds the mirror poised for a moment of discovery, takes a breath as if about to dive underwater to find clarity beneath the surface, and starts to look, giving himself a small, mumbled pep talk. He quickly brings his hand up and looks at the mirror. An establishing shot features Verdell, the remarkably perceptive dog, tied up in front as Carol looks totally beat while setting down a cup of coffee, her go-to remedy for exhaustion. Melvin cranes periodically to keep an eye on his dog, who has become a vital source of companionship for him. When she reaches for the plate of uneaten bacon, he goes nuts, fiercely protective of the small pleasures he finds in routine meals, and she is jolted by the insensitivity of his interruption, but he doesn't notice and becomes almost chatty, a defense mechanism to mask his anxiety. Melvin nods, slightly frustrated about not being able to finish his dog story, a tale he often shares to connect with others, and he pockets the remaining bacon. As Melvin walks Verdell back home, an activity they both find grounding, we notice, a beat before Melvin, something remarkable: Verdell is avoiding the cracks in the sidewalk, mimicking Melvin's own superstitious habit. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks. Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level, a gesture of unspoken affection. Later, Melvin is at his computer, reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard, reminiscent of a pianist's dexterity. He reads his writing aloud to the dog, and as he looks over, Verdell trots over, and without realizing it, Melvin smiles at him, surprising Frank, who rarely sees Melvin express such genuine emotion. Verdell looks up at him, then Melvin walks to the door, turns the lock, and checks that they are locked, a routine compelled by his tendency towards compulsive behavior. He feels anguished until he briefly breaks down while the dog looks on, steadfast in its silent support. Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair, a stark reminder of the struggles faced by his neighbor. A beat of silence follows as Melvin considers whether to comply with Simon, who pats his leg, trying unsuccessfully to get Verdell to approach him. Instead, the dog goes to the door and scratches at it, signaling a desire to return to the safety of home. Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist, known for his unconventional therapeutic methods, and emits one word that encapsulates a myriad of unspoken feelings. Melvin shakes his head and notices every new element carefully before getting comfortable, taking in the atmosphere of the room. In the almost-crowded waiting room, more patients are visible as Melvin passes through, visibly drawn and upset, indicating his discomfort in crowded spaces. He stops, eyes on them, and they look stricken, perhaps recognizing a shared difficulty. He exits as Cheryl, a heavy-set waitress with a reputation for her brusque demeanor, reluctantly moves to his table while he, unseen, takes out his utensils and arranges them, a ritual that brings him a sense of order."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word She starts to hand him a large mirror from her purse but thinks better of it Instead the dog goes to the door and scratches at it However he holds out his hand and she gives him the mirror Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk He quickly brings his hand up and looks at the mirror Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee Melvin cranes periodically to keep an eye on his dog When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty He quickly brings his hand up and looks at the mirror Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon He feels anguished until he briefly breaks down while the dog looks on As Melvin walks Verdell back home we notice a beat before Melvin something remarkable Verdell is avoiding the cracks in the sidewalk Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty Verdell looks up at him then Melvin walks to the door turns the lock and checks that they are locked He feels anguished until he briefly breaks down while the dog looks on Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair He stops eyes on them and they look stricken However he holds out his hand and she gives him the mirror A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him Instead the dog goes to the door and scratches at it Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word Melvin shakes his head and notices every new element carefully before getting comfortable In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset He stops eyes on them and they look stricken He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway. She starts to hand him a large mirror from her purse but thinks better of it. However he holds out his hand and she gives him the mirror. Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk. He quickly brings his hand up and looks at the mirror. An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee. Melvin cranes periodically to keep an eye on his dog. When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty. Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon. As Melvin walks Verdell back home we notice a beat before Melvin something remarkable. Verdell is avoiding the cracks in the sidewalk. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks. Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard. He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank. Verdell looks up at him. then Melvin walks to the door turns the lock and checks that they are locked. He feels anguished until he briefly breaks down while the dog looks on. Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair. A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him. Instead the dog goes to the door and scratches at it. Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset. He stops eyes on them and they look stricken. He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway. She starts to hand him a large mirror from her purse but thinks better of it. However he holds out his hand and she gives him the mirror. Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk. He quickly brings his hand up and looks at the mirror. An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee. Melvin cranes periodically to keep an eye on his dog. When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty. Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon. As Melvin walks Verdell back home we notice a beat before Melvin something remarkable. Verdell is avoiding the cracks in the sidewalk. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks. Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard. He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank. Verdell looks up at him. then Melvin walks to the door turns the lock and checks that they are locked. He feels anguished until he briefly breaks down while the dog looks on. Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair. A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him. Instead the dog goes to the door and scratches at it. Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset. He stops eyes on them and they look stricken. He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway. She starts to hand him a large mirror from her purse but thinks better of it. However he holds out his hand and she gives him the mirror. Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk. He quickly brings his hand up and looks at the mirror. An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee. Melvin cranes periodically to keep an eye on his dog. Instead the dog goes to the door and scratches at it. Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset. He stops eyes on them and they look stricken. He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway. She starts to hand him a large mirror from her purse but thinks better of it. However he holds out his hand and she gives him the mirror. In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset. He stops eyes on them and they look stricken. He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel breaks into tears, and they share a helpless half-laugh before the alpaca appears in the doorway. The squirrel starts to hand the alpaca a large mirror from her purse but thinks better of it. However, the alpaca holds out its hand, and the squirrel gives the alpaca the mirror. The penguin holds the mirror poised for a moment of discovery, takes a breath as if about to dive underwater, and starts to look, giving itself a small, mumbled pep talk. The penguin quickly brings its hand up and looks at the mirror. An establishing shot features the kangaroo tied up in front as the giraffe looks totally beat while setting down a cup of coffee. The rabbit cranes periodically to keep an eye on its dog. When the giraffe reaches for the plate of uneaten bacon, the rabbit goes nuts, and the giraffe is jolted by the insensitivity of the rabbit's interruption, but the rabbit doesn't notice and becomes almost chatty. The rabbit nods, slightly frustrated about not being able to finish its dog story, and pockets the remaining bacon. As the rabbit walks the kangaroo back home, we notice, a beat before the rabbit, something remarkable: the kangaroo is avoiding the cracks in the sidewalk. The rabbit slows down and observes the kangaroo mirroring its behavior by carefully placing its paws to avoid cracks. The rabbit laughs out loud and hurriedly puts on plastic gloves to lift the kangaroo to eye level. Later, the rabbit is at its computer, reading to itself with great satisfaction as the kangaroo sits fascinated by the speed of its master's fingers on the keyboard. The rabbit reads its writing aloud to the kangaroo, and as it looks over, the kangaroo trots over, and without realizing it, the rabbit smiles at the kangaroo, surprising the alpaca. The kangaroo looks up at the rabbit, then the rabbit walks to the door, turns the lock, and checks that they are locked. The rabbit feels anguished until it briefly breaks down while the kangaroo looks on. The rabbit opens the door and shudders when it sees the scarred penguin in a wheelchair. A beat of silence follows as the rabbit considers whether to comply with the penguin, who pats its leg, trying unsuccessfully to get the kangaroo to approach it. Instead, the kangaroo goes to the door and scratches at it. The squirrel starts to pick the kangaroo up as the rabbit bursts in on the octopus and emits one word. The rabbit shakes its head and notices every new element carefully before getting comfortable. In the almost-crowded waiting room, more patients are visible as the rabbit passes through, visibly drawn and upset. The rabbit stops, eyes on them, and they look stricken. The rabbit exits as the hippo, a heavy-set waitress, reluctantly moves to its table while the rabbit, unseen, takes out its utensils and arranges them."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jackie breaks into tears, and they share a helpless half-laugh before Frank appears in the doorway. She starts to hand him a large painting from her backpack but thinks better of it. However, he holds out his hand, and she gives him the painting. Simon holds the painting poised for a moment of discovery, takes a breath as if about to dive into a pool, and starts to look, giving himself a small, mumbled pep talk. He quickly brings his hand up and looks at the painting. An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of hot chocolate. Melvin cranes periodically to keep an eye on his rabbit. When she reaches for the tray of uneaten breadsticks, he goes nuts, and she is jolted by the insensitivity of his interruption, but he doesn't notice and becomes almost chatty. Melvin nods, slightly frustrated about not being able to finish his rabbit story, and he pockets the remaining breadsticks. As Melvin walks Verdell back home, we notice, a beat before Melvin, something remarkable: Verdell is avoiding the puddles on the alley. Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid puddles. Melvin laughs out loud and hurriedly puts on wool gloves to lift the dog to eye level. Later, Melvin is at his piano, reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keys. He reads his lyrics aloud to the dog, and as he looks over, Verdell trots over, and without realizing it, Melvin smiles at him, surprising Frank. Verdell looks up at him, then Melvin walks to the door, turns the knob, and checks that they are locked. He feels anguished until he briefly breaks down while the dog looks on. Melvin opens the window and shudders when he sees the scarred Simon in a stroller. A beat of silence follows as Melvin considers whether to comply with Simon, who pats his backpack, trying unsuccessfully to get Verdell to approach him. Instead, the dog goes to the window and scratches at it. Jackie starts to pick the dog up as Melvin bursts in on the photographer and emits one word. Melvin shakes his head and notices every new element carefully before getting comfortable. In the almost-crowded lobby, more visitors are visible as Melvin passes through, visibly drawn and upset. He stops, eyes on them, and they look stricken. He exits as Cheryl, a heavy-set barista, reluctantly moves to his booth while he, unseen, takes out his napkins and arranges them."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jackie bursts into laughter, and they exchange a hopeful half-smile before Frank barges into the doorway. She attempts to pass him a small clock from her purse but reconsiders. However, he waves his hand, and she hands him the clock. Simon holds the clock suspended for a moment of confusion, exhales deeply as if about to climb a mountain, and starts to listen, giving himself a small, incoherent pep talk. He swiftly raises his hand and listens to the clock. An establishing shot features Verdell lying down in front as Carol appears totally refreshed while picking up a magazine. Melvin stretches periodically to keep an eye on his dog. When she reaches for the glass of untouched water, he calms down, and she is comforted by the gentleness of his interruption, but he doesn't notice and becomes almost reserved. Melvin shakes his head, slightly relieved about not being able to start his dog story, and he stores the remaining water. As Melvin skips Verdell back home, we notice, a beat before Melvin, something peculiar: Verdell is jumping over the shadows on the sidewalk. Melvin speeds up and notices the dog imitating his behavior by leaping to dodge shadows. Melvin cries softly and slowly puts on a hat to lower the dog to knee level. Later, Melvin is at his computer, humming to himself with great anticipation as Verdell sits mesmerized by the rhythm of his master's typing on the keyboard. He mumbles his writing to the dog, and as he looks over, Verdell strolls over, and without realizing it, Melvin frowns at him, shocking Frank. Verdell glances up at him, then Melvin rushes to the door, turns the handle, and verifies that they are closed. He feels relieved until he briefly chuckles while the dog looks on. Melvin opens the door and laughs when he sees the smiling Simon in a wheelchair. A beat of silence follows as Melvin decides whether to argue with Simon, who pats his chair, trying unsuccessfully to get Verdell to follow him. Instead, the dog approaches the door and taps at it. Jackie starts to stroke the dog as Melvin sneaks in on the psychiatrist and mumbles one phrase. Melvin nods and admires every new detail carefully before getting uneasy. In the almost-empty waiting room, fewer patients are visible as Melvin passes through, visibly relaxed and content. He pauses, eyes on them, and they grin. He enters as Cheryl, a slender waitress, enthusiastically rushes to his table while he, unseen, takes out his utensils and organizes them."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Rhonda bursts into giggles, and they share a confused half-smirk before Clyde materializes in the archway. She begins to hand him a small television from her backpack but reconsiders. However, he extends his foot, and she gives him the television. Tanya holds the television poised for a moment of revelation, inhales deeply as if about to leap off a cliff, and begins to gaze, giving herself a quiet, mumbled pep talk. She quickly raises her knee and looks at the television. An establishing shot features Marvin knotted up in front as Lisa looks thoroughly exhausted while placing down a kettle of tea. Gregory twists periodically to keep an eye on his cat. When she reaches for the bowl of uneaten pasta, he goes bananas, and she is startled by the indifference of his outburst, but he doesn't perceive and becomes almost chatty. Gregory nods, slightly annoyed about not being able to conclude his parrot story, and he pockets the leftover pasta. As Gregory walks Marvin back home, we observe, a beat before Gregory, something extraordinary: Marvin is avoiding the tiles in the hallway. Gregory slows down and observes the cat mimicking his behavior by delicately placing his paws to avoid tiles. Gregory chuckles aloud and hastily puts on paper mittens to lift the cat to nose level. Later, Gregory is at his piano, reading to himself with great joy as Marvin sits mesmerized by the swiftness of his owner's hands on the keys. He reads his composition aloud to the cat, and as he glances over, Marvin prances over, and without realizing it, Gregory grins at him, startling Clyde. Marvin glances up at him, then Gregory saunters to the window, turns the knob, and checks that they are fastened. He feels distraught until he briefly breaks down while the cat observes. Gregory opens the window and recoils when he sees the scarred Tanya in a hammock. A beat of silence ensues as Gregory contemplates whether to comply with Tanya, who taps her arm, trying unsuccessfully to get Marvin to approach her. Instead, the cat goes to the window and paws at it. Rhonda begins to lift the cat up as Gregory barges in on the magician and utters one word. Gregory shakes his elbow and notices every new detail carefully before getting comfortable. In the almost-crowded lobby, more customers are visible as Gregory passes through, visibly drawn and upset. He pauses, eyes on them, and they appear stricken. He departs as Dana, a slender waitress, reluctantly moves to his booth while he, unseen, takes out his chopsticks and arranges them."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Alice erupts into giggles, and they exchange a surprised half-cry before George vanishes down the hallway. She attempts to offer him a small umbrella from her backpack but hesitates. Nonetheless, he waves his hand, and she hands him the umbrella. Rachel holds the umbrella poised for a moment of enlightenment, exhales as if about to blow out candles, and begins to observe, giving herself a quiet, whispered self-motivation. She abruptly raises her hand and inspects the umbrella. A long shot presents Max sitting tied up in front as Dan looks utterly exhausted while lowering a book of poetry. Lucy bends occasionally to monitor her cat. When he reaches for the bowl of untouched grapes, she becomes ecstatic, and he is startled by the absurdity of her reaction, but she doesn't realize and grows somewhat chatty. Lucy shakes her head, slightly disheartened about not being able to conclude her cat tale, and she pockets the remaining grapes. As Lucy guides Max back home, we notice, a moment before Lucy, something extraordinary: Max is sidestepping the petals on the garden path. Lucy halts and watches the cat mimicking her actions by cautiously placing his paws to dodge petals. Lucy chuckles audibly and hastily slips on cotton mittens to lift the cat to face level. Later, Lucy is at her easel, sketching to herself with immense satisfaction as Max sits mesmerized by the swiftness of his companion's brush strokes. She narrates her drawing aloud to the cat, and as she glances over, Max scampers over, and inadvertently, Lucy grins at him, surprising George. Max peers up at her, then Lucy strolls to the window, twists the latch, and verifies that they are fastened. She feels relieved until she briefly breaks into a dance while the cat watches. Lucy opens the window and gasps when she sees the bandaged Rachel in a recliner. A pause of quiet follows as Lucy contemplates whether to humor Rachel, who taps her foot, attempting and failing to get Max to approach her. Instead, the cat trots to the window and nudges it. Alice begins to lift the cat as Lucy bursts in on the artist and whispers one word. Lucy nods her head and attentively examines every new detail before settling in. In the nearly-busy studio, more patrons are visible as Lucy passes through, visibly drawn and introspective. She halts, eyes on them, and they appear intrigued. She departs as Karen, a slender painter, reluctantly advances to her corner while she, unnoticed, extracts her brushes and organizes them."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jackie erupts into laughter, and they share a hopeful full-sob before Frank vanishes in the window. She begins to toss him a small puzzle from her backpack but reconsiders. Nevertheless, he waves his foot, and she tosses him the puzzle. Simon holds the puzzle ready for a moment of revelation, inhales deeply as if about to jump over a fence, and starts to twirl it, giving himself a small, cheerful pep talk. He instantly brings his foot up and glances at the puzzle. An establishing shot features Verdell playing in front as Carol looks completely energized while throwing down a bouquet of flowers. Melvin tilts periodically to keep an ear on his cat. When she reaches for the bowl of uneaten grapes, he applauds wildly, and she is startled by the joy of his encouragement, but he doesn't observe and becomes almost silent. Melvin shakes his head, slightly bewildered about not being able to finish his cat story, and he tosses the remaining grapes. As Melvin guides Verdell back home, we notice, a beat before Melvin, something astonishing: Verdell is jumping over the puddles in the garden. Melvin speeds up and examines the cat mimicking his manner by carefully leaping to skip puddles. Melvin cries silently and slowly puts on leather boots to lower the cat to nose level. Later, Melvin is at his piano, playing to himself with great delight as Verdell sits mesmerized by the rhythm of his master's hands on the keys. He hums his music aloud to the cat, and as he peers over, Verdell skips over, and without noticing it, Melvin frowns at him, startling Frank. Verdell gazes up at him, then Melvin strolls to the window, shuts the curtains, and checks that they are open. He feels joyful until he briefly laughs while the cat looks on. Melvin closes the window and grins when he sees the cheerful Simon in a hammock. A beat of noise follows as Melvin debates whether to challenge Simon, who taps his nose, trying unsuccessfully to get Verdell to hop to him. Instead, the cat moves to the window and meows at it. Jackie starts to grab the cat as Melvin sneaks in on the florist and whispers one word. Melvin nods his head and examines every familiar feature lazily before getting restless. In the almost-empty quiet room, fewer people are visible as Melvin floats through, visibly composed and elated. He hurries, ears towards them, and they look relieved. He enters as Cheryl, a slender dancer, eagerly shifts to his counter while he, unnoticed, stuffs his bags and tosses them."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Ruby bursts into laughter, and they exchange a hopeful full-sob before George vanishes from the hallway. He finishes speaking to her tiny violin from his backpack but decides against it. Nevertheless, she holds out her foot, and he takes the violin. Lucas grasps the violin prepared for a moment of surprise, exhales as if about to climb a mountain, and starts to listen, giving himself a loud, excited monologue. He rapidly lowers his foot and listens to the violin. A closing shot shows Elvis dancing around while Rachel feels absolutely ecstatic while lifting a slice of pie. Duncan stretches occasionally to avoid glancing at his cat. When she reaches for the bowl of untouched oranges, he goes silent, and she is calmed by the sensitivity of his silence, but she doesn't hear it and becomes almost quiet. Duncan shakes, slightly pleased about being able to finish his cat tale, and he tosses the pocketed oranges. As Duncan drives Elvis to the park, we discover, a pause before Duncan, something dull: Elvis is jumping over the puddles on the path. Duncan speeds up and ignores the cat imitating his actions by quickly placing his tail to jump puddles. Duncan cries silently and slowly takes off leather boots to push the cat to arm's length. Earlier, Duncan is in the garden, lying to the cat with little agitation as Elvis stands distracted by the slowness of his owner's feet on the grass. He whispers his lies softly to the cat, and as he turns away, Elvis skips away, and without understanding it, Duncan frowns at him, confusing George. Elvis gazes down at him, then Duncan climbs to the attic, unlocks the window, and checks that they are open. He feels overjoyed until he momentarily smiles while the cat naps. Duncan closes the window and laughs when he notices the spotless Lucas on a skateboard. A flood of noise follows as Duncan debates whether to dispute with Lucas, who waves his ear, trying successfully to get Elvis to avoid him. Instead, the cat runs to the window and bites at it. Ruby begins to drop the cat as Duncan storms out of the bakery and whispers two words. Duncan nods his head and forgets every familiar moment uncertainly before getting uncomfortable. In the completely empty library, fewer strangers are invisible as Duncan peers in, visibly content and joyous. He leaps, ears off them, and they appear delighted. He enters as Paula, a thin baker, eagerly stays at his seat while she, observed, puts away her notebooks and scatters them."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jackie tearfully hands Frank a large mirror, and Simon uses it for self-discovery, giving himself a pep talk. Meanwhile, Carol, looking exhausted, sets down coffee while Melvin keeps an eye on his dog, Verdell. When she reaches for uneaten bacon, Melvin interrupts insensitively, pocketing the bacon and talking more. Later, walking Verdell home, Melvin notices the dog avoiding sidewalk cracks, mirroring his behavior. Amused, he lifts the dog to eye level. At his computer, Melvin, satisfied with his writing, reads to Verdell, unknowingly smiling at him, surprising Frank. Verdell's loyalty is tested when Melvin faces scarred Simon in a wheelchair but the dog remains by the door. Melvin, visibly upset in a psychiatrist's waiting room, observes other stricken patients before exiting to his table, where Cheryl, a waitress, reluctantly approaches as he arranges his utensils unseen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them He stops eyes on them and they look stricken In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset Melvin shakes his head and notices every new element carefully before getting comfortable Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word Instead the dog goes to the door and scratches at it A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair He feels anguished until he briefly breaks down while the dog looks on then Melvin walks to the door turns the lock and checks that they are locked Verdell looks up at him He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks Verdell is avoiding the cracks in the sidewalk As Melvin walks Verdell back home we notice a beat before Melvin something remarkable Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty Melvin cranes periodically to keep an eye on his dog An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee He quickly brings his hand up and looks at the mirror Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk However he holds out his hand and she gives him the mirror She starts to hand him a large mirror from her purse but thinks better of it Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "then Melvin walks to the door turns the lock and checks that they are locked Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level As Melvin walks Verdell back home we notice a beat before Melvin something remarkable He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him Melvin cranes periodically to keep an eye on his dog An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee Verdell is avoiding the cracks in the sidewalk Verdell looks up at him Melvin shakes his head and notices every new element carefully before getting comfortable Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair She starts to hand him a large mirror from her purse but thinks better of it He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard However he holds out his hand and she gives him the mirror He feels anguished until he briefly breaks down while the dog looks on He stops eyes on them and they look stricken He quickly brings his hand up and looks at the mirror Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk Instead the dog goes to the door and scratches at it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later Melvin is at his computer reading to himself with great satisfaction as Verdell sits fascinated by the speed of his master's fingers on the keyboard He reads his writing aloud to the dog and as he looks over Verdell trots over and without realizing it Melvin smiles at him surprising Frank Verdell looks up at him then Melvin walks to the door turns the lock and checks that they are locked He feels anguished until he briefly breaks down while the dog looks on Melvin opens the door and shudders when he sees the scarred Simon in a wheelchair A beat of silence follows as Melvin considers whether to comply with Simon who pats his leg trying unsuccessfully to get Verdell to approach him Instead the dog goes to the door and scratches at it Jackie starts to pick the dog up as Melvin bursts in on the psychiatrist and emits one word Melvin shakes his head and notices every new element carefully before getting comfortable In the almostcrowded waiting room more patients are visible as Melvin passes through visibly drawn and upset He stops eyes on them and they look stricken He exits as Cheryl a heavyset waitress reluctantly moves to his table while he unseen takes out his utensils and arranges them Jackie breaks into tears and they share a helpless halflaugh before Frank appears in the doorway She starts to hand him a large mirror from her purse but thinks better of it However he holds out his hand and she gives him the mirror Simon holds the mirror poised for a moment of discovery takes a breath as if about to dive underwater and starts to look giving himself a small mumbled pep talk He quickly brings his hand up and looks at the mirror An establishing shot features Verdell tied up in front as Carol looks totally beat while setting down a cup of coffee Melvin cranes periodically to keep an eye on his dog When she reaches for the plate of uneaten bacon he goes nuts and she is jolted by the insensitivity of his interruption but he does not notice and becomes almost chatty Melvin nods slightly frustrated about not being able to finish his dog story and he pockets the remaining bacon As Melvin walks Verdell back home we notice a beat before Melvin something remarkable Verdell is avoiding the cracks in the sidewalk Melvin slows down and observes the dog mirroring his behavior by carefully placing his paws to avoid cracks Melvin laughs out loud and hurriedly puts on plastic gloves to lift the dog to eye level"
        }
      ]
    }
  ]
}