{
  "ground_truth": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair. As he speaks, a man leaves the porch, goes into his house, and slams the door. Mary then runs off the scene, but George, standing on the belt of her bathrobe, inadvertently causes it to come off as she runs. He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere. We see Mary's face peering out from the leaves as George walks toward the bush, about to throw her the robe when a thought strikes him. Meanwhile, Mary thrashes around in the bushes, and headlights flash into the scene as the old Bailey automobile, driven by Harry with Uncle Billy beside him, drives in. George throws Mary's robe over the bush and gets into the car, and as it drives off, Mary, now wearing the robe, rises from the bush, following the car with her eyes. Subsequently, around a long table, about twelve directors, substantial citizens of Bedford Falls such as Dr. Campbell, a lawyer, an insurance agent, and a real estate salesman, are seated, along with Uncle Billy and George. Dr. Campbell is the Chairman of the Board. Before each director are individual reports for them to study along with folders and papers on which they have been reporting. Henry F. Potter, with his goon beside his wheelchair, is prominently seated among them. Dr. Campbell rises from his seat, and George and Uncle Billy start to collect their papers and leave the table, surprising everyone. George stands at the door of the office, holding his coat and papers, ready to leave, but puts them down, incensed by what Potter is saying about his father, and comes back to the table. George then leaves the room, followed by the jubilant Uncle Billy. Potter's face is grim with hatred as he is interrupted by a babble of talk as the directors argue. George, visibly shaken, busies himself with his bag and papers while Uncle Billy follows him around, chattering and worried about the outcome of the meeting, which might alter his plans regarding dissolving the Building and Loan. Ernie stands in the doorway, and a jubilant Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile, a number of people wait for the train, and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The complete lunar is gleaming through the woods as George completes speaking and leaps up out of his seat. As he articulates, a gentleman departs the veranda, enters his residence, and bangs the gate. Mary then dashes off the setting, but George, standing on the sash of her dressing gown, unintentionally causes it to detach as she sprints. He lets fall his bundle of garments and collects Mary’s robe but cannot spot her anywhere. We observe Mary’s visage peeking out from the foliage as George strides toward the shrub, about to toss her the robe when an idea occurs to him. Meanwhile, Mary flails around in the shrubs, and headlights gleam into the setting as the antique Bailey vehicle, operated by Harry with Uncle Billy beside him, drives in. George tosses Mary’s robe over the shrub and gets into the automobile, and as it drives off, Mary, now donning the robe, ascends from the shrub, tracking the car with her gaze. Subsequently, around a lengthy table, about twelve directors, significant citizens of Bedford Falls such as Dr. Campbell, a barrister, an indemnity agent, and a realty vendor, are seated, along with Uncle Billy and George. Dr. Campbell is the Chairman of the Board. Before each director are individual summaries for them to examine along with folders and papers on which they have been commenting. Henry F. Potter, with his brute beside his wheelchair, is prominently positioned among them. Dr. Campbell ascends from his position, and George and Uncle Billy commence to gather their papers and vacate the table, startling everyone. George stands at the portal of the office, grasping his coat and documents, prepared to depart, but sets them down, incensed by what Potter is asserting about his progenitor, and returns to the table. George then exits the chamber, followed by the elated Uncle Billy. Potter’s countenance is stern with animosity as he is interrupted by a babble of dialogue as the directors dispute. George, visibly agitated, busies himself with his satchel and documents while Uncle Billy follows him around, chattering and anxious about the outcome of the assembly, which might modify his schemes regarding dissolving the Building and Loan. Ernie stands in the entrance, and an elated Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands. The stars from the opening sequence glimmer once more as voices from Heaven are audible. Meanwhile, a multitude of people await for the train, and Uncle Billy is seated on a luggage cart eating peanuts as George strides up and down in front of him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The full moon shines through the trees as the talking is finished by George, and he jumps up out of his chair. As he speaks, the porch is left by a man, who goes into his house and slams the door. The scene is then run off by Mary, but as George is standing on the belt of her bathrobe, it is inadvertently caused to come off by him as she runs. His bundle of clothes is dropped by him, and Mary's robe is picked up by him, but she cannot be seen anywhere by him. Mary's face is seen peering out from the leaves as the bush is walked toward by George, and he is about to throw her the robe when a thought strikes him. Meanwhile, the bushes are thrashed around in by Mary, and the scene is flashed into by headlights as the old Bailey automobile, driven by Harry with Uncle Billy beside him, drives in. The robe is thrown by George over the bush, and he gets into the car, and as it drives off, Mary, now wearing the robe, rises from the bush, following the car with her eyes. Subsequently, around a long table, about twelve directors, substantial citizens of Bedford Falls such as Dr. Campbell, a lawyer, an insurance agent, and a real estate salesman, sit with Uncle Billy and George. The Chairmanship of the Board is held by Dr. Campbell. Individual reports are placed before each director for them to study, along with folders and papers on which they have been reporting. Henry F. Potter, with his goon beside his wheelchair, sits prominently among them. Dr. Campbell rises from his seat, and papers are started to be collected by George and Uncle Billy, surprising everyone as they leave the table. George stands at the door of the office, holding his coat and papers, ready to leave, but they are put down by him as he is incensed by what Potter says about his father, and he comes back to the table. The room is then left by George, followed by the jubilant Uncle Billy. Potter's face is grim with hatred as a babble of talk interrupts him while the directors argue. George, visibly shaken, busies himself with his bag and papers while he is followed around by Uncle Billy, who chatters and worries about the outcome of the meeting, which might alter his plans regarding dissolving the Building and Loan. The doorway is stood in by Ernie, and Dr. Campbell comes running out jubilantly. Cheers are given wildly by Cousin Eustace, Cousin Tilly, and Uncle Billy as Dr. Campbell and George shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile, the train is waited for by a number of people, and peanuts are eaten by Uncle Billy as he is seated on a baggage wagon while George paces up and down in front of him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The full moon shines through the trees as George finishes talking and jumps up. A man leaves the porch, enters his house, and slams the door. Mary runs off, but George, standing on her bathrobe belt, accidentally causes it to come off. He drops his clothes, picks up the robe, but can't see her. Mary's face peers from the leaves as George approaches the bush to throw her the robe, but hesitates. Mary thrashes in the bushes as headlights flash; Harry drives in with Uncle Billy. George throws Mary's robe over the bush and gets into the car. Mary, now wearing the robe, watches the car leave. Around a long table, twelve directors, including Dr. Campbell, Uncle Billy, and George, are seated. Dr. Campbell is Chairman. Each director has reports and papers. Henry F. Potter, with his goon, is prominently seated. Dr. Campbell rises, and George and Uncle Billy collect their papers to leave, surprising everyone. George, incensed by Potter's remarks about his father, returns to the table. He then leaves, followed by Uncle Billy. Potter's face is grim as directors argue. George, shaken, gathers his papers while Uncle Billy worries about the meeting's outcome, which might affect the Building and Loan. Ernie stands in the doorway as Dr. Campbell runs out jubilantly. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer as Dr. Campbell and George shake hands. Stars twinkle as voices from Heaven are heard. Meanwhile, people wait for the train, and Uncle Billy eats peanuts on a baggage wagon as George paces."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The full moon shines through the trees as George finishes talking and jumps up. A man leaves the porch, enters his house, and slams the door. Mary runs off, but George, standing on her bathrobe belt, causes it to come off. He drops his clothes, picks up the robe, but can't see her. Mary's face peers from the leaves as George approaches the bush to throw her the robe, then hesitates. Mary thrashes in the bushes as Harry drives in with Uncle Billy. George throws the robe over the bush, gets in the car, and Mary, now wearing the robe, watches them leave. Around a long table, twelve directors, including Dr. Campbell, Uncle Billy, and George, are seated. Dr. Campbell is Chairman. Each director has reports and papers. Henry F. Potter, with his goon, is seated among them. Dr. Campbell rises, and George and Uncle Billy collect their papers to leave, surprising everyone. George, incensed by Potter's words about his father, returns to the table, then leaves with Uncle Billy. Potter's face is grim as directors argue. George, shaken, gathers his papers while Uncle Billy worries about the meeting's outcome. Ernie stands in the doorway as Dr. Campbell and George shake hands. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer. Stars twinkle as voices from Heaven are heard. Meanwhile, people wait for the train, and Uncle Billy eats peanuts as George paces."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The full, luminous moon is casting its bright glow through the dense canopy of trees as George concludes his conversation and energetically leaps up from his chair. As he speaks, a man quietly departs from the porch, enters his house, and forcefully slams the door behind him. Mary then hastily exits the scene, but George, inadvertently standing on the belt of her bathrobe, causes it to slip off as she makes her hurried escape. He drops his bundle of clothes in surprise and picks up Mary's robe, but he is unable to spot her anywhere in the vicinity. We catch a glimpse of Mary's face peering out cautiously from behind the leaves as George approaches the bush, preparing to toss her the robe when a sudden thought occurs to him. Meanwhile, Mary is thrashing about in the bushes, and the scene is suddenly illuminated by the headlights of the old Bailey automobile, which is being driven by Harry with Uncle Billy seated beside him. George throws Mary's robe over the bush and climbs into the car, and as it drives away, Mary, now clad in the robe, rises from the bush, her eyes following the departing vehicle. Subsequently, around a long, imposing table, approximately twelve directors, who are substantial citizens of Bedford Falls, including Dr. Campbell, a lawyer, an insurance agent, and a real estate salesman, are seated, along with Uncle Billy and George. Dr. Campbell holds the position of Chairman of the Board. In front of each director are individual reports for them to review, along with folders and papers on which they have been diligently reporting. Henry F. Potter, with his intimidating goon beside his wheelchair, is prominently seated among them. Dr. Campbell rises from his seat, and George and Uncle Billy begin to gather their papers and prepare to leave the table, taking everyone by surprise. George stands at the office door, holding his coat and papers, ready to depart, but he sets them down, incensed by Potter's disparaging remarks about his father, and returns to the table. George then exits the room, followed by the jubilant Uncle Billy. Potter's face is grim with hatred as he is interrupted by a cacophony of voices as the directors engage in a heated argument. George, visibly shaken, busies himself with his bag and papers while Uncle Billy trails him, chattering anxiously and worried about the potential outcome of the meeting, which might significantly alter his plans regarding the dissolution of the Building and Loan. Ernie stands in the doorway, and a jubilant Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands in celebration. The stars from the opening sequence twinkle once more as ethereal voices from Heaven are heard. Meanwhile, a number of people are waiting for the train, and Uncle Billy is comfortably seated on a baggage wagon, munching on peanuts as George paces back and forth in front of him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The full, radiant moon is casting its bright, silvery glow through the dense canopy of trees as George concludes his lively conversation and energetically leaps up from his chair with great enthusiasm. As he speaks, a man quietly departs from the porch with little fanfare, enters his house, and forcefully slams the door behind him with a resounding thud. Mary then hastily exits the scene, but George, inadvertently and unknowingly standing on the belt of her bathrobe, unintentionally causes it to slip off as she makes her hurried escape from the area. He drops his bundle of clothes in surprise and, with some urgency, picks up Mary's fallen robe, but he is unable to spot her anywhere in the vicinity. We catch a glimpse of Mary's face peering out cautiously and tentatively from behind the leaves as George approaches the bush, preparing to toss her the robe when a sudden thought occurs to him. Meanwhile, Mary is thrashing about in the bushes, and the entire scene is suddenly illuminated by the bright headlights of the old Bailey automobile, which is being driven by Harry with Uncle Billy seated beside him, creating a striking image. George throws Mary's robe over the bush and promptly climbs into the car, and as it drives away, Mary, now clad in the robe, rises from the bush, her eyes following the departing vehicle with a pensive gaze. Subsequently, around a long, imposing table, approximately twelve directors, who are substantial citizens of Bedford Falls, including Dr. Campbell, a reputable lawyer, an experienced insurance agent, and a knowledgeable real estate salesman, are seated, along with Uncle Billy and George. Dr. Campbell holds the esteemed position of Chairman of the Board. In front of each director are individual reports for them to diligently review, along with organized folders and papers on which they have been diligently reporting. Henry F. Potter, with his intimidating goon beside his imposing wheelchair, is prominently seated among them, exuding an air of authority. Dr. Campbell rises from his seat, and George and Uncle Billy begin to gather their papers and prepare to leave the table, taking everyone by surprise. George stands at the office door, holding his coat and papers, ready to depart, but he sets them down, incensed by Potter's disparaging remarks about his father, and returns to the table with determination. George then exits the room, followed by the jubilant and celebratory Uncle Billy. Potter's face is grim and twisted with hatred as he is interrupted by a cacophony of voices as the directors engage in a heated and animated argument. George, visibly shaken and disturbed, busies himself with his bag and papers while Uncle Billy trails him, chattering anxiously and worried about the potential outcome of the meeting, which might significantly alter his plans regarding the dissolution of the Building and Loan. Ernie stands in the doorway, and a jubilant Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands in celebration. The stars from the opening sequence twinkle once more as ethereal voices from Heaven are heard, adding an otherworldly dimension. Meanwhile, a number of people are waiting for the train, and Uncle Billy is comfortably seated on a baggage wagon, nonchalantly munching on peanuts as George paces back and forth in front of him, deep in thought."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The full moon casts its luminous glow through the trees, illuminating the scene as George concludes his conversation and energetically leaps up from his chair. As his words linger in the air, a man quietly departs from the porch, makes his way into his house, and forcefully slams the door behind him. In the ensuing moments, Mary hastily exits the scene, but as she does so, George, inadvertently standing on the belt of her bathrobe, causes it to slip off her as she runs. In a flurry of motion, he lets go of his bundle of clothes and bends down to retrieve Mary's robe, only to find that she is nowhere in sight. Meanwhile, Mary's face emerges from the foliage, peering out as George approaches the bush, preparing to toss her the robe when a sudden thought halts him. Simultaneously, Mary struggles amidst the bushes, and the scene is suddenly illuminated by the headlights of the old Bailey automobile, driven by Harry with Uncle Billy seated beside him, as it enters the scene. George, in a decisive motion, throws Mary's robe over the bush and promptly climbs into the car. As the vehicle pulls away, Mary, now clad in her robe, rises from the bush, her eyes trailing the departing car. The scene transitions to a long table around which approximately twelve directors, notable citizens of Bedford Falls such as Dr. Campbell, a lawyer, an insurance agent, and a real estate salesman, are gathered, along with Uncle Billy and George. Dr. Campbell presides as the Chairman of the Board. In front of each director lie individual reports for their perusal, accompanied by folders and papers on which they have been diligently reporting. Among them, Henry F. Potter, with his goon stationed beside his wheelchair, occupies a prominent position. Dr. Campbell stands up from his seat, prompting George and Uncle Billy to begin gathering their papers, preparing to leave the table, much to the surprise of everyone present. George pauses at the office door, clutching his coat and papers, poised to depart, but is compelled to set them down, incensed by Potter's disparaging remarks about his father, and returns to the table. After a tense exchange, George exits the room, with the jubilant Uncle Billy following closely behind. Potter's expression is etched with grim hatred as the room erupts into a cacophony of voices as the directors engage in heated debate. Outside, George, visibly unsettled, busies himself with his bag and papers while Uncle Billy trails him, chattering anxiously about the potential ramifications of the meeting, which could impact his plans concerning the dissolution of the Building and Loan. Ernie appears in the doorway, and a jubilant Dr. Campbell rushes out. Cousin Eustace, Cousin Tilly, and Uncle Billy erupt into wild cheers as Dr. Campbell and George exchange a firm handshake. The stars from the opening sequence twinkle once more as celestial voices are heard from Heaven. Meanwhile, a crowd of people gathers at the train station, and Uncle Billy sits on a baggage wagon, munching on peanuts, while George paces back and forth in front of him, deep in thought."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The full moon illuminates the scene as George finishes speaking and leaps from his chair. A man exits the porch, enters his house, and slams the door, while Mary runs off, inadvertently leaving her bathrobe behind as George steps on its belt. Dropping his clothes, George retrieves the robe but cannot locate Mary, who is hidden in the bushes. As he approaches to return the robe, he hesitates, and just then, headlights from the old Bailey automobile, driven by Harry with Uncle Billy, light up the scene. George tosses the robe over the bush and joins them in the car, which drives away as Mary, now wearing the robe, watches them leave. Later, around a long table, twelve directors, including Dr. Campbell, Uncle Billy, and George, are seated with reports and papers. Henry F. Potter, with his goon beside his wheelchair, is also present. Dr. Campbell stands, prompting George and Uncle Billy to gather their papers and prepare to leave, surprising the others. However, George, incensed by Potter's remarks about his father, returns to the table after initially heading to the door. He eventually exits with Uncle Billy, who is jubilant despite Potter's grim expression and the directors' arguments. Outside, George, visibly shaken, organizes his belongings while Uncle Billy chatters anxiously about the meeting's potential impact on the Building and Loan. Ernie appears in the doorway as a jubilant Dr. Campbell rushes out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer as Dr. Campbell and George shake hands. The stars from the opening sequence twinkle again as voices from Heaven are heard. Meanwhile, people wait for the train, with Uncle Billy seated on a baggage wagon eating peanuts as George paces nearby."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The full moon, which according to the Farmer's Almanac represents fulfillment and clarity, is shining through the towering pine trees as George finishes talking and jumps up out of his chair. As he speaks, a man leaves the porch, an old wooden structure typical of rural American homes, goes into his house, and slams the door. Mary then runs off the scene, but George, standing on the belt of her bathrobe, inadvertently causes it to come off as she runs. He drops his bundle of clothes, gathered hastily in his rush, and picks up Mary's robe but cannot see her anywhere. We see Mary's face peering out from the leaves of a dense laurel bush as George walks toward the bush, about to throw her the robe when a thought, perhaps mischievous or romantic, strikes him. Meanwhile, Mary thrashes around in the bushes, and headlights flash into the scene, illuminating the night, as the old Bailey automobile, a 1928 Ford Model A driven by Harry with Uncle Billy beside him, drives in. George throws Mary's robe over the bush and gets into the car, and as it drives off, Mary, now wearing the robe, rises from the bush, following the car with her eyes. Subsequently, around a long oak table in the stately meeting room, about twelve directors, substantial citizens of Bedford Falls, a small town known for its close-knit community, such as Dr. Campbell, a respected physician, a lawyer, an insurance agent, and a real estate salesman, are seated, along with Uncle Billy and George. Dr. Campbell, noted for his fair judgment, is the Chairman of the Board. Before each director are individual reports for them to study along with folders and papers on which they have been reporting. Henry F. Potter, a wealthy and influential businessman with his goon beside his wheelchair, is prominently seated among them. Dr. Campbell rises from his seat, and George and Uncle Billy start to collect their papers and leave the table, surprising everyone. George stands at the door of the office, an austere room with high ceilings and dark wooden paneling, holding his coat and papers, ready to leave, but puts them down, incensed by what Potter is saying about his father, a man known for his integrity and kindness, and comes back to the table. George then leaves the room, followed by the jubilant Uncle Billy. Potter's face is grim with hatred as he is interrupted by a babble of talk as the directors argue. George, visibly shaken, busies himself with his bag and papers while Uncle Billy follows him around, chattering and worried about the outcome of the meeting, which might alter his plans regarding dissolving the Building and Loan, a community cornerstone providing financial support to local residents. Ernie, the local cab driver and a friend of George's, stands in the doorway, and a jubilant Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands. The stars from the opening sequence, representing celestial oversight and fate, twinkle once more as voices from Heaven, suggestive of a guiding presence, are heard. Meanwhile, a number of people, travelers and townsfolk, wait for the train, a symbol of progress and change, and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair  As he speaks a man leaves the porch goes into his house and slams the door  Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs  Henry F Potter with his goon beside his wheelchair is prominently seated among them  Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone  George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table  George then leaves the room followed by the jubilant Uncle Billy  Potter's face is grim with hatred as he is interrupted by a babble of talk  as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan  Ernie stands in the doorway and a jubilant Dr Campbell comes running out  Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands  The stars from the opening sequence twinkle once more as voices from Heaven are heard  Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere  We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him  Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in  George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes  Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George  Dr Campbell is the Chairman of the Board  Before each director are individual reports for them to study along with folders and papers on which they have been reporting  Henry F Potter with his goon beside his wheelchair is prominently seated among them  Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone  George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table  George then leaves the room followed by the jubilant Uncle Billy  Potter's face is grim with hatred as he is interrupted by a babble of talk  as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan  Ernie stands in the doorway and a jubilant Dr Campbell comes running out  Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands  The stars from the opening sequence twinkle once more as voices from Heaven are heard  Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair. As he speaks a man leaves the porch goes into his house and slams the door. Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs. He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere. We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him. Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in. George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes. Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George. Dr Campbell is the Chairman of the Board. Before each director are individual reports for them to study along with folders and papers on which they have been reporting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Henry F Potter with his goon beside his wheelchair is prominently seated among them. Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone. George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table. George then leaves the room followed by the jubilant Uncle Billy. Potter's face is grim with hatred as he is interrupted by a babble of talk. as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan. Ernie stands in the doorway and a jubilant Dr Campbell comes running out. Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair. As he speaks a man leaves the porch goes into his house and slams the door. Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs. He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere. We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him. Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in. George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes. Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George. Dr Campbell is the Chairman of the Board. Before each director are individual reports for them to study along with folders and papers on which they have been reporting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Henry F Potter with his goon beside his wheelchair is prominently seated among them. Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone. George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table. George then leaves the room followed by the jubilant Uncle Billy. Potter's face is grim with hatred as he is interrupted by a babble of talk. as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan. Ernie stands in the doorway and a jubilant Dr Campbell comes running out. Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair. As he speaks a man leaves the porch goes into his house and slams the door. Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs. He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere. We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him. as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan. Ernie stands in the doorway and a jubilant Dr Campbell comes running out. Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The full moon is shining through the trees as George finishes talking and jumps up out of his chair. As he speaks a man leaves the porch goes into his house and slams the door. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The full moon is shining through the trees as the giraffe finishes talking and jumps up out of its chair. As the giraffe speaks, a penguin leaves the porch, goes into its house, and slams the door. The dog then runs off the scene, but the giraffe, standing on the belt of its bathrobe, inadvertently causes it to come off as the dog runs. The giraffe drops its bundle of clothes and picks up the dog's robe but cannot see the dog anywhere. We see the dog's face peering out from the leaves as the giraffe walks toward the bush, about to throw the dog the robe when a thought strikes the giraffe. Meanwhile, the dog thrashes around in the bushes, and headlights flash into the scene as the old Bailey automobile, driven by the rabbit with the bear beside it, drives in. The giraffe throws the dog's robe over the bush and gets into the car, and as it drives off, the dog, now wearing the robe, rises from the bush, following the car with its eyes. Subsequently, around a long table, about twelve directors, substantial citizens of Bedford Falls such as the turtle, a lawyer, an insurance agent, and a real estate salesman, are seated, along with the bear and the giraffe. The turtle is the Chairman of the Board. Before each director are individual reports for them to study along with folders and papers on which they have been reporting. The squirrel, with its goon beside its wheelchair, is prominently seated among them. The turtle rises from its seat, and the giraffe and the bear start to collect their papers and leave the table, surprising everyone. The giraffe stands at the door of the office, holding its coat and papers, ready to leave, but puts them down, incensed by what the squirrel is saying about its father, and comes back to the table. The giraffe then leaves the room, followed by the jubilant bear. The squirrel's face is grim with hatred as it is interrupted by a babble of talk as the directors argue. The giraffe, visibly shaken, busies itself with its bag and papers while the bear follows it around, chattering and worried about the outcome of the meeting, which might alter its plans regarding dissolving the Building and Loan. The mouse stands in the doorway, and a jubilant turtle comes running out. Cousin Lion, Cousin Tiger, and the bear cheer wildly as the turtle and the giraffe shake hands. The stars from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile, a number of people wait for the train, and the bear is seated on a baggage wagon eating peanuts as the giraffe paces up and down in front of it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The bright lamp is shining through the drapes as George finishes talking and jumps up out of his hammock. As he speaks, a man leaves the veranda, goes into his apartment, and slams the hatch. Mary then runs off the stage, but George, standing on the strap of her satchel, inadvertently causes it to come off as she runs. He drops his sack of shoes and picks up Mary's satchel but cannot see her anywhere. We see Mary's face peering out from the curtains as George walks toward the sofa, about to throw her the satchel when a thought strikes him. Meanwhile, Mary thrashes around in the curtains, and taillights flash into the scene as the old Bailey bicycle, ridden by Harry with Uncle Billy beside him, rides in. George throws Mary's satchel over the sofa and gets onto the bike, and as it rides off, Mary, now wearing the satchel, rises from the sofa, following the bike with her eyes. Subsequently, around a long counter, about twelve directors, substantial citizens of Bedford Falls such as Dr. Campbell, a sculptor, a newspaper editor, and a gallery curator, are seated, along with Uncle Billy and George. Dr. Campbell is the Head of the Board. Before each director are individual charts for them to study along with scrolls and books on which they have been working. Henry F. Potter, with his aide beside his recliner, is prominently seated among them. Dr. Campbell rises from his couch, and George and Uncle Billy start to collect their books and leave the counter, surprising everyone. George stands at the gate of the den, holding his vest and books, ready to leave, but puts them down, incensed by what Potter is saying about his father, and comes back to the counter. George then leaves the room, followed by the jubilant Uncle Billy. Potter's face is grim with contempt as he is interrupted by a babble of talk as the directors argue. George, visibly shaken, busies himself with his crate and books while Uncle Billy follows him around, chattering and worried about the outcome of the gathering, which might alter his plans regarding dissolving the Warehouse and Mortgage. Ernie stands in the passageway, and a jubilant Dr. Campbell comes running out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer wildly as Dr. Campbell and George shake hands. The clouds from the opening sequence twinkle once more as voices from Heaven are heard. Meanwhile, a number of people wait for the ferry, and Uncle Billy is seated on a luggage cart eating cherries as George paces up and down in front of him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The full moon is reflecting through the trees as George completes listening and leaps out of his chair. As he listens, a man exits the porch, enters his house, and flings the door. Mary then skips off the scene, but George, stepping on the belt of her bathrobe, unintentionally makes it fall off as she skips. He tosses his bundle of clothes and grasps Mary's robe but cannot spot her anywhere. We glimpse Mary's face hiding behind the leaves as George strolls toward the bush, prepared to toss her the robe when an idea dawns on him. Meanwhile, Mary rustles around in the bushes, and streetlights illuminate the scene as the old Bailey automobile, piloted by Harry with Uncle Billy beside him, rolls in. George hurls Mary's robe over the bush and hops into the car, and as it rolls off, Mary, now clothed in the robe, emerges from the bush, trailing the car with her eyes. Subsequently, around a long table, about twelve directors, notable citizens of Bedford Falls such as Dr. Campbell, a lawyer, an insurance agent, and a real estate salesman, are situated, along with Uncle Billy and George. Dr. Campbell is the Chairman of the Board. Before each director are individual documents for them to examine along with folders and papers on which they have been jotting down. Henry F. Potter, with his assistant beside his wheelchair, is prominently situated among them. Dr. Campbell stands from his seat, and George and Uncle Billy begin to stack their papers and move away from the table, astonishing everyone. George pauses at the door of the office, clutching his coat and papers, prepared to depart, but places them down, incensed by what Potter is declaring about his father, and returns to the table. George then departs the room, pursued by the thrilled Uncle Billy. Potter's face is stern with disdain as he is disrupted by a cacophony of talk as the directors dispute. George, noticeably unsettled, occupies himself with his bag and papers while Uncle Billy tails him around, chattering and anxious about the impact of the meeting, which might reshape his plans regarding dissolving the Building and Loan. Ernie stands in the doorway, and a jubilant Dr. Campbell comes skipping out. Cousin Eustace, Cousin Tilly, and Uncle Billy applaud wildly as Dr. Campbell and George clasp hands. The stars from the opening sequence glimmer once more as voices from Heaven are heard. Meanwhile, a group of people gather for the train, and Uncle Billy rests on a baggage wagon munching peanuts as George strides back and forth in front of him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giant kite is glowing through the flowers as Thomas finishes dancing and jumps up out of his hammock. As he sings, a pineapple leaves the skyscraper, goes into its bungalow, and slams the gate. Sally then swims off the stage, but Thomas, standing on the buckle of her necklace, inadvertently causes it to come off as she swims. He drops his collection of marbles and picks up Sally's necklace but cannot see her anywhere. We see Sally's face peering out from the clouds as Thomas walks toward the puddle, about to throw her the necklace when a thought strikes him. Meanwhile, Sally thrashes around in the puddles, and fireflies flash into the vista as the old Kingston wagon, driven by Arnold with Aunt Daisy beside him, rolls in. Thomas throws Sally's necklace over the puddle and gets into the wagon, and as it rolls off, Sally, now wearing the necklace, rises from the puddle, following the wagon with her eyes. Subsequently, around a long counter, about twelve bakers, substantial citizens of Maple Grove such as Mr. Johnson, a doctor, a dentist, and a newspaper columnist, are seated, along with Aunt Daisy and Thomas. Mr. Johnson is the Chairman of the Board. Before each baker are individual menus for them to study along with spoons and cups on which they have been eating. Lester D. Potter, with his parrot beside his tricycle, is prominently seated among them. Mr. Johnson rises from his hammock, and Thomas and Aunt Daisy start to collect their spoons and leave the counter, surprising everyone. Thomas stands at the curtain of the classroom, holding his hat and cups, ready to leave, but puts them down, incensed by what Potter is saying about his uncle, and comes back to the counter. Thomas then leaves the closet, followed by the jubilant Aunt Daisy. Potter's face is grim with hatred as he is interrupted by a babble of music as the bakers argue. Thomas, visibly shaken, busies himself with his backpack and cups while Aunt Daisy follows him around, chattering and worried about the outcome of the picnic, which might alter his plans regarding dissolving the Cookie and Milk. Charlie stands in the doorway, and a jubilant Mr. Johnson comes running out. Cousin Vicky, Cousin Linda, and Aunt Daisy cheer wildly as Mr. Johnson and Thomas shake hands. The comets from the opening sequence twinkle once more as echoes from the Forest are heard. Meanwhile, a number of owls wait for the ferry, and Aunt Daisy is seated on a luggage dolly eating grapes as Thomas paces up and down in front of her."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The gentle breeze is rustling through the trees as Margaret finishes listening and springs up out of her hammock. As she listens, a dog sidles off the porch, trots into his yard, and shuts the window. Henry then skips off the scene, but Margaret, sitting on the buckle of his backpack, unintentionally causes it to fall off as he skips. She drops her stack of books and grabs Henry's backpack but cannot find him anywhere. We see Henry's hand peeking out from the flowers as Margaret strolls toward the garden, about to toss him the backpack when a plan strikes her. Meanwhile, Henry thrashes around in the greenery, and streetlights beam onto the scene as the vintage Carter motorcycle, ridden by Lucy with Aunt Betty beside her, cruises in. Margaret tosses Henry's backpack over the garden and hops onto the motorcycle, and as it speeds off, Henry, now grasping the backpack, emerges from the greenery, trailing the motorcycle with his gaze. Shortly after, around a long counter, about twelve trustees, influential residents of Springfield such as Dr. Mitchell, a journalist, a travel agent, and a book publisher, are gathered, along with Aunt Betty and Margaret. Dr. Mitchell is the President of the Board. Before each trustee are separate files for them to analyze along with notebooks and documents on which they have been writing. Gerald H. Collins, with his aide beside his scooter, is prominently positioned among them. Dr. Mitchell rises from his seat, and Margaret and Aunt Betty begin to organize their files and leave the counter, surprising everyone. Margaret stands at the entrance of the room, clutching her bag and files, ready to leave, but sets them down, angered by what Collins is muttering about his friend, and returns to the counter. Margaret then exits the room, followed by the gleeful Aunt Betty. Collins's face is grim with resentment as he is interrupted by a clamor of chatter as the trustees bicker. Margaret, visibly puzzled, busies herself with her briefcase and files while Aunt Betty trails her, chattering and concerned about the results of the gathering, which might change her intentions regarding initiating the Library and Cafe. Alice stands in the hallway, and a jubilant Dr. Mitchell comes skipping out. Cousin Frank, Cousin Sally, and Aunt Betty cheer enthusiastically as Dr. Mitchell and Margaret hug. The clouds from the opening scene drift once more as echoes from above are heard. Meanwhile, a group of passengers wait for the ferry, and Aunt Betty is seated on a luggage cart eating apples as Margaret strides up and down in front of her."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The bright sun is glowing through the clouds as George finishes listening and bounces up out of his sofa. As he listens, a woman exits the gazebo, enters her apartment, and kicks the gate shut. Mary then wanders off the field, but George, standing on the hem of her dress, inadvertently causes it to tear off as she wanders. He tosses his stack of papers and grabs Mary's dress but cannot hear her anywhere. We see Mary's eyes peering out from the branches as George marches toward the hedge, about to toss her the dress when an idea hits him. Meanwhile, Mary flails around in the hedges, and streetlamps flicker into the area as the old Bailey bicycle, ridden by Harry with Uncle Billy behind him, pedals in. George tosses Mary's dress over the hedge and hops onto the bicycle, and as it pedals away, Mary, now wearing the dress, emerges from the hedge, trailing the bicycle with her eyes. Subsequently, around a small desk, about twelve interns, reliable citizens of Bedford Falls such as Dr. Campbell, a librarian, a travel agent, and a stockbroker, are standing, along with Uncle Billy and George. Dr. Campbell is the Head of the Committee. Before each intern are notebooks for them to write in along with envelopes and sketches on which they have been explaining. Henry F. Potter, with his aide beside his walker, is prominently leaning among them. Dr. Campbell stands from his chair, and George and Uncle Billy start to gather their sketches and depart the desk, amusing everyone. George stands at the entrance of the lobby, holding his hat and sketches, ready to go, but lays them down, frustrated by what Potter is uttering about his father, and strolls back to the desk. George then exits the lounge, followed by the elated Uncle Billy. Potter's face is sour with jealousy as he is disrupted by a clamor of chatter as the interns squabble. George, visibly stirred, amuses himself with his satchel and sketches while Uncle Billy trails him around, prattling and concerned about the result of the gathering, which might transform his projects regarding dissolving the Building and Loan. Ernie stands in the hallway, and a gleeful Dr. Campbell comes jogging out. Cousin Eustace, Cousin Tilly, and Uncle Billy cheer exuberantly as Dr. Campbell and George nod hands. The clouds from the opening sequence shimmer once more as whispers from the Earth are heard. Meanwhile, a number of people wait for the bus, and Uncle Billy is seated on a bench eating oranges as George strides up and down in front of him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The dim sun is flickering across the mountains as Helena finishes dancing and floats up out of her hammock. As she whistles, a woman enters the garden, steps onto her patio, and kicks the gate. Carlos then skips out of the picture, but Helena, standing on the strap of her sandals, accidentally causes them to fall off as she skips. She tosses her stack of books and grabs Carlos's hat but cannot spot him anywhere. We observe Carlos's nose peeking out from the branches as Helena strolls toward the tree, ready to hurl him the hat when an idea occurs to her. Meanwhile, Carlos flounders around in the grass, and lanterns blink into the picture as the new Sanchez wagon, driven by Lucy with Aunt Martha beside her, rolls in. Helena hurls Carlos's hat over the tree and hops into the wagon, and as it rolls away, Carlos, now wearing the hat, emerges from the grass, trailing the wagon with her eyes. Eventually, beside a short bench, about twenty tourists, resident strangers to River Town such as Mr. Johnson, a gardener, a taxi driver, and a bakery chef, are standing, along with Aunt Martha and Helena. Mr. Johnson is the Head of the Council. In front of each tourist are communal laptops for them to explore along with baskets and tablets on which they have been exploring. Henry G. Barker, with his cat beside his stroller, is casually standing among them. Mr. Johnson jumps from his bench, and Helena and Aunt Martha start to pack their tablets and ascend the bench, shocking no one. Helena leans against the wall of the lobby, clutching her scarf and tablets, eager to ascend, but sets them down, irritated by what Barker is laughing about her sister, and dashes back to the bench. Helena soon exits the lobby, trailed by the jubilant Aunt Martha. Barker's smile is bright with delight as he is interrupted by a chorus of singing as the tourists cheer. Helena, evidently pleased, distracts herself with her hat and tablets while Aunt Martha trails her around, humming and worried about the end of the trip, which might adjust her dreams regarding expanding the School and Garage. Drew stands near the carpet, and a jubilant Mr. Johnson comes strolling in. Grandma Edith, Grandpa Thomas, and Aunt Martha clap quietly as Mr. Johnson and Helena embrace warmly. The clouds from the finale vanish once more as whispers from Earth are perceived. Meanwhile, a crowd of animals waits for the ship, and Aunt Martha is reclining on a haystack munching grapes as Helena hops up and down in front of her."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The full moon illuminates the scene as George jumps up, inadvertently causing Mary’s bathrobe to come off as she runs. Mary hides in the bushes while George initially picks up the robe but reconsiders, only throwing it back when Harry and Uncle Billy arrive in their car. She watches them drive off, now wearing the robe. Later, around a long table, prominent figures of Bedford Falls, including Dr. Campbell, Uncle Billy, and George, meet with directors. Dr. Campbell leads the meeting as George and Uncle Billy prepare to leave. However, George, angered by Potter's comments about his father, returns to the table. Afterward, George, visibly shaken, prepares to leave again, with Uncle Billy fretting over the meeting's outcome regarding dissolving the Building and Loan. Dr. Campbell, Cousin Eustace, Cousin Tilly, and Uncle Billy celebrate as George shakes hands with Dr. Campbell. The stars from the opening twinkle as voices from Heaven are heard. Meanwhile, Uncle Billy eats peanuts on a baggage wagon as George paces, waiting for the train."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him The stars from the opening sequence twinkle once more as voices from Heaven are heard  Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands  Ernie stands in the doorway and a jubilant Dr Campbell comes running out  as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan  Potter's face is grim with hatred as he is interrupted by a babble of talk  George then leaves the room followed by the jubilant Uncle Billy  George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table  Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone  Henry F Potter with his goon beside his wheelchair is prominently seated among them  Before each director are individual reports for them to study along with folders and papers on which they have been reporting  Dr Campbell is the Chairman of the Board  Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George  George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes  Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in  We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him  He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere  Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs  As he speaks a man leaves the porch goes into his house and slams the door  The full moon is shining through the trees as George finishes talking and jumps up out of his chair "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Potter's face is grim with hatred as he is interrupted by a babble of talk  Dr Campbell is the Chairman of the Board  He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere  Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone  Henry F Potter with his goon beside his wheelchair is prominently seated among them  Ernie stands in the doorway and a jubilant Dr Campbell comes running out  As he speaks a man leaves the porch goes into his house and slams the door  George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table  Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in  The stars from the opening sequence twinkle once more as voices from Heaven are heard  Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs  Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him  Before each director are individual reports for them to study along with folders and papers on which they have been reporting  as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan  Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George  George then leaves the room followed by the jubilant Uncle Billy  George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes  Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands  The full moon is shining through the trees as George finishes talking and jumps up out of his chair "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Henry F Potter with his goon beside his wheelchair is prominently seated among them  Dr Campbell rises from his seat and George and Uncle Billy start to collect their papers and leave the table surprising everyone  George stands at the door of the office holding his coat and papers ready to leave but puts them down incensed by what Potter is saying about his father and comes back to the table  George then leaves the room followed by the jubilant Uncle Billy  Potter's face is grim with hatred as he is interrupted by a babble of talk  as the directors argue George visibly shaken busies himself with his bag and papers while Uncle Billy follows him around chattering and worried about the outcome of the meeting which might alter his plans regarding dissolving the Building and Loan  Ernie stands in the doorway and a jubilant Dr Campbell comes running out  Cousin Eustace Cousin Tilly and Uncle Billy cheer wildly as Dr Campbell and George shake hands  The stars from the opening sequence twinkle once more as voices from Heaven are heard  Meanwhile a number of people wait for the train and Uncle Billy is seated on a baggage wagon eating peanuts as George paces up and down in front of him The full moon is shining through the trees as George finishes talking and jumps up out of his chair  As he speaks a man leaves the porch goes into his house and slams the door  Mary then runs off the scene but George standing on the belt of her bathrobe inadvertently causes it to come off as she runs  He drops his bundle of clothes and picks up Mary's robe but cannot see her anywhere  We see Mary's face peering out from the leaves as George walks toward the bush about to throw her the robe when a thought strikes him  Meanwhile Mary thrashes around in the bushes and headlights flash into the scene as the old Bailey automobile driven by Harry with Uncle Billy beside him drives in  George throws Mary's robe over the bush and gets into the car and as it drives off Mary now wearing the robe rises from the bush following the car with her eyes  Subsequently around a long table about twelve directors substantial citizens of Bedford Falls such as Dr Campbell a lawyer an insurance agent and a real estate salesman are seated along with Uncle Billy and George  Dr Campbell is the Chairman of the Board  Before each director are individual reports for them to study along with folders and papers on which they have been reporting "
        }
      ]
    }
  ]
}