{
  "ground_truth": "The whistle of an approaching train is heard as the train comes to a stop, and Harry is among the first to get off, followed by an attractive girl about the same age as he is, named Ruth Dakin. In the excitement of greetings, Ruth is momentarily forgotten, standing and smiling, waiting, as George and Uncle Billy stare, astounded, with George thunderstruck. He takes Ruth's hand and kisses her. The camera moves with them down the platform, but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot, and Harry stops with George before running out of the shot as George watches him. George slowly moves after Uncle Billy and Ruth, thinking deeply, as the camera moves with him when he comes into the scene. Ruth detaches herself from the group and offers George some popcorn, nodding and smiling. Cousin Eustace takes a photograph of the family group assembled on the porch, and flash bulbs go off as the group breaks up, with the crowd entering the front door of the house, leaving George and Uncle Billy on the porch, the latter tipsy and feeling very high. Uncle Billy looks around for his hat, which is on his head, and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around, heading him down the street. George stands at the garden gate, obviously disturbed about the latest turn of events, as he takes some travel folders from his pocket, looks at them, and throws them away. His mother comes out of the house and kisses him, nodding toward the house, where Harry and Ruth, among a crowd of other couples, are dancing to the music of a phonograph, and are seen through the front door as they kiss. Mrs. Bailey puts George's hat on his head, and George stands in the middle of the street, hands in pockets, obviously undecided about what he wants to do. As a girl passes, he turns to watch her for a moment, while Violet is locking up for the night, with a couple of men crowding around her, each intent on taking her out. She looks up and sees George standing there, and the camera pans with Violet as she crosses the street to George. Violet, who takes her beauty shop seriously and is an eyeful, is sensed by George to be far from immune to her attractions, as she links her arm in his and continues down the street with him until they stop walking and face one another, with her eyes seductive and guileful as she looks up at him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The signal of an incoming locomotive is perceived as the locomotive arrives at a halt, and Harry is among the first to disembark, followed by an appealing young woman about the same age as he is, named Ruth Dakin. In the thrill of salutations, Ruth is briefly overlooked, standing and grinning, waiting, as George and Uncle Billy gaze, amazed, with George stunned. He takes Ruth's hand and kisses her. The camera moves with them down the platform, but George pauses with a sinking sensation while Uncle Billy and Ruth continue out of shot, and Harry pauses with George before running out of the shot as George observes him. George slowly moves after Uncle Billy and Ruth, pondering deeply, as the camera moves with him when he comes into the scene. Ruth separates herself from the group and offers George some popcorn, nodding and grinning. Cousin Eustace snaps a photograph of the family group gathered on the porch, and flash bulbs go off as the group disperses, with the crowd entering the front door of the abode, leaving George and Uncle Billy on the porch, the latter tipsy and feeling very merry. Uncle Billy searches around for his hat, which is on his head, and George takes the hat from Uncle Billy's head and presents it to him as they descend the porch steps and George turns his uncle around, directing him down the street. George stands at the garden gate, obviously unsettled about the newest turn of circumstances, as he takes some travel brochures from his pocket, looks at them, and discards them. His mother emerges from the house and kisses him, nodding toward the house, where Harry and Ruth, among a crowd of other couples, are dancing to the tunes of a phonograph, and are seen through the front door as they kiss. Mrs. Bailey places George's hat on his head, and George stands in the middle of the street, hands in pockets, clearly indecisive about what he desires to accomplish. As a girl passes, he turns to observe her for a moment, while Violet is closing up for the night, with a pair of men surrounding her, each intent on taking her out. She looks up and sees George standing there, and the camera pans with Violet as she crosses the street to George. Violet, who takes her beauty parlor seriously and is a sight, is perceived by George to be far from impervious to her charms, as she links her arm in his and continues down the street with him until they cease walking and face one another, with her eyes alluring and sly as she looks up at him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The whistle of an approaching train is heard as a stop is made by the train, and Harry is among the first to get off, followed by an attractive girl about the same age as he is, named Ruth Dakin. In the excitement of greetings, Ruth is momentarily forgotten, standing and smiling, waiting, as George and Uncle Billy stare, astounded, with George thunderstruck. Ruth's hand is taken by him and kissed. The camera moves with them down the platform, but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot, and Harry stops with George before he runs out of the shot as Harry is watched by George. Uncle Billy and Ruth are followed slowly by George, thinking deeply, as the scene is entered by him with the camera moving with him. Ruth detaches herself from the group and some popcorn is offered to George by her, nodding and smiling. A photograph of the family group assembled on the porch is taken by Cousin Eustace, and flash bulbs go off as the group breaks up, with the front door of the house entered by the crowd, leaving George and Uncle Billy on the porch, the latter tipsy and feeling very high. Uncle Billy looks around for his hat, which is on his head, and Uncle Billy's hat is taken from his head and handed to him by George as the porch steps are descended and Uncle Billy is turned around by George, heading him down the street. George stands at the garden gate, obviously disturbed about the latest turn of events, as some travel folders are taken from his pocket, looked at, and thrown away by him. The house is exited by his mother, who kisses him, nodding toward the house, where Harry and Ruth, among a crowd of other couples, are dancing to the music of a phonograph, and are seen through the front door as they kiss. George's hat is put on his head by Mrs. Bailey, and in the middle of the street stands George, hands in pockets, obviously undecided about what he wants to do. As a girl passes, she is turned to by him to watch her for a moment, while Violet is locking up for the night, with a couple of men crowding around her, each intent on taking her out. She looks up and sees George standing there, and the camera pans with Violet as she crosses the street to George. The beauty shop is taken seriously by Violet, who is an eyeful, and she is sensed by George to be far from immune to her attractions, as her arm is linked in his and she continues down the street with him until they stop walking and face one another, with her eyes seductive and guileful as she looks up at him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The whistle of an approaching train signals its stop, and Harry disembarks, followed by Ruth Dakin, an attractive girl of the same age. Amid excited greetings, Ruth is briefly overlooked as George and Uncle Billy, thunderstruck, stare. George kisses Ruth's hand. The camera follows them down the platform until George pauses with unease as Uncle Billy and Ruth exit the shot. Harry pauses with George before also leaving. George follows Uncle Billy and Ruth, deep in thought. Ruth offers George popcorn, nodding and smiling. Cousin Eustace photographs the family on the porch as flash bulbs go off, dispersing the group into the house, leaving George and a tipsy Uncle Billy on the porch. Uncle Billy searches for his hat, unaware it's on his head; George hands it to him, guiding him down the street. At the garden gate, a disturbed George looks at travel brochures and discards them. His mother appears, kisses him, and nods towards the house, where Harry and Ruth dance and kiss inside. Mrs. Bailey places George's hat on his head, and he stands in the street, undecided. A girl passes, and he watches momentarily, as Violet locks up her shop. With men vying for her attention, she spots George and crosses to him. George senses her allure as she links arms with him, strolling down the street until they halt, facing each other, Violet's eyes seductive and guileful."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The whistle of an approaching train is heard; as it stops, Harry is among the first off, joined by Ruth Dakin, an attractive girl his age. Amidst greetings, Ruth is briefly overlooked, smiling as George and Uncle Billy stare in shock. George kisses Ruth's hand. The camera follows them down the platform, but George pauses, feeling uneasy, while Uncle Billy and Ruth exit the shot. Harry pauses with George before leaving too, as George watches. George follows Uncle Billy and Ruth, pondering deeply; the camera tracks him. Ruth offers George popcorn, smiling. Cousin Eustace photographs the family on the porch; flash bulbs pop, and the crowd heads inside, leaving George and a tipsy Uncle Billy outside. Uncle Billy looks for his hat, which sits on his head; George hands it to him as they descend the steps, guiding him down the street. At the garden gate, George, troubled by recent events, pulls travel brochures from his pocket and discards them. His mother kisses him, nodding toward the house where Harry and Ruth dance and kiss among other couples. Mrs. Bailey places George's hat on his head; George stands in the street, undecided. As a girl passes, he watches her briefly, while Violet, locking up for the night and surrounded by suitors, notices George. The camera follows Violet as she crosses to him. Taking her beauty shop seriously, Violet captivates George, who senses her allure. She links her arm with his, and they walk until facing each other, her eyes seductive and guileful."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The distinctive whistle of an approaching train echoes through the air, heralding its arrival at the platform. As the train gradually comes to a complete stop, Harry is among the very first passengers to disembark. He is closely followed by an attractive young woman, approximately the same age, who is introduced as Ruth Dakin. In the whirlwind of excited greetings and bustling activity on the platform, Ruth is momentarily overlooked. She stands patiently with a radiant smile, waiting as George and Uncle Billy gaze in utter astonishment, George particularly thunderstruck by her presence. He graciously takes Ruth's hand in his own and gently kisses it. \n\nThe camera follows them down the platform, capturing the moment, but George abruptly halts with a sinking feeling in his heart. Meanwhile, Uncle Billy and Ruth continue walking, eventually moving out of the camera's frame, as Harry pauses with George for a brief moment before hurrying off-screen. George lingers, his thoughts consuming him, as he gradually trails behind Uncle Billy and Ruth, the camera once more capturing his contemplative demeanor as he reappears in the scene. Ruth then gracefully separates from the group to offer George some popcorn, her nod and smile exuding warmth.\n\nCousin Eustace takes a photograph of the family gathered together on the porch, and the brilliant flash bulbs ignite as the group disbands, with most members entering the house through the front door. This sequence leaves George and a somewhat tipsy Uncle Billy remaining on the porch, the latter feeling more than a little high-spirited. Uncle Billy starts to search for his hat, unaware it is perched atop his head. George, noticing this, retrieves the hat from Uncle Billy's head and hands it back to him. Together, they descend the porch steps, with George guiding his uncle by turning him in the right direction, leading him down the street.\n\nStanding thoughtfully at the garden gate, George is noticeably perturbed by the latest developments. He removes some travel brochures from his pocket, glances at them, and then casts them away in frustration. His mother emerges from the house and greets him with a kiss, nodding toward the house where Harry and Ruth, surrounded by a lively crowd of couples, are dancing to the melodies of a phonograph. Through the open front door, Harry and Ruth can be seen sharing a kiss. Mrs. Bailey affectionately places George's hat onto his head, and he stands there, in the middle of the street, his hands in his pockets, visibly uncertain about his next move.\n\nAs a girl walks past, he briefly turns to watch her, his attention momentarily diverted. Meanwhile, Violet is locking up for the night, her beauty shop now closed, with a small group of men hovering around her, each eager to accompany her out. She looks up and notices George standing there, and as the camera follows, Violet crosses the street to join him. Violet, who is not only dedicated to her beauty shop but is also a captivating sight, is well aware of her allure. George, sensing this, is far from immune to her charms. She links her arm with his, and they continue walking down the street together until they stop. They face each other, with her eyes filled with seductive charm and mischievous allure, gazing up at him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The unmistakable, distinctive whistle of an approaching train pierces the air, signaling its imminent arrival at the busy platform. As the train gradually grinds to a full stop, Harry is among the very first passengers to disembark, stepping off eagerly. Closely following him is an attractive young woman of approximately the same age, who is gracefully introduced as Ruth Dakin. Amid the whirlwind of excited greetings and the bustling activity bustling on the platform, Ruth is momentarily overlooked. She stands patiently with a radiant smile, waiting as George and Uncle Billy gaze in utter astonishment, George particularly thunderstruck by her unexpected presence. With a gracious gesture, he takes Ruth's hand in his own, lifting it gently and planting a soft kiss upon it.\n\nThe camera follows them, capturing the moment as they proceed down the platform, but George comes to an abrupt halt with a sinking feeling in his heart. Meanwhile, Uncle Billy and Ruth continue walking together, eventually moving out of the camera's frame. Harry pauses with George for a brief moment before hurrying off-screen. George lingers, his thoughts consuming him deeply, as he gradually trails behind Uncle Billy and Ruth. The camera captures his contemplative demeanor as he reappears in the scene. With a graceful move, Ruth separates herself from the group to offer George some popcorn, her nod and smile exuding a warm, inviting charm.\n\nCousin Eustace takes a photograph of the family gathered together on the porch, capturing the moment with brilliant flash bulbs that ignite as the group disbands. Most members enter the house through the inviting front door. This sequence leaves George and a somewhat tipsy Uncle Billy remaining on the porch, the latter feeling more than a little high-spirited and jubilant. Uncle Billy begins searching for his hat, unaware it is perched humorously atop his head. George, noticing this amusing oversight, carefully retrieves the hat from Uncle Billy's head and hands it back to him. Together, they descend the porch steps, with George guiding his uncle by gently turning him in the right direction, leading him down the street.\n\nStanding thoughtfully at the garden gate, George is noticeably perturbed by the latest developments and changes around him. He removes several travel brochures from his pocket, glances at them with a heavy heart, and then throws them away in frustration and dismay. His mother emerges from the house and greets him with a tender kiss, nodding toward the house where Harry and Ruth, surrounded by a lively crowd of couples, are energetically dancing to the melodies of a phonograph. Through the open front door, Harry and Ruth can be seen sharing a romantic kiss. Mrs. Bailey affectionately places George's hat onto his head, and he stands there, in the middle of the street, with his hands in his pockets, visibly uncertain about what step to take next.\n\nAs a girl walks past, he briefly turns to watch her, his attention momentarily diverted by her presence. Meanwhile, Violet is locking up for the night, her beauty shop now closed, with a small group of admirers hovering around her, each eager to accompany her out. She looks up and notices George standing there, and as the camera follows, Violet gracefully crosses the street to join him. Violet, who is not only dedicated to her beauty shop endeavors but is also a captivating sight, is well aware of her alluring charm. George, sensing this, finds himself far from immune to her seductive charms. She links her arm with his, and they continue walking down the street together until they come to a stop. They face each other, with her eyes filled with seductive charm and mischievous allure, gazing up at him with intent."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The high-pitched whistle of an approaching train pierces the air, signaling its impending arrival as it gradually slows to a complete stop, and Harry, eager and brisk, steps off the train with quick strides just as the doors slide open. Behind him, an attractive girl of similar age, Ruth Dakin, follows closely, maintaining a graceful pace as she disembarks. In the ensuing flurry of enthusiastic greetings, Ruth momentarily fades into the background, standing there with a warm smile, her presence almost forgotten as George and Uncle Billy stare in disbelief, George particularly struck with a sense of awe. In a moment of returning awareness, George reaches out, gently takes Ruth's hand, and, in a courteous gesture, kisses it. The camera smoothly follows their movement down the platform, capturing each step until George halts abruptly, a sinking sensation washing over him, while Uncle Billy and Ruth continue, gradually moving out of the shot. Harry pauses in sync with George, then with a sudden burst of energy, dashes out of the frame as George remains rooted in place, absorbed in watching him leave. Slowly, George starts to trail after Uncle Billy and Ruth, his mind deep in contemplation, as the camera aligns with his journey when he reappears in the scene. Ruth delicately separates herself from the group, her gesture inviting as she offers George some popcorn, her nod and smile extending warmth. Meanwhile, Cousin Eustace captures the family moment with a photograph on the porch, the flash bulbs momentarily illuminating the scene as the gathering begins to disperse, individuals filing through the front door of the house, leaving George and a slightly tipsy Uncle Billy remaining on the porch. Uncle Billy, feeling the effects, searches in confusion for his hat, oblivious to it resting on his head. With a slight smile, George gently retrieves the hat from Uncle Billy's head and hands it over as they both descend the porch steps, George guiding his uncle with a firm yet gentle turn, directing him down the street. Halting at the garden gate, George stands there, clearly unsettled by recent events as he pulls travel brochures from his pocket, glances at them with a hint of frustration, and decisively discards them. His mother steps out from the house, greets him with a kiss, and gestures towards the house where, through the open front door, Harry and Ruth, surrounded by other couples, dance in lively spirit to the music of a phonograph, the scene punctuated by a shared kiss. Mrs. Bailey affectionately places George's hat on his head before he stands in the middle of the street, hands tucked into his pockets, visibly wavering in his decision on what to do next. As a girl strolls by, George momentarily turns his attention to her, watching thoughtfully, while across the street, Violet finishes locking up for the night, her presence attracting a couple of men who vie for her attention. She glances up and notices George standing idly, and with determined grace, the camera follows Violet as she confidently crosses the street to join George. Violet, ever attentive to her beauty shop and her captivating allure, momentarily captivates George, who is acutely aware of her charm. Linking her arm with his, she accompanies him down the street, their steps synchronized until they eventually pause and face each other, Violet's eyes glinting with a seductive, playful gaze as she looks up at him expectantly."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the train stops, Harry disembarks, followed by Ruth Dakin, who stands smiling as greetings unfold, momentarily forgotten. George, thunderstruck, kisses Ruth’s hand, and they move along the platform. George pauses, feeling unsettled, as Uncle Billy and Ruth walk on, with Harry eventually continuing after them. George, deep in thought, follows. Ruth offers him popcorn, smiling, as Cousin Eustace captures a photo of the family on the porch. As the group disperses inside, leaving George and a tipsy Uncle Billy on the porch, George hands Uncle Billy his hat and guides him down the steps and along the street. At the garden gate, troubled by recent events, George discards travel brochures. His mother approaches, kisses him, and gestures toward the house, where Harry and Ruth dance and kiss among other couples. Mrs. Bailey places George's hat on his head, and he stands in the street, uncertain. He pauses to watch a girl pass and observes Violet, surrounded by admirers, locking up for the night. Noticing George, Violet crosses to him, her charm evident as she links arms with him. They walk together, stopping to face each other, her gaze seductive and alluring."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The whistle of an approaching train, a sound synonymous with anticipation and travel, is heard as the train comes to a stop at the bustling platform, and Harry, a recent college graduate full of youthful energy, is among the first to get off, followed by an attractive girl about the same age as he is, named Ruth Dakin. A newcomer to town, Ruth is momentarily forgotten in the excitement of greetings, standing and smiling, waiting, as George and Uncle Billy stare, astounded, with George thunderstruck by the sight of her. He takes Ruth's hand, recognizing her warmth and charm, and kisses her. The camera moves with them down the platform, but George stops with a sinking feeling, reminiscent of lost opportunities, while Uncle Billy and Ruth continue out of shot, and Harry stops with George before running out of the shot as George watches him. George slowly moves after Uncle Billy and Ruth, thinking deeply about his future, as the camera moves with him when he comes into the scene. Ruth detaches herself from the group and, with a friendly gesture, offers George some popcorn, nodding and smiling. Cousin Eustace, a budding photographer eager to capture family moments, takes a photograph of the family group assembled on the porch, and flash bulbs go off as the group breaks up, with the crowd entering the front door of the house, leaving George and Uncle Billy on the porch, the latter tipsy and feeling very high from celebrating with a bit too much punch. Uncle Billy, often forgetful, looks around for his hat, which is amusingly on his head, and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around, heading him down the street. George stands at the garden gate, obviously disturbed about the latest turn of events in his life, as he takes some travel folders from his pocket, once filled with dreams of adventure, looks at them, and throws them away in frustration. His mother comes out of the house and kisses him, offering comfort and understanding, nodding toward the house, where Harry and Ruth, among a crowd of other couples, are dancing to the lively music of a phonograph, a popular entertainment of their time, and are seen through the front door as they kiss. Mrs. Bailey, ever the caring matriarch, puts George's hat on his head, and George stands in the middle of the street, hands in pockets, obviously undecided about what he wants to do. As a girl passes, he turns to watch her for a moment, contemplating the endless possibilities, while Violet, known for her charming beauty shop that caters to the town's finest, is locking up for the night, with a couple of men crowding around her, each intent on taking her out for an evening of dance and laughter. She looks up and sees George standing there, and the camera pans with Violet as she crosses the street to George. Violet, who takes her beauty shop seriously and is an eyeful, is sensed by George to be far from immune to her attractions, as she links her arm in his and continues down the street with him. They walk until they stop and face one another, with her eyes seductive and guileful as she looks up at him, evoking a sense of youthful romance and possibility."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out He takes Ruth's hand and kisses her He takes Ruth's hand and kisses her The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him when he comes into the scene Ruth detaches herself from the group and offers George some popcorn nodding and smiling Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch the latter tipsy and feeling very high Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin. In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck. He takes Ruth's hand and kisses her. The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him. George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him. when he comes into the scene. Ruth detaches herself from the group and offers George some popcorn nodding and smiling. Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. the latter tipsy and feeling very high. Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street. George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away. His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss. Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do. As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out. She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George. Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin. In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck. He takes Ruth's hand and kisses her. The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him. George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him. when he comes into the scene. Ruth detaches herself from the group and offers George some popcorn nodding and smiling. Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. the latter tipsy and feeling very high. Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street. George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away. His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss. Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do. As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out. She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George. Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin. In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck. He takes Ruth's hand and kisses her. The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him. Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do. As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out. She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George. Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin. In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck. She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George. Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The whistle of an approaching train is heard as the train comes to a stop, and the parrot is among the first to get off, followed by an attractive girl about the same age as the parrot is, named Ruth Dakin. In the excitement of greetings, Ruth is momentarily forgotten, standing and smiling, waiting, as the lion and the panda stare, astounded, with the lion thunderstruck. The lion takes Ruth's hand and kisses her. The camera moves with them down the platform, but the lion stops with a sinking feeling while the panda and Ruth continue out of shot, and the parrot stops with the lion before running out of the shot as the lion watches the parrot. The lion slowly moves after the panda and Ruth, thinking deeply, as the camera moves with the lion when the lion comes into the scene. Ruth detaches herself from the group and offers the lion some popcorn, nodding and smiling. The giraffe takes a photograph of the family group assembled on the porch, and flash bulbs go off as the group breaks up, with the crowd entering the front door of the house, leaving the lion and the panda on the porch, the latter tipsy and feeling very high. The panda looks around for the panda's hat, which is on the panda's head, and the lion takes the hat from the panda's head and hands it to the panda as they descend the porch steps and the lion turns the panda around, heading the panda down the street. The lion stands at the garden gate, obviously disturbed about the latest turn of events, as the lion takes some travel folders from the lion's pocket, looks at them, and throws them away. The peacock comes out of the house and kisses the lion, nodding toward the house, where the parrot and Ruth, among a crowd of other couples, are dancing to the music of a phonograph, and are seen through the front door as they kiss. The peacock puts the lion's hat on the lion's head, and the lion stands in the middle of the street, hands in pockets, obviously undecided about what the lion wants to do. As a dolphin passes, the lion turns to watch the dolphin for a moment, while the kangaroo is locking up for the night, with a couple of men crowding around the kangaroo, each intent on taking the kangaroo out. The kangaroo looks up and sees the lion standing there, and the camera pans with the kangaroo as the kangaroo crosses the street to the lion. The kangaroo, who takes the kangaroo's beauty shop seriously and is an eyeful, is sensed by the lion to be far from immune to the kangaroo's attractions, as the kangaroo links the kangaroo's arm in the lion's and continues down the street with the lion until they stop walking and face one another, with the kangaroo's eyes seductive and guileful as the kangaroo looks up at the lion."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The whistle of an approaching steamship is heard as the steamship comes to a stop, and Harry is among the first to get off, followed by an attractive girl about the same age as he is, named Ruth Dakin. In the excitement of greetings, Ruth is momentarily forgotten, standing and smiling, waiting, as George and Uncle Billy stare, astounded, with George thunderstruck. He takes Ruth's hand and kisses her. The camera moves with them down the dock, but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot, and Harry stops with George before running out of the shot as George watches him. George slowly moves after Uncle Billy and Ruth, thinking deeply, as the camera moves with him when he comes into the scene. Ruth detaches herself from the group and offers George some cotton candy, nodding and smiling. Cousin Eustace takes a photograph of the family group assembled on the deck, and flash bulbs go off as the group breaks up, with the crowd entering the front door of the lodge, leaving George and Uncle Billy on the deck, the latter tipsy and feeling very high. Uncle Billy looks around for his umbrella, which is on his head, and George takes the umbrella from Uncle Billy's head and hands it to him as they descend the deck steps and George turns his uncle around, heading him down the avenue. George stands at the park gate, obviously disturbed about the latest turn of events, as he takes some magazine clippings from his pocket, looks at them, and throws them away. His mother comes out of the lodge and kisses him, nodding toward the lodge, where Harry and Ruth, among a crowd of other pairs, are dancing to the music of a jukebox, and are seen through the front door as they kiss. Mrs. Bailey puts George's umbrella on his head, and George stands in the middle of the avenue, hands in pockets, obviously undecided about what he wants to do. As a girl passes, he turns to watch her for a moment, while Violet is closing up for the night, with a couple of women crowding around her, each intent on taking her out. She looks up and sees George standing there, and the camera pans with Violet as she crosses the avenue to George. Violet, who takes her catering service seriously and is an eyeful, is sensed by George to be far from immune to her attractions, as she links her arm in his and continues down the avenue with him until they stop walking and face one another, with her eyes seductive and guileful as she looks up at him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The whistle of an approaching train is noted as the train increases speed, and Harry is among the first to remain seated, followed by an attractive girl about the same age as he is, named Ruth Dakin. In the excitement of greetings, Ruth is momentarily ignored, standing and waving, waiting, as George and Uncle Billy clap, astounded, with George bewildered. He shakes Ruth's hand and pats her. The camera shifts with them down the platform, but George hesitates with a hopeful feeling while Uncle Billy and Ruth proceed out of shot, and Harry pauses with George before strolling out of the shot as George observes him. George quickly follows Uncle Billy and Ruth, pondering deeply, as the camera shifts with him when he arrives into the scene. Ruth steps away from the group and shows George some popcorn, nodding and waving. Cousin Eustace sketches a portrait of the family group assembled on the porch, and flash bulbs flicker as the group disperses, with the crowd entering the front door of the house, leaving George and Uncle Billy on the porch, the latter excited and feeling very high. Uncle Billy searches for his hat, which is on his head, and George places the hat from Uncle Billy's head and offers it to him as they ascend the porch steps and George guides his uncle away, ushering him down the street. George leans on the garden gate, obviously puzzled about the latest turn of events, as he grabs some travel folders from his pocket, gazes at them, and crumples them. His mother emerges from the house and hugs him, nodding toward the house, where Harry and Ruth, among a crowd of other couples, are humming to the music of a phonograph, and are seen through the front door as they twirl. Mrs. Bailey places George's hat on his head, and George stands in the middle of the street, hands on hips, obviously uncertain about what he wants to do. As a girl approaches, he turns to nod at her for a moment, while Violet is closing up for the night, with a couple of men gathering around her, each intent on asking her out. She looks up and spots George standing there, and the camera tilts with Violet as she approaches the street to George. Violet, who takes her beauty shop seriously and is captivating, is noticed by George to be far from immune to her attractions, as she slips her arm in his and proceeds down the street with him until they pause walking and face one another, with her eyes enticing and mischievous as she glances up at him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The whistle of an incoming helicopter is heard as the helicopter comes to a halt, and Emma is among the first to get off, followed by a charming dolphin about the same age as she is, named Sam Whistleblower. In the excitement of greetings, Sam is momentarily forgotten, standing and giggling, waiting, as Edward and Aunt Lucy stare, astounded, with Edward dumbfounded. He takes Sam's umbrella and waves it. The kite moves with them down the alley, but Edward stops with a sinking feeling while Aunt Lucy and Sam continue out of sight, and Emma stops with Edward before leaping out of the scene as Edward observes her. Edward slowly moves after Aunt Lucy and Sam, pondering deeply, as the kite moves with him when he arrives in the setting. Sam detaches himself from the crew and offers Edward some doughnuts, nodding and giggling. Neighbor Bartholomew takes a sketch of the chess club gathered on the roof, and flash bulbs pop as the club disperses, with the ensemble entering the side door of the shed, leaving Edward and Aunt Lucy on the roof, the latter tipsy and feeling very light. Aunt Lucy looks around for her umbrella, which is on her elbow, and Edward takes the umbrella from Aunt Lucy's elbow and hands it to her as they descend the roof stairs and Edward turns his aunt around, guiding her down the avenue. Edward stands at the flower pot gate, obviously perturbed about the latest turn of events, as he takes some recipe cards from his sleeve, glances at them, and hurls them away. His neighbor emerges from the shed and hugs him, nodding toward the shed, where Emma and Sam, among a crowd of other singers, are jogging to the music of a saxophone, and are seen through the side door as they embrace. Ms. Higgins places Edward's umbrella on his elbow, and Edward stands in the middle of the field, hands in cuffs, obviously unsure about what he wants to do. As a turtle passes, he turns to observe it for a moment, while Daisy is closing up for the night, with a pair of goats crowding around her, each eager on taking her out. She glances up and spots Edward standing there, and the kite pans with Daisy as she crosses the field to Edward. Daisy, who takes her candy store seriously and is an eyeful, is sensed by Edward to be far from immune to her charm, as she links her elbow in his and continues through the field with him until they halt and face each other, with her eyes mesmerizing and crafty as she gazes up at him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The horn of an arriving ship is heard as the ship sails to a halt, and Oliver is among the first to swim away, followed by a charismatic teenager about the same age as he is, named Clara Wilson. In the chaos of introductions, Clara is momentarily overlooked, standing and grinning, observing, as David and Aunt Sally gaze, flabbergasted, with David bewildered. He shakes Clara's hand and hugs her. The lens shifts with them along the pier, but David pauses with an anxious feeling while Aunt Sally and Clara continue out of view, and Oliver freezes with David before gliding out of the frame as David observes him. David gradually paces after Aunt Sally and Clara, pondering deeply, as the footage tracks with him when he enters the scene. Clara disentangles herself from the group and hands David some candy, nodding and laughing. Cousin Bert sketches a picture of the family gathering assembled on the terrace, and shutters click as the gathering disperses, with the crowd entering the back door of the residence, leaving David and Aunt Sally on the terrace, the latter jubilant and feeling quite cheerful. Aunt Sally glances around for her scarf, which is on her shoulder, and David removes the scarf from Aunt Sally's shoulder and returns it to her as they climb down the terrace steps and David directs his aunt forward, steering her along the path. David stands at the orchard gate, clearly puzzled about the most recent turn of events, as he withdraws some postcards from his bag, examines them, and sets them aside. His sister emerges from the residence and hugs him, gesturing toward the house, where Oliver and Clara, amidst a crowd of other friends, are swaying to the music of a radio, and are seen through the side door as they embrace. Mrs. Bailey places David's scarf around his neck, and David stands in the middle of the pathway, hands on hips, clearly unsure about his next move. As a boy passes, he turns to watch him for a second, while Emily is closing up for the night, with a group of women gathering around her, each keen on inviting her out. She glances up and notices David standing there, and the camera follows Emily as she crosses the street to David. Emily, who treats her diner sincerely and is a sight to behold, is perceived by David to be far from resistant to her allure, as she intertwines her arm with his and proceeds down the street with him until they halt and face each other, with her eyes alluring and cunning as she gazes up at him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The horn of an approaching boat is heard as the boat drifts to a halt, and Harry is among the first to climb off, followed by an appealing girl about the same age as he is, named Ruth Dakin. In the commotion of farewells, Ruth is momentarily overlooked, standing and grinning, waiting, as George and Uncle Billy blink, perplexed, with George astounded. He takes Ruth's hand and shakes it. The camera glides with them down the boardwalk, but George pauses with a sinking feeling while Uncle Billy and Ruth continue out of frame, and Harry pauses with George before darting out of the frame as George observes him. George leisurely wanders after Uncle Billy and Ruth, pondering deeply, as the camera glides with him when he emerges into the scene. Ruth steps aside from the group and offers George some candies, nodding and smiling. Cousin Eustace sketches a portrait of the family group assembled on the lawn, and sparklers go off as the group disperses, with the crowd entering the front door of the house, leaving George and Uncle Billy on the porch, the latter groggy and feeling very light. Uncle Billy glances around for his cane, which is in his hand, and George takes the cane from Uncle Billy's hand and hands it to him as they ascend the porch steps and George pivots his uncle around, leading him up the street. George stands at the garden gate, visibly rattled about the recent twist of events, as he takes some postcards from his pocket, glances at them, and discards them. His mother comes out of the house and hugs him, pointing toward the house, where Harry and Ruth, among a crowd of other pairs, are swaying to the music of a gramophone, and are seen through the front door as they embrace. Mrs. Bailey places George's umbrella on his shoulder, and George stands in the center of the street, hands in pockets, clearly uncertain about what he intends to do. As a girl strolls by, he turns to glance at her for a moment, while Violet is tidying up for the night, with a couple of men congregating around her, each eager to walk her home. She looks up and sees George standing there, and the camera pans with Violet as she strides across the street to George. Violet, who takes her fashion store seriously and is a spectacle, is sensed by George to be far from unpopular to her charms, as she hooks her arm in his and continues up the street with him until they halt walking and face one another, with her eyes alluring and artful as she gazes up at him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The screech of a distant eagle is noticed as the eagle lands on a branch, and Jasper is among the first to leap off, followed by a dazzling penguin about the same height as he is, named Louisa Fern. In the thrill of introductions, Louisa is temporarily overlooked, hopping and grinning, waiting, as Oliver and Aunt Marge gaze, flabbergasted, with Oliver dumbfounded. He grabs Louisa's wing and hugs her. The lens shifts with them along the runway, but Oliver halts with a heavy heart while Aunt Marge and Louisa drift out of sight, and Jasper pauses with Oliver before dashing out of view as Oliver observes him. Oliver sluggishly drifts after Aunt Marge and Louisa, pondering deeply, as the lens slides with him when he merges into the picture. Louisa detaches herself from the circle and gives Oliver some ice cream, nodding and beaming. Brother Horace sketches a portrait of the friend circle gathered on the terrace, and fireworks explode as the group disperses, with the swarm stepping into the main door of the lodge, leaving Oliver and Aunt Marge on the terrace, the latter giggling and feeling quite merry. Aunt Marge scans around for her umbrella, which is in her hand, and Oliver takes the umbrella from Aunt Marge's hand and hands it to her as they trudge down the garden path and Oliver spins his aunt around, directing her down the alley. Oliver stands at the orchard fence, clearly puzzled about the latest twist of circumstances, as he pulls some postcards from his backpack, gazes at them, and discards them. His father emerges from the cabin and hugs him, gesturing toward the cabin, where Jasper and Louisa, among a group of other friends, are jiving to the melody of a stereo, and are glimpsed through the doorway as they embrace. Mr. Creighton places Oliver's umbrella on his shoulder, and Oliver stands in the middle of the meadow, hands on hips, clearly uncertain about what he intends to pursue. As a cat saunters by, he spins to observe it briefly, while Daisy is closing up for the evening, with a pair of foxes clustering beside her, each eager to join her for a stroll. She glances up and notices Oliver standing there, and the lens follows Daisy as she crosses the meadow to Oliver. Daisy, who takes her garden shop earnestly and is quite a sight, is perceived by Oliver to be far from indifferent to her charms, as she entwines her tail with his and continues along the road with him until they cease wandering and face each other, her gaze enticing and sly as she peers up at him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As the train arrives, Harry disembarks first, followed by his attractive contemporary, Ruth Dakin. Amid the flurry of greetings, Ruth stands momentarily forgotten, smiling. George, astonished, kisses her hand. George experiences mixed emotions as he pauses while Uncle Billy and Ruth move on. Ruth offers him popcorn, smiling, as Cousin Eustace captures a family photo. Inside, Harry and Ruth dance among other couples, visible through the front door. George is clearly troubled by recent events; he stands at the porch, discarding travel brochures, and watches his mother gesture to the dancing crowd. Conflicted, George lingers in the street. As he observes a passing girl, he notices Violet, surrounded by admirers. She approaches George, linking arms with him, exuding allure. They walk together and face each other as Violet's eyes reveal her intentions."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street the latter tipsy and feeling very high Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch Ruth detaches herself from the group and offers George some popcorn nodding and smiling when he comes into the scene George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him He takes Ruth's hand and kisses her In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street when he comes into the scene Ruth detaches herself from the group and offers George some popcorn nodding and smiling She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do the latter tipsy and feeling very high In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck He takes Ruth's hand and kisses her As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "the latter tipsy and feeling very high Uncle Billy looks around for his hat which is on his head and George takes the hat from Uncle Billy's head and hands it to him as they descend the porch steps and George turns his uncle around heading him down the street George stands at the garden gate obviously disturbed about the latest turn of events as he takes some travel folders from his pocket looks at them and throws them away His mother comes out of the house and kisses him nodding toward the house where Harry and Ruth among a crowd of other couples are dancing to the music of a phonograph and are seen through the front door as they kiss Mrs Bailey puts George's hat on his head and George stands in the middle of the street hands in pockets obviously undecided about what he wants to do As a girl passes he turns to watch her for a moment while Violet is locking up for the night with a couple of men crowding around her each intent on taking her out She looks up and sees George standing there and the camera pans with Violet as she crosses the street to George Violet who takes her beauty shop seriously and is an eyeful is sensed by George to be far from immune to her attractions as she links her arm in his and continues down the street with him until they stop walking and face one another with her eyes seductive and guileful as she looks up at him The whistle of an approaching train is heard as the train comes to a stop and Harry is among the first to get off followed by an attractive girl about the same age as he is named Ruth Dakin In the excitement of greetings Ruth is momentarily forgotten standing and smiling waiting as George and Uncle Billy stare astounded with George thunderstruck He takes Ruth's hand and kisses her The camera moves with them down the platform but George stops with a sinking feeling while Uncle Billy and Ruth continue out of shot and Harry stops with George before running out of the shot as George watches him George slowly moves after Uncle Billy and Ruth thinking deeply as the camera moves with him when he comes into the scene Ruth detaches herself from the group and offers George some popcorn nodding and smiling Cousin Eustace takes a photograph of the family group assembled on the porch and flash bulbs go off as the group breaks up with the crowd entering the front door of the house leaving George and Uncle Billy on the porch"
        }
      ]
    }
  ]
}