{
  "ground_truth": "Romantic music tinnily plays as Delmar and Everett watch, with Everett slumped down and angrily hissing, in a dark and quiet theater where they, along with the rest of the sparse audience, look restively about. A man carrying a shotgun enters the auditorium, walks halfway down the aisle, and stops several rows behind Delmar and Everett, scanning the theater before bringing a whistle to his lips. At his whistle, the back doors burst open, and a line of chained men trot in at double-time, filing into one row and then, when filled, the row behind it, remaining silently on their feet. The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again, causing the two rows of chained men to sit. One more whistle cues the movie to grind back up to speed. A hissing whisper from behind draws Everett and Delmar's attention, causing Everett, with jaw hanging open, to stare as if at a ghost, while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and cocks his head as if to ask, \"What was that?\" Delmar repeats the whisper slowly and with exaggerated mouth movements, but Pete shakes his head, indicating he didn't catch it, and repeats, also overarticulating. Meanwhile, Pappy O'Daniel sits on the veranda of the Governor's Mansion, smoking a cigar and sipping bourbon as the evening sun sets; he reacts quizzically to a whispered conversation, looking sadly from one person to another, like a spectator at a dull tennis match. A moment later, Everett rises over the lip of his bed, his face blackened and swaying as if on a boat, raising a large, long-armed, short-nosed pincering tool, which he locks onto Pete's chain and levers free. As Pete's hand chinks free, he doesn't react to his newfound liberty, instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett, who looks profoundly uncomfortable. Now, stunned, Pete and Delmar stare at Everett, with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett, and with his hands wrapped around Everett's throat, the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. Pete, Everett, and Delmar hastily crabwalk back into the bushes before pushing through together.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Romantic melody tinnily plays as Delmar and Everett observe, with Everett slumped down and angrily hissing, in a shadowy and tranquil cinema where they, along with the rest of the sparse audience, gaze restively around. A gentleman carrying a shotgun enters the auditorium, strides halfway down the aisle, and halts several rows behind Delmar and Everett, scanning the theater before bringing a whistle to his lips. At his whistle, the back doors burst open, and a line of shackled men trot in at double-time, filing into one row and then, when filled, the row behind it, remaining silently on their feet. The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again, causing the two rows of shackled men to sit. One more whistle cues the film to grind back up to speed. A hissing murmur from behind draws Everett and Delmar's attention, causing Everett, with jaw hanging open, to stare as if at a ghost, while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and tilts his head as if to inquire, \"What was that?\" Delmar repeats the murmur slowly and with exaggerated mouth movements, but Pete shakes his head, indicating he didn't catch it, and repeats, also overarticulating. Meanwhile, Pappy O'Daniel sits on the veranda of the Governor's Mansion, smoking a stogie and sipping bourbon as the evening sun sets; he reacts quizzically to a whispered conversation, looking sadly from one person to another, like a spectator at a dull tennis match. A moment later, Everett rises over the edge of his bunk, his face blackened and swaying as if on a boat, raising a large, long-armed, short-nosed pincering tool, which he locks onto Pete's chain and levers free. As Pete's hand chinks free, he doesn't react to his newfound liberty, instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett, who looks profoundly uncomfortable. Now, stunned, Pete and Delmar gaze at Everett, with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett, and with his hands wrapped around Everett's throat, the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open expanse where men in bedsheets parade in formation before a huge fiery cross. Pete, Everett, and Delmar hastily crabwalk back into the shrubs before pushing through together."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Romantic music is tinnily played as Delmar and Everett are watched, with Everett slumped down and angrily hissing, in a dark and quiet theater where the rest of the sparse audience looks restively about. The auditorium is entered by a man carrying a shotgun, and he walks halfway down the aisle before stopping several rows behind Delmar and Everett, scanning the theater before a whistle is brought to his lips. At his whistle, the back doors are burst open, and a line of chained men is trotted in at double-time, filing into one row and then, when filled, the row behind it, remaining silently on their feet. The convicts are escorted into the theater by the first guard and two others, who scan the theater before the first guard blows his whistle again, causing the two rows of chained men to sit. One more whistle grinds the movie back up to speed. A hissing whisper from behind draws Everett and Delmar's attention, causing Everett, with jaw hanging open, to stare as if at a ghost, while Delmar also stares but finally acknowledges Pete's corporeal reality. As if to ask, \"What was that?\" Pete squints and cocks his head. The whisper is repeated slowly and with exaggerated mouth movements by Delmar, but Pete shakes his head, indicating he didn't catch it, and repeats, also overarticulating. Meanwhile, the veranda of the Governor's Mansion is occupied by Pappy O'Daniel, who sits smoking a cigar and sipping bourbon as the evening sun sets; a whispered conversation is reacted to quizzically by him, looking sadly from one person to another, like a spectator at a dull tennis match. A moment later, over the lip of his bed rises Everett, with his face blackened and swaying as if on a boat, raising a large, long-armed, short-nosed pincering tool, which is locked onto Pete's chain and levered free by him. As Pete's hand chinks free, his newfound liberty doesn't cause a reaction from him; instead, Everett's eyes are burned into while he shakes his head miserably and weeps. A stunned Delmar is hugged by Pete and then Everett, who looks profoundly uncomfortable. Now, stunned, Everett is stared at by Pete and Delmar, with Delmar brightening and Pete suddenly lunging at Everett. Everett is tackled by Pete, and with Pete's hands wrapped around Everett's throat, they roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. The bushes are hastily crabwalked back into by Pete, Everett, and Delmar before they push through together."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Romantic music plays as Delmar and Everett watch in a dark theater, with Everett slumped and hissing angrily. A man with a shotgun enters, stops behind them, and whistles, prompting chained men to enter and fill rows. Guards scan the theater, and another whistle makes the men sit. A final whistle resumes the movie. A whisper draws Everett and Delmar's attention, and they stare at Pete, who squints and gestures confusion. Delmar repeats the whisper, but Pete doesn't understand and overarticulates back. Meanwhile, Pappy O'Daniel sits on the Governor's Mansion veranda, smoking and sipping bourbon, reacting to a whispered conversation. Everett rises from his bed, face blackened, and uses a tool to free Pete's chain. Pete, weeping, hugs Delmar and Everett, who looks uncomfortable. Stunned, Pete and Delmar stare at Everett, with Delmar brightening and Pete lunging at Everett. Pete tackles Everett, and they roll into a clearing, revealing men in bedsheets parading before a fiery cross. They hastily retreat into the bushes together."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Romantic music plays as Delmar and Everett watch in a dark theater, with Everett angrily hissing. A man with a shotgun enters, stops behind them, and whistles, prompting chained men to enter and stand silently. Guards scan the theater, and another whistle makes the men sit. A whisper draws Everett and Delmar's attention to Pete, who they recognize. Meanwhile, Pappy O'Daniel sits on the Governor's Mansion veranda, smoking and sipping bourbon, reacting to a whispered conversation. Everett rises, blackened, and frees Pete with a tool. Pete, weeping, hugs Delmar and Everett, who looks uncomfortable. Stunned, Pete and Delmar stare at Everett, then Pete lunges at him. They roll into a clearing, seeing men in bedsheets parading before a fiery cross, then retreat into the bushes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Romantic music plays softly and tinnily in the background as Delmar and Everett sit in a dark and quiet theater. Everett is slumped down in his seat, angrily hissing under his breath. The theater is sparsely populated, and the audience, including Delmar and Everett, looks around restively. Suddenly, a man carrying a shotgun enters the auditorium. He walks halfway down the aisle and stops several rows behind Delmar and Everett. He scans the theater carefully before bringing a whistle to his lips. At the sound of his whistle, the back doors burst open, and a line of chained men trots in at double-time. They file into one row, and when that row is filled, they move to the row behind it, remaining silently on their feet. The first guard, along with two others who escorted the convicts, scans the theater once more. The first guard then blows his whistle again, prompting the two rows of chained men to sit down. Another whistle signals the movie to resume, grinding back up to speed. A hissing whisper from behind catches the attention of Everett and Delmar. Everett, with his jaw hanging open, stares as if he has seen a ghost, while Delmar also stares but eventually acknowledges Pete's physical presence. Pete squints and cocks his head, as if to silently ask, \"What was that?\" Delmar repeats the whisper slowly, exaggerating his mouth movements, but Pete shakes his head, indicating he didn't understand, and repeats, also overarticulating. Meanwhile, Pappy O'Daniel is seated on the veranda of the Governor's Mansion. He is smoking a cigar and sipping bourbon as the evening sun sets. He reacts quizzically to a whispered conversation, looking sadly from one person to another, much like a spectator at a dull tennis match. A moment later, Everett rises over the edge of his bed, his face blackened and swaying as if he were on a boat. He raises a large, long-armed, short-nosed pincering tool, which he uses to lock onto Pete's chain and lever it free. As Pete's hand is released, he doesn't react to his newfound liberty. Instead, he locks eyes with Everett, shaking his head miserably and weeping. Pete then hugs a stunned Delmar and moves on to hug Everett, who looks profoundly uncomfortable. Now, both Pete and Delmar, still stunned, stare at Everett. Delmar brightens, and Pete suddenly lunges at Everett. Pete tackles Everett, and with his hands wrapped around Everett's throat, the two roll through some brush into a clearing where they abruptly stop. Their view reveals a vast open field where men in bedsheets parade in formation before a huge, fiery cross. Pete, Everett, and Delmar hastily crabwalk back into the bushes before pushing through together."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the dimly lit and almost empty theater, the delicate strains of romantic music drift softly and tinnily through the background, barely audible yet setting a faint atmosphere as Delmar and Everett sit quietly. The environment around them is dark and hushed, with Everett slumped low in his seat, quietly and angrily hissing under his breath in evident agitation. The theater is noticeably sparsely populated, and the scattered audience members, including Delmar and Everett, glance around restlessly, as if anticipating something. Suddenly, tension mounts as a man, conspicuously carrying a shotgun, strides into the auditorium. He proceeds halfway down the aisle and halts several rows behind where Delmar and Everett are seated. Carefully, he scans the entire theater before bringing a whistle up to his lips with intent. At the piercing sound of his whistle, the rear doors abruptly swing open, and a line of men, shackled in chains, is ushered in at a brisk trot, maintaining a quickened, double-time pace. They systematically file into one row, and as soon as that row fills to capacity, they continue to the row behind it, standing silently. The initial guard, together with two additional escorts who accompany the convicts, surveys the theater once again. The primary guard then blows his whistle a second time, signaling the chained men to take their seats. Another sharp whistle cues the movie to resume, grinding its way back up to speed. A hissing whisper from the row behind unexpectedly captures the attention of Everett and Delmar. With his jaw hanging open in disbelief, Everett gazes as if he has encountered a ghost, while Delmar also looks on, eventually acknowledging Pete's presence with clarity. Pete, squinting and tilting his head slightly, appears to silently inquire, \"What just happened?\" Delmar slowly repeats the whisper, exaggeratedly moving his mouth, yet Pete shakes his head to signal he hasn’t understood, and he too articulates slowly. Meanwhile, in the contrasting setting of the veranda at the Governor's Mansion, Pappy O'Daniel sits comfortably. He is enjoying a cigar and sipping bourbon as the warm evening sun sets beyond the horizon. Quizzically, he reacts to a whispered conversation, casting a sad glance from one person to another, his expression resembling that of a spectator at a monotonous tennis match. In the next moment, Everett emerges over the edge of his bed, his face obscured with soot and wavering unsteadily as though on a swaying boat. With a large, long-armed clipping tool in hand, he expertly fastens onto Pete's chain, deftly leveraging it to unlock and free it. As Pete’s hand is liberated, he does not immediately embrace his newfound freedom. Instead, he fixes his gaze on Everett, shaking his head despondently and succumbing to tears. Pete then envelops a startled Delmar in a heartfelt embrace and moves on to hug Everett, who appears profoundly uneasy in the moment. Now, both Pete and Delmar continue to gaze, still stunned, at Everett. A spark of brightness appears in Delmar’s eyes, just as Pete suddenly launches himself at Everett. The force of Pete’s tackle sends both of them tumbling, Everett with Pete’s hands gripping his throat, rolling through some brush until they come to an abrupt halt in a clearing. There, their eyes meet an expansive open field where figures in bedsheets are parading in regimented formation before a towering, blazing cross. In haste, Pete, Everett, and Delmar crabwalk backward into the bushes for cover, before pushing through and retreating together."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Romantic music plays softly in the background as Delmar and Everett sit in a dark and quiet theater, with Everett slumped down in his seat, angrily hissing under his breath. They, along with the sparse audience scattered throughout the theater, look around restlessly, their eyes darting about the dimly lit room. Suddenly, a man carrying a shotgun enters the auditorium, his footsteps echoing as he walks halfway down the aisle. He stops several rows behind Delmar and Everett, his eyes scanning the theater with a scrutinizing gaze before he brings a whistle to his lips. The sharp sound of the whistle pierces the air, and the back doors burst open with a loud bang. A line of chained men, moving at a brisk double-time pace, trot into the theater, filing into one row and then, when that row is filled, into the row behind it. They remain silently on their feet, their chains clinking softly in the quiet. The first guard, along with two others who escorted the convicts, surveys the theater once more before the first guard blows his whistle again. This signal prompts the two rows of chained men to sit down in unison. Another whistle blast cues the movie to resume, the film projector grinding back up to speed. A hissing whisper from behind catches Everett and Delmar's attention, causing Everett to turn, his jaw dropping open as he stares in disbelief, as if seeing a ghost. Delmar also turns to look, his eyes widening as he finally acknowledges Pete's physical presence. Pete squints and tilts his head slightly, as if silently asking, \"What was that?\" Delmar repeats the whisper slowly, exaggerating his mouth movements to make it clearer, but Pete shakes his head, indicating he didn't understand, and repeats the whisper himself, also overarticulating. Meanwhile, in a different setting, Pappy O'Daniel sits on the veranda of the Governor's Mansion, leisurely smoking a cigar and sipping bourbon as the evening sun sets. He reacts with a puzzled expression to a whispered conversation nearby, his eyes moving sadly from one person to another, resembling a spectator at a dull tennis match. Back in the theater, a moment later, Everett rises over the edge of his bed, his face blackened and swaying as if he were on a boat. He raises a large, long-armed, short-nosed pincering tool, which he uses to lock onto Pete's chain and lever it free. As Pete's hand is released from the chain with a metallic chink, he doesn't immediately react to his newfound freedom. Instead, he locks eyes with Everett, shaking his head miserably and beginning to weep. Overcome with emotion, Pete hugs a stunned Delmar and then turns to embrace Everett, who appears profoundly uncomfortable with the gesture. Now, with a sense of shock lingering in the air, Pete and Delmar stare at Everett, Delmar's face brightening with realization. Suddenly, Pete lunges at Everett, tackling him to the ground. With his hands wrapped tightly around Everett's throat, the two roll through some brush, their bodies tumbling into a clearing where they come to an abrupt stop. Their eyes widen as they take in the sight before them: a vast open field where men dressed in bedsheets parade in formation, a huge fiery cross towering over the scene. In a panic, Pete, Everett, and Delmar hastily crabwalk backward into the bushes, their movements frantic as they push through the undergrowth together, seeking cover from the unsettling spectacle."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Romantic music plays softly as Delmar and Everett sit in a dark, quiet theater, with Everett slumped and hissing angrily. The sparse audience, including them, looks around restlessly. A man with a shotgun enters, stops behind them, and scans the theater before blowing a whistle. At this signal, the back doors open, and a line of chained men enters, filing silently into rows. The guards scan the theater, and another whistle prompts the men to sit, followed by a third whistle that resumes the movie. A whisper from behind catches Everett and Delmar's attention, leading Everett to stare in shock while Delmar acknowledges Pete's presence. Pete, confused, tries to understand Delmar's exaggerated whisper, but they fail to communicate. Meanwhile, Pappy O'Daniel sits on the Governor's Mansion veranda, smoking and sipping bourbon, reacting quizzically to a whispered conversation. Later, Everett, with a blackened face, uses a tool to free Pete from his chains. Pete, overwhelmed, locks eyes with Everett, weeping, then hugs a stunned Delmar and an uncomfortable Everett. Stunned, Pete and Delmar watch Everett, with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett, and they roll into a clearing, stopping abruptly to see men in bedsheets parading before a fiery cross. The trio quickly retreats into the bushes before pushing through together."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the dimly lit theater, a relic from a bygone era when movies were a primary form of entertainment, romantic music tinnily plays as Delmar and Everett watch, with Everett slumped down and angrily hissing, surrounded by the vintage velvet seats that creak with age. This theater, like many small-town cinemas struggling to survive, is sparsely populated, and the audience looks restively about. A man carrying a shotgun, likely a prison guard, enters the auditorium, walks halfway down the aisle, and stops several rows behind Delmar and Everett, scanning the theater diligently before bringing a whistle to his lips. At his whistle, the back doors burst open, and a line of chained men, prisoners likely on work release or in transit, trot in at double-time, filing into one row and then, when filled, the row behind it, remaining silently on their feet, a testament to their strict discipline. The first guard and two others who escorted in the convicts scan the theater, ensuring order, before the first guard blows his whistle again, prompting the two rows of chained men to sit. One more whistle cues the movie to grind back up to speed. A hissing whisper from behind draws Everett and Delmar's attention, causing Everett, with jaw hanging open, to stare as if at a ghost from his past, while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and cocks his head, perplexed and curious, as if to ask, \"What was that?\" Delmar repeats the whisper slowly and with exaggerated mouth movements, but Pete shakes his head, indicating he didn't catch it, and repeats, also overarticulating. Meanwhile, Pappy O'Daniel, the fictional governor based on a famous Texas politician known for his folksy radio persona, sits on the veranda of the Governor's Mansion, smoking a cigar and sipping bourbon, a nod to Southern hospitality, as the evening sun sets; he reacts quizzically to a whispered conversation, looking sadly from one person to another, like a spectator at a dull tennis match. A moment later, Everett rises over the lip of his bed, his face blackened and swaying as if on a boat, raising a large, long-armed, short-nosed pincering tool, a device likely borrowed from a local mechanic’s shop, which he locks onto Pete's chain and levers free. As Pete's hand chinks free, he doesn't react to his newfound liberty, instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett, who looks profoundly uncomfortable at the sudden show of emotion. Now, stunned, Pete and Delmar stare at Everett, with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett, and with his hands wrapped around Everett's throat, the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets, members of a notorious group known for their secretive and nefarious gatherings, parade in formation before a huge fiery cross, a symbol of their feared and reviled organization. Pete, Everett, and Delmar hastily crabwalk back into the bushes, trying to remain unseen, before pushing through together."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips  At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet  The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit  One more whistle cues the movie to grind back up to speed  A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality  Pete squints and cocks his head as if to ask What was that  Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he didn't catch it and repeats also overarticulating  Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon  as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match  Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about  A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips  At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet  The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit  One more whistle cues the movie to grind back up to speed  A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality  Pete squints and cocks his head as if to ask What was that  Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he didn't catch it and repeats also overarticulating  Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon  as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match  A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free  As Pete's hand chinks free he doesn't react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping  Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable  Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett  Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop  Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross  Pete  Everett and Delmar hastily crabwalk back into the bushes before pushing through together"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about. A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips. At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet. The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit. One more whistle cues the movie to grind back up to speed. A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and cocks his head as if to ask What was that. Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he did not catch it and repeats also overarticulating. Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match. A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free. As Pete's hand chinks free he does not react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable. Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. Pete. Everett and Delmar hastily crabwalk back into the bushes before pushing through together."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about. A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips. At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet. The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit. One more whistle cues the movie to grind back up to speed. A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and cocks his head as if to ask What was that. Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he did not catch it and repeats also overarticulating. Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match. A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free. As Pete's hand chinks free he does not react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable. Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. Pete. Everett and Delmar hastily crabwalk back into the bushes before pushing through together."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about. A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips. At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet. The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit. One more whistle cues the movie to grind back up to speed. Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. Pete. Everett and Delmar hastily crabwalk back into the bushes before pushing through together."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about. A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips. Pete. Everett and Delmar hastily crabwalk back into the bushes before pushing through together."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Romantic music tinnily plays as a cat and a dog watch, with the dog slumped down and angrily hissing, in a dark and quiet theater where they, along with the rest of the sparse audience, look restively about. A rabbit carrying a shotgun enters the auditorium, walks halfway down the aisle, and stops several rows behind the cat and the dog, scanning the theater before bringing a whistle to its lips. At its whistle, the back doors burst open, and a line of chained elephants trot in at double-time, filing into one row and then, when filled, the row behind it, remaining silently on their feet. The first owl and two others who escorted in the convicts scan the theater before the first owl blows its whistle again, causing the two rows of chained elephants to sit. One more whistle cues the movie to grind back up to speed. A hissing whisper from behind draws the dog and the cat's attention, causing the dog, with jaw hanging open, to stare as if at a ghost, while the cat also stares but finally acknowledges a turtle's corporeal reality. The turtle squints and cocks its head as if to ask, \"What was that?\" The cat repeats the whisper slowly and with exaggerated mouth movements, but the turtle shakes its head, indicating it didn't catch it, and repeats, also overarticulating. Meanwhile, a penguin sits on the veranda of the Governor's Mansion, smoking a cigar and sipping bourbon as the evening sun sets; it reacts quizzically to a whispered conversation, looking sadly from one person to another, like a spectator at a dull tennis match. A moment later, the dog rises over the lip of its bed, its face blackened and swaying as if on a boat, raising a large, long-armed, short-nosed pincering tool, which it locks onto the turtle's chain and levers free. As the turtle's hand chinks free, it doesn't react to its newfound liberty, instead burning its eyes into the dog's while shaking its head miserably and weeping. The turtle hugs a stunned cat and then the dog, who looks profoundly uncomfortable. Now, stunned, the turtle and the cat stare at the dog, with the cat brightening and the turtle suddenly lunging at the dog. The turtle tackles the dog, and with its hands wrapped around the dog's throat, the two roll through some brush into a clearing where they abruptly stop. Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross. The turtle, the dog, and the cat hastily crabwalk back into the bushes before pushing through together."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Romantic music softly plays as Delmar and Everett watch, with Everett slumped down and angrily hissing, in a dim and cozy library where they, along with the rest of the sparse readers, look restively about. A man carrying a violin enters the reading room, walks halfway down the aisle, and stops several shelves behind Delmar and Everett, scanning the room before bringing a harmonica to his lips. At his whistle, the side doors bust open, and a line of chained women trot in at double-time, filing into one table and then, when filled, the table behind it, remaining silently on their feet. The first musician and two others who escorted in the newcomers scan the room before the first musician blows his harmonica again, causing the two tables of chained women to sit. One more whistle cues the projector to grind back up to speed. A hissing whisper from behind draws Everett and Delmar's attention, causing Everett, with jaw hanging open, to stare as if at a ghost, while Delmar also stares but finally acknowledges Pete's corporeal reality. Pete squints and cocks his head as if to ask, \"What was that?\" Delmar repeats the whisper slowly and with exaggerated mouth movements, but Pete shakes his head, indicating he didn't catch it, and repeats, also overarticulating. Meanwhile, Pappy O'Daniel sits on the porch of the Artist's Studio, smoking a cigarette and sipping coffee as the evening sun sets; he reacts quizzically to a whispered conversation, looking sadly from one person to another, like a spectator at a dull chess match. A moment later, Everett rises over the edge of his hammock, his face blackened and swaying as if on a raft, raising a large, long-armed, short-nosed picking tool, which he locks onto Pete's rope and levers free. As Pete's hand unclasps, he doesn't react to his newfound liberty, instead burning his eyes into Everett's while shaking his head miserably and weeping. Pete hugs a stunned Delmar and then Everett, who looks profoundly uncomfortable. Now, stunned, Pete and Delmar stare at Everett, with Delmar brightening and Pete suddenly lunging at Everett. Pete tackles Everett, and with his hands wrapped around Everett's shoulders, the two roll through some leaves into a clearing where they abruptly stop. Their view reveals a great open garden where women in aprons parade in formation before a huge fiery sculpture. Pete, Everett, and Delmar hastily crabwalk back into the hedges before pushing through together."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Romantic music faintly crackles as Delmar and Everett observe, with Everett collapsed down and quietly murmuring, in a dim and still theater where they, along with the rest of the scattered audience, glance aimlessly about. A man holding a shotgun enters the auditorium, strolls halfway down the aisle, and pauses several rows behind Delmar and Everett, surveying the theater before lifting a whistle to his lips. At his whistle, the back doors swing open, and a line of chained men shuffle in at a brisk pace, slipping into one row and then, when filled, the row behind it, standing silently. The first guard and two others who accompanied the convicts glance around the theater before the first guard toots his whistle again, prompting the two rows of chained men to lean. One more whistle prompts the movie to flicker back to life. A soft whisper from behind captures Everett and Delmar's attention, causing Everett, with mouth agape, to gaze as if at a ghost, while Delmar also gazes but ultimately acknowledges Pete's presence. Pete narrows his eyes and tilts his head as if to say, \"What was that?\" Delmar repeats the whisper slowly and with exaggerated mouth movements, but Pete shakes his head, indicating he missed it, and repeats, also overemphasizing. Meanwhile, Pappy O'Daniel reclines on the veranda of the Governor's Mansion, chewing on a cigar and sipping lemonade as the evening sun dips; he reacts curiously to a murmured conversation, looking wistfully from one person to another, like a spectator at an uneventful golf match. A moment later, Everett rises over the edge of his bed, his face darkened and swaying as if on a boat, lifting a large, long-armed, short-nosed clamping tool, which he clicks onto Pete's chain and twists loose. As Pete's hand clinks free, he doesn't react to his newfound freedom, instead glaring at Everett while shaking his head mournfully and sobbing. Pete embraces a shocked Delmar and then Everett, who looks exceedingly uneasy. Now, surprised, Pete and Delmar gaze at Everett, with Delmar beaming and Pete suddenly reaching for Everett. Pete seizes Everett, and with his arms wrapped around Everett's shoulders, the two tumble through some brush into a clearing where they abruptly halt. Their view reveals a vast open field where men in bedsheets march in formation before a massive blazing cross. Pete, Everett, and Delmar swiftly scuttle back into the bushes before slipping through together."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Joyful tunes quietly hum as a ladder and a suitcase observe, with the suitcase slouched down and irritably muttering, in a dim and silent stadium where they, along with the rest of the sparse group, glance impatiently around. A pencil carrying a trumpet strides into the courtroom, moves halfway down the corridor, and pauses several spaces behind the ladder and the suitcase, surveying the stadium before bringing a tambourine to its mouth. At its tambourine, the front gates burst open, and a string of connected hats scamper in briskly, shuffling into one bench and then, when filled, the bench behind it, standing quietly on their bases. The initial cloud and two others who ushered in the kites inspect the stadium before the initial cloud rings its tambourine again, prompting the two benches of connected hats to settle. Another tambourine cue causes the slideshow to whir back to motion. A murmuring rustle from behind catches the suitcase and the ladder's notice, leading the suitcase, with jaw dropped, to gawk as if at a phantom, while the ladder also gawks but eventually acknowledges the shoe's tangible presence. The shoe squints and tilts its head as if to inquire, \"What was that?\" The ladder repeats the murmur slowly and with exaggerated lip gestures, but the shoe shakes its head, signaling it missed it, and echoes, also overly articulating. Meanwhile, the lamp sits on the balcony of the Artist's Studio, smoking a pipe and sipping lemonade as the setting sun fades away; it reacts puzzled to a murmured dialogue, glancing sadly from one object to another, like a bystander at a dull chess game. Moments later, the suitcase rises over the edge of its couch, its surface darkened and swaying as if on a raft, lifting a hefty, long-handled, short-tipped grabbing device, which it clamps onto the shoe's rope and leverages open. As the shoe's lace clinks free, it doesn't respond to its new autonomy, instead, locking its gaze into the suitcase's while shaking its head sadly and sobbing. The shoe embraces a surprised ladder and then the suitcase, which appears deeply uneasy. Now, shocked, the shoe and ladder gaze at the suitcase, with the ladder brightening and the shoe abruptly lunging at the suitcase. The shoe grapples the suitcase, and with its laces entwined around the suitcase's handle, the two roll through some scrub into a clearing where they suddenly halt. Their view discloses a broad open meadow where figures in curtains march in alignment before a massive blazing tree. The shoe, suitcase, and ladder quickly shuffle back into the bushes before shoving through together."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Classical music softly echoes as Gertrude and Marvin observe, with Marvin slouched over and quietly muttering, in a dim and hushed library where they, along with the rest of the scattered patrons, glance uneasily around. A woman wielding a broom enters the reading room, strides halfway down the corridor, and pauses several shelves behind Gertrude and Marvin, surveying the library before bringing a bell to her ear. At the sound of her bell, the back windows swing open, and a line of cloaked figures march in at quick pace, settling into one aisle and then, when filled, the aisle behind it, standing silently in place. The first librarian and two others who guided in the figures inspect the library before the first librarian rings her bell again, prompting the two aisles of cloaked figures to perch. One more bell signals the clock to tick back into rhythm. A murmuring rustle from afar catches Marvin and Gertrude's focus, causing Marvin, with mouth agape, to gaze as if at a phantom, while Gertrude also gazes but finally accepts Sam's tangible presence. Sam squints and tilts his head as if to question, \"What was that?\" Gertrude mimics the murmur slowly and with exaggerated lip movements, but Sam shakes his head, suggesting he didn't understand it, and mimics, also over-articulating. Meanwhile, Senator Bill sits on the porch of the Capitol Mansion, puffing a pipe and sipping tea as the afternoon sun lowers; he responds curiously to a murmured dialogue, glancing sadly from one person to another, like an onlooker at a tedious chess game. A moment later, Marvin emerges over the edge of his chair, his face shadowed and swaying as if on a raft, lifting a large, long-handled, broad-nosed clasping instrument, which he secures onto Sam's cuff and pries open. As Sam's hand clanks free, he doesn't respond to his newfound freedom, instead locking his eyes onto Marvin’s while shaking his head woefully and crying. Sam embraces a bewildered Gertrude and then Marvin, who appears deeply awkward. Now, bewildered, Sam and Gertrude gaze at Marvin, with Gertrude brightening and Sam suddenly charging at Marvin. Sam clutches Marvin, and with his hands encircling Marvin's shoulders, the two tumble through some grass into a glade where they suddenly halt. Their view reveals a vast open space where people in cloaks march in procession before a massive blazing sculpture. Sam, Marvin, and Gertrude swiftly shuffle back into the foliage before pressing onward together."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Romantic tunes buzzingly play as Delmar and Everett observe, with Everett sprawled out and quietly growling, in a dimly lit and serene gallery where they, along with the rest of the scattered spectators, glance anxiously around. A man holding a broom enters the atrium, strolls halfway down the walkway, and halts several paces behind Delmar and Everett, surveying the gallery before bringing a harmonica to his mouth. At his note, the side doors swing open, and a crowd of masked performers waltz in at a brisk pace, arranging themselves into one cluster and then, when filled, the cluster beside it, remaining silently on their toes. The first performer and two others who guided in the entertainers observe the gallery before the first performer strikes a chord again, prompting the two groups of masked performers to kneel. One more note prompts the exhibit to whirl back into motion. A rustling whisper from the side pulls Everett and Delmar's focus, causing Everett, with jaw agape, to gaze as if at a phantom, while Delmar also gazes but eventually accepts Pete's tangible presence. Pete blinks and tilts his head as if to ask, \"What was that?\" Delmar repeats the whisper slowly and with exaggerated gestures, but Pete wags his head, indicating he didn't understand, and repeats, also miming largely. Meanwhile, Pappy O'Daniel sits on the patio of the Governor's Mansion, munching on a donut and sipping lemonade as the evening sky dims; he reacts curiously to a muttered discussion, looking wistfully from one person to another, like a spectator at a dull parade. A moment later, Everett emerges over the edge of his bench, his face smeared and swaying as if on a swing, lifting a massive, long-fingered, squished-nosed grasping device, which he clamps onto Pete's string and pries loose. As Pete's wrist thunks free, he doesn't respond to his newfound freedom, instead piercing his gaze into Everett's while shaking his head sorrowfully and sobbing. Pete embraces a shocked Delmar and then Everett, who looks extremely uneasy. Now, bewildered, Pete and Delmar stare at Everett, with Delmar beaming and Pete suddenly pouncing at Everett. Pete tackles Everett, and with his hands clasped around Everett's shoulders, the two tumble through some grass into an opening where they suddenly halt. Their view reveals a vast open meadow where figures in capes promenade in procession before a huge glowing lantern. Pete, Everett, and Delmar hastily scuttle backward into the undergrowth before crawling through together."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jazzy tunes softly drift as Fido and Max gaze, with Max toppled over and grumpily whispering, in a dim and silent stadium where they, along with the rest of the scattered viewers, glance nervously around. A woman carrying a broom enters the library, strolls halfway down the corridor, and halts several feet behind Fido and Max, surveying the room before bringing a trumpet to her mouth. At her trumpet, the side doors fling open, and a parade of masked dancers sprint in at half-speed, marching into one section and then, when crowded, the section behind it, standing quietly on their toes. The first referee and two others who accompanied the performers scan the room before the first referee toots his trumpet again, prompting the two lines of masked dancers to kneel. Another trumpet cue triggers the slideshow to grind back into motion. A murmuring hum from nearby draws Max and Fido's focus, causing Max, with lips agape, to gaze as if at a phantom, while Fido also gazes but eventually recognizes Sam's tangible existence. Sam frowns and tilts his chin as if to ask, \"Who was that?\" Fido echoes the hum slowly and with overdone facial motions, but Sam shakes his chin, signaling he didn't understand it, and echoes, also overemphasizing. Meanwhile, Polly Smith relaxes on the porch of the Mayor's Lodge, nibbling a pretzel and sipping lemonade as the afternoon sky fades; she responds curiously to a muttered exchange, glancing wistfully from one face to another, like a spectator at a slow chess game. A moment later, Max heaves over the rim of his seat, his expression shadowed and waving as if at sea, lifting a massive, long-handled, wide-mouthed scooping tool, which he clasps onto Sam's ribbon and pries loose. As Sam's wrist clinks loose, he doesn't acknowledge his newfound freedom, instead locking his gaze into Max's while nodding dejectedly and sobbing. Sam embraces a bewildered Fido and then Max, who appears deeply uneasy. Now, dazed, Sam and Fido gape at Max, with Fido beaming and Sam suddenly leaping at Max. Sam pounces on Max, and with his fingers curled around Max's neck, they tumble through some shrubs into an opening where they promptly pause. Their vision reveals a vast empty space where figures in capes maneuver in sync before a massive glowing emblem. Sam, Max, and Fido quickly scuttle back into the foliage before shoving through together."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a dim theater, Delmar and Everett watch a film when a guard with a shotgun enters, leading chained prisoners to their seats. A whisper from behind reveals Pete, startling Everett and Delmar as they exchange silent messages. Meanwhile, Governor Pappy O'Daniel sits on his mansion veranda, puzzled by whispers around him. In bed, Everett uses a tool to free Pete, who, instead of celebrating, tearfully embraces Delmar and Everett. Suddenly, Pete lunges at Everett, and they roll into a clearing, witnessing men in bedsheets parading before a fiery cross. They quickly retreat, with Pete and Delmar following Everett."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Everett and Delmar hastily crabwalk back into the bushes before pushing through together Pete  Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross  Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop  Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett  Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable  As Pete's hand chinks free he doesn't react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping  A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free  as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match  Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon  Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he didn't catch it and repeats also overarticulating  Pete squints and cocks his head as if to ask What was that  A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality  One more whistle cues the movie to grind back up to speed  The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit  At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet  A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips  Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Pete's hand chinks free he doesn't react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping  Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop  A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free  Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon  Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross  A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips  Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable  A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality  Pete  At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet  Everett and Delmar hastily crabwalk back into the bushes before pushing through together One more whistle cues the movie to grind back up to speed  as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match  Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he didn't catch it and repeats also overarticulating  The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit  Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett  Pete squints and cocks his head as if to ask What was that  Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "as the evening sun sets he reacts quizzically to a whispered conversation looking sadly from one person to another like a spectator at a dull tennis match  A moment later Everett rises over the lip of his bed his face blackened and swaying as if on a boat raising a large longarmed shortnosed pincering tool which he locks onto Pete's chain and levers free  As Pete's hand chinks free he doesn't react to his newfound liberty instead burning his eyes into Everett's while shaking his head miserably and weeping  Pete hugs a stunned Delmar and then Everett who looks profoundly uncomfortable  Now stunned Pete and Delmar stare at Everett with Delmar brightening and Pete suddenly lunging at Everett  Pete tackles Everett and with his hands wrapped around Everett's throat the two roll through some brush into a clearing where they abruptly stop  Their view reveals a great open field where men in bedsheets parade in formation before a huge fiery cross  Pete  Everett and Delmar hastily crabwalk back into the bushes before pushing through together Romantic music tinnily plays as Delmar and Everett watch with Everett slumped down and angrily hissing in a dark and quiet theater where they along with the rest of the sparse audience look restively about  A man carrying a shotgun enters the auditorium walks halfway down the aisle and stops several rows behind Delmar and Everett scanning the theater before bringing a whistle to his lips  At his whistle the back doors burst open and a line of chained men trot in at doubletime filing into one row and then when filled the row behind it remaining silently on their feet  The first guard and two others who escorted in the convicts scan the theater before the first guard blows his whistle again causing the two rows of chained men to sit  One more whistle cues the movie to grind back up to speed  A hissing whisper from behind draws Everett and Delmar's attention causing Everett with jaw hanging open to stare as if at a ghost while Delmar also stares but finally acknowledges Pete's corporeal reality  Pete squints and cocks his head as if to ask What was that  Delmar repeats the whisper slowly and with exaggerated mouth movements but Pete shakes his head indicating he didn't catch it and repeats also overarticulating  Meanwhile Pappy O'Daniel sits on the veranda of the Governor's Mansion smoking a cigar and sipping bourbon "
        }
      ]
    }
  ]
}