{
  "ground_truth": "Silence envelops everyone, each locked in their own thoughts. Father, wearing the Star of David armband, walks slowly along, carrying a string bag with potatoes and carrots, his eyes fixed on the pavement, lost in thought. He passes two German officers who stop, causing Father to turn fearfully and approach them. One German officer strikes Father hard across the face, hitting his ear. Father reels, collects himself, and shuffles on, stepping off the pavement to walk in the gutter. Father continues on. Meanwhile, Szpilman is composing at the piano, making adjustments to the manuscript with a pencil and playing again. Halina enters with a newspaper, handing it to him. He looks at it, and his expression darkens at the sight of a map of the proposed Jewish area: two distinct districts, one large, one smaller. Halina looks over his shoulder and reads as Henryk leans in the doorway, watching, seemingly amused. Szpilman gazes at the map, horrified, and laughs nervously. They're disturbed by the sound of crying from another room. Puzzled, they look at each other, and Halina opens a door to find Mother sitting on the bed, holding a purse, crying, while Father sleeps. Halina sits beside Mother, putting an arm around her as Mother opens the purse to reveal a crumpled note, weeping. Halina tries to comfort her while Szpilman and Henryk watch. Podgy, hairy hands with dirty nails play an octave on the piano, harshly and tonelessly, with straight fingers. The hands belong to Mr. Lipa, a dealer in his early fifties, who sits at the piano, examining the lacquer as Regina stands in the bow, watching him, and Henryk watches intently from the table. Szpilman sits apart, aloof, with his back to the piano and Mr. Lipa. Suddenly, Henryk lunges at Mr. Lipa, grabbing him, and a struggle ensues. During it, Mother and Father appear at their bedroom door, watching, appalled. Henryk subsides, glowering at Mr. Lipa. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on foot, bicycles, and horse-drawn platforms, some pushing prams loaded with belongings, forming a great moving mass of humanity watched by Poles on either side of the street. On a horse-drawn platform are the Szpilmans with their belongings, all wearing armbands. Szpilman, Halina, and Henryk walk beside the platform where Mother, Father, and Regina are seated. Szpilman catches sight of someone among the onlookers, smiles, and pushes through the crowd to Dorota, who is close to tears.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Silence shrouds everyone, each confined in their own reflections. Father, sporting the Star of David band, strolls slowly along, bearing a string sack with potatoes and carrots, his gaze fixed on the pavement, absorbed in contemplation. He passes two German officers who pause, prompting Father to turn anxiously and approach them. One German officer strikes Father forcefully across the visage, hitting his ear. Father staggers, regains equilibrium, and shuffles on, stepping off the pavement to tread in the gutter. Father proceeds onward. Meanwhile, Szpilman is creating at the piano, making modifications to the manuscript with a pencil and playing again. Halina enters with a newspaper, handing it to him. He looks at it, and his expression darkens at the sight of a map of the proposed Jewish district: two distinct areas, one large, one smaller. Halina glances over his shoulder and reads as Henryk leans in the doorway, observing, seemingly amused. Szpilman gazes at the map, appalled, and chuckles nervously. They're disturbed by the sound of weeping from another room. Perplexed, they glance at each other, and Halina opens a door to find Mother sitting on the bed, holding a handbag, sobbing, while Father sleeps. Halina sits beside Mother, putting an arm around her as Mother opens the handbag to reveal a crumpled note, weeping. Halina attempts to comfort her while Szpilman and Henryk observe. Plump, hairy hands with grimy nails play an octave on the piano, harshly and tonelessly, with straight fingers. The hands belong to Mr. Lipa, a vendor in his early fifties, who sits at the piano, inspecting the lacquer as Regina stands in the curve, watching him, and Henryk watches intently from the table. Szpilman sits apart, detached, with his back to the piano and Mr. Lipa. Suddenly, Henryk lunges at Mr. Lipa, grabbing him, and a scuffle ensues. During it, Mother and Father appear at their bedroom door, observing, appalled. Henryk subsides, glaring at Mr. Lipa. A great procession of Jews of all ages makes its way toward the district that will become the ghetto. They travel on foot, bicycles, and horse-drawn wagons, some pushing strollers loaded with possessions, forming a great moving mass of humanity observed by Poles on either side of the street. On a horse-drawn wagon are the Szpilmans with their possessions, all wearing armbands. Szpilman, Halina, and Henryk walk beside the wagon where Mother, Father, and Regina are seated. Szpilman catches sight of somebody among the onlookers, smiles, and pushes through the throng to Dorota, who is close to tears."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Everyone is enveloped by silence, with each being locked in their own thoughts. The Star of David armband is worn by Father, who walks slowly along, a string bag with potatoes and carrots being carried by him, and his eyes are fixed on the pavement, lost in thought. Two German officers are passed by him, who stop, causing him to turn fearfully and approach them. Father is struck hard across the face by one German officer, who hits his ear. He reels, collects himself, and continues shuffling on, stepping off the pavement to walk in the gutter. Father is continued on his way. Meanwhile, the piano is composed at by Szpilman, who makes adjustments to the manuscript with a pencil and plays again. Halina enters with a newspaper, which is handed to him by her. He looks at it, and his expression darkens at the sight of a map of the proposed Jewish area: two distinct districts, one large, one smaller. Halina looks over his shoulder and reads as Henryk leans in the doorway, watching, seemingly amused. The map is gazed at by Szpilman, who is horrified and laughs nervously. The sound of crying from another room disturbs them. They look at each other, puzzled, and a door is opened by Halina to find Mother sitting on the bed, holding a purse, crying, while Father sleeps. Mother is sat beside by Halina, who puts an arm around her as the purse is opened by Mother to reveal a crumpled note, weeping. Halina tries to comfort her while Szpilman and Henryk watch. An octave on the piano is played harshly and tonelessly, with straight fingers, by podgy, hairy hands with dirty nails. Mr. Lipa, a dealer in his early fifties, to whom the hands belong, sits at the piano, examining the lacquer as Regina stands in the bow, watching him and Henryk watches intently from the table. Apart, with his back to the piano and Mr. Lipa, Szpilman sits aloof. Suddenly, Mr. Lipa is lunged at by Henryk, who grabs him, and a struggle ensues. During it, Mother and Father appear at their bedroom door, watching, appalled. Mr. Lipa is glowered at by Henryk, who subsides. A great column of Jews of all ages is made its way by toward the area that will become the ghetto. They are traveling on foot, bicycles, and horse-drawn platforms, and some are pushing prams loaded with belongings, forming a great moving mass of humanity who are watched by Poles on either side of the street. The Szpilmans, with their belongings, are on a horse-drawn platform, all wearing armbands. The platform carrying Mother, Father, and Regina is walked beside by Szpilman, Halina, and Henryk. Sight of someone among the onlookers is caught by Szpilman, who smiles and pushes through the crowd to Dorota, who is close to tears."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Silence envelops everyone, deep in thought. Father, wearing a Star of David armband, walks slowly with a string bag of potatoes and carrots, eyes downcast. He passes two German officers; one strikes him across the face. Father steadies himself and continues, walking off the pavement. Meanwhile, Szpilman composes at the piano, adjusting his manuscript as Halina hands him a newspaper. His expression darkens at a map of the proposed Jewish district: two areas, one large, one smaller. Halina reads over his shoulder as Henryk watches, amused. Szpilman gazes at the map, horrified, and laughs nervously. They hear crying, and Halina finds Mother weeping with a crumpled note in a purse, as Father sleeps. Halina comforts her while Szpilman and Henryk observe. Podgy hands with dirty nails play a harsh octave on the piano—Mr. Lipa, an early fifties dealer, sits at the piano, inspecting the lacquer while Regina and Henryk watch closely. Szpilman sits apart, distant. Henryk suddenly lunges at Mr. Lipa, a struggle follows, witnessed by the appalled parents. Henryk relents, glaring at Mr. Lipa. A column of Jews of all ages, on foot, bicycles, and horse-drawn platforms, moves toward the ghetto, watched by observing Poles. The Szpilmans, with belongings and armbands, ride a platform. Szpilman, Halina, and Henryk walk beside it, spotting Dorota among the onlookers; Szpilman smiles and pushes through the crowd to her, seeing her near tears."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Silence envelops everyone, each in their own thoughts. Father, wearing a Star of David armband, walks slowly, carrying a bag of potatoes and carrots, eyes downcast. He passes two German officers who stop him; one hits him hard. Father recovers and walks in the gutter. Szpilman composes at the piano. Halina brings him a newspaper showing a map of the proposed Jewish area, which horrifies him. Halina finds Mother crying over a crumpled note while Father sleeps; Halina tries to comfort her. Mr. Lipa, a dealer, plays the piano poorly as Henryk watches. Henryk lunges at him, causing a struggle. Mother and Father watch, appalled. A column of Jews moves toward the ghetto, including the Szpilmans on a horse-drawn platform. Szpilman sees Dorota in the crowd and smiles at her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "An all-encompassing silence descends upon everyone present, as each individual becomes deeply absorbed in their own private thoughts. The father, marked by the Star of David armband on his sleeve, moves slowly and deliberately along the path, carrying a humble string bag filled with simple potatoes and carrots. His eyes remain focused intently on the pavement below him, seemingly lost in his own world of contemplation. As he proceeds on this solitary journey, he encounters two German officers. Their sudden halt causes a wave of fear to wash over him, prompting the father to nervously approach them. In a brutal moment, one of the German officers delivers a harsh blow to the father’s face, striking him painfully on his ear. The father staggers momentarily but manages to regain his composure, continuing his walk by stepping off the pavement to trudge along the gutter instead. He perseveres onward.\n\nMeanwhile, Szpilman is immersed in his creative process at the piano, diligently composing music. He makes precise amendments to the manuscript with a pencil, playing the piece again to refine it further. At this moment, Halina enters the room, carrying a newspaper, which she hands over to him. As Szpilman glances at the pages, his expression shifts to one of concern upon seeing a map detailing the proposed Jewish area: two distinctly separate districts, one notably larger than the other. Standing beside him, Halina peers over his shoulder, reading the information, while Henryk leans casually in the doorway, observing with an air of amusement. Gazing at the map, Szpilman is flooded with horror and responds with a nervous laugh. Their attention is soon diverted by the unexpected sound of crying emanating from another room. Confused, they exchange puzzled looks. Halina moves to open a door, discovering Mother seated on the bed, clutching a purse and weeping, while Father lies asleep. Halina takes a seat beside Mother, wrapping a comforting arm around her as Mother opens the purse to reveal a crumpled note, her tears flowing freely. Halina offers solace, trying to console her, as Szpilman and Henryk watch the scene unfold with a shared sense of concern.\n\nElsewhere, the scene shifts to show podgy, hairy hands adorned with dirty nails playing a harsh and toneless octave on the piano with straight, rigid fingers. These hands belong to Mr. Lipa, a dealer in his early fifties, who is seated at the piano, closely inspecting the lacquer as Regina stands nearby, observing him from the bow. Meanwhile, Henryk looks on intently from the table. Szpilman, choosing to distance himself, sits apart with his back turned to both Mr. Lipa and the piano, projecting an air of detachment. Without warning, Henryk launches himself at Mr. Lipa, grabbing him and instigating a scuffle. As the struggle unfolds, Mother and Father appear at their bedroom door, witnessing the commotion with a sense of shock and dismay. Eventually, Henryk retreats, anger simmering in his gaze directed at Mr. Lipa.\n\nIn another part of the city, a vast column of Jewish people of all ages begins its solemn march toward what will soon become the ghetto. They make this journey on foot, by bicycle, and on horse-drawn platforms, some pushing baby prams piled high with their worldly belongings, forming a great and moving mass of humanity. On either side of the street, Poles watch the procession unfold with varying expressions. Upon one of the horse-drawn platforms are the Szpilmans, accompanied by their possessions, each of them wearing armbands as a symbol of their identity. Szpilman, Halina, and Henryk walk alongside the platform where Mother, Father, and Regina are seated. In the midst of the crowd, Szpilman catches sight of someone familiar among the spectators. His face lights up with a smile as he makes his way through the throng to reach Dorota, who stands there, visibly on the brink of tears."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "An all-encompassing and profound silence quietly descends upon everyone present, enveloping them in an aura of stillness, as each individual becomes deeply engrossed in their own private thoughts and introspections. The father, who bears the distinct identification of the Star of David armband on his sleeve, moves along the path with slow and deliberate steps, carrying a modest string bag that is filled with simple, unpretentious potatoes and carrots. His eyes remain intently focused on the pavement below him, seemingly lost in a contemplative world of his own thoughts. As he continues on this solitary and introspective journey, he encounters two German officers. Their abrupt halt causes a wave of fear to wash over him, prompting the father to nervously and cautiously approach them. In a moment of brutal violence, one of the German officers delivers a harsh and painful blow to the father’s face, striking him on the ear. Staggering momentarily from the impact, the father manages to regain his composure and continues his walk by stepping off the pavement to trudge along the gutter instead. Despite the pain, he perseveres onward.\n\nMeanwhile, Szpilman is immersed in his creative process at the piano, diligently and meticulously composing music. He makes precise and thoughtful amendments to the manuscript with a pencil, playing the piece once again to refine and perfect it further. At this moment, Halina enters the room, carrying a newspaper in her hands, which she hands over to him. As Szpilman glances at the pages, his expression shifts to one of deep concern upon seeing a map that details the proposed Jewish area: two distinctly separate districts, one notably larger than the other. Standing beside him, Halina peers over his shoulder, reading the information with interest, while Henryk leans casually in the doorway, observing with an air of amusement. Gazing at the map, Szpilman is flooded with a sense of horror and responds with a nervous laugh. Their attention is soon diverted by the unexpected sound of crying emanating from another room. Confused and curious, they exchange puzzled looks. Halina moves to open a door, discovering their Mother seated on the bed, clutching a purse and weeping, while Father lies asleep beside her. Halina takes a seat beside Mother, wrapping a comforting arm around her shoulders as Mother opens the purse to reveal a crumpled note, her tears flowing freely. Halina offers solace and comfort, trying to console her as Szpilman and Henryk watch the scene unfold with a shared sense of concern and empathy.\n\nElsewhere, the scene shifts to reveal podgy, hairy hands, adorned with dirty nails, playing a harsh and toneless octave on the piano with straight, rigid fingers. These hands belong to Mr. Lipa, a dealer in his early fifties, who is seated at the piano, closely inspecting the lacquer as Regina stands nearby, observing him from the bow. Meanwhile, Henryk looks on intently from the table. Szpilman, choosing to distance himself emotionally, sits apart with his back turned to both Mr. Lipa and the piano, projecting an air of detachment. Without warning, Henryk launches himself at Mr. Lipa, grabbing him and instigating a scuffle. As the struggle unfolds, Mother and Father appear at their bedroom door, witnessing the commotion with a sense of shock and dismay. Eventually, Henryk retreats, with anger simmering in his gaze directed at Mr. Lipa.\n\nIn another part of the city, a vast column of Jewish people of all ages begins its solemn march toward what will soon be designated as the ghetto. They make this journey on foot, by bicycle, and on horse-drawn platforms, some pushing baby prams piled high with their worldly belongings, forming a great and moving mass of humanity. On either side of the street, Poles watch the procession unfold with varying expressions. Upon one of the horse-drawn platforms are the Szpilmans, accompanied by their possessions, each of them wearing armbands as a symbol of their identity and heritage. Szpilman, Halina, and Henryk walk alongside the platform where Mother, Father, and Regina are seated. In the midst of the crowd, Szpilman catches sight of someone familiar among the spectators. His face lights up with a smile as he makes his way through the throng to reach Dorota, who stands there, visibly on the brink of tears."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Silence envelops everyone in their own world of thoughts as they navigate their individual mental landscapes. Father, adorned with the Star of David armband, moves deliberately and slowly along the path, his movements careful and deliberate, as he carries a string bag filled with potatoes and carrots. His gaze is fixed downward, seemingly anchored to the pavement, as if the weight of his thoughts keeps him tethered to the ground. As he advances, his path intersects with two German officers who stand abruptly, prompting Father to halt his progress. A wave of apprehension washes over him, compelling him to turn back towards them, his steps tentative and filled with dread. In a sudden, violent motion, one officer strikes Father hard across the face, targeting his ear with a brutal blow. Father staggers from the impact, momentarily disoriented before regaining his composure. Collecting himself, he shuffles forward, stepping off the pavement to descend onto the gutter, choosing to continue his journey along this lower path. Meanwhile, Szpilman sits at the piano, his fingers moving deftly across the keys as he composes, pausing occasionally to make precise adjustments to the manuscript with a pencil before playing the revised sections once more. Halina enters the scene, holding a newspaper that she passes to Szpilman with a sense of urgency. Szpilman takes the paper and his expression shifts dramatically as he glimpses a map depicting the proposed Jewish area, which is divided into two distinct sections: one sprawling and one more compact. Halina peers over his shoulder, reading the map with growing concern. From the doorway, Henryk leans casually, observing the scene with an air of amusement. Szpilman's gaze remains fixed on the map, his expression one of horror, punctuated by a nervous laugh that escapes his lips. Their moment is interrupted by the unexpected sound of crying emanating from another room. Confused, Szpilman and Halina exchange puzzled glances before Halina moves to open a door, revealing Mother sitting on a bed, clutching a purse, her tears evident as Father lies asleep nearby. Halina joins Mother on the bed, wrapping an arm around her in a comforting gesture as Mother opens the purse to reveal a crumpled note, her weeping unabated. As Halina attempts to console her, Szpilman and Henryk observe the scene with a shared sense of helplessness. In a different setting, podgy, hairy hands with dirty nails assault the piano keys without finesse, producing a harsh, toneless sound as they play an octave with rigid, straight fingers. The hands belong to Mr. Lipa, a dealer in his early fifties, who sits at the piano with an appraising eye, examining the lacquer with interest. Regina stands nearby, watching his actions intently from her position in the bow, while Henryk follows the proceedings closely from his vantage point at the table. Szpilman sits apart from the group, detached, with his back turned to both the piano and Mr. Lipa. Without warning, Henryk lunges at Mr. Lipa, seizing him in a sudden burst of aggression, igniting a physical struggle that ensues between them. Mother and Father, disturbed by the commotion, appear at their bedroom door, their faces registering shock and dismay as they witness the altercation. Henryk eventually subsides, directing a fierce glare at Mr. Lipa. Outside, a vast column of Jews, comprising individuals of all ages, advances toward the designated area that will soon be known as the ghetto. They move forward by various means—on foot, by bicycle, and on horse-drawn platforms—some pushing prams overflowing with possessions, all combining to form a great, undulating mass of humanity. This moving tide of people is observed by Poles who line the street, watching from the sidelines. Among the travelers on a horse-drawn platform are the Szpilmans, their belongings piled high, each member marked by the armbands they wear. Szpilman, Halina, and Henryk walk alongside the platform, attending to Mother, Father, and Regina, who are seated with their possessions. Amidst this exodus, Szpilman's attention is caught by a familiar face among the onlookers, prompting him to smile as he deftly maneuvers through the crowd. He makes his way to Dorota, who stands amidst the throng, her eyes brimming as tears threaten to spill over."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Silence envelops everyone, each lost in their thoughts. Father, marked by the Star of David armband, walks slowly, carrying a string bag of potatoes and carrots, fixated on the pavement and consumed by his thoughts. Passing two German officers, he is forced to turn and approach them out of fear. One officer strikes him across the face, causing him to reel before regaining his composure and continuing in the gutter. Meanwhile, Szpilman composes at the piano, revising his manuscript with a pencil. Halina enters and gives him a newspaper. His expression darkens at the map of the proposed Jewish area, with two distinct districts. As Halina reads over his shoulder, Henryk watches from the doorway, seemingly amused. Szpilman, horrified, laughs nervously, interrupted by crying from another room. Halina finds Mother weeping on the bed with a crumpled note, tries to comfort her as Szpilman and Henryk observe. Elsewhere, Mr. Lipa, a dealer, harshly plays the piano as Regina and Henryk watch, while Szpilman sits apart, aloof. Suddenly, Henryk attacks Mr. Lipa, leading to a struggle that Mother and Father witness, appalled. Henryk eventually subsides, glaring at Mr. Lipa. A large column of Jews, including the Szpilmans, moves toward the future ghetto, traveling by foot, bicycle, and horse-drawn platforms, with some pushing prams of belongings. On a platform, Mother, Father, and Regina sit with their possessions as Szpilman, Halina, and Henryk walk beside them. Szpilman spots Dorota among the onlookers, smiles, and pushes through the crowd to her, seeing her close to tears."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Silence envelops everyone, each locked in their own thoughts during this tense period in Warsaw, where tensions are high. Father, wearing the Star of David armband required by the Nazi regime to mark Jewish individuals, walks slowly along, carrying a string bag with potatoes and carrots—scarce commodities due to wartime shortages—his eyes fixed on the pavement, lost in thought. He passes two German officers, part of the occupying force in Poland since 1939, who stop, causing Father to turn fearfully and approach them. One German officer strikes Father hard across the face, hitting his ear, an act that underscores the daily humiliation and violence Jews faced. Father reels, collects himself, and shuffles on, stepping off the pavement to walk in the gutter, a common method to avoid further attention. Father continues on. Meanwhile, Szpilman, a talented pianist and composer, is working at the piano, making adjustments to the manuscript with a pencil and playing again to perfect his composition. Halina enters with a newspaper, a vital source of information and propaganda at the time, handing it to him. He looks at it, and his expression darkens at the sight of a map of the proposed Jewish area: two distinct districts, one large, one smaller, marking the creation of the Warsaw Ghetto. Halina looks over his shoulder and reads as Henryk leans in the doorway, watching, seemingly amused. Szpilman gazes at the map, horrified, and laughs nervously at the absurdity and horror of their impending confinement. They're disturbed by the sound of crying from another room. Puzzled, they look at each other, and Halina opens a door to find Mother sitting on the bed, holding a purse, crying, while Father sleeps from exhaustion. Halina sits beside Mother, putting an arm around her as Mother opens the purse to reveal a crumpled note, a reminder of lost normalcy, weeping. Halina tries to comfort her while Szpilman and Henryk watch, feeling helpless. Podgy, hairy hands with dirty nails play an octave on the piano, harshly and tonelessly, with straight fingers. The hands belong to Mr. Lipa, a disreputable dealer in his early fifties, who sits at the piano, examining the lacquer as Regina, aware of the piano's value in their precarious situation, stands in the bow, watching him, and Henryk watches intently from the table. Szpilman sits apart, aloof, with his back to the piano and Mr. Lipa, possibly disapproving of the sale. Suddenly, Henryk lunges at Mr. Lipa, grabbing him, and a struggle ensues. During it, Mother and Father appear at their bedroom door, watching, appalled by the chaos. Henryk subsides, glowering at Mr. Lipa, frustrated by the necessity of dealing with such men. A great column of Jews of all ages makes its way toward the area that will become the ghetto, marking the beginning of their confinement. They travel on foot, bicycles, and horse-drawn platforms, some pushing prams loaded with belongings, forming a great moving mass of humanity watched by Poles on either side of the street, some sympathetic, others indifferent. On a horse-drawn platform are the Szpilmans with their belongings, all wearing armbands, the symbol of their segregation. Szpilman, Halina, and Henryk walk beside the platform where Mother, Father, and Regina are seated, tightly packed with their meager possessions. Szpilman catches sight of someone among the onlookers, smiles, and pushes through the crowd to Dorota, a friend from better times, who is close to tears, unable to help."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought Silence envelops everyone each locked in their own thoughts He looks at it and his expression darkens Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table He passes two German officers who stop causing Father to turn fearfully and approach them One German officer strikes Father hard across the face hitting his ear Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter Father continues on Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands Halina enters with a newspaper handing it to him He looks at it and his expression darkens at the sight of a map of the proposed Jewish area two distinct districts one large one smaller Henryk subsides glowering at Mr Lipa Halina looks over his shoulder and reads as weeping Henryk leans in the doorway watching seemingly amused One German officer strikes Father hard across the face hitting his ear They are disturbed by the sound of crying from another room Silence envelops everyone each locked in their own thoughts Szpilman gazes at the map horrified and laughs nervously They are disturbed by the sound of crying from another room Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying while Father sleeps Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note weeping Halina tries to comfort her while Szpilman and Henryk watch Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated He passes two German officers who stop causing Father to turn fearfully and approach them Szpilman sits apart aloof with his back to the piano and Mr Lipa Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues During it Mother and Father appear at their bedroom door watching appalled Henryk subsides glowering at Mr Lipa A great column of Jews of all ages makes its way toward the area that will become the ghetto They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated Halina tries to comfort her while Szpilman and Henryk watch Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter During it Mother and Father appear at their bedroom door watching appalled Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears Halina enters with a newspaper handing it to him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Silence envelops everyone each locked in their own thoughts. Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought. He passes two German officers who stop causing Father to turn fearfully and approach them. One German officer strikes Father hard across the face hitting his ear. Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter. Father continues on. Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again. Halina enters with a newspaper handing it to him. He looks at it and his expression darkens. at the sight of a map of the proposed Jewish area two distinct districts one large one smaller. Halina looks over his shoulder and reads as. Henryk leans in the doorway watching seemingly amused. Szpilman gazes at the map horrified and laughs nervously. They are disturbed by the sound of crying from another room. Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. while Father sleeps. Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note. weeping. Halina tries to comfort her while Szpilman and Henryk watch. Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers. The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table. Szpilman sits apart aloof with his back to the piano and Mr Lipa. Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues. During it Mother and Father appear at their bedroom door watching appalled. Henryk subsides glowering at Mr Lipa. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street. On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands. Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated. Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Silence envelops everyone each locked in their own thoughts. Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought. He passes two German officers who stop causing Father to turn fearfully and approach them. One German officer strikes Father hard across the face hitting his ear. Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter. Father continues on. Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again. Halina enters with a newspaper handing it to him. He looks at it and his expression darkens. at the sight of a map of the proposed Jewish area two distinct districts one large one smaller. Halina looks over his shoulder and reads as. Henryk leans in the doorway watching seemingly amused. Szpilman gazes at the map horrified and laughs nervously. They are disturbed by the sound of crying from another room. Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. while Father sleeps. Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note. weeping. Halina tries to comfort her while Szpilman and Henryk watch. Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers. The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table. Szpilman sits apart aloof with his back to the piano and Mr Lipa. Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues. During it Mother and Father appear at their bedroom door watching appalled. Henryk subsides glowering at Mr Lipa. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street. On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands. Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated. Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Silence envelops everyone each locked in their own thoughts. Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought. He passes two German officers who stop causing Father to turn fearfully and approach them. One German officer strikes Father hard across the face hitting his ear. Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter. Father continues on. Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again. Halina enters with a newspaper handing it to him. During it Mother and Father appear at their bedroom door watching appalled. Henryk subsides glowering at Mr Lipa. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street. On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands. Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated. Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Silence envelops everyone each locked in their own thoughts. Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought. He passes two German officers who stop causing Father to turn fearfully and approach them. On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands. Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated. Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Silence envelops everyone, each locked in their own thoughts. The dog, wearing the Star of David armband, walks slowly along, carrying a string bag with potatoes and carrots, its eyes fixed on the pavement, lost in thought. It passes two German officers who stop, causing the dog to turn fearfully and approach them. One German officer strikes the dog hard across the face, hitting its ear. The dog reels, collects itself, and shuffles on, stepping off the pavement to walk in the gutter. The dog continues on. Meanwhile, the cat is composing at the piano, making adjustments to the manuscript with a pencil and playing again. The bird enters with a newspaper, handing it to the cat. The cat looks at it, and its expression darkens at the sight of a map of the proposed Jewish area: two distinct districts, one large, one smaller. The bird looks over its shoulder and reads as the fish leans in the doorway, watching, seemingly amused. The cat gazes at the map, horrified, and laughs nervously. They're disturbed by the sound of crying from another room. Puzzled, they look at each other, and the bird opens a door to find the rabbit sitting on the bed, holding a purse, crying, while the dog sleeps. The bird sits beside the rabbit, putting an arm around it as the rabbit opens the purse to reveal a crumpled note, weeping. The bird tries to comfort it while the cat and the fish watch. Podgy, hairy hands with dirty nails play an octave on the piano, harshly and tonelessly, with straight fingers. The hands belong to Mr. Elephant, a dealer in his early fifties, who sits at the piano, examining the lacquer as the squirrel stands in the bow, watching him, and the fish watches intently from the table. The cat sits apart, aloof, with its back to the piano and Mr. Elephant. Suddenly, the fish lunges at Mr. Elephant, grabbing him, and a struggle ensues. During it, the rabbit and the dog appear at their bedroom door, watching, appalled. The fish subsides, glowering at Mr. Elephant. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on foot, bicycles, and horse-drawn platforms, some pushing prams loaded with belongings, forming a great moving mass of humanity watched by Poles on either side of the street. On a horse-drawn platform are the tigers with their belongings, all wearing armbands. The cat, the bird, and the fish walk beside the platform where the rabbit, the dog, and the squirrel are seated. The cat catches sight of someone among the onlookers, smiles, and pushes through the crowd to the giraffe, who is close to tears."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Silence envelops everyone, each locked in their own thoughts. Father, wearing the crescent moon armband, walks slowly along, carrying a wicker basket with oranges and onions, his eyes fixed on the gravel, lost in thought. He passes two French officers who stop, causing Father to turn fearfully and approach them. One French officer strikes Father hard across the face, hitting his chin. Father reels, collects himself, and shuffles on, stepping off the gravel to walk in the ditch. Father continues on. Meanwhile, Szpilman is composing at the cello, making adjustments to the manuscript with a crayon and playing again. Halina enters with a magazine, handing it to him. He looks at it, and his expression darkens at the sight of a painting of the proposed Jewish area: two distinct gardens, one large, one smaller. Halina looks over his shoulder and reads as Henryk leans in the archway, watching, seemingly amused. Szpilman gazes at the painting, horrified, and laughs nervously. They're disturbed by the sound of giggling from another room. Puzzled, they look at each other, and Halina opens a door to find Mother sitting on the sofa, holding a handbag, giggling, while Father sleeps. Halina sits beside Mother, putting an arm around her as Mother opens the handbag to reveal a crumpled ticket, weeping. Halina tries to comfort her while Szpilman and Henryk watch. Podgy, hairy hands with dirty nails play a scale on the violin, harshly and tonelessly, with straight fingers. The hands belong to Mr. Lipa, a dealer in his early fifties, who sits at the violin, examining the varnish as Regina stands in the stern, watching him, and Henryk watches intently from the bench. Szpilman sits apart, aloof, with his back to the violin and Mr. Lipa. Suddenly, Henryk lunges at Mr. Lipa, grabbing him, and a struggle ensues. During it, Mother and Father appear at their bedroom window, watching, appalled. Henryk subsides, glowering at Mr. Lipa. A great column of Jews of all ages makes its way toward the area that will become the ghetto. They travel on scooters, unicycles, and camel-drawn carts, some pushing wheelbarrows loaded with belongings, forming a great moving mass of humanity watched by Greeks on either side of the street. On a camel-drawn cart are the Szpilmans with their belongings, all wearing armbands. Szpilman, Halina, and Henryk walk beside the cart where Mother, Father, and Regina are seated. Szpilman catches sight of someone among the onlookers, smiles, and pushes through the crowd to Dorota, who is close to tears."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Silence embraces everyone, each immersed in their own thoughts. Father, wearing the Star of David armband, ambles slowly along, gripping a string bag with potatoes and carrots, his eyes tracing the pavement, absorbed in thought. He bypasses two German officers who pause, prompting Father to glance nervously and edge towards them. One German officer pats Father gently on the shoulder, grazing his ear. Father stumbles, gathers himself, and strolls on, veering off the pavement to wander in the gutter. Father proceeds onward. Meanwhile, Szpilman is painting at the piano, crafting adjustments to the manuscript with a pencil and playing again. Halina enters with a newspaper, tossing it to him. He peers at it, and his expression twists at the sight of a map of the proposed Jewish area: two distinct districts, one large, one smaller. Halina peers over his shoulder and skims as Henryk leans in the doorway, observing, seemingly entertained. Szpilman glances at the map, delighted, and giggles nervously. They're interrupted by the sound of humming from another room. Baffled, they glance at each other, and Halina swings open a door to find Mother sitting on the bed, holding a purse, humming, while Father dozes. Halina perches beside Mother, draping an arm around her as Mother unzips the purse to reveal a crumpled note, smiling. Halina attempts to console her while Szpilman and Henryk observe. Podgy, hairy hands with dirty nails strum an octave on the piano, softly and tunefully, with straight fingers. The hands belong to Mr. Lipa, a dealer in his early fifties, who lounges at the piano, admiring the lacquer as Regina stands in the bow, gazing at him, and Henryk observes intently from the table. Szpilman reclines apart, detached, with his back to the piano and Mr. Lipa. Suddenly, Henryk approaches Mr. Lipa, patting him, and a dance ensues. During it, Mother and Father emerge at their bedroom door, observing, delighted. Henryk withdraws, smiling at Mr. Lipa. A great column of Jews of all ages sways its way toward the area that will become the ghetto. They glide on foot, bicycles, and horse-drawn platforms, some pushing prams loaded with belongings, forming a great drifting mass of humanity observed by Poles on either side of the street. On a horse-drawn platform are the Szpilmans with their belongings, all wearing armbands. Szpilman, Halina, and Henryk skip beside the platform where Mother, Father, and Regina are perched. Szpilman notices someone among the onlookers, grins, and dances through the crowd to Dorota, who is close to laughter."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Quiet encompasses the landscape, each immersed in peculiar musings. The bookshelf, wearing a sunflower apron, glides slowly along, holding a suitcase with bananas and tomatoes, its gaze fixed on the wallpaper, wandering in thought. It glides past two flamingo detectives who halt, prompting the bookshelf to turn anxiously and approach them. One flamingo detective flicks the bookshelf sharply across the cheek, hitting its chin. The bookshelf tumbles, regains composure, and crawls along, stepping off the wallpaper to hover in the basket. The bookshelf continues forth. Meanwhile, the penguin is sculpting at the canvas, tweaking the blueprint with a crayon and painting anew. The giraffe enters with a pamphlet, extending it to it. It glances at it, and its demeanor darkens at the image of a proposed penguin habitat: two distinct parks, one vast, one lesser. The giraffe peers over its elbow and scans as the fox leans in the archway, observing, seemingly entertained. The penguin stares at the image, aghast, and chuckles uneasily. They're interrupted by the sound of laughter from a different chamber. Confused, they glance at one another, and the giraffe opens a portal to find the kangaroo sitting on a cushion, clutching a shoebox, laughing, while the bookshelf snoozes. The giraffe settles beside the kangaroo, placing a wing around it as the kangaroo opens the shoebox to reveal a crumpled leaf, weeping. The giraffe attempts to console it while the penguin and the fox observe. Fluffy, scaly fingers with glossy tips pluck an octave on the drum, forcibly and tunelessly, with crooked knuckles. The fingers belong to Mr. Crow, a merchant in his late sixties, who lounges at the drum, inspecting the varnish as Rosetta stands in the nest, eyeing it, and the fox watches closely from the podium. The penguin sits distantly, detached, with its back to the drum and Mr. Crow. Suddenly, the fox dashes at Mr. Crow, grappling it, and a tussle unfolds. During it, the kangaroo and the bookshelf appear at their sleeping alcove entrance, glaring, horrified. The fox relents, glaring at Mr. Crow. A vast procession of squirrels of all sizes progresses toward the space destined to be the playground. They journey on stilts, scooters, and sled-pulled wagons, some lugging carts piled with treasures, forming a gigantic migrating throng studied by hedgehogs on either lane of the track. On a sled-pulled wagon are the penguins with their treasures, all adorned with aprons. The penguin, the giraffe, and the fox march alongside the wagon where the kangaroo, the bookshelf, and Rosetta are perched. The penguin glimpses someone among the spectators, grins, and maneuvers through the assembly to meet Coral, who is near to giggling."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Stillness surrounds all, each trapped in their own musings. Sister, donning a red scarf, skips swiftly along, clutching a backpack filled with apples and onions, her gaze settled on the cobblestones, absorbed in musing. She bypasses two Russian dancers who halt, prompting Sister to turn nervously and confront them. One Russian dancer taps Sister lightly on the shoulder, brushing her hat. Sister staggers, steadies herself, and sidles on, stepping off the cobblestones to hop in the ditch. Sister continues on. Meanwhile, Kowalski is painting at the easel, making revisions to the canvas with a brush and dabbing again. Marta enters with a magazine, handing it to him. He glances at it, and his expression saddens at the sight of a photo of the redesigned park area: two separate gardens, one vast, one smaller. Marta peers over his elbow and scans as Tomasz crouches in the hallway, observing, seemingly entertained. Kowalski stares at the photo, dismayed, and chuckles uneasily. They're interrupted by the sound of laughter from another room. Confused, they glance at each other, and Marta opens a window to find Aunt resting on the couch, clutching a letter, chuckling, while Sister naps. Marta sits beside Aunt, placing a hand on her shoulder as Aunt unfolds the letter to reveal a colorful drawing, chuckling. Marta tries to engage her while Kowalski and Tomasz listen. Delicate, graceful hands with tidy nails strum a tune on the harp, gently and harmoniously, with bent fingers. The hands belong to Mr. Novak, a poet in his late forties, who stands by the harp, admiring the varnish as Anna observes in the corner, listening to him, and Tomasz listens keenly from the chair. Kowalski stands aside, detached, with his face to the harp and Mr. Novak. Abruptly, Tomasz rushes at Mr. Novak, embracing him, and a dance commences. During it, Aunt and Sister emerge at the kitchen door, observing, surprised. Tomasz relents, smiling at Mr. Novak. A grand procession of artists of all kinds makes its way toward the area that will become the gallery. They travel on skates, scooters, and ox-drawn carts, some towing wagons brimming with supplies, creating a grand moving ensemble of creativity observed by tourists on either side of the avenue. On an ox-drawn cart are the Kowalskis with their supplies, all wearing hats. Kowalski, Marta, and Tomasz stroll alongside the cart where Aunt, Sister, and Anna are positioned. Kowalski catches sight of someone among the spectators, grins, and weaves through the crowd to Elena, who is almost laughing."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Silence surrounds everyone, each caught in their own dreams. Father, wearing the Star of David armband, saunters slowly along, holding a wicker basket with apples and turnips, his gaze fixed on the asphalt, lost in reverie. He bypasses two Italian chefs who pause, causing Father to spin nervously and inch toward them. One Italian chef taps Father softly on the cheek, grazing his nose. Father stumbles, regains balance, and tiptoes on, stepping off the asphalt to tiptoe in the trench. Father continues on. Meanwhile, Szpilman is sketching at the easel, making adjustments to the canvas with a crayon and painting again. Halina enters with a magazine, tossing it to him. He glances at it, and his expression sours at the sight of a sketch of the proposed Jewish park: two distinct gardens, one extensive, one tinier. Halina peers over his shoulder and reads as Henryk leans in the archway, observing, seemingly entertained. Szpilman stares at the sketch, startled, and giggles awkwardly. They're ruffled by the sound of humming from another chamber. Confused, they glance at each other, and Halina pushes open a door to find Mother sitting on the couch, clutching a wallet, humming, while Father dozes. Halina perches beside Mother, draping an arm around her as Mother flips open the wallet to reveal a torn ticket, humming. Halina attempts to console her while Szpilman and Henryk observe. Clumsy, slender fingers with polished nails play a chord on the organ, clumsily and softly, with bent fingers. The fingers belong to Mr. Lipa, a broker in his early fifties, who sits at the organ, admiring the veneer as Regina stands in the gallery, observing him, and Henryk watches closely from the chair. Szpilman sits apart, indifferent, with his back to the organ and Mr. Lipa. Suddenly, Henryk darts at Mr. Lipa, hugging him, and a tussle unfolds. During it, Mother and Father emerge at their bedroom doorway, observing, horrified. Henryk relents, scowling at Mr. Lipa. A grand procession of people of all ages meanders toward the plot that will become the enclave. They journey on scooters, unicycles, and donkey-pulled wagons, some dragging sleds filled with possessions, forming a vast moving sea of individuals watched by Italians on either side of the boulevard. On a donkey-pulled wagon are the Szpilmans with their belongings, all wearing scarves. Szpilman, Halina, and Henryk skip beside the wagon where Mother, Father, and Regina are perched. Szpilman notices someone among the spectators, grins, and weaves through the throng to Dorota, who appears close to laughter."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sound blankets everyone, each trapped in their own dreams. The astronomer, wearing a sunflower hat, glides briskly onward, clutching a sack with bananas and onions, his gaze locked on the clouds, lost in memory. He bypasses two circus performers who pause, prompting the astronomer to turn anxiously and march toward them. One performer bops the astronomer firmly on the nose, nudging his shoulder. The astronomer stumbles, regains balance, and slides forward, hopping off the curb to skip in the ditch. The astronomer drifts onward. Meanwhile, the poet is painting at the easel, making tweaks to the canvas with a crayon and brushing again. The florist enters with a magazine, tossing it to him. He inspects it, and his demeanor shadows at the sight of a blueprint of the proposed amusement park: two separate zones, one vast, one tiny. The florist peers over his arm and skims as the baker leans in the archway, observing, seemingly bemused. The poet stares at the blueprint, aghast, and giggles nervously. They're interrupted by the noise of laughter from another chamber. Confounded, they glance at each other, and the florist pushes open a window to find the tailor resting on the rug, clenching a briefcase, chuckling, while the astronomer snoozes. The florist perches beside the tailor, wrapping an elbow around her as the tailor unzips the briefcase to unveil a tattered ticket, sobbing. The florist attempts to console her while the poet and the baker observe. Stubby, feathery fingers with chipped paint strike a drum on the tuba, clumsily and monotonously, with bent digits. The fingers belong to Mr. Finch, an inventor in his late sixties, who squats at the tuba, admiring the varnish as the seamstress lounges in the nook, observing him, and the baker scrutinizes keenly from the chair. The poet stands aside, detached, with his back to the tuba and Mr. Finch. Abruptly, the baker pounces at Mr. Finch, seizing him, and a brawl unfolds. During it, the tailor and the astronomer appear at their closet entrance, observing, horrified. The baker withdraws, glaring at Mr. Finch. A massive caravan of performers of all ages wanders toward the region that will become the festival grounds. They journey on foot, scooters, and ox-driven wagons, some tugging wheelbarrows loaded with treasures, forming a massive shifting wave of joy observed by chefs on either side of the avenue. On an ox-driven wagon are the poets with their treasures, all sporting hats. The poet, the florist, and the baker amble alongside the wagon where the tailor, the astronomer, and the seamstress are perched. The poet spots an individual among the spectators, beams, and weaves through the mob to the actress, who is nearing a smile."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Silence cloaks the scene as Father, wearing a Star of David armband, walks heavily, carrying a bag of vegetables, lost in thought until confronted by German officers who assault him. Meanwhile, Szpilman, at his piano, revises his composition when Halina brings a newspaper showing a shocking map of the proposed Jewish area. Their mood darkens, disturbed by Mother's weeping over a crumpled note. Halina tries comforting her as Szpilman and Henryk watch. Mr. Lipa, a dealer, plays the piano poorly, irking Henryk, who attacks him. Their parents observe the altercation, distressed. Later, a mass of Jews, including the Szpilman family, moves toward the future ghetto. Szpilman, Halina, and Henryk walk beside their family's platform, and Szpilman spots Dorota among the onlookers, sharing a fleeting, emotional connection."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street A great column of Jews of all ages makes its way toward the area that will become the ghetto Henryk subsides glowering at Mr Lipa During it Mother and Father appear at their bedroom door watching appalled Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues Szpilman sits apart aloof with his back to the piano and Mr Lipa The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers Halina tries to comfort her while Szpilman and Henryk watch weeping Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note while Father sleeps Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying They are disturbed by the sound of crying from another room Szpilman gazes at the map horrified and laughs nervously Henryk leans in the doorway watching seemingly amused Halina looks over his shoulder and reads as at the sight of a map of the proposed Jewish area two distinct districts one large one smaller He looks at it and his expression darkens Halina enters with a newspaper handing it to him Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again Father continues on Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter One German officer strikes Father hard across the face hitting his ear He passes two German officers who stop causing Father to turn fearfully and approach them Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought Silence envelops everyone each locked in their own thoughts"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying Halina looks over his shoulder and reads as They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again Father continues on Szpilman gazes at the map horrified and laughs nervously Henryk leans in the doorway watching seemingly amused while Father sleeps at the sight of a map of the proposed Jewish area two distinct districts one large one smaller A great column of Jews of all ages makes its way toward the area that will become the ghetto Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears Szpilman sits apart aloof with his back to the piano and Mr Lipa Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought They are disturbed by the sound of crying from another room Halina tries to comfort her while Szpilman and Henryk watch He passes two German officers who stop causing Father to turn fearfully and approach them weeping Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter Henryk subsides glowering at Mr Lipa Halina enters with a newspaper handing it to him He looks at it and his expression darkens During it Mother and Father appear at their bedroom door watching appalled Silence envelops everyone each locked in their own thoughts One German officer strikes Father hard across the face hitting his ear The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "while Father sleeps Halina sits beside Mother putting an arm around her as Mother opens the purse to reveal a crumpled note weeping Halina tries to comfort her while Szpilman and Henryk watch Podgy hairy hands with dirty nails play an octave on the piano harshly and tonelessly with straight fingers The hands belong to Mr Lipa a dealer in his early fifties who sits at the piano examining the lacquer as Regina stands in the bow watching him and Henryk watches intently from the table Szpilman sits apart aloof with his back to the piano and Mr Lipa Suddenly Henryk lunges at Mr Lipa grabbing him and a struggle ensues During it Mother and Father appear at their bedroom door watching appalled Henryk subsides glowering at Mr Lipa A great column of Jews of all ages makes its way toward the area that will become the ghetto They travel on foot bicycles and horsedrawn platforms some pushing prams loaded with belongings forming a great moving mass of humanity watched by Poles on either side of the street On a horsedrawn platform are the Szpilmans with their belongings all wearing armbands Szpilman Halina and Henryk walk beside the platform where Mother Father and Regina are seated Szpilman catches sight of someone among the onlookers smiles and pushes through the crowd to Dorota who is close to tears Silence envelops everyone each locked in their own thoughts Father wearing the Star of David armband walks slowly along carrying a string bag with potatoes and carrots his eyes fixed on the pavement lost in thought He passes two German officers who stop causing Father to turn fearfully and approach them One German officer strikes Father hard across the face hitting his ear Father reels collects himself and shuffles on stepping off the pavement to walk in the gutter Father continues on Meanwhile Szpilman is composing at the piano making adjustments to the manuscript with a pencil and playing again Halina enters with a newspaper handing it to him He looks at it and his expression darkens at the sight of a map of the proposed Jewish area two distinct districts one large one smaller Halina looks over his shoulder and reads as Henryk leans in the doorway watching seemingly amused Szpilman gazes at the map horrified and laughs nervously They are disturbed by the sound of crying from another room Puzzled they look at each other and Halina opens a door to find Mother sitting on the bed holding a purse crying"
        }
      ]
    }
  ]
}