{
  "ground_truth": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto, with few people around, mostly beggars and children. As they climb the bridge's stairs, Henryk stumbles and sinks to his knees, but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek. The kitchen is small and busy with cooks, waiters, and washers-up. A dense crowd of people crosses the bridge in both directions. Szpilman, shabby and unshaven, hurries along and encounters Jehuda Zyskind with Majorek. They stop but are buffeted by the crowd. Meanwhile, cars, trams, pedestrians, and German guards are in the street below. Schultz, a fat, sweaty German, fills out a form while Majorek stands beside him, chatting and laughing quietly. Szpilman and Father stand in the doorway of a small office on an upper level, overlooking a factory floor where Jewish men and women work at sewing machines, creating a terrible clatter. The name 'Samuel Szpilman' is written on a certificate, which Schultz stamps and hands to Majorek, who gives it to Father. A great mass of agitated people crosses from the small ghetto to the large ghetto, carrying their belongings as a German film crew records. They struggle across the bridge, and a truck backs up, revealing a load of furniture, linen, clothing, mirrors, carpets, and bedclothes. Three Jews in the van unload the items, and the Szpilman family, along with others, stands ready to sort them. Szpilman and Henryk sort carpets, Father sorts mirrors, Regina sorts linen, and Halina and Mother sort clothing. They carry the items into a warehouse that resembles an Aladdin's cave, filled with similar objects. The activity continues in a large room separated by an improvised partition of blankets for men and women, with three-tiered bunks. On the men's side, Father is on the upper bunk, and Henryk is on the lower. Suddenly, a volley of shots and German voices are heard. Szpilman slips off his bunk, hurries to the door, opens it, and comes face to face with a German NCO and soldiers. The NCO hits Szpilman across the face, then turns and leaves.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Szpilman and Henryk strive frantically as they commence to stroll and persist on their route. They reach at a timber span built to connect the diminutive ghetto to the expansive ghetto, with few individuals around, mainly paupers and youngsters. As they ascend the bridge's steps, Henryk falters and collapses to his knees, but Szpilman aids him rise and supports him towards the rear of a bistro where Henryk completes a bowl of broth and a slice of loaf while seated with Szpilman and Benek. The galley is compact and bustling with chefs, servers, and dishwashers. A thick throng of individuals traverses the bridge in both directions. Szpilman, ragged and unkempt, hastens along and meets Jehuda Zyskind with Majorek. They halt but are jostled by the throng. Meanwhile, vehicles, streetcars, foot traffic, and German sentries are in the thoroughfare below. Schultz, a corpulent, perspiring German, fills out a document while Majorek stands beside him, conversing and chuckling softly. Szpilman and Father stand in the entryway of a compact bureau on an upper tier, overlooking a workshop floor where Jewish men and women labor at stitching apparatuses, generating a dreadful racket. The term 'Samuel Szpilman' is inscribed on a credential, which Schultz marks and hands to Majorek, who gives it to Father. A vast crowd of disturbed individuals crosses from the diminutive ghetto to the expansive ghetto, bearing their possessions as a German movie crew captures. They labor across the span, and a lorry backs up, revealing a cargo of furnishings, fabric, garments, looking glasses, rugs, and bedclothes. Three Hebrews in the transport unload the articles, and the Szpilman family, along with others, stands prepared to categorize them. Szpilman and Henryk categorize rugs, Father categorizes looking glasses, Regina categorizes fabric, and Halina and Mother categorize garments. They convey the articles into a storeroom that mirrors an Aladdin's grotto, filled with analogous objects. The operation persists in a spacious chamber divided by a makeshift partition of blankets for men and women, with three-tiered bunks. On the men's side, Father is on the upper berth, and Henryk is on the lower. Suddenly, a salvo of shots and German voices are perceived. Szpilman descends off his bunk, rushes to the entrance, opens it, and confronts a German NCO and soldiers. The NCO strikes Szpilman across the visage, then turns and departs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Szpilman and Henryk are desperately struggled with as they begin to walk and continue on their way. A wooden bridge that links the small ghetto to the large ghetto is arrived at by them, with few people around, mostly beggars and children. As the bridge's stairs are climbed by them, Henryk stumbles and sinks to his knees, but he is helped to stand by Szpilman, who supports him towards the back of a cafe. A bowl of soup and a piece of bread are finished by Henryk while he sits with Szpilman and Benek. Cooks, waiters, and washers-up keep the small kitchen busy. The bridge is crossed in both directions by a dense crowd of people. Jehuda Zyskind is encountered by Szpilman, shabby and unshaven, along with Majorek. They are stopped by the crowd but are buffeted by it. Meanwhile, cars, trams, pedestrians, and German guards fill the street below. A form is filled out by Schultz, a fat, sweaty German, while beside him, Majorek stands, chatting and laughing quietly. Szpilman and Father stand in the doorway of a small office on an upper level, overlooking a factory floor where sewing machines create a terrible clatter as Jewish men and women work. Schultz writes 'Samuel Szpilman' on a certificate, stamps it, and hands it to Majorek, who then gives it to Father. A great mass of agitated people struggles to cross the bridge from the small ghetto to the large ghetto, carrying their belongings as a German film crew records the scene. A load of furniture, linen, clothing, mirrors, carpets, and bedclothes is revealed by a truck that backs up. The items are unloaded by three Jews in the van, and the Szpilman family, along with others, stands ready to sort them. Carpets are sorted by Szpilman and Henryk, mirrors by Father, linen by Regina, and clothing by Halina and Mother. The items are carried by them into a warehouse that resembles an Aladdin's cave, filled with similar objects. Activity is continued in a large room separated by an improvised partition of blankets for men and women, with three-tiered bunks. Father is on the upper bunk on the men's side, and Henryk is on the lower. Suddenly, a volley of shots and German voices are heard. Szpilman hurries to the door after slipping off his bunk, opens it, and comes face to face with a German NCO and soldiers. Szpilman is hit across the face by the NCO, who then turns and leaves."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Szpilman and Henryk struggle as they walk towards a wooden bridge connecting the small and large ghettos, surrounded by few people, mainly beggars and children. Henryk stumbles, but Szpilman helps him to a cafe where Henryk eats soup and bread with Szpilman and Benek. The kitchen is bustling with staff. A dense crowd crosses the bridge. Szpilman, shabby and unshaven, meets Jehuda Zyskind and Majorek but is jostled by the crowd. Below, cars, trams, pedestrians, and German guards fill the street. Schultz, a fat German, fills out a form while chatting with Majorek. Szpilman and Father stand in a small office overlooking a loud factory floor. Schultz stamps a certificate with 'Samuel Szpilman' and hands it to Majorek for Father. A mass of people crosses to the large ghetto with belongings, as a German film crew records. A truck unloads furniture, and the Szpilmans sort items like carpets, mirrors, linen, and clothing, placing them in a cavernous warehouse. In a room separated by blankets into men's and women's areas, Father and Henryk rest on bunks. Shots and German voices erupt; Szpilman rushes to the door and encounters a German NCO who strikes him, then leaves."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Szpilman and Henryk struggle while walking and reach a bridge linking the small and large ghettos, with few people around. Henryk stumbles, but Szpilman helps him to a cafe where Henryk eats with Szpilman and Benek. The kitchen is busy, and a crowd crosses the bridge. Szpilman, shabby and unshaven, meets Jehuda Zyskind and Majorek but are jostled by the crowd. Below, cars, trams, and pedestrians are watched by German guards. Schultz, a German, fills out a form beside Majorek. Szpilman and Father stand in an office overlooking a factory of noisy sewing machines. 'Samuel Szpilman' is on a certificate that Schultz stamps and gives to Father. Agitated people cross the bridge with belongings as a German film crew records. A truck reveals furniture and belongings, which the Szpilman family sorts. In a large room divided by blankets, Father and Henryk are on bunks. Shots and German voices are heard; Szpilman opens the door and is hit by a German NCO."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Szpilman and Henryk find themselves in a desperate struggle for survival as they begin to walk together and continue on their arduous journey. They eventually arrive at a wooden bridge, thoughtfully constructed to connect the smaller ghetto to the larger one. The bridge is sparsely populated, with only a handful of people around, mostly beggars and children. As they start to climb the narrow stairs of the bridge, Henryk, weakened, stumbles and sinks down to his knees, but Szpilman selflessly helps him to his feet again and steadfastly supports him on their way to the back of a small, bustling cafe. Inside, Henryk gratefully finishes a bowl of soup and a piece of bread while seated with Szpilman and Benek. The kitchen area is cramped and full of activity, crowded with busy cooks, hurried waiters, and washers-up. Outside, a dense throng of people can be seen moving back and forth across the bridge in both directions. Szpilman, looking shabby and unshaven, quickly makes his way along and soon encounters Jehuda Zyskind accompanied by Majorek. They pause momentarily, but the relentless swell of the crowd pushes them around. At the same time, below on the street, cars, trams, pedestrians, and German guards fill the scene. Schultz, a rotund and sweaty German official, is busy completing a form while Majorek stands beside him, engaging in a quiet exchange of conversation and laughter. Szpilman, along with Father, stands at the doorway of a small office on an upper level, which overlooks a factory floor where Jewish men and women diligently work at sewing machines, creating a cacophony of noise. The name 'Samuel Szpilman' is prominently written on a certificate, which Schultz stamps authoritatively before handing it over to Majorek, who then passes it to Father. A vast, agitated crowd of people makes their way from the small ghetto to the large ghetto, carrying their belongings as a German film crew records the scene. They struggle across the bridge, and a truck reverses into view, revealing a mound of furniture, linens, clothing, mirrors, carpets, and bedclothes. Three Jewish men in the van begin unloading these items, and the Szpilman family, along with others, stands ready to sort through them. Szpilman and Henryk organize the carpets, Father is tasked with the mirrors, Regina sorts the linens, and Halina and Mother categorize the clothing. They carry all these items into a warehouse that resembles an Aladdin's cave, filled with similar objects. The sorting activity takes place in a large room divided by an improvised partition made of blankets, separating spaces for men and women and featuring three-tiered bunks. On the men's side, Father takes a place on the upper bunk, while Henryk claims the lower one. Out of nowhere, a sudden volley of shots rings out, accompanied by the harsh voices of German soldiers. Szpilman quickly slips off his bunk, hurries over to the door, opens it, and finds himself face to face with a German NCO and several soldiers. The NCO strikes Szpilman across the face before turning away and leaving abruptly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Szpilman and Henryk, thrust into a dire and urgent fight for survival, find themselves walking side by side as they embark on their difficult and demanding journey. After what feels like an eternity, they finally arrive at a wooden bridge, which has been thoughtfully and meticulously constructed to serve as a connection between the smaller ghetto and the significantly larger one. The bridge is sparsely populated, with only a handful of individuals present, primarily beggars and curious children. As they begin their ascent up the narrow and somewhat precarious stairs of the bridge, Henryk, weakened by exhaustion, stumbles and collapses, sinking down to his knees. However, Szpilman, with great selflessness and determination, helps him to his feet again and steadfastly supports him as they make their way to the back of a small yet bustling cafe. Inside this cafe, Henryk gratefully finishes a bowl of soup and a morsel of bread while sitting alongside Szpilman and Benek. The kitchen area is cramped and embodies a hive of activity, filled to the brim with busy cooks, hurried waiters, and diligent washers-up. Outside, a dense throng of people can be seen continuously moving back and forth across the bridge in both directions, creating a lively scene. \n\nSzpilman, appearing shabby and unkempt, makes his way quickly along and soon encounters Jehuda Zyskind accompanied by Majorek. They pause momentarily, but the relentless and unyielding swell of the crowd pushes them around, jostling them slightly. Meanwhile, down below on the street, cars, trams, pedestrians, and German guards fill the scene, painting a busy and chaotic picture. Schultz, a rotund and sweaty German official, is preoccupied with completing a form while Majorek stands beside him, engaging in a quiet exchange of conversation peppered with laughter. Szpilman, along with his father, stands on the threshold of a small office located on an upper level, which overlooks a factory floor where Jewish men and women are diligently working at sewing machines, creating a cacophony of noise. The name 'Samuel Szpilman' is prominently displayed on a certificate, which Schultz stamps with authority before handing it over to Majorek, who then passes it on to Father. \n\nA vast, agitated crowd of people makes their way from the confines of the small ghetto to the larger one, carrying with them all their belongings as a German film crew diligently records the entire scene. They struggle across the bridge, and as if on cue, a truck reverses into the scene, revealing a mound of furniture, linens, clothing, mirrors, carpets, and bedclothes. Three Jewish men in the van begin the task of unloading these items, and the Szpilman family, along with others, stands ready to meticulously sort through them. Szpilman and Henryk take on the task of organizing the carpets, Father is tasked with the mirrors, Regina sorts through the linens, and Halina and Mother categorize the clothing. They transport all these items into a warehouse that resembles an Aladdin's cave, filled to the brim with similar objects. The sorting activity takes place in a large room divided by an improvised partition made of blankets, effectively separating spaces for men and women and featuring three-tiered bunks. On the men’s side, Father takes a place on the upper bunk, while Henryk claims the lower one. Out of nowhere, a startling volley of shots rings out, accompanied by the harsh voices of German soldiers. Szpilman quickly and urgently slips off his bunk, hurries over to the door, opens it, and finds himself face to face with a German NCO and several soldiers. The NCO strikes Szpilman across the face before turning away and leaving in an abrupt manner."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Szpilman and Henryk embark on their journey, they struggle desperately, mustering their strength to continue walking forward. Each step is heavy, yet they push onwards, eventually arriving at a wooden bridge that spans the gap between the small ghetto and the large ghetto. The area around the bridge is sparsely populated, with only a few beggars and children lingering nearby. Approaching the bridge, they begin their ascent up the stairs, each footfall deliberate on the wooden steps. As they climb, Henryk's strength falters, causing him to stumble and collapse onto his knees. Szpilman quickly reaches out, lending his support to help Henryk regain his footing, and together they make their way to the back of a nearby café. Inside, the café's kitchen is bustling with activity, a hive of cooks, waiters, and washers-up moving in a coordinated dance as they manage the day's business. Seated with Szpilman and Benek, Henryk takes a moment to finish a bowl of soup and a piece of bread, savoring the small comfort in their company. Meanwhile, outside, life bustles on as a dense crowd of people continuously crosses the bridge in both directions, moving like a river of humanity. Among the jostling throng, Szpilman, looking shabby and unshaven, hurries along, his pace quick as he makes his way through the crowd. He encounters Jehuda Zyskind with Majorek, and they pause momentarily, engaging in conversation despite being buffeted by the relentless flow of the crowd. Below on the street, cars zip past, trams clatter along their tracks, pedestrians weave through the chaos, and German guards maintain their watchful presence. In the midst of this scene, Schultz, a hefty, perspiring German, is busy filling out a form, his focus shifting occasionally as Majorek stands beside him, the two sharing quiet laughter and chatter. On an upper level, Szpilman and his Father stand in the doorway of a small office that overlooks a factory floor. Down below, Jewish men and women are hard at work, operating sewing machines that fill the air with a terrible clatter. Observing this industrial symphony, they see the name 'Samuel Szpilman' written on a certificate, which Schultz stamps efficiently before handing it to Majorek, who in turn gives it to Father. Amidst the ongoing bustle, a great mass of agitated people move in waves from the small ghetto to the large ghetto, each person burdened with their belongings. The German film crew captures every moment, their cameras recording the scene as people struggle across the bridge. A truck reverses into view, revealing its load of furniture, linen, clothing, mirrors, carpets, and bedclothes. Inside the vehicle, three Jewish men hastily unload the items, while the Szpilman family, along with others, stands ready to sort through the assorted belongings. Szpilman and Henryk focus on sorting carpets; Father attends to the mirrors; Regina meticulously sorts the linen; and Halina and Mother organize the clothing. Together, they transport the items into a warehouse, a space that resembles an Aladdin's cave, brimming with similar objects stacked and sorted. The bustling activity continues in a large room, where an improvised partition of blankets creates distinct areas for men and women, each side furnished with three-tiered bunks. On the men's side, Father occupies the upper bunk, while Henryk rests on the lower one. Suddenly, a startling volley of gunfire echoes through the space, accompanied by the harsh bark of German voices. Reacting swiftly, Szpilman slips down from his bunk, urgency in his movements as he rushes to the door. He opens it with apprehension, coming face to face with a German NCO and his soldiers. The NCO, without hesitation, strikes Szpilman across the face, the impact harsh and sudden, before turning on his heel and leaving without another word."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Szpilman and Henryk struggle on their journey, arriving at a wooden bridge connecting the small ghetto to the large one, sparsely populated with beggars and children. Ascending the stairs, Henryk stumbles, but Szpilman helps him and they proceed to a cafe where Henryk shares a meal with Szpilman and Benek amidst a bustling kitchen. A dense crowd crosses the bridge above cars, trams, and pedestrians watched by German guards below. Szpilman, unkempt, hurries through this scene, encountering Jehuda Zyskind and Majorek but is jostled by the crowd. Nearby, Schultz, a German, fills out a form, conversing with Majorek who stands by. Szpilman and his father observe from an office overlooking a factory with Jewish workers at sewing machines. Schultz stamps a certificate for Samuel Szpilman, which Majorek passes to Father. An agitated mass crosses from the small to the large ghetto under the watch of a German film crew, as a truck reveals furniture and personal items. Szpilman, his family, and others sort these belongings in a warehouse resembling an Aladdin's cave. Men and women continue their activities in a large partitioned room with tiered bunks, where Father and Henryk rest. Suddenly, shots and German voices echo. Szpilman, reacting quickly, confronts a German NCO at the door, who strikes him before leaving."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Szpilman and Henryk, caught in the dire realities of life in wartime Warsaw, struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge in the Warsaw Ghetto, constructed during the Nazi occupation to link the small ghetto to the large ghetto, with few people around, mostly beggars and children, remnants of a once-thriving community. As they climb the bridge's stairs, Henryk, weakened by malnutrition common among the ghetto inhabitants, stumbles and sinks to his knees, but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread—staple foods in short supply—while sitting with Szpilman and Benek. The kitchen is small and busy with cooks, waiters, and washers-up, a testament to the hidden resilience of daily life despite the circumstances. A dense crowd of people crosses the bridge in both directions, reflecting the daily struggle for survival. Szpilman, shabby and unshaven, hurries along and encounters Jehuda Zyskind, an old friend from before the war, with Majorek, known for his smuggling activities that help sustain many in the ghetto. They stop but are buffeted by the crowd, symbolizing the chaos and movement of displaced lives. Meanwhile, cars, trams, pedestrians, and German guards create a tense backdrop in the street below. Schultz, a fat, sweaty German official, fills out a form while Majorek stands beside him, chatting and laughing quietly, masking the underlying tension of dealing with oppressors. Szpilman and Father stand in the doorway of a small office on an upper level, overlooking a factory floor where Jewish men and women work at sewing machines, creating a terrible clatter reminiscent of industrial efforts commandeered by the occupying forces. The name 'Samuel Szpilman,' a reminder of the family’s proud identity, is written on a certificate, which Schultz stamps and hands to Majorek, who gives it to Father, a bureaucratic gesture with life-or-death importance. A great mass of agitated people crosses from the small ghetto to the large ghetto, carrying their belongings as a German film crew records, documenting propaganda to distort the grim reality. They struggle across the bridge, and a truck backs up, revealing a load of furniture, linen, clothing, mirrors, carpets, and bedclothes, possessions stripped from those deported or worse. Three Jews in the van unload the items, and the Szpilman family, along with others, stands ready to sort them, a task that painfully connects them to lost compatriots. Szpilman and Henryk sort carpets, Father sorts mirrors, Regina sorts linen, and Halina and Mother sort clothing. They carry the items into a warehouse that resembles an Aladdin's cave, filled with similar objects, a stark contrast between the magical imagery and the harsh reality of plunder. The activity continues in a large room separated by an improvised partition of blankets for men and women, with three-tiered bunks that reflect the overcrowding experienced by many. On the men's side, Father is on the upper bunk, and Henryk is on the lower, both trying to rest amid the turmoil. Suddenly, a volley of shots and German voices are heard, instilling fear that permeates ghetto life. Szpilman slips off his bunk, hurries to the door, opens it, and comes face to face with a German NCO and soldiers, the embodiment of the ever-present threat. The NCO hits Szpilman across the face, a typical act of unchecked brutality, then turns and leaves."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Meanwhile cars trams pedestrians and German guards are in the street below On the men's side Father is on the upper bunk and Henryk is on the lower Szpilman and Henryk struggle desperately as they begin to walk and continue on their way The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children The NCO hits Szpilman across the face then turns and leaves As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek The kitchen is small and busy with cooks waiters and washersup A dense crowd of people crosses the bridge in both directions Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek They stop but are buffeted by the crowd Meanwhile cars trams pedestrians and German guards are in the street below Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father Szpilman and Henryk struggle desperately as they begin to walk and continue on their way They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks The kitchen is small and busy with cooks waiters and washersup On the men's side Father is on the upper bunk and Henryk is on the lower Suddenly a volley of shots and German voices are heard Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers The NCO hits Szpilman across the face then turns and leaves"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children. As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek. The kitchen is small and busy with cooks waiters and washersup. A dense crowd of people crosses the bridge in both directions. Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek. They stop but are buffeted by the crowd. Meanwhile cars trams pedestrians and German guards are in the street below. Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly. Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father. A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records. They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes. Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them. Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing. They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects. The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks. On the men's side Father is on the upper bunk and Henryk is on the lower. Suddenly a volley of shots and German voices are heard. Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers. The NCO hits Szpilman across the face then turns and leaves."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children. As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek. The kitchen is small and busy with cooks waiters and washersup. A dense crowd of people crosses the bridge in both directions. Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek. They stop but are buffeted by the crowd. Meanwhile cars trams pedestrians and German guards are in the street below. Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly. Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father. A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records. They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes. Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them. Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing. They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects. The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks. On the men's side Father is on the upper bunk and Henryk is on the lower. Suddenly a volley of shots and German voices are heard. Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers. The NCO hits Szpilman across the face then turns and leaves."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children. As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek. The kitchen is small and busy with cooks waiters and washersup. A dense crowd of people crosses the bridge in both directions. They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects. The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks. On the men's side Father is on the upper bunk and Henryk is on the lower. Suddenly a volley of shots and German voices are heard. Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers. The NCO hits Szpilman across the face then turns and leaves."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children. Suddenly a volley of shots and German voices are heard. Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers. The NCO hits Szpilman across the face then turns and leaves."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe and the hamster struggle desperately as they begin to walk and continue on their way. They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto, with few people around, mostly beggars and children. As they climb the bridge's stairs, the hamster stumbles and sinks to his knees, but the giraffe helps him stand and supports him towards the back of a cafe where the hamster finishes a bowl of soup and a piece of bread while sitting with the giraffe and the squirrel. The kitchen is small and busy with cooks, waiters, and washers-up. A dense crowd of people crosses the bridge in both directions. The giraffe, shabby and unshaven, hurries along and encounters the walrus with the flamingo. They stop but are buffeted by the crowd. Meanwhile, cars, trams, pedestrians, and German guards are in the street below. The penguin, a fat, sweaty German, fills out a form while the flamingo stands beside him, chatting and laughing quietly. The giraffe and the elephant stand in the doorway of a small office on an upper level, overlooking a factory floor where Jewish men and women work at sewing machines, creating a terrible clatter. The name 'Samuel Szpilman' is written on a certificate, which the penguin stamps and hands to the flamingo, who gives it to the elephant. A great mass of agitated people crosses from the small ghetto to the large ghetto, carrying their belongings as a German film crew records. They struggle across the bridge, and a truck backs up, revealing a load of furniture, linen, clothing, mirrors, carpets, and bedclothes. Three tortoises in the van unload the items, and the giraffe family, along with others, stands ready to sort them. The giraffe and the hamster sort carpets, the elephant sorts mirrors, the octopus sorts linen, and the flamingo and the koala sort clothing. They carry the items into a warehouse that resembles an Aladdin's cave, filled with similar objects. The activity continues in a large room separated by an improvised partition of blankets for men and women, with three-tiered bunks. On the men's side, the elephant is on the upper bunk, and the hamster is on the lower. Suddenly, a volley of shots and German voices are heard. The giraffe slips off his bunk, hurries to the door, opens it, and comes face to face with a German NCO and soldiers. The NCO hits the giraffe across the face, then turns and leaves."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Szpilman and Henryk struggle desperately as they begin to walk and continue on their way. They arrive at a stone fountain constructed to link the small park to the large park, with few people around, mostly vendors and animals. As they climb the fountain's steps, Henryk stumbles and sinks to his knees, but Szpilman helps him stand and supports him towards the back of a bakery where Henryk finishes a plate of pasta and a slice of cake while sitting with Szpilman and Benek. The dining area is small and busy with bakers, servers, and cashiers. A dense crowd of people crosses the fountain in both directions. Szpilman, shabby and unshaven, hurries along and encounters Jehuda Zyskind with Majorek. They stop but are buffeted by the crowd. Meanwhile, bikes, buses, skateboarders, and police officers are in the street below. Schultz, a tall, sweaty officer, fills out a checklist while Majorek stands beside him, chatting and laughing quietly. Szpilman and Father stand in the doorway of a small studio on an upper level, overlooking a workshop floor where Jewish men and women work at typewriters, creating a terrible clatter. The name 'Samuel Szpilman' is written on a voucher, which Schultz stamps and hands to Majorek, who gives it to Father. A great mass of agitated people crosses from the small park to the large park, carrying their belongings as a news crew records. They struggle across the fountain, and a bus backs up, revealing a load of suitcases, paintings, books, vases, curtains, and blankets. Three Jews in the vehicle unload the items, and the Szpilman family, along with others, stands ready to sort them. Szpilman and Henryk sort vases, Father sorts paintings, Regina sorts books, and Halina and Mother sort curtains. They carry the items into a storage area that resembles a treasure trove, filled with similar objects. The activity continues in a large chamber separated by an improvised partition of sheets for men and women, with stacked benches. On the men's side, Father is on the upper bench, and Henryk is on the lower. Suddenly, a volley of shots and police voices are heard. Szpilman slips off his bench, hurries to the door, opens it, and comes face to face with a police sergeant and officers. The sergeant hits Szpilman across the face, then turns and leaves."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Szpilman and Henryk dance awkwardly as they begin to skip and continue on their way. They pause at a wooden bridge constructed to separate the small ghetto from the large ghetto, with few people around, mostly beggars and children. As they slide up the bridge's stairs, Henryk jumps and rises to his knees, but Szpilman cheers him up and guides him towards the back of a cafe where Henryk examines a bowl of soup and a piece of bread while sitting with Szpilman and Benek. The kitchen is small and lively with cooks, waiters, and washers-up. A dense crowd of people spins on the bridge in both directions. Szpilman, shabby and unshaven, wanders along and greets Jehuda Zyskind with Majorek. They pause but are nudged by the crowd. Meanwhile, cars, trams, pedestrians, and German guards are in the street nearby. Schultz, a fat, sweaty German, scribbles on a form while Majorek reclines beside him, singing and smiling quietly. Szpilman and Father lean in the doorway of a small office on an upper level, overlooking a factory floor where Jewish men and women stand at sewing machines, creating a terrible clatter. The name 'Samuel Szpilman' is etched on a certificate, which Schultz folds and shows to Majorek, who delivers it to Father. A large mass of restless people strolls from the small ghetto to the large ghetto, carrying their belongings as a German film crew records. They pace across the bridge, and a truck moves forward, revealing a pile of furniture, linen, clothing, mirrors, carpets, and bedclothes. Three Jews in the van lift the items, and the Szpilman family, along with others, stands ready to examine them. Szpilman and Henryk inspect carpets, Father inspects mirrors, Regina inspects linen, and Halina and Mother inspect clothing. They haul the items into a warehouse that resembles an Aladdin's cave, filled with similar objects. The activity continues in a large room divided by an improvised partition of blankets for men and women, with three-tiered bunks. On the men's side, Father is on the upper bunk, and Henryk is on the lower. Suddenly, a volley of claps and German voices are heard. Szpilman jumps off his bunk, dashes to the door, swings it, and comes face to face with a German NCO and soldiers. The NCO shakes Szpilman across the face, then turns and departs."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blender and Toaster struggle desperately as they begin to walk and continue on their way. They arrive at a glass skyscraper constructed to link the tiny island to the vast continent, with few animals around, mostly pigeons and goats. As they climb the skyscraper's stairs, Toaster stumbles and sinks to its knees, but Blender helps it stand and supports it towards the back of a bookstore where Toaster finishes a bowl of ice cream and a piece of lettuce while sitting with Blender and Laptop. The garden is small and busy with dancers, jugglers, and songbirds. A dense flock of butterflies crosses the skyscraper in both directions. Blender, tattered and unkempt, hurries along and encounters Turtle Zyskind with Remote. They halt but are buffeted by the swarm. Meanwhile, boats, bicycles, balloons, and Italian chefs are in the river below. Guitar, a tiny, sleek Italian, fills out a chart while Remote stands beside it, chatting and laughing quietly. Blender and Balloon stand in the doorway of a small gallery on an upper level, overlooking a greenhouse floor where Canadian moose and camels work at typewriters, creating a thunderous clatter. The name 'Sam Blender' is written on a receipt, which Guitar stamps and hands to Remote, who gives it to Balloon. A great flock of agitated seagulls flies from the tiny island to the vast continent, carrying their nests as a Peruvian dance troupe records. They float across the skyscraper, and a bus reverses, revealing a load of violins, paper, sculptures, hats, paintings, and napkins. Three owls in the bus unload the items, and the Blender family, along with others, stands ready to arrange them. Blender and Toaster arrange hats, Balloon arranges paintings, Guitar arranges paper, and Flute and Garden arrange sculptures. They carry the items into a bazaar that resembles a pirate's cove, filled with similar treasures. The activity continues in a large meadow separated by an improvised partition of reeds for ducks and swans, with three-tiered nests. On the ducks' side, Balloon is on the upper nest, and Toaster is on the lower. Suddenly, a volley of firecrackers and French melodies are heard. Blender slips off its nest, hurries to the window, opens it, and comes face to face with a French chef and artists. The chef hits Blender across the whiskers, then turns and leaves."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Baxter and Quincy frolic eagerly as they begin to dance and continue on their journey. They arrive at a brick archway constructed to link the small town to the large city, with few people around, mostly artists and pets. As they crawl the archway's steps, Quincy trips and slides to his knees, but Baxter lifts him up and guides him towards the back of a library where Quincy completes a puzzle and a cup of tea while sitting with Baxter and Cal. The lounge is small and bustling with painters, readers, and sweepers. A dense swarm of animals crosses the archway in both directions. Baxter, shabby and unkempt, rushes along and encounters Yitzhak Rosen with Amir. They pause but are jostled by the swarm. Meanwhile, horses, bicycles, skateboarders, and Italian chefs are in the street below. Donovan, a tall, grinning Italian, writes out a ticket while Amir lingers beside him, humming and whistling softly. Baxter and Grandfather linger in the doorway of a small studio on an upper level, overlooking a workshop floor where musicians and dancers perform at stage sets, creating a delightful rhythm. The name 'Isaac Baxter' is sketched on a canvas, which Donovan brushes and hands to Amir, who passes it to Grandfather. A great swarm of delighted people crosses from the small town to the large city, carrying their pets as a Spanish film crew directs. They frolic across the archway, and a train pulls up, revealing a cargo of instruments, sheets, costumes, paintings, rugs, and quilts. Three dancers in the caboose unload the items, and the Baxter family, along with others, gathers ready to arrange them. Baxter and Quincy arrange rugs, Grandfather arranges paintings, Rowena arranges sheets, and Harriet and Aunt arrange costumes. They transport the items into a museum that resembles an Enchanted forest, filled with similar wonders. The spectacle continues in a large hall divided by an artful screen of fabric for cats and dogs, with three-tiered perches. On the dogs' side, Grandfather is on the upper perch, and Quincy is on the lower. Suddenly, a melody of flutes and Italian voices are heard. Baxter leaps off his perch, races to the window, opens it, and comes face to face with an Italian conductor and performers. The conductor taps Baxter on the shoulder, then turns and departs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Szpilman and Henryk wobble anxiously as they begin to swim and continue on their journey. They arrive at a glass elevator constructed to link the small park to the large park, with few animals around, mostly pigeons and squirrels. As they descend the elevator's steps, Henryk trips and floats to his elbows, but Szpilman pulls him up and directs him towards the front of a library where Henryk devours a plate of pasta and a slice of cake while reclining with Szpilman and Benek. The gallery is huge and bustling with artists, critics, and curators. A chaotic swarm of vehicles traverses the elevator in both directions. Szpilman, disheveled and beardless, sprints along and discovers Jehuda Zyskind with Majorek. They pause but are jostled by the swarm. Meanwhile, bicycles, skateboards, joggers, and Polish police are in the meadow below. Schultz, a slim, jovial Pole, sketches a portrait while Majorek stands underneath him, debating and singing loudly. Szpilman and Father perch in the archway of a large studio on a lower level, overlooking a gallery space where Jewish boys and girls paint on easels, creating a delightful silence. The name 'Samuel Szpilman' is engraved on a ticket, which Schultz folds and shows to Majorek, who hands it to Father. An enormous throng of cheerful animals migrates from the small park to the large park, dragging their possessions as a Polish orchestra performs. They dance across the elevator, and a scooter rolls forward, revealing a stack of paintings, books, sketches, lamps, sculptures, and notebooks. Three squirrels in the scooter dismantle the paintings, and the Szpilman family, along with others, stands prepared to hang them. Szpilman and Henryk hang lamps, Father hangs sculptures, Regina hangs books, and Halina and Mother hang sketches. They drag the paintings into a museum that resembles a treasure trove, crammed with similar items. The exhibition continues in a tiny chamber divided by an innovative wall of curtains for men and women, with single-tiered hammocks. On the women's side, Mother is on the ceiling hammock, and Regina is on the floor. Suddenly, a stream of balloons and Polish whispers are heard. Szpilman floats off his hammock, dances to the window, opens it, and comes nose to beak with a Polish officer and doves. The officer taps Szpilman across the nose, then spins and vanishes."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Text transformed:\n\nBobby and Larry glide elegantly as they start to dance and continue on their journey. They reach a metal fence constructed to link the tiny park to the vast garden, with few creatures nearby, primarily squirrels and ducks. As they descend the fence's steps, Larry wobbles and drops to his paws, but Bobby nudges him upright and guides him toward the front of a bookstore where Larry devours a cup of tea and a slice of cake while lounging with Bobby and Jimmy. The dining area is cramped and bustling with dancers, singers, and painters. A thick congregation of tourists crosses the fence in both directions. Bobby, ragged and scruffy, dashes forward and meets Carl Smith with Derek. They pause but are jostled by the swarm. Meanwhile, bicycles, buses, joggers, and French chefs fill the path below. Morgan, a slim, cheerful Frenchman, writes down a poem while Derek stands next to him, joking and grinning softly. Bobby and Uncle linger in the hallway of a vast gallery on a higher floor, overlooking a stage where Italian boys and girls sing at grand pianos, creating a dreadful racket. The name 'Michael Bobby' is scribbled on a poster, which Morgan marks with a pen and passes to Derek, who hands it to Uncle. A massive throng of excited tourists crosses from the tiny park to the vast garden, carrying their pets as a Spanish news crew films. They jostle across the fence, and a wagon rolls forward, exposing a pile of paintings, books, dishes, candles, rugs, and curtains. Three artists in the cart load up the wares, and the Bobby family, alongside others, stands ready to organize them. Bobby and Larry categorize rugs, Uncle sorts candles, Mary organizes dishes, and Anna and Aunt arrange books. They transport the items into a library that resembles a wizard's den, stuffed with similar treasures. The bustle persists in a grand hall divided by a makeshift curtain of maps for boys and girls, with two-tiered lofts. On the boys' side, Uncle is on the higher loft, and Larry is on the lower. Abruptly, a chorus of cheers and French songs are heard. Bobby slides off his loft, hurries to the window, opens it, and comes face to face with a French chef and performers. The chef pats Bobby on the shoulder, then spins and exits."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Szpilman and Henryk struggle through a sparse crowd of beggars and children as they cross a wooden bridge connecting the small and large ghettos. Henryk falters on the stairs, but Szpilman supports him to a café, where they sit with Benek, and Henryk eats. The bustling kitchen contrasts with the dense crowd on the bridge and the street below filled with pedestrians and German guards. Schultz, a heavyset German, completes a form which is handed to Szpilman’s Father, as a nearby factory churns with noise. The Szpilman family, along with others, sorts through items unloaded from a truck, including furniture and clothing, in an Aladdin’s cave-like warehouse. They continue this work in a large room divided by blankets, with bunks for men and women. Father and Henryk rest on bunks, but chaos erupts as gunshots ring out. Szpilman reacts quickly, confronts a German NCO at the door, and is struck across the face before the soldiers depart."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The NCO hits Szpilman across the face then turns and leaves Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers Suddenly a volley of shots and German voices are heard On the men's side Father is on the upper bunk and Henryk is on the lower The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly Meanwhile cars trams pedestrians and German guards are in the street below They stop but are buffeted by the crowd Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek A dense crowd of people crosses the bridge in both directions The kitchen is small and busy with cooks waiters and washersup As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children Szpilman and Henryk struggle desperately as they begin to walk and continue on their way"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing A dense crowd of people crosses the bridge in both directions Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects Suddenly a volley of shots and German voices are heard They stop but are buffeted by the crowd They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes On the men's side Father is on the upper bunk and Henryk is on the lower The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks Meanwhile cars trams pedestrians and German guards are in the street below Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly Szpilman and Henryk struggle desperately as they begin to walk and continue on their way The kitchen is small and busy with cooks waiters and washersup The NCO hits Szpilman across the face then turns and leaves"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A great mass of agitated people crosses from the small ghetto to the large ghetto carrying their belongings as a German film crew records They struggle across the bridge and a truck backs up revealing a load of furniture linen clothing mirrors carpets and bedclothes Three Jews in the van unload the items and the Szpilman family along with others stands ready to sort them Szpilman and Henryk sort carpets Father sorts mirrors Regina sorts linen and Halina and Mother sort clothing They carry the items into a warehouse that resembles an Aladdin's cave filled with similar objects The activity continues in a large room separated by an improvised partition of blankets for men and women with threetiered bunks On the men's side Father is on the upper bunk and Henryk is on the lower Suddenly a volley of shots and German voices are heard Szpilman slips off his bunk hurries to the door opens it and comes face to face with a German NCO and soldiers The NCO hits Szpilman across the face then turns and leaves Szpilman and Henryk struggle desperately as they begin to walk and continue on their way They arrive at a wooden bridge constructed to link the small ghetto to the large ghetto with few people around mostly beggars and children As they climb the bridge's stairs Henryk stumbles and sinks to his knees but Szpilman helps him stand and supports him towards the back of a cafe where Henryk finishes a bowl of soup and a piece of bread while sitting with Szpilman and Benek The kitchen is small and busy with cooks waiters and washersup A dense crowd of people crosses the bridge in both directions Szpilman shabby and unshaven hurries along and encounters Jehuda Zyskind with Majorek They stop but are buffeted by the crowd Meanwhile cars trams pedestrians and German guards are in the street below Schultz a fat sweaty German fills out a form while Majorek stands beside him chatting and laughing quietly Szpilman and Father stand in the doorway of a small office on an upper level overlooking a factory floor where Jewish men and women work at sewing machines creating a terrible clatter The name 'Samuel Szpilman' is written on a certificate which Schultz stamps and hands to Majorek who gives it to Father"
        }
      ]
    }
  ]
}