{
  "ground_truth": "At the same time, the little Cashier emerges from the 7-Eleven with his gun, and the two begin to shoot at Hi's retreating figure, with the Policeman's revolver popping and the Cashier's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background, its siren wailing. The PASSENGER COP leans far out his window, one hand gripping the light-and-siren rack, the other pointing a gun at Hi, shooting away, as bullets whizz past. Suddenly, the Huggies box pops forward out from under Hi's arm, hit by a bullet with a soft pthunk! Still running, Hi reaches forward, tries to catch it on the fly, bobbles it, tips it, and loses it. He overruns it a couple of steps before bringing himself up short, turns to pick up the box, but PING-PING, bullets chew up the road near his hand. Leaving the Huggies, Hi takes off through a well-manicured yard as the police car proceeds down the street to catch him around the corner, with the driver still drawling over his loudspeaker. Tracking behind Hi, he runs up to the house and crashes through the screen door, runs through the living room where a middle-aged couple sits on the couch watching TV and looks up as Hi rushes by, then plunges down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He emerges into a rec room where he and we rush past two kids playing ping-pong and runs out the back door, followed by OFFICER STEENSMA, who plunges down the stairs. Outdoors now, Hi runs, crosses the street behind the house, and enters the parking lot of a supermarket on the other side, as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs. The dogs thunder through the living room and down the stairs as Hi bursts in. Tracking on him as he runs down the broad front aisle, head whipping as he runs, looking up each perpendicular lane, searching for something, he turns up one of the last lanes, races along it, and grabs a carton of Huggies, still on the flat run. He emerges into the broad back aisle and runs along it, but at the first perpendicular lane he hits, we see Officer Steensma, gun leveled, at the other end, and he fires. Hi keeps running as the Policeman runs along the front aisle, keeping pace with Hi running along the back aisle, squeezing off shots at Hi as each lane gives him the opportunity. Hi abruptly stops between lanes and doubles back, losing the Policeman.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At the identical instant, the diminutive Teller appears from the 7-Eleven with his firearm, and the duo commence to fire at Hi's receding silhouette, with the Policeman's pistol popping and the Teller's Magnum booming. Hi is panting and wheezing down the avenue with his Huggies as the patrol vehicle swerves onto the thoroughfare in the backdrop, its siren howling. The PASSENGER COP leans far out his window, one hand clasping the light-and-siren frame, the other aiming a firearm at Hi, firing away, as bullets whizz past. Suddenly, the Huggies box pops forward out from under Hi's arm, struck by a bullet with a soft pthunk! Still sprinting, Hi reaches forward, attempts to catch it on the move, bobbles it, tips it, and loses it. He overshoots it a couple of strides before halting himself abruptly, turns to retrieve the box, but PING-PING, bullets gnaw up the avenue near his hand. Leaving the Huggies, Hi bolts through a well-tended yard as the patrol automobile advances down the thoroughfare to capture him around the corner, with the operator still drawling over his megaphone. Tracking behind Hi, he sprints up to the domicile and crashes through the screen door, runs through the living room where a middle-aged couple sits on the sofa watching TV and glances up as Hi rushes by, then plunges down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He emerges into a rec room where he and we rush past two kids playing table tennis and runs out the back door, pursued by OFFICER STEENSMA, who plunges down the stairs. Outdoors now, Hi runs, crosses the avenue behind the house, and enters the parking area of a supermarket on the opposite side, as a pack of canines thunders in with the lead Doberman and about a dozen neighborhood dogs. The dogs thunder through the living room and down the stairs as Hi bursts in. Tracking on him as he runs down the wide front aisle, head whipping as he runs, looking up each perpendicular lane, searching for something, he turns up one of the last lanes, races along it, and grabs a carton of Huggies, still on the flat run. He emerges into the broad back aisle and runs along it, but at the first perpendicular lane he hits, we see Officer Steensma, firearm leveled, at the other end, and he discharges. Hi keeps running as the Policeman runs along the front aisle, maintaining pace with Hi running along the back aisle, squeezing off shots at Hi as each lane gives him the opportunity. Hi abruptly halts between lanes and doubles back, losing the Policeman."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the same time, a gun is emerged from the 7-Eleven by the little Cashier, and Hi's retreating figure is shot at by the two, with the revolver of the Policeman popping and the Magnum of the Cashier booming. Hi is being huffed and puffed down the road with his Huggies as the street is careened onto by the cop car in the background, its siren wailing. The PASSENGER COP is leaned far out of his window, as one hand grips the light-and-siren rack, the other points a gun at Hi, and shots are fired, making bullets whizz past. Suddenly, a bullet hits the Huggies box with a soft pthunk!, and it is popped forward out from under Hi's arm. The box is still reached for by Hi, still running, who tries to catch it on the fly, bobbles it, tips it, and loses it. A couple of steps are overrun by him before he brings himself up short, and the box is turned to pick up, but PING-PING, the road near his hand is chewed up by bullets. Leaving the Huggies, a well-manicured yard is taken off through by Hi as the street is proceeded down by the police car to catch him around the corner, with drawling still done over the loudspeaker by the driver. Tracking behind Hi, the house is run up to and crashed through the screen door by him, as the living room is run through where a middle-aged couple sits on the couch watching TV and looks up as Hi rushes by, then plunges down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He emerges into a rec room where two kids playing ping-pong are rushed past by him and us, and he runs out the back door, followed by OFFICER STEENSMA, who plunges down the stairs. Outdoors now, the street is crossed by Hi, and he enters the parking lot of a supermarket on the other side, as a pack of dogs, led by a Doberman, thunders in with about a dozen neighborhood dogs. Through the living room and down the stairs, the dogs thunder as Hi bursts in. Tracking on him as the broad front aisle is run down by him, his head whipping as he runs, looking up each perpendicular lane, searching for something, one of the last lanes is turned up by him, it is raced along, and a carton of Huggies is grabbed, still on the flat run. Into the broad back aisle, he emerges and runs along it, but at the first perpendicular lane he hits, Officer Steensma, gun leveled, is seen firing at the other end. Hi keeps running as the Policeman runs along the front aisle, keeping pace with Hi running along the back aisle, squeezing off shots at Hi as each lane gives him the opportunity. Between lanes, Hi is abruptly stopped and doubles back, losing the Policeman."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Simultaneously, the Cashier exits the 7-Eleven with his gun, joining the Policeman in shooting at Hi's retreating figure, their weapons booming. Hi is running down the road with his Huggies as a cop car screeches onto the street, siren blaring. The Passenger Cop leans out, holding a gun and shooting while bullets whiz past. Suddenly, a bullet hits the Huggies box with a soft pthunk, causing Hi to fumble and lose it. Dodging bullets, he leaves the Huggies behind and dashes through a yard as the police car follows. Hi crashes through a screen door, startling a couple watching TV, then rushes downstairs with a ka-chick ka-chock sound. In the rec room, he races past two kids playing ping-pong and exits, followed by Officer Steensma. Outside, Hi crosses a street to a supermarket parking lot, pursued by a pack of dogs. Running into the supermarket, Hi searches each aisle for something and grabs a carton of Huggies. In the back aisle, he encounters Officer Steensma, who fires his gun. Hi continues as the Policeman parallels him in the front aisle, firing at Hi when visible. Hi suddenly stops, doubles back, and loses the Policeman."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Cashier emerges from the 7-Eleven with a gun, and he and the Policeman shoot at Hi, who's running with his Huggies. The cop car follows with its siren wailing, as the Passenger Cop leans out, firing at Hi. The Huggies box is hit and falls, but Hi fails to catch it and leaves it behind as bullets hit the road. Hi runs through a yard with the police car in pursuit, crashes through a house with a couple watching TV, and rushes into a rec room where kids play ping-pong. Officer Steensma follows. Hi escapes through the back door, crosses the street, and enters a supermarket parking lot with dogs chasing him. Inside, he grabs a new carton of Huggies, but Officer Steensma spots him and fires. Hi runs along the aisles, avoiding shots, stops suddenly, and doubles back, losing the Policeman."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "At precisely the same moment, the diminutive cashier, armed and ready, steps out from the 7-Eleven store. Together with the determined police officer, they both begin firing their weapons at Hi, who is hurriedly retreating. The officer’s revolver crackles with sharp popping sounds while the cashier’s powerful Magnum echoes with a resounding boom. Hi is visibly panting and out of breath as he sprints down the road, desperately clutching the package of Huggies under his arm. Behind him, the police car can be seen veering dramatically onto the road, its siren loudly wailing in the background. One of the officers inside, the passenger cop, leans far out of the vehicle's window, holding on tightly with one hand to the light-and-siren rack. His other hand is extended, aiming a gun at Hi, firing bullets that zip past him with intense speed. \n\nIn a sudden and dramatic turn of events, the box of Huggies is unexpectedly forced forward from Hi’s grasp, struck by a bullet with a noticeably soft pthunk! Despite being hit, Hi valiantly continues to sprint, reaching forward in a desperate attempt to catch the box mid-air. However, he fumbles with it, tipping it first, then finally losing his grip completely. He overshoots a few steps before abruptly stopping himself, intending to turn back to retrieve the fallen box. Just as he makes a move to pick it up, PING-PING, bullets start tearing through the pavement perilously close to his hand. Realizing the danger, Hi abandons the Huggies and dashes away through a neatly kept, manicured yard. Meanwhile, the police car continues, moving down the street, with the driver nonchalantly drawling over the loudspeaker, attempting to catch Hi as he turns the corner.\n\nThe camera follows behind Hi as he races up to a house and crashes forcefully through its screen door. He charges into the living room where a middle-aged couple is seated comfortably on the couch, watching TV. They momentarily glance up in startled surprise as Hi rushes past them. He then plunges down a staircase, and, as he descends, we distinctly hear the rhythmic sound: ka-chick ka-chock ka-chick ka-chock. Bursting into a rec room, he and the viewers flash past two children engrossed in ping-pong before he swiftly exits through the back door. Hot on his trail is Officer Steensma, who follows him, also rushing down the stairs. \n\nOnce outdoors, Hi continues his frantic escape, crossing a street that runs behind the house and entering the adjacent parking lot of a supermarket. A cacophony of barking heralds a pack of dogs, led by a formidable Doberman, followed by about a dozen eager neighborhood dogs, all thundering along in pursuit. They crash through the living room and down the stairs as Hi makes his way inside. Focused tightly on Hi, he sprints down the broad front aisle of the supermarket, his head turning sharply side to side as he scans each cross lane, searching intently for something. \n\nSuddenly, he veers into one of the last lanes, racing rapidly along it, grabbing a carton of Huggies, all the while maintaining his swift pace. Emerging into the wide back aisle, he continues running, but as he reaches the first intersecting lane, Officer Steensma is visible at the far end, his gun pointed and ready to fire. Officer Steensma takes aim and fires as Hi keeps running. The Policeman, keeping pace with Hi but on the front aisle, takes shots at him whenever the aisles intersect, looking for an opportunity. In a final burst of quick thinking, Hi abruptly stops between two lanes, executing a rapid turn and doubling back, ultimately eluding the pursuing officer."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "At precisely the very same moment, the diminutive cashier, who is armed and prepared for the confrontation, steps confidently out from the bustling 7-Eleven store. Accompanying the determined police officer, they both simultaneously begin discharging their firearms at Hi, who is hurriedly making his retreat. The officer’s revolver crackles through the air with sharp popping sounds, while the cashier’s powerful Magnum echoes with a resounding and thunderous boom. Hi is visibly panting, out of breath, as he sprints frantically down the road, desperately clutching the package of Huggies snugly under his arm. Behind him, the police car is seen veering dramatically onto the road, its siren loudly wailing a piercing sound in the background. One of the officers inside, the passenger cop, precariously leans far out of the vehicle's window, holding on tightly with one hand to the light-and-siren rack. His other hand is extended outward, aiming a gun at Hi, firing bullets that zip past him with intense and terrifying speed.\n\nIn a sudden and dramatic turn of events, the box of Huggies is unexpectedly propelled forward from Hi’s grasp, struck by a bullet with a noticeably soft pthunk! Despite being hit, Hi valiantly continues to sprint, reaching forward with determination in a desperate attempt to catch the box mid-air. However, he fumbles with it, tipping it first in one direction, then finally losing his grip completely. He overshoots a few steps before abruptly halting himself, intending to turn back to retrieve the fallen box. Just as he makes a move to pick it up, PING-PING, bullets start tearing through the pavement perilously close to his hand. Realizing the imminent danger, Hi abandons the Huggies and dashes away through a neatly kept, manicured yard. Meanwhile, the police car proceeds, moving steadily down the street, with the driver nonchalantly drawling over the loudspeaker, attempting to apprehend Hi as he turns the corner.\n\nThe camera follows closely behind Hi as he races up to a house and crashes forcefully through its screen door. He charges into the cozy living room where a middle-aged couple is seated comfortably on the couch, engrossed in watching TV. They momentarily glance up in startled surprise as Hi rushes past them with urgency. He then plunges down a staircase, and as he descends, we distinctly hear the rhythmic sound: ka-chick ka-chock ka-chick ka-chock. Bursting into a rec room, he and the viewers flash past two children engrossed in a lively game of ping-pong before he swiftly exits through the back door. Hot on his trail is Officer Steensma, who follows him closely, also rushing down the stairs in pursuit.\n\nOnce outdoors, Hi continues his frantic and desperate escape, crossing a street that runs directly behind the house and entering the adjacent parking lot of a nearby supermarket. A cacophony of barking heralds a pack of dogs, led by a formidable Doberman, followed eagerly by about a dozen neighborhood dogs, all thundering along in relentless pursuit. They crash through the living room and down the stairs as Hi makes his way inside. Focused intently on his escape, he sprints down the broad front aisle of the supermarket, his head turning sharply from side to side as he scans each cross lane, searching intently for something.\n\nSuddenly, he veers into one of the last lanes, racing rapidly along it, grabbing a carton of Huggies, all the while maintaining his swift and urgent pace. Emerging into the wide back aisle, he continues running, but as he reaches the first intersecting lane, Officer Steensma is visible at the far end, his gun pointed and ready to fire. Officer Steensma takes careful aim and fires as Hi keeps running. The Policeman, keeping pace with Hi but on the front aisle, takes shots at him whenever the aisles intersect, looking intently for an opportunity. In a final burst of quick thinking, Hi abruptly stops between two lanes, executing a rapid turn and doubling back, ultimately eluding the pursuing officer with swift cunning."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Simultaneously, as the little Cashier exits the 7-Eleven, he clutches his gun tightly and joins forces with the Policeman, both directing their firearms towards Hi's retreating figure. The Policeman's revolver emits sharp pops while the Cashier's Magnum unleashes deep booms, adding to the chaos of the scene. Hi, breathing heavily and with determined focus, charges down the road, clutching a box of Huggies under his arm, while the police car swerves onto the street behind him, its siren crying out in pursuit. The Passenger Cop hangs precariously out of the car window, one hand gripping the light-and-siren rack for stability, the other hand outstretched, aiming a gun at Hi, and pulling the trigger repeatedly as bullets slice through the air around him. In an unexpected turn, a bullet hits the Huggies box with a soft \"pthunk!\", sending it tumbling forward from under Hi's arm. Still in motion, Hi instinctively reaches out, trying to snatch the box mid-air, but his fingers only manage to bobble and tip it, failing to secure it. He stumbles forward a couple of steps past the box, abruptly halting to change direction, intending to retrieve it. However, just as he turns, the sharp PING-PING of bullets ricochets off the pavement near his hand, prompting him to abandon the box altogether. With quick reflexes, Hi darts off, cutting through a meticulously maintained yard, while the police car continues down the street, its driver nonchalantly droning over the loudspeaker. Hi, with the police tracking his every move, dashes up to a house, crashing unceremoniously through the screen door, and charges through the living room where a middle-aged couple, seated on the couch engrossed in their television program, look up in astonishment as he speeds past. Without pausing, Hi plunges down a staircase, each step echoing with the sounds of his descent: ka-chick ka-chock ka-chick ka-chock, resonating rhythmically. He bursts into a rec room, brushing past two kids engaged in a game of ping-pong, the ball suspended momentarily mid-air, as he bolts through the back door, with Officer Steensma hot on his heels, taking the stairs in pursuit. Now outside, Hi sprints across an open space, crosses the street behind the house, and enters a supermarket parking lot on the opposite side. A pack of dogs, with a determined Doberman at the forefront, followed by a dozen neighborhood canines, thunders into the scene, adding to the pandemonium. The dogs stampede through the living room and descend the stairs while Hi is already strategizing his next move. Inside the supermarket, he charges down the broad front aisle, his head swiveling rapidly, eyes darting up each perpendicular lane, scanning urgently for his target. Fixated on his goal, he turns into one of the last lanes, races along it with speed and precision, and snatches a carton of Huggies, all while maintaining his momentum in a flat-out sprint. With his objective in hand, he reenters the broad back aisle, accelerating along it, only to spot Officer Steensma at the far end of the first perpendicular lane he encounters, the officer's gun leveled and ready. Undeterred, Hi continues his sprint as Officer Steensma mirrors his pace along the front aisle, taking aim and firing at Hi whenever a lane offers a line of sight. Suddenly, Hi makes a sharp, unexpected stop between the lanes, skillfully doubles back, and manages to elude the Policeman, momentarily losing his pursuer in the maze of aisles."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the little Cashier and Policeman emerge from the 7-Eleven, they begin shooting at Hi, whose retreating figure carries a box of Huggies. The cop car appears in the background with its siren wailing, while the Passenger Cop leans out, shooting at Hi. When a bullet hits the Huggies box, Hi attempts to catch it mid-stride but ultimately loses it. Under fire, he abandons the box and races through a yard. The police car follows, and Hi bursts into a house, startling a couple watching TV. He crashes through the living room, down a staircase, and into a rec room where kids play ping-pong, then exits out the back door with Officer Steensma in pursuit. Outdoors again, Hi crosses a street into a supermarket parking lot, chased by a pack of dogs. In the supermarket, he runs down the aisles, searching, and finally grabs another carton of Huggies. Continuing his dash, he avoids Officer Steensma's gunfire by doubling back and losing him among the lanes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At the same time, the little Cashier emerges from the 7-Eleven, a popular convenience store chain known for its wide variety of snacks and drinks, with his gun, and the two begin to shoot at Hi's retreating figure, with the Policeman's revolver popping and the Cashier's Magnum, a large caliber handgun famous for its power, booming. Hi is huffing and puffing down the road with his Huggies, a brand of disposable diapers known for their soft texture and reliability, as the cop car, a standard issue Ford Crown Victoria often used by police for its durability and speed, careens onto the street in the background, its siren wailing. The PASSENGER COP leans far out his window, one hand gripping the light-and-siren rack mounted on top of the speeding vehicle, the other pointing a gun at Hi, shooting away, as bullets whizz past, leaving small puffs of dust in their wake. Suddenly, the Huggies box pops forward out from under Hi's arm, hit by a bullet with a soft pthunk, the sound of compressed cardboard giving way. Still running, Hi reaches forward, tries to catch it on the fly, bobbles it, tips it, and loses it. He overruns it a couple of steps before bringing himself up short, turns to pick up the box, but PING-PING, bullets chew up the road near his hand, sending shards of asphalt flying. Leaving the Huggies, Hi takes off through a well-manicured yard typical of suburban homes, as the police car proceeds down the street to catch him around the corner, with the driver still drawling over his loudspeaker, a technique used to communicate commands clearly over distance. Tracking behind Hi, who is panting from exertion, he runs up to the house and crashes through the screen door, runs through the living room where a middle-aged couple, who appear startled and confused, sits on the couch watching \"Wheel of Fortune,\" a long-running game show, and looks up as Hi rushes by, then plunges down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock, the rhythmic sound of a ping pong game in progress. He emerges into a rec room, a common space for family leisure, where he and we rush past two kids playing ping-pong, their paddles poised mid-swing, and runs out the back door, followed by OFFICER STEENSMA, who plunges down the stairs, his footsteps echoing in pursuit. Outdoors now, Hi runs, crosses the street behind the house, and enters the parking lot of a supermarket, where shoppers pause in curiosity, on the other side, as a pack of dogs, drawn by the commotion, thunders in with the lead Doberman, a breed known for its speed and loyalty, and about a dozen neighborhood dogs. The dogs thunder through the living room and down the stairs as Hi bursts in. Tracking on him as he runs down the broad front aisle, lined with neatly stacked goods, head whipping as he runs, looking up each perpendicular lane for an escape route, he turns up one of the last lanes, races along it, and grabs a carton of Huggies, his original target, still on the flat run. He emerges into the broad back aisle and runs along it, but at the first perpendicular lane he hits, we see Officer Steensma, gun leveled with a steady hand, at the other end, and he fires, the shot echoing through the store. Hi keeps running as the Policeman runs along the front aisle, keeping pace with Hi running along the back aisle, squeezing off shots at Hi as each lane gives him the opportunity, the sound of gunfire startling the few remaining shoppers. Hi abruptly stops between lanes and doubles back, losing the Policeman momentarily in the maze of shelves."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk Outdoors Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker Tracking behind Hi he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by then plunges down a staircase and as he does so we hear kachick kachock kachick kachock He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs Outdoors he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits we see Officer Steensma gun leveled at the other end and he fires At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing. The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past. Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk. Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it. He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand. Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker. Tracking behind Hi. he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. then plunges down a staircase and as he does so we hear kachick kachock kachick kachock. He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs. Outdoors. now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs. The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something. he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run. He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits. we see Officer Steensma gun leveled at the other end and he fires. Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing. The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past. Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk. Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it. He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand. Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker. Tracking behind Hi. he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. then plunges down a staircase and as he does so we hear kachick kachock kachick kachock. He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs. Outdoors. now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs. The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something. he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run. He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits. we see Officer Steensma gun leveled at the other end and he fires. Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing. The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past. Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk. Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it. he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run. He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits. we see Officer Steensma gun leveled at the other end and he fires. Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing. we see Officer Steensma gun leveled at the other end and he fires. Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At the same time, the small Baker emerges from the 7-Eleven with his gun, and the two begin to shoot at Hi's retreating figure, with the Librarian's revolver popping and the Baker's Magnum booming. Hi is huffing and puffing down the road with his Huggies as the firefighter truck careens onto the street in the background, its siren wailing. The TEACHER COP leans far out his window, one hand gripping the light-and-siren rack, the other pointing a gun at Hi, shooting away, as bullets whizz past. Suddenly, the Huggies box pops forward out from under Hi's arm, hit by a bullet with a soft pthunk! Still running, Hi reaches forward, tries to catch it on the fly, bobbles it, tips it, and loses it. He overruns it a couple of steps before bringing himself up short, turns to pick up the box, but PING-PING, bullets chew up the road near his hand. Leaving the Huggies, Hi takes off through a well-manicured yard as the teacher car proceeds down the street to catch him around the corner, with the painter still drawling over his loudspeaker. Tracking behind Hi, he runs up to the house and crashes through the screen door, runs through the living room where a young couple sits on the couch watching TV and looks up as Hi rushes by, then plunges down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He emerges into a rec room where he and we rush past two kids playing ping-pong and runs out the back door, followed by AGENT STEENSMA, who plunges down the stairs. Outdoors now, Hi runs, crosses the street behind the house, and enters the parking lot of a supermarket on the other side, as a pack of cats thunders in with the lead Doberman and about a dozen neighborhood cats. The cats thunder through the living room and down the stairs as Hi bursts in. Tracking on him as he runs down the broad front aisle, head whipping as he runs, looking up each perpendicular lane, searching for something, he turns up one of the last lanes, races along it, and grabs a carton of Huggies, still on the flat run. He emerges into the broad back aisle and runs along it, but at the first perpendicular lane he hits, we see Agent Steensma, gun leveled, at the other end, and he fires. Hi keeps running as the Security Guard runs along the front aisle, keeping pace with Hi running along the back aisle, squeezing off shots at Hi as each lane gives him the opportunity. Hi abruptly stops between lanes and doubles back, losing the Security Guard."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At the same time, the little Cashier emerges from the bakery with his slingshot, and the two begin to shoot at Hi's retreating figure, with the Policeman's bow popping and the Cashier's catapult booming. Hi is huffing and puffing down the trail with his pillows as the tram car careens onto the path in the background, its horn wailing. The PASSENGER COP leans far out his window, one hand gripping the umbrella rack, the other pointing a spear at Hi, shooting away, as darts whizz past. Suddenly, the pillowcase pops forward out from under Hi's arm, hit by a dart with a soft pthunk! Still running, Hi reaches forward, tries to catch it on the fly, bobbles it, tips it, and loses it. He overruns it a couple of steps before bringing himself up short, turns to pick up the pillowcase, but PING-PING, darts chew up the path near his hand. Leaving the pillows, Hi takes off through a rose garden as the tram proceeds down the pathway to catch him around the corner, with the driver still drawling over his loudspeaker. Tracking behind Hi, he runs up to the cottage and crashes through the glass door, runs through the parlor where a middle-aged couple sits on the couch watching a play and looks up as Hi rushes by, then plunges down a spiral staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He emerges into a craft room where he and we rush past two kids playing chess and runs out the back door, followed by OFFICER STEENSMA, who plunges down the stairs. Outdoors now, Hi runs, crosses the courtyard behind the cottage, and enters the parking lot of a furniture store on the other side, as a pack of cats thunders in with the lead Siamese and about a dozen neighborhood felines. The cats thunder through the parlor and down the spiral staircase as Hi bursts in. Tracking on him as he runs down the broad front corridor, head whipping as he runs, looking up each perpendicular lane, searching for something, he turns up one of the last lanes, races along it, and grabs a bundle of pillows, still on the flat run. He emerges into the broad back corridor and runs along it, but at the first perpendicular lane he hits, we see Officer Steensma, spear leveled, at the other end, and he fires. Hi keeps running as the Policeman runs along the front corridor, keeping pace with Hi running along the back corridor, squeezing off shots at Hi as each lane gives him the opportunity. Hi abruptly stops between lanes and doubles back, losing the Policeman."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At the same time, the little Cashier appears from the 7-Eleven with his gun, and the two begin to juggle at Hi's retreating figure, with the Policeman's revolver shining and the Cashier's Magnum gleaming. Hi is skipping down the road with his Huggies as the cop car drifts onto the street in the background, its siren humming. The PASSENGER COP leans far out his window, one hand waving at the light-and-siren rack, the other pointing a wand at Hi, singing away, as butterflies flutter past. Suddenly, the Huggies box leaps forward out from under Hi's arm, nudged by a breeze with a soft pthunk! Still hopping, Hi reaches forward, tries to swipe it on the fly, juggles it, flips it, and forgets it. He skips over it a couple of steps before bringing himself up short, turns to glance at the box, but TING-TING, pebbles rustle near his hand. Leaving the Huggies, Hi prances off through a well-manicured yard as the police car rolls down the street to follow him around the corner, with the driver still mumbling over his loudspeaker. Tracking behind Hi, he leaps up to the house and strolls through the screen door, waddles through the living room where a middle-aged couple lounges on the couch watching TV and glances up as Hi shimmies by, then descends down a staircase, and as he does so, we hear: ka-chick ka-chock ka-chick ka-chock. He enters into a rec room where he and we glide past two kids tossing ping-pong balls and struts out the back door, followed by OFFICER STEENSMA, who slides down the stairs. Outdoors now, Hi dances, strolls across the street behind the house, and waltzes into the parking lot of a supermarket on the other side, as a choir of dogs marches in with the lead Doberman and about a dozen neighborhood dogs. The dogs march through the living room and down the stairs as Hi slips in. Following him as he strolls down the broad front aisle, head bobbing as he glides, looking up each perpendicular lane, searching for something, he skips up one of the last lanes, jogs along it, and snatches a carton of Huggies, still on the smooth glide. He emerges into the broad back aisle and meanders along it, but at the first perpendicular lane he crosses, we see Officer Steensma, wand raised, at the other end, and he waves. Hi keeps prancing as the Policeman skips along the front aisle, keeping pace with Hi skipping along the back aisle, humming at Hi as each lane gives him the opportunity. Hi suddenly halts between lanes and glides back, losing the Policeman."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At the same time, the little Librarian emerges from the McDonald's with her broom, and the two begin to throw at a kite's retreating figure, with the Chef's spatula flipping and the Librarian's ladle booming. The kite is huffing and puffing down the road with its balloons as the tricycle careens onto the street in the background, its horn wailing. The DANCER CHILD leans far out the window, one hand gripping the kite-and-string rack, the other pointing a whisk at the kite, tossing away, as pebbles whizz past. Suddenly, the balloon string pops forward out from under the kite's tail, hit by a pebble with a soft pthunk! Still floating, the kite reaches forward, tries to catch it on the fly, bobbles it, tips it, and loses it. It overruns it a couple of loops before bringing itself up short, turns to pick up the string, but WHOOSH-WHOOSH, pebbles bounce off the road near its tail. Leaving the balloons, the kite takes off through a well-manicured garden as the tricycle proceeds down the street to catch it around the corner, with the rider still singing over her loudspeaker. Tracking behind the kite, it drifts up to the greenhouse and crashes through the screen door, floats through the kitchen where a middle-aged gardener sits on a stool reading a book and looks up as the kite swirls by, then plunges down a staircase, and as it does so, we hear: crinkle-crack crinkle-crack. It emerges into a workshop where it and we drift past two kittens playing checkers and floats out the back door, followed by TEACHER FLETCHER, who bounces down the stairs. Outdoors now, the kite drifts, crosses the garden behind the greenhouse, and enters the parking lot of a bakery on the other side, as a flock of birds soars in with the lead sparrow and about a dozen neighborhood finches. The birds zoom through the kitchen and down the stairs as the kite bursts in. Tracking on it as it floats down the broad front pathway, flutter rippling as it drifts, looking up each perpendicular lane, searching for something, it glides up one of the last lanes, twirls along it, and catches a spool of yarn, still on the flat drift. It emerges into the broad back corridor and glides along it, but at the first perpendicular lane it hits, we see Teacher Fletcher, chalk raised, at the other end, and it sends. The kite keeps floating as the Gardener runs along the front path, keeping pace with the kite drifting along the back corridor, flicking chalk at the kite as each lane gives her the opportunity. The kite abruptly halts between lanes and pirouettes back, losing the Gardener."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At the same time, the tiny Mechanic appears from the bakery with his umbrella, and the two begin to dance at Hi's vanishing figure, with the Editor's camera clicking and the Mechanic's speaker booming. Hi is tiptoeing down the road with his Huggies as the ice cream truck glides onto the street in the background, its bell ringing. The ASSISTANT CHEF leans far out his window, one hand gripping the roof rack, the other aiming a flashlight at Hi, gesturing away, as lights flash past. Suddenly, the Huggies box bobs forward out from under Hi's arm, tapped by a frisbee with a soft tap! Still prancing, Hi reaches forward, tries to catch it on the fly, juggles it, tips it, and drops it. He sways over it a couple of steps before bringing himself to a halt, turns to pick up the box, but BING-BING, lights dance around the road near his foot. Leaving the Huggies, Hi skips off through a flourishing garden as the ice cream truck glides down the street to shadow him around the corner, with the announcer still droning over his megaphone. Trailing behind Hi, he leaps up to the house and slips through the screen door, dances through the living room where a middle-aged couple lounges on the couch watching TV and glances up as Hi skips by, then scuttles down a staircase, and as he does so, we hear: swish swash swish swash. He bursts into a rec room where he and we hustle past two kids playing video games and skips out the back door, followed by MANAGER STEENSMA, who leaps down the stairs. Outdoors now, Hi jogs, crosses the street behind the house, and enters the parking lot of a library on the other side, as a pack of cats streaks in with the lead Siamese and about a dozen neighborhood cats. The cats streak through the living room and down the stairs as Hi dashes in. Trailing him as he jogs down the broad front aisle, head swiveling as he jogs, peering up each perpendicular lane, searching for something, he turns up one of the last lanes, races along it, and snags a carton of Huggies, still on the brisk skip. He emerges into the broad back aisle and bounces along it, but at the first perpendicular lane he swerves, we see Manager Steensma, flashlight raised, at the other end, and he signals. Hi keeps skipping as the Editor jogs along the front aisle, keeping pace with Hi skipping along the back aisle, flashing lights at Hi as each lane gives him the opportunity. Hi quickly pauses between lanes and scampers back, eluding the Editor."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At the same time, the little Cashier emerges from the gas station with his umbrella, and the two begin to whistle at Hi's advancing figure, with the Policeman's trumpet blasting and the Cashier's saxophone booming. Hi is skipping and twirling down the alley with his groceries as the bicycle swerves onto the path in the background, its bell ringing. The PASSENGER COP leans far out his window, one hand gripping the flower-and-flag rack, the other pointing a violin at Hi, strumming away, as arrows glide past. Suddenly, the groceries bag bounces forward out from under Hi's arm, hit by a dart with a soft thunk! Still skipping, Hi reaches forward, tries to snatch it on the fly, fumbles it, tips it, and drops it. He skips past it a couple of steps before stopping abruptly, turns to pick up the bag, but PING-PING, arrows dig into the path near his hand. Leaving the groceries, Hi dashes off through a well-kept garden as the bicycle rolls down the path to meet him around the corner, with the rider still drawling over his megaphone. Tracking behind Hi, he gallops up to the house and tumbles through the porch screen, bolts through the dining room where a middle-aged couple lounges on the couch reading novels and glances up as Hi breezes by, then hurtles down a staircase, and as he does so, we hear: clink clank clink clank. He bursts into a game room where he and we breeze past two kids playing chess and darts out the side door, followed by OFFICER STEENSMA, who tumbles down the stairs. Outdoors now, Hi sprints, crosses the path behind the house, and enters the garden center of a nursery on the other side, as a pack of cats bounds in with the lead Siamese and about a dozen neighborhood cats. The cats bound through the dining room and down the stairs as Hi dashes in. Tracking on him as he sprints down the wide front path, head swiveling as he runs, looking up each parallel row, searching for something, he turns up one of the last rows, races along it, and snatches a bundle of flowers, still on the smooth run. He enters the wide back path and scurries along it, but at the first parallel row he reaches, we see Officer Steensma, violin poised, at the other end, and he strums. Hi keeps sprinting as the Policeman strides along the front path, matching Hi's pace along the back path, plucking at the violin strings as each row offers him the chance. Hi suddenly halts between rows and reverses direction, vanishing from the Policeman."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At the same time, the tiny Mechanic appears from the gas station with his broom, and the duo begins to juggle at Bob's advancing silhouette, with the Sailor's trumpet squeaking and the Mechanic's violin screeching. Bob is skipping and hopping down the trail with his teddy bear as the fire truck swerves onto the boulevard in the background, its bell clanging. The BACKSEAT DRIVER leans far out his window, one hand gripping the umbrella-and-bell rack, the other pointing a broom at Bob, juggling wildly, as apples zoom past. Suddenly, the teddy bear tumbles forward out from under Bob's arm, struck by an apple with a soft thud! Still skipping, Bob reaches forward, tries to snatch it on the run, fumbles it, tips it, and drops it. He oversteps it a couple of paces before halting sharply, turns to retrieve the bear, but CLANG-CLANG, apples dent the ground near his foot. Abandoning the teddy bear, Bob darts through a wildflower garden as the mail truck progresses down the avenue to corner him by the hedge, with the conductor still singing over his megaphone. Following behind Bob, he dashes up to the cottage and bursts through the porch door, sprints through the kitchen where an elderly duo lounges on the recliner reading novels and glances up as Bob zooms by, then dives down a passageway, and as he does so, we hear: tap-tap tap-tap tap-tap tap-tap. He emerges into a game room where he and we rush past two teenagers playing foosball and races out the screen door, pursued by CAPTAIN JONES, who dives down the hallway. Outside now, Bob dashes, crosses the path behind the cottage, and enters the courtyard of a library on the opposite side, as a herd of sheep stampedes in with the lead ram and about a dozen nearby sheep. The sheep stampede through the kitchen and down the hall as Bob storms in. Tracking on him as he races down the broad main aisle, head swiveling as he dashes, looking up each adjacent row, searching for something, he veers up one of the final rows, sprints along it, and snatches a crate of teddy bears, still on the fast hop. He emerges into the vast rear aisle and sprints along it, but at the first adjacent row he encounters, we see Captain Jones, broom raised, at the other end, and he swings. Bob keeps sprinting as the Sailor rushes along the front aisle, matching Bob sprinting along the rear aisle, swinging at Bob as each row offers the chance. Bob suddenly halts between rows and doubles back, losing the Sailor."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Simultaneously, the 7-Eleven Cashier and a Policeman open fire on Hi as he flees with a box of Huggies. The sound of gunfire fills the air as Hi runs down the road, a police car following with its siren blaring. The PASSENGER COP leans out, shooting at Hi, and when a bullet hits the Huggies box, Hi drops it but continues running. Bullets hit the ground near him, forcing Hi to abandon the box and dash through a yard. The police car chases him, with the officer speaking over his loudspeaker. Hi crashes through a house, startling the residents, and heads down into a rec room, pursued by Officer Steensma. Outside, Hi crosses a street into a supermarket parking lot, followed by a pack of dogs. He runs through the market, grabs another carton of Huggies, and maneuvers through the aisles, eluding the Policeman, who fires shots but loses track of Hi as he doubles back."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman we see Officer Steensma gun leveled at the other end and he fires He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs Outdoors He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs then plunges down a staircase and as he does so we hear kachick kachock kachick kachock he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by Tracking behind Hi Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it then plunges down a staircase and as he does so we hear kachick kachock kachick kachock He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand Tracking behind Hi we see Officer Steensma gun leveled at the other end and he fires Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing Outdoors The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "then plunges down a staircase and as he does so we hear kachick kachock kachick kachock He emerges into a rec room where he and we rush past two kids playing pingpong and runs out the back door followed by OFFICER STEENSMA who plunges down the stairs Outdoors now Hi runs crosses the street behind the house and enters the parking lot of a supermarket on the other side as a pack of dogs thunders in with the lead Doberman and about a dozen neighborhood dogs The dogs thunder through the living room and down the stairs as Hi bursts in Tracking on him as he runs down the broad front aisle head whipping as he runs looking up each perpendicular lane searching for something he turns up one of the last lanes races along it and grabs a carton of Huggies still on the flat run He emerges into the broad back aisle and runs along it but at the first perpendicular lane he hits we see Officer Steensma gun leveled at the other end and he fires Hi keeps running as the Policeman runs along the front aisle keeping pace with Hi running along the back aisle squeezing off shots at Hi as each lane gives him the opportunity Hi abruptly stops between lanes and doubles back losing the Policeman At the same time the little Cashier emerges from the 7Eleven with his gun and the two begin to shoot at Hi's retreating figure with the Policeman's revolver popping and the Cashier's Magnum booming Hi is huffing and puffing down the road with his Huggies as the cop car careens onto the street in the background its siren wailing The PASSENGER COP leans far out his window one hand gripping the lightandsiren rack the other pointing a gun at Hi shooting away as bullets whizz past Suddenly the Huggies box pops forward out from under Hi's arm hit by a bullet with a soft pthunk Still running Hi reaches forward tries to catch it on the fly bobbles it tips it and loses it He overruns it a couple of steps before bringing himself up short turns to pick up the box but PINGPING bullets chew up the road near his hand Leaving the Huggies Hi takes off through a wellmanicured yard as the police car proceeds down the street to catch him around the corner with the driver still drawling over his loudspeaker Tracking behind Hi he runs up to the house and crashes through the screen door runs through the living room where a middleaged couple sits on the couch watching TV and looks up as Hi rushes by"
        }
      ]
    }
  ]
}