{
  "ground_truth": "He sits there, just another Joe on a bar stool with his heart breaking. He's excited -- smiling. Carol holding a pose for Simon. He is holding a ballpoint over the back of a hotel desk blotter. His style cramped by his cast. He struggles with the cast, and then decides to struggle no more. Summoning remarkable strength, he rips a piece from the cast, freeing his hand. He roars ironically, a lion's roar of liberation. He is back at his center. The door opens. Simon enters. Melvin is having a room service breakfast. Carol follows him out. Her arms are filled with the hotel soaps, shampoos, etc. Melvin reacts. Carol looks at Melvin. Simon finishes dialing the phone. He hangs up, totally satisfied with himself and rips over to Carol and Melvin. Carol, a load has been lifted. Melvin stalks out. The car parked near a phone booth. Carol walks up to Simon in the car. She hands him a baseball cap. Melvin hangs up the phone. She shakes her head and walks off. The door opens, revealing them. Simon notices some of his paintings. Simon looking at Melvin with some sympathy. Melvin's two digital clocks are two minutes apart. He sits in a chair still fully dressed. A beat then we hear Simon's whispered voice. As Carol unpacks, she gives gifts to her mother and Spencer. But clearly something gnaws at her psyche. As he speeds him out. She's just broken up with him but she's being nicer than ever. We enter the room carrying Verdell who strains to be allowed closer to Melvin. Simon releases him. He moves for the door. stops suddenly, jolted. walks reluctantly into the apartment house. As Melvin looks at Carol's doorbell with great uncertainty. The windows open, reading one of Melvin's books. hesitates. looks at his watch. Carol in a cotton wrap-around dress/bathrobe. She walks to her wide open window and looks over. The convertible at the curb. She hesitates. As Melvin gives up and starts out. turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave. that Beverly, standing near her door down the hallway, has heard at least this last part. Carol has not ever heard anything like that before. Melvin, of course, cannot leave well enough alone. She disappears into her room. She looks at him then. Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He perches there, just another fellow on a tavern stool with his spirit shattering. He's thrilled -- grinning. Carol holding a stance for Simon. He is clutching a pen over the back of a hotel desk pad. His method hindered by his cast. He grapples with the cast, and then decides to grapple no more. Summoning extraordinary power, he tears a fragment from the cast, liberating his hand. He bellows ironically, a lion's bellow of freedom. He is back at his core. The door opens. Simon enters. Melvin is having a room service meal. Carol follows him out. Her arms are filled with the hotel soaps, shampoos, etc. Melvin responds. Carol gazes at Melvin. Simon finishes dialing the phone. He hangs up, completely content with himself and rips over to Carol and Melvin. Carol, a burden has been lifted. Melvin stalks out. The automobile parked near a phone booth. Carol walks up to Simon in the car. She hands him a baseball cap. Melvin hangs up the phone. She shakes her head and walks off. The door opens, revealing them. Simon notices some of his paintings. Simon gazes at Melvin with some compassion. Melvin's two digital clocks are two minutes apart. He sits in a chair still fully dressed. A pause then we hear Simon's whispered voice. As Carol unpacks, she gives presents to her mother and Spencer. But clearly something gnaws at her consciousness. As he speeds him out. She's just ended things with him but she's being kinder than ever. We enter the room carrying Verdell who strains to be allowed closer to Melvin. Simon releases him. He moves for the door. stops suddenly, jolted. walks reluctantly into the apartment building. As Melvin looks at Carol's doorbell with great doubt. The windows open, reading one of Melvin's books. hesitates. looks at his watch. Carol in a cotton wrap-around dress/robe. She walks to her wide open window and looks over. The convertible at the curb. She hesitates. As Melvin gives up and starts out. turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave. that Beverly, standing near her door down the corridor, has heard at least this last part. Carol has not ever heard anything like that before. Melvin, of course, cannot leave well enough alone. She disappears into her room. She looks at him then. Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Just another Joe on a bar stool with his heart breaking, he is sat there by himself. He is excited—smiling. A pose is held by Carol for Simon. A ballpoint is held by him over the back of a hotel desk blotter. His style is cramped by his cast. The cast is struggled with by him, and then a decision is made to struggle no more. Remarkable strength is summoned, and a piece is ripped from the cast by him, freeing his hand. An ironic roar is made by him, a lion's roar of liberation. He is brought back to his center. The door is opened. Simon enters. A room service breakfast is had by Melvin. Carol follows him out. Her arms are filled with the hotel soaps, shampoos, etc. Melvin reacts. Melvin is looked at by Carol. The phone is finished dialing by Simon. He hangs up, becomes totally satisfied with himself, and rips over to Carol and Melvin. Carol is relieved. Melvin stalks out. A car is parked near a phone booth. Simon is walked up to in the car by Carol. A baseball cap is handed to him by her. Melvin hangs up the phone. Her head is shaken, and she walks off. They are revealed as the door is opened. Some of his paintings are noticed by Simon. Melvin is looked at with some sympathy by Simon. Melvin's two digital clocks being two minutes apart are noticed. A chair is sat in by him, still fully dressed. A beat is marked, and then Simon's whispered voice is heard. Gifts are given to her mother and Spencer as Carol unpacks. But clearly, something gnaws at her psyche. He speeds him out. She has just broken up with him, but she is being nicer than ever. The room is entered by us carrying Verdell who strains to be closer to Melvin. Verdell is released by Simon. He moves for the door, stops suddenly, jolted, and reluctantly walks into the apartment house. Carol's doorbell is looked at with great uncertainty by Melvin. The windows are opened, reading one of Melvin's books. He hesitates and looks at his watch. Carol, in a cotton wrap-around dress/bathrobe, walks to her wide-open window and looks over. The convertible is at the curb. She hesitates. Melvin gives up and starts out. As the sudden blast of being BUZZED into Carol's life sounds, he turns. He bolts for the door and enters. The door is opened by her. Her side is reached by him. He half turns to leave. At least this last part has been heard by Beverly, standing near her door down the hallway. Anything like that has not ever been heard by Carol before. Melvin, of course, cannot leave well enough alone. She disappears into her room. She looks at him then. The cracked pattern of Carol's kitchen linoleum is glanced at by Melvin, who stalls at the door. They walk quietly. Melvin still walks with his usual attention to where he steps. Melvin walks, and though an improvement can be seen, it is still decidedly strange as he conspicuously avoids stepping on the lines."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sitting on a bar stool, his heart breaking, he smiles. Carol poses for Simon, who struggles with a ballpoint on a hotel desk blotter. His cast hampers him, so he tears a piece off, liberating his hand. Simon enters as Melvin enjoys room service breakfast. Carol, arms full of hotel toiletries, exits. Simon finishes dialing, satisfied, and approaches Carol and Melvin. Melvin leaves; Carol hands Simon a baseball cap and walks off. Melvin hangs up the phone and notices his two clocks are two minutes apart. Simon’s whispered voice is heard as Carol unpacks, giving gifts to her mother and Spencer. She’s just broken up with him but is nicer than ever. Verdell strains toward Melvin, who releases him. Melvin hesitates at Carol’s doorbell, unsure. Carol, in a wrap-around dress, looks out her window. Melvin approaches as she opens the door. They walk, with Melvin still avoiding stepping on lines, though slightly improved."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sitting at the bar, a heartbroken man struggles with a cast. He rips it to free his hand, roaring in relief. As Simon enters, Melvin is having breakfast, while Carol carries hotel toiletries. Melvin reacts, Carol looks, and Simon dials the phone. Simon is satisfied, as Melvin leaves. Carol hands Simon a baseball cap and walks off. Melvin hangs up. Simon notices paintings, looking sympathetically at Melvin. Carol unpacks, gifting her mother and Spencer but remains troubled. Verdell, the dog, strains towards Melvin. Simon releases him. Melvin hesitates at Carol's door, uncertain. Carol appears in a wrap-around dress, looking out. Melvin buzzes into her life, reaches her side, then hesitates, while Beverly eavesdrops. Carol is astonished by Melvin, who cannot leave well enough alone. Melvin, stepping carefully, avoids the lines, showing improvement but still walking strangely."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Seated in his usual spot, he appears to be just another ordinary Joe perched on a bar stool, yet his heart silently shatters within him. Despite the deep sadness, he exudes a sense of excitement, his face adorned with a bright smile. Nearby, Carol maintains a pose, serving as a model for Simon. He holds a ballpoint pen poised over the back of a hotel desk blotter, his creativity stifled by the cumbersome cast on his arm. Wrestling with the inconvenience of the cast, he finally resolves to cease struggling. With a surge of remarkable strength, he tears a section from the cast, granting freedom to his hand. An ironic, lion-like roar of liberation escapes him, symbolizing his return to his true self. \n\nJust then, the door swings open, and Simon steps inside. Meanwhile, Melvin is in the midst of enjoying a room service breakfast. Carol trails behind Simon, her arms loaded with an assortment of hotel soaps, shampoos, and other toiletries. Melvin’s reaction is immediate as he catches sight of her. Carol meets Melvin's gaze. Simon, having completed dialing the phone, hangs up, evidently self-satisfied, and quickly shifts his attention to Carol and Melvin. Carol feels as though a heavy burden has been lifted. Melvin departs, stalking out with determination. Nearby, a car is parked close to a phone booth. Carol approaches Simon, who is in the car, and she hands him a baseball cap. In response, Melvin hangs up the phone. She shakes her head, an expression of resignation and walks away. The door opens, revealing their presence. Simon takes notice of some of his paintings. A look of sympathy crosses Simon's face as he observes Melvin. \n\nIn Melvin's apartment, two digital clocks show a discrepancy of two minutes. He sits motionless in a chair, still fully dressed. A moment passes, and then Simon's whispered voice reaches the air. As Carol unpacks her belongings, she distributes gifts to her mother and Spencer, although it is clear that something still troubles her deeply. As he escorts someone out hastily, she maintains kindness despite having just ended their relationship. Entering the room with Verdell, the dog strains to get closer to Melvin. Simon releases him, allowing Verdell to move toward the door. Abruptly, Verdell halts, jolted by something, and reluctantly proceeds into the apartment building. Melvin stands before Carol's doorbell, staring at it with profound uncertainty.\n\nFrom an open window, someone is seen reading one of Melvin's books, hesitating for a brief moment before glancing at their watch. Carol, now at her wide-open window, is clad in a comfortable cotton wrap-around dress or bathrobe. She gazes outward to see the convertible parked at the curb and hesitates. As Melvin decides to give up and starts to leave, he is startled by the sudden, unmistakable sound of being BUZZED into Carol's world. He bolts for the door and enters swiftly. Upon entering, she opens the door, and he reaches her side. He considers turning to leave halfway but notices Beverly standing quietly near her door down the hallway, having overheard at least the last portion of their conversation. Carol has never heard anything quite like that before. Melvin, true to form, cannot simply leave things as they are. Carol disappears back into her room, casting a final glance at him. Melvin turns his gaze to focus on the cracked pattern of Carol's kitchen linoleum and hesitates momentarily at the door. As they begin to walk quietly together, Melvin continues with his usual meticulous attention to where he steps. Although there is a noticeable improvement in his stride, he still walks in his distinctive, peculiar manner, conspicuously avoiding stepping on any lines."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Seated comfortably in his familiar spot, he gives the impression of being just another ordinary Joe settled on a bar stool. Yet, beneath this exterior, his heart silently breaks into pieces. Despite this profound sadness weighing on him, he manages to project an air of excitement, with his face illuminated by a bright, cheerful smile. Nearby, Carol holds a steady pose, serving as a model for Simon, who grips a ballpoint pen, poised over the back of a hotel desk blotter. His creativity is stifled by the inconvenient cast encasing his arm. Struggling with the cast's restrictions, he ultimately decides to stop fighting it. With a burst of remarkable strength and determination, he tears away a section from the cast, liberating his hand. An ironic, lion-like roar of liberation escapes his lips, symbolizing his triumphant return to his true self.\n\nJust then, the door swings open, and Simon makes his entrance. Meanwhile, Melvin is thoroughly enjoying a room service breakfast. Carol follows closely behind Simon, her arms overflowing with a variety of hotel soaps, shampoos, and other toiletries. As Melvin's eyes land on her, he reacts instantly. Carol's gaze meets Melvin's. Having completed dialing the phone, Simon hangs up with a look of evident self-satisfaction and quickly shifts his attention towards Carol and Melvin. Carol experiences a sensation as though a heavy burden has been lifted from her shoulders. With determination, Melvin exits the room, stalking out with purpose. Nearby, a car is parked in close proximity to a phone booth. Carol approaches Simon, who is seated in the car, and hands him a baseball cap. In response, Melvin hangs up the phone, watching as she shakes her head in resignation before walking away. The door opens, revealing their presence to the outside world. Simon takes note of some of his paintings, scanning them with interest. A look of sympathy crosses Simon's face as he observes Melvin standing there.\n\nInside Melvin's apartment, two digital clocks reveal a discrepancy of two minutes. He sits motionless in his chair, still fully dressed. As a moment passes, Simon's whispered voice fills the air. While Carol unpacks her belongings, she distributes gifts to her mother and Spencer, although it’s evident that something continues to trouble her deeply. Escorting someone out hastily, she maintains her kindness despite the recent end of their relationship. As she enters the room with Verdell, the dog strains eagerly to get closer to Melvin. Simon releases Verdell, allowing the dog to move freely toward the door. Suddenly, Verdell halts, jolted by something unseen, and reluctantly proceeds into the apartment building. Melvin stands before Carol's doorbell, staring at it with deep, profound uncertainty.\n\nFrom an open window, a person is observed reading one of Melvin's books, pausing briefly before glancing at their watch. Carol, now positioned at her wide-open window, is dressed in a comfortable cotton wrap-around dress or bathrobe. She gazes outward contemplatively to see the convertible parked at the curb and hesitates. Just as Melvin decides to give up and starts to leave, he is startled by the sudden, unmistakable sound of being BUZZED into Carol's world. He bolts for the door and enters swiftly. Upon entering, she opens the door, and he reaches her side. Although he considers turning to leave halfway, he notices Beverly standing quietly near her door down the hallway, having overheard at least the last portion of their conversation. Carol has never encountered anything quite like that before. Melvin, true to his nature, cannot simply leave things as they are. Carol retreats back into her room, casting a final, lingering glance at him. Melvin turns his gaze to focus intently on the cracked pattern of Carol's kitchen linoleum and hesitates momentarily at the door. As they begin to walk together quietly, Melvin continues with his usual meticulous care, paying close attention to where he steps. Although there is a noticeable improvement in his stride, he still moves in his distinctive, peculiar manner, conspicuously avoiding stepping on any lines."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He sits perched on the bar stool, blending into the background as just another Joe, yet internally his heart is breaking under the façade of excitement, his face unable to hide a smile. Carol stands perfectly still, holding a pose for Simon’s artistic endeavor. Meanwhile, he grips a ballpoint pen awkwardly over the backside of a hotel desk blotter, his hand movement hindered by the constricting cast. Frustrated by its limitations, he wrestles with the cast, contorting his arm, before resolving to end the struggle. With a surge of determination, he channels his strength to tear away a piece of the cast, liberating his hand. This act of defiance culminates in an ironic, triumphant bellow, akin to a lion's roar, symbolizing his regained freedom and return to his core identity. As this moment of self-discovery unfolds, the door creaks open, allowing Simon to step inside, just as Melvin indulges in a room service breakfast. Carol trails behind Simon, her arms brimming with the hotel’s complimentary soaps, shampoos, and other amenities, an unusual sight that prompts Melvin to react with surprise. Carol meets Melvin's gaze as Simon completes dialing a phone number, then smugly disconnects the call, exuding self-satisfaction before energetically joining Carol and Melvin. For Carol, a metaphorical weight seems to lift, her demeanor noticeably lighter. Seizing a moment of decision, Melvin strides out of the scene. Nearby, a car is parked close to a phone booth, and Carol approaches Simon who is seated within the vehicle, handing him a baseball cap purposefully. Meanwhile, Melvin concludes his phone call at the booth. Carol, shaking her head with a sense of resignation, turns and departs. The scene shifts, and a door swings open, unveiling their presence. Simon’s attention is drawn to some of his paintings, a sight that inspires a flicker of sympathy directed towards Melvin. Observed more closely, Melvin's two digital clocks display a two-minute discrepancy, yet he remains seated, fully clothed, in contemplation. After a pause, Simon's voice, barely more than a whisper, breaks the silence. As Carol methodically unpacks, she distributes gifts to her mother and Spencer, though a subtle turmoil gnaws at her psyche. The pace quickens as he ushers him out. Despite having recently ended their relationship, Carol interacts with him more kindly than ever before. They enter the room cradling Verdell, who strains towards Melvin with eager anticipation, prompting Simon to release him. Verdell makes a beeline for the door, halting abruptly, visibly startled. With hesitance, he edges into the apartment house. Meanwhile, Melvin stands before Carol's doorbell, engulfed in uncertainty. The window stands wide open as someone reads from one of Melvin's books, a moment frozen in hesitation. Glancing at his watch, he calculates his next move. Carol, clad in a cotton wrap-around dress or bathrobe, approaches her open window, peering out contemplatively. A convertible rests at the curb, capturing her attention as she hesitates, her thoughts momentarily suspended. Just as Melvin, seemingly defeated, turns to leave, the sudden, electrifying buzz of admittance into Carol's life reverberates. Electrified by the opportunity, he darts for the door and crosses the threshold. She opens it, and he quickly reaches her side, caught between staying and leaving. Meanwhile, Beverly, stationed near her own door down the hall, has overheard at least the tail end of this exchange. Carol, unaccustomed to such an encounter, finds herself at a loss. Melvin, predictably unable to let things be, is left standing as she vanishes into her room. She casts a glance back at him, as Melvin takes a moment to observe the cracked pattern on Carol's kitchen linoleum, lingering at the door. They walk in silence, Melvin’s gait marked by his usual meticulous care in avoiding steps on the lines—a peculiar habit that, despite improvement, remains evidently odd."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He sits on the bar stool, heartbroken yet excited, as Carol poses for Simon. Despite his frustration with a cast, he decides to free his hand by tearing it open, roaring triumphantly. The door opens, Simon enters while Melvin has room service breakfast. Carol follows with hotel toiletries, prompting a reaction from Melvin. Simon confidently finishes a call and joins Carol and Melvin, giving Carol a sense of relief as Melvin leaves. At a car near a phone booth, Carol gives Simon a baseball cap, while Melvin hangs up, prompting Carol to walk off disappointed. Inside, Simon notices his paintings and looks at Melvin sympathetically. Melvin, still dressed and conflicted, sits between mismatched clocks, with Simon's whispered voice in the background. Carol unpacks, gifting her mother and Spencer but seems troubled. After their breakup, she’s unusually kind, carrying Verdell who strains toward Melvin. Simon releases him, and Melvin hesitates at Carol’s doorbell. Carol, in a robe, looks out her open window from the curb. As Melvin departs, he gets buzzed into Carol’s life and rushes to her side, where their interaction is overheard by Beverly. Carol appears stunned by Melvin’s words. He glances at her cracked linoleum, stalling before they walk silently together. Melvin, walking with careful attention, shows subtle improvement but still avoids stepping on lines."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He sits there, just another Joe on a bar stool with his heart breaking, in a dimly lit pub on the corner of Main Street known for its comforting anonymity. He's excited -- smiling. Carol, a local artist recently featured in a community gallery, holds a pose for Simon. He is holding a ballpoint pen, a common tool for artists sketching on-the-go, over the back of a hotel desk blotter that bears the name of a downtown hotel popular for its art-themed decor. His style cramped by his cast, which he received from a recent accident that left him reflecting on life's fragility. He struggles with the cast, and then decides to struggle no more. Summoning remarkable strength, honed perhaps from his athletic past, he rips a piece from the cast, freeing his hand. He roars ironically, a lion's roar of liberation echoing his newfound sense of freedom. He is back at his center, a place of balance he always seeks. The door opens. Simon enters, carrying an air of creative energy as an art professor at the local college. Melvin is having a room service breakfast, enjoying the luxury of freshly squeezed orange juice and buttery croissants. Carol follows him out, her arms filled with the hotel soaps and shampoos she collects as quirky souvenirs from her travels. Melvin reacts with a raised eyebrow. Carol looks at Melvin, sensing a shared understanding. Simon finishes dialing the phone, arranging yet another art exhibition, then hangs up totally satisfied with himself and rips over to Carol and Melvin. Carol, feeling a load has been lifted after reconciling with a long-time friend, smiles. Melvin stalks out, his mind racing with thoughts. The car parked near a phone booth, a relic from a bygone era when cellular phones were not yet ubiquitous. Carol walks up to Simon in the car. She hands him a baseball cap, a playful nod to their shared love of baseball. Melvin hangs up the phone, his demeanor shifting. She shakes her head and walks off, contemplating her next move. The door opens, revealing them. Simon notices some of his paintings, proudly displayed and glowing in the morning light. Simon looks at Melvin with some sympathy, understanding the complexity of his emotions. Melvin's two digital clocks, a testament to his meticulous nature, are two minutes apart, a detail that unnerves him slightly. He sits in a chair still fully dressed, contemplating his next step. A beat then we hear Simon's whispered voice, a reminder of their recent conversation. As Carol unpacks, she gives gifts to her mother and Spencer, her younger brother who idolizes her adventurous spirit. But clearly, something gnaws at her psyche, an unresolved issue from her past. As he speeds him out, urgency in their departure, she's just broken up with him but she's being nicer than ever, wanting their separation to be amicable. We enter the room carrying Verdell, the spirited little dog belonging to their neighbor, who strains to be allowed closer to Melvin, his favorite human. Simon releases him, knowing how much Melvin loves Verdell. He moves for the door, stops suddenly, jolted by a sudden realization. He walks reluctantly into the apartment house, apprehensive about the encounter. As Melvin looks at Carol's doorbell with great uncertainty, nervous about the conversation ahead. The windows open, with a gentle breeze ruffling the pages of one of Melvin's books, a bestselling novel known for its gripping narrative. He hesitates, looks at his watch, aware of time slipping away. Carol in a cotton wrap-around dress/bathrobe, a reflection of her casual elegance. She walks to her wide open window and looks over, contemplating the view that always inspires her thoughts. The convertible at the curb, a classic model that turns heads. She hesitates, as Melvin gives up and starts out, turning as the sudden blast of being BUZZED into Carol's life sounds, an unexpected but welcome intrusion. He bolts for the door and enters, his heart racing. She opens the door, hopeful for what lies ahead. He reaches her side, comforted by her presence. He half turns to leave, uncertain of what to say next, then notices that Beverly, their curious neighbor standing near her door down the hallway, has heard at least this last part, her interest piqued. Carol has not ever heard anything like that before, her curiosity sparked. Melvin, of course, cannot leave well enough alone, always probing deeper for answers. She disappears into her room, seeking solace. She looks at him then, her expression softened. Melvin glances at the cracked pattern of Carol's kitchen linoleum, a reminder of her humble beginnings, and stalls at the door, pondering his next words. They walk quietly, a companionable silence between them. Melvin still walking with his usual attention to where he steps, avoiding cracks as if they hold some mysterious power over his fate. Melvin walking and though we can see an improvement in his stride and confidence, it is still decidedly strange as he conspicuously avoids stepping on the lines, a habit from childhood that he never outgrew."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He is excited  smiling He sits there just another Joe on a bar stool with his heart breaking He is excited  smiling Carol holding a pose for Simon He is holding a ballpoint over the back of a hotel desk blotter Carol has not ever heard anything like that before His style cramped by his cast He struggles with the cast and then decides to struggle no more Summoning remarkable strength he rips a piece from the cast freeing his hand The door opens revealing them He roars ironically a lion's roar of liberation He is back at his center We enter the room carrying Verdell who strains to be allowed closer to Melvin Carol holding a pose for Simon The door opens As he speeds him out Simon enters He struggles with the cast and then decides to struggle no more Melvin is having a room service breakfast Carol follows him out Her arms are filled with the hotel soaps shampoos etc Melvin reacts Carol looks at Melvin Simon finishes dialing the phone Summoning remarkable strength He hangs up totally satisfied with himself and rips over to Carol and Melvin Melvin reacts Carol a load has been lifted Melvin stalks out The car parked near a phone booth Carol walks up to Simon in the car She hands him a baseball cap She walks to her wide open window and looks over The convertible at the curb Melvin hangs up the phone She shakes her head and walks off Carol follows him out Simon looking at Melvin with some sympathy The door opens revealing them Simon notices some of his paintings Simon looking at Melvin with some sympathy Melvin's two digital clocks are two minutes apart He sits in a chair still fully dressed A beat then we hear Simon's whispered voice She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door As Carol unpacks she gives gifts to her mother and Spencer But clearly something gnaws at her psyche As he speeds him out As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds Melvin is having a room service breakfast She is just broken up with him but she is being nicer than ever They walk quietly We enter the room carrying Verdell who strains to be allowed closer to Melvin But clearly something gnaws at her psyche Simon releases him He moves for the door stops suddenly jolted walks reluctantly into the apartment house Simon notices some of his paintings As Melvin looks at Carol's doorbell with great uncertainty He roars ironically a lion's roar of liberation The windows open reading one of Melvin's books hesitates looks at his watch Carol in a cotton wraparound dressbathrobe then we hear Simon's whispered voice She walks to her wide open window and looks over The convertible at the curb She hesitates As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds He bolts for the door and enters She opens the door She opens the door He reaches her side Simon finishes dialing the phone Simon releases him He half turns to leave that The windows open reading one of Melvin's books hesitates looks at his watch Her arms are filled with the hotel soaps shampoos etc Beverly standing near her door down the hallway has heard at least this last part As Melvin looks at Carol's doorbell with great uncertainty Carol has not ever heard anything like that before Melvin of course cannot leave well enough alone Beverly standing near her door down the hallway has heard at least this last part She disappears into her room He hangs up totally satisfied with himself and rips over to Carol and Melvin he rips a piece from the cast freeing his hand She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door They walk quietly Melvin still walking with his usual attention to where he steps Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He sits there just another Joe on a bar stool with his heart breaking. He is excited  smiling. Carol holding a pose for Simon. He is holding a ballpoint over the back of a hotel desk blotter. His style cramped by his cast. He struggles with the cast and then decides to struggle no more. Summoning remarkable strength. he rips a piece from the cast freeing his hand. He roars ironically a lion's roar of liberation. He is back at his center. The door opens. Simon enters. Melvin is having a room service breakfast. Carol follows him out. Her arms are filled with the hotel soaps shampoos etc. Melvin reacts. Carol looks at Melvin. Simon finishes dialing the phone. He hangs up totally satisfied with himself and rips over to Carol and Melvin. Carol a load has been lifted. Melvin stalks out. The car parked near a phone booth. Carol walks up to Simon in the car. She hands him a baseball cap. Melvin hangs up the phone. She shakes her head and walks off. The door opens revealing them. Simon notices some of his paintings. Simon looking at Melvin with some sympathy. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Melvin's two digital clocks are two minutes apart. He sits in a chair still fully dressed. A beat. then we hear Simon's whispered voice. As Carol unpacks she gives gifts to her mother and Spencer. But clearly something gnaws at her psyche. As he speeds him out. She is just broken up with him but she is being nicer than ever. We enter the room carrying Verdell who strains to be allowed closer to Melvin. Simon releases him. He moves for the door stops suddenly jolted walks reluctantly into the apartment house. As Melvin looks at Carol's doorbell with great uncertainty. The windows open reading one of Melvin's books hesitates looks at his watch. Carol in a cotton wraparound dressbathrobe. She walks to her wide open window and looks over The convertible at the curb. She hesitates. As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave that. Beverly standing near her door down the hallway has heard at least this last part. Carol has not ever heard anything like that before. Melvin of course cannot leave well enough alone. She disappears into her room. She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He sits there just another Joe on a bar stool with his heart breaking. He is excited  smiling. Carol holding a pose for Simon. He is holding a ballpoint over the back of a hotel desk blotter. His style cramped by his cast. He struggles with the cast and then decides to struggle no more. Summoning remarkable strength. he rips a piece from the cast freeing his hand. He roars ironically a lion's roar of liberation. He is back at his center. The door opens. Simon enters. Melvin is having a room service breakfast. Carol follows him out. Her arms are filled with the hotel soaps shampoos etc. Melvin reacts. Carol looks at Melvin. Simon finishes dialing the phone. He hangs up totally satisfied with himself and rips over to Carol and Melvin. Carol a load has been lifted. Melvin stalks out. The car parked near a phone booth. Carol walks up to Simon in the car. She hands him a baseball cap. Melvin hangs up the phone. She shakes her head and walks off. The door opens revealing them. Simon notices some of his paintings. Simon looking at Melvin with some sympathy. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Melvin's two digital clocks are two minutes apart. He sits in a chair still fully dressed. A beat. then we hear Simon's whispered voice. As Carol unpacks she gives gifts to her mother and Spencer. But clearly something gnaws at her psyche. As he speeds him out. She is just broken up with him but she is being nicer than ever. We enter the room carrying Verdell who strains to be allowed closer to Melvin. Simon releases him. He moves for the door stops suddenly jolted walks reluctantly into the apartment house. As Melvin looks at Carol's doorbell with great uncertainty. The windows open reading one of Melvin's books hesitates looks at his watch. Carol in a cotton wraparound dressbathrobe. She walks to her wide open window and looks over The convertible at the curb. She hesitates. As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave that. Beverly standing near her door down the hallway has heard at least this last part. Carol has not ever heard anything like that before. Melvin of course cannot leave well enough alone. She disappears into her room. She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He sits there just another Joe on a bar stool with his heart breaking. He is excited  smiling. Carol holding a pose for Simon. He is holding a ballpoint over the back of a hotel desk blotter. His style cramped by his cast. He struggles with the cast and then decides to struggle no more. Summoning remarkable strength. he rips a piece from the cast freeing his hand. He roars ironically a lion's roar of liberation. He is back at his center. The door opens. Simon enters. Melvin is having a room service breakfast. Carol follows him out. Her arms are filled with the hotel soaps shampoos etc. She hesitates. As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave that. Beverly standing near her door down the hallway has heard at least this last part. Carol has not ever heard anything like that before. Melvin of course cannot leave well enough alone. She disappears into her room. She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He sits there just another Joe on a bar stool with his heart breaking. He is excited  smiling. Carol holding a pose for Simon. He is holding a ballpoint over the back of a hotel desk blotter. His style cramped by his cast. He struggles with the cast and then decides to struggle no more. Melvin of course cannot leave well enough alone. She disappears into her room. She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "He sits there, just another giraffe on a bar stool with its heart breaking. It's excited -- smiling. The owl holding a pose for the dolphin. The squirrel is holding a ballpoint over the back of a hotel desk blotter. The rabbit's style cramped by its cast. The tortoise struggles with the cast, and then decides to struggle no more. Summoning remarkable strength, the peacock rips a piece from the cast, freeing its hand. The elephant roars ironically, a lion's roar of liberation. The penguin is back at its center. The door opens. The bear enters. The kangaroo is having a room service breakfast. The fox follows the bear out. Her arms are filled with the hotel soaps, shampoos, etc. The cheetah reacts. The horse looks at the cheetah. The crow finishes dialing the phone. The crow hangs up, totally satisfied with itself and rips over to the horse and the cheetah. The horse, a load has been lifted. The cheetah stalks out. The car parked near a phone booth. The owl walks up to the crow in the car. The owl hands the crow a baseball cap. The cheetah hangs up the phone. The owl shakes its head and walks off. The door opens, revealing them. The crow notices some of its paintings. The dolphin looking at the cheetah with some sympathy. The cheetah's two digital clocks are two minutes apart. It sits in a chair still fully dressed. A beat then we hear the crow's whispered voice. As the owl unpacks, it gives gifts to its mother and Spencer. But clearly something gnaws at the owl's psyche. As the dolphin speeds it out. The owl's just broken up with it but it's being nicer than ever. We enter the room carrying Verdell who strains to be allowed closer to the cheetah. The crow releases Verdell. Verdell moves for the door. stops suddenly, jolted. walks reluctantly into the apartment house. As the cheetah looks at the owl's doorbell with great uncertainty. The windows open, reading one of the cheetah's books. hesitates. looks at its watch. The horse in a cotton wrap-around dress/bathrobe. It walks to its wide open window and looks over. The convertible at the curb. It hesitates. As the cheetah gives up and starts out. turning as the sudden blast of being BUZZED into the horse's life sounds. The cheetah bolts for the door and enters. The horse opens the door. The cheetah reaches the horse's side. The cheetah half turns to leave. that the peacock, standing near the horse's door down the hallway, has heard at least this last part. The horse has not ever heard anything like that before. The cheetah, of course, cannot leave well enough alone. The horse disappears into its room. It looks at the cheetah then. The cheetah glances at the cracked pattern of the horse's kitchen linoleum and stalls at the door. They walk quietly. The cheetah still walking with its usual attention to where it steps. The cheetah walking and though we can see an improvement it is still decidedly strange as it conspicuously avoids stepping on the lines."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He sits there, just another Joe on a park bench with his heart breaking. He's excited -- smiling. Carol holding a pose for Simon. He is holding a crayon over the back of a library desk calendar. His style cramped by his sling. He struggles with the sling, and then decides to struggle no more. Summoning remarkable strength, he rips a piece from the sling, freeing his arm. He roars ironically, a lion's roar of liberation. He is back at his center. The door opens. Simon enters. Melvin is having a room service lunch. Carol follows him out. Her arms are filled with the hotel towels, lotions, etc. Melvin reacts. Carol looks at Melvin. Simon finishes dialing the phone. He hangs up, totally satisfied with himself and skips over to Carol and Melvin. Carol, a weight has been lifted. Melvin stalks out. The bike parked near a soda machine. Carol walks up to Simon in the bike. She hands him a cowboy hat. Melvin hangs up the phone. She shakes her head and walks off. The door opens, revealing them. Simon notices some of his sketches. Simon looking at Melvin with some sympathy. Melvin's two wall clocks are two minutes apart. He sits in a recliner still fully dressed. A beat then we hear Simon's whispered voice. As Carol unpacks, she gives gifts to her sister and Spencer. But clearly something gnaws at her mind. As he speeds him out. She's just broken up with him but she's being nicer than ever. We enter the room carrying Verdell who strains to be allowed closer to Melvin. Simon releases him. He moves for the window. stops suddenly, jolted. walks reluctantly into the office building. As Melvin looks at Carol's buzzer with great uncertainty. The blinds open, reading one of Melvin's magazines. hesitates. looks at his phone. Carol in a cotton sundress. She walks to her wide open balcony and looks over. The bicycle at the curb. She hesitates. As Melvin gives up and starts out. turning as the sudden blast of being BUZZED into Carol's life sounds. He bolts for the door and enters. She opens the door. He reaches her side. He half turns to leave. that Beverly, standing near her window down the hallway, has heard at least this last part. Carol has not ever heard anything like that before. Melvin, of course, cannot leave well enough alone. She disappears into her room. She looks at him then. Melvin glances at the chipped pattern of Carol's kitchen tile and stalls at the door. They walk quietly. Melvin still walking with his usual attention to where he steps. Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the cracks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He lounges there, just another Joe on a bar stool with his heart soaring. He's nervous -- frowning. Carol adjusting her glasses for Simon. He is waving a ballpoint over the back of a hotel desk blotter. His style illuminated by his cast. He dances with the cast, and then decides to dance no more. Summoning remarkable strength, he tosses a piece from the cast, freeing his hand. He whispers ironically, a kitten's purr of liberation. He is back at his center. The door swings. Simon departs. Melvin is ignoring a room service breakfast. Carol trails him out. Her arms are stacked with the hotel robes, slippers, etc. Melvin ponders. Carol squints at Melvin. Simon finishes scribbling on the phone. He picks up, totally satisfied with himself and slides over to Carol and Melvin. Carol, a burden has been carried. Melvin paces out. The car parked beside a phone booth. Carol breezes up to Simon in the car. She offers him a baseball bat. Melvin flips the phone. She crosses her arms and walks on. The door swings, hiding them. Simon notices some of his sculptures. Simon staring at Melvin with some confusion. Melvin's two digital clocks are five minutes apart. He slumps in a chair still fully dressed. A beat then we hear Simon's whispered voice. As Carol unpacks, she delivers gifts to her mother and Spencer. But clearly something echoes at her psyche. As he props him up. She's just connected with him but she's being colder than ever. We exit the room carrying Verdell who skips to be allowed farther from Melvin. Simon clutches him. He glides for the door. spins suddenly, startled. crawls reluctantly into the apartment house. As Melvin peers at Carol's doorbell with great certainty. The windows shut, reading one of Melvin's books. hesitates. checks his watch. Carol in a cotton wrap-around dress/bathrobe. She strolls to her wide open window and stares over. The convertible at the curb. She pauses. As Melvin gives up and sits down. turning as the sudden silence of being IGNORED in Carol's life sounds. He strolls for the door and exits. She closes the door. He misses her side. He half turns to stay. That Beverly, standing near her door down the hallway, has heard at least this first part. Carol has not ever seen anything like that before. Melvin, of course, cannot leave well enough alone. She appears in her room. She glances at him then. Melvin focuses on the clean pattern of Carol's kitchen linoleum and stalls at the window. They stand silently. Melvin still standing with his usual attention to where he steps. Melvin standing and though we can see an improvement it is still decidedly strange as he conspicuously avoids landing on the lines."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp sits there, just another spoon on a window sill with its heart breaking. It's excited -- smiling. A jacket holding a pose for an umbrella. It is holding a screwdriver over the back of a garden bench cushion. Its style cramped by its sock. It struggles with the sock, and then decides to struggle no more. Summoning remarkable strength, the jacket rips a piece from the sock, freeing its hand. It roars ironically, a tiger's roar of liberation. It is back at its center. The curtain opens. The umbrella enters. A pencil is having a room service dinner. A jacket follows it out. Its arms are filled with the garden candles, brochures, etc. A pencil reacts. A jacket looks at a pencil. The umbrella finishes dialing the radio. It hangs up, totally satisfied with itself and rips over to a jacket and a pencil. A jacket, a load has been lifted. A pencil stalks out. The bicycle parked near a mailbox. A jacket walks up to the umbrella in the bicycle. It hands it a tennis racket. A pencil hangs up the radio. It shakes its head and walks off. The curtain opens, revealing them. The umbrella notices some of its sculptures. The umbrella looking at a pencil with some sympathy. A pencil's two bookshelves are two inches apart. It sits in a couch still fully dressed. A beat then we hear the umbrella's whispered voice. As a jacket unpacks, it gives toys to its cousin and Hammer. But clearly something gnaws at its necklace. As it speeds it out. It's just broken up with it but it's being nicer than ever. We enter the garden carrying a flute which strains to be allowed closer to a pencil. The umbrella releases it. It moves for the curtain. stops suddenly, jolted. walks reluctantly into the grocery store. As a pencil looks at a jacket's doorbell with great uncertainty. The doors open, reading one of a pencil's magazines. hesitates. looks at its clock. A jacket in a wool wrap-around coat/sock. It walks to its wide open door and looks over. The truck at the entrance. It hesitates. As a pencil gives up and starts out. turning as the sudden blast of being HONKED into a jacket's life sounds. It bolts for the curtain and enters. It opens the curtain. It reaches its side. It half turns to leave. that a ladder, standing near its curtain down the hallway, has heard at least this last part. A jacket has not ever heard anything like that before. A pencil, of course, cannot leave well enough alone. It disappears into its garden. It looks at it then. A pencil glances at the cracked pattern of a jacket's porch tiles and stalls at the curtain. They walk quietly. A pencil still walking with its usual attention to where it steps. A pencil walking and though we can see an improvement it is still decidedly strange as it conspicuously avoids stepping on the lines."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The turtle reclines there, just another Dave on a bar stool with his thoughts swirling. He's exhilarated -- grinning. Jessica holding a stance for Oliver. The cat is gripping a paintbrush over the back of a library desk blotter. Its style cramped by its bandage. It wrestles with the bandage, and then chooses to wrestle no more. Harnessing extraordinary courage, it tears a piece from the bandage, liberating its paw. It bellows humorously, a bear's bellow of freedom. The cat is back at its core. The window opens. Oliver emerges. Brian is enjoying a cafeteria brunch. Jessica follows him in. Her arms are stacked with the library books, journals, etc. Brian responds. Jessica gazes at Brian. Oliver completes dialing the clock. He hangs up, completely pleased with himself and jogs over to Jessica and Brian. Jessica, a burden has been lifted. Brian strolls away. The bicycle parked near a water fountain. Jessica strides up to Oliver in the bicycle. She hands him a sunhat. Brian hangs up the clock. She nods her head and strides off. The window opens, exposing them. Oliver observes some of his drawings. Oliver watching Brian with some empathy. Brian's two wristwatches are three minutes apart. The turtle reclines in a hammock still fully clothed. A pause then we hear Oliver's hushed voice. As Jessica unpacks, she hands presents to her father and Taylor. But clearly something eats at her mind. As the owl hurries him in. She's just separated from him but she's being kinder than ever. We enter the house carrying Jasper who strains to be permitted closer to Brian. Oliver lets him go. Jasper heads for the window. halts abruptly, startled. enters reluctantly into the apartment block. As Brian gazes at Jessica’s doorknob with great hesitancy. The curtains open, perusing one of Brian's novels. hesitates. checks his calendar. Jessica in a linen wrap-around gown/robe. She ambles to her wide open curtain and gazes over. The bicycle at the curb. She hesitates. As Brian yields and begins out. spinning as the sudden blast of being CHIMED into Jessica's world resonates. He dashes for the window and emerges. She swings the window. He reaches her side. He half pivots to exit. that Samantha, standing near her window down the corridor, has heard at least this final segment. Jessica has not ever experienced anything like that before. Brian, of course, cannot leave well enough alone. She vanishes into her space. She looks at him then. Brian glances at the tilted design of Jessica's kitchen tiles and hesitates at the window. They amble silently. Brian still ambling with his usual care to where he strides. Brian ambling and though we can see a progression it is still decidedly peculiar as he obviously avoids stepping on the cracks."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He lounges there, just another Joe on a library chair with his heart singing. He's relaxed -- chuckling. Carol juggling a vase for Simon. He is clutching a pencil over the back of a beach towel. His technique hindered by his sling. He wrestles with the sling, and then opts to wrestle no more. Summoning notable dexterity, he tears a piece from the sling, freeing his arm. He meows ironically, a kitten's meow of liberation. He is back at his core. The window slides open. Simon marches in. Melvin is having a vending machine snack. Carol trails behind him. Her arms are filled with the hotel pillows, chocolates, etc. Melvin flinches. Carol gazes at Melvin. Simon completes typing a text. He logs off, completely thrilled with himself and glides over to Carol and Melvin. Carol, a burden has been removed. Melvin glides away. The bicycle leaning near a park bench. Carol saunters up to Simon on the bicycle. She hands him a sun visor. Melvin tosses the phone. She nods and strolls off. The window slides open, revealing them. Simon observes some of his sculptures. Simon regarding Melvin with some empathy. Melvin's two wristwatches are two minutes apart. He lounges in a hammock still fully dressed. A pause then we hear Simon's whispered tone. As Carol unpacks, she offers treats to her mother and Spencer. But obviously something eats at her mind. As he carries him out. She's just split with him but she's being kinder than ever. We enter the garden carrying Verdell who pushes to be allowed nearer to Melvin. Simon unleashes him. He shuffles for the gate. stops abruptly, surprised. wanders reluctantly into the apartment building. As Melvin observes Carol's doorbell with great hesitation. The curtains open, perusing one of Melvin's sculptures. hesitates. glances at his phone. Carol in a linen apron. She strolls to her wide open door and peeks over. The bicycle at the pavement. She pauses. As Melvin concedes and heads out. pivoting as the sudden clap of being CHEERED into Carol's life resounds. He races for the window and exits. She slides the window. He reaches her place. He half pivots to retreat. that Beverly, standing near her gate down the corridor, has noticed at least this last bit. Carol has not ever noticed anything like that before. Melvin, naturally, cannot leave well enough ignored. She vanishes into her kitchen. She glances at him then. Melvin peeks at the cracked pattern of Carol's living room carpet and lingers at the gate. They amble quietly. Melvin still ambling with his usual focus on where he glides. Melvin ambling and though we can discern an advancement it is still distinctly odd as he noticeably dodges stepping on the gaps."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The squirrel lounges there, just another Fido on a sand dune with its fur tingling. It's bewildered -- chuckling. Greta balancing an apple for Oliver. It is juggling a harmonica over the rim of a subway map. Its rhythm enhanced by its scarf. It grapples with the scarf, and then chooses to grapple no longer. Harnessing exceptional courage, it snips a ribbon from the scarf, releasing its paw. It howls sarcastically, a wolf's howl of emancipation. It is back at its core. The curtain slides. Oliver shuffles in. Reggie is enjoying a picnic brunch. Greta trails him outside. Her pockets are stuffed with the park leaves, acorns, etc. Reggie recoils. Greta gazes at Reggie. Oliver completes texting the tablet. He logs off, utterly smug with himself and twirls over to Greta and Reggie. Greta, a burden has been shed. Reggie prowls away. The carriage stationed near a market stall. Greta ambles up to Oliver in the carriage. She offers him a sun hat. Reggie logs off the tablet. She waves her hand and wanders away. The curtain slides, exposing them. Oliver observes some of his sketches. Oliver observing Reggie with slight pity. Reggie's two vintage radios are three seconds out of sync. It perches on a sofa still fully clothed. A moment then we catch Oliver's hushed whisper. As Greta tidies up, she offers trinkets to her father and Jasper. Yet evidently something nibbles at her thoughts. As it propels it out. She's just split from it but she's behaving more kindly than ever. We glide through the hallway escorting Ralph who strains to be permitted closer to Reggie. Oliver unclasps him. It darts for the curtains. pauses suddenly, startled. sneaks hesitantly into the cabin. As Reggie stares at Greta's gong with great hesitation. The skylights ajar, flipping one of Reggie's manuals. queries. checks his clock. Greta in a wool robe. She strides to her wide open skylight and peers over. The motorcycle at the roadside. She pauses. As Reggie surrenders and turns away. swiveling as the abrupt blast of being WHIRRED into Greta's world echoes. It dashes for the gate and strides in. She unveils the gate. It approaches her spot. It half pivots to retreat. that Dolores, standing beside her gate down the corridor, has overheard at least this final snippet. Greta has never endured anything akin to that before. Reggie, naturally, cannot let matters be. She retreats into her space. She gazes at it then. Reggie glances at the mottled pattern of Greta's dining room tiles and idles at the entry. They stroll silently. Reggie still strolling with its typical vigilance to where it treads. Reggie ambling and although we can sense a betterment it is yet distinctly odd as it distinctly evades touching the borders."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a hotel room, a heartbroken man named Melvin struggles with his cast while drawing. He finds relief by freeing his hand from the cast, feeling rejuvenated. Simon enters with Carol, who has collected hotel toiletries. After some interaction, Melvin leaves and Carol gives Simon a baseball cap. Later, Carol feels uneasy while unpacking, despite giving gifts to her family. She has recently ended a relationship but remains friendly. Meanwhile, Verdell, a dog, is eager to be near Melvin, and Simon releases him. Melvin eventually approaches Carol's door, hesitant yet determined. He is buzzed into her life, and despite being tempted to leave, he stays. Their interaction is overheard by Beverly, and Carol is taken aback by Melvin's words. Melvin awkwardly navigates the linoleum floor as they walk, avoiding stepping on the lines, yet showing slight improvement in his demeanor."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines Melvin still walking with his usual attention to where he steps They walk quietly She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door She disappears into her room Melvin of course cannot leave well enough alone Carol has not ever heard anything like that before Beverly standing near her door down the hallway has heard at least this last part He half turns to leave that He reaches her side She opens the door He bolts for the door and enters As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds She hesitates She walks to her wide open window and looks over The convertible at the curb Carol in a cotton wraparound dressbathrobe The windows open reading one of Melvin's books hesitates looks at his watch As Melvin looks at Carol's doorbell with great uncertainty He moves for the door stops suddenly jolted walks reluctantly into the apartment house Simon releases him We enter the room carrying Verdell who strains to be allowed closer to Melvin She is just broken up with him but she is being nicer than ever As he speeds him out But clearly something gnaws at her psyche As Carol unpacks she gives gifts to her mother and Spencer then we hear Simon's whispered voice A beat He sits in a chair still fully dressed Melvin's two digital clocks are two minutes apart Simon looking at Melvin with some sympathy Simon notices some of his paintings The door opens revealing them She shakes her head and walks off Melvin hangs up the phone She hands him a baseball cap Carol walks up to Simon in the car The car parked near a phone booth Melvin stalks out Carol a load has been lifted He hangs up totally satisfied with himself and rips over to Carol and Melvin Simon finishes dialing the phone Carol looks at Melvin Melvin reacts Her arms are filled with the hotel soaps shampoos etc Carol follows him out Melvin is having a room service breakfast Simon enters The door opens He is back at his center He roars ironically a lion's roar of liberation he rips a piece from the cast freeing his hand Summoning remarkable strength He struggles with the cast and then decides to struggle no more His style cramped by his cast He is holding a ballpoint over the back of a hotel desk blotter Carol holding a pose for Simon He is excited  smiling He sits there just another Joe on a bar stool with his heart breaking"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She hesitates She hands him a baseball cap Melvin of course cannot leave well enough alone Simon enters Carol looks at Melvin Melvin stalks out She disappears into her room Melvin still walking with his usual attention to where he steps As Carol unpacks she gives gifts to her mother and Spencer Carol a load has been lifted He is back at his center He bolts for the door and enters A beat She is just broken up with him but she is being nicer than ever He sits in a chair still fully dressed Carol in a cotton wraparound dressbathrobe He is holding a ballpoint over the back of a hotel desk blotter The car parked near a phone booth He reaches her side His style cramped by his cast Melvin's two digital clocks are two minutes apart The door opens He moves for the door stops suddenly jolted walks reluctantly into the apartment house Carol walks up to Simon in the car Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines Melvin hangs up the phone He sits there just another Joe on a bar stool with his heart breaking He half turns to leave that She shakes her head and walks off Beverly standing near her door down the hallway has heard at least this last part He hangs up totally satisfied with himself and rips over to Carol and Melvin Simon looking at Melvin with some sympathy Simon releases him The door opens revealing them Melvin is having a room service breakfast As he speeds him out The windows open reading one of Melvin's books hesitates looks at his watch then we hear Simon's whispered voice Carol has not ever heard anything like that before Carol follows him out As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds They walk quietly Carol holding a pose for Simon Simon notices some of his paintings We enter the room carrying Verdell who strains to be allowed closer to Melvin He struggles with the cast and then decides to struggle no more But clearly something gnaws at her psyche She walks to her wide open window and looks over The convertible at the curb Summoning remarkable strength She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door He roars ironically a lion's roar of liberation Her arms are filled with the hotel soaps shampoos etc Melvin reacts Simon finishes dialing the phone She opens the door He is excited  smiling he rips a piece from the cast freeing his hand As Melvin looks at Carol's doorbell with great uncertainty"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Melvin's two digital clocks are two minutes apart He sits in a chair still fully dressed A beat then we hear Simon's whispered voice As Carol unpacks she gives gifts to her mother and Spencer But clearly something gnaws at her psyche As he speeds him out She is just broken up with him but she is being nicer than ever We enter the room carrying Verdell who strains to be allowed closer to Melvin Simon releases him He moves for the door stops suddenly jolted walks reluctantly into the apartment house As Melvin looks at Carol's doorbell with great uncertainty The windows open reading one of Melvin's books hesitates looks at his watch Carol in a cotton wraparound dressbathrobe She walks to her wide open window and looks over The convertible at the curb She hesitates As Melvin gives up and starts out turning as the sudden blast of being BUZZED into Carol's life sounds He bolts for the door and enters She opens the door He reaches her side He half turns to leave that Beverly standing near her door down the hallway has heard at least this last part Carol has not ever heard anything like that before Melvin of course cannot leave well enough alone She disappears into her room She looks at him then Melvin glances at the cracked pattern of Carol's kitchen linoleum and stalls at the door They walk quietly Melvin still walking with his usual attention to where he steps Melvin walking and though we can see an improvement it is still decidedly strange as he conspicuously avoids stepping on the lines He sits there just another Joe on a bar stool with his heart breaking He is excited  smiling Carol holding a pose for Simon He is holding a ballpoint over the back of a hotel desk blotter His style cramped by his cast He struggles with the cast and then decides to struggle no more Summoning remarkable strength he rips a piece from the cast freeing his hand He roars ironically a lion's roar of liberation He is back at his center The door opens Simon enters Melvin is having a room service breakfast Carol follows him out Her arms are filled with the hotel soaps shampoos etc Melvin reacts Carol looks at Melvin Simon finishes dialing the phone He hangs up totally satisfied with himself and rips over to Carol and Melvin Carol a load has been lifted Melvin stalks out The car parked near a phone booth Carol walks up to Simon in the car She hands him a baseball cap Melvin hangs up the phone She shakes her head and walks off The door opens revealing them Simon notices some of his paintings Simon looking at Melvin with some sympathy"
        }
      ]
    }
  ]
}