{
  "ground_truth": "Hi and Ed are raising their heads, facing forward, and do not see Lenny approaching again through the rear window as he saws out his second shotgun. Hi looks around, reaches, and pulls Ed down beneath him just as KA-BOOM! - the second shotgun roars and the back window spits in. As Lenny roars past the back window, he casually flips something in, and below them, something bounces into and around the leg well - Lenny's grenade. As the two front doors fly open, Hi and Ed spill out - Hi from the driver's side, heading for the far side of the road, and Ed from the passenger side as she dives for cover behind a parked car. Beyond her, KABOOM! - their car explodes and bounces, pouring black smoke, and the explosion flings Hi to the ground in the middle of the street. Looking up the street, Hi sees Lenny wheeling his bike in a U-turn; he is not finished yet. Hi lies flat on his back, woozily shaking his head, and he weakly raises himself on his elbows to look down the street, down the length of his own body, where his legs stretch away in a V. Crashing down from a wheelie, Lenny's roaring bike is almost upon him, aiming up the middle of the V, so Hi rolls as the bike roars by, reaches, and snags a chain on Lenny's passing boot. Dragged several yards before the boot shakes him off, Hi is left on his stomach in the middle of the road. Hi looks up the road as Lenny is again sluing the bike around, smoking as it skids around in the foreground, completing its turn; boom up Lenny's back to reveal Ed stomping straight up the street toward him - unarmed, unafraid. As Ed closes in, Lenny's arms rise into frame, and with a roll of his wrists, two knives appear in his hands. On his stomach, Hi sights down the gun toward Lenny as Ed steps into his line of fire, blocking Lenny, and raising an arm to stab. Ed stoops to scoop the baby from the car seat, revealing Hi behind her as he fires, and Lenny, drilled by Hi's bullet, drops its knife. The exit wound spurts, not flesh and blood, but a brief jet of fire, and quick as a flash, Lenny hurls the other knife at Hi. The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped. As Ed runs toward the bank, clutching Nathan Jr. to her chest and bursts in, the floor is littered with obedient hayseeds. From where Hi lies prone, BANG: the front door bursts open before Lenny's roaring hog, which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with exact synonyms replacing the applicable words:\n\nHi and Ed are lifting their craniums, facing onward, and do not notice Lenny advancing anew through the posterior pane as he cuts out his subsequent shotgun. Hi glances around, reaches, and draws Ed downward underneath him just as KA-BOOM! - the succeeding shotgun bellows and the back pane spits in. As Lenny bellows past the posterior pane, he nonchalantly tosses something in, and below them, something rebounds into and around the limb well - Lenny's explosive. As the two frontal portals soar open, Hi and Ed tumble out - Hi from the operator's flank, heading for the distant side of the route, and Ed from the rider's side as she plunges for concealment behind a stationary automobile. Beyond her, KABOOM! - their automobile detonates and rebounds, emitting ebony smoke, and the detonation flings Hi to the surface in the center of the avenue. Gazing up the avenue, Hi perceives Lenny maneuvering his bicycle in a U-turn; he is not concluded yet. Hi reclines flat on his dorsum, woozily oscillating his cranium, and he feebly elevates himself on his elbows to glance down the avenue, down the expanse of his own physique, where his limbs extend away in a V. Crashing down from a wheelie, Lenny's bellowing bicycle is nearly upon him, directing up the middle of the V, so Hi rolls as the bicycle bellows by, reaches, and snags a chain on Lenny's passing footwear. Hauled several yards before the footwear shakes him off, Hi is left on his abdomen in the middle of the route. Hi gazes up the route as Lenny is again slewing the bicycle around, smoking as it skids around in the foreground, accomplishing its turn; boom up Lenny's back to disclose Ed stomping straight up the avenue toward him - unarmed, unafraid. As Ed nears, Lenny's limbs ascend into frame, and with a twist of his wrists, two daggers materialize in his hands. On his abdomen, Hi sights down the firearm toward Lenny as Ed steps into his line of fire, obstructing Lenny, and raising an arm to stab. Ed stoops to scoop the infant from the auto seat, revealing Hi behind her as he fires, and Lenny, pierced by Hi's projectile, drops its dagger. The exit opening spurts, not flesh and blood, but a brief spurt of fire, and quick as a flash, Lenny hurls the other dagger at Hi. The dagger stings the firearm out of Hi's hand as Lenny bends to scoop up the dagger he dropped. As Ed dashes toward the bank, clutching Nathan Jr. to her chest and bursts in, the floor is strewn with compliant hayseeds. From where Hi lies prone, BANG: the frontal portal bursts open before Lenny's roaring hog, which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Hi and Ed's heads are raised, facing forward, and Lenny approaching again through the rear window with his second shotgun is not seen by them. Around, the room is looked by Hi, and Ed is reached for and pulled down beneath him just as KA-BOOM! - the second shotgun is roared and the back window is spit in. As the back window is roared past by Lenny, something is flipped in casually by him, and below them, something is bounced into and around the leg well - Lenny's grenade. The two front doors are flown open, Hi and Ed spill out - from the driver's side, the far side of the road is headed for by Hi, and from the passenger side, a dive for cover behind a parked car is made by Ed. Beyond her, KABOOM! - their car is exploded and bounced, black smoke is poured, and Hi is flung to the ground in the middle of the street by the explosion. Up the street is looked by Hi, and Lenny is seen wheeling his bike in a U-turn; he is not yet finished. On his back, flat lies Hi, woozily shaking his head, and on his elbows, Hi weakly raises himself to look down the street, down the length of his own body, where away, his legs stretch in a V. Down from a wheelie, Lenny's roaring bike crashes almost upon him, aiming up the middle of the V, so Hi is rolled as the bike roars by, a chain on Lenny's passing boot is reached for and snagged by him. Dragged several yards before the boot shakes him off, on his stomach, Hi is left in the middle of the road. Up the road is looked by Hi as the bike is again slued around by Lenny, smoking as in the foreground it skids around, its turn is completed; boom up Lenny's back to reveal Ed, stomping straight up the street toward him - unarmed, unafraid. As Lenny's arms close in, the frame is risen into by them, and two knives in his hands appear with a roll of his wrists. On his stomach, down the gun is sighted by Hi toward Lenny as into his line of fire Ed steps, blocking Lenny, and an arm to stab is raised. To scoop the baby from the car seat Ed stoops, Hi behind her is revealed as he fires, and Lenny, by Hi's bullet drilled, drops its knife. The exit wound spurts, not flesh and blood, but a brief jet of fire, and quick as a flash, the other knife is hurled by Lenny at Hi. The gun out of Hi's hand is stung by the knife as the knife dropped by him is bent to scoop up by Lenny. Toward the bank, Ed runs, clutching Nathan Jr. to her chest and bursts in, the floor is littered with obedient hayseeds. From where prone, Hi lies, BANG: before Lenny's roaring hog, the front door is burst open, which off a step sails into the sunken atrium and amidst the hayseeds lands with a CRASH."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hi and Ed lift their heads, unaware of Lenny approaching again through the rear window with a second shotgun. Hi pulls Ed down just as KA-BOOM!—the shotgun erupts, shattering the back window. As Lenny races past, he tosses in a grenade, which bounces in the leg well. Hi and Ed dive out—Hi to the far side and Ed behind a parked car. Beyond her, KABOOM!—their car explodes, spewing black smoke, flinging Hi onto the street. Hi sees Lenny turning his bike, not done yet. Dazed, Hi lifts himself, spotting Lenny's bike aiming at him. He rolls, grabs a chain on Lenny's boot, and is dragged before being shaken off. Lying in the road, Hi watches Lenny skid his bike around. Ed approaches Lenny, unarmed. Lenny draws knives as Hi sights down a gun, but Ed blocks his line of fire. Ed scoops up the baby, revealing Hi behind her firing and hitting Lenny, whose exit wound spurts fire. Lenny hurls a knife, disarming Hi, then scoops it up. Ed rushes into the bank with Nathan Jr., as Lenny crashes his hog into the atrium."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hi and Ed, looking forward, don't spot Lenny approaching through the rear window as he saws out his second shotgun. Hi pulls Ed down just as—KA-BOOM!—the shotgun fires, shattering the window. Lenny tosses a grenade inside; Hi and Ed tumble out, Hi heading across the road, Ed diving behind a car. Their car explodes, flinging Hi onto the street. Watching Lenny turn his bike around, Hi groggily sits up. Lenny charges him on a wheelie; Hi rolls away, grabbing Lenny's boot chain but gets shaken off. Lenny turns again, revealing Ed fearlessly approaching. Lenny brandishes knives. Hi aims but Ed moves into the line of fire, grabbing the baby. Hi shoots, hitting Lenny, who drops a knife, fire spurting from his wound. Lenny throws his other knife, disarming Hi. Ed, now holding Nathan Jr., dashes into the bank. Meanwhile, Lenny crashes into the bank on his bike amidst the hayseeds."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Hi and Ed are positioned with their heads raised, both facing forward, completely unaware of the danger approaching from behind as Lenny stealthily advances once more through the rear window. In his hands, he brandishes yet another menacing shotgun. Hi, alert and cautious, scans the surroundings, then swiftly reacts. He reaches toward Ed, pulling her down beneath him at the very moment a loud KA-BOOM! reverberates—the second shotgun lets loose a thunderous roar, and shards of glass from the back window explode inward. As Lenny speeds past, he nonchalantly tosses something inside the vehicle. Below them, rattling ominously in the leg well, is Lenny's grenade. With a sudden rush of adrenaline, both front doors burst open, and Hi and Ed tumble out frantically. Hi, from the driver's side, sprints toward the distant side of the road, while Ed, emerging from the passenger side, dives for safety behind a conveniently parked car. Beyond her, a massive KABOOM! erupts—their car is engulfed in a fiery explosion, leaping into the air and belching thick black smoke. The powerful blast throws Hi to the ground, leaving him sprawled in the middle of the street. Through dazed eyes, Hi glimpses Lenny maneuvering his bike into a sharp U-turn; Lenny’s intentions are clear—he is not about to give up. Hi lies flat on his back, his head spinning as he slowly shakes it to clear his befuddled mind. With effort, he props himself up on his elbows, looking down the street along the length of his body where his legs form a V. Suddenly, Lenny's roaring bike crashes down from a wheelie, speeding directly toward Hi, aiming up the center of the V. In a desperate move, Hi rolls aside as the bike zooms past, quickly reaching out to catch a chain attached to Lenny's boot. Dragged several yards across the rough ground before Lenny's boot shakes him loose, Hi is left lying on his stomach, vulnerable in the center of the road. Looking up, Hi notices Lenny, once again, swiveling the bike around, skidding dramatically with smoke rising as it completes its turn. The camera pans up Lenny's back to reveal Ed striding determinedly up the street towards him—unarmed and unafraid. As Ed approaches, Lenny raises his arms into view, skillfully flicking his wrists to conjure two knives. Hi, still on his stomach, aims the gun toward Lenny, but Ed steps squarely into his line of fire, blocking Lenny and raising an arm to strike. She bends down to scoop the baby from the car seat, exposing Hi behind her just as he takes the shot. Lenny is caught by Hi's bullet, dropping his knife as the exit wound erupts, not with blood, but with a startling jet of fire. In an instant, Lenny flings the remaining knife toward Hi, expertly disarming him by knocking the gun from Hi's grip. As Lenny stoops to retrieve the fallen knife, Ed sprints toward the bank, holding Nathan Jr. tightly against her chest. She bursts through the door, entering an area filled with cowed hayseeds scattered across the floor. From Hi's prone position, there is a distinct BANG: the front door is thrown open, and Lenny's roaring motorcycle dramatically leaps off a step into the sunken atrium, landing with an emphatic CRASH amidst the hayseeds."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Hi and Ed find themselves positioned with their heads elevated, both facing straightforward, utterly oblivious to the imminent peril stealthily closing in from behind. Lenny, approaching with calculated stealth, advances once more through the rear window. With a menacing presence, he brandishes yet another ominous shotgun. Hi, remaining vigilant and cautious, meticulously scans the surroundings before he swiftly reacts. In a protective maneuver, he reaches toward Ed, pulling her down beneath him precisely at the moment a loud, echoing KA-BOOM reverberates—the second shotgun unleashes a thunderous blast, causing shards of glass from the back window to explode inward with forceful energy. As Lenny speeds past with brazen confidence, he nonchalantly tosses something into the vehicle. Rattling ominously in the leg well beneath them is none other than Lenny's grenade. With an adrenaline-fueled urgency, both front doors burst open with sudden force, and Hi along with Ed tumble out in a frenzied manner. Hi, exiting from the driver's side, propels himself toward the remote side of the road, while Ed, emerging hurriedly from the passenger side, dives for safety behind a conveniently parked car. Beyond her perspective, a massive, resonating KABOOM erupts—their car becomes engulfed in a fiery inferno, leaping dramatically into the air, belching thick black smoke. The forceful explosion propels Hi to the ground, leaving him sprawled helplessly in the middle of the street. Through his dazed and unfocused eyes, Hi glimpses Lenny skillfully maneuvering his bike into a sharp, decisive U-turn; Lenny’s intentions are unmistakable—he has no intention of conceding. Hi lies flat on his back, his head spinning from the impact as he slowly shakes it in an attempt to clear his befuddled mind. With effort and determination, he props himself up on his elbows, gazing down the street along the length of his body, where his legs are splayed out in a V shape. Abruptly, Lenny's roaring motorcycle crashes down from a wheelie, aimed directly down the center of the V between Hi's legs. In an act of desperate self-preservation, Hi rolls aside just as the bike zooms past him, quickly reaching out to snag a chain attached to Lenny's boot. Dragged several yards across the rough ground before Lenny's boot finally shakes him loose, Hi finds himself lying prone on his stomach, vulnerable and exposed in the center of the road. Looking up, he notices Lenny once again swiveling the bike around, executing a dramatic skid with smoke rising as it completes its turn. The camera, capturing the intensity of the moment, pans up the length of Lenny's back to reveal Ed striding with determined purpose up the street toward him—unarmed yet utterly unafraid. As Ed approaches, Lenny raises his arms into view, skillfully flicking his wrists to reveal two gleaming knives. Hi, still positioned on his stomach, aims the gun toward Lenny, but Ed boldly steps directly into his line of fire, blocking Lenny and raising an arm to strike. She lowers herself to scoop the baby from the car seat, inadvertently exposing Hi behind her just as he takes the critical shot. Lenny is struck by Hi's bullet, dropping his knife as the exit wound startlingly erupts, not with blood, but with an unexpected jet of fire. In a swift reaction, Lenny flings the remaining knife with precision toward Hi, expertly disarming him by knocking the gun from Hi's grip. As Lenny stoops to retrieve the fallen knife, Ed sprints with urgency toward the bank, cradling Nathan Jr. tightly against her chest. She bursts through the door with determination, entering a space filled with cowed hayseeds scattered across the floor. From Hi's prone position, a distinct BANG is heard: the front door is thrown open with powerful force, and Lenny's roaring motorcycle makes a dramatic leap off a step into the sunken atrium, landing with an emphatic CRASH amid the hayseeds."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Hi and Ed, with their heads raised and eyes facing forward, remain oblivious to Lenny's approach from behind as he stealthily retrieves his second shotgun. As the situation unfolds, Hi scans his surroundings, senses the imminent danger, and instinctively reaches out to pull Ed down beneath him just in the nick of time, right before KA-BOOM!—the deafening roar of the second shotgun echoes, and the back window shatters violently. In the split second that follows, Lenny, roaring past the broken window, nonchalantly tosses an object inside the vehicle. This object, a grenade, lands below them, bouncing around chaotically within the leg well. In response to this immediate threat, both front doors of the car are flung open, and Hi and Ed urgently scramble out to save themselves—Hi swiftly exits from the driver's side, aiming to reach the far side of the road, while Ed quickly dives for cover behind a parked car on the passenger side. Just beyond Ed's refuge, KABOOM!—their car erupts into a fiery explosion, the force of which sends it bouncing and belching thick black smoke. The explosion's blast wave propels Hi onto the ground, leaving him sprawled in the middle of the street. As he regains his bearings and looks up the street, he spots Lenny maneuvering his bike into a determined U-turn, signaling his unwavering persistence. Hi, lying flat on his back, dazedly shakes his head in an attempt to clear it before he feebly raises himself onto his elbows to survey the scene. His gaze travels down the street, extending along the length of his body to where his legs are splayed in a V-shape. At this critical moment, Lenny's roaring bike charges towards him, aligned right between the V formed by his legs. In a desperate bid to evade the impending collision, Hi rolls to the side just as the bike zooms past, and he reaches out, managing to snag a chain attached to Lenny's boot. Despite being dragged several yards across the ground, Hi eventually loses his grip as the boot shakes him off, leaving him lying on his stomach in the center of the road. As he lifts his head to assess the situation anew, he observes Lenny once more twisting his bike around, its tires smoking as it skids in the foreground to complete the maneuver. At this point, the camera shifts focus to reveal Ed advancing fearlessly up the street toward Lenny, undaunted and unarmed. As Ed closes the distance, Lenny raises his arms into view, deftly rolling his wrists to reveal two knives that seemingly materialize in his hands. Meanwhile, Hi, still positioned on his stomach, takes aim with his gun at Lenny, only to have Ed unintentionally step into his line of fire, inadvertently shielding Lenny while simultaneously raising an arm to deliver a stab. In a critical sequence, Ed stoops to retrieve the baby from the car seat, momentarily exposing Hi, who seizes the opportunity to fire his weapon. The bullet finds its mark, causing Lenny to drop one of his knives as the exit wound releases a brief jet of fire rather than blood. Quick as lightning, Lenny retaliates by flinging his remaining knife at Hi, which strikes with precision, disarming Hi by knocking the gun from his hand. Unfazed, Lenny bends down to reclaim the knife he initially dropped. Meanwhile, Ed, clutching Nathan Jr. protectively to her chest, sprints toward the bank and bursts inside, revealing a floor scattered with compliant hayseeds, frozen in place. Just as Hi lies prone outside, BANG: the front door is forcibly thrown open, heralding the entrance of Lenny's roaring motorcycle, which launches off a step into the sunken atrium, crashing down amidst the hayseeds with a resounding commotion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hi and Ed are initially unaware of Lenny's approach as he saws out his second shotgun. Hi quickly reacts by pulling Ed down just in time to avoid the shotgun blast that shatters the back window. Lenny tosses a grenade into the car before speeding past. As Hi and Ed scramble out of the car—Hi heading for the opposite side of the road and Ed diving for cover behind a parked car—their vehicle explodes, propelling Hi onto the street. Despite being disoriented, Hi notices Lenny executing a U-turn on his bike, indicating his pursuit isn't over. Hi rolls out of the way just as Lenny's bike roars past, but he manages to grab a chain on Lenny's boot, getting dragged before being shaken off. As Lenny turns his bike around, Ed fearlessly approaches him, and Lenny reveals two knives. Hi takes aim from the ground, but Ed moves into the line of fire to reach the car seat and lifts the baby, allowing Hi a clear shot. Hi fires, hitting Lenny, whose exit wound releases a jet of fire instead of blood. Lenny retaliates by throwing a knife at Hi, disarming him, and picks up the knife he dropped. Ed, clutching Nathan Jr. to her chest, runs toward the bank where hayseeds lie obediently on the floor. Meanwhile, Lenny crashes into the bank's atrium on his roaring bike, scattering the hayseeds."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Hi and Ed are raising their heads, facing forward, and do not see Lenny approaching again through the rear window as he saws out his second shotgun, a weapon notorious for its widespread use by law enforcement and military for its stopping power. Hi looks around, reaches, and pulls Ed down beneath him just as KA-BOOM! - the second shotgun roars and the back window spits in. As Lenny roars past the back window, he casually flips something in, and below them, something bounces into and around the leg well - Lenny's grenade, a small explosive device typically used in military operations for its destructive capability. As the two front doors fly open, Hi and Ed spill out - Hi from the driver's side, heading for the far side of the road, and Ed from the passenger side as she dives for cover behind a parked car, a typical defensive maneuver taught in self-defense courses. Beyond her, KABOOM! - their car explodes and bounces, pouring black smoke, and the explosion flings Hi to the ground in the middle of the street. Looking up the street, Hi sees Lenny wheeling his bike, a Harley-Davidson known for its power and reliability, in a U-turn; he is not finished yet. Hi lies flat on his back, woozily shaking his head, a reaction common after a concussion, and he weakly raises himself on his elbows to look down the street, down the length of his own body, where his legs stretch away in a V. Crashing down from a wheelie, Lenny's roaring bike is almost upon him, aiming up the middle of the V, so Hi rolls as the bike roars by, reaches, and snags a chain on Lenny's passing boot. Dragged several yards before the boot shakes him off, Hi is left on his stomach in the middle of the road. Hi looks up the road as Lenny is again sluing the bike around, smoking as it skids around in the foreground, completing its turn; boom up Lenny's back to reveal Ed stomping straight up the street toward him - unarmed, unafraid, exhibiting the courage often praised in action heroes. As Ed closes in, Lenny's arms rise into frame, and with a roll of his wrists, two knives appear in his hands, reminiscent of the quick-draw techniques practiced by professional knife throwers. On his stomach, Hi sights down the gun toward Lenny as Ed steps into his line of fire, blocking Lenny, and raising an arm to stab. Ed stoops to scoop the baby from the car seat, an instinctive protective action, revealing Hi behind her as he fires, and Lenny, drilled by Hi's bullet, drops its knife. The exit wound spurts, not flesh and blood, but a brief jet of fire, suggesting Lenny's unusual mechanical or non-human nature, and quick as a flash, Lenny hurls the other knife at Hi. The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped. As Ed runs toward the bank, clutching Nathan Jr. to her chest and bursts in, the floor is littered with obedient hayseeds, a colloquial term for country folk, likely hostages in this scenario. From where Hi lies prone, BANG: the front door bursts open before Lenny's roaring hog, which sails off a step into the sunken atrium, a design often used in modern architecture to create depth, and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade he is not finished yet Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car Beyond her KABOOM their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street Looking up the street Hi sees Lenny wheeling his bike in a Uturn he is not finished yet Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds From where Hi lies prone BANG the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun. Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in. As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade. As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car. Beyond her KABOOM. their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street. Looking up the street Hi sees Lenny wheeling his bike in a Uturn. he is not finished yet. Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V. Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road. Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid. As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands. On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab. Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife. The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi. The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped. As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds. From where Hi lies prone BANG. the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun. Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in. As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade. As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car. Beyond her KABOOM. their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street. Looking up the street Hi sees Lenny wheeling his bike in a Uturn. he is not finished yet. Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V. Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road. Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid. As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands. On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab. Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife. The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi. The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped. As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds. From where Hi lies prone BANG. the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun. Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in. As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade. As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car. Beyond her KABOOM. The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi. The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped. As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds. From where Hi lies prone BANG. the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun. Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in. From where Hi lies prone BANG. the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Hi and a giraffe are raising their heads, facing forward, and do not see a toaster approaching again through the rear window as it saws out its second shotgun. A giraffe looks around, reaches, and pulls a violin down beneath it just as KA-BOOM! - the second shotgun roars and the back window spits in. As the toaster roars past the back window, it casually flips something in, and below them, something bounces into and around the leg well - a toaster's grenade. As the two front doors fly open, a giraffe and a violin spill out - a giraffe from the driver's side, heading for the far side of the road, and a violin from the passenger side as it dives for cover behind a parked car. Beyond it, KABOOM! - their car explodes and bounces, pouring black smoke, and the explosion flings a giraffe to the ground in the middle of the street. Looking up the street, a giraffe sees the toaster wheeling its bike in a U-turn; it is not finished yet. A giraffe lies flat on its back, woozily shaking its head, and it weakly raises itself on its elbows to look down the street, down the length of its own body, where its legs stretch away in a V. Crashing down from a wheelie, the toaster's roaring bike is almost upon it, aiming up the middle of the V, so a giraffe rolls as the bike roars by, reaches, and snags a chain on the toaster's passing boot. Dragged several yards before the boot shakes it off, a giraffe is left on its stomach in the middle of the road. A giraffe looks up the road as the toaster is again sluing the bike around, smoking as it skids around in the foreground, completing its turn; boom up the toaster's back to reveal a violin stomping straight up the street toward it - unarmed, unafraid. As a violin closes in, the toaster's arms rise into frame, and with a roll of its wrists, two knives appear in its hands. On its stomach, a giraffe sights down the gun toward the toaster as a violin steps into its line of fire, blocking the toaster, and raising an arm to stab. A violin stoops to scoop the baby from the car seat, revealing a giraffe behind it as it fires, and the toaster, drilled by a giraffe's bullet, drops its knife. The exit wound spurts, not flesh and blood, but a brief jet of fire, and quick as a flash, the toaster hurls the other knife at a giraffe. The knife stings the gun out of a giraffe's hand as the toaster bends to scoop up the knife it dropped. As a violin runs toward the bank, clutching Nathan Jr. to its chest and bursts in, the floor is littered with obedient hayseeds. From where a giraffe lies prone, BANG: the front door bursts open before the toaster's roaring hog, which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Hi and Ed are raising their heads, facing forward, and do not see Lenny approaching again through the attic window as he saws out his second megaphone. Hi looks around, reaches, and pulls Ed down beneath him just as KA-BOOM! - the second megaphone roars and the back window spits in. As Lenny roars past the attic window, he casually flips something in, and below them, something bounces into and around the leg well - Lenny's tambourine. As the two front doors fly open, Hi and Ed spill out - Hi from the driver's side, heading for the far side of the park, and Ed from the passenger side as she dives for cover behind a parked tractor. Beyond her, KABOOM! - their tractor explodes and bounces, pouring blue mist, and the explosion flings Hi to the ground in the middle of the field. Looking up the field, Hi sees Lenny wheeling his unicycle in a U-turn; he is not finished yet. Hi lies flat on his back, woozily shaking his head, and he weakly raises himself on his elbows to look down the field, down the length of his own body, where his legs stretch away in a V. Crashing down from a wheelie, Lenny's roaring unicycle is almost upon him, aiming up the middle of the V, so Hi rolls as the unicycle roars by, reaches, and snags a scarf on Lenny's passing boot. Dragged several yards before the boot shakes him off, Hi is left on his stomach in the middle of the field. Hi looks up the field as Lenny is again sluing the unicycle around, smoking as it skids around in the foreground, completing its turn; zoom up Lenny's back to reveal Ed stomping straight up the field toward him - unarmed, unafraid. As Ed closes in, Lenny's arms rise into frame, and with a roll of his wrists, two feathers appear in his hands. On his stomach, Hi sights down the telescope toward Lenny as Ed steps into his line of view, blocking Lenny, and raising an arm to stab. Ed stoops to scoop the baby from the stroller, revealing Hi behind her as he fires, and Lenny, drilled by Hi's bullet, drops its feather. The exit wound spurts, not flesh and blood, but a brief jet of water, and quick as a flash, Lenny hurls the other feather at Hi. The feather stings the telescope out of Hi's hand as Lenny bends to scoop up the feather he dropped. As Ed runs toward the gazebo, clutching Nathan Jr. to her chest and bursts in, the floor is littered with obedient rakes. From where Hi lies prone, BANG: the front door bursts open before Lenny's roaring tractor, which sails off a step into the sunken courtyard and lands with a CRASH amidst the rakes."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Hi and Ed are lowering their heads, staring blankly, and do not notice Lenny retreating again through the rear window as he yanks out his second shotgun. Hi glances around, extends his arm, and nudges Ed up beside him just as KA-BOOM! - the second shotgun erupts and the back window shatters out. As Lenny speeds past the back window, he nonchalantly tosses something out, and above them, something rolls onto and across the roof - Lenny's grenade. As the two front doors slam shut, Hi and Ed tumble in - Hi from the driver's side, heading for the near side of the road, and Ed from the passenger side as she leaps for cover inside a parked car. Beyond her, KABOOM! - their car implodes and settles, emitting white smoke, and the blast draws Hi to his feet on the edge of the sidewalk. Looking down the street, Hi sees Lenny steadying his bike in a straight line; he is not finished yet. Hi stands upright on his feet, steadily nodding his head, and he firmly lowers himself on his knees to peer up the street, up the length of his own body, where his arms stretch outward in a T. Sinking down from a wheelie, Lenny's silent bike is almost beside him, veering up the edge of the T, so Hi leaps as the bike whizzes by, stretches, and grabs a scarf on Lenny's passing helmet. Pulled several inches before the helmet releases him, Hi is left on his back on the side of the road. Hi glances down the road as Lenny is again swinging the bike around, steaming as it pivots around in the background, completing its spin; zoom down Lenny's front to reveal Ed marching straight down the street toward him - unarmed, undeterred. As Ed advances, Lenny's feet rise into view, and with a flick of his ankles, two pebbles appear in his fingers. On his back, Hi aims up the slingshot toward Lenny as Ed jumps into his line of sight, obscuring Lenny, and raising an arm to intercept. Ed crouches to lift the baby from the car seat, uncovering Hi behind her as he shoots, and Lenny, grazed by Hi's dart, drops the pebble. The exit wound emits, not flesh and blood, but a brief jet of water, and quick as a wink, Lenny flings the other pebble at Hi. The pebble taps the slingshot out of Hi's hand as Lenny leans to pick up the pebble he lost. As Ed jogs toward the bakery, holding Nathan Jr. to her side and bursts out, the floor is scattered with restless hayseeds. From where Hi stands upright, BANG: the front door slides open before Lenny's quiet hog, which glides off a step into the raised atrium and lands with a THUD amidst the hayseeds."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Bert and Sue are lowering their hats, facing backward, and do not see Danny retreating again through the side skylight as he paints out his second trumpet. Bert glances around, stretches, and pulls Sue up above him just as WHOOSH! - the second trumpet sings and the front skylight dances in. As Danny screeches past the front skylight, he indifferently flips something out, and above them, something twirls out of and around the arm rest - Danny's basketball. As the two rear hatches fling closed, Bert and Sue tumble in - Bert from the passenger's side, heading for the near side of the garden, and Sue from the driver's side as she leaps for cover over a sitting bench. Behind him, WHOOSH! - their house implodes and twirls, exhaling white steam, and the implosion tosses Bert to the roof in the middle of the field. Staring down the field, Bert notices Danny wheeling his trike in a Z-turn; he is not concluded yet. Bert lies flat on his chest, briskly nodding his feet, and he softly lowers himself on his knees to peer up the field, up the width of his own head, where his arms stretch together in a Y. Rising up from a wheelie, Danny's screeching trike is nearly over them, aiming down the middle of the Y, so Bert flips as the trike screeches by, stretches, and snags a ribbon on Danny's passing glove. Dragged several meters before the glove rattles him on, Bert is left on his back in the middle of the field. Bert peers down the field as Danny is again swaying the trike around, steaming as it slides around in the background, completing its spin; whoosh down Danny's front to display Sue jogging straight down the field toward her - unarmed, unafraid. As Sue closes on, Danny's feet drop out of frame, and with a flick of his ankles, two swords drop in his shoes. On his back, Bert tracks up the hoop toward Danny as Sue jumps into his line of swing, blocking Danny, and lowering a foot to kick. Sue jumps to catch the balloon from the wagon seat, displaying Bert in front of him as she yells, and Danny, pierced by Bert's arrow, drops her sword. The entry wound spurts, not foam and rain, but a brief jet of air, and quick as a sigh, Danny flings the other sword at Bert. The sword pinches the hoop out of Bert's grip as Danny stretches to catch the sword she tossed. As Sue runs away from the bazaar, clutching Michael Jr. to his head and breaks out, the ceiling is scattered with stubborn beach balls. From where Bert stands upright, BOOM: the back hatch slams closed after Danny's screeching scooter, which glides onto a ledge off the shadowed balcony and bounces with a POP within the beach balls."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Hi and Ed are lowering their arms, turning sideways, and do not hear Marcy floating again through the rear door as she plays out her second violin. Hi glances around, jumps, and tosses Ed above him just as WHAM! - the second violin sings and the side window groans in. As Marcy sings past the side window, she absentmindedly tosses something in, and beneath them, something slides into and around the footwell - Marcy's cupcake. As the two back doors whirl open, Hi and Ed tumble out - Hi from the passenger's side, heading for the near side of the sidewalk, and Ed from the driver's side as she dashes for shade behind a lamp post. Beside her, WHOOSH! - their car implodes and dances, emitting blue steam, and the implosion throws Hi to the sidewalk in the middle of the avenue. Peering up the avenue, Hi spots Marcy guiding her tricycle in a circle; she is not done yet. Hi lies flat on his chest, groggily nodding his head, and he slowly lifts himself on his knees to glance down the avenue, down the stretch of his own figure, where his arms extend outward in an A. Bouncing down from a skid, Marcy's humming tricycle is almost beside him, targeting the center of the A, so Hi spins as the tricycle hums by, stretches, and snatches a bracelet on Marcy's passing shoe. Towed several feet before the shoe shakes him loose, Hi is left on his back in the middle of the avenue. Hi gazes up the avenue as Marcy is once more guiding the tricycle around, steaming as it drifts around in the near view, finishing its circle; tilt up Marcy's chest to unveil Ed marching straight up the avenue toward her - unarmed, unafraid. As Ed nears, Marcy's hands lift into view, and with a flick of her fingers, two sporks materialize in her grip. On his back, Hi peers down the shoe toward Marcy as Ed enters his line of sight, blocking Marcy, and raising an elbow to poke. Ed hops to gather the toy from the swing, exposing Hi behind her as he leaps, and Marcy, nudged by Hi's pebble, drops her spork. The exit portal releases, not wood and paint, but a fleeting plume of smoke, and quick as a wink, Marcy flings the other spork at Hi. The spork nicks the shoe out of Hi's grasp as Marcy crouches to gather the spork she dropped. As Ed sprints toward the barn, embracing Nathan Jr. to her back and barges in, the ground is lined with obedient pumpkins. From where Hi rests flat, CLANG: the side gate bursts open before Marcy's humming tricycle, which glides off a ramp into the sunken courtyard and settles with a THUD amongst the pumpkins."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Hi and Ed are tilting their ears, looking sideways, and do not hear Lenny sliding again through the side panel as he slices out his second banana. Hi glances around, stretches, and pushes Ed up above him just as WHOOSH! - the second banana whispers and the side panel murmurs out. As Lenny whispers past the side panel, he lazily tosses something out, and above them, something skips onto and over the headrest - Lenny's apple. As the two rear windows slam shut, Hi and Ed slip in - Hi from the navigator's side, heading for the near side of the river, and Ed from the driver’s side as she leaps for safety behind an idle bicycle. Beside her, WHAM! - their bicycle implodes and skids, leaking yellow fog, and the implosion whisks Hi to the sky in the center of the alley. Gazing down the alley, Hi notices Lenny steering his unicycle in a loop; he is not done yet. Hi sits up on his hands, lazily nodding his head, and he feebly lowers himself on his shoulders to look up the alley, up the length of his own body, where his arms extend away in a Y. Lurching up from a slide, Lenny's buzzing unicycle is nearly beside him, aiming down the center of the Y, so Hi jumps as the unicycle buzzes past, stretches, and grasps a cord on Lenny's trailing helmet. Pulled several feet before the helmet detaches him, Hi is left on his knees in the center of the alley. Hi gazes down the alley as Lenny is again swirling the unicycle around, steaming as it swivels around in the background, completing its pivot; zoom out from Lenny's front to reveal Ed pounding straight down the alley toward him - unarmed, unflinching. As Ed advances, Lenny's legs fall into position, and with a flick of his ankles, two marbles appear in his pockets. On his back, Hi peers down the slingshot toward Lenny as Ed leaps into his line of sight, obstructing Lenny, and lowering a foot to trip. Ed bends to snatch the kitten from the stroller, revealing Hi ahead of her as he propels, and Lenny, nudged by Hi's dart, drops its marble. The entry hole gushes, not air and dust, but a swift stream of water, and quick as a blink, Lenny flings the other marble at Hi. The marble pricks the slingshot out of Hi's grasp as Lenny kneels to gather up the marble he let fall. As Ed sprints toward the store, hugging Nathan Jr. to her back and bursts out, the floor is strewn with patient daisies. From where Hi kneels upright, WHOOSH: the rear window slams shut behind Lenny's buzzing scooter, which sails up a step into the elevated platform and lands with a THUD amidst the daisies."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Howdy and Fred are tilting their ears, gazing upward, and do not spot Benny hopping yet again through the side porthole as he chisels out his second banjo. Howdy glances upward, stretches, and yanks Fred upward above him just as WHAM! - the second banjo screams and the roof portal coughs out. As Benny screams past the roof portal, he nonchalantly twirls something out, and above them, something skips over and through the knee pit - Benny's frisbee. As the two chimney flaps burst apart, Howdy and Fred tumble upward - Howdy from the passenger's nook, racing for the near side of the meadow, and Fred from the conductor's nook as he plunges for refuge beneath a sleeping dog. Below him, WHAMMO! - their bicycle implodes and skips, pouring orange vapor, and the eruption hurls Howdy to the treetops in the middle of the orchard. Gazing down the orchard, Howdy spots Benny spinning his tricycle in a J-turn; he is far from done. Howdy flattens on his belly, dizzily nodding his ears, and he eagerly lifts himself on his knees to peer up the orchard, up the breadth of his own jacket, where his fingers twist away in a Y. Tipping up from a nosedive, Benny's squealing tricycle is almost over him, aiming up the middle of the Y, so Howdy spins as the tricycle squeals by, stretches, and grips a cord on Benny's sweeping sandal. Dragged numerous feet before the sandal twists him off, Howdy is left on his spine in the center of the path. Howdy gazes down the path as Benny is once more sliding the tricycle around, squealing as it skims around in the backdrop, wrapping up its twist; boom up Benny's nose to reveal Fred marching straight down the orchard toward him - unarmed, undeterred. As Fred nears, Benny's lips elevate into scene, and with a flick of his ankles, two ladles manifest in his paws. On his spine, Howdy aims down the broom toward Benny as Fred maneuvers into his field of view, obscuring Benny, and elevating a paw to braid. Fred squats to lift the puppy from the cot spot, exposing Howdy below him as he swings, and Benny, pierced by Howdy's arrow, drops its ladle. The entrance chasm sprays, not hair and juice, but a fleeting gust of sparks, and as swift as a breeze, Benny flings the other ladle at Howdy. The ladle pricks the broom out of Howdy's paw as Benny stoops to gather the ladle he cast down. As Fred scampers toward the barn, cradling Wilson Jr. to his paw and barges inside, the meadow is strewn with compliant daisies. From where Howdy reclines belly-down, BOOM: the roof hatch bursts closed behind Benny's squealing cart, which glides off a leap into the risen spur and descends with a BANG amidst the daisies."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hi and Ed face forward, unaware as Lenny approaches from behind, wielding a second shotgun. Hi quickly pulls Ed down just as Lenny fires, shattering the back window. Lenny tosses a grenade into their car, forcing Hi and Ed to dive out as it explodes. In the chaos, Hi is thrown to the ground, watching Lenny prepare for another attack. Lenny charges on his bike, and Hi narrowly avoids him, grabbing Lenny's boot chain to no avail. As Lenny turns around, Ed fearlessly approaches him. Lenny draws knives, ready to strike, but Ed retrieves a baby from the car. Hi seizes the moment, shooting Lenny, whose wound expels fire rather than blood. Lenny retaliates, knocking the gun from Hi's hand. Ed runs to the bank with Nathan Jr., and Lenny crashes his motorcycle into the bank, scattering the hayseeds inside."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds From where Hi lies prone BANG As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V he is not finished yet Looking up the street Hi sees Lenny wheeling his bike in a Uturn their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street Beyond her KABOOM As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife Beyond her KABOOM Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi From where Hi lies prone BANG Looking up the street Hi sees Lenny wheeling his bike in a Uturn As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped he is not finished yet Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Dragged several yards before the boot shakes him off Hi is left on his stomach in the middle of the road Hi looks up the road as Lenny is again sluing the bike around smoking as it skids around in the foreground completing its turn boom up Lenny's back to reveal Ed stomping straight up the street toward him  unarmed unafraid As Ed closes in Lenny's arms rise into frame and with a roll of his wrists two knives appear in his hands On his stomach Hi sights down the gun toward Lenny as Ed steps into his line of fire blocking Lenny and raising an arm to stab Ed stoops to scoop the baby from the car seat revealing Hi behind her as he fires and Lenny drilled by Hi's bullet drops its knife The exit wound spurts not flesh and blood but a brief jet of fire and quick as a flash Lenny hurls the other knife at Hi The knife stings the gun out of Hi's hand as Lenny bends to scoop up the knife he dropped As Ed runs toward the bank clutching Nathan Jr to her chest and bursts in the floor is littered with obedient hayseeds From where Hi lies prone BANG the front door bursts open before Lenny's roaring hog which sails off a step into the sunken atrium and lands with a CRASH amidst the hayseeds Hi and Ed are raising their heads facing forward and do not see Lenny approaching again through the rear window as he saws out his second shotgun Hi looks around reaches and pulls Ed down beneath him just as KABOOM  the second shotgun roars and the back window spits in As Lenny roars past the back window he casually flips something in and below them something bounces into and around the leg well  Lenny's grenade As the two front doors fly open Hi and Ed spill out  Hi from the driver's side heading for the far side of the road and Ed from the passenger side as she dives for cover behind a parked car Beyond her KABOOM their car explodes and bounces pouring black smoke and the explosion flings Hi to the ground in the middle of the street Looking up the street Hi sees Lenny wheeling his bike in a Uturn he is not finished yet Hi lies flat on his back woozily shaking his head and he weakly raises himself on his elbows to look down the street down the length of his own body where his legs stretch away in a V Crashing down from a wheelie Lenny's roaring bike is almost upon him aiming up the middle of the V so Hi rolls as the bike roars by reaches and snags a chain on Lenny's passing boot"
        }
      ]
    }
  ]
}