{
  "ground_truth": "Thorwald completes his call and returns to the bedroom with a handbag, which he slides under a pile of coats on the bed. Footsteps approach Jeff's apartment, and as he lowers his camera lens, Lisa stands silhouetted in the doorway, black-lighted by the corridor lights. Jeff, with his back more toward the neighborhood, is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom, and he pours himself a drink in the living room, looking down into the garden nonchalantly before stopping quickly. Jeff turns back to the window, and Thorwald puts down his unfinished drink, goes to the door, turns off the light in the living room, and exits. He walks briskly down the corridor while Jeff picks up the long-focus lens and trains it on the street intersection as Lisa moves toward him. As Lisa turns on the lights in the apartment, it's revealed she is wearing an extravagantly beautiful dress. Jeff turns to face the room, talking as Lisa animatedly moves, and Jeff watches her pace with an oversized handbag prominently on the table. The camera closes in as Lisa stops and faces Jeff, then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap, and she puts her arms around him, appearing very happy as she kisses his cheek. Jeff moves back to look her in the eye, there's a pause, and she cuts him off with a series of kisses. Lisa then gets up, laughs, goes to the handbag on the table, and returns to sit in Jeff's lap, displaying the bag's contents. It is a Mark Cross ladies 'attache' case, opened to reveal a compact set of pajamas, slippers, toothbrush, toothpaste, and other necessities for a comfortable overnight stay.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Thorwald finishes his call and returns to the bedroom with a purse, which he slides under a stack of jackets on the bed. Footsteps approach Jeff's apartment, and as he lowers his camera lens, Lisa stands silhouetted in the entrance, backlit by the corridor lights. Jeff, with his back more toward the neighborhood, is initially turned toward her but suddenly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom, and he pours himself a beverage in the living room, looking down into the garden casually before stopping quickly. Jeff turns back to the window, and Thorwald puts down his unfinished drink, goes to the door, turns off the light in the living room, and leaves. He walks quickly down the corridor while Jeff picks up the telephoto lens and trains it on the street intersection as Lisa moves toward him. As Lisa turns on the lights in the apartment, it's revealed she is wearing an extravagantly beautiful gown. Jeff turns to face the room, speaking as Lisa animatedly moves, and Jeff watches her pace with an oversized purse prominently on the table. The camera closes in as Lisa stops and faces Jeff, then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap, and she puts her arms around him, appearing very joyful as she kisses his cheek. Jeff moves back to look her in the eye, there's a pause, and she cuts him off with a sequence of kisses. Lisa then gets up, laughs, goes to the purse on the table, and returns to sit in Jeff's lap, displaying the bag's contents. It is a Mark Cross ladies 'attache' case, opened to reveal a compact set of pajamas, slippers, toothbrush, toothpaste, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Thorwald completes his call, and the handbag is returned to the bedroom by him, where it is slid under a pile of coats on the bed. Footsteps approach Jeff's apartment, and as the camera lens is lowered by him, Lisa stands silhouetted in the doorway, black-lighted by the corridor lights. Initially turned toward her by Jeff, with his back more toward the neighborhood, he abruptly turns back to the window as she dashes behind him. The lights are out in Thorwald's bedroom, and a drink is poured by him in the living room, looking down into the garden nonchalantly before he quickly stops. Jeff turns back to the window, and the unfinished drink is put down by Thorwald, who goes to the door, turns off the living room light, and exits. The corridor is briskly walked down by him while the long-focus lens is picked up by Jeff and trained it on the street intersection as she moves toward him. As the lights in the apartment are turned on by Lisa, it's revealed she is wearing an extravagantly beautiful dress. Jeff turns to face the room, talking as she animatedly moves, and her pace with an oversized handbag prominently on the table is watched by him. The camera closes in as she stops and faces Jeff, then eases back as he is come over to by her with sparkling eyes and tense concentration. She is pulled into his lap by Jeff, and his cheek is kissed by her, appearing very happy as her arms are put around him. Jeff moves back to look her in the eye, there's a pause, and a series of kisses cuts him off. She then gets up, laughs, goes to the handbag on the table, and returns to sit in his lap, displaying the bag's contents. It is a Mark Cross ladies 'attache' case, opened by her to reveal a compact set of pajamas, slippers, toothbrush, toothpaste, and other necessities for a comfortable overnight stay."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Thorwald finishes his call and returns to the bedroom with a handbag, sliding it under coats on the bed. Footsteps near Jeff's apartment as he lowers his camera lens, and Lisa appears silhouetted by corridor lights. Initially turned toward her, Jeff quickly shifts back to the window as she moves behind him. Thorwald, in the darkened bedroom, pours a drink in the living room, glancing at the garden before suddenly pausing. Jeff turns back to the window; Thorwald leaves his drink, exits after turning off the light, and walks briskly down the corridor. Jeff uses a long-focus lens on the street intersection while Lisa moves toward him. As she turns on the apartment lights, she's revealed in a stunning dress. Jeff talks as Lisa paces with a large handbag on the table. The camera focuses on Lisa as she approaches Jeff with sparkling eyes. He pulls her into his lap, exchanging kisses and conversation. Lisa laughs, retrieves the handbag, and returns to Jeff's lap, showing its contents—a Mark Cross attache case with essentials for an overnight stay."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Thorwald completes his call, returns to the bedroom, and slides a handbag under coats on the bed. Footsteps approach Jeff's apartment; Lisa stands silhouetted in the doorway. Jeff initially faces her, then turns to the window as Lisa moves behind him. Thorwald, after pouring a drink, looks into the garden before stopping abruptly, exits the apartment, and walks briskly down the corridor. Jeff, using a long-focus lens, watches the street as Lisa moves toward him. She turns on the lights, revealing an extravagant dress, while Jeff watches her with an oversized handbag on the table. Lisa stops, faces Jeff, approaches him with sparkling eyes, and kisses his cheek as he pulls her into his lap. She then gets up, laughs, and returns with the open handbag, which is a Mark Cross case containing overnight necessities."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "After completing his phone call, Thorwald makes his way back to the bedroom, where he discreetly slides a handbag under a pile of coats carelessly strewn on the bed. Meanwhile, the sound of approaching footsteps becomes audible in the corridor leading to Jeff's apartment. As Jeff lowers his camera lens in anticipation, Lisa is suddenly visible, standing in the doorway. She is dramatically silhouetted by the strong black light from the corridor lights behind her. Jeff, positioned with his back more toward the neighborhood outside, is initially facing her but then turns back abruptly to the window as Lisa swiftly moves behind him. The lights in Thorwald's bedroom are notably off, casting the room in darkness, and he nonchalantly pours himself a drink in the dim light of the living room, peering down into the garden with apparent casualness before stopping abruptly. Jeff refocuses his attention on the window scene as Thorwald, having placed down his unfinished drink, proceeds to the door, switches off the light in the living room, and exits the room. With a brisk pace, he walks down the corridor, while Jeff, now with heightened focus, picks up his long-focus camera lens and directs it toward the street intersection as Lisa confidently moves toward him. When Lisa turns on the lights in the apartment, it instantly reveals she is clad in an extravagantly beautiful dress. Jeff, now facing the room, begins to speak as Lisa moves with lively animation, and he attentively observes her pacing with an oversized handbag prominently displayed on the table. The camera zooms in closely as Lisa pauses, facing Jeff, then eases back as she approaches him with sparkling eyes and a look of tense concentration. Jeff draws her into his lap tenderly, and she wraps her arms around him with a joyful expression, kissing his cheek affectionately. As Jeff leans back to gaze into her eyes, there is a brief pause, but Lisa playfully interrupts him with a series of spontaneous kisses. Laughing, Lisa then stands up, makes her way to the handbag on the table, and returns to sit comfortably on Jeff's lap, revealing the bag's contents with a sense of pride. The bag is a Mark Cross ladies 'attache' case, opened wide to display a compact set of neatly arranged pajamas, soft slippers, essential toothbrush and toothpaste, along with various other necessities intended for a comfortable overnight stay."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "After completing his phone call, Thorwald quietly makes his way back into the bedroom. There, with an air of discretion, he carefully slides a handbag beneath a haphazardly scattered pile of coats that lie carelessly strewn across the bed. Meanwhile, in the hallway leading toward Jeff's apartment, the sound of footsteps becomes increasingly audible, indicating someone's approach. As Jeff lowers his camera lens in eager anticipation, Lisa suddenly emerges, standing prominently in the doorway. Her silhouette is dramatically framed by the strong backlight emanating from the corridor lights behind her. Jeff, initially positioned so that he is facing her with his back more toward the neighborhood outside, abruptly turns back toward the window as Lisa quickly moves behind him. Notably, the lights in Thorwald's bedroom are turned off, plunging the room into darkness. He nonchalantly pours himself a drink in the muted light of the living room, casting a casual glance down into the garden before abruptly pausing. Jeff refocuses his attention on the unfolding scene by the window as Thorwald, having set down his unfinished drink, proceeds to the door. He switches off the living room light and exits the room with a brisk step, walking determinedly down the corridor. At this moment, Jeff, now with heightened focus and attention, picks up his long-focus camera lens, directing it with precision toward the street intersection as Lisa confidently moves toward him. When Lisa turns on the apartment lights, it instantly becomes apparent that she is clad in a stunningly extravagant dress. Jeff, now fully facing the room, begins to speak while Lisa moves with lively and animated motions, his gaze attentively following her as she paces with an oversized handbag prominently displayed on the table. The camera zooms in closely as Lisa pauses, looking directly at Jeff, before easing back as she approaches him with sparkling eyes and an intense expression of concentration. Jeff tenderly draws her into his lap, and she joyfully wraps her arms around him, kissing his cheek affectionately. As Jeff leans back slightly to gaze into her eyes, there is a fleeting pause, but Lisa playfully interrupts him, showering him with a series of spontaneous kisses. Laughing, Lisa stands up, moves to retrieve the handbag from the table, and comfortably returns to sit on Jeff's lap, revealing the contents of the bag with a sense of pride and pleasure. The bag is a Mark Cross ladies 'attache' case, opened wide to display a compact collection of neatly arranged pajamas, soft slippers, an essential toothbrush and toothpaste, along with various other necessities that are thoughtfully included for a comfortable and enjoyable overnight stay."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Thorwald completes his call and, with a purposeful stride, enters the bedroom carrying a handbag. He carefully kneels by the bed, lifting the edges of a pile of coats, and gently slides the handbag beneath them, ensuring it's discreetly hidden. Meanwhile, the sound of footsteps approaching Jeff's apartment becomes audible, prompting Jeff to lower his camera lens. He takes a moment to refocus his attention toward the doorway, where Lisa dramatically stands silhouetted, her figure outlined by the strong backlight from the corridor lights. Jeff, initially facing her, suddenly shifts his attention back toward the window as Lisa swiftly moves behind him. In Thorwald's apartment, the bedroom is cast in darkness while Thorwald, in the living room, casually pours himself a drink. He takes a moment to gaze down into the garden, maintaining a nonchalant demeanor until something abruptly captures his attention, causing him to halt. Jeff, sensing the change in the scene, turns back to the window just as Thorwald places his unfinished drink down with a sense of urgency. Thorwald proceeds to the door, flicks off the living room light with a quick motion, and exits, his steps brisk as he walks down the corridor. Observing these movements, Jeff picks up the long-focus lens, adjusting it with precision to focus on the street intersection. Lisa, meanwhile, maneuvers gracefully toward him, and with a sudden flick, she turns on the apartment lights, revealing her in an extravagantly beautiful dress. Captivated, Jeff pivots to face the room, engaging her in conversation as Lisa moves energetically around, her motions filled with purpose. Jeff's attention is drawn to the oversized handbag prominently displayed on the table, while Lisa's animated pacing creates an atmosphere of excitement. As she halts and faces Jeff, the camera closes in, capturing her expressive face before easing back as she approaches him with sparkling eyes and intense concentration. Jeff, unable to resist her charm, gently pulls her into his lap, feeling the warmth as she wraps her arms around him and kisses his cheek with evident happiness. He shifts slightly to meet her gaze, but just as he begins to speak, she interrupts with a flurry of affectionate kisses. Lisa then elegantly rises, her laughter filling the room as she heads toward the handbag on the table. She returns with a playful demeanor, settling back into Jeff's lap, presenting the handbag's contents in a delightful display. The bag opens to reveal a neatly organized Mark Cross ladies 'attache' case, its compartments filled with a compact set of essentials: pajamas, slippers, a toothbrush, toothpaste, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Thorwald completes his call, returns to the bedroom with a handbag, and slides it under a pile of coats. As footsteps approach Jeff's apartment, Lisa appears silhouetted in the doorway, contrasting with the corridor lights. Jeff momentarily faces her before returning to watch Thorwald, who pours a drink in his darkened bedroom, glances into the garden, and then quickly exits the apartment. Thorwald walks briskly down the corridor while Jeff uses his long-focus lens to watch the street intersection, and Lisa moves toward him, revealing her extravagant dress as she turns on the apartment lights. Jeff turns to talk to Lisa, who animatedly paces with a prominent oversized handbag on the table. The camera zooms in as Lisa faces Jeff before moving closer with sparkling eyes, and he pulls her into his lap as she happily kisses his cheek. After exchanging brief glances and kisses, Lisa laughs, retrieves the handbag, and shows its contents—revealing a compact setup for an overnight stay—before sitting back in Jeff's lap."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Thorwald, a salesman known in the area for his frequent trips and mysterious late-night activities, completes his call and returns to the bedroom with a handbag, which he slides under a pile of coats on the bed. Footsteps approach Jeff's apartment, a small urban unit with a perfect vantage point over the busy neighborhood, and as he lowers his camera lens, Lisa stands silhouetted in the doorway, romantically black-lighted by the corridor lights. Jeff, with his back more toward the lively urban neighborhood known for its diverse community, is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom, and he pours himself a drink, a favorite ritual at the end of his workday, in the living room, looking down into the garden nonchalantly before stopping quickly. Jeff turns back to the window, and Thorwald, sensing a late-night visitor at the garden entrance, puts down his unfinished drink, goes to the door, turns off the light in the living room, and exits. He walks briskly down the corridor while Jeff picks up the long-focus lens and trains it on the bustling street intersection as Lisa moves toward him. As Lisa turns on the lights in the apartment, it's revealed she is wearing an extravagantly beautiful dress, designed by a renowned New York fashion house. Jeff turns to face the room, talking as Lisa animatedly moves, and Jeff watches her pace with an oversized handbag prominently on the table. The camera closes in as Lisa stops and faces Jeff, then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap, and she puts her arms around him, appearing very happy as she kisses his cheek. Jeff moves back to look her in the eye, there's a pause, and she cuts him off with a series of kisses. Lisa then gets up, laughs, goes to the handbag on the table, and returns to sit in Jeff's lap, displaying the bag's contents. It is a Mark Cross ladies 'attache' case, a luxury travel accessory favored by the elite, opened to reveal a compact set of pajamas, slippers, toothbrush, toothpaste, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly Jeff moves back to look her in the eye Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights Jeff then eases back as she comes over to him with sparkling eyes and tense concentration Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table The camera closes in as Lisa stops and faces Jeff then eases back as she comes over to him with sparkling eyes and tense concentration Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed Jeff moves back to look her in the eye there is a pause and she cuts him off with a series of kisses Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed. Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights. Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly. Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits. He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him. As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table. The camera closes in as Lisa stops and faces. Jeff then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek. Jeff moves back to look her in the eye. there is a pause and she cuts him off with a series of kisses. Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents. It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed. Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights. Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly. Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits. He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him. As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table. The camera closes in as Lisa stops and faces. Jeff then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek. Jeff moves back to look her in the eye. there is a pause and she cuts him off with a series of kisses. Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents. It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed. Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights. Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly. Jeff moves back to look her in the eye. there is a pause and she cuts him off with a series of kisses. Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents. It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed. Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents. It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The detective completes his call and returns to the bedroom with a handbag, which he slides under a pile of coats on the bed. Footsteps approach the cat's apartment, and as the cat lowers the camera lens, the dog stands silhouetted in the doorway, black-lighted by the corridor lights. The cat, with its back more toward the neighborhood, is initially turned toward the dog but abruptly turns back to the window as the dog dashes behind it. The lights are out in the detective's bedroom, and he pours himself a drink in the living room, looking down into the garden nonchalantly before stopping quickly. The cat turns back to the window, and the detective puts down his unfinished drink, goes to the door, turns off the light in the living room, and exits. He walks briskly down the corridor while the cat picks up the long-focus lens and trains it on the street intersection as the dog moves toward it. As the dog turns on the lights in the apartment, it's revealed it is wearing an extravagantly beautiful dress. The cat turns to face the room, talking as the dog animatedly moves, and the cat watches the dog pace with an oversized handbag prominently on the table. The camera closes in as the dog stops and faces the cat, then eases back as the dog comes over to it with sparkling eyes and tense concentration. The cat pulls the dog into its lap, and the dog puts its arms around the cat, appearing very happy as it kisses the cat's cheek. The cat moves back to look the dog in the eye, there's a pause, and the dog cuts the cat off with a series of kisses. The dog then gets up, laughs, goes to the handbag on the table, and returns to sit in the cat's lap, displaying the bag's contents. It is a Mark Cross ladies 'attache' case, opened to reveal a compact set of pajamas, slippers, toothbrush, toothpaste, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Thorwald completes his call and returns to the bedroom with a toolbox, which he slides under a pile of newspapers on the bed. Footsteps approach Jeff's apartment, and as he lowers his telescope lens, Lisa stands silhouetted in the doorway, black-lighted by the corridor lights. Jeff, with his back more toward the playground, is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him. The lights are out in Thorwald's bedroom, and he pours himself a drink in the kitchen, looking down into the parking lot nonchalantly before stopping quickly. Jeff turns back to the window, and Thorwald puts down his unfinished drink, goes to the door, turns off the light in the kitchen, and exits. He walks briskly down the corridor while Jeff picks up the long-focus lens and trains it on the bus stop as Lisa moves toward him. As Lisa turns on the lights in the apartment, it's revealed she is wearing an extravagantly beautiful gown. Jeff turns to face the room, talking as Lisa animatedly moves, and Jeff watches her pace with an oversized suitcase prominently on the table. The camera closes in as Lisa stops and faces Jeff, then eases back as she comes over to him with sparkling eyes and tense concentration. Jeff pulls her into his lap, and she puts her arms around him, appearing very happy as she kisses his cheek. Jeff moves back to look her in the eye, there's a pause, and she cuts him off with a series of kisses. Lisa then gets up, laughs, goes to the suitcase on the table, and returns to sit in Jeff's lap, displaying the suitcase's contents. It is a Mark Cross ladies 'attache' case, opened to reveal a compact set of nightgowns, slippers, hairbrush, shampoo, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Thorwald finishes his call and walks to the bedroom with a handbag, which he tosses beside a pile of coats on the bed. Footsteps depart from Jeff's apartment, and as he lifts his camera lens, Lisa appears silhouetted in the doorway, illuminated from behind by the corridor lights. Jeff, with his back more toward the neighborhood, is initially facing her but suddenly glances back to the window as Lisa shuffles behind him. The lights are out in Thorwald's bedroom, and he brews himself a cup of tea in the living room, glancing down into the garden absentmindedly before pausing suddenly. Jeff turns back to the window, and Thorwald sets down his unfinished tea, heads to the door, dims the light in the living room, and leaves. He strides briskly down the corridor while Jeff adjusts the long-focus lens and focuses it on the street intersection as Lisa inches toward him. As Lisa dims the lights in the apartment, it's revealed she is wearing an extraordinarily beautiful dress. Jeff turns to face the room, chatting as Lisa energetically gestures, and Jeff observes her pace with an oversized handbag prominently on the table. The camera zooms in as Lisa halts and faces Jeff, then zooms out as she approaches him with sparkling eyes and intense focus. Jeff lifts her into his lap, and she wraps her arms around him, appearing very cheerful as she pecks his cheek. Jeff leans back to gaze into her eyes, there's a pause, and she interrupts him with a series of kisses. Lisa then stands up, giggles, retrieves the handbag on the table, and returns to sit in Jeff's lap, exhibiting the bag's contents. It is a Mark Cross ladies 'attache' case, opened to display a neat set of pajamas, slippers, toothbrush, toothpaste, and other essentials for a cozy overnight stay."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Banana completes its call and returns to the pantry with a skateboard, which it slides under a pile of umbrellas on the couch. Raindrops approach the mountain, and as it lowers its microscope lens, Pizza stands silhouetted in the hatchway, black-lighted by the canyon flames. Mountain, with its back more toward the bakery, is initially turned toward it but abruptly turns back to the horizon as Pizza dashes behind it. The flames are out in Banana's pantry, and it pours itself a tea in the cabin, looking down into the pond nonchalantly before stopping quickly. Mountain turns back to the horizon, and Banana puts down its unfinished tea, goes to the gate, turns off the flame in the cabin, and exits. It walks briskly down the canyon while Mountain picks up the long-focus lens and trains it on the ocean intersection as Pizza moves toward it. As Pizza turns on the flames in the orchard, it's revealed it is wearing an extravagantly beautiful hat. Mountain turns to face the treehouse, talking as Pizza animatedly moves, and Mountain watches it pace with an oversized skateboard prominently on the chair. The microscope closes in as Pizza stops and faces Mountain, then eases back as it comes over to it with sparkling eyes and tense concentration. Mountain pulls it into its lap, and it puts its arms around it, appearing very happy as it kisses its elbow. Mountain moves back to look it in the eye, there's a pause, and it cuts it off with a series of kisses. Pizza then gets up, laughs, goes to the skateboard on the chair, and returns to sit in Mountain's lap, displaying the skateboard's contents. It is a Coconut Cross gentlemen's 'briefcase,' opened to reveal a compact set of scarves, boots, fork, spoon, and other necessities for a comfortable overnight stay."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gordon finalizes his text and ambles into the garage with an umbrella, which he tosses under a stack of newspapers on the counter. Shadows drift toward Alex's balcony, and as he raises his binoculars, Emily stands framed in the archway, highlighted by the streetlights. Alex, with his back more toward the skyline, is initially faced away from her but swiftly turns back to the night as Emily glides behind him. The lamps are off in Gordon's garage, and he pours himself a cup of coffee in the kitchen, gazing out into the driveway calmly before stopping suddenly. Alex turns back to the night, and Gordon sets down his unfinished coffee, heads to the gate, turns off the lamp in the kitchen, and leaves. He strides quickly down the driveway while Alex adjusts the night-vision goggles and focuses them on the avenue's crosswalk as Emily strolls toward him. As Emily switches on the lamps in the balcony, it's revealed she is wearing an extravagantly beautiful gown. Alex turns to face the hallway, chatting as Emily fervently dances, and Alex watches her sway with a gigantic umbrella prominently on the shelf. The binoculars zoom in as Emily pauses and faces Alex, then zooms out as she approaches him with twinkling eyes and intense focus. Alex lifts her into his arms, and she wraps her arms around him, appearing very cheerful as she kisses his forehead. Alex steps back to gaze at her, there's a moment, and she interrupts him with a few laughs. Emily then stands up, giggles, goes to the umbrella on the shelf, and returns to rest in Alex's arms, presenting the umbrella's handle. It is a sleek ladies' parasol, opened to reveal an elegant set of scarves, gloves, sunglasses, sunscreen, and other essentials for a luxurious afternoon outing."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Thorwald concludes his chat and heads back to the study with a briefcase, which he tucks under a stack of blankets on the couch. Footsteps can be heard approaching Jeff's door, and as he raises his binoculars, Lisa stands silhouetted in the doorway, backlit by the streetlights. Jeff, initially facing away from the plaza, is turned toward her but suddenly swivels back to the balcony as Lisa tiptoes behind him. The lights are off in Thorwald's study, and he munches on a snack in the kitchen, glancing up at the ceiling absentmindedly before stopping abruptly. Jeff swivels back to the balcony, and Thorwald drops his half-eaten snack, heads to the window, switches off the light in the kitchen, and departs. He strides swiftly down the hallway while Jeff grabs the wide-angle lens and focuses it on the park entrance as Lisa ambles toward him. As Lisa dims the lights in the apartment, it's revealed she is wearing an extravagantly casual outfit. Jeff pivots to face the room, speaking as Lisa animatedly gestures, and Jeff observes her stride with a massive suitcase prominently on the chair. The camera zooms in as Lisa stops and faces Jeff, then zooms out as she approaches him with twinkling eyes and intense curiosity. Jeff lifts her into his arms, and she wraps her arms around him, appearing very amused as she kisses his forehead. Jeff leans back to gaze into her eyes, there's a brief silence, and she interrupts him with a flurry of kisses. Lisa then stands up, giggles, goes to the suitcase on the chair, and returns to sit in Jeff's arms, displaying the case's contents. It is a Mark Cross travel case, opened to reveal an elegant selection of scarves, socks, hairbrush, lotions, and other items for a luxurious day trip."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Ludwig concludes his dance and wanders to the garage with a toolbox, which he rolls under a stack of books on the sofa. Thunder rumbles near Clara's kitchen, and as she raises her microscope, Emma lounges silhouetted in the archway, moonlit by the hallway bulbs. Clara, with her face more toward the park, is initially angled toward her but abruptly pivots back to the lake as Emma glides behind her. The candles are out in Ludwig's garage, and he brews himself a soup in the dining room, glancing up at the bookshelf unconcernedly before halting suddenly. Clara pivots back to the lake, and Ludwig sets down his unfinished soup, skips to the entrance, switches off the fan in the dining room, and enters. He skips swiftly through the hallway while Clara grabs the narrow-nosed microscope and focuses it on the garden path as Emma drifts toward her. As Emma switches on the fan in the kitchen, it's uncovered she is wearing a fantastically ornate cloak. Clara turns to gaze at the hallway, whispering as Emma energetically glides, and Clara observes her drift with an enormous toolbox prominently on the counter. The microscope zooms in as Emma halts and gazes at Clara, then drifts away as she approaches her with gleaming shoes and deep thought. Clara lifts her onto her shoulders, and she wraps her hands around her, looking very delighted as she hugs her shoulder. Clara shifts back to gaze her in the smile, there's a stillness, and she interrupts with a sequence of hugs. Emma then leaps up, giggles, shuffles to the toolbox on the counter, and skips back to perch on Clara's shoulders, revealing the box's belongings. It is a Zenith men's 'briefcase,' unlatched to display a lovely set of sweaters, sandals, hairbrush, shampoo, and various essentials for a pleasant holiday trip."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Thorwald ends his call, hides a handbag under coats on the bed, and exits. As Jeff lowers his camera, Lisa enters, silhouetted by corridor lights. Despite Jeff briefly turning toward her, his focus returns to Thorwald, who casually drinks in the darkened living room, then leaves. Lisa turns on the apartment lights, revealing an extravagant dress. As she moves energetically with a large handbag on the table, Jeff is captivated, and when she joins him, they share a happy, affectionate moment. Lisa laughs, retrieves the handbag, and shows Jeff its contents: a compact set of overnight necessities, indicating her intention to stay."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents there is a pause and she cuts him off with a series of kisses Jeff moves back to look her in the eye Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek Jeff then eases back as she comes over to him with sparkling eyes and tense concentration The camera closes in as Lisa stops and faces Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The camera closes in as Lisa stops and faces Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay there is a pause and she cuts him off with a series of kisses He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him Jeff then eases back as she comes over to him with sparkling eyes and tense concentration The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits Jeff moves back to look her in the eye Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The camera closes in as Lisa stops and faces Jeff then eases back as she comes over to him with sparkling eyes and tense concentration Jeff pulls her into his lap and she puts her arms around him appearing very happy as she kisses his cheek Jeff moves back to look her in the eye there is a pause and she cuts him off with a series of kisses Lisa then gets up laughs goes to the handbag on the table and returns to sit in Jeff's lap displaying the bag's contents It is a Mark Cross ladies 'attache' case opened to reveal a compact set of pajamas slippers toothbrush toothpaste and other necessities for a comfortable overnight stay Thorwald completes his call and returns to the bedroom with a handbag which he slides under a pile of coats on the bed Footsteps approach Jeff's apartment and as he lowers his camera lens Lisa stands silhouetted in the doorway blacklighted by the corridor lights Jeff with his back more toward the neighborhood is initially turned toward her but abruptly turns back to the window as Lisa dashes behind him The lights are out in Thorwald's bedroom and he pours himself a drink in the living room looking down into the garden nonchalantly before stopping quickly Jeff turns back to the window and Thorwald puts down his unfinished drink goes to the door turns off the light in the living room and exits He walks briskly down the corridor while Jeff picks up the longfocus lens and trains it on the street intersection as Lisa moves toward him As Lisa turns on the lights in the apartment it is revealed she is wearing an extravagantly beautiful dress Jeff turns to face the room talking as Lisa animatedly moves and Jeff watches her pace with an oversized handbag prominently on the table"
        }
      ]
    }
  ]
}