{
  "ground_truth": "Joe is behind his desk and looks at Vic, who swallows some Remy. Joe walks back around to his desk and sits in his chair. Vic gets out of his seat and hugs Eddie, who bobs his head up and down, while Mr. Blonde calmly sits down. Nice Guy Eddie is driving to the rendezvous, talking on his portable car phone. Mr. White, Mr. Pink, and Mr. Blonde surround a cop and proceed to beat him. The three men are disheveled, hair a mess, and shirttails out, as they have the cop tied to a chair and continue wailing on him. Eddie steps inside the warehouse, and when Nice Guy Eddie walks in, everybody jumps. Nice Guy sees Mr. Orange, and Mr. White crosses to Mr. Blonde. Eddie, Mr. White, and Mr. Pink walk out of the warehouse, talking amongst themselves. Mr. Blonde then slowly turns his head towards the cop, walks toward him, and slaps his face. He puts a piece of tape over the cop's mouth as the cop moves around wildly. Freddy finishes pretending to be unconscious, walks past the sheriffs to the sink, and looks down to watch Freddy washing his hands. Mr. Blonde walks away from the cop, opens a razor, turns on the radio, and sings along with Stealer's Wheel. He stares into the cop’s face, holding the razor and singing along, before lashing out like a cobra with a slash across the face, then cuts off the cop’s ear and holds it up for him to see. Mr. Blonde walks out of the warehouse, opens the trunk, and pulls out a large can of gasoline. He returns inside, pours gasoline all over the cop, who begs him not to, and lights a match. Mr. Orange, who was shot, looks at the kid's gashed face and the hole where his ear used to be, as Marvin starts to weep. We see Mr. Orange, known as Freddy Newendyke, wearing a high school letterman jacket, enter a coffee shop, spot Holdaway, and head his way, sliding into the booth with him. Holdaway listens to Freddy, looks at him for a moment, then smiles. Freddy paces back and forth, rehearsing an anecdote, reading from the page and sometimes stumbling over his words.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Joe is after his bureau and gazes at Vic, who gulps some Remy. Joe strides back around to his bureau and settles in his chair. Vic rises from his seat and embraces Eddie, who nods his head up and down, while Mr. Blonde serenely lowers himself. Nice Guy Eddie is steering to the meeting, chatting on his portable car phone. Mr. White, Mr. Pink, and Mr. Blonde encircle a cop and continue to strike him. The three men are rumpled, hair disarrayed, and shirttails out, as they have the cop secured to a chair and persist in thumping him. Eddie steps inside the storage, and when Nice Guy Eddie strides in, everybody leaps. Nice Guy notices Mr. Orange, and Mr. White traverses to Mr. Blonde. Eddie, Mr. White, and Mr. Pink depart the storage, conversing amongst themselves. Mr. Blonde then gradually swivels his head toward the cop, ambles toward him, and smacks his visage. He places a strip of tape over the cop's mouth as the cop thrashes around frantically. Freddy completes feigning to be insensible, strides past the sheriffs to the basin, and gazes down to observe Freddy cleansing his hands. Mr. Blonde strides away from the cop, unfolds a razor, switches on the radio, and croons along with Stealer's Wheel. He peers into the cop’s visage, grasping the razor and crooning along, before striking out like a cobra with a gash across the visage, then severs the cop’s ear and hoists it for him to see. Mr. Blonde strides out of the storage, opens the trunk, and extracts a sizable can of gasoline. He returns within, drenches gasoline all over the cop, who pleads him not to, and ignites a match. Mr. Orange, who was wounded, gazes at the kid's gaping face and the cavity where his ear utilized to be, as Marvin commences to sob. We observe Mr. Orange, recognized as Freddy Newendyke, sporting a high school letterman jacket, enter a café, notice Holdaway, and head his path, sliding into the booth with him. Holdaway attends to Freddy, gazes at him for a moment, then grins. Freddy paces back and forth, practicing an anecdote, perusing from the page and occasionally stumbling over his words."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Joe is behind his desk, and Vic, who swallows some Remy, is looked at by him. The desk is walked back around by Joe and his chair is sat in by him. Vic gets out of his seat and hugs Eddie, who bobs his head up and down, while Mr. Blonde calmly sits down. The rendezvous is being driven to by Nice Guy Eddie, who is talking on his portable car phone. Mr. White, Mr. Pink, and Mr. Blonde surround a cop and proceed to beat him. The three men are disheveled, hair a mess, and shirttails out, as they have tied the cop to a chair and continue wailing on him. The warehouse is stepped inside by Eddie, and when Nice Guy Eddie walks in, everybody jumps. Mr. Orange is seen by Nice Guy, and Mr. Blonde is crossed to by Mr. White. The warehouse is walked out of by Eddie, Mr. White, and Mr. Pink, who talk amongst themselves. Mr. Blonde then slowly turns his head towards the cop, walks toward him, and slaps his face. A piece of tape is put over the cop's mouth by him as the cop moves around wildly. Freddy finishes pretending to be unconscious, walks past the sheriffs to the sink, and looks down to watch Freddy washing his hands. The cop is walked away from by Mr. Blonde, who opens a razor, turns on the radio, and sings along with Stealer's Wheel. The cop’s face is stared into by him, holding the razor and singing along, before he lashes out like a cobra with a slash across the face, then cuts off the cop’s ear and holds it up for him to see. The warehouse is walked out of by Mr. Blonde, who opens the trunk and pulls out a large can of gasoline. He returns inside, pours gasoline all over the cop, who begs him not to, and lights a match. Mr. Orange, who was shot, looks at the kid's gashed face and the hole where his ear used to be, as Marvin starts to weep. Mr. Orange, known as Freddy Newendyke, is seen wearing a high school letterman jacket, entering a coffee shop, spotting Holdaway, and heading his way, sliding into the booth with him. Freddy is listened to by Holdaway, who looks at him for a moment, then smiles. Back and forth, Freddy paces, rehearsing an anecdote, reading from the page and sometimes stumbling over his words."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Joe sits at his desk, watching Vic drink Remy. Joe returns to his chair while Vic hugs Eddie, who nods, as Mr. Blonde sits calmly. Nice Guy Eddie drives to the rendezvous, talking on his car phone. Mr. White, Mr. Pink, and Mr. Blonde beat a cop tied to a chair, looking disheveled. Eddie enters the warehouse, causing a jump in everyone. He spots Mr. Orange while Mr. White moves towards Mr. Blonde. Eddie, Mr. White, and Mr. Pink exit, chatting. Mr. Blonde then approaches the cop, slaps him, tapes his mouth, and sings along to the radio while holding a razor. He slashes the cop's face and cuts off his ear, showing it to him. Mr. Blonde exits, retrieves gasoline, douses the cop, and lights a match, ignoring his pleas. Mr. Orange, shot and watching, sees the cop’s injuries. Mr. Orange, aka Freddy Newendyke, later enters a coffee shop, finds Holdaway, and joins him in a booth. Freddy rehearses an anecdote, pacing, reading, and occasionally stumbling over words."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Joe sits at his desk, watching Vic sip Remy, then returns to his chair. Vic hugs Eddie, who bobs his head, as Mr. Blonde sits calmly. Nice Guy Eddie drives to the rendezvous on his car phone. Mr. White, Mr. Pink, and Mr. Blonde beat a cop tied to a chair. Eddie enters the warehouse; everyone jumps. Nice Guy sees Mr. Orange, and Mr. White joins Mr. Blonde. Eddie, Mr. White, and Mr. Pink leave, talking. Mr. Blonde slaps the cop, tapes his mouth, then leaves, opening a razor, and sings with Stealer's Wheel while cutting the cop's face and ear. Mr. Blonde exits, retrieves gasoline, douses the cop, who pleads, then lights a match. Mr. Orange, shot, observes the cop's injuries. Freddy, as Mr. Orange, enters a coffee shop, meets Holdaway, and they smile. Freddy practices an anecdote, reading and stumbling over words."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Joe is positioned directly behind his desk, casting a thoughtful gaze towards Vic, who casually takes a sip of Remy to calm his nerves. With a sense of purpose, Joe walks around the perimeter of his desk, returning to his chair with deliberate movements. Meanwhile, Vic rises from his own seat, approaching Eddie to warmly embrace him. Eddie, in turn, acknowledges this gesture by nodding his head rhythmically up and down, a silent exchange of camaraderie, as Mr. Blonde, appearing composed and relaxed, sits down again with an air of ease. \n\nNice Guy Eddie is in motion, on his way to the agreed meeting point, speaking animatedly on his portable car phone, handling multitasking with practiced ease. Inside the warehouse, Mr. White, Mr. Pink, and Mr. Blonde focus their attention on a police officer whom they have surrounded. They proceed to subject him to a brutal beating. The three men bear the marks of their exertions, looking disheveled, with their hair tousled and shirttails hanging untidily, as they continue their assault on the cop, who is securely bound to a chair.\n\nAs Eddie steps inside the expansive warehouse, his arrival triggers a collective startle among the others present, causing everyone to jump slightly. When Nice Guy Eddie enters the space, his eyes catch sight of Mr. Orange, prompting Mr. White to make a move, crossing over to where Mr. Blonde is positioned. The sequence continues as Eddie, Mr. White, and Mr. Pink make their way out of the warehouse, engaged in a conversation amongst themselves, voices overlapping with casual banter. \n\nWith a deliberate slowness, Mr. Blonde turns his gaze towards the restrained cop, rises to his feet, and strides purposefully toward him. Without pause, he slaps the cop's face, a harsh reminder of his dominance. In a swift motion, he applies a piece of tape securely over the cop’s mouth, despite the cop’s frantic, struggling movements. Meanwhile, Freddy brings the act of feigning unconsciousness to an end. He maneuvers past the sheriffs to arrive at the sink, where he stands, looking downward, watching the water flow over his hands as he washes them, blotting out the scene with routine actions.\n\nMr. Blonde, maintaining his air of menace, steps away from the cop, brandishing a razor he has just opened. He switches on the radio, allowing the music of Stealer’s Wheel to fill the space, singing along nonchalantly. His gaze locks onto the cop’s face, holding the razor with an unsettling ease, continuing his musical accompaniment before he suddenly strikes with the precision and speed of a striking cobra, inflicting a slashing wound across the cop’s face. In a grim spectacle, he proceeds to sever the cop’s ear, holding it up for the cop to see, a macabre show of power.\n\nExiting the warehouse briefly, Mr. Blonde makes his way to the trunk of a car, retrieving a substantial can of gasoline. He reenters the warehouse with a grim determination, dousing the cop with gasoline, despite the cop’s desperate pleas for mercy. Calmly, he ignites a match with a flick, echoing impending doom. Mr. Orange, who has sustained a gunshot injury, watches with horror as he observes the young man's mutilated face and the gaping void where his ear once was, while Marvin, overwhelmed by the scene, begins to weep. \n\nFreddy Newendyke, known also as Mr. Orange, clad in a high school letterman jacket, makes his way into a coffee shop, catching sight of Holdaway and heading directly towards him, sliding effortlessly into the booth opposite. Holdaway listens attentively to Freddy’s words, pausing momentarily to regard him with a thoughtful look before breaking into a knowing smile. In a moment of introspection, Freddy paces back and forth, rehearsing an anecdote with determination, reading from the page, occasionally stumbling over his own words as he strives to perfect the retelling of his story."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Joe finds himself positioned directly behind his large, imposing desk, casting a thoughtful and attentive gaze in the direction of Vic. Vic, in a bid to calm his frazzled nerves, takes a casual sip of Remy, savoring the taste. With a sense of purpose and determination, Joe moves with deliberation around the perimeter of his desk, eventually returning to his chair with careful, deliberate movements. Meanwhile, Vic, feeling the urge to connect, rises from his own seat, stepping forward to approach Eddie, and warmly embraces him. Eddie, in turn, acknowledges this gesture with a nod of his head, rhythmically moving up and down—a silent but heartfelt exchange of camaraderie. Mr. Blonde, appearing composed and at ease, sits down again with an air of relaxation.\n\nNice Guy Eddie is on the move, making his way to the agreed meeting point while speaking animatedly on his portable car phone, multitasking with the practiced ease of someone used to balancing multiple tasks. Inside the cavernous warehouse, Mr. White, Mr. Pink, and Mr. Blonde are intently focused on the police officer whom they have surrounded. They proceed with their actions, subjecting him to a brutal and relentless beating. The three men show visible signs of their exertions, looking thoroughly disheveled, with their hair in disarray and shirttails hanging messily and untidily, as they continue their assault on the cop, who remains securely bound to a chair.\n\nWhen Eddie steps inside the expansive confines of the warehouse, his arrival triggers a collective startle among everyone present, causing each of them to jump slightly in response. As Nice Guy Eddie walks into the space, his sharp eyes catch sight of Mr. Orange, prompting Mr. White to make a decisive move, crossing over to where Mr. Blonde is located. The sequence continues as Eddie, Mr. White, and Mr. Pink make their way out of the warehouse, engaging in an ongoing conversation amongst themselves, their voices overlapping with ease and the familiarity of casual banter.\n\nWith a deliberate slowness and an air of menace, Mr. Blonde turns his gaze towards the cop, who remains restrained. Rising to his feet, Mr. Blonde strides purposefully towards the cop, and without pause, he delivers a sharp slap to the cop's face—a harsh reminder of his dominance and control. In one swift motion, he applies a piece of tape securely over the cop's mouth, ignoring the cop’s frantic and struggling movements. Meanwhile, Freddy decides the time has come to end his act of feigning unconsciousness. He maneuvers past the sheriffs, making his way to the sink, where he stands gazing downward, watching the water flow over his hands as he washes them clean, routine actions serving to blot out the grim scene.\n\nMr. Blonde, maintaining his air of menace, steps away from the cop, brandishing a razor that he has just opened. He switches on the radio, allowing the music of Stealer’s Wheel to fill the space and begins singing along nonchalantly. His gaze is locked onto the cop’s face, and he holds the razor with an unsettling ease, continuing his musical accompaniment before he suddenly strikes with speed and precision akin to that of a striking cobra, inflicting a slashing wound across the cop’s face. In a grim and horrifying spectacle, he proceeds to sever the cop’s ear, holding it up for the cop to see, a macabre show of power and dominance.\n\nExiting the warehouse briefly, Mr. Blonde makes his way purposefully to the trunk of a car, retrieving a substantial can of gasoline. With grim determination, he reenters the warehouse, dousing the cop with gasoline, despite the cop's desperate pleas for mercy, which echo helplessly in the space. Calmly and with a sense of impending doom, he ignites a match with a flick. Mr. Orange, who has sustained a gunshot injury, watches with horror, observing the young man's mutilated face and the gaping void where his ear once was. Overwhelmed by the harrowing scene, Marvin begins to weep.\n\nFreddy Newendyke, known also as Mr. Orange and clad in a high school letterman jacket, makes his way into a coffee shop. As he enters, he catches sight of Holdaway and heads directly towards him, sliding effortlessly into the booth opposite. Holdaway listens attentively to Freddy's words, pausing momentarily to regard him with a thoughtful look before breaking into a knowing smile. In a moment of introspection, Freddy paces back and forth, rehearsing an anecdote with determination. He reads from the page, occasionally stumbling over his own words as he strives to perfect the retelling of his story, determined to get every detail right."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Joe, stationed behind his desk, directs his gaze toward Vic, who is in the process of swallowing some Remy, feeling the liquid glide down his throat. Joe then makes his way around the desk, each step deliberate before settling into his chair, feeling the familiar contours against his back. Meanwhile, Vic stands from his seat, extending his arms to envelop Eddie in a warm hug, during which Eddie responds with an enthusiastic nodding of his head up and down. As this unfolds, Mr. Blonde remains seated, exhibiting a composed demeanor. Nice Guy Eddie maneuvers the car to the rendezvous point, maintaining a conversation via his portable car phone, his attention split between the road and the conversation. In the warehouse, Mr. White, Mr. Pink, and Mr. Blonde have a cop restrained to a chair and collectively decide to beat him; their disheveled appearances tell of previous chaos, with unkempt hair and shirttails hanging out as indicators of their disarray. Eddie makes his entrance into the warehouse, and the moment Nice Guy Eddie steps inside, the atmosphere shifts as everyone inside reacts with a jump. Upon spotting Mr. Orange, Nice Guy Eddie’s attention shifts while Mr. White makes his way over to Mr. Blonde. Following this, Eddie, Mr. White, and Mr. Pink exit the warehouse, engaged in a conversation amongst themselves. After their exit, Mr. Blonde turns his head gradually toward the cop, approaches with intentional strides, and delivers a sharp slap to his face. He then proceeds to place a piece of tape securely over the cop's mouth, subduing his frantic movements. In another scene, Freddy finishes his act of feigned unconsciousness and proceeds past uniformed sheriffs towards the sink, where he takes a moment to observe himself washing his hands, the sensation of water and soap against his skin grounding him. Mr. Blonde shifts his focus away from the cop, methodically opens a razor, and flicks on the radio. He begins to sing along with Stealer's Wheel, letting the music accompany his menacing gaze into the cop’s face before unleashing a sudden, precise slash across it with the razor; he subsequently severs the cop’s ear and holds it up to ensure the cop sees his mutilation. Exiting the warehouse once again, Mr. Blonde opens the trunk to retrieve a large gasoline can, feeling its weight in his grip as he re-enters the building. He douses the cop with gasoline, despite the cop's desperate pleas, and ultimately strikes a match to ignite it. Mr. Orange, wounded and bleeding, takes in the sight of the kid's ravaged face and the vacant spot where his ear once was, while Marvin begins to sob. The narrative shifts to show Mr. Orange, known outside this situation as Freddy Newendyke, wearing a high school letterman jacket and entering a coffee shop. He scans the room, finds Holdaway, and makes his way over to slide into a booth across from him. Holdaway attentively listens to Freddy, taking a moment to absorb what he hears before breaking into a smile. Freddy, in preparation, paces back and forth, internally reciting an anecdote, occasionally stumbling over his words as he reads from the page, rehearsing with an earnest determination."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Joe observes Vic taking a sip of Remy, then returns to his desk and sits down. Vic gets up to hug Eddie, while Mr. Blonde remains seated. Nice Guy Eddie drives to the rendezvous, conversing on his car phone. Meanwhile, Mr. White, Mr. Pink, and Mr. Blonde, disheveled and untidy, beat a cop tied to a chair. When Eddie enters the warehouse, everyone reacts with surprise. Eddie notices Mr. Orange, while Mr. White approaches Mr. Blonde. Eddie, Mr. White, and Mr. Pink leave the warehouse, engaged in conversation. Mr. Blonde approaches the cop, slaps him, and tapes his mouth shut as the cop struggles. Freddy stops pretending to be unconscious, moves past the sheriffs, and watches himself wash his hands at the sink. Mr. Blonde opens a razor, turns on the radio, and sings along while menacingly facing the cop, eventually slashing his face and cutting off his ear. He exits the warehouse, retrieves a gasoline can from the trunk, returns, douses the cop in gasoline, and lights a match. Mr. Orange, injured, observes the cop's mutilated face as Marvin weeps. In a flashback, Mr. Orange, known as Freddy Newendyke, in a letterman jacket, enters a coffee shop, joins Holdaway in a booth, and after some conversation, paces while rehearsing an anecdote, occasionally stumbling over his words."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Joe is behind his desk in the dimly lit back office of a warehouse known for clandestine meetings and looks at Vic, who swallows some Remy, a luxurious cognac renowned for its smooth flavor and prestige among connoisseurs. Joe walks back around to his desk, part of a mismatched set of second-hand furniture in the office, and sits in his chair. Vic, feeling the warmth from the Remy, gets out of his seat and hugs Eddie, who bobs his head up and down to the rhythm of an unseen beat echoing in his mind, while Mr. Blonde calmly sits down, his demeanor as cold and calculating as ever. Nice Guy Eddie is driving to the rendezvous, navigating the busy Los Angeles streets with ease, while talking on his portable car phone, a clunky device symbolizing his status and constant need for communication. Mr. White, Mr. Pink, and Mr. Blonde surround a cop, whom they have kidnapped following a heist gone wrong, and proceed to beat him. The three men are disheveled, hair a mess from their earlier scuffle, and shirttails out, reflecting the chaos of their failed heist, as they have the cop tied to a chair and continue wailing on him. Eddie steps inside the warehouse, a space cluttered with evidence of their crimes, and when Nice Guy Eddie walks in, carrying an air of authority, everybody jumps. Nice Guy sees Mr. Orange, lying in a pool of his blood, and Mr. White, ever loyal to his partners, crosses to Mr. Blonde. Eddie, Mr. White, and Mr. Pink walk out of the warehouse, talking amongst themselves about their next move in the criminal underworld. Mr. Blonde then slowly turns his head towards the cop, walks toward him, and slaps his face, relishing in the control he has over the helpless man. He puts a piece of tape over the cop's mouth, stifling any cries for help as the cop moves around wildly. Freddy finishes pretending to be unconscious, a skill honed from years of undercover work, walks past the sheriffs stationed outside the door as reassurance, to the sink, and looks down to watch Freddy washing his hands of metaphorical and literal blood. Mr. Blonde walks away from the cop, opens a razor, a weapon he carries for intimidation and torture, turns on the radio, and sings along with Stealer's Wheel's hit song \"Stuck in the Middle with You,\" known for its upbeat tune despite his sinister actions. He stares into the cop’s face, holding the razor and singing along, before lashing out like a cobra, evoking a predatory precision and swiftness, with a slash across the face, then cuts off the cop’s ear and holds it up for him to see, a grotesque trophy of his dominance. Mr. Blonde walks out of the warehouse, opens the trunk of his car, an inconspicuous sedan parked strategically away from prying eyes, and pulls out a large can of gasoline, preparing for a fiery finale. He returns inside, pours gasoline all over the cop, who begs him not to in a voice cracked with terror, and lights a match, igniting both the room and the tension. Mr. Orange, who was shot during the botched robbery, looks at the kid's gashed face and the hole where his ear used to be, as Marvin starts to weep, overwhelmed by the brutality of his captors. We see Mr. Orange, known as Freddy Newendyke, wearing a high school letterman jacket reminiscent of simpler times, enter a coffee shop popular among law enforcement for off-duty meetings, spot Holdaway, his mentor in the force, and head his way, sliding into the booth with him. Holdaway listens to Freddy, who is visibly anxious about his undercover role, looks at him for a moment, then smiles, offering reassurance and camaraderie. Freddy paces back and forth in his modest apartment, rehearsing an anecdote about a fictional drug deal to solidify his cover story, reading from the page and sometimes stumbling over his words as he perfects the performance that could mean life or death."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him Joe is behind his desk and looks at Vic who swallows some Remy Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves Joe walks back around to his desk and sits in his chair Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down Nice Guy Eddie is driving to the rendezvous talking on his portable car phone Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face Joe walks back around to his desk and sits in his chair He puts a piece of tape over the cop's mouth as the cop moves around wildly Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands He puts a piece of tape over the cop's mouth as the cop moves around wildly Joe is behind his desk and looks at Vic who swallows some Remy Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline He returns inside pours gasoline all over the cop who begs him not to and lights a match Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep Nice Guy Eddie is driving to the rendezvous talking on his portable car phone We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him Holdaway listens to Freddy looks at him for a moment then smiles Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Joe is behind his desk and looks at Vic who swallows some Remy. Joe walks back around to his desk and sits in his chair. Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down. Nice Guy Eddie is driving to the rendezvous talking on his portable car phone. Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him. The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him. Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps. Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde. Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves. Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. He puts a piece of tape over the cop's mouth as the cop moves around wildly. Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands. Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel. He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see. Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline. He returns inside pours gasoline all over the cop who begs him not to and lights a match. Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep. We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him. Holdaway listens to. Freddy looks at him for a moment then smiles. Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Joe is behind his desk and looks at Vic who swallows some Remy. Joe walks back around to his desk and sits in his chair. Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down. Nice Guy Eddie is driving to the rendezvous talking on his portable car phone. Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him. The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him. Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps. Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde. Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves. Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He puts a piece of tape over the cop's mouth as the cop moves around wildly. Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands. Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel. He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see. Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline. He returns inside pours gasoline all over the cop who begs him not to and lights a match. Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep. We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him. Holdaway listens to. Freddy looks at him for a moment then smiles. Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Joe is behind his desk and looks at Vic who swallows some Remy. Joe walks back around to his desk and sits in his chair. Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down. Nice Guy Eddie is driving to the rendezvous talking on his portable car phone. Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him. He returns inside pours gasoline all over the cop who begs him not to and lights a match. Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep. We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him. Holdaway listens to. Freddy looks at him for a moment then smiles. Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Joe is behind his desk and looks at Vic who swallows some Remy. Joe walks back around to his desk and sits in his chair. Holdaway listens to. Freddy looks at him for a moment then smiles. Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Meredith is behind her desk and looks at Al, who swallows some Remy. Meredith walks back around to her desk and sits in her chair. Al gets out of his seat and hugs Claire, who bobs her head up and down, while Dr. Green calmly sits down. Cool Guy Frank is driving to the rendezvous, talking on his portable car phone. Dr. Black, Dr. Blue, and Dr. Green surround a musician and proceed to beat him. The three women are disheveled, hair a mess, and shirttails out, as they have the musician tied to a chair and continue wailing on him. Frank steps inside the warehouse, and when Cool Guy Frank walks in, everybody jumps. Cool Guy sees Dr. Orange, and Dr. Black crosses to Dr. Green. Frank, Dr. Black, and Dr. Blue walk out of the warehouse, talking amongst themselves. Dr. Green then slowly turns her head towards the musician, walks toward him, and slaps his face. She puts a piece of tape over the musician’s mouth as the musician moves around wildly. Nick finishes pretending to be unconscious, walks past the sheriffs to the sink, and looks down to watch Nick washing his hands. Dr. Green walks away from the musician, opens a razor, turns on the radio, and sings along with Stealer’s Wheel. She stares into the musician’s face, holding the razor and singing along, before lashing out like a cobra with a slash across the face, then cuts off the musician’s ear and holds it up for him to see. Dr. Green walks out of the warehouse, opens the trunk, and pulls out a large can of gasoline. She returns inside, pours gasoline all over the musician, who begs her not to, and lights a match. Dr. Orange, who was shot, looks at the kid’s gashed face and the hole where his ear used to be, as Sarah starts to weep. We see Dr. Orange, known as Nick Newendyke, wearing a high school letterman jacket, enter a coffee shop, spot Johnson, and head his way, sliding into the booth with her. Johnson listens to Nick, looks at him for a moment, then smiles. Nick paces back and forth, rehearsing an anecdote, reading from the page and sometimes stumbling over his words."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Joe is behind his counter and looks at Vic, who swallows some Gatorade. Joe walks back around to his countertop and sits in his recliner. Vic gets out of his bench and hugs Eddie, who nods his head up and down, while Mr. Blonde calmly sits down. Nice Guy Eddie is driving to the park, talking on his portable cell phone. Mr. White, Mr. Pink, and Mr. Blonde surround a mannequin and proceed to beat him. The three men are disheveled, hair a mess, and shoelaces untied, as they have the mannequin tied to a table and continue wailing on him. Eddie steps inside the garage, and when Nice Guy Eddie walks in, everybody jumps. Nice Guy sees Mr. Orange, and Mr. White crosses to Mr. Blonde. Eddie, Mr. White, and Mr. Pink walk out of the garage, talking amongst themselves. Mr. Blonde then slowly turns his head towards the mannequin, walks toward him, and slaps his face. He puts a bandana over the mannequin's mouth as the mannequin moves around wildly. Freddy finishes pretending to be unconscious, walks past the lifeguards to the refrigerator, and looks down to watch Freddy washing his hands. Mr. Blonde walks away from the mannequin, opens a letter opener, turns on the television, and sings along with Stealer's Wheel. He stares into the mannequin’s face, holding the letter opener and singing along, before lashing out like a cobra with a slash across the face, then cuts off the mannequin’s hand and holds it up for him to see. Mr. Blonde walks out of the garage, opens the trunk, and pulls out a large can of bleach. He returns inside, pours bleach all over the mannequin, who begs him not to, and lights a candle. Mr. Orange, who was shot, looks at the kid's bruised face and the hole where his hand used to be, as Marvin starts to weep. We see Mr. Orange, known as Freddy Newendyke, wearing a collegiate sweatshirt, enter a diner, spot Holdaway, and head his way, sliding into the booth with him. Holdaway listens to Freddy, looks at him for a moment, then grins. Freddy paces back and forth, rehearsing an anecdote, reading from the tablet and sometimes stumbling over his words."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Joe is behind his desk and listens to Vic, who sips some Remy. Joe struts back around to his desk and leans against his chair. Vic hops out of his seat and pats Eddie, who nods his head side to side, while Mr. Blonde quietly reclines. Nice Guy Eddie is jogging to the rendezvous, chatting on his portable car phone. Mr. White, Mr. Pink, and Mr. Blonde circle around a cop and proceed to tickle him. The three men are disheveled, hair a mess, and shirttails out, as they have the cop tied to a chair and continue giggling at him. Eddie pauses inside the warehouse, and when Nice Guy Eddie skips in, everybody yawns. Nice Guy sees Mr. Orange, and Mr. White dances to Mr. Blonde. Eddie, Mr. White, and Mr. Pink jog out of the warehouse, whispering amongst themselves. Mr. Blonde then quickly raises his head towards the cop, strolls toward him, and taps his shoulder. He places a piece of tape over the cop's mouth as the cop squirms around meekly. Freddy finishes faking to be unconscious, saunters past the sheriffs to the sink, and glances down to notice Freddy washing his hands. Mr. Blonde leapfrogs away from the cop, closes a razor, switches on the radio, and hums along with Stealer's Wheel. He glares into the cop’s face, clutching the razor and humming along, before striking like a mongoose with a pat on the face, then tickles the cop’s ear and holds it up for him to hear. Mr. Blonde scurries out of the warehouse, shuts the trunk, and tugs out a large kite. He waltzes inside, sprinkles confetti all over the cop, who cheers him on, and flicks a feather. Mr. Orange, who was shot, glances at the kid's smiling face and the spot where his ear used to be, as Marvin starts to laugh. We see Mr. Orange, known as Freddy Newendyke, wearing a high school letterman jacket, enter a coffee shop, spot Holdaway, and waltz his way, sliding into the booth with him. Holdaway observes Freddy, nods at him for a moment, then laughs. Freddy skips back and forth, crafting an anecdote, reading from the page and sometimes humming over his words."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp is behind its bookshelf and looks at the umbrella, which swallows some lemonade. The lamp walks back around to its bookshelf and sits in its hammock. The umbrella gets out of its basket and hugs the toaster, which bobs its hat up and down, while the door calmly sits down. The bicycle is driving to the orchestra, talking on its portable shoe phone. The cat, the cup, and the door surround a balloon and proceed to decorate it. The three clouds are disheveled, feathers a mess, and socks out, as they have the balloon tied to a shovel and continue painting on it. The bicycle steps inside the garage, and when the bicycle walks in, everybody jumps. The bicycle sees the hallway, and the cat crosses to the door. The bicycle, the cat, and the cup walk out of the garage, talking amongst themselves. The door then slowly turns its hat towards the balloon, walks toward it, and tickles its nose. It puts a piece of paper over the balloon's mouth as the balloon moves around wildly. The platypus finishes pretending to be unconscious, walks past the giraffes to the aquarium, and looks down to watch the platypus washing its fins. The door walks away from the balloon, opens a notebook, turns on the television, and sings along with The Merry Bandits. It stares into the balloon’s smile, holding the notebook and singing along, before lashing out like a swallow with a brush across the nose, then cuts off the balloon’s string and holds it up for it to see. The door walks out of the garage, opens the cabinet, and pulls out a large can of paint. It returns inside, pours paint all over the balloon, which begs it not to, and strikes a match. The hallway, who was shot, looks at the dog's painted paw and the hole where its string used to be, as the trumpet starts to weep. We see the hallway, known as the platypus, wearing a high school feather boa, enter a bakery, spot the window, and head its way, sliding into the hammock with it. The window listens to the platypus, looks at it for a moment, then smiles. The platypus paces back and forth, rehearsing a riddle, reading from the leaf and sometimes stumbling over its tunes."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam is behind his podium and stares at Ron, who guzzles some orange juice. Sam paces around to his podium and reclines in his recliner. Ron leaps out of his sofa and pats Alex, who nods his head repeatedly, while Mr. Blue casually reclines. Friendly Dan is cycling to the library, chatting on his handheld radio. Mr. Black, Mr. Green, and Mr. Blue gather around a postman and proceed to taunt him. The three sailors are dusty, hats askew, and shoelaces trailing, as they have the postman secured to a pole and continue jeering at him. Dan strides into the factory, and when Friendly Dan arrives, everyone gasps. Friendly Dan notices Mr. Purple, and Mr. Black approaches Mr. Blue. Dan, Mr. Black, and Mr. Green stroll out of the factory, conversing amongst themselves. Mr. Blue then gradually turns his gaze towards the postman, marches toward him, and flicks his nose. He places a bandana over the postman’s mouth as the postman squirms frantically. Larry concludes simulating sleep, strides past the lifeguards to the basin, and glances down to observe Larry brushing his teeth. Mr. Blue wanders away from the postman, unfolds a map, activates the jukebox, and hums along with Earth, Wind & Fire. He glares into the postman’s face, wielding the map and humming along, before darting like a cheetah with a swipe across the nose, then snaps off the postman’s button and tosses it up for him to witness. Mr. Blue exits the factory, unlatches the car door, and lifts out a hefty sack of rice. He reenters, sprinkles rice all over the postman, who pleads with him to stop, and strikes a match. Mr. Purple, who was injured, glances at the child's bruised arm and the gap where his button used to be, as Logan begins to sob. Witnessing Mr. Purple, known as Larry Boston, wearing a college letterman sweater, enter a bakery, spot Jackson, and make his way over, sliding into the bench with him. Jackson listens to Larry, peers at him briefly, then grins. Larry strides back and forth, rehearsing a tale, reading from the script and occasionally stuttering over his phrases."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Joe is behind his counter and peers at Vic, who gulps some apple juice. Joe dances back around to his counter and lounges in his hammock. Vic leaps out of his bench and shakes Eddie, who wags his tail side to side, while Mr. Blonde quietly stretches out. Nice Guy Eddie is flying to the meetup spot, singing on his handheld megaphone. Mr. White, Mr. Pink, and Mr. Blonde corner a clown and proceed to serenade him. The three men are bedraggled, hair a wreck, and trousers untucked, as they have the clown fastened to a stool and continue crooning to him. Eddie skips inside the barn, and when Nice Guy Eddie strides in, everybody freezes. Nice Guy notices Mr. Orange, and Mr. White dances over to Mr. Blonde. Eddie, Mr. White, and Mr. Pink traipse out of the barn, mumbling amongst themselves. Mr. Blonde then slowly nods his head toward the clown, gallops over to him, and tickles his nose. He places a feather over the clown's eyes as the clown jiggles around playfully. Freddy finishes pretending to nap, parades past the sheriffs to the mirror, and glances down to watch Freddy buffing his nails. Mr. Blonde prances away from the clown, opens a banana, turns on the blender, and hums along with Stealer's Wheel. He gazes into the clown’s eyes, clutching the banana and humming along, before striking swiftly like a falcon with a swoop across the face, then plucks off the clown’s wig and flaunts it. Mr. Blonde skips out of the barn, opens the door, and pulls out a giant jug of lemonade. He returns inside, splashes lemonade all over the clown, who jokes with him not to, and flicks a light switch. Mr. Orange, who was kissed, stares at the dog's scratched face and the spot where his collar used to be, as Marvin starts to laugh. We see Mr. Orange, known as Freddy Newendyke, wearing a college hoodie, stroll into a bakery, spot Holdaway, and float his way, sliding into the booth with him. Holdaway listens to Freddy, glances at him briefly, then chuckles. Freddy strides back and forth, practicing a song, reading from the screen and occasionally tripping over his lyrics."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sam lounges behind the counter and gazes at Lee, who munches on some blueberries. Sam strolls back around to the counter and flops onto the couch. Lee climbs out of the hammock and high-fives Alex, who nods rhythmically, while Mr. Green leisurely reclines. Kind Fellow Alex is cycling to the carnival, chatting on his handheld radio. Mr. Brown, Mr. Gray, and Mr. Green encircle a sailor and proceed to quiz him. The trio are unkempt, hair tousled, and shoelaces undone, as they have the sailor strapped to a stool and keep grilling him. Alex strides into the barn, and when Kind Fellow Alex arrives, everyone freezes. Kind Fellow spies Mr. Lavender, and Mr. Brown ambles over to Mr. Green. Alex, Mr. Brown, and Mr. Gray wander out of the barn, chatting amongst themselves. Mr. Green then lethargically swivels his head towards the sailor, strolls up to him, and pats his shoulder. He sticks a bandage over the sailor's mouth as the sailor squirms frantically. Bobby concludes faking unconsciousness, saunters past the cowboys to the basin, and peers down to observe Bobby brushing his teeth. Mr. Green ambles away from the sailor, unfolds a fan, turns on the stereo, and hums along with The Beatles. He peers intently into the sailor's face, clutching the fan and humming along, before darting like a hummingbird with a slash across the cheek, then clips off the sailor’s nose and holds it up for him to observe. Mr. Green ambles out of the barn, unlatches the chest, and extracts a hefty crate of cookies. He reenters, scatters cookies all over the sailor, who pleads with him not to, and strikes a flint. Mr. Lavender, who was startled, glances at the dancer's painted face and the gap where his nose used to be, as Chris starts to chuckle. We witness Mr. Lavender, known as Bobby Oakridge, donning a varsity sweater, enter a bistro, notice Carter, and make his way over, sliding into the booth with him. Carter hears Bobby out, glances at him briefly, then grins. Bobby roams back and forth, practicing a riddle, consulting the map and occasionally tripping over his phrases."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joe sits behind his desk, observing as Vic takes a sip of Remy. Vic then hugs Eddie, while Mr. Blonde sits calmly. Nice Guy Eddie drives to the rendezvous and converses on a car phone. In a warehouse, Mr. White, Mr. Pink, and Mr. Blonde brutally beat a cop tied to a chair. Disheveled, the trio reacts when Eddie enters the warehouse. Mr. Blonde slaps the cop and tapes his mouth shut. Freddy, pretending to be unconscious, washes his hands. Mr. Blonde menacingly sings along with the radio, slashing the cop's face with a razor and severing his ear. Mr. Blonde fetches gasoline from the car, douses the cop, and lights a match. Observing the injured cop, Mr. Orange, who is actually undercover officer Freddy Newendyke, recalls meeting with Holdaway in a coffee shop. Freddy rehearses an anecdote, occasionally stumbling over his lines."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words Freddy looks at him for a moment then smiles Holdaway listens to We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep He returns inside pours gasoline all over the cop who begs him not to and lights a match Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands He puts a piece of tape over the cop's mouth as the cop moves around wildly Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him Nice Guy Eddie is driving to the rendezvous talking on his portable car phone Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down Joe walks back around to his desk and sits in his chair Joe is behind his desk and looks at Vic who swallows some Remy"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Freddy looks at him for a moment then smiles The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see He returns inside pours gasoline all over the cop who begs him not to and lights a match Holdaway listens to Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him He puts a piece of tape over the cop's mouth as the cop moves around wildly Joe walks back around to his desk and sits in his chair Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves Joe is behind his desk and looks at Vic who swallows some Remy Nice Guy Eddie is driving to the rendezvous talking on his portable car phone Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Freddy finishes pretending to be unconscious walks past the sheriffs to the sink and looks down to watch Freddy washing his hands Mr Blonde walks away from the cop opens a razor turns on the radio and sings along with Stealer's Wheel He stares into the cop’s face holding the razor and singing along before lashing out like a cobra with a slash across the face then cuts off the cop’s ear and holds it up for him to see Mr Blonde walks out of the warehouse opens the trunk and pulls out a large can of gasoline He returns inside pours gasoline all over the cop who begs him not to and lights a match Mr Orange who was shot looks at the kid's gashed face and the hole where his ear used to be as Marvin starts to weep We see Mr Orange known as Freddy Newendyke wearing a high school letterman jacket enter a coffee shop spot Holdaway and head his way sliding into the booth with him Holdaway listens to Freddy looks at him for a moment then smiles Freddy paces back and forth rehearsing an anecdote reading from the page and sometimes stumbling over his words Joe is behind his desk and looks at Vic who swallows some Remy Joe walks back around to his desk and sits in his chair Vic gets out of his seat and hugs Eddie who bobs his head up and down while Mr Blonde calmly sits down Nice Guy Eddie is driving to the rendezvous talking on his portable car phone Mr White Mr Pink and Mr Blonde surround a cop and proceed to beat him The three men are disheveled hair a mess and shirttails out as they have the cop tied to a chair and continue wailing on him Eddie steps inside the warehouse and when Nice Guy Eddie walks in everybody jumps Nice Guy sees Mr Orange and Mr White crosses to Mr Blonde Eddie Mr White and Mr Pink walk out of the warehouse talking amongst themselves Mr Blonde then slowly turns his head towards the cop walks toward him and slaps his face He puts a piece of tape over the cop's mouth as the cop moves around wildly"
        }
      ]
    }
  ]
}