{
  "ground_truth": "Freddy enters the frame from the same direction he exited in the previous scene, finishing his sentence, and in a wider shot, he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth. Freddy, Joe, Nice Guy Eddie, and Mr. White sit around a table in a red-lit, smokey bar. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd, with all eyes on him. Everyone is frozen, resulting in a freeze frame of Freddy in front of the sheriffs. A slow 360-degree shot is taken around Freddy in the men's room, followed by a 360-degree camera move around the men. The dog barks, and a sheriff yells at it to quiet down. A couple of sheriffs look at Freddy off-screen, but turn their attention to Sheriff #2 as he continues his story. The camera pans from the sheriffs to Freddy, who is up against the urinal, pretending to urinate, and then continues to pan with him. A sheriff is sitting on a sink, and Freddy finishes washing his hands, goes to dry them but there are only hand drying machines. He turns one on, and a close-up shows his hands being blown dry. Mr. Orange looks from left to right. The machine turns off, Freddy turns, and walks out of the room. Joe lights a cigar, and Freddy answers it, with the camera following the receiver up to his face. A close-up shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle. The camera follows Freddy as he hops around the apartment, getting everything he needs, puts on his jacket, and exits frame. Inside an unmarked car across the street, two cops see Freddy walk out of his building and up to Eddie's parked car. Freddy gets into the car driven by Nice Guy Eddie, with Mr. Pink in the passenger seat, and they pull into traffic as the car laughs, reacts horribly, and laughs again. The camera tracks across the men's faces, Joe points a finger, and everybody laughs. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown, a car whips around the corner into the alley, the doors burst open, and Mr. White hops out. The alley is empty, Freddy opens the side door, runs to the end of the alley just as a police car comes into sight, and Mr. White loads his two .45 automatics.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Freddy enters the scene from the identical direction he exited in the preceding shot, concluding his phrase, and in a broader view, he is observed executing his soliloquy to Holdaway in a parking lot while pacing back and forth. Freddy, Joe, Nice Guy Eddie, and Mr. White sit around a table in a red-lit, smokey tavern. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd, with all eyes on him. Everyone is frozen, resulting in a frozen image of Freddy in front of the sheriffs. A slow 360-degree view is taken around Freddy in the men's room, followed by a 360-degree camera maneuver around the men. The dog barks, and a sheriff yells at it to calm down. A couple of sheriffs glance at Freddy off-screen, but turn their attention to Sheriff #2 as he continues his tale. The camera pans from the sheriffs to Freddy, who is up against the urinal, pretending to urinate, and then continues to pan with him. A sheriff is seated on a sink, and Freddy finishes washing his hands, goes to dry them but there are only hand drying devices. He turns one on, and a close-up shows his hands being blown dry. Mr. Orange looks from left to right. The device turns off, Freddy turns, and walks out of the room. Joe lights a cigar, and Freddy answers it, with the camera following the receiver up to his face. A close-up shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle. The camera follows Freddy as he jumps around the apartment, getting everything he requires, puts on his coat, and exits scene. Inside an unmarked car across the street, two officers see Freddy walk out of his building and up to Eddie's parked car. Freddy gets into the car driven by Nice Guy Eddie, with Mr. Pink in the passenger seat, and they pull into traffic as the group laughs, reacts horribly, and laughs again. The camera tracks across the men's faces, Joe points a finger, and everybody laughs. The camera leaves the team and focuses on a blackboard with an outline of the jewelry store. The exterior of the jewelry store is shown, a car whips around the corner into the alley, the doors burst open, and Mr. White leaps out. The alley is vacant, Freddy opens the side door, runs to the end of the alley just as a police car comes into sight, and Mr. White loads his two .45 automatics."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Freddy is seen entering the frame from the same direction he exited in the previous scene, with his sentence being finished by him. In a wider shot, he performs his monologue to Holdaway in a parking lot while he paces back and forth. A table is sat around by Freddy, Joe, Nice Guy Eddie, and Mr. White in a red-lit, smokey bar. Freddy then stands in front of six Los Angeles County Sheriffs and one German Shepherd, with all eyes on him. Everyone freezes, resulting in a freeze frame of Freddy in front of the sheriffs. A slow 360-degree shot is taken around Freddy in the men's room, followed by a 360-degree camera movement around the men. The dog barks, and it is yelled at to quiet down by a sheriff. Freddy is looked at off-screen by a couple of sheriffs, but they turn their attention to Sheriff #2 as he continues his story. The camera pans from the sheriffs to Freddy, who stands up against the urinal, pretending to urinate, and he is continued to be panned with by the camera. A sink is sat on by a sheriff, and Freddy finishes washing his hands, goes to dry them but finds only hand drying machines. One is turned on by him, and a close-up shows that his hands are being blown dry. Mr. Orange looks from left to right. The machine turns off, Freddy turns, and he walks out of the room. Joe lights a cigar, and it is answered by Freddy, with the camera following the receiver up to his face. A close-up shows Nice Guy Eddie speaking into the car phone before he places the receiver back in its cradle. Freddy is followed by the camera as he hops around the apartment, getting everything he needs, puts on his jacket, and exits the frame. Freddy is seen by two cops inside an unmarked car across the street as he walks out of his building and up to Eddie's parked car. Freddy gets into the car that is driven by Nice Guy Eddie, with Mr. Pink in the passenger seat, and traffic is pulled into by them as laughter, a horrible reaction, and laughter again come from the car. The camera tracks across the men's faces, a finger is pointed by Joe, and everybody laughs. The team is left by the camera and it focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown, a car whips around the corner into the alley, the doors burst open, and Mr. White hops out. The alley is empty, the side door is opened by Freddy, he runs to the end of the alley just as a police car comes into sight, and his two .45 automatics are loaded by Mr. White."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Freddy enters the frame from where he exited earlier, finishing his sentence, and in a wide shot, performs his monologue to Holdaway in a parking lot while pacing. Freddy, Joe, Nice Guy Eddie, and Mr. White sit at a table in a red-lit, smokey bar. Freddy stands in front of six Los Angeles County Sheriffs and a German Shepherd, resulting in a freeze frame. A slow 360-degree shot circles Freddy in the men's room and then around the men. The dog barks, and a sheriff tells it to quiet down. Some sheriffs look at Freddy, then turn to Sheriff #2 as he continues his story. The camera pans from the sheriffs to Freddy at the urinal, pretending to urinate, then pans with him. A sheriff sits on a sink as Freddy finishes washing his hands, turns on a hand dryer, and a close-up shows his hands drying. Mr. Orange looks around. Freddy leaves the room as Joe lights a cigar. The camera follows the receiver to Freddy's face. Close-up shows Nice Guy Eddie on the car phone, then placing it in the cradle. The camera tracks Freddy hopping around the apartment, gathering his things, putting on his jacket, and exiting. Two cops in an unmarked car see Freddy walk out and approach Eddie's car. Freddy joins Nice Guy Eddie and Mr. Pink as they pull into traffic, laughing. The camera tracks their faces, Joe points, and everyone laughs. The focus shifts to a blackboard showing the jewelry store layout. The outside of the store is shown as a car whips into the alley, Mr. White hops out, and Freddy opens the side door, running to the alley's end as a police car appears. Mr. White loads his two .45 automatics."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Freddy re-enters from where he exited, finishing his sentence and performing his monologue to Holdaway in a parking lot. Freddy, Joe, Nice Guy Eddie, and Mr. White sit around a table in a red-lit, smoky bar. Freddy stands before six LA County Sheriffs and a German Shepherd in a freeze frame. A 360-degree shot circles Freddy in the men's room, followed by a panorama of the men. The dog barks, and a sheriff tells it to quiet down. Sheriffs glance at Freddy but focus on Sheriff #2's story. The camera pans from the sheriffs to Freddy, pretending to urinate at a urinal, washing his hands, and using a hand dryer. The machine turns off, and Freddy exits. Joe lights a cigar, and Freddy responds, with the camera capturing his face. Nice Guy Eddie speaks into the car phone. The camera follows Freddy hopping around, gathering things, wearing his jacket, and leaving. In an unmarked car, two cops see Freddy enter Eddie's car with Mr. Pink. They join traffic, laughing and reacting. The camera focuses on a blackboard with a jewelry store layout. Outside, a car enters an alley, doors burst open, and Mr. White exits. The alley is empty; Freddy runs as a police car appears, while Mr. White readies his two .45 automatics."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Freddy makes his reappearance on screen by entering the frame from the very same direction that he had exited in the previous scene, seamlessly completing his unfinished sentence from before. In a broader, more expansive shot, he is depicted as he energetically delivers his monologue to Holdaway in the wide, open space of a parking lot, all while pacing back and forth with an air of intensity. In another setting, Freddy, Joe, Nice Guy Eddie, and Mr. White are seen sitting together around a table in the dim, red-lit, smokey atmosphere of a bar, each of them deeply engrossed in their surroundings. The next scene shifts, showing Freddy standing authoritatively in front of a line of six Los Angeles County Sheriffs alongside one attentive German Shepherd, all eyes fixed intently on him. This moment freezes, creating a striking freeze-frame image of Freddy standing boldly in front of the sheriffs. Gradually, a slow, sweeping 360-degree camera shot encircles Freddy in the men’s room, which is then followed by a similar 360-degree camera movement around the group of men. The silence is pierced by the barking of the German Shepherd, prompting one of the sheriffs to raise his voice and instruct the dog to quiet down. A couple of sheriffs cast a glance towards Freddy off-screen but soon divert their attention to focus intently on Sheriff #2 as he continues to tell his story. The camera smoothly pans from the group of sheriffs over to Freddy, who is positioned up against the urinal, pretending to relieve himself, and continues to follow him. Meanwhile, another sheriff, seated upon a sink, observes as Freddy finishes washing his hands and moves to dry them, only to find there are no towels available, leaving him with the hand drying machines as his only option. He turns one of the machines on, and the camera zooms in for a close-up shot of his hands being efficiently blown dry. Mr. Orange, meanwhile, glances from left to right with a sense of anticipation. The machine automatically turns off, prompting Freddy to turn and confidently stride out of the room. Meanwhile, Joe lights up a cigar, and Freddy acknowledges it, with the camera capturing the receiver as it moves upwards towards his face. In a close-up shot, Nice Guy Eddie is seen speaking into a car phone before carefully placing the receiver back into its cradle. The camera follows Freddy as he energetically hops around the apartment, gathering all the necessary items, then swiftly puts on his jacket, and exits the frame with determination. Across the street, inside an inconspicuous unmarked car, two vigilant cops catch sight of Freddy as he steps out of his building and heads towards Eddie's car parked nearby. Freddy proceeds to get into the car, which is being driven by Nice Guy Eddie, with Mr. Pink seated comfortably in the passenger seat, and they swiftly pull into traffic. Inside the car, the occupants react with a mix of horror and laughter, creating a lively atmosphere. The camera tracks across the men's faces, capturing Joe as he emphatically points a finger, causing everybody to erupt into laughter. The camera then shifts its focus away from the team, turning its attention to a blackboard displaying the detailed layout of the jewelry store. The scene transitions to the outside of the jewelry store, where a car dramatically whips around a corner into an alley, and the doors burst open with urgency as Mr. White swiftly hops out. The alley remains empty, giving Freddy the opportunity to open the side door and sprint to the end of the alley just as a police car comes into view. During this tense moment, Mr. White efficiently loads his two .45 automatics, ready for whatever may come next."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Freddy makes a dramatic reappearance on the screen by entering into the frame from exactly the same direction that he had exited in the previous scene, seamlessly picking up and completing his unfinished sentence from before without missing a beat. In a broader, more expansive shot, he is portrayed as he energetically delivers his lengthy monologue to Holdaway in the vast, open expanse of a parking lot, all the while pacing back and forth with an air of intensity and urgency. In another setting altogether, Freddy, alongside Joe, Nice Guy Eddie, and Mr. White, is shown sitting together around a table in the dim, red-lit, smokey atmosphere of a bar, each individual deeply engrossed in their immediate surroundings. The scene then transitions, showing Freddy standing with an authoritative presence in front of a line of six Los Angeles County Sheriffs, alongside one attentive German Shepherd, all eyes fixed intently on him. This moment freezes, creating a striking and memorable freeze-frame image of Freddy standing boldly in front of the sheriffs in complete command. Gradually, a slow, sweeping 360-degree camera shot encircles Freddy in the men’s room, which is then followed by a similarly executed 360-degree camera movement around the assembled group of men. The silence is suddenly broken by the barking of the German Shepherd, prompting one of the sheriffs to raise his voice and firmly instruct the dog to quiet down. A couple of sheriffs briefly cast a glance in Freddy’s direction off-screen but soon divert their attention to focus keenly on Sheriff #2 as he continues regaling his story. The camera smoothly pans away from the group of sheriffs over to Freddy, who is positioned up against the urinal, pretending to relieve himself, and continues to follow him. Meanwhile, another sheriff, comfortably seated upon a sink, observes as Freddy finishes washing his hands and moves to dry them, only to realize there are no towels available, leaving him with the hand drying machines as his sole option. He turns one of the machines on, and the camera zooms in closely for an intimate shot of his hands being efficiently blown dry. Mr. Orange, meanwhile, glances from left to right with a palpable sense of anticipation. The machine automatically turns off, prompting Freddy to turn and confidently stride out of the room. Meanwhile, Joe lights up a cigar, and Freddy acknowledges this action, with the camera capturing the receiver as it moves upwards towards his face. In a close-up shot, Nice Guy Eddie is seen speaking earnestly into a car phone before carefully placing the receiver back into its cradle. The camera then follows Freddy as he energetically hops around the apartment, gathering all the necessary items he needs, then swiftly puts on his jacket, and exits the frame with unmistakable determination. Across the street, inside an inconspicuous unmarked car, two vigilant cops take notice of Freddy as he steps out of his building and heads directly towards Eddie’s car parked nearby. Freddy proceeds to get into the car, which is being expertly driven by Nice Guy Eddie, with Mr. Pink seated comfortably in the passenger seat, and they swiftly pull into traffic. Inside the car, the occupants react with a mix of horror and laughter, creating a lively, animated atmosphere. The camera tracks across the men’s faces, capturing Joe as he emphatically points a finger, causing everyone in the car to erupt into fits of laughter. The camera then shifts its focus away from the team, turning its attention to a blackboard meticulously displaying the detailed layout of the jewelry store. The scene then transitions again to outside the jewelry store, where a car dramatically whips around a nearby corner into an alley, and the doors burst open with a sense of urgency as Mr. White swiftly hops out. The alley remains empty, giving Freddy the perfect opportunity to open the side door and sprint to the end of the alley just as a police car starts to come into view. During this tense, adrenaline-filled moment, Mr. White efficiently loads his two .45 automatics, readying himself for whatever may come next."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Freddy re-enters the frame from the same direction he exited in the previous scene, he completes his sentence seamlessly. In a wider shot, he is observed performing his monologue to Holdaway in the parking lot, his presence emphasized by his pacing back and forth. The scene transitions to Freddy, Joe, Nice Guy Eddie, and Mr. White seated around a table in a red-lit, smoky bar, enveloped in an atmosphere of intrigue. Suddenly, we see Freddy positioned in front of six Los Angeles County Sheriffs and a keen-eyed German Shepherd, with all attention fixated on him. The intensity of the moment is captured as everyone remains motionless, resulting in a freeze frame of Freddy standing resolute before the sheriffs. A slow, deliberate 360-degree shot encircles Freddy in the men's room, followed by a similar circular camera movement encompassing the surrounding men. The dog's sudden bark pierces the silence, prompting a sheriff to command its quiet. Some sheriffs momentarily shift their gaze toward Freddy who is off-screen, before refocusing their attention on Sheriff #2 as he continues unfolding his narrative. The camera smoothly transitions from the sheriffs to Freddy, who is strategically positioned against the urinal, convincingly feigning urination while the camera continues to follow him closely. A sheriff, casually perched on a sink, watches as Freddy completes washing his hands. Intent on drying them, Freddy discovers only hand drying machines are available. He activates one, and a close-up captures his hands receiving the gust of air. Mr. Orange darts his eyes from left to right, surveying the room with a quick glance. As the machine powers down, Freddy turns promptly and exits the room with purpose. Joe, in another setting, lights a cigar while Freddy acknowledges it, the camera capturing the movement of the receiver as it travels up to his face. A close-up reveals Nice Guy Eddie speaking into the car phone, demonstrating his engagement with the conversation before replacing the receiver back into its cradle. The camera then trails Freddy as he energetically navigates his apartment, gathering essential items, slipping into his jacket, and briskly exiting the frame. Across the street, inside an unmarked police car, two officers observe Freddy emerge from his building and approach Eddie's parked car. Freddy enters the vehicle driven by Nice Guy Eddie, with Mr. Pink occupying the passenger seat beside him. The car seamlessly merges into traffic, prompting an array of laughter and reactions from its occupants as they indulge in humorous exchanges. As the camera traverses the faces of the group, Joe's pointed finger cues another bout of laughter among them. Abruptly, the camera shifts focus from the team to a blackboard detailing the layout of a jewelry store. The scene changes to the exterior of the jewelry store, where a car aggressively whips around the corner into the alley, doors flinging open as Mr. White springs out with agility. The alley stands deserted as Freddy quickly opens the side door and dashes to the end, just as a police car emerges into view. Meanwhile, Mr. White is seen efficiently loading his two .45 automatics, readying himself for the unfolding events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Freddy enters the frame continuing his previous sentence, and delivers a monologue to Holdaway while pacing in a parking lot. In a red-lit, smokey bar, Freddy sits with Joe, Nice Guy Eddie, and Mr. White. He is then shown standing before six Los Angeles County Sheriffs and a German Shepherd, capturing everyone's attention in a freeze frame. A slow 360-degree shot circles Freddy in a men's room, and a sheriff quiets the barking dog. The camera pans from the sheriffs to Freddy, who pretends to urinate at a urinal. After drying his hands with a machine, Freddy exits the room. Joe lights a cigar, and Freddy answers it, with the focus shifting to Nice Guy Eddie speaking into a car phone. Freddy gathers his things in his apartment, dons his jacket, and leaves. Two cops in an unmarked car observe him as he enters Eddie's car, driven by Nice Guy Eddie with Mr. Pink in the passenger seat. They join traffic, exchanging laughter and reactions. The camera tracks the men's faces, Joe points, and they all laugh. The scene shifts to a blackboard with the jewelry store layout, then to the store's exterior where a car speeds into an alley. The doors burst open, and Mr. White exits. As the alley remains empty, Freddy opens a side door, runs towards the alley's end as a police car appears, while Mr. White readies his two .45 automatics."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Freddy, re-entering from the same direction he exited in the previous scene, finishing his sentence as if no time has passed, in a wider shot is seen performing his monologue to Holdaway in a parking lot, a common urban setting in Los Angeles known for its sprawling, car-centric design, while pacing back and forth. Freddy, Joe, a seasoned criminal mastermind, Nice Guy Eddie, the son of a notorious crime boss, and Mr. White, an experienced and resilient thief, sit around a table in a red-lit, smokey bar reminiscent of the classic dive bars in downtown Los Angeles. Freddy finds himself standing in front of six Los Angeles County Sheriffs, known for their jurisdiction over a vast and diverse region, and one German Shepherd, a breed commonly used by police for its intelligence and strength, with all eyes on him. Everyone is frozen, resulting in a freeze frame of Freddy in front of the sheriffs, creating a tension-filled moment. A slow 360-degree shot is taken around Freddy in the men's room, a technique often used to convey disorientation or introspection, followed by a 360-degree camera move around the men. The dog barks, its sharp noise breaking the silence, and a sheriff yells at it to quiet down, highlighting the tension in the room. A couple of sheriffs look at Freddy off-screen, but turn their attention to Sheriff #2, a grizzled veteran known for his storytelling, as he continues his story. The camera pans from the sheriffs to Freddy, who is up against the urinal, pretending to urinate, a tactic sometimes used to overhear conversations, and then continues to pan with him. A sheriff is sitting on a sink, and Freddy finishes washing his hands, goes to dry them but there are only hand drying machines, known for their inefficiency in public restrooms. He turns one on, and a close-up shows his hands being blown dry by the machine's powerful but often annoyingly loud air stream. Mr. Orange looks from left to right, scanning for any potential threats. The machine turns off, Freddy turns, and walks out of the room, preparing to face the next challenge. Joe, lighting a cigar, a symbol of his relaxed yet commanding presence, and Freddy answers it, with the camera following the receiver up to his face, capturing his focused expression. A close-up shows Nice Guy Eddie speaking into the car phone, a status symbol of the 1990s, before placing the receiver back in its cradle. The camera follows Freddy as he hops around the apartment, a place he keeps minimally furnished to avoid leaving traces, getting everything he needs, puts on his jacket, and exits frame. Inside an unmarked car across the street, two undercover cops surveil Freddy, noting his every move, as he walks out of his building and up to Eddie's parked car. Freddy gets into the car driven by Nice Guy Eddie, with Mr. Pink, an infamous opportunist, in the passenger seat, and they pull into traffic as the car, a symbol of their criminal lifestyle, laughs, reacts horribly, and laughs again, adding tension and unpredictability to the scene. The camera tracks across the men's faces, capturing their complex emotions, Joe points a finger, signaling a decision, and everybody laughs, a moment of camaraderie in the midst of their tense operation. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store, their next target. The outside of the jewelry store is shown, a typical high-end venue of Los Angeles' affluent shopping districts, a car whips around the corner into the alley, the doors burst open, and Mr. White hops out, ready for action. The alley is empty, a common urban escape route, Freddy opens the side door, runs to the end of the alley just as a police car comes into sight, heightening the urgency, and Mr. White loads his two .45 automatics, weapons known for their reliability and power in critical moments."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "two cops see Freddy walk out of his building and up to Eddie's parked car Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth The outside of the jewelry store is shown Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar The camera tracks across the men's faces Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him The dog barks and a sheriff yells at it to quiet down A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines The camera leaves the team and focuses on a blackboard with a layout of the jewelry store the doors burst open and Mr White hops out He turns one on and a closeup shows his hands being blown dry Mr Orange looks from left to right The alley is empty The machine turns off Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar Freddy turns and walks out of the room Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame Inside an unmarked car across the street two cops see Freddy walk out of his building and up to Eddie's parked car Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic as the car laughs reacts horribly and laughs again The camera tracks across the men's faces The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men Joe points a finger and everybody laughs The camera leaves the team and focuses on a blackboard with a layout of the jewelry store The outside of the jewelry store is shown a car whips around the corner into the alley the doors burst open and Mr White hops out The alley is empty Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth. Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him. Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs. A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men. The dog barks and a sheriff yells at it to quiet down. A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story. The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him. A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines. He turns one on and a closeup shows his hands being blown dry. Mr Orange looks from left to right. The machine turns off. Freddy turns and walks out of the room. Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle. The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame. Inside an unmarked car across the street. two cops see Freddy walk out of his building and up to Eddie's parked car. Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic. as the car laughs reacts horribly and laughs again. The camera tracks across the men's faces. Joe points a finger and everybody laughs. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown. a car whips around the corner into the alley. the doors burst open and Mr White hops out. The alley is empty. Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth. Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him. Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs. A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men. The dog barks and a sheriff yells at it to quiet down. A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story. The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him. A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines. He turns one on and a closeup shows his hands being blown dry. Mr Orange looks from left to right. The machine turns off. Freddy turns and walks out of the room. Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle. The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame. Inside an unmarked car across the street. two cops see Freddy walk out of his building and up to Eddie's parked car. Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic. as the car laughs reacts horribly and laughs again. The camera tracks across the men's faces. Joe points a finger and everybody laughs. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown. a car whips around the corner into the alley. the doors burst open and Mr White hops out. The alley is empty. Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth. Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him. Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs. A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men. The dog barks and a sheriff yells at it to quiet down. A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story. Joe points a finger and everybody laughs. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown. a car whips around the corner into the alley. the doors burst open and Mr White hops out. The alley is empty. Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth. Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar. Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him. the doors burst open and Mr White hops out. The alley is empty. Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Henry enters the frame from the same direction the cat exited in the previous scene, finishing his sentence, and in a wider shot, the dog is seen performing its monologue to the teacher in a parking lot while pacing back and forth. A rabbit, a toaster, a friendly alien, and a giraffe sit around a table in a red-lit, smokey bar. A tree is then standing in front of six Los Angeles County Sheriffs and one German Shepherd, with all eyes on it. Everyone is frozen, resulting in a freeze frame of a chair in front of the sheriffs. A slow 360-degree shot is taken around a lamp in the men's room, followed by a 360-degree camera move around the crayons. The cat barks, and a sheriff yells at it to quiet down. A couple of sheriffs look at an umbrella off-screen, but turn their attention to Sheriff #2 as he continues his story. The camera pans from the sheriffs to a pillow, which is up against the urinal, pretending to urinate, and then continues to pan with it. A sheriff is sitting on a sink, and the kangaroo finishes washing its hands, goes to dry them but there are only hand drying machines. The kangaroo turns one on, and a close-up shows its hands being blown dry. A clock looks from left to right. The machine turns off, the kangaroo turns, and walks out of the room. A painter lights a cigar, and a bicycle answers it, with the camera following the receiver up to its face. A close-up shows a butterfly speaking into the car phone before placing the receiver back in its cradle. The camera follows a violin as it hops around the apartment, getting everything it needs, puts on its jacket, and exits frame. Inside an unmarked car across the street, two fish see a violin walk out of its building and up to a friendly alien's parked car. A violin gets into the car driven by a friendly alien, with a cloud in the passenger seat, and they pull into traffic as the car laughs, reacts horribly, and laughs again. The camera tracks across the musical instruments' faces, a toaster points a finger, and everybody laughs. The camera leaves the team and focuses on a blackboard with a layout of the jewelry store. The outside of the jewelry store is shown, a bicycle whips around the corner into the alley, the doors burst open, and a giraffe hops out. The alley is empty, a violin opens the side door, runs to the end of the alley just as a police car comes into sight, and a giraffe loads its two .45 automatics."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Freddy enters the frame from the same direction he exited in the previous scene, finishing his sentence, and in a wider shot, he is seen performing his monologue to Holdaway in a garden while pacing back and forth. Freddy, Joe, Nice Guy Eddie, and Mr. White sit around a table in a blue-lit, misty cafe. Freddy is then standing in front of six Los Angeles County Firefighters and one Siamese cat, with all eyes on him. Everyone is frozen, resulting in a freeze frame of Freddy in front of the firefighters. A slow 360-degree shot is taken around Freddy in the laundry room, followed by a 360-degree camera move around the men. The cat meows, and a firefighter yells at it to quiet down. A couple of firefighters look at Freddy off-screen, but turn their attention to Firefighter #2 as he continues his story. The camera pans from the firefighters to Freddy, who is up against the water cooler, pretending to drink, and then continues to pan with him. A firefighter is sitting on a dryer, and Freddy finishes ironing his shirt, goes to hang it but there are only coat racks. He turns one around, and a close-up shows his shirt being hung up. Mr. Orange looks from left to right. The rack turns, Freddy turns, and walks out of the room. Joe lights a candle, and Freddy answers it, with the camera following the flame up to his face. A close-up shows Nice Guy Eddie speaking into the walkie-talkie before placing the receiver back in its cradle. The camera follows Freddy as he hops around the kitchen, getting everything he needs, puts on his scarf, and exits frame. Inside an unmarked van across the street, two scouts see Freddy walk out of his building and up to Eddie's parked bicycle. Freddy gets into the vehicle driven by Nice Guy Eddie, with Mr. Pink in the passenger seat, and they pull into traffic as the bicycle laughs, reacts horribly, and laughs again. The camera tracks across the men's faces, Joe points a finger, and everybody laughs. The camera leaves the team and focuses on a chalkboard with a layout of the grocery store. The outside of the grocery store is shown, a motorcycle whips around the corner into the alley, the doors burst open, and Mr. White hops out. The alley is empty, Freddy opens the side gate, runs to the end of the alley just as a mail truck comes into sight, and Mr. White loads his two water pistols."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Freddy slips into the frame from the same direction he appeared in the previous scene, whispering his sentence, and in a wider shot, he is seen humming his monologue to Holdaway in a parking lot while bouncing up and down. Freddy, Joe, Nice Guy Eddie, and Mr. White stand around a table in a red-lit, smokey bar. Freddy is then lying in front of six Los Angeles County Sheriffs and one German Shepherd, with all eyes diverted from him. Everyone is dancing, resulting in a dynamic frame of Freddy in front of the sheriffs. A quick 360-degree shot is taken around Freddy in the men's room, followed by a 360-degree camera move around the men. The dog sneezes, and a sheriff whispers at it to calm down. A couple of sheriffs glance at Freddy off-screen, but shift their focus to Sheriff #2 as he interrupts his story. The camera swoops from the sheriffs to Freddy, who is sitting against the urinal, pretending to nap, and then continues to swoop with him. A sheriff is swinging on a sink, and Freddy finishes drying his hands, goes to clean them but there are only paper towels. He rips one off, and a close-up shows his hands being polished dry. Mr. Orange stares from right to left. The machine hums on, Freddy spins, and leaps out of the room. Joe smokes a cigar, and Freddy ignores it, with the camera following the receiver away from his face. A close-up shows Nice Guy Eddie whispering into the car phone before twisting the receiver back in its cradle. The camera follows Freddy as he skips around the apartment, collecting everything he needs, puts on his jacket, and slinks out of the frame. Inside an unmarked car across the street, two cops see Freddy skip out of his building and down to Eddie's parked car. Freddy jumps into the car driven by Nice Guy Eddie, with Mr. Pink in the passenger seat, and they zoom into traffic as the car chuckles, reacts awkwardly, and chuckles again. The camera turns across the men's faces, Joe waves a hand, and everybody giggles. The camera leaves the team and pauses on a blackboard with a sketch of the jewelry store. The outside of the jewelry store is shown, a car slides around the corner into the alley, the doors quietly open, and Mr. White slides out. The alley is bustling, Freddy shuts the side door, walks to the end of the alley just as a police car screeches into sight, and Mr. White polishes his two .45 automatics."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The grapefruit enters the painting from the same direction the violin exited in the previous recipe, finishing its melody, and in a wider shot, it is seen performing its sonnet to the giraffe in an orchard while skipping back and forth. The grapefruit, the sandwich, the friendly owl, and the blue notebook sit around a spatula in a yellow-lit, foggy cave. The grapefruit is then standing in front of six Tokyo Marathon joggers and one Bengal tiger, with all eyes on it. Everyone is frozen, resulting in a freeze frame of the grapefruit in front of the joggers. A slow 360-degree shot is taken around the grapefruit in the forest, followed by a 360-degree camera move around the trees. The tiger yowls, and a jogger yells at it to quiet down. A couple of joggers look at the grapefruit off-screen, but turn their attention to Jogger #2 as it continues its tale. The camera pans from the joggers to the grapefruit, which is up against the fountain, pretending to splash, and then continues to pan with it. A jogger is lounging on a mushroom, and the grapefruit finishes painting its leaves, goes to dry them but there are only fans. It turns one on, and a close-up shows its leaves being blown dry. The orange duck looks from left to right. The fan turns off, the grapefruit turns, and dances out of the forest. The sandwich lights a lantern, and the grapefruit answers it, with the camera following the cord up to its face. A close-up shows the friendly owl speaking into the radio before placing the cord back in its bucket. The camera follows the grapefruit as it hops around the castle, gathering everything it wants, puts on its cape, and exits frame. Inside an unmarked boat across the lake, two penguins see the grapefruit hop out of its burrow and up to the owl's parked boat. The grapefruit gets into the boat driven by the friendly owl, with the green kangaroo in the passenger seat, and they pull into traffic as the boat chuckles, reacts horribly, and giggles again. The camera tracks across the forest's branches, the sandwich points a twig, and everything snickers. The camera leaves the apples and focuses on a chalkboard with a map of the bakery. The outside of the bakery is shown, a boat whips around the corner into the grove, the hatches burst open, and the blue notebook hops out. The grove is empty, the grapefruit opens the side hatch, skips to the end of the grove just as a police bus comes into view, and the blue notebook loads its two pears."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Marcus glides into the frame from the opposite direction he vanished in the previous scene, composing his response, and in a broader shot, he is seen delivering his narrative to McCarty in a playground while tapping his feet. Marcus, Dave, Funny Guy Larry, and Mr. Blue lounge around a table in a blue-lit, foggy lounge. Marcus is then posing in front of six New York City Firefighters and one Siamese Cat, with all gazes on him. Everyone is still, resulting in a still frame of Marcus in front of the firefighters. A gradual 360-degree shot encircles Marcus in the kitchen, followed by a 360-degree camera move around the crew. The feline meows, and a firefighter urges it to calm down. A few firefighters glance at Marcus off-screen, but divert their attention to Firefighter #3 as he narrates his tale. The camera sweeps from the firefighters to Marcus, who is by the sink, pretending to drink water, and then continues to sweep with him. A firefighter reclines on a chair, and Marcus concludes rinsing his utensils, attempts to dry them but there are only air drying machines. He activates one, and a close-up reveals his utensils being air-dried. Mr. Yellow glances from top to bottom. The machine halts, Marcus pivots, and strides out of the area. Dave ignites a pipe, and Marcus responds to it, with the camera tracking the pipe up to his lips. A close-up reveals Funny Guy Larry speaking into the mobile phone before setting the handset back on its stand. The camera follows Marcus as he dances around the studio, gathering everything he desires, dons his coat, and departs from view. Inside an inconspicuous vehicle across the avenue, two detectives notice Marcus exit his residence and proceed to Larry's parked car. Marcus climbs into the vehicle driven by Funny Guy Larry, with Mr. Green in the adjacent seat, and they merge into traffic as the vehicle chuckles, responds poorly, and chuckles again. The camera slides across the crew's expressions, Dave gestures a hand, and everyone chuckles. The camera drifts away from the group and fixates on a bulletin board with a diagram of the art gallery. The exterior of the art gallery is depicted, a vehicle skids around the bend into the lane, the windows fly open, and Mr. Blue leaps out. The lane is vacant, Marcus unlatches the side window, dashes to the lane's end just as a taxicab emerges into view, and Mr. Blue prepares his two paintball guns."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Freddy drifts into the scene from the same direction he vanished in the previous part, mumbling his dialogue, and in a broader shot, he is observed delivering his speech to Holdaway in a garden while skipping side to side. Freddy, Joe, Nice Guy Eddie, and Mr. White lounge around a table in a green-lit, misty café. Freddy is then positioned in front of six Los Angeles County Lifeguards and one Siamese cat, with all gazes on him. Everyone is paused, resulting in a snapshot of Freddy in front of the lifeguards. A slow 360-degree shot is taken around Freddy in the kitchen, followed by a 360-degree camera move around the men. The cat meows, and a lifeguard shouts at it to quiet down. A couple of lifeguards glance at Freddy off-screen but divert their attention to Lifeguard #2 as he resumes his tale. The camera tilts from the lifeguards to Freddy, who is up against the sink, pretending to wash dishes, and then continues to tilt with him. A lifeguard is perched on a chair, and Freddy finishes cleaning his shoes, goes to polish them but there are only shoe buffing machines. He activates one, and a close-up shows his shoes being shined. Mr. Orange glances from top to bottom. The machine shuts down, Freddy pivots, and dances out of the space. Joe ignites a torch, and Freddy responds to it, with the camera trailing the flame up to his face. A close-up shows Nice Guy Eddie chatting into the earpiece before resting the receiver back in its holder. The camera follows Freddy as he leaps around the kitchen, gathering everything he requires, slips on his coat, and leaves scene. Inside an unmarked van across the road, two detectives watch Freddy skip out of his hotel and up to Eddie's stationed van. Freddy climbs into the van operated by Nice Guy Eddie, with Mr. Pink in the navigator's seat, and they merge into traffic as the van chuckles, reacts comically, and chuckles again. The camera pans across the men's expressions, Joe motions a wave, and everyone snickers. The camera departs from the group and zooms in on a chalkboard with a sketch of the gallery. The outside of the gallery is displayed, a van screeches around the bend into the side street, the doors fly open, and Mr. White jumps out. The side street is deserted, Freddy swings open the backdoor, sprints to the end of the side street just as a firetruck comes into view, and Mr. White unloads his two water pistols."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Geraldine tumbles into the orchard from the opposite direction she skated in the last episode, concluding her melody, and in an expansive view, she is spotted crafting her soliloquy to Pickering in a gymnasium while skipping up and down. Geraldine, Clara, Friendly Sam, and Mrs. Green relax around a couch in a blue-lit, foggy library. Geraldine is then lounging in front of eight Tokyo County Bakers and one Siamese Cat, with all gazes fixed on her. Everyone is paralyzed, creating a still frame of Geraldine in front of the bakers. A sluggish 360-degree swoop is executed around Geraldine in the playroom, succeeded by a 360-degree lens whirl around the painters. The cat meows, and a baker screams at it to hush. A handful of bakers glance at Geraldine off-camera but shift their focus to Baker #4 as she narrates her tale. The camera tilts from the bakers to Geraldine, who is next to the bench, feigning to nap, and then persists to tilt with her. A baker is reclining on a table, and Geraldine concludes tying her shoes, goes to lace them up but there are only shoelace loops. She flicks one on, and a close-up exhibits her shoes being looped tightly. Mrs. Purple scans from top to bottom. The loop deactivates, Geraldine spins, and skips out of the chamber. Clara ignites a candle, and Geraldine flicks it, with the camera tailing the flame up to her nose. A close-up portrays Friendly Sam murmuring into the seashell before dropping it back in its socket. The camera trails Geraldine as she dances around the studio, grabbing whatever she desires, slips on her scarf, and vanishes from view. Within a disguised bike across the road, two firefighters observe Geraldine leap out of her cottage and onto Sam's parked bike. Geraldine leaps onto the vehicle piloted by Friendly Sam, with Mrs. Green in the co-pilot seat, and they glide into the air as the bike giggles, responds atrociously, and giggles once more. The camera pans across the women's faces, Clara wags a pencil, and everyone chuckles. The camera drifts away from the squad and zeroes in on a chalkboard with a scheme of the bakery. The exterior of the bakery is depicted, a boat zooms around the bend into the lane, the hatches explode open, and Mrs. Green leaps out. The lane is deserted, Geraldine unlocks the back window, sprints to the border of the lane just as a fire truck rolls into view, and Mrs. Green stashes her two roses."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Freddy enters the scene, finishing a prior sentence, and performs a monologue to Holdaway in a parking lot. In a red-lit, smokey bar, Freddy sits with Joe, Nice Guy Eddie, and Mr. White. Later, Freddy stands before six Los Angeles County Sheriffs and a German Shepherd, resulting in a freeze frame. A 360-degree shot captures Freddy in the men's room as a sheriff calms the barking dog. Freddy pretends to urinate, dries his hands with a machine, and leaves. Joe lights a cigar, and Freddy answers a call. Nice Guy Eddie speaks into a car phone. Freddy gathers his things, exits his building, and joins Eddie and Mr. Pink in a car. They drive into traffic, laughing, while the camera shifts focus onto a blackboard of a jewelry store layout. Mr. White exits a car in the alley as Freddy runs to the end, and Mr. White readies his .45 automatics as a police car approaches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics The alley is empty the doors burst open and Mr White hops out a car whips around the corner into the alley The outside of the jewelry store is shown The camera leaves the team and focuses on a blackboard with a layout of the jewelry store Joe points a finger and everybody laughs The camera tracks across the men's faces as the car laughs reacts horribly and laughs again Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic two cops see Freddy walk out of his building and up to Eddie's parked car Inside an unmarked car across the street The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face Freddy turns and walks out of the room The machine turns off Mr Orange looks from left to right He turns one on and a closeup shows his hands being blown dry A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story The dog barks and a sheriff yells at it to quiet down A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic Inside an unmarked car across the street Mr Orange looks from left to right Joe points a finger and everybody laughs Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story The dog barks and a sheriff yells at it to quiet down The machine turns off A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle He turns one on and a closeup shows his hands being blown dry a car whips around the corner into the alley Freddy turns and walks out of the room as the car laughs reacts horribly and laughs again The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame the doors burst open and Mr White hops out Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him two cops see Freddy walk out of his building and up to Eddie's parked car The alley is empty A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men The camera leaves the team and focuses on a blackboard with a layout of the jewelry store The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines The outside of the jewelry store is shown Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs The camera tracks across the men's faces"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A closeup shows Nice Guy Eddie speaking into the car phone before placing the receiver back in its cradle The camera follows Freddy as he hops around the apartment getting everything he needs puts on his jacket and exits frame Inside an unmarked car across the street two cops see Freddy walk out of his building and up to Eddie's parked car Freddy gets into the car driven by Nice Guy Eddie with Mr Pink in the passenger seat and they pull into traffic as the car laughs reacts horribly and laughs again The camera tracks across the men's faces Joe points a finger and everybody laughs The camera leaves the team and focuses on a blackboard with a layout of the jewelry store The outside of the jewelry store is shown a car whips around the corner into the alley the doors burst open and Mr White hops out The alley is empty Freddy opens the side door runs to the end of the alley just as a police car comes into sight and Mr White loads his two 45 automatics Freddy enters the frame from the same direction he exited in the previous scene finishing his sentence and in a wider shot he is seen performing his monologue to Holdaway in a parking lot while pacing back and forth Freddy Joe Nice Guy Eddie and Mr White sit around a table in a redlit smokey bar Freddy is then standing in front of six Los Angeles County Sheriffs and one German Shepherd with all eyes on him Everyone is frozen resulting in a freeze frame of Freddy in front of the sheriffs A slow 360degree shot is taken around Freddy in the men's room followed by a 360degree camera move around the men The dog barks and a sheriff yells at it to quiet down A couple of sheriffs look at Freddy offscreen but turn their attention to Sheriff 2 as he continues his story The camera pans from the sheriffs to Freddy who is up against the urinal pretending to urinate and then continues to pan with him A sheriff is sitting on a sink and Freddy finishes washing his hands goes to dry them but there are only hand drying machines He turns one on and a closeup shows his hands being blown dry Mr Orange looks from left to right The machine turns off Freddy turns and walks out of the room Joe lights a cigar and Freddy answers it with the camera following the receiver up to his face"
        }
      ]
    }
  ]
}