{
  "ground_truth": "Lenny is strapped onto a metal bed, his arms and legs in tight leather restraints. Evan sighs and gives up. Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. Seven-year-old Evan comes to during the time he first met his father, Jason. Jason launches himself across the table, shackles and all, and grabs hold of Evan's throat. Evan's hands instinctively reach for his throat, then he realizes his surroundings. Evan eats in the same diner where Kayleigh used to work. As he eats, his arm sits in front of his plate, protectively guarding his food. Evan slowly walks up the driveway, which is now a dilapidated mess. Garbage litters the front lawn and paint chips rot off the sides of the house. In a blur, Evan grabs Mr. Miller's shirt and violently shoves him through the house and into a wall. Mr. Miller goes slack, his eyes wide with horror. Evan walks past some junkies and enters, stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. He knocks on a door, and Kayleigh, now a haggard, strung-out junkie, opens the door and immediately the contempt for Evan grows in her eyes. She looks around, waves him in. The room is dirty and sparse, excepting charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil. His eyes begin to water. Kayleigh eyes the wallet, opens Evan's wallet, and leaves a twenty on the table. She gets up, puts on her coat, tosses his wallet over her shoulder at him, and leaves. Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic co-ed on Evan's bed. Evan's temper flares, and he picks up a chair and smashes it against a wall above Thumper's head. Thumper and the co-ed quickly cover themselves in the blankets and leave. Mrs. Halpern, startled, stares at the young kid skeptically as she absently continues toward the mailbox. Lenny comes running across the street to Evan's aid, and Tommy shrugs and follows after him. Tommy takes a running dive at Mrs. Halpern, perhaps a bit too hard, and sends her and the baby to the pavement, hurt, but with no major injuries. Seeing things are safe, Evan backs away from the mail. The blast is deafening, and Evan's body is hurled backwards dramatically. Evan comes to back in his dorm, the same posters are on the wall, the sheets are the same. Evan yawns, bringing his hand to his mouth, but there's no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lenny is fastened onto a metallic cot, his limbs in snug leather bindings. Evan exhales and relinquishes. Evan is disregarded by several Theta Chi initiates as he flops himself by a tree and searches through his diary to locate the entry from when he was seven and visited Jason at Sunnyvale. Seven-year-old Evan arrives at during the moment he first encountered his father, Jason. Jason propels himself across the table, manacles and all, and seizes hold of Evan's neck. Evan's hands automatically reach for his neck, then he perceives his environment. Evan dines in the same eatery where Kayleigh used to labor. As he consumes, his arm rests in front of his dish, defensively shielding his meal. Evan gradually strides up the driveway, which is now a ramshackle chaos. Trash scatters the front yard and paint flakes decay off the sides of the domicile. In a flash, Evan seizes Mr. Miller's shirt and forcefully thrusts him through the home and into a partition. Mr. Miller goes limp, his eyes broad with terror. Evan strolls past some addicts and enters, stepping over some unconscious bodies that clutter the corridor of an incredibly disreputable motel. He raps on a door, and Kayleigh, now a worn-out, strung-out addict, opens the door and immediately the disdain for Evan intensifies in her eyes. She glances around, beckons him in. The chamber is filthy and sparse, excepting charred-bottom utensils, yellowed absorption pads, and brown-specked pieces of aluminum foil. His eyes begin to moisten. Kayleigh glances at the wallet, opens Evan's wallet, and leaves a twenty on the table. She rises, dons her coat, tosses his wallet over her shoulder at him, and departs. Evan enters his familiar looking dormitory and hears the familiar noises of Thumper engaging in intercourse with another nude gothic co-ed on Evan's bed. Evan's anger ignites, and he lifts a chair and shatters it against a partition above Thumper's cranium. Thumper and the co-ed rapidly cover themselves in the blankets and depart. Mrs. Halpern, startled, gazes at the young child dubiously as she absentmindedly continues toward the mailbox. Lenny comes sprinting across the road to Evan's assistance, and Tommy shrugs and follows after him. Tommy takes a running leap at Mrs. Halpern, perhaps a bit too forceful, and sends her and the infant to the pavement, injured, but with no significant damages. Seeing circumstances are safe, Evan withdraws from the mail. The explosion is deafening, and Evan's body is flung backward strikingly. Evan arrives back in his dormitory, the same posters are on the partition, the sheets are the same. Evan yawns, bringing his hand to his mouth, but there's no hand. We see countless and brief image flashes of Evan maturing from the age of thirteen with no limbs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lenny is strapped onto a metal bed, his arms and legs held in tight leather restraints. A sigh is given by Evan, and he gives up. Several Theta Chi pledges ignore Evan as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. During the time he first met his father, Jason, seven-year-old Evan comes to. Jason launches himself across the table, shackles and all, and Evan's throat is grabbed by him. Evan's hands instinctively reach for his throat, then he realizes his surroundings. Evan eats in the same diner where Kayleigh used to work. His arm is placed in front of his plate, protectively guarding his food. Evan slowly walks up the driveway, which is now a dilapidated mess. The front lawn is littered with garbage, and paint chips rot off the sides of the house. In a blur, Mr. Miller's shirt is grabbed by Evan, and he is violently shoved through the house and into a wall. Mr. Miller goes slack, and horror widens his eyes. Some junkies are walked past by Evan before he enters, stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. A door is knocked on by him, and Kayleigh, now a haggard, strung-out junkie, opens it, and immediately her contempt for Evan grows in her eyes. She looks around and waves him in. The room is dirty and sparse, excepting charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil. Evan's eyes begin to water. The wallet is eyed by Kayleigh, and she opens Evan's wallet and leaves a twenty on the table. She gets up, puts on her coat, tosses his wallet over her shoulder at him, and leaves. His familiar-looking dorm is entered by Evan and the familiar sounds of Thumper having sex with another naked gothic co-ed on his bed are heard by him. Evan's temper flares, and a chair is picked up by him and smashed against a wall above Thumper's head. The blankets quickly cover Thumper and the co-ed, and they leave. The young kid is stared at skeptically by Mrs. Halpern as she absently continues toward the mailbox. Evan's aid is run to by Lenny across the street, and Tommy shrugs and follows after him. A running dive is taken by Tommy at Mrs. Halpern, perhaps a bit too hard, sending her and the baby to the pavement, hurt but with no major injuries. Seeing things are safe, Evan backs away from the mail. The blast is deafening, and Evan's body is hurled backward dramatically. Back in his dorm, Evan comes to; the same posters are on the wall, the sheets remain the same. Evan yawns, bringing his hand to his mouth, but there's no hand. Countless and brief image flashes of Evan growing up from the age of thirteen with no arms are seen."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lenny is strapped to a metal bed with tight leather restraints on his limbs. Evan, ignored by several Theta Chi pledges, sits by a tree, searching his journal for a childhood entry about visiting Jason at Sunnyvale. Seven-year-old Evan recalls meeting his father, Jason, who lunges across the table to grab his throat. Realizing his surroundings, Evan protects his food while dining where Kayleigh once worked. He walks up a dilapidated driveway, littered with garbage and peeling paint, violently shoving Mr. Miller into a wall, leaving him stunned. Evan navigates through junkies in a seedy motel, finding Kayleigh, now a haggard addict, who disdainfully lets him in. The room is filthy, filled with drug paraphernalia. Kayleigh eyes Evan's wallet, leaves a twenty, and exits. In his dorm, Evan finds Thumper with another girl, which angers him; he smashes a chair against the wall, and they flee. Mrs. Halpern watches a young Evan skeptically as Lenny runs to help him, followed by Tommy, whose dive sends Mrs. Halpern and a baby to the pavement, though unharmed. As Evan steps back from the mail, an explosion blows him backward. In his dorm, with familiar surroundings, Evan yawns, noticing his hand is missing. Flashbacks show Evan growing up from age thirteen without arms."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lenny is strapped to a metal bed with tight leather restraints. Evan gives up after being ignored by Theta Chi pledges and searches his journal for an entry about visiting his father, Jason, at Sunnyvale when he was seven. Young Evan remembers Jason grabbing his throat. Evan eats in Kayleigh's former diner, guarding his food. He walks up a dilapidated driveway with garbage and chipped paint, then violently shoves Mr. Miller against a wall. Evan steps over junkie bodies in a seedy motel and encounters a strung-out Kayleigh, who contemptuously waves him in. The sparse room has drug paraphernalia. Kayleigh takes a twenty from Evan's wallet, throws it back, and leaves. In his dorm, Evan finds Thumper with another co-ed on his bed. Furious, Evan smashes a chair, and they leave. Mrs. Halpern skeptically notices a young kid near the mailbox. Lenny runs to help Evan, and Tommy accidentally knocks Mrs. Halpern and her baby to the ground, but they're unharmed. Evan backs away from the mail before a blast throws him back. He wakes up in his unchanged dorm, yawns, but notices he has no arms. Flashbacks show Evan growing up without arms from age thirteen."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lenny finds himself firmly strapped onto a cold, metal bed, with both his arms and legs secured in tight leather restraints, restricting his movement completely. Nearby, Evan lets out a deep sigh and decides to give up. Evan is completely disregarded by several pledges of the Theta Chi fraternity as he resigns himself to sitting beneath a tall tree. There, he rifles through his worn journal, eager to find the specific entry from when he was a mere seven-year-old, during a visit to see Jason at Sunnyvale. As a seven-year-old child, Evan experiences a vivid memory from the first time he met his father, Jason. In a sudden and aggressive move, Jason hurls himself across the table, shackles clanging, and seizes Evan by the throat. Reflexively, Evan’s hands shoot up to his own throat, but a moment later, he becomes aware of his actual surroundings. \n\nEvan finds himself dining in the very same diner where Kayleigh used to work. As he eats his meal, his arm rests protectively in front of his plate, as if to guard his food from any potential threat. Evan makes his way up the driveway, now a neglected and dilapidated mess. Trash is scattered across the unkempt front lawn, and the paint on the house is decaying and peeling off the walls. Quickly, in a blur of action, Evan grabs Mr. Miller’s shirt forcefully and thrusts him through the house, slamming him into a wall with violence. Mr. Miller goes slack, his eyes wide open with sheer terror. \n\nAs Evan walks past, he notices some junkies. He steps over several unconscious bodies that clutter the hallway of a particularly seedy motel. He approaches a door, knocking on it, and Kayleigh answers. She has transformed into a haggard, strung-out junkie, and her contempt for Evan is immediately evident in her eyes. She glances around cautiously and gestures for him to enter. The room is filthy and sparsely furnished, with nothing but charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil scattered about. His eyes start to water at the sight. Kayleigh's gaze moves to Evan's wallet, she opens it and leaves a twenty-dollar bill on the table. Rising to her feet, she puts on her coat, flinging his wallet dismissively over her shoulder towards him, and leaves the room.\n\nEvan makes his way into his familiar dorm room and is greeted by the recognizable sounds of Thumper engaged in sex with another naked gothic co-ed on Evan's own bed. Anger surges within Evan, prompting him to lift a chair and smash it against the wall just above Thumper’s head. Thumper and the co-ed hastily wrap themselves in blankets and make a swift exit. Mrs. Halpern, taken aback, regards the young kid with suspicion as she absentmindedly continues her path toward the mailbox. Lenny rushes across the street to offer Evan some assistance, while Tommy indifferent, shrugs and decides to follow along. Tommy charges at Mrs. Halpern with perhaps more force than necessary, causing both her and the baby to hit the pavement, fortunately with no major injuries. With the situation under control, Evan cautiously retreats from the mail. \n\nSuddenly, a deafening blast erupts, and Evan's body is dramatically hurled backward by the force. Evan regains consciousness back in his dorm room, noticing that the same posters adorn the walls, and the sheets remain unchanged. As he yawns, bringing his hand to his mouth instinctively, he realizes with shock that there is no hand. We are then presented with countless, brief image flashes of Evan growing up from the age of thirteen, depicting his life navigating the world without arms."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lenny unexpectedly finds himself tightly strapped onto a frigid, unforgiving metal bed. Both his arms and legs are bound with constricting leather restraints, severely limiting any potential movement. Nearby, Evan, with a heavy heart, takes a deep, resigned sigh and ultimately decides to abandon his efforts. Despite his presence, Evan remains utterly ignored by the bustling pledges of the Theta Chi fraternity. He resigns himself to sitting underneath the expansive branches of a tall, shadow-casting tree. While seated, he eagerly rifles through his aged and worn journal, intensely searching for the specific entry from a time when he was merely seven years old, during a visit to see Jason at the Sunnyvale institution. As a young, impressionable child of seven, Evan is suddenly swept up in a vivid memory of the very first encounter he had with his father, Jason. In a sudden and aggressive move, Jason throws himself forcefully across the table, the sound of shackles clanking ominously, and seizes young Evan by the throat. In a reflexive reaction, Evan's hands instinctively fly up to clutch his own neck, only to become aware a moment later of his true, present surroundings.\n\nEvan finds himself dining in the same diner where Kayleigh once worked. As he consumes his meal, his arm is positioned protectively in front of his plate, as if to safeguard his food from any unforeseen threat. Evan then makes his way up the driveway, which has become a neglected and dilapidated mess over time. Trash litters the untended front lawn, and the paint on the house is in a state of decay, peeling off the walls in strips. In a sudden, rapid blur of action, Evan grips Mr. Miller’s shirt with force and, with considerable violence, propels him through the house, slamming him hard against a wall. Mr. Miller goes limp, his eyes wide open, filled with sheer terror.\n\nAs Evan continues on his path, he notices a group of junkies. He steps over several unconscious bodies sprawled across the hallway of a particularly seedy motel. Approaching a door, he knocks on it, and Kayleigh responds. She has transformed drastically into a haggard, strung-out junkie, and the contempt she feels for Evan is immediately evident in her eyes. She warily glances around and gestures for him to come in. The room is in shambles and sparsely furnished, adorned only with charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil haphazardly scattered about. The sight causes his eyes to start watering. Kayleigh’s gaze shifts to Evan’s wallet; she opens it and leaves a twenty-dollar bill on the table with calculated indifference. Rising to her feet, she puts on her coat and flings his wallet dismissively over her shoulder in his direction, before leaving the room abruptly.\n\nEvan then makes his way into his familiar dorm room and is immediately greeted by the recognizable sounds of Thumper engaged in a sexual act with another naked, gothic co-ed on Evan’s own bed. A surge of anger ignites within Evan, prompting him to grab a chair and smash it forcefully against the wall just above Thumper’s head. Thumper and the co-ed, caught by surprise, hastily wrap themselves in available blankets and make a swift exit. Mrs. Halpern, caught off guard, regards the young kid with suspicion as she absentmindedly continues her path toward the mailbox. Lenny rushes across the street, intent on offering Evan some assistance, while Tommy, indifferent, shrugs and casually decides to follow along. Tommy charges at Mrs. Halpern with perhaps excessive force, resulting in both her and the baby hitting the pavement, though thankfully, no major injuries occur. With the situation seemingly under control, Evan cautiously retreats from the mail.\n\nSuddenly, a thunderous and deafening blast erupts, and Evan’s body is dramatically hurled backward with significant force. Evan regains consciousness back in his dorm room, noting that the very same posters still adorn the walls, and the sheets remain unchanged. As he yawns, instinctively bringing his hand to his mouth, he is shocked to realize that his hand is no longer there. We are then presented with countless, brief image flashes depicting Evan’s journey from the age of thirteen, illustrating his life as he navigates a world without arms."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lenny lies on a cold, hard metal bed, the kind that chills the skin, with his arms and legs securely bound in constricting leather restraints that dig into his flesh, preventing any movement. Evan lets out a weary sigh, a sound that signifies his resignation, and concedes defeat in whatever struggle he had been engaged in. Feeling despondent and unacknowledged, he settles himself heavily by a sturdy tree trunk, sifting through the pages of his journal with determined fingers until he locates the entry chronicling his visit to Sunnyvale at the tender age of seven. As the scene shifts, a much younger Evan suddenly becomes aware of his surroundings, finding himself at the moment of his initial encounter with his father, Jason. Jason, with a sudden and aggressive burst of energy, lunges across the room's table, despite the limitations of his shackles, and seizes Evan's throat with a fierce grip. In a reflexive reaction, Evan's hands fly up to his own throat as the shock of the situation dawns on him and he takes in his current environment. The setting changes to a diner, one that holds sentimental value as it was once Kayleigh's workplace, where Evan consumes his meal with an arm protectively curled around his plate, a defensive posture as if to shield his food. Evan then meanders slowly up a driveway that has fallen into disrepair, observing the sorry state of neglect with scattered garbage strewn across the lawn and peeling paint hanging off the house's frame like ancient bark. In a sudden, explosive motion, Evan grabs Mr. Miller by the shirt and forcefully propels him through the house, sending him crashing into a wall where Mr. Miller collapses, eyes wide with shock and terror. Continuing with purpose, Evan strides past a group of junkies, navigating over numerous unconscious bodies scattered along the filthy corridor of a run-down motel, before stopping to knock on a particular door. Kayleigh, now appearing worn and weary with the struggles of life, opens the door, her eyes quickly hardening with disdain upon seeing Evan. After casting a wary glance around, she motions for him to enter the squalid room, which is sparsely furnished, cluttered with the remnants of addiction, such as blackened spoons, discolored cotton balls, and pieces of tin foil speckled with brown spots. The stench of the room makes Evan's eyes water. Kayleigh, financially motivated, glances at Evan's wallet, removes a twenty-dollar bill, and leaves it on the table as a parting gesture. She rises, dons her coat, and nonchalantly tosses the wallet back to Evan, departing without a backward glance. Evan returns to his familiar dorm room, where the sounds of Thumper engaged in noisy intimacy with another gothic co-ed fill the space. A surge of anger courses through Evan as he lifts a chair and hurls it violently against the wall just above Thumper's head, causing Thumper and the co-ed to scramble for modesty beneath the blankets before hastily vacating the room. Outside, Mrs. Halpern is caught off guard as she continues her routine walk toward the mailbox, eyeing a young child with distrust. Lenny, eager to assist, dashes across the street toward Evan, with Tommy following suit, although Tommy's enthusiasm results in him tackling Mrs. Halpern and the baby more forcefully than intended, sending them to the ground without causing severe harm. Satisfied that the situation is under control, Evan steps back from the mailbox. Suddenly, an ear-splitting blast erupts, sending Evan's body flying backward in a dramatic arc. When he regains consciousness, he finds himself back in his dorm, noting the unchanged posters on the wall and the familiar sheets, as he yawns absentmindedly and brings a hand to his mouth, only to realize there is no hand. His mind is then bombarded with a rapid succession of images, depicting Evan's growth from the age of thirteen, each scene punctuated by the absence of arms, a poignant montage of his life."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lenny is secured to a metal bed with tight leather restraints. Evan, feeling ignored by the Theta Chi pledges, sits by a tree and searches his journal for an entry from when he visited his father, Jason, at Sunnyvale at age seven. During that visit, young Evan experiences a moment with his father, who, despite being shackled, attempts to grab Evan's throat, prompting Evan to touch his own throat before realizing his environment. Later, Evan dines where Kayleigh once worked, guarding his meal with his arm. He then walks up a neglected driveway, littered with garbage and peeling paint. In a fit of rage, he confronts Mr. Miller by shoving him into a wall, leaving Mr. Miller shocked. Evan proceeds through a seedy motel, stepping over bodies, and knocks on Kayleigh's door. As a haggard addict, she contemptuously lets him in, and after a brief exchange involving Evan’s wallet, she departs, leaving the room cluttered with drug paraphernalia. Returning to his dorm, Evan finds Thumper involved with a gothic co-ed and reacts by smashing a chair against the wall, prompting them to leave. Mrs. Halpern observes the commotion with skepticism as Lenny rushes to Evan, with Tommy following. In an overzealous attempt to help, Tommy accidentally sends Mrs. Halpern and her baby to the ground, though they remain unharmed. Evan retreats from the area as an explosion occurs, throwing him back. He regains consciousness in his dorm, surrounded by familiar sights but realizes he has no arms. A montage of Evan's life from age thirteen depicts him growing up without arms."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lenny is strapped onto a metal bed, reminiscent of those used in psychiatric facilities during the mid-20th century, with his arms and legs in tight leather restraints. Evan, his childhood friend, sighs and gives up. Evan is ignored by several Theta Chi pledges, a fraternity known for its elaborate initiation rituals, as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale, a renowned mental health institution. Seven-year-old Evan comes to during the time he first met his father, Jason. Jason, an imposing figure whose temper was well-documented in Sunnyvale's records, launches himself across the table, shackles and all, and grabs hold of Evan's throat. Evan's hands instinctively reach for his throat, then he realizes his surroundings. Evan eats in the same diner where Kayleigh, his high school sweetheart who later struggled with addiction, used to work. The diner, now a run-down relic of its former popularity, sees Evan protectively guarding his food with his arm in front of his plate. Evan slowly walks up the driveway to his childhood home, which is now a dilapidated mess, a stark contrast to its once well-maintained appearance. Garbage litters the front lawn and paint chips rot off the sides of the house. In a blur, Evan grabs Mr. Miller's shirt, Mr. Miller being a notorious figure in the neighborhood for his violent tendencies, and violently shoves him through the house and into a wall. Mr. Miller goes slack, his eyes wide with horror. Evan walks past some junkies, emblematic of the town's growing drug problem, and enters, stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. He knocks on a door, and Kayleigh, now a haggard, strung-out junkie barely resembling her former self, opens the door and immediately the contempt for Evan grows in her eyes. She looks around, waves him in. The room is dirty and sparse, excepting charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil, all indicators of her heroin use. His eyes begin to water. Kayleigh eyes the wallet, opens Evan's wallet, and leaves a twenty on the table. She gets up, puts on her coat, tosses his wallet over her shoulder at him, and leaves. Evan enters his familiar looking dorm and hears the familiar sounds of Thumper, his irreverent roommate known for his lack of boundaries, having sex with another naked gothic co-ed on Evan's bed. Evan's temper flares, and he picks up a chair and smashes it against a wall above Thumper's head. Thumper and the co-ed quickly cover themselves in the blankets and leave. Mrs. Halpern, a neighborhood busybody known for her nosy nature, startled, stares at the young kid skeptically as she absently continues toward the mailbox. Lenny comes running across the street to Evan's aid, and Tommy, a neighborhood troublemaker, shrugs and follows after him. Tommy takes a running dive at Mrs. Halpern, perhaps a bit too hard, and sends her and the baby to the pavement, hurt, but with no major injuries. Seeing things are safe, Evan backs away from the mail. The blast is deafening, and Evan's body is hurled backwards dramatically, echoing the violent events that seem to shadow his life. Evan comes to back in his dorm, the same posters are on the wall, the sheets are the same. Evan yawns, bringing his hand to his mouth, but there's no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms, a result of a tragic accident that shifted the course of his life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table Lenny is strapped onto a metal bed his arms and legs in tight leather restraints As he eats his arm sits in front of his plate protectively guarding his food Evan sighs and gives up Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale Sevenyearold Evan comes to during the time he first met his father Jason Jason launches himself across the table shackles and all and grabs hold of Evan's throat Evan's hands instinctively reach for his throat then he realizes his surroundings Evan eats in the same diner where Kayleigh used to work Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel As he eats his arm sits in front of his plate protectively guarding his food Evan slowly walks up the driveway which is now a dilapidated mess Garbage litters the front lawn and paint chips rot off the sides of the house dramatically Evan comes to back in his dorm In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall Sevenyearold Evan comes to during the time he first met his father Jason Mr Miller goes slack his eyes wide with horror Evan eats in the same diner where Kayleigh used to work Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale Evan sighs and gives up Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes She looks around waves him in The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil His eyes begin to water Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table Lenny is strapped onto a metal bed his arms and legs in tight leather restraints She gets up puts on her coat tosses his wallet over her shoulder at him and leaves Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head the sheets are the same Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head Thumper and the coed quickly cover themselves in the blankets and leave Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries Seeing things are safe Evan backs away from the mail The blast is deafening and Evan's body is hurled backwards dramatically Evan comes to back in his dorm the same posters are on the wall His eyes begin to water Jason launches himself across the table shackles and all and grabs hold of Evan's throat Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox the sheets are the same Evan yawns bringing his hand to his mouth but there is no hand We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms Evan yawns bringing his hand to his mouth but there is no hand We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Lenny is strapped onto a metal bed his arms and legs in tight leather restraints. Evan sighs and gives up. Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. Sevenyearold Evan comes to during the time he first met his father Jason. Jason launches himself across the table shackles and all and grabs hold of Evan's throat. Evan's hands instinctively reach for his throat. then he realizes his surroundings. Evan eats in the same diner where Kayleigh used to work. As he eats his arm sits in front of his plate protectively guarding his food. Evan slowly walks up the driveway which is now a dilapidated mess. Garbage litters the front lawn and paint chips rot off the sides of the house. In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall. Mr Miller goes slack his eyes wide with horror. Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes. She looks around waves him in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil. His eyes begin to water. Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table. She gets up puts on her coat tosses his wallet over her shoulder at him and leaves. Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed. Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head. Thumper and the coed quickly cover themselves in the blankets and leave. Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox. Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him. Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries. Seeing things are safe Evan backs away from the mail. The blast is deafening and Evan's body is hurled backwards. dramatically Evan comes to back in his dorm. the same posters are on the wall. the sheets are the same. Evan yawns bringing his hand to his mouth but there is no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Lenny is strapped onto a metal bed his arms and legs in tight leather restraints. Evan sighs and gives up. Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. Sevenyearold Evan comes to during the time he first met his father Jason. Jason launches himself across the table shackles and all and grabs hold of Evan's throat. Evan's hands instinctively reach for his throat. then he realizes his surroundings. Evan eats in the same diner where Kayleigh used to work. As he eats his arm sits in front of his plate protectively guarding his food. Evan slowly walks up the driveway which is now a dilapidated mess. Garbage litters the front lawn and paint chips rot off the sides of the house. In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall. Mr Miller goes slack his eyes wide with horror. Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes. She looks around waves him in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil. His eyes begin to water. Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table. She gets up puts on her coat tosses his wallet over her shoulder at him and leaves. Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed. Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head. Thumper and the coed quickly cover themselves in the blankets and leave. Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox. Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him. Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries. Seeing things are safe Evan backs away from the mail. The blast is deafening and Evan's body is hurled backwards. dramatically Evan comes to back in his dorm. the same posters are on the wall. the sheets are the same. Evan yawns bringing his hand to his mouth but there is no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Lenny is strapped onto a metal bed his arms and legs in tight leather restraints. Evan sighs and gives up. Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. Sevenyearold Evan comes to during the time he first met his father Jason. Jason launches himself across the table shackles and all and grabs hold of Evan's throat. Evan's hands instinctively reach for his throat. then he realizes his surroundings. Evan eats in the same diner where Kayleigh used to work. Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him. Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries. Seeing things are safe Evan backs away from the mail. The blast is deafening and Evan's body is hurled backwards. dramatically Evan comes to back in his dorm. the same posters are on the wall. the sheets are the same. Evan yawns bringing his hand to his mouth but there is no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Lenny is strapped onto a metal bed his arms and legs in tight leather restraints. Evan sighs and gives up. Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. the same posters are on the wall. the sheets are the same. Evan yawns bringing his hand to his mouth but there is no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Lenny is strapped onto a metal bed, his arms and legs in tight leather restraints. A giraffe sighs and gives up. The giraffe is ignored by several Theta Chi pledges as it plops itself by a tree and hunts through its journal to find the entry from when it was seven and visited a lion at Sunnyvale. Seven-year-old giraffe comes to during the time it first met its father, the lion. The lion launches itself across the table, shackles and all, and grabs hold of the giraffe's throat. The giraffe's hands instinctively reach for its throat, then it realizes its surroundings. The giraffe eats in the same diner where a penguin used to work. As it eats, its arm sits in front of its plate, protectively guarding its food. The giraffe slowly walks up the driveway, which is now a dilapidated mess. Garbage litters the front lawn and paint chips rot off the sides of the house. In a blur, the giraffe grabs a rabbit's shirt and violently shoves him through the house and into a wall. The rabbit goes slack, his eyes wide with horror. The giraffe walks past some junkies and enters, stepping over some passed out bodies that litter the hallway of an incredibly seedy motel. It knocks on a door, and a kangaroo, now a haggard, strung-out junkie, opens the door and immediately the contempt for the giraffe grows in her eyes. She looks around, waves it in. The room is dirty and sparse, excepting charred-bottom spoons, yellowed cotton balls, and brown-spotted squares of tin foil. Its eyes begin to water. The kangaroo eyes the wallet, opens the giraffe's wallet, and leaves a twenty on the table. She gets up, puts on her coat, tosses its wallet over her shoulder at it, and leaves. The giraffe enters its familiar looking dorm and hears the familiar sounds of a gorilla having sex with another naked gothic co-ed on the giraffe's bed. The giraffe's temper flares, and it picks up a chair and smashes it against a wall above the gorilla's head. The gorilla and the co-ed quickly cover themselves in the blankets and leave. A zebra, startled, stares at the young kid skeptically as she absently continues toward the mailbox. Lenny comes running across the street to the giraffe's aid, and a parrot shrugs and follows after him. The parrot takes a running dive at the zebra, perhaps a bit too hard, and sends her and the baby to the pavement, hurt, but with no major injuries. Seeing things are safe, the giraffe backs away from the mail. The blast is deafening, and the giraffe's body is hurled backwards dramatically. The giraffe comes to back in its dorm, the same posters are on the wall, the sheets are the same. The giraffe yawns, bringing its hand to its mouth, but there's no hand. We see countless and brief image flashes of the giraffe growing up from the age of thirteen with no arms."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Lenny is strapped onto a wooden bench, his arms and legs in tight rubber cuffs. Evan sighs and gives up. Evan is ignored by several Alpha Phi pledges as he plops himself by a statue and hunts through his sketchbook to find the drawing from when he was seven and visited Jason at Greenfield. Seven-year-old Evan comes to during the time he first met his uncle, Jason. Jason launches himself across the couch, chains and all, and grabs hold of Evan's wrist. Evan's hands instinctively reach for his wrist, then he realizes his surroundings. Evan eats in the same café where Kayleigh used to work. As he eats, his fork sits in front of his glass, protectively guarding his drink. Evan slowly walks up the pathway, which is now a rundown mess. Debris litters the front porch and shingles peel off the roof of the house. In a blur, Evan grabs Mr. Miller's jacket and violently shoves him through the garage and into a shelf. Mr. Miller goes slack, his eyes wide with horror. Evan walks past some drifters and enters, stepping over some passed out figures that litter the hallway of an incredibly seedy hostel. He knocks on a door, and Kayleigh, now a worn-out, strung-out drifter, opens the door and immediately the contempt for Evan grows in her eyes. She looks around, waves him in. The room is dusty and sparse, excepting burnt-out candles, stained napkins, and tarnished squares of aluminum. His eyes begin to water. Kayleigh eyes the purse, opens Evan's purse, and leaves a five on the chair. She gets up, puts on her scarf, tosses his purse over her shoulder at him, and leaves. Evan enters his familiar looking apartment and hears the familiar sounds of Thumper having sex with another naked punk co-ed on Evan's couch. Evan's temper flares, and he picks up a book and smashes it against a shelf above Thumper's head. Thumper and the co-ed quickly cover themselves in the curtains and leave. Mrs. Halpern, startled, stares at the young kid skeptically as she absently continues toward the garden. Lenny comes running across the field to Evan's aid, and Tommy shrugs and follows after him. Tommy takes a running dive at Mrs. Halpern, perhaps a bit too hard, and sends her and the stroller to the gravel, hurt, but with no major injuries. Seeing things are safe, Evan backs away from the flowers. The sound is deafening, and Evan's body is hurled backwards dramatically. Evan comes to back in his apartment, the same paintings are on the wall, the curtains are the same. Evan yawns, bringing his hand to his mouth, but there's no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen with no legs."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Lenny is seated on a metal bed, his arms and legs in loose leather restraints. Evan chuckles and packs up. Evan is observed by several Theta Chi pledges as he stretches himself by a tree and flips through his journal to find the entry from when he was seven and visited Jason at Sunnyvale. Seven-year-old Evan arrives during the time he first met his father, Jason. Jason glides himself across the table, shackles and all, and caresses Evan's cheek. Evan's hands instinctively adjust his collar, then he realizes his surroundings. Evan writes in the same diner where Kayleigh used to work. As he scribbles, his arm rests in front of his plate, loosely spanning his food. Evan quickly jogs up the driveway, which is now a vibrant garden. Flowers bloom on the front lawn and fresh paint shines off the sides of the house. In a blur, Evan taps Mr. Miller's shoulder and gently ushers him through the house and into a chair. Mr. Miller goes still, his eyes wide with curiosity. Evan strolls past some junkies and exits, stepping over some awake bodies that occupy the hallway of an incredibly seedy motel. He nods at a door, and Kayleigh, now a radiant, cheerful figure, opens the door and immediately the joy for Evan lights up her eyes. She glances around, gestures him in. The room is clean and vibrant, excepting polished silver spoons, fresh cotton balls, and sparkling squares of tin foil. His eyes begin to shine. Kayleigh finds the wallet, opens Evan's wallet, and places a twenty on the table. She stands up, puts on her hat, hands his wallet over to him, and leaves. Evan exits his familiar looking dorm and hears the familiar sounds of Thumper playing cards with another cheerful gothic co-ed on Evan's bed. Evan's temper calms, and he picks up a chair and places it against a wall above Thumper's head. Thumper and the co-ed quickly wrap themselves in the blankets and stay. Mrs. Halpern, curious, gazes at the young kid skeptically as she cheerfully continues toward the mailbox. Lenny strolls across the street to Evan's side, and Tommy grins and ambles after him. Tommy takes a gentle leap at Mrs. Halpern, perhaps a bit too soft, and eases her and the baby to the pavement, unscathed, but with no major injuries. Seeing things are peaceful, Evan approaches the mail. The sound is soothing, and Evan's body is elevated forwards gracefully. Evan comes to back in his dorm, the same posters are on the wall, the sheets are unchanged. Evan smiles, bringing his hand to his chin, but there's no hand. We see countless and brief image flashes of Evan growing up from the age of thirteen without sleeves."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Ricky is strapped onto a wooden bench, his knees and elbows in tight rubber chains. Oliver sighs and gives up. Oliver is ignored by several Beta Phi members as he plops himself by a fountain and hunts through his novel to find the passage from when he was nine and visited Marcus at Greenfield. Nine-year-old Oliver comes to during the time he first met his uncle, Marcus. Marcus launches himself across the sofa, cuffs and all, and grabs hold of Oliver's collar. Oliver's feet instinctively reach for his collar, then he realizes his surroundings. Oliver eats in the same café where Sandra used to work. As he eats, his elbow sits in front of his bowl, protectively guarding his meal. Oliver slowly walks up the pathway, which is now a dilapidated wreck. Trash litters the backyard and bricks rot off the sides of the barn. In a blur, Oliver grabs Mr. Johnson's jacket and violently shoves him through the barn and into a fence. Mr. Johnson goes limp, his eyes wide with fear. Oliver walks past some wanderers and enters, stepping over some passed-out figures that litter the corridor of an incredibly shabby inn. He knocks on a window, and Sandra, now a haggard, strung-out wanderer, opens the window and immediately the disdain for Oliver grows in her eyes. She looks around, waves him in. The room is grimy and sparse, excepting burnt-bottom forks, yellowed sponges, and brown-stained strips of aluminum. His eyes begin to water. Sandra eyes the purse, opens Oliver's purse, and leaves a ten on the chair. She gets up, puts on her hat, tosses his purse over her shoulder at him, and leaves. Oliver enters his familiar-looking flat and hears the familiar sounds of Baxter having tea with another naked gothic bandit on Oliver's sofa. Oliver's temper flares, and he picks up a lamp and smashes it against a ceiling above Baxter's head. Baxter and the bandit quickly cover themselves in the curtains and leave. Mrs. Sanders, startled, stares at the young girl skeptically as she absently continues toward the garden. Ricky comes running across the park to Oliver's aid, and Billy shrugs and follows after him. Billy takes a running dive at Mrs. Sanders, perhaps a bit too hard, and sends her and the kitten to the dirt, hurt, but with no major injuries. Seeing things are safe, Oliver backs away from the flowers. The burst is deafening, and Oliver's body is hurled backwards dramatically. Oliver comes to back in his flat, the same paintings are on the ceiling, the curtains are the same. Oliver yawns, bringing his foot to his mouth, but there's no foot. We see countless and brief image flashes of Oliver growing up from the age of fifteen with no legs."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lenny is perched on a wooden stool, his arms and legs in loose velvet bands. Evan laughs and presses on. Evan is applauded by several Theta Chi members as he lounges under a tree and peeks through his sketchbook to find the drawing from when he was seven and visited Jason at Sunnyvale. Seven-year-old Evan appears during the time he first met his uncle, Jason. Jason slides himself across the table, chains and all, and taps Evan's shoulder. Evan's hands reflexively move to his ears, then he realizes his surroundings. Evan lounges in the same diner where Kayleigh used to sing. As he lounges, his arm hovers in front of his plate, loosely circling his food. Evan briskly runs down the driveway, which is now a pristine path. Flowers line the front lawn and fresh paint glistens off the sides of the house. In a blur, Evan pats Mr. Miller's back and gently guides him through the house and into a chair. Mr. Miller goes quiet, his eyes wide with surprise. Evan skips past some hippies and exits, jumping over some resting bodies that line the hallway of an incredibly fancy hotel. He taps on a door, and Kayleigh, now a wealthy, polished executive, opens the door and instantly the admiration for Evan shines in her eyes. She glances around, invites him in. The room is opulent and decorated, filled with polished-bottom vases, pristine cotton linens, and golden-spotted squares of silk. His eyes begin to twinkle. Kayleigh eyes the briefcase, unzips Evan's briefcase, and places a hundred on the table. She stands up, buttons her coat, slides his briefcase over her shoulder at him, and stays. Evan enters his strange looking office and hears the unfamiliar sounds of Thumper discussing with another dressed gothic businessman on Evan's chair. Evan's mood calms, and he picks up a pen and writes on a notepad above Thumper's head. Thumper and the businessman quickly straighten their ties and stay. Mrs. Halpern, intrigued, stares at the young kid thoughtfully as she confidently continues toward the vehicle. Lenny comes strolling across the street to Evan's aid, and Tommy waves and follows after him. Tommy takes a leisurely step toward Mrs. Halpern, perhaps a bit too gently, and nudges her and the dog to the sidewalk, smiling, but with no major enthusiasm. Seeing things are cozy, Evan leans toward the car. The whisper is gentle, and Evan's body is pulled backwards calmly. Evan wakes up back in his office, the same paintings are on the wall, the desk is the same. Evan stretches, bringing his hand to his forehead, but there's no forehead. We see countless and brief image flashes of Evan growing up from the age of thirteen without legs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Lenny is reclined on a wooden bench, his arms and legs in loose cotton bindings. Evan yawns and moves on. Evan is overlooked by several Theta Chi pledges as he sinks himself by a bush and rummages through his notebook to locate the page from when he was seven and visited Jason at Moonlight. Seven-year-old Evan arrives during the moment he first encountered his father, Jason. Jason vaults over the couch, links and all, and clasps Evan's wrist. Evan's hands instinctively reach for his chest, then he becomes aware of his surroundings. Evan reads in the same bookstore where Kayleigh used to shop. As he reads, his elbow rests in front of his book, protectively guarding his space. Evan casually strolls up the driveway, which is now a neglected path. Debris covers the front yard and paint peels crumble off the edges of the house. In a rush, Evan snatches Mr. Miller's jacket and swiftly pulls him through the house and into a chair. Mr. Miller goes limp, his eyes wide with surprise. Evan wanders past some loiterers and steps in, maneuvering over some collapsed figures that fill the corridor of a remarkably shabby hostel. He taps on a door, and Kayleigh, now a weary, strung-out wanderer, opens the door and instantly the disdain for Evan sharpens in her eyes. She glances around, gestures him to enter. The room is grimy and sparse, except for burnt-edged napkins, discolored cotton swabs, and stained squares of cardboard. His eyes begin to blink rapidly. Kayleigh eyes the notebook, opens Evan's notebook, and places a note on the table. She stands, puts on her hat, flicks his notebook over her shoulder at him, and exits. Evan walks into his familiar looking apartment and hears the familiar sounds of Thumper playing cards with another uncovered gothic co-ed on Evan's bed. Evan's frustration flashes, and he picks up a lamp and hurls it against a wall above Thumper's head. Thumper and the co-ed quickly wrap themselves in the duvets and escape. Mrs. Halpern, confused, gazes at the young kid skeptically as she absentmindedly continues toward the garden. Lenny comes jogging across the street to Evan's support, and Tommy shrugs and trails after him. Tommy takes a running leap at Mrs. Halpern, perhaps a bit too hard, and sends her and the shopping bags to the ground, surprised, but with no significant harm. Seeing things are secure, Evan retreats from the garden. The burst is overwhelming, and Evan's body is flung forwards theatrically. Evan comes to back in his apartment, the same paintings are on the wall, the pillows are the same. Evan stretches, bringing his hand to his forehead, but there's no hand. We witness numerous and fleeting image flashes of Evan maturing from the age of thirteen with no legs."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Quincy is perched on a wooden bench, his feet and hands in loose silk bindings. Charlie chuckles and walks away. Charlie is watched by numerous Beta Zeta recruits as he plants himself by a bush and searches through his diary to locate the note from when he was nine and met Gerald at Springview. Nine-year-old Charlie awakens during the moment he first encountered his uncle, Gerald. Gerald propels himself over the counter, ropes and all, and seizes Charlie's arm. Charlie's feet automatically move toward his head, then he comprehends his location. Charlie dozes in the same café where Morgan used to dance. As he listens, his foot rests beneath his cup, cautiously shielding his drink. Charlie quickly crawls up the stairway, which is now a polished masterpiece. Decorations adorn the back patio and decorations gleam off the edges of the garage. In a flash, Charlie yanks Mr. Smith's jacket and gently pulls him down the street and onto a bench. Mr. Smith stands still, his mouth wide with surprise. Charlie skips past some tourists and exits, tripping over some sleeping dogs that fill the corridor of a remarkably clean hotel. He taps on a window, and Morgan, now a weary, exhausted traveler, slides the window open and instantly the disdain for Charlie shows in her gaze. She glances around, beckons him outside. The yard is lush and vibrant, excluding shiny designer vases, pristine glass beads, and spotless squares of mirror. His smile begins to fade. Morgan watches the watch, closes Charlie's watch, and drops a coin by the gate. She stands up, slides off her hat, rolls his watch under her foot toward him, and stays. Charlie leaves his peculiar hearing office and feels the odd whispers of Hopper writing essays with another laughing cheerful student on Charlie's floor. Charlie's patience snaps, and he picks up a plant and tosses it against a door above Hopper's chair. Hopper and the student quickly hide themselves in the curtains and stay. Mr. Carter, concerned, glances at the old man eagerly as she carefully stops beside the doorway. Quincy strolls skipping down the hill to Charlie's side, and Sam grins and proceeds before him. Sam takes a gentle leap at Mr. Carter, perhaps a bit too softly, and lifts him and the toddler to the rooftop, amazed, but with significant joy. Knowing things are sure, Charlie leans toward the book. The silence is calming, and Charlie's mind is carried upwards quietly. Charlie dozes off back in his office, the same drawings are on the door, the doors are the same. Charlie blinks, bringing his nose to his shoulder, but there's no shoulder. We observe endless and slow sound memories of Charlie advancing from the age of sixteen with no hair."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Evan navigates a troubled life, haunted by a violent encounter with his father, Jason, and struggling with his past. After an incident where Jason attacks him during a childhood visit, Evan recalls these memories while at a diner reminiscent of when Kayleigh worked there, and revisits a rundown house, where he aggressively confronts Mr. Miller. Seeking Kayleigh, now a drug-addicted shell of her former self, he finds her in a squalid hotel room, where she callously takes money from his wallet. Disturbed, Evan returns to his dorm, discovering Thumper engaged with another girl on his bed, prompting a furious outburst. Later, a chaotic scene unfolds with Lenny’s and Tommy’s actions leading to Mrs. Halpern and a baby falling but unharmed. A sudden explosion throws Evan back, awakening him to find himself once more in his dorm, unchanged except for the haunting reality of growing up without arms."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms Evan yawns bringing his hand to his mouth but there is no hand the sheets are the same the same posters are on the wall dramatically Evan comes to back in his dorm The blast is deafening and Evan's body is hurled backwards Seeing things are safe Evan backs away from the mail Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox Thumper and the coed quickly cover themselves in the blankets and leave Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed She gets up puts on her coat tosses his wallet over her shoulder at him and leaves Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table His eyes begin to water The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil She looks around waves him in He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel Mr Miller goes slack his eyes wide with horror In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall Garbage litters the front lawn and paint chips rot off the sides of the house Evan slowly walks up the driveway which is now a dilapidated mess As he eats his arm sits in front of his plate protectively guarding his food Evan eats in the same diner where Kayleigh used to work then he realizes his surroundings Evan's hands instinctively reach for his throat Jason launches himself across the table shackles and all and grabs hold of Evan's throat Sevenyearold Evan comes to during the time he first met his father Jason Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale Evan sighs and gives up Lenny is strapped onto a metal bed his arms and legs in tight leather restraints"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The blast is deafening and Evan's body is hurled backwards Evan's hands instinctively reach for his throat In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil Seeing things are safe Evan backs away from the mail Mr Miller goes slack his eyes wide with horror Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed She looks around waves him in Garbage litters the front lawn and paint chips rot off the sides of the house He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes She gets up puts on her coat tosses his wallet over her shoulder at him and leaves Thumper and the coed quickly cover themselves in the blankets and leave Evan slowly walks up the driveway which is now a dilapidated mess the same posters are on the wall Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him then he realizes his surroundings Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries Lenny is strapped onto a metal bed his arms and legs in tight leather restraints Evan yawns bringing his hand to his mouth but there is no hand Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale His eyes begin to water Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head Sevenyearold Evan comes to during the time he first met his father Jason the sheets are the same Jason launches himself across the table shackles and all and grabs hold of Evan's throat dramatically Evan comes to back in his dorm We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms As he eats his arm sits in front of his plate protectively guarding his food Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox Evan sighs and gives up Evan eats in the same diner where Kayleigh used to work"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His eyes begin to water Kayleigh eyes the wallet opens Evan's wallet and leaves a twenty on the table She gets up puts on her coat tosses his wallet over her shoulder at him and leaves Evan enters his familiar looking dorm and hears the familiar sounds of Thumper having sex with another naked gothic coed on Evan's bed Evan's temper flares and he picks up a chair and smashes it against a wall above Thumper's head Thumper and the coed quickly cover themselves in the blankets and leave Mrs Halpern startled stares at the young kid skeptically as she absently continues toward the mailbox Lenny comes running across the street to Evan's aid and Tommy shrugs and follows after him Tommy takes a running dive at Mrs Halpern perhaps a bit too hard and sends her and the baby to the pavement hurt but with no major injuries Seeing things are safe Evan backs away from the mail The blast is deafening and Evan's body is hurled backwards dramatically Evan comes to back in his dorm the same posters are on the wall the sheets are the same Evan yawns bringing his hand to his mouth but there is no hand We see countless and brief image flashes of Evan growing up from the age of thirteen with no arms Lenny is strapped onto a metal bed his arms and legs in tight leather restraints Evan sighs and gives up Evan is ignored by several Theta Chi pledges as he plops himself by a tree and hunts through his journal to find the entry from when he was seven and visited Jason at Sunnyvale Sevenyearold Evan comes to during the time he first met his father Jason Jason launches himself across the table shackles and all and grabs hold of Evan's throat Evan's hands instinctively reach for his throat then he realizes his surroundings Evan eats in the same diner where Kayleigh used to work As he eats his arm sits in front of his plate protectively guarding his food Evan slowly walks up the driveway which is now a dilapidated mess Garbage litters the front lawn and paint chips rot off the sides of the house In a blur Evan grabs Mr Miller's shirt and violently shoves him through the house and into a wall Mr Miller goes slack his eyes wide with horror Evan walks past some junkies and enters stepping over some passed out bodies that litter the hallway of an incredibly seedy motel He knocks on a door and Kayleigh now a haggard strungout junkie opens the door and immediately the contempt for Evan grows in her eyes She looks around waves him in The room is dirty and sparse excepting charredbottom spoons yellowed cotton balls and brownspotted squares of tin foil"
        }
      ]
    }
  ]
}