{
  "ground_truth": "He nods approval to Abdul, then a German appears in the doorway. Abdul starts to close the door on the man, who tries to push his way through as Rick walks up. Rick looks at the German calmly, takes the card out of his hand, and tears it up. At this moment, Ugarte, a small, thin man with a nervous air, tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The German storms off, tossing the pieces of his card into the air behind him. Rick meets Ugarte on his way back to his table. If he were an American, Ugarte would look like a tout. Fearing to offend Rick, Ugarte laughs, then pulls out a chair at Rick's table and sits down. A waiter comes up to the table with a tray of drinks, placing one before Ugarte. He takes an envelope from his pocket and lays it on the table. Rick appears ready to take them from Ugarte, and he does so. Ugarte leaves the table just as the waiter comes up, starts across the floor, but stops as Rick comes up to him. Ugarte hesitates for a moment, while Rick looks at Ugarte steadily. Rick leaves the gambling room and goes into the main room, which is in semi-darkness. During one of the periods when the spotlight is on the orchestra, Rick slips the letters of transit into the piano. Ferrari, owner of the Blue Parrot, a competing nightspot, comes into the cafe, sits down, and watches Sam, then sees Rick and they smile at each other. At the end of the number, Ferrari goes to the bar to speak to Rick, and they walk over to the piano. Apparently satisfied, Ferrari walks away. Back at the bar, Yvonne, an attractive young French woman, sits on a stool drinking brandy, as Sacha, who looks at her with lovesick eyes, fills her tumbler. Rick saunters over and leans on the bar next to Yvonne, who has never taken her eyes off him. Rick looks the check over, tears it up, and pays no attention to her. Yvonne turns, looks at Sacha, and extends her glass to him, then looks at him bitterly without saying a word. Yvonne wheels on Rick with drunken fury. Sacha stands at the curb on the street in front of Rick's and signals for a cab, pulling her along toward the door. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace, watching this evening's performance. Rick walks over to him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He nods endorsement to Abdul, then a German materializes in the entrance. Abdul begins to shut the portal on the gentleman, who attempts to shove his route through as Rick strolls up. Rick observes the German serenely, extracts the card from his hand, and shreds it. At this instant, Ugarte, a compact, slender man with a jittery demeanor, attempts to wedge through the entranceway obstructed by the German. He gets through and passes Rick. The German storms off, flinging the fragments of his card into the atmosphere behind him. Rick encounters Ugarte on his way back to his table. If he were an American, Ugarte would resemble a tout. Apprehensive of affronting Rick, Ugarte chuckles, then pulls out a chair at Rick's table and sits down. A waiter approaches the table with a platter of beverages, setting one before Ugarte. He retrieves an envelope from his pocket and places it on the table. Rick seems prepared to take them from Ugarte, and he does so. Ugarte vacates the table just as the waiter arrives, starts across the floor, but pauses as Rick approaches him. Ugarte hesitates for a moment, while Rick regards Ugarte intently. Rick exits the gambling room and proceeds into the main room, which is in partial darkness. During one of the times when the spotlight is on the orchestra, Rick slips the letters of passage into the piano. Ferrari, proprietor of the Blue Parrot, a rival nightspot, enters the cafe, sits down, and observes Sam, then notices Rick, and they grin at each other. At the conclusion of the number, Ferrari heads to the bar to converse with Rick, and they walk over to the piano. Apparently content, Ferrari departs. Back at the bar, Yvonne, an alluring young French woman, perches on a stool sipping brandy, as Sacha, who regards her with lovesick eyes, fills her glass. Rick strolls over and leans on the bar next to Yvonne, who has never diverted her eyes from him. Rick inspects the bill, tears it up, and disregards her. Yvonne turns, looks at Sacha, and extends her tumbler to him, then gazes at him bitterly without uttering a word. Yvonne pivots on Rick with intoxicated rage. Sacha stands at the curb on the street in front of Rick's and beckons for a cab, tugging her along toward the door. Rick and Yvonne approach the waiting cab. Rick stands and gazes up at the spinning beacon light from the airport as Renault sits at a table on the cafe terrace, observing this evening's performance. Rick strolls over to him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Approval is nodded to Abdul by him, then a German appears in the doorway. The door is started to be closed by Abdul on the man, who tries to push his way through as Rick walks up. The German is looked at calmly by Rick, who takes the card out of his hand and tears it up. At this moment, Ugarte, a small, thin man with a nervous air, tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The pieces of his card are tossed into the air behind him by the German as he storms off. Rick meets Ugarte on his way back to his table. If he were an American, a tout would be what Ugarte looked like. Fearing to offend Rick, a laugh is let out by Ugarte, then a chair at Rick's table is pulled out by him, and he sits down. A waiter comes up to the table with a tray of drinks, placing one before Ugarte. An envelope is taken from his pocket by him and laid on the table. Rick appears ready to take them from Ugarte, and the action is carried out by him. The table is left by Ugarte just as the waiter comes up. He starts across the floor, but he stops as Rick comes up to him. For a moment, Ugarte hesitates while Rick looks at him steadily. The gambling room is left by Rick, and he goes into the main room, which is in semi-darkness. During one of the periods when the spotlight is on the orchestra, the letters of transit are slipped into the piano by Rick. Ferrari, owner of the Blue Parrot, a competing nightspot, comes into the cafe, sits down, and watches Sam, then sees Rick, and they smile at each other. At the end of the number, Rick is gone to by Ferrari at the bar to speak to him, and they walk over to the piano. Apparently satisfied, a walk away is taken by Ferrari. Back at the bar, Yvonne, an attractive young French woman, sits on a stool drinking brandy, as Sacha, who looks at her with lovesick eyes, fills her tumbler. The bar is sauntered over to by Rick, and he leans on it next to Yvonne, who has never taken her eyes off him. The check is looked over by Rick, torn up, and no attention is paid to her. Yvonne turns, looks at Sacha, and extends her glass to him, then looks at him bitterly without saying a word. With drunken fury, Yvonne wheels on Rick. The curb on the street in front of Rick's is stood at by Sacha, who signals for a cab, pulling her along toward the door. The waiting cab is approached by Rick and Yvonne. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace, watching this evening's performance. He walks over to Renault."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He nods approval to Abdul as a German appears. Abdul tries to shut the door, but the man pushes in; Rick intervenes, calmly tearing up the German's card. Ugarte, a small, nervous man, squeezes past the German and approaches Rick. The German storms off, tossing card pieces. Ugarte meets Rick, laughs nervously, and sits at Rick's table, where a waiter brings drinks. Ugarte places an envelope on the table, which Rick takes. As Rick leaves, he and Ugarte exchange a look. Rick goes to the dim main room, slipping letters of transit into the piano during a spotlight on the orchestra. Ferrari, owner of a rival nightspot, arrives, smiles at Rick, and they chat by the piano. Satisfied, Ferrari leaves. Yvonne, a young French woman, drinks at the bar watched by lovestruck Sacha. Rick, indifferent to Yvonne, tears up a check and moves on. Yvonne, furious, turns to Sacha, who signals a cab and guides her to the door. Rick and Yvonne approach the cab as Rick gazes at the airport light. Renault observes from the terrace, and Rick joins him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He nods approval to Abdul as a German appears. Abdul tries closing the door, but the German pushes through until Rick calmly tears up his card. Ugarte, a nervous man, squeezes past the German, who storms off angrily. Ugarte joins Rick, fearing offense, and sits at his table. A waiter brings drinks, and Ugarte hands Rick an envelope. Rick takes it, and Ugarte leaves as Rick exits to the dim main room. During an orchestra spotlight, Rick hides letters of transit in the piano. Ferrari, owner of the rival Blue Parrot, enters, smiles at Rick, and they chat by the piano. Satisfied, Ferrari leaves. Yvonne, drinking brandy, watches Rick, who tears up a check, ignoring her. Yvonne looks bitterly at Sacha and angrily at Rick; Sacha signals a cab. Rick accompanies Yvonne to the cab, glancing at the airport beacon, as Renault observes from the terrace. Rick approaches him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He nods with a clear sign of approval to Abdul, and then, unexpectedly, a German individual makes his presence known by appearing in the doorway. As soon as the German steps into view, Abdul instinctively moves to close the door on him. The German, however, attempts to force his way through the narrowing gap just as Rick strides up to the scene. With a demeanor of calmness and composure, Rick fixes his gaze on the German, reaches out to take the card from his hand, and without hesitation, tears it into pieces. \n\nAt this very moment, Ugarte, a diminutive man with a slender build and an aura of nervous energy, tries to maneuver his way through the doorway, which is still obstructed by the German. Ugarte somehow manages to squeeze through and hurriedly passes by Rick. Meanwhile, the German, visibly upset, storms off, flinging the remnants of his card into the air in a gesture of frustration as he departs. Rick then encounters Ugarte once more as he is returning to his own table. If Ugarte were an American, he would give off the impression of being a tout. Not wishing to cause any offense to Rick, Ugarte lets out a nervous laugh, pulls out a chair at Rick's table, and sits himself down.\n\nA waiter approaches their table carrying a tray laden with drinks, placing one in front of Ugarte. With a sense of urgency, Ugarte retrieves an envelope from his pocket and lays it on the table's surface. Rick seems prepared to take possession of the envelope from Ugarte, and he indeed does so. After this brief exchange, Ugarte leaves the table right as the waiter arrives, begins to make his way across the floor, but halts as Rick approaches him. Ugarte hesitates momentarily, while Rick maintains a steady, unwavering gaze upon him. Rick exits the bustling gambling room and enters the main room, which is enveloped in a semi-darkness that creates an intimate atmosphere. \n\nDuring one of the orchestrated periods when the spotlight illuminates the orchestra, Rick deftly slips the critical letters of transit into the piano for safekeeping. At this moment, Ferrari, the owner of the Blue Parrot—a rival nightspot—enters the cafe, takes a seat, and watches Sam perform with interest. Upon noticing Rick, Ferrari and Rick exchange a friendly smile. As the musical number concludes, Ferrari makes his way to the bar to engage in conversation with Rick, and together they stroll over to the piano. Seemingly satisfied with the interaction, Ferrari eventually walks away.\n\nBack at the bar, Yvonne, a young and attractive French woman, is perched on a stool, sipping brandy. Sacha, who gazes at her with lovesick eyes, fills her tumbler. With a sense of ease, Rick saunters over to the bar and casually leans next to Yvonne, who has remained fixated on him. Rick nonchalantly inspects the check, tears it up, and continues to ignore her presence. Yvonne, feeling scorned, turns her gaze to Sacha, extending her glass for a refill, then looks at him bitterly without uttering a single word. Overcome with drunken fury, Yvonne directs her wrath toward Rick. \n\nSacha, standing at the curb on the bustling street in front of Rick's establishment, raises his hand to signal for a cab while gently pulling Yvonne along toward the entrance. Together, Rick and Yvonne approach the waiting cab. While standing, Rick takes a moment to look up at the revolving beacon light emanating from the nearby airport as Renault sits at a table on the cafe terrace, observing the evening's unfolding events with interest. Rick, taking purposeful steps, walks over to Renault to join him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He gives a nod, which is a clear and unmistakable sign of approval, directed toward Abdul. Suddenly and unexpectedly, a German individual announces his presence by appearing prominently in the doorway. As soon as the German steps into view, Abdul instinctively and without delay moves to close the door on him. Nevertheless, the German attempts to force his way through the increasingly narrowing gap just as Rick strides confidently up to the unfolding scene. With a demeanor marked by calmness and composure, Rick fixes his gaze intently on the German. He reaches out with purpose to take the card from the German’s hand, and without a moment's hesitation, tears it into pieces.\n\nAt this very moment, Ugarte, a diminutive man with a notably slender build and an aura filled with nervous energy, tries to maneuver his way through the doorway, which remains obstructed by the German's presence. Ugarte somehow manages, with some difficulty, to squeeze his way through and hurriedly passes by Rick. Meanwhile, the German, visibly upset and exasperated, storms off in a huff, flinging the shredded remnants of his card into the air in a dramatic gesture of frustration as he departs. Rick soon encounters Ugarte once more as he makes his way back to his own table. If Ugarte were to be an American, he would likely give off the impression of being a tout. Not wishing to cause any offense or upset Rick, Ugarte lets out a nervous, somewhat awkward laugh, pulls out a chair at Rick’s table, and sits himself down with a sense of trepidation.\n\nA waiter approaches their table, carrying a tray laden with a variety of drinks, and places one specifically in front of Ugarte. With a sense of urgency that cannot be denied, Ugarte retrieves an envelope from his pocket and lays it down on the table’s surface in front of Rick. Rick appears ready and prepared to take possession of the envelope from Ugarte, and he indeed does so. After this brief but significant exchange, Ugarte leaves the table just as the waiter arrives, begins to navigate his way across the floor, but halts as Rick approaches him with a steady gait. Ugarte hesitates for a brief moment, while Rick maintains a steady, unwavering gaze upon him. Rick exits the bustling gambling room and steps into the main room, which is enveloped in a semi-darkness that creates a uniquely intimate atmosphere.\n\nDuring one of the orchestrated periods when the spotlight comes to life and illuminates the orchestra, Rick deftly and with great care slips the critical letters of transit into the piano for safekeeping. It is at this moment that Ferrari, the owner of the Blue Parrot—a rival and well-known nightspot—enters the cafe, takes a seat, and watches Sam perform with evident interest. Upon noticing Rick, Ferrari and Rick exchange a friendly and acknowledging smile. As the musical number concludes, Ferrari makes his way casually to the bar to engage in a conversation with Rick, and together they stroll over to the piano. Seemingly satisfied with the interaction, Ferrari eventually walks away.\n\nBack at the bar, Yvonne, a young and attractive French woman, is perched gracefully on a stool, sipping delicately on her brandy. Sacha, who gazes at her with lovesick eyes filled with admiration, dutifully fills her tumbler. With a sense of ease and casual confidence, Rick saunters over to the bar and casually leans next to Yvonne, who has remained fixated on him throughout. Rick nonchalantly inspects the check, tears it up with a dismissive gesture, and continues to ignore her presence entirely. Yvonne, feeling scorned and somewhat humiliated, turns her gaze to Sacha, extending her glass for a much-needed refill, then looks at him bitterly without uttering a single word. Overcome with drunken fury and resentment, Yvonne directs her wrath and frustration toward Rick.\n\nSacha, standing at the curb on the bustling and lively street in front of Rick’s establishment, raises his hand to signal for a cab, while gently and carefully pulling Yvonne along toward the entrance. Together, Rick and Yvonne approach the waiting cab under the dim glow of the city lights. While standing there, Rick takes a moment to look up at the revolving beacon light that is emanating from the nearby airport as Renault sits at a table on the cafe terrace, observing the evening's unfolding events with keen interest. Rick, taking purposeful and deliberate steps, walks over to Renault to join him as the night continues."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He gives a nod of approval to Abdul, signaling his satisfaction with a slight inclination of his head, then turns his attention to the doorway where a German man suddenly appears. Abdul, noticing the German's presence, begins to close the door on him, creating a barrier that the German attempts to overcome by pushing his way in just as Rick approaches the scene. With a composed demeanor, Rick calmly meets the German's eyes, takes hold of the card that the German is extending, and proceeds to methodically tear it into pieces. At this point, Ugarte, a man of small stature and thin build, exuding a nervous energy, tries to maneuver himself through the doorway obstructed by the German's presence. With some effort, he manages to squeeze past the German and continues his path, brushing past Rick. In a display of frustration, the German storms off, flinging the torn pieces of his card into the air behind him in a gesture of irritation. Rick, unfazed, continues his movement through the room, and soon encounters Ugarte on his return to his table. If transplanted into an American context, Ugarte’s appearance might suggest that of a tout. Eager not to upset Rick, he lets out a nervous laugh before pulling out a chair at Rick's table and settling into it. A waiter approaches, balancing a tray laden with drinks, and places one in front of Ugarte, who retrieves an envelope from his pocket and places it on the tabletop. Rick appears poised to accept this offering, and indeed does so, taking the envelope from Ugarte. As if on cue, Ugarte makes his exit from the table right as the waiter arrives, proceeds across the floor, but hesitates when Rick approaches him, pausing momentarily as Rick fixes a steady gaze upon him. Rick then departs the bustling gambling room and transitions into the main room, which is enveloped in a semi-dark ambiance. Seizing a moment when the spotlight briefly illuminates the orchestra, Rick discreetly slips the letters of transit into the piano, ensuring they are hidden. Ferrari, the proprietor of the Blue Parrot—a rival establishment—enters the cafe, takes a seat, and directs his attention toward Sam, observing him, before his gaze shifts to Rick, and they exchange mutual smiles. Following the conclusion of the orchestra's number, Ferrari makes his way to the bar to converse with Rick, and together, they stroll over to the piano. Evidently satisfied with their interaction, Ferrari departs. Back at the bar, Yvonne, a striking young French woman, occupies a stool while drinking brandy, as Sacha, casting lovesick glances her way, tends to her tumbler, filling it as necessary. Rick casually approaches and leans against the bar beside Yvonne, who has kept her unwavering gaze on him. Rick meticulously examines the check, then dismissively tears it up, diverting no attention her way. Yvonne, feeling slighted, turns toward Sacha, extending her glass for a refill and then looks at him with a bitter expression, her silence speaking volumes. In a sudden burst of anger, Yvonne turns on Rick, her drunken rage evident. Meanwhile, Sacha positions himself at the street curb in front of Rick's establishment, signaling for a cab, and gently pulls Yvonne along toward the exit. Rick and Yvonne make their way to the waiting cab. As they stand beside it, Rick takes a moment to look up, observing the revolving beacon light emanating from the airport. Simultaneously, Renault, seated at a table on the cafe terrace, takes in the evening's unfolding events with a watchful eye. Rick then strolls over to join him, ready to engage in conversation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rick nods approval to Abdul as a German appears in the doorway. Abdul starts to close the door on the man, who tries to push through, but Rick intervenes calmly by taking and tearing up the German's card. Ugarte, a small, nervous man, squeezes past the German and Rick, heading to Rick's table. The German storms off, discarding the card pieces. Ugarte joins Rick at his table, nervously taking a seat after a laugh, and hands over an envelope as a waiter serves drinks. Rick accepts the envelope, and Ugarte leaves. Rick moves to the main room, where during an orchestra spotlight, he discreetly hides the letters of transit in the piano. Ferrari, owner of the rival Blue Parrot, enters the cafe, exchanges smiles with Rick, and after watching Sam, converses with Rick by the piano, then departs. At the bar, Yvonne, a young French woman, drinks brandy while being watched by a lovesick Sacha. Rick approaches, checks, and tears up her bill, ignoring her. Yvonne, showing drunken resentment, turns to Sacha, who signals for a cab and escorts her outside. As Rick and Yvonne reach the waiting cab, Rick glances at the airport's revolving beacon light, then joins Renault at a terrace table to observe the evening's happenings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He nods approval to Abdul, who recently started working at Rick's Café Américain after moving from Morocco, then a German appears in the doorway. Abdul starts to close the door on the man, a frequent visitor known for causing trouble, who tries to push his way through as Rick walks up. Rick, owner of the popular nightspot Rick's Café Américain in Casablanca, looks at the German calmly, takes the card out of his hand, and tears it up, a common practice for those Rick deems undesirable. At this moment, Ugarte, a small, thin man with a nervous air and a reputation for dealing in black market goods, tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The German, known to complain about his treatment, storms off, tossing the pieces of his card into the air behind him. Rick meets Ugarte on his way back to his table. If he were an American, Ugarte would look like a tout because of his shifty demeanor and quick business dealings. Fearing to offend Rick, Ugarte laughs nervously, then pulls out a chair at Rick's table and sits down. A waiter, a longtime employee familiar with the café's regulars, comes up to the table with a tray of drinks, placing one before Ugarte. He takes an envelope, containing highly sought-after letters of transit that allow safe passage out of Casablanca, from his pocket and lays it on the table. Rick, who has been searching for such letters, appears ready to take them from Ugarte, and he does so. Ugarte leaves the table just as the waiter comes up, starts across the floor, but stops as Rick comes up to him. Ugarte hesitates for a moment, aware of the danger he faces with these documents, while Rick looks at Ugarte steadily. Rick leaves the gambling room where high-stakes games are a nightly feature and goes into the main room, which is in semi-darkness. During one of the periods when the spotlight is on the orchestra, Rick discreetly slips the letters of transit into the piano, a favorite hiding spot known only to Sam, his trusted pianist. Ferrari, owner of the Blue Parrot, a competing nightspot known for its exotic ambiance, comes into the café, sits down, and watches Sam play with his usual flair, then sees Rick and they smile at each other, acknowledging their business rivalry. At the end of the number, Ferrari goes to the bar to speak to Rick, and they walk over to the piano discussing recent events. Apparently satisfied with Rick's assurances, Ferrari walks away. Back at the bar, Yvonne, an attractive young French woman known for her tumultuous relationship with Rick, sits on a stool drinking brandy, as Sacha, who looks at her with lovesick eyes, fills her tumbler. Rick saunters over and leans on the bar next to Yvonne, who has never taken her eyes off him, hoping for a rekindling of their past romance. Rick looks the check over, dismisses it by tearing it up, and pays no attention to her despite her clear distress. Yvonne turns, looks at Sacha, and extends her glass to him, then looks at him bitterly without saying a word, conveying her sense of betrayal. Yvonne wheels on Rick with drunken fury. Sacha, a loyal employee who often handles rowdy patrons, stands at the curb on the street in front of Rick's and signals for a cab, pulling her along toward the door to avoid a scene. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport, a symbol of hope and escape for many, as Renault, the local police captain with a keen interest in Rick's activities, sits at a table on the café terrace, watching this evening's performance unfold. Rick walks over to him, ready for the usual banter and negotiation."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance He nods approval to Abdul then a German appears in the doorway He nods approval to Abdul then a German appears in the doorway Abdul starts to close the door on the man who tries to push his way through as Rick walks up Rick looks at the German calmly takes the card out of his hand and tears it up At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German He gets through and passes Rick The German storms off tossing the pieces of his card into the air behind him Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler Rick and Yvonne approach the waiting cab At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German Sam then sees Rick and they smile at each other Rick meets Ugarte on his way back to his table Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches If he were an American Ugarte would look like a tout Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word A waiter comes up to the table with a tray of drinks placing one before Ugarte If he were an American Ugarte would look like a tout Abdul starts to close the door on the man who tries to push his way through as Rick walks up He takes an envelope from his pocket and lays it on the table Rick appears ready to take them from Ugarte and he does so He gets through and passes Rick Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him Ugarte hesitates for a moment while Rick looks at Ugarte steadily Ugarte hesitates for a moment while Rick looks at Ugarte steadily Rick leaves the gambling room and goes into the main room which is in semidarkness During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches Sam then sees Rick and they smile at each other At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano Rick looks at the German calmly takes the card out of his hand and tears it up Apparently satisfied Ferrari walks away Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door Rick looks the check over tears it up and pays no attention to her Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word Yvonne wheels on Rick with drunken fury Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door Rick and Yvonne approach the waiting cab Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance Rick walks over to him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He nods approval to Abdul then a German appears in the doorway. Abdul starts to close the door on the man who tries to push his way through as Rick walks up. Rick looks at the German calmly takes the card out of his hand and tears it up. At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The German storms off tossing the pieces of his card into the air behind him. Rick meets Ugarte on his way back to his table. If he were an American Ugarte would look like a tout. Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down. A waiter comes up to the table with a tray of drinks placing one before Ugarte. He takes an envelope from his pocket and lays it on the table. Rick appears ready to take them from Ugarte and he does so. Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him. Ugarte hesitates for a moment while Rick looks at Ugarte steadily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Rick leaves the gambling room and goes into the main room which is in semidarkness. During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano. Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches. Sam then sees Rick and they smile at each other. At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano. Apparently satisfied Ferrari walks away. Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler. Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him. Rick looks the check over tears it up and pays no attention to her. Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word. Yvonne wheels on Rick with drunken fury. Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance. Rick walks over to him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He nods approval to Abdul then a German appears in the doorway. Abdul starts to close the door on the man who tries to push his way through as Rick walks up. Rick looks at the German calmly takes the card out of his hand and tears it up. At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The German storms off tossing the pieces of his card into the air behind him. Rick meets Ugarte on his way back to his table. If he were an American Ugarte would look like a tout. Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down. A waiter comes up to the table with a tray of drinks placing one before Ugarte. He takes an envelope from his pocket and lays it on the table. Rick appears ready to take them from Ugarte and he does so. Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him. Ugarte hesitates for a moment while Rick looks at Ugarte steadily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Rick leaves the gambling room and goes into the main room which is in semidarkness. During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano. Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches. Sam then sees Rick and they smile at each other. At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano. Apparently satisfied Ferrari walks away. Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler. Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him. Rick looks the check over tears it up and pays no attention to her. Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word. Yvonne wheels on Rick with drunken fury. Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance. Rick walks over to him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He nods approval to Abdul then a German appears in the doorway. Abdul starts to close the door on the man who tries to push his way through as Rick walks up. Rick looks at the German calmly takes the card out of his hand and tears it up. At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German. He gets through and passes Rick. The German storms off tossing the pieces of his card into the air behind him. Rick meets Ugarte on his way back to his table. Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him. Rick looks the check over tears it up and pays no attention to her. Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word. Yvonne wheels on Rick with drunken fury. Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance. Rick walks over to him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He nods approval to Abdul then a German appears in the doorway. Abdul starts to close the door on the man who tries to push his way through as Rick walks up. Rick looks at the German calmly takes the card out of his hand and tears it up. Rick and Yvonne approach the waiting cab. Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance. Rick walks over to him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog nods approval to a squirrel, then a zebra appears in the doorway. The squirrel starts to close the door on the zebra, who tries to push his way through as a rabbit walks up. The rabbit looks at the zebra calmly, takes the card out of his hand, and tears it up. At this moment, a parrot, a small, thin creature with a nervous air, tries to squeeze through the doorway blocked by the zebra. The parrot gets through and passes the rabbit. The zebra storms off, tossing the pieces of his card into the air behind him. The rabbit meets the parrot on his way back to his table. If he were an American, the parrot would look like a tout. Fearing to offend the rabbit, the parrot laughs, then pulls out a chair at the rabbit's table and sits down. A hamster comes up to the table with a tray of drinks, placing one before the parrot. The parrot takes an envelope from his pocket and lays it on the table. The rabbit appears ready to take them from the parrot, and he does so. The parrot leaves the table just as the hamster comes up, starts across the floor, but stops as the rabbit comes up to him. The parrot hesitates for a moment, while the rabbit looks at the parrot steadily. The rabbit leaves the gambling room and goes into the main room, which is in semi-darkness. During one of the periods when the spotlight is on the orchestra, the rabbit slips the letters of transit into the piano. An ostrich, owner of the Blue Parrot, a competing nightspot, comes into the cafe, sits down, and watches a frog, then sees the rabbit and they smile at each other. At the end of the number, the ostrich goes to the bar to speak to the rabbit, and they walk over to the piano. Apparently satisfied, the ostrich walks away. Back at the bar, a penguin, an attractive young French creature, sits on a stool drinking brandy, as a llama, who looks at her with lovesick eyes, fills her tumbler. The rabbit saunters over and leans on the bar next to the penguin, who has never taken her eyes off him. The rabbit looks the check over, tears it up, and pays no attention to her. The penguin turns, looks at the llama, and extends her glass to him, then looks at him bitterly without saying a word. The penguin wheels on the rabbit with drunken fury. The llama stands at the curb on the street in front of the rabbit's and signals for a cab, pulling her along toward the door. The rabbit and the penguin approach the waiting cab. The rabbit stands and looks up at the revolving beacon light from the airport as a koala sits at a table on the cafe terrace, watching this evening's performance. The rabbit walks over to the koala."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He nods approval to Abdul, then a Russian appears in the archway. Abdul starts to close the curtain on the man, who tries to push his way through as Rick walks up. Rick looks at the Russian calmly, takes the brochure out of his hand, and tears it up. At this moment, Ugarte, a small, thin man with a nervous air, tries to squeeze through the archway blocked by the Russian. He gets through and passes Rick. The Russian storms off, tossing the pieces of his brochure into the air behind him. Rick meets Ugarte on his way back to his booth. If he were an American, Ugarte would look like a bookie. Fearing to offend Rick, Ugarte laughs, then pulls out a stool at Rick's booth and sits down. A server comes up to the booth with a platter of snacks, placing one before Ugarte. He takes a napkin from his pocket and lays it on the table. Rick appears ready to take them from Ugarte, and he does so. Ugarte leaves the booth just as the server comes up, starts across the carpet, but stops as Rick comes up to him. Ugarte hesitates for a moment, while Rick looks at Ugarte steadily. Rick leaves the lounge room and goes into the main hall, which is in semi-darkness. During one of the periods when the spotlight is on the band, Rick slips the postcards into the violin. Ferrari, owner of the Green Elephant, a competing theater, comes into the bistro, sits down, and watches Sam, then sees Rick and they smile at each other. At the end of the piece, Ferrari goes to the counter to speak to Rick, and they walk over to the violin. Apparently satisfied, Ferrari walks away. Back at the counter, Yvonne, an attractive young Spanish woman, sits on a bench drinking cider, as Sacha, who looks at her with lovesick eyes, refills her cup. Rick saunters over and leans on the counter next to Yvonne, who has never taken her eyes off him. Rick looks the receipt over, tears it up, and pays no attention to her. Yvonne turns, looks at Sacha, and extends her cup to him, then looks at him bitterly without saying a word. Yvonne wheels on Rick with drunken fury. Sacha stands at the curb on the avenue in front of Rick's and signals for a rickshaw, pulling her along toward the archway. Rick and Yvonne approach the waiting rickshaw. Rick stands and looks up at the rotating lantern from the harbor as Renault sits at a table on the bistro balcony, watching this evening's spectacle. Rick walks over to him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He shakes his head at Abdul, then a German dances into the doorway. Abdul attempts to greet the man, who tries to skip his way through as Rick strolls up. Rick stares at the German calmly, removes the card from his hand, and folds it up. At this moment, Ugarte, a small, thin man with a nervous air, tries to hop through the doorway occupied by the German. He slides through and circles Rick. The German paces off, scattering the pieces of his card into the air around him. Rick greets Ugarte on his way back to his table. If he were an American, Ugarte would seem like a juggler. Fearing to impress Rick, Ugarte whispers, then drags out a chair at Rick's table and reclines. A waiter drifts up to the table with a tray of drinks, positioning one before Ugarte. He retrieves an envelope from his pocket and balances it on the table. Rick appears ready to ignore them from Ugarte, and he does so. Ugarte vanishes from the table just as the waiter approaches, strides across the floor, but halts as Rick steps up to him. Ugarte delays for a moment, while Rick grins at Ugarte steadily. Rick exits the gambling room and bounces into the main room, which is dimly lit. During one of the periods when the spotlight shines on the orchestra, Rick slides the letters of transit behind the piano. Ferrari, owner of the Blue Parrot, a competing nightspot, strolls into the cafe, lies down, and observes Sam, then notices Rick and they wave at each other. At the conclusion of the number, Ferrari dances to the bar to sing to Rick, and they waltz over to the piano. Apparently amused, Ferrari dances away. Back at the bar, Yvonne, an attractive young French woman, perches on a stool sipping brandy, as Sacha, who gazes at her with lovesick eyes, plays with her tumbler. Rick glides over and leans on the bar next to Yvonne, who has never diverted her eyes from him. Rick scans the check, folds it up, and ignores her completely. Yvonne spins, gazes at Sacha, and shakes her glass at him, then scowls at him bitterly without uttering a word. Yvonne charges at Rick with drunken rage. Sacha kneels at the curb on the street in front of Rick's and waves for a cab, tugging her together toward the door. Rick and Yvonne meander to the waiting cab. Rick stands and gazes down at the revolving beacon light from the airport as Renault relaxes at a table on the cafe terrace, observing this evening's spectacle. Rick skips over to him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The cactus nods approval to the lamp, then a pelican appears in the mailbox. The lamp starts to close the door on the boat, who tries to push its way through as the toaster walks up. The toaster looks at the pelican calmly, takes the necklace out of its hand, and tears it up. At this moment, the bicycle, a small, thin book with a nervous air, tries to squeeze through the mailbox blocked by the pelican. It gets through and passes the toaster. The pelican storms off, tossing the pieces of its necklace into the air behind it. The toaster meets the bicycle on its way back to its chair. If it were a gorilla, the bicycle would look like a hat. Fearing to offend the toaster, the bicycle laughs, then pulls out a tree at the toaster's chair and sits down. A plumber comes up to the tree with a tray of apples, placing one before the bicycle. It takes a postcard from its backpack and lays it on the tree. The toaster appears ready to take them from the bicycle, and it does so. The bicycle leaves the tree just as the plumber comes up, starts across the lawn, but stops as the toaster comes up to it. The bicycle hesitates for a moment, while the toaster looks at the bicycle steadily. The toaster leaves the swimming pool and goes into the main cave, which is in semi-darkness. During one of the periods when the spotlight is on the hammock, the toaster slips the maps of transit into the drum. The kangaroo, owner of the Red Elephant, a competing canyon, comes into the barn, sits down, and watches the snake, then sees the toaster and they smile at each other. At the end of the number, the kangaroo goes to the hammock to speak to the toaster, and they walk over to the drum. Apparently satisfied, the kangaroo walks away. Back at the hammock, the telescope, an attractive young penguin, sits on a branch drinking lemonade, as the violin, who looks at her with lovesick eyes, fills her canteen. The toaster saunters over and leans on the hammock next to the telescope, who has never taken her eyes off it. The toaster looks the photo over, tears it up, and pays no attention to her. The telescope turns, looks at the violin, and extends her hat to it, then looks at it bitterly without saying a word. The telescope wheels on the toaster with drunken fury. The violin stands at the curb on the street in front of the toaster's and signals for a bus, pulling her along toward the windows. The toaster and the telescope approach the waiting bus. The toaster stands and looks up at the revolving beacon light from the museum as the dandelion sits at a pillow on the barn terrace, watching this evening's performance. The toaster walks over to it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She nods approval to Ming, then an Italian appears in the hallway. Ming attempts to open the window on the woman, who tries to pull her way back as Lee hops up. Lee glances at the Italian anxiously, grabs the note out of his hand, and crumples it up. At this moment, Dupont, a tall, broad man with a confident air, tries to waddle through the hallway blocked by the Italian. He squeezes through and bypasses Lee. The Italian marches off, tossing the fragments of his note into the air behind him. Lee bumps into Dupont on his way to the counter. If he were a Brit, Dupont would resemble a dealer. Hoping to amuse Lee, Dupont chuckles, then drags out a stool at Lee's counter and perches down. A bartender strides up to the counter with a platter of snacks, placing one before Dupont. He pulls a brochure from his pocket and drops it on the counter. Lee seems hesitant to receive them from Dupont, but he does so. Dupont vacates the counter just as the bartender turns up, begins across the room, but halts as Lee skips up to him. Dupont pauses for a second, while Lee glances at Dupont curiously. Lee exits the gambling room and wanders into the main area, which is in shadows. During one of the interludes when the spotlight highlights the orchestra, Lee stashes the maps of escape into the saxophone. Morrison, proprietor of the Red Parrot, a rival pub, strolls into the cafe, plops down, and observes Joe, then notices Lee and they nod at each other. At the conclusion of the act, Morrison ambles to the booth to converse with Lee, and they skip over to the saxophone. Seemingly pleased, Morrison meanders away. Back at the booth, Claire, a charming young Italian woman, perches on a chair sipping whiskey, as Derek, who eyes her with wistful eyes, tops off her tumbler. Lee ambles over and reclines on the booth beside Claire, who has never turned her eyes from him. Lee reviews the bill, discards it, and disregards her. Claire pivots, looks at Derek, and extends her glass to him, then glances at him sharply without uttering a word. Claire rotates on Lee with spirited indignation. Derek stands at the curb on the avenue in front of Lee's and gestures for a bus, dragging him along toward the gateway. Lee and Claire head toward the stationed bus. Lee stands and gazes up at the twirling spotlight from the station as Dupont sits at a booth on the cafe patio, observing tonight's spectacle. Lee skips over to him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He gestures approval to Abdul, then a Dutchman emerges in the archway. Abdul begins to bolt the gate on the man, who attempts to dart his way through as Rick strides up. Rick gazes at the Dutchman serenely, snatches the map out of his hand, and shreds it. At this juncture, Ugarte, a petite, slender man with a jittery disposition, attempts to slip through the archway obstructed by the Dutchman. He sneaks through and bypasses Rick. The Dutchman stomps off, scattering the fragments of his map into the breeze behind him. Rick encounters Ugarte on his path back to his booth. If he were an American, Ugarte would resemble a vendor. Anxious not to upset Rick, Ugarte chuckles, then drags out a stool at Rick's booth and perches himself down. A server walks up to the booth with a platter of snacks, setting one before Ugarte. He extracts a brochure from his pocket and places it on the booth. Rick seems inclined to retrieve them from Ugarte, and he does so. Ugarte departs from the booth just as the server arrives, begins to cross the room, but pauses as Rick approaches him. Ugarte lingers for an instant, while Rick observes Ugarte intently. Rick exits the dance hall and enters the main chamber, which is in dim lighting. During one of the moments when the spotlight is on the band, Rick slides the travel tickets into the guitar. Ferrari, proprietor of the Scarlet Macaw, a rival establishment, enters the lounge, settles down, and observes Sam, then notices Rick and they grin at each other. At the conclusion of the tune, Ferrari heads to the counter to converse with Rick, and they stroll over to the guitar. Apparently content, Ferrari strides away. Back at the counter, Yvonne, a charming young Belgian woman, perches on a bench sipping sherry, as Sacha, who gazes at her with adoring eyes, refills her chalice. Rick ambles over and reclines on the counter next to Yvonne, who has never diverted her gaze from him. Rick reviews the receipt, rips it up, and ignores her. Yvonne swivels, looks at Sacha, and extends her mug to him, then glares at him sharply without uttering a word. Yvonne pivots on Rick with inebriated wrath. Sacha stands at the pavement in front of Rick's and beckons for a carriage, tugging her along toward the gateway. Rick and Yvonne move toward the awaiting carriage. Rick stands and gazes up at the spinning signal light from the harbor as Renault sits at a booth on the lounge terrace, observing this evening's spectacle. Rick strides over to him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat shakes disapproval to Oliver, then a scientist materializes in the window. Oliver prepares to open the window for the lady, who attempts to pull her way out as Alex strolls over. Alex glances at the scientist sternly, extracts the map from her hand, and crumples it. At this junction, Baxter, a tall, robust woman with a calm demeanor, attempts to crawl through the window obstructed by the scientist. She slides through and bypasses Alex. The scientist stomps away, tossing the remnants of her map into the breeze behind her. Alex encounters Baxter on her trek back to her chair. If she were a Canadian, Baxter would resemble a diplomat. Politely hoping to amuse Alex, Baxter cries softly, then drags a blanket to Alex's chair and lies down. A chef hurries up to the chair with a basket of fruits, placing one before Baxter. She extracts a pamphlet from her bag and places it on the floor. Alex seems prepared to pick them up from Baxter, and he does so. Baxter departs the chair just as the chef arrives, strolls along the corridor, but halts as Alex approaches him. Baxter pauses briefly, while Alex observes Baxter intently. Alex exits the dining area and steps into the main hall, which is in full brightness. During one of the intervals when the spotlight is on the dancers, Alex slides the invitations into the violin. Orlando, proprietor of the Red Hawk, a rival exhibition, steps into the bistro, sits down, and observes Pat, then notices Alex and they grin at each other. At the conclusion of the performance, Orlando wanders to the counter to chat with Alex, and they stroll over to the violin. Apparently pleased, Orlando drifts away. Back at the counter, Lucy, a charming young Italian woman, reclines on a bench sipping tea, as Vance, who observes her with intrigued eyes, empties her mug. Alex moseys over and leans against the counter alongside Lucy, who has never averted her gaze from him. Alex examines the menu, shreds it, and ignores her. Lucy rotates, glances at Vance, and hands him her cup, then stares at him mournfully without uttering a sound. Lucy swivels on Alex with tipsy rage. Vance lingers at the edge of the lane in front of Alex's and gestures for a carriage, dragging her forward toward the entrance. Alex and Lucy near the idling carriage. Alex stands and glances up at the rotating beacon light from the harbor as Neville reclines on a bench on the bistro patio, observing tonight's display. Alex wanders over to him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rick, encountering a German at the doorway, calmly tears up his card as Abdul tries to block the man. Ugarte, a nervous man, squeezes by, leaving an envelope with Rick who discreetly places the letters of transit into a piano. Ferrari, owner of a rival nightspot, observes Rick, indicating mutual acknowledgment. At the bar, Yvonne, a young French woman with unrequited affections for Rick, drinks brandy as Sacha, enamored with her, watches. Ignored by Rick, Yvonne drunkenly lashes out. Sacha signals for a cab for Yvonne as Rick watches the airport beacon, joined by Renault observing from the terrace."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rick walks over to him Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance Rick and Yvonne approach the waiting cab Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door Yvonne wheels on Rick with drunken fury Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word Rick looks the check over tears it up and pays no attention to her Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler Apparently satisfied Ferrari walks away At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano Sam then sees Rick and they smile at each other Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano Rick leaves the gambling room and goes into the main room which is in semidarkness Ugarte hesitates for a moment while Rick looks at Ugarte steadily Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him Rick appears ready to take them from Ugarte and he does so He takes an envelope from his pocket and lays it on the table A waiter comes up to the table with a tray of drinks placing one before Ugarte Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down If he were an American Ugarte would look like a tout Rick meets Ugarte on his way back to his table The German storms off tossing the pieces of his card into the air behind him He gets through and passes Rick At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German Rick looks at the German calmly takes the card out of his hand and tears it up Abdul starts to close the door on the man who tries to push his way through as Rick walks up He nods approval to Abdul then a German appears in the doorway"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano Rick leaves the gambling room and goes into the main room which is in semidarkness He takes an envelope from his pocket and lays it on the table Rick looks the check over tears it up and pays no attention to her Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him Rick meets Ugarte on his way back to his table The German storms off tossing the pieces of his card into the air behind him Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him Rick appears ready to take them from Ugarte and he does so During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano A waiter comes up to the table with a tray of drinks placing one before Ugarte Yvonne wheels on Rick with drunken fury Apparently satisfied Ferrari walks away Rick walks over to him Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches Rick and Yvonne approach the waiting cab Abdul starts to close the door on the man who tries to push his way through as Rick walks up Ugarte hesitates for a moment while Rick looks at Ugarte steadily Rick looks at the German calmly takes the card out of his hand and tears it up Sam then sees Rick and they smile at each other Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance He gets through and passes Rick Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door If he were an American Ugarte would look like a tout Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word He nods approval to Abdul then a German appears in the doorway At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "During one of the periods when the spotlight is on the orchestra Rick slips the letters of transit into the piano Ferrari owner of the Blue Parrot a competing nightspot comes into the cafe sits down and watches Sam then sees Rick and they smile at each other At the end of the number Ferrari goes to the bar to speak to Rick and they walk over to the piano Apparently satisfied Ferrari walks away Back at the bar Yvonne an attractive young French woman sits on a stool drinking brandy as Sacha who looks at her with lovesick eyes fills her tumbler Rick saunters over and leans on the bar next to Yvonne who has never taken her eyes off him Rick looks the check over tears it up and pays no attention to her Yvonne turns looks at Sacha and extends her glass to him then looks at him bitterly without saying a word Yvonne wheels on Rick with drunken fury Sacha stands at the curb on the street in front of Rick's and signals for a cab pulling her along toward the door Rick and Yvonne approach the waiting cab Rick stands and looks up at the revolving beacon light from the airport as Renault sits at a table on the cafe terrace watching this evening's performance Rick walks over to him He nods approval to Abdul then a German appears in the doorway Abdul starts to close the door on the man who tries to push his way through as Rick walks up Rick looks at the German calmly takes the card out of his hand and tears it up At this moment Ugarte a small thin man with a nervous air tries to squeeze through the doorway blocked by the German He gets through and passes Rick The German storms off tossing the pieces of his card into the air behind him Rick meets Ugarte on his way back to his table If he were an American Ugarte would look like a tout Fearing to offend Rick Ugarte laughs then pulls out a chair at Rick's table and sits down A waiter comes up to the table with a tray of drinks placing one before Ugarte He takes an envelope from his pocket and lays it on the table Rick appears ready to take them from Ugarte and he does so Ugarte leaves the table just as the waiter comes up starts across the floor but stops as Rick comes up to him Ugarte hesitates for a moment while Rick looks at Ugarte steadily Rick leaves the gambling room and goes into the main room which is in semidarkness"
        }
      ]
    }
  ]
}