{
  "ground_truth": "In the late afternoon sun, a scene gleams green, gold, and silver. Beyond the river, the land appears flat and empty, formless and vague, until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond, where one steps onto a wide fleet filled with a soft light, where the walls are green and silver, the roof is gold, and in its midst is the trunk of the mighty Mallorn tree, tapering toward its crown. Celeborn steps forward to greet the guests. His hair is long and silver, his face grave and beautiful, with no sign of age. Next to him stands Galadriel, the Lady of the Elves, with hair of deep gold and timeless, unsurpassed beauty. Frodo looks at Galadriel standing silently beside Celeborn. Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a pavilion set among the trees near the fountain. They lie on soft couches as Elves leave food and wine for them. Aragorn kneels beside Boromir, who looks at Aragorn in despair. Boromir feels Aragorn's love for Minas Tirith and takes heart. Aragorn returns Boromir's smile, betraying his disquiet sadness only when Boromir looks away. The Fellowship is asleep on their beds. Bare feet tread soundlessly across the lawn, and Frodo's eyes flicker open, as if by instinct. Galadriel, her white dress glowing in the moonlight, glances at him. Frodo follows her as if drawn by an invisible force. Upon a low stone pedestal carved like a branching tree sits a shallow silver basin. Galadriel pours water into the basin from a silver jug, and a glow rises from the water. Frodo slowly steps up to the pedestal and peers into the glossy surface, where the night sky is reflected. Frodo leans closer to the mirror's surface and gasps, his face lighting up with hope. Galadriel looks at Frodo intensely. Frodo looks down, clutching the ring in his hand, and then looks up at Galadriel, who suddenly seems to rise in stature before his eyes, making him afraid. Galadriel suddenly laughs, a slender Elf-woman once more, clad in simple white, her voice soft and sad. Frodo realizes what her message is. The Ring lies in the palm of Frodo's hand, and his fingers close over it. Meanwhile, naked, Lurtz's eyes follow Saruman, alight with a mean intelligence. The Uruk-Hai are smearing themselves in white paint in a creepy ritualistic ceremony, marking bodies, faces, and armor with the white hand of Isengard. Lurtz is quickly armored with a breastplate, leg guards, and helmet, and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed Uruk-Hai.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the late afternoon sun, a tableau gleams verdant, gilded, and argent. Beyond the stream, the terrain seems flat and barren, shapeless and indistinct, until it ascends far off like a somber and dismal barrier. The sun on Lothlorien cannot illuminate the obscurities beyond, where one steps onto a broad flock occupied with a gentle radiance, where the partitions are verdant and argent, the ceiling is gilded, and in its center is the trunk of the powerful Mallorn tree, tapering toward its summit. Celeborn steps forward to welcome the visitors. His hair is lengthy and argent, his visage solemn and lovely, with no hint of age. Next to him stands Galadriel, the Lady of the Elves, with hair of profound gilded and ageless, unparalleled comeliness. Frodo gazes at Galadriel standing quietly beside Celeborn. Moonlight snags the trace of weeping on Boromir's visage as Galadriel's eyes rest on Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a pavilion positioned among the trees near the fountain. They recline on soft divans as Elves place sustenance and libation for them. Aragorn kneels beside Boromir, who gazes at Aragorn in desolation. Boromir senses Aragorn's affection for Minas Tirith and takes heart. Aragorn returns Boromir's grin, betraying his disquiet sadness only when Boromir gazes elsewhere. The Fellowship is slumbering on their beds. Bare feet step soundlessly across the grass, and Frodo's eyes flicker open, as if by instinct. Galadriel, her white gown radiant in the moonlight, glances at him. Frodo follows her as if drawn by an unseen force. Upon a low stone plinth carved like a branching tree sits a shallow argent basin. Galadriel pours liquid into the basin from an argent jug, and a glow rises from the liquid. Frodo slowly steps up to the plinth and peers into the lustrous surface, where the nocturnal sky is mirrored. Frodo leans nearer to the mirror's surface and gasps, his visage illuminating with hope. Galadriel gazes at Frodo intently. Frodo looks down, clutching the ring in his hand, and then gazes up at Galadriel, who suddenly seems to elevate in stature before his eyes, making him fearful. Galadriel suddenly laughs, a slender Elf-woman again, clad in simple white, her voice gentle and melancholic. Frodo comprehends what her message is. The Ring lies in the palm of Frodo's hand, and his fingers enclose it. Meanwhile, bare, Lurtz's eyes follow Saruman, alight with a mean intelligence. The Uruk-Hai are smearing themselves in white paint in an eerie ritualistic ceremony, marking forms, visages, and armor with the white hand of Isengard. Lurtz is swiftly armored with a cuirass, leg guards, and helmet, and a sword is inserted into his hand. Saruman addresses an assemblage of 200 fully armored Uruk-Hai."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the late afternoon sun, a scene is gleamed green, gold, and silver. Beyond the river, the land is made to appear flat and empty, formless and vague, until it rises far away like a dark and dreary wall. The shadows beyond cannot be enlightened by the sun on Lothlorien, where one steps onto a wide fleet filled with a soft light, where the walls are green and silver, the roof is gold, and in its midst stands the trunk of the mighty Mallorn tree, tapering toward its crown. The guests are greeted by Celeborn stepping forward. His hair is long and silver, his face grave and beautiful, with no sign of age. Next to him, Galadriel, the Lady of the Elves, stands with hair of deep gold and timeless, unsurpassed beauty. Galadriel is looked at by Frodo as she stands silently beside Celeborn. The trace of tears on Boromir's face is caught by the moonlight as Galadriel's eyes settle on Sam. A pavilion set among the trees near the fountain houses Gimli, Legolas, Merry, Pippin, Frodo, and Sam. Food and wine are left for them by Elves as they lie on soft couches. Aragorn kneels beside Boromir, who looks at Aragorn in despair. Boromir senses Aragorn's love for Minas Tirith and takes heart. Boromir is returned his smile by Aragorn, who betrays his disquiet sadness only when Boromir looks away. Their beds are slept on by the Fellowship. The lawn is trodden soundlessly by bare feet, and Frodo's eyes flicker open, instinctively. Galadriel glances at him, her white dress glowing in the moonlight. Frodo follows her as if drawn by an invisible force. A shallow silver basin sits upon a low stone pedestal carved like a branching tree. Water is poured into the basin by Galadriel from a silver jug, and a glow rises from the water. The pedestal is slowly stepped up to by Frodo, who peers into the glossy surface, where the night sky is reflected. The mirror's surface is leaned closer to by Frodo, who gasps, his face lighting up with hope. Frodo is looked at intensely by Galadriel. The ring is clutched in Frodo's hand as he looks down, and then he looks up at Galadriel, who suddenly seems to rise in stature before his eyes, making him afraid. A laugh is suddenly let out by Galadriel, a slender Elf-woman once more, clad in simple white, her voice soft and sad. Her message is realized by Frodo. The Ring lies in the palm of Frodo's hand, and his fingers close over it. Meanwhile, Saruman is followed by Lurtz's naked eyes, alight with a mean intelligence. The Uruk-Hai smear themselves in white paint in a creepy ritualistic ceremony, marking bodies, faces, and armor with the white hand of Isengard. A breastplate, leg guards, and helmet quickly armor Lurtz, and a sword is thrust into his hand. Saruman addresses 200 fully armed Uruk-Hai gathered in a crowd."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the late afternoon sun, the scene gleams green, gold, and silver. Beyond the river, the land seems flat and formless until it rises like a dark wall. Lothlorien’s sun cannot penetrate the shadows beyond, where one enters a light-filled grove with green and silver walls, a golden roof, and the mighty Mallorn tree. Celeborn greets the guests, his long silver hair and ageless, beautiful face notable. Galadriel, the Lady of the Elves, stands beside him, her deep golden hair and unmatched beauty catching Frodo's attention. Moonlight reveals tears on Boromir's face as Galadriel's gaze falls on Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam relax on soft couches while Elves provide food and wine. Aragorn kneels by Boromir, who, comforted by Aragorn's shared love for Minas Tirith, smiles back at him. The Fellowship sleeps; Frodo awakens instinctively, seeing Galadriel in a moonlit glow. Drawn to her, he follows, discovering a silver basin on a carved pedestal. Galadriel pours water that emits a glow, and Frodo peers into it, seeing hope. Galadriel's intense gaze and subsequent laughter make Frodo realize her message. The Ring rests in his hand as his fingers close over it. Meanwhile, Lurtz, eyes fixed on Saruman, prepares in a ritual where Uruk-Hai mark themselves with white paint. Lurtz is armored, and Saruman addresses 200 fully armed Uruk-Hai."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the late afternoon sun, a scene shines green, gold, and silver. Beyond the river, the land seems flat and vague until it rises like a dark wall. Lothlorien's sun doesn't reach beyond its shadows, where a wide fleet glows with soft light; walls are green and silver, the roof gold, centered by the mighty Mallorn tree. Celeborn greets guests with long silver hair, a gravely beautiful face, and no sign of age. Beside him stands Galadriel, Lady of the Elves, with deep gold hair and timeless beauty. Frodo observes Galadriel beside Celeborn. Moonlight reveals tears on Boromir's face as Galadriel's eyes find Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam rest in a pavilion among the trees by the fountain, on soft couches as Elves serve food and wine. Aragorn kneels by Boromir, who sees Aragorn's love for Minas Tirith and takes heart. Aragorn smiles back, hiding sadness until Boromir looks away. The Fellowship sleeps. Bare feet move silently as Frodo's eyes flicker open instinctively. Galadriel, her white dress glowing in moonlight, meets his gaze. Frodo follows her, drawn by an invisible force. On a stone pedestal is a shallow silver basin. Galadriel pours water, and it glows. Frodo approaches and peers at the glossy surface reflecting the night sky. He leans closer and gasps, full of hope. Galadriel looks intensely at him. Frodo, clutching the ring, looks up; Galadriel seems to grow before his eyes, intimidating him. She laughs, reverting to a slender Elf-woman in simple white, her voice soft and sad. Frodo understands her message, and his fingers close over the Ring. Meanwhile, Lurtz, naked, watches Saruman with intelligent eyes. The Uruk-Hai partake in a ritual, marking themselves with Isengard's white hand. Lurtz is quickly armored and given a sword. Saruman addresses 200 armed Uruk-Hai."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the gentle glow of the late afternoon sun, a captivating scene unfolds, painted with shimmering shades of green, gold, and silver. Beyond the river's glistening surface, the land stretches out, appearing flat and barren, devoid of features and indistinct, until it eventually rises in the distance, resembling a dark, somber wall. The sun, casting its light on Lothlorien, is unable to penetrate the shadows beyond, where one steps onto a broad, expansive fleet bathed in a soft, gentle light. Here, the walls are adorned in shades of green and silver, the roof glows with a golden hue, and at the center stands the massive trunk of the mighty Mallorn tree, tapering gracefully as it reaches towards its lofty crown. Celeborn steps forward with grace to warmly greet the visitors. His hair cascades long and silver, his face exuding a grave and enchanting beauty that shows no trace of age or time. Standing beside him is Galadriel, the Lady of the Elves, her hair shimmering with a deep golden glow, her beauty timeless and unparalleled. Frodo gazes at Galadriel, who stands silently next to Celeborn. The moonlight captures the faint traces of tears on Boromir's face as Galadriel's gaze falls softly upon Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam find themselves in a pavilion beautifully nestled among the towering trees near the flowing fountain. They recline comfortably on soft, luxurious couches while Elves quietly leave behind an array of delicious food and exquisite wine for their enjoyment. Aragorn kneels beside Boromir, who, filled with despair, looks up at Aragorn with a heavy heart. Yet, Boromir finds comfort in Aragorn's deep love and affection for Minas Tirith, which instills a sense of hope within him. Aragorn returns Boromir's smile warmly, yet his eyes betray a subtle sadness which he hides only when Boromir's gaze shifts away. The Fellowship drifts into a deep, peaceful sleep upon their cozy beds. Bare, silent feet tread lightly across the lush green lawn, and Frodo's eyes flutter open, seemingly guided by instinct. Galadriel, her white dress casting a radiant glow in the moonlight, glances at him with a silent invitation. Frodo follows her, drawn by an unseen force. Upon a low stone pedestal, intricately carved to resemble a branching tree, rests a shallow silver basin. Galadriel gracefully pours water into the basin from a silver jug, and a soft, luminous glow emanates from the water. Frodo slowly steps closer to the pedestal and peers cautiously into the glossy surface, where the night sky is beautifully reflected. As he leans in closer to the mirror's surface, he gasps quietly, his face lighting up with newfound hope. Galadriel gazes intensely at Frodo, her eyes full of wisdom. Frodo looks down, clutching the ring tightly in his hand, then looks up at Galadriel, who seems to grow in stature before his eyes, filling him with a sudden fear. Galadriel begins to laugh softly, transforming back into a slender Elf-woman, clad simply in white, her voice gentle and filled with sorrow. Frodo suddenly understands the message she conveys. The Ring lies in the palm of Frodo's hand, and his fingers slowly close over it with determination. Meanwhile, in a starkly contrasting scene, Lurtz's naked eyes watch Saruman intently, alight with a keen, mean intelligence. The Uruk-Hai are engaged in a chilling, ceremonial ritual, smearing themselves with white paint, marking their bodies, faces, and armor with the ominous white hand of Isengard. Lurtz is quickly equipped with armor, donning a breastplate, leg guards, and helmet, while a sword is thrust into his waiting hand. Saruman rises to address a large assembly of 200 fully armed Uruk-Hai warriors, speaking with authority and intent."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the gentle, soothing glow of the late afternoon sun, a captivating and enchanting scene begins to unfold, painted with a mesmerizing palette of shimmering shades of green, gold, and silver. Beyond the river’s glistening, undulating surface, the land stretches far out, appearing flat and barren, devoid of notable features and quite indistinct, until it eventually rises in the far-off distance, resembling a dark, somber wall. The sun, casting its warm and radiant light on Lothlorien, is unable to penetrate the shadows that lie beyond, where one steps onto a broad and expansive fleet bathed in a soft, gentle glow. Here, the walls are beautifully adorned in shades of green and silver, while the roof itself glows with a resplendent golden hue, and at the center stands the massive, towering trunk of the mighty Mallorn tree, tapering gracefully as it reaches toward its lofty and majestic crown. Celeborn steps forward with elegance and grace to warmly greet the arriving visitors. His hair cascades down long and silver, his face exuding a grave yet enchanting beauty that shows no trace of age or the passage of time. Standing by his side is Galadriel, the revered Lady of the Elves, her hair shimmering with a deep, golden glow, her beauty timeless and unparalleled. Frodo gazes intently at Galadriel, who stands silently next to Celeborn. The soft moonlight captures the faint traces of tears on Boromir's face as Galadriel's gentle gaze falls softly upon Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam find themselves in a beautifully adorned pavilion nestled among the towering trees near the serene, flowing fountain. They recline comfortably on soft, luxurious couches while the Elves quietly leave behind an exquisite array of delicious food and fine wine for their enjoyment. Aragorn kneels beside Boromir, who, filled with a sense of despair, looks up at Aragorn with a heavy and troubled heart. Yet, Boromir finds comfort in Aragorn's deep love and affection for Minas Tirith, which magically instills a sense of hope within him. Aragorn returns Boromir’s smile warmly, yet his eyes betray a subtle, lingering sadness which he carefully hides only when Boromir's gaze shifts away. The Fellowship gradually drifts into a deep, peaceful sleep upon their cozy and inviting beds. Bare, silent feet tread lightly across the lush, vibrant green lawn, and Frodo's eyes flutter open, seemingly guided by an instinctive pull. Galadriel, her white dress casting a radiant, ethereal glow in the moonlight, glances at him with a silent, inviting gesture. Frodo follows her, drawn by an unseen, compelling force. Upon a low, intricately carved stone pedestal, designed to resemble a branching tree, rests a shallow silver basin. Galadriel gracefully pours water into the basin from a silver jug, and a soft, luminous glow gently emanates from the water. Frodo slowly steps closer to the pedestal and peers cautiously into the glossy, reflective surface, where the night sky is beautifully mirrored. As he leans in closer to the mirror's surface, he gasps quietly, his face lighting up with a newfound and profound hope. Galadriel gazes intensely at Frodo, her eyes filled with deep wisdom. Frodo looks down, clutching the ring tightly in his hand, then looks up at Galadriel, who seems to grow in stature before his eyes, filling him with a sudden, overwhelming fear. Galadriel begins to laugh softly, transforming back into a slender Elf-woman, clad simply in white, her voice gentle and filled with poignant sorrow. Frodo suddenly understands the message she conveys. The Ring lies in the palm of Frodo's hand, and his fingers slowly close over it with determination. Meanwhile, in a starkly contrasting scene, Lurtz's naked eyes watch Saruman intently, alight with a keen, mean intelligence. The Uruk-Hai are engaged in a chilling, ceremonial ritual, smearing themselves with white paint, marking their bodies, faces, and armor with the ominous white hand of Isengard. Lurtz is quickly equipped with armor, donning a breastplate, leg guards, and helmet, while a sword is thrust into his waiting hand. Saruman rises to address a large assembly of 200 fully armed Uruk-Hai warriors, speaking with authority and intent."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the late afternoon sun, the scene is illuminated with hues of green, gold, and silver, casting a magical glow over the landscape. Beyond the shimmering river, the land stretches out flat and empty, appearing formless and vague until it gradually rises in the distance like a dark and dreary wall, impenetrable to the sunlight from Lothlorien. In this ethereal light, one steps onto a wide, open area filled with a soft light, where the enclosing walls shimmer with shades of green and silver, the roof above gleams a vibrant gold, and in the center stands the majestic trunk of the Mallorn tree, its form tapering elegantly toward its crown. Celeborn gracefully steps forward to warmly greet the arriving guests, his hair long and silver, his face grave yet beautiful, lacking any indication of age. Beside him stands Galadriel, the revered Lady of the Elves, whose hair is a rich deep gold, her beauty timeless and unsurpassed. Frodo's eyes rest upon Galadriel as she stands silently next to Celeborn, and at that moment, moonlight reveals the subtle trace of tears upon Boromir's face as Galadriel's gaze shifts towards Sam. Nearby in a pavilion nestled among the trees and close to a fountain, Gimli, Legolas, Merry, Pippin, Frodo, and Sam rest on soft couches while Elves discreetly leave an assortment of food and wine for them. Aragorn kneels attentively beside Boromir, meeting his gaze which is filled with despair, yet Boromir draws strength from Aragorn's evident love for Minas Tirith. In response, Aragorn returns Boromir's smile, his underlying melancholy only apparent when Boromir looks away. The Fellowship, now asleep on their beds, rests peacefully until bare feet move soundlessly across the lawn, prompting Frodo's eyes to flicker open instinctively. Galadriel, adorned in a white dress that glows softly under the moonlight, casts a glance towards Frodo, prompting him to rise and follow her as if compelled by an invisible force. They arrive at a low stone pedestal expertly carved to resemble a branching tree, on which rests a shallow silver basin. Galadriel gracefully pours water from a silver jug into the basin, causing a gentle glow to emanate from the water. With deliberate care, Frodo steps closer to the pedestal and peers into the glossy surface, where the night sky mirrors back at him. Frodo leans in even closer to the mirror's surface and gasps with a sudden flicker of hope lighting up his face. Galadriel fixes an intense gaze on Frodo, causing him to look down and clutch the ring tightly in his hand before glancing back up at her, noticing how she suddenly appears to grow in stature, instilling a sense of fear in him. Galadriel, however, unexpectedly laughs, once again appearing as a slender Elf-woman clad in simple white, her voice soft yet tinged with sadness, and Frodo grasps the essence of her message. The Ring rests in Frodo's open palm, and his fingers slowly close over it. Meanwhile, elsewhere, the Uruk-Hai leader Lurtz, naked, tracks Saruman with eyes illuminated by a menacing intelligence. Engaged in a disturbing ritualistic ceremony, the Uruk-Hai cover themselves with white paint, marking their bodies, faces, and armor with the symbolic white hand of Isengard. Lurtz is swiftly equipped with armor, consisting of a breastplate, leg guards, and helmet, and a sword is forcefully placed into his hand. Saruman then addresses the assembled force of 200 fully armed Uruk-Hai, preparing them for what lies ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the late afternoon sun, a scene glistens in shades of green, gold, and silver. Beyond the river, the land seems flat and undefined until it rises in the distance like a shadowy barrier. The sunlight on Lothlorien illuminates a wide clearing filled with soft light, green and silver walls, and a golden canopy, centered around the towering trunk of the Mallorn tree. Celeborn steps forward to welcome the guests, his silver hair and ageless face conveying a grave beauty. Beside him stands Galadriel, the Elven Lady, with deep golden hair and timeless beauty. Frodo observes Galadriel, who silently stands by Celeborn, as moonlight reveals traces of tears on Boromir's face when Galadriel's eyes meet Sam's. Elsewhere, Gimli, Legolas, Merry, Pippin, Frodo, and Sam recline on soft couches in a pavilion among the trees near a fountain, with food and wine left by Elves. Aragorn kneels by a despondent Boromir, who finds comfort in Aragorn's love for Minas Tirith. Aragorn smiles at Boromir, masking his own sorrow when Boromir turns away. As the Fellowship sleeps, Galadriel, radiant in moonlight, catches Frodo's attention, compelling him to follow her. She pours water into a silver basin on a tree-like stone pedestal, creating a glow. Frodo approaches and peers into the reflective surface, gasping with hope. Galadriel intensely observes Frodo, who clutches the ring, feeling both fear and understanding as Galadriel momentarily appears grander. She laughs softly, resuming her slender, elf-like form, and conveys her message to Frodo. Meanwhile, Lurtz, newly armored and armed, watches Saruman with shrewd intelligence as the Uruk-Hai engage in a ritual, marking themselves with the white hand of Isengard. Saruman addresses a crowd of 200 fully armed Uruk-Hai."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the late afternoon sun, a scene gleams green, gold, and silver, capturing the enchanting essence of Lothlorien, the legendary forest realm of the Elves. Beyond the river Anduin, which serves as a natural boundary for this mystical land, the terrain appears flat and empty, formless and vague, until it rises far away like a dark and dreary wall resembling the distant Misty Mountains. The sun on Lothlorien cannot enlighten the shadows beyond, where one steps onto a wide fleet, the fabled Elven boat launch filled with a soft light, where the walls are green and silver, the roof is gold, and in its midst is the trunk of the mighty Mallorn tree, the tallest and most revered tree in Middle-earth known for its smooth, silvery bark and golden leaves that never fade, tapering toward its crown. Celeborn, the wise and noble Lord of Lothlorien, steps forward to greet the guests. His hair is long and silver, his face grave and beautiful, with no sign of age, embodying the timeless, ethereal nature of the Elves. Next to him stands Galadriel, the Lady of the Elves, with hair of deep gold and timeless, unsurpassed beauty, known as one of the most powerful and revered Elves in Middle-earth. Frodo looks at Galadriel standing silently beside Celeborn. Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Sam, recognizing his loyalty and courage. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a pavilion set among the trees near the fountain, a tranquil spot designed to soothe and rejuvenate travelers. They lie on soft couches as Elves leave food and wine for them, known for its unparalleled flavor and quality. Aragorn, heir to the throne of Gondor, kneels beside Boromir, who looks at Aragorn in despair, struggling with his inner conflict about the power of the Ring. Boromir feels Aragorn's love for Minas Tirith, the great city and capital of Gondor, and takes heart. Aragorn returns Boromir's smile, betraying his disquiet sadness only when Boromir looks away. The Fellowship is asleep on their beds, exhausted from their perilous journey. Bare feet tread soundlessly across the lawn, reflecting the Elven grace and stealth, and Frodo's eyes flicker open, as if by instinct. Galadriel, her white dress glowing in the moonlight, glances at him, her presence luminous and commanding. Frodo follows her as if drawn by an invisible force of ancient magic. Upon a low stone pedestal carved like a branching tree sits a shallow silver basin, known as the Mirror of Galadriel, a mystical artifact used to reveal possible futures. Galadriel pours water into the basin from a silver jug, and a glow rises from the water, filled with Elven enchantment. Frodo slowly steps up to the pedestal and peers into the glossy surface, where the night sky is reflected, seeing visions that hint at what may come. Frodo leans closer to the mirror's surface and gasps, his face lighting up with hope as he sees glimpses of a world free from darkness. Galadriel looks at Frodo intensely, understanding his burden and the gravity of his quest. Frodo looks down, clutching the ring in his hand, the One Ring, a powerful artifact capable of ruling all others, and then looks up at Galadriel, who suddenly seems to rise in stature before his eyes, making him afraid as he glimpses her true power. Galadriel suddenly laughs, a slender Elf-woman once more, clad in simple white, her voice soft and sad, echoing the weight of ages past. Frodo realizes what her message is, a warning and a reassurance about the path he must take. The Ring lies in the palm of Frodo's hand, and his fingers close over it, feeling the heavy responsibility it represents. Meanwhile, naked, Lurtz's eyes follow Saruman, alight with a mean intelligence that reveals his brutish cunning. The Uruk-Hai, a fearsome breed of Orcs bred for warfare by the dark sorcerer Saruman, are smearing themselves in white paint in a creepy ritualistic ceremony, marking bodies, faces, and armor with the white hand of Isengard, the emblem of Saruman's domain. Lurtz is quickly armored with a breastplate, leg guards, and helmet, indicating his role as a captain among the Uruk-Hai, and a sword is thrust into his hand, a weapon designed for deadly efficiency. Saruman addresses a crowd of 200 fully armed Uruk-Hai, rallying his troops for the impending war."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown In the late afternoon sun a scene gleams green gold and silver Galadriel her white dress glowing in the moonlight glances at him Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown Celeborn steps forward to greet the guests His hair is long and silver his face grave and beautiful with no sign of age Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty Frodo looks at Galadriel standing silently beside Frodo looks at Galadriel standing silently beside Celeborn Frodo follows her as if drawn by an invisible force Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Sam Gimli Legolas Merry Pippin Frodo and Sam are in a pavilion set among the trees near the fountain Saruman addresses a crowd of 200 fully armed UrukHai They lie on soft couches as Elves leave food and wine for them Celeborn steps forward to greet the guests Galadriel suddenly laughs Aragorn kneels beside Boromir who looks at Aragorn in despair Boromir feels Aragorn's love for Minas Tirith and takes heart Lurtz is quickly armored with a breastplate leg Celeborn In the late afternoon sun a scene gleams green gold and silver Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away The Fellowship is asleep on their beds Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct Galadriel her white dress glowing in the moonlight glances at him Frodo follows her as if drawn by an invisible force Upon a low stone pedestal carved like a branching tree sits a shallow silver basin guards and helmet and a sword is thrust into his hand Galadriel pours water into the basin from a silver jug and a glow rises from the water Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected Frodo leans closer to the mirror's surface and gasps his face lighting up with hope Galadriel looks at Frodo intensely Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected Galadriel looks at Frodo intensely Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid Galadriel suddenly laughs a slender Elfwoman once more clad in simple white her voice soft and sad Frodo realizes what her message is The Ring lies in the palm of Frodo's hand and his fingers close over it Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence Frodo realizes what her message is His hair is long and silver his face grave and beautiful with no sign of age Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard Boromir feels Aragorn's love for Minas Tirith and takes heart The Fellowship is asleep on their beds Lurtz is quickly armored with a breastplate leg guards and helmet and a sword is thrust into his hand Saruman addresses a crowd of 200 fully armed UrukHai"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In the late afternoon sun a scene gleams green gold and silver. Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown. Celeborn steps forward to greet the guests. His hair is long and silver his face grave and beautiful with no sign of age. Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty. Frodo looks at Galadriel standing silently beside. Celeborn. Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on. Sam Gimli Legolas Merry Pippin. Frodo and Sam are in a pavilion set among the trees near the fountain. They lie on soft couches as Elves leave food and wine for them. Aragorn kneels beside Boromir who looks at Aragorn in despair. Boromir feels Aragorn's love for Minas Tirith and takes heart. Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away. The Fellowship is asleep on their beds. Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Galadriel her white dress glowing in the moonlight glances at him. Frodo follows her as if drawn by an invisible force. Upon a low stone pedestal carved like a branching tree sits a shallow silver basin. Galadriel pours water into the basin from a silver jug and a glow rises from the water. Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected. Frodo leans closer to the mirror's surface and gasps his face lighting up with hope. Galadriel looks at Frodo intensely. Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid. Galadriel suddenly laughs. a slender Elfwoman once more clad in simple white. her voice soft and sad. Frodo realizes what her message is. The Ring lies in the palm of Frodo's hand and his fingers close over it. Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence. The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard. Lurtz is quickly armored with a breastplate leg. guards and helmet and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed UrukHai."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In the late afternoon sun a scene gleams green gold and silver. Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown. Celeborn steps forward to greet the guests. His hair is long and silver his face grave and beautiful with no sign of age. Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty. Frodo looks at Galadriel standing silently beside. Celeborn. Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on. Sam Gimli Legolas Merry Pippin. Frodo and Sam are in a pavilion set among the trees near the fountain. They lie on soft couches as Elves leave food and wine for them. Aragorn kneels beside Boromir who looks at Aragorn in despair. Boromir feels Aragorn's love for Minas Tirith and takes heart. Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away. The Fellowship is asleep on their beds. Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Galadriel her white dress glowing in the moonlight glances at him. Frodo follows her as if drawn by an invisible force. Upon a low stone pedestal carved like a branching tree sits a shallow silver basin. Galadriel pours water into the basin from a silver jug and a glow rises from the water. Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected. Frodo leans closer to the mirror's surface and gasps his face lighting up with hope. Galadriel looks at Frodo intensely. Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid. Galadriel suddenly laughs. a slender Elfwoman once more clad in simple white. her voice soft and sad. Frodo realizes what her message is. The Ring lies in the palm of Frodo's hand and his fingers close over it. Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence. The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard. Lurtz is quickly armored with a breastplate leg. guards and helmet and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed UrukHai."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In the late afternoon sun a scene gleams green gold and silver. Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown. Celeborn steps forward to greet the guests. His hair is long and silver his face grave and beautiful with no sign of age. Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty. Frodo looks at Galadriel standing silently beside. Celeborn. Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on. a slender Elfwoman once more clad in simple white. her voice soft and sad. Frodo realizes what her message is. The Ring lies in the palm of Frodo's hand and his fingers close over it. Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence. The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard. Lurtz is quickly armored with a breastplate leg. guards and helmet and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed UrukHai."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In the late afternoon sun a scene gleams green gold and silver. Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown. The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard. Lurtz is quickly armored with a breastplate leg. guards and helmet and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed UrukHai."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In the late afternoon sun, a scene gleams green, gold, and silver. Beyond the river, the land appears flat and empty, formless and vague, until it rises far away like a dark and dreary wall. The sun on Lothlorien cannot enlighten the shadows beyond, where one steps onto a wide fleet filled with a soft light, where the walls are green and silver, the roof is gold, and in its midst is the trunk of the mighty Mallorn tree, tapering toward its crown. Gandalf steps forward to greet the guests. His hair is long and silver, his face grave and beautiful, with no sign of age. Next to him stands Arwen, the Lady of the Elves, with hair of deep gold and timeless, unsurpassed beauty. Legolas looks at Arwen standing silently beside Gandalf. Moonlight catches the trace of tears on Gimli's face as Arwen's eyes settle on Merry. Pippin, Sam, Boromir, Aragorn, and Merry are in a pavilion set among the trees near the fountain. They lie on soft couches as Dwarves leave food and wine for them. Frodo kneels beside Sam, who looks at Frodo in despair. Sam feels Frodo's love for Minas Tirith and takes heart. Frodo returns Sam's smile, betraying his disquiet sadness only when Sam looks away. The Fellowship is asleep on their beds. Bare feet tread soundlessly across the lawn, and Merry's eyes flicker open, as if by instinct. Arwen, her white dress glowing in the moonlight, glances at him. Merry follows her as if drawn by an invisible force. Upon a low stone pedestal carved like a branching tree sits a shallow silver basin. Arwen pours water into the basin from a silver jug, and a glow rises from the water. Merry slowly steps up to the pedestal and peers into the glossy surface, where the night sky is reflected. Merry leans closer to the mirror's surface and gasps, his face lighting up with hope. Arwen looks at Merry intensely. Merry looks down, clutching the ring in his hand, and then looks up at Arwen, who suddenly seems to rise in stature before his eyes, making him afraid. Arwen suddenly laughs, a slender Elf-woman once more, clad in simple white, her voice soft and sad. Merry realizes what her message is. The Ring lies in the palm of Merry's hand, and his fingers close over it. Meanwhile, naked, Saruman's eyes follow Gollum, alight with a mean intelligence. The Uruk-Hai are smearing themselves in white paint in a creepy ritualistic ceremony, marking bodies, faces, and armor with the white hand of Isengard. Gollum is quickly armored with a breastplate, leg guards, and helmet, and a sword is thrust into his hand. Saruman addresses a crowd of 200 fully armed Uruk-Hai."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In the late afternoon sun, a scene gleams blue, red, and bronze. Beyond the gorge, the terrain appears flat and barren, shapeless and indistinct, until it rises far away like a shadowy and ominous ridge. The sun on Erindale cannot illuminate the darkness beyond, where one steps onto a wide bridge filled with a soft glow, where the walls are blue and bronze, the roof is red, and in its midst is the tower of the mighty Redwood tree, tapering toward its peak. Celeborn steps forward to greet the visitors. His hair is long and bronze, his face stern and exquisite, with no mark of age. Next to him stands Galadriel, the Lady of the Fairies, with hair of deep red and timeless, unmatched beauty. Frodo looks at Galadriel standing silently beside Celeborn. Starlight catches the trace of tears on Boromir's cheek as Galadriel's eyes rest on Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a gazebo set among the shrubs near the pond. They lie on soft mats as Fairies leave snacks and juice for them. Aragorn kneels beside Boromir, who looks at Aragorn in despair. Boromir feels Aragorn's love for Rivendell and takes heart. Aragorn returns Boromir's grin, revealing his hidden unease only when Boromir looks away. The Fellowship is asleep on their rugs. Bare feet tread soundlessly across the meadow, and Frodo's eyes flicker open, as if by instinct. Galadriel, her white robe glowing in the starlight, glances at him. Frodo follows her as if drawn by an unseen force. Upon a low marble pedestal carved like a twisting vine sits a shallow bronze bowl. Galadriel pours juice into the bowl from a bronze pitcher, and a glow rises from the liquid. Frodo slowly steps up to the pedestal and peers into the glossy surface, where the night sky is mirrored. Frodo leans closer to the mirror's surface and gasps, his face lighting up with hope. Galadriel looks at Frodo intensely. Frodo looks down, clutching the amulet in his hand, and then looks up at Galadriel, who suddenly seems to rise in stature before his eyes, making him afraid. Galadriel suddenly laughs, a slender Fairy-woman once more, clad in simple white, her voice soft and melancholic. Frodo realizes what her message is. The Amulet lies in the palm of Frodo's hand, and his fingers close over it. Meanwhile, unclothed, Lurtz's eyes follow Saruman, alight with a sharp cunning. The Goblins are smearing themselves in purple paint in a creepy ceremonial practice, marking bodies, faces, and armor with the purple fist of Mordor. Lurtz is quickly armored with a chestplate, shin guards, and helmet, and a spear is thrust into his hand. Saruman addresses a gathering of 200 fully armed Goblins."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In the late afternoon sun, a scene shimmers green, gold, and silver. Beyond the river, the land feels vast and empty, shapeless and elusive, until it collapses far away like a bleak and dreary wall. The sun on Lothlorien cannot brighten the shadows beyond, where one enters onto a wide fleet bathed in a gentle light, where the walls are green and silver, the roof is gold, and in its center is the trunk of the majestic Mallorn tree, broadening toward its crown. Celeborn advances forward to acknowledge the guests. His hair is long and silver, his face solemn and beautiful, with no sign of age. Next to him stands Galadriel, the Lady of the Elves, with hair of deep gold and timeless, unsurpassed beauty. Frodo glances at Galadriel standing silently beside Celeborn. Moonlight reveals the trace of tears on Boromir's face as Galadriel's eyes settle on Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a pavilion set among the trees near the fountain. They recline on soft couches as Elves serve food and wine for them. Aragorn bends beside Boromir, who stares at Aragorn in despair. Boromir senses Aragorn's love for Minas Tirith and finds courage. Aragorn returns Boromir's smile, masking his quiet sadness only when Boromir looks away. The Fellowship rests on their beds. Bare feet glide soundlessly across the lawn, and Frodo's eyes flutter open, as if by instinct. Galadriel, her white dress glowing in the moonlight, observes him. Frodo trails her as if pulled by an invisible force. Upon a low stone pedestal carved like a branching tree rests a shallow silver basin. Galadriel pours water into the basin from a silver jug, and a glow emerges from the water. Frodo cautiously steps up to the pedestal and gazes into the glossy surface, where the night sky is mirrored. Frodo leans nearer to the mirror's surface and gasps, his face brightening with hope. Galadriel gazes at Frodo intently. Frodo looks down, holding the ring in his hand, and then looks up at Galadriel, who suddenly seems to tower in stature before his eyes, making him anxious. Galadriel suddenly chuckles, a slender Elf-woman once more, dressed in simple white, her voice gentle and wistful. Frodo discerns what her message is. The Ring rests in the palm of Frodo's hand, and his fingers grasp around it. Meanwhile, naked, Lurtz's eyes trail Saruman, bright with a cunning intelligence. The Uruk-Hai are adorning themselves in white paint in a bizarre ritualistic ceremony, marking bodies, faces, and armor with the white hand of Isengard. Lurtz is quickly equipped with a breastplate, leg guards, and helmet, and a sword is placed into his hand. Saruman addresses a crowd of 200 fully armed Uruk-Hai."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In the late afternoon fog, a scene gleams orange, blue, and copper. Beyond the mountain, the sea appears narrow and crowded, shapeless and distinct, until it rises far away like a bright and cheerful banner. The rain on Rivia cannot darken the lights beyond, where one steps onto a narrow boat filled with a warm shadow, where the ceilings are purple and copper, the floor is orange, and in its midst is the stalk of the mighty Redwood bush, tapering toward its base. Elessar steps backward to avoid the strangers. His cloak is short and copper, his hands merry and plain, with no sign of youth. Next to him stands Yavanna, the Queen of the Dwarves, with gloves of pale silver and fleeting, unmatched wisdom. Sam looks at Yavanna walking noisily beside Elessar. Starlight catches the trace of laughter on Legolas's feet as Yavanna's laugh settles on Merry. Pippin, Boromir, Gimli, Legolas, Sam, and Merry are in a gazebo set among the flowers near the river. They sit on hard chairs as Dwarves bring jewels and ale for them. Gandalf stands beside Legolas, who looks at Gandalf in joy. Legolas feels Gandalf's dismay for Rohan and loses hope. Gandalf ignores Legolas's frown, betraying his muted happiness only when Legolas looks toward him. The Alliance is awake in their chairs. Covered hands tread noisily across the dust, and Merry's knees flicker shut, as if by reflex. Yavanna, her dark tunic glowing in the starlight, peers at him. Merry follows her as if led by an unseen pull. Upon a high wooden shelf carved like a sprawling flower sits a deep golden chalice. Yavanna pours sand into the chalice from a golden urn, and a shadow falls from the sand. Merry swiftly steps down from the shelf and peers away from the murky depth, where the bright sun is obscured. Merry leans farther from the chalice's edge and gasps, his eyes dimming with despair. Yavanna stares at Merry gently. Merry looks up, tossing the coin in his pocket, and then looks down at Yavanna, who suddenly seems to fall in grace before his feet, making him calm. Yavanna suddenly cries, a burly Human-man once more, clad in intricate black, his face hard and angry. Merry misses what his signal was. The Coin lies in the sole of Merry's boot, and his toes uncover it. Meanwhile, clothed, Grima's ears follow Wormtongue, unlit with a pure innocence. The Goblins are cleansing themselves in red paint in a frivolous disorganized festival, marking fingers, legs, and shields with the red eye of Mordor. Grima is slowly clothed with a smock, arm bands, and crown, and a staff is taken from his arm. Wormtongue ignores a group of 50 barely armed Goblins."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In the late afternoon sun, a scene glistens pink, turquoise, and bronze. Beyond the mountain, the ocean appears calm and vast, shapeless and obscure, until it ascends far away like a bright and cheerful wall. The rain on Rivendell cannot dim the highlights beyond, where one lands onto a narrow meadow filled with a gentle breeze, where the ceilings are pink and bronze, the floor is turquoise, and in its midst is the stem of the slender Elm tree, stretching toward its peak. Gandalf skips forward to meet the travelers. His beard is short and golden, his expression lively and cheerful, with no hint of youth. Next to him stands Arwen, the Queen of the Humans, with hair of light brown and enduring, unmatched grace. Merry glances at Arwen standing silently beside Gandalf. Starlight captures the trace of joy on Legolas's face as Arwen's eyes focus on Pippin. Bilbo, Gimli, Aragorn, Boromir, Merry, and Pippin are in a tent set among the bushes near the spring. They sit on hard benches as Dwarves deliver blankets and pillows for them. Legolas stands beside Gimli, who gazes at Legolas in disbelief. Gimli senses Legolas's loyalty for Mirkwood and feels encouraged. Legolas returns Gimli's frown, revealing his quiet excitement only when Gimli looks away. The Fellowship is awake on their mats. Soft hands drum loudly across the earth, and Merry's eyes blink closed, as if by intuition. Arwen, her blue dress shimmering in the starlight, peeks at him. Merry follows her as if pulled by a hidden magnet. Upon a tall wooden stool carved like a towering mountain sits a deep golden bowl. Arwen spills sand into the bowl from a golden flask, and a mist rises from the sand. Merry quickly steps up to the stool and gazes into the glossy surface, where the daytime sky is mirrored. Merry leans away from the mirror's surface and sighs, his face darkening with fear. Arwen watches Merry distantly. Merry looks up, releasing the stone in his hand, and then gazes at Arwen, who suddenly seems to shrink in stature before his eyes, making him calm. Arwen suddenly cries, a tall Human-singer once more, robed in intricate blue, her voice loud and joyful. Merry forgets what her warning is. The Stone rests in the palm of Merry's hand, and his fingers release it. Meanwhile, clothed, Wormtongue's gaze avoids Theoden, alight with a dull curiosity. The Orcs are covering themselves in black dust in a bizarre celebratory gathering, tagging bodies, faces, and shields with the black emblem of Mordor. Wormtongue is quickly relieved of a cloak, arm guards, and helmet, and a dagger is placed into his hand. Theoden consults a group of 50 lightly armed Orcs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In the early evening moonlight, a scene shimmers blue, red, and bronze. Beyond the hill, the sky appears vast and endless, shapeless and mysterious, until it descends far below like a bright and cheerful barrier. The moon on Mirkwood cannot illuminate the lights above, where one drifts onto a narrow path filled with a warm glow, where the floors are blue and bronze, the ceiling is red, and in its center is the stem of the grand Oak tree, expanding toward its branches. Celeborn steps aside to observe the visitors. His hair is short and bronze, his expression somber and radiant, with no hint of youth. Beside him stands Galadriel, the Queen of the Goblins, with hair of pale red and eternal, unmatched grace. Frodo glances at Galadriel standing softly beside Celeborn. Starlight highlights the hint of laughter on Boromir's face as Galadriel's gaze shifts to Sam. Gimli, Legolas, Merry, Pippin, Frodo, and Sam are in a cabin nestled among the stones near the pond. They sit on hard benches as Goblins bring gifts and ale to them. Aragorn stands beside Boromir, who glances at Aragorn in confusion. Boromir senses Aragorn's admiration for Rohan and finds courage. Aragorn returns Boromir's frown, revealing his concealed joy only when Boromir turns away. The Fellowship is awake on their mats. Bare hands move silently across the sand, and Frodo's mind wanders, as if by habit. Galadriel, her black cloak shimmering in the starlight, peers at him. Frodo trails her as if pulled by a hidden breeze. Upon a tall wooden platform carved like a twisting vine sits a deep bronze goblet. Galadriel pours stones into the goblet from a bronze pitcher, and a shadow falls from the stones. Frodo quickly approaches the platform and gazes into the matte surface, where the daytime clouds are mirrored. Frodo leans further from the mirror's edge and whispers, his heart filling with fear. Galadriel stares at Frodo calmly. Frodo looks up, releasing the bracelet in his hand, and then looks down at Galadriel, who abruptly seems to shrink in presence before his eyes, making him bold. Galadriel suddenly cries out, a sturdy Elf-woman once more, dressed in complex black, her words lively and bright. Frodo understands what her message was. The Bracelet rests in the palm of Frodo's hand, and his palm opens over it. Meanwhile, covered, Lurtz's gaze follows Saruman, filled with a warm knowledge. The Uruk-Hai are washing themselves in black oil in an enchanting chaotic ritual, adorning limbs, feet, and shields with the black foot of Orthanc. Lurtz is leisurely lacking a cloak, arm bands, and visor, and a bow is pulled into his grip. Saruman whispers to a band of 100 unarmed Uruk-Hai."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In the late morning mist, a landscape shimmers orange, purple, and copper. Beside the mountain, the ocean seems narrow and crowded, structured and clear, until it sinks close by like a bright and cheerful curtain. The moon over Rivendell cannot darken the brilliance ahead, where one skips onto a narrow raft covered with a sharp shadow, where the bridges are orange and purple, the ceiling is copper, and at its edge is the branch of the enormous Baobab tree, widening toward its base. Thrain skips backward to ignore the visitors. His hat is short and purple, his stance playful and unusual, with no hint of wisdom. Beside him stands Yavanna, the Spirit of the Dwarves, with eyes of shallow copper and fleeting, unmatched charm. Sam gazes at Yavanna frowning loudly next to Thrain. Sunbeams touch the hint of laughter on Aragorn's chin as Yavanna's hair glows on Gimli. Boromir, Aragorn, Legolas, Eowyn, Sam, and Pippin are in a tent placed beneath the bushes near the spring. They float on hard benches as Dwarves take bread and ale from them. Merry jumps behind Gimli, who whispers to Merry in triumph. Gimli hears Legolas's dislike for Rohan and loses heart. Legolas abandons Gimli's frown, revealing his quiet joy only when Gimli turns around. The Brigade is awake on their chairs. Gloved hands fly clumsily over the tiles, and Sam's ears narrow shut, as if by choice. Yavanna, her black cloak sparkling in the sunlight, peers at him. Sam ignores her as if repelled by a visible wall. Upon a tall wooden table carved like a splitting bush lies a deep copper bowl. Yavanna dumps sand into the bowl from a copper box, and a shadow sinks from the sand. Sam quickly jumps down from the table and gazes into the rough floor, where the day ocean is obscured. Sam steps further from the mirror's floor and whispers, his head dimming down with doubt. Yavanna avoids Sam briefly. Sam avoids up, releasing the hat in his pocket, and then avoids down at Yavanna, who instantly seems to shrink in stature after his ears, making him joyful. Yavanna instantly cries, a massive Dwarf-man once again, wrapped in elaborate black, his sound strong and cheerful. Sam forgets who her signal was. The Hat lies on the back of Sam's foot, and his toes open under it. Meanwhile, dressed, Gollum's hands listen around Sauron, dark with a kind wisdom. The Ents are hiding themselves in dark wool in a cheerful artistic performance, ignoring towns, fields, and cliffs with the dark foot of Mordor. Gollum is slowly armored with a shield, arm plates, and crown, and a spear is pulled from his foot. Sauron ignores a trickle of 500 lightly armored Ents."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the late afternoon, the scene glimmers green, gold, and silver. Beyond the river, the land seems flat until it rises like a distant wall. The sunlight on Lothlorien can't penetrate the shadows beyond, where a soft light fills the area, and the Mallorn tree stands tall. Celeborn, with his long silver hair and ageless face, greets the guests alongside Galadriel, the Lady of the Elves, known for her deep gold hair and timeless beauty. Frodo notices Galadriel, and Boromir's tears glisten in the moonlight. Aragorn comforts Boromir, both sharing a quiet moment of mutual understanding. As the Fellowship sleeps, Frodo awakens to Galadriel, who leads him to a stone pedestal with a silver basin. She pours water, and Frodo peers into the glowing mirror, feeling hope. Galadriel's intense gaze makes Frodo clutch the ring, realizing the weight of her message. Meanwhile, Lurtz, an Uruk-Hai, follows Saruman’s orders, participating in a ritual, and is equipped with armor and weapons as Saruman addresses his army."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Saruman addresses a crowd of 200 fully armed UrukHai guards and helmet and a sword is thrust into his hand Lurtz is quickly armored with a breastplate leg The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence The Ring lies in the palm of Frodo's hand and his fingers close over it Frodo realizes what her message is her voice soft and sad a slender Elfwoman once more clad in simple white Galadriel suddenly laughs Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid Galadriel looks at Frodo intensely Frodo leans closer to the mirror's surface and gasps his face lighting up with hope Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected Galadriel pours water into the basin from a silver jug and a glow rises from the water Upon a low stone pedestal carved like a branching tree sits a shallow silver basin Frodo follows her as if drawn by an invisible force Galadriel her white dress glowing in the moonlight glances at him Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct The Fellowship is asleep on their beds Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away Boromir feels Aragorn's love for Minas Tirith and takes heart Aragorn kneels beside Boromir who looks at Aragorn in despair They lie on soft couches as Elves leave food and wine for them Frodo and Sam are in a pavilion set among the trees near the fountain Sam Gimli Legolas Merry Pippin Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Celeborn Frodo looks at Galadriel standing silently beside Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty His hair is long and silver his face grave and beautiful with no sign of age Celeborn steps forward to greet the guests The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall In the late afternoon sun a scene gleams green gold and silver"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sam Gimli Legolas Merry Pippin Aragorn kneels beside Boromir who looks at Aragorn in despair Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty Galadriel pours water into the basin from a silver jug and a glow rises from the water The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard Frodo leans closer to the mirror's surface and gasps his face lighting up with hope The Ring lies in the palm of Frodo's hand and his fingers close over it Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct a slender Elfwoman once more clad in simple white Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away Frodo and Sam are in a pavilion set among the trees near the fountain They lie on soft couches as Elves leave food and wine for them her voice soft and sad Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Upon a low stone pedestal carved like a branching tree sits a shallow silver basin Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence Frodo looks at Galadriel standing silently beside Galadriel suddenly laughs In the late afternoon sun a scene gleams green gold and silver guards and helmet and a sword is thrust into his hand Boromir feels Aragorn's love for Minas Tirith and takes heart Frodo follows her as if drawn by an invisible force The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown Lurtz is quickly armored with a breastplate leg Frodo realizes what her message is Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected Celeborn steps forward to greet the guests Galadriel looks at Frodo intensely His hair is long and silver his face grave and beautiful with no sign of age Saruman addresses a crowd of 200 fully armed UrukHai The Fellowship is asleep on their beds Galadriel her white dress glowing in the moonlight glances at him Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall Celeborn"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Frodo follows her as if drawn by an invisible force Upon a low stone pedestal carved like a branching tree sits a shallow silver basin Galadriel pours water into the basin from a silver jug and a glow rises from the water Frodo slowly steps up to the pedestal and peers into the glossy surface where the night sky is reflected Frodo leans closer to the mirror's surface and gasps his face lighting up with hope Galadriel looks at Frodo intensely Frodo looks down clutching the ring in his hand and then looks up at Galadriel who suddenly seems to rise in stature before his eyes making him afraid Galadriel suddenly laughs a slender Elfwoman once more clad in simple white her voice soft and sad Frodo realizes what her message is The Ring lies in the palm of Frodo's hand and his fingers close over it Meanwhile naked Lurtz's eyes follow Saruman alight with a mean intelligence The UrukHai are smearing themselves in white paint in a creepy ritualistic ceremony marking bodies faces and armor with the white hand of Isengard Lurtz is quickly armored with a breastplate leg guards and helmet and a sword is thrust into his hand Saruman addresses a crowd of 200 fully armed UrukHai In the late afternoon sun a scene gleams green gold and silver Beyond the river the land appears flat and empty formless and vague until it rises far away like a dark and dreary wall The sun on Lothlorien cannot enlighten the shadows beyond where one steps onto a wide fleet filled with a soft light where the walls are green and silver the roof is gold and in its midst is the trunk of the mighty Mallorn tree tapering toward its crown Celeborn steps forward to greet the guests His hair is long and silver his face grave and beautiful with no sign of age Next to him stands Galadriel the Lady of the Elves with hair of deep gold and timeless unsurpassed beauty Frodo looks at Galadriel standing silently beside Celeborn Moonlight catches the trace of tears on Boromir's face as Galadriel's eyes settle on Sam Gimli Legolas Merry Pippin Frodo and Sam are in a pavilion set among the trees near the fountain They lie on soft couches as Elves leave food and wine for them Aragorn kneels beside Boromir who looks at Aragorn in despair Boromir feels Aragorn's love for Minas Tirith and takes heart Aragorn returns Boromir's smile betraying his disquiet sadness only when Boromir looks away The Fellowship is asleep on their beds Bare feet tread soundlessly across the lawn and Frodo's eyes flicker open as if by instinct Galadriel her white dress glowing in the moonlight glances at him"
        }
      ]
    }
  ]
}