{
  "ground_truth": "Gandalf rises to his full height, his eyes flash, his shadow suddenly seems to fill the room. Bilbo lifts his knapsack and heads for the front door. Bilbo pulls out the ring and stares at it in his palm. With all his willpower, Bilbo allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor. Bilbo staggers out of Bag End and braces himself in the night air, pale and trembling, as if his loss of the ring has weakened him. Gandalf steps up behind. The ring is glinting on the floor, and Gandalf circles around it, a puzzled look on his face. Gandalf slowly reaches for the ring. Gandalf is sitting in front of the fire with his pipe, staring into the flickering flames. Frodo rushes into Bag End and stops to pick up the ring at his feet. Gandalf continues staring into the fire, as if locked in thought. Gandalf turns, his eyes locking onto the ring in Frodo's fingers. Gandalf holds out the envelope and Frodo drops the ring into it. Gandalf seals the envelope with wax and hands it to Frodo. Gandalf is already at the door and turns to Frodo. Gandalf hurries out the door, leaving Frodo standing alone in Bag End. The camera pushes in, and the hum of the ring comes up on the soundtrack. The camera pushes through the white paper to the ring, beneath which the whispered murmur of Black Speech can be heard. The huge dark tower of Barad-dûr is being rebuilt. Thousands of orcs crawl over the surface, hauling stone and iron up the towering heights, which grows and spreads across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Minas Morgul and charge toward the camera. A lone horseman gallops to the crest of a hill on the west road. On the main highway south to Minas Tirith, he looks toward the saw-toothed mountains of Mordor. He is seeping out across the blood-red sky, his face grave. He spurs his horse on, making his way down into the lower depths of the citadel. Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table. His eyes settle on one old parchment. He murmurs hurriedly to himself, reading. Farmer Maggot is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house. Terrified, Farmer Maggot cowers in his doorway, and Fang, his dog, whimpers and backs away. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses, sensing that something is amiss.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandalf elevates to his complete stature, his eyes blaze, his silhouette suddenly appears to occupy the chamber. Bilbo raises his backpack and proceeds for the front entrance. Bilbo extracts the ring and gazes at it in his hand. With all his determination, Bilbo permits the ring to gradually glide off his hand and drop to the ground. The minute ring lands with a dense thud on the wooden ground. Bilbo reels out of Bag End and steadies himself in the nocturnal air, pale and quivering, as if his deprivation of the ring has debilitated him. Gandalf steps up behind. The ring is shining on the ground, and Gandalf circles around it, a perplexed expression on his visage. Gandalf slowly reaches for the ring. Gandalf is seated in front of the blaze with his pipe, staring into the flickering embers. Frodo dashes into Bag End and halts to pick up the ring at his feet. Gandalf continues staring into the blaze, as if locked in contemplation. Gandalf turns, his eyes locking onto the ring in Frodo's fingers. Gandalf extends the envelope and Frodo drops the ring into it. Gandalf seals the envelope with wax and hands it to Frodo. Gandalf is already at the entrance and turns to Frodo. Gandalf rushes out the entrance, leaving Frodo standing solitary in Bag End. The camera advances in, and the hum of the ring arises on the soundtrack. The camera advances through the white paper to the ring, beneath which the whispered murmur of Black Speech can be heard. The massive dark spire of Barad-dûr is being reconstructed. Thousands of orcs clamber over the surface, hauling stone and iron up the lofty heights, which grows and spreads across the red-streaked sky, casting a shadowy shroud over the nightmarish vista. Nine Black Riders erupt out of Minas Morgul and charge toward the camera. A solitary horseman gallops to the summit of a hill on the west road. On the main thoroughfare south to Minas Tirith, he looks toward the jagged mountains of Mordor. He is seeping out across the blood-red sky, his face solemn. He urges his horse on, making his way down into the lower reaches of the fortress. Pages turn as Gandalf searches ancient scrolls and books placed high on a wooden table. His eyes fix on one old parchment. He mutters quickly to himself, reading. Farmer Maggot is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit dwelling. Terrified, Farmer Maggot cringes in his doorway, and Fang, his canine, whimpers and retreats. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front entrance. A creepy perspective from inside Bag End shows Frodo approaching the path. Frodo enters Bag End and immediately pauses, sensing that something is awry."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandalf is risen to his full height, his eyes are flashed, and the room is suddenly filled by his shadow. The knapsack is lifted by Bilbo, and he heads for the front door. The ring is pulled out by Bilbo, and it is stared at by him in his palm. With all his willpower, the ring is allowed by Bilbo to slowly slide off his palm and drop to the floor. A heavy thud is landed with by the tiny ring on the wooden floor. Bag End is staggered out of by Bilbo, and he braces himself in the night air, pale and trembling, as if he has been weakened by his loss of the ring. Behind steps Gandalf. The ring glints on the floor, and it is circled around by Gandalf, a puzzled look on his face. The ring is slowly reached for by Gandalf. The fire is sat in front of by Gandalf with his pipe, staring into the flickering flames. Frodo rushes into Bag End and picks up the ring at his feet. The fire continues to be stared into by Gandalf, as if he is locked in thought. Gandalf turns, locking his eyes onto the ring in Frodo's fingers. The envelope is held out by Gandalf, and the ring is dropped into it by Frodo. The envelope is sealed with wax by Gandalf and handed to Frodo. Gandalf is already turned to the door and Frodo. Out the door hurries Gandalf, leaving Frodo standing alone in Bag End. The camera is pushed in, and the hum of the ring comes up on the soundtrack. Through the white paper, the camera is pushed to the ring, beneath which the whispered murmur of Black Speech can be heard. They are rebuilding the huge dark tower of Barad-dûr. The surface is crawled over by thousands of orcs, hauling stone and iron up the towering heights, which grow and spread across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Minas Morgul bursts out nine Black Riders, and they charge toward the camera. To the crest of a hill on the west road gallops a lone horseman. As he looks toward the saw-toothed mountains of Mordor on the main highway south to Minas Tirith, the blood-red sky is seeped out across by him, his face grave. He spurs his horse on, making his way down into the lower depths of the citadel. Ancient scrolls and books are searched by Gandalf as pages flip on a wooden table where they are placed high. One old parchment is settled on by his eyes. He hurriedly murmurs to himself, reading. In his garden, Farmer Maggot chops wood. Horse nostrils are snorted as the shadow of a black rider looms over a Hobbit house. Terrified, the doorway is cowered in by Farmer Maggot, and his dog, Fang, whimpers and backs away. Away at speed gallops the black rider. Sam is farewelled by Frodo outside Bag End, and the front door is headed towards by him. A creepy point of view from inside Bag End shows Frodo coming up the path. Bag End is entered by Frodo, and he immediately pauses, sensing that something is amiss."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandalf rises, his eyes flash, and his shadow fills the room. Bilbo lifts his knapsack, heads for the door, and stares at the ring in his palm. With effort, he lets it slide off and drop with a thud. Bilbo staggers out, pale and trembling, as if weakened by the loss. Gandalf steps up, puzzled, and reaches for the glinting ring. He sits by the fire, deep in thought. Frodo rushes in, picks up the ring, and Gandalf hands him an envelope. Frodo drops the ring in, and Gandalf seals it with wax. Gandalf leaves, and the camera focuses on the ring, with the Black Speech murmuring. Barad-dûr is rebuilt, with orcs hauling stone and iron. Nine Black Riders charge from Minas Morgul. A lone horseman on the west road looks toward Mordor's mountains, then rides into the citadel. Gandalf searches scrolls, finding an old parchment. Farmer Maggot chops wood, terrified as a black rider looms. The rider gallops away. Frodo farewells Sam and enters Bag End, sensing something amiss."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandalf rises, eyes flashing, shadow filling the room. Bilbo lifts his knapsack, heads for the door, pulls out the ring, and lets it drop to the floor with a thud. Staggering out, pale and trembling, he seems weakened. Gandalf, puzzled, circles the glinting ring, then sits by the fire. Frodo enters, picks up the ring, and Gandalf seals it in an envelope, handing it to Frodo before leaving. The camera focuses on the ring, with Black Speech murmurs. Barad-dûr is rebuilt, orcs swarming, casting shadows. Nine Black Riders charge from Minas Morgul. A horseman on the west road looks toward Mordor, then rides into the citadel. Gandalf searches scrolls, finding an old parchment. Farmer Maggot chops wood, cowers as a black rider looms, then gallops away. Frodo farewells Sam, enters Bag End, sensing something amiss."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandalf, with a commanding presence, rises to his full and imposing height. His eyes flash with intensity, and his shadow suddenly seems to expand, filling the entire room with an overwhelming presence. Meanwhile, Bilbo, feeling the weight of the moment, lifts his knapsack and makes his way toward the front door. As he does so, he pulls out the ring and stares at it intently, holding it in the palm of his hand. With all the willpower he can muster, Bilbo allows the ring to slowly slide off his palm, letting it drop to the floor. The tiny ring lands with a surprisingly heavy thud on the wooden floorboards. Bilbo then staggers out of Bag End, bracing himself against the cool night air. He appears pale and trembling, as if the loss of the ring has somehow weakened him. Gandalf steps up behind him, observing the scene. The ring glints on the floor, and Gandalf circles around it, a puzzled expression on his face. He slowly reaches for the ring, contemplating its significance. Later, Gandalf is seated in front of the fire, his pipe in hand, staring deeply into the flickering flames. Frodo rushes into Bag End, stopping to pick up the ring at his feet. Gandalf continues to stare into the fire, as if he is locked in deep thought. He then turns, his eyes locking onto the ring held in Frodo's fingers. Gandalf holds out an envelope, and Frodo carefully drops the ring into it. Gandalf seals the envelope with wax and hands it over to Frodo. Already at the door, Gandalf turns to Frodo one last time before hurrying out, leaving Frodo standing alone in Bag End. The camera pushes in, and the hum of the ring rises on the soundtrack. The camera pushes through the white paper to reveal the ring, beneath which the whispered murmur of the Black Speech can be heard. The huge, dark tower of Barad-dûr is in the process of being rebuilt. Thousands of orcs crawl over its surface, hauling stone and iron up the towering heights, which grow and spread across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Minas Morgul, charging directly toward the camera. A lone horseman gallops to the crest of a hill on the west road. On the main highway leading south to Minas Tirith, he looks toward the saw-toothed mountains of Mordor. He is seeping out across the blood-red sky, his face grave and determined. He spurs his horse onward, making his way down into the lower depths of the citadel. Pages flip rapidly as Gandalf searches through ancient scrolls and books placed high on a wooden table. His eyes settle on one particularly old parchment, and he murmurs hurriedly to himself as he reads. Meanwhile, Farmer Maggot is chopping wood in his garden. The snorting of horse nostrils is heard as the shadow of a black rider looms ominously over a Hobbit house. Terrified, Farmer Maggot cowers in his doorway, and Fang, his dog, whimpers and backs away. The black rider then gallops away at speed. Frodo bids farewell to Sam outside Bag End and heads toward the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses, sensing that something is amiss."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a commanding and authoritative presence, Gandalf rises to his full, imposing height, exuding an air that is both powerful and awe-inspiring. His eyes flash with an intense light, while his shadow suddenly appears to expand and stretch, as if it is filling the entire room with an overwhelming presence. At the same time, Bilbo, feeling the weight and gravity of the moment, lifts his knapsack and begins to make his way toward the front door. As he makes this determined journey, he pulls out the ring and stares at it intently, holding it carefully in the palm of his hand. With all the willpower he can possibly muster, Bilbo allows the ring to slowly slide off his palm, letting it drop to the floor below. The tiny ring lands with a surprisingly heavy thud on the wooden floorboards. Bilbo then staggers out of Bag End, bracing himself against the cool, refreshing night air. He appears pale and trembling, as though the loss of the ring has somehow drained his strength. Gandalf steps up behind him, observing the entire scene with keen attention. The ring glints faintly on the floor, and Gandalf circles around it, a puzzled expression forming on his face. He slowly reaches for the ring, contemplating its immense significance. Later, Gandalf is seated quietly in front of the warm, crackling fire, his pipe in hand, staring deeply into the flickering flames. Frodo rushes into Bag End, coming to a sudden stop to pick up the ring at his feet. Gandalf continues to gaze into the fire, as if he is locked in deep thought and contemplation. He then turns, his eyes locking purposefully onto the ring held in Frodo's fingers. Gandalf holds out an envelope, and Frodo carefully drops the ring into it. Gandalf seals the envelope with wax and hands it over to Frodo. Already at the door, Gandalf turns to Frodo one last time before hurrying out, leaving Frodo standing alone in Bag End. The camera dramatically pushes in, and the hum of the ring rises ominously on the soundtrack. The camera pushes through the white paper to reveal the ring, beneath which the whispered murmur of the Black Speech can be heard. The huge, dark tower of Barad-dûr is in the active process of being rebuilt. Thousands of orcs crawl over its surface, hauling stone and iron up the towering heights, which grow and spread across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Minas Morgul, charging directly toward the camera. A lone horseman gallops to the crest of a hill on the west road. On the main highway leading south to Minas Tirith, he looks toward the saw-toothed mountains of Mordor. He spreads out across the blood-red sky, his face grave and determined. He spurs his horse onward, making his way down into the lower depths of the citadel. Pages flip rapidly as Gandalf searches through ancient scrolls and books placed high upon a wooden table. His eyes settle on one particularly old parchment, and he murmurs hurriedly to himself as he reads. Meanwhile, Farmer Maggot is busy chopping wood in his garden. The snorting of horse nostrils is heard as the shadow of a black rider looms ominously over a quiet Hobbit house. Terrified, Farmer Maggot cowers in his doorway, with Fang, his dog, whimpering and backing away. The black rider then gallops away swiftly. Frodo bids farewell to Sam outside Bag End and heads determinedly toward the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses, sensing that something is strangely amiss."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandalf slowly rises to his full height, his presence becoming more imposing as his eyes flash with intensity, and his shadow expands dramatically, seeming to fill the entire room with its ominous presence. Meanwhile, Bilbo, feeling the weight of the moment, lifts his knapsack with a sense of finality and makes his way toward the front door. As he walks, he reaches into his pocket and pulls out the ring, holding it in his palm and staring at it with a mix of longing and determination. Summoning all his willpower, he allows the ring to gradually slide off his palm, watching as it falls and lands with a surprisingly heavy thud on the wooden floor. The sound echoes in the room, marking the end of an era. Bilbo, visibly shaken and weakened by the act, staggers out of Bag End, stepping into the night air where he braces himself, pale and trembling, as if the loss of the ring has drained him of his strength. Gandalf steps up behind him, his attention drawn to the ring glinting on the floor. He circles around it, his face a mask of puzzlement as he contemplates its significance. With deliberate slowness, Gandalf reaches for the ring, his mind deep in thought. Later, Gandalf sits in front of the fire, his pipe in hand, staring into the flickering flames as if searching for answers within them. Suddenly, Frodo rushes into Bag End, his eyes immediately catching sight of the ring at his feet. He stops to pick it up, holding it carefully in his fingers. Gandalf, still lost in thought, continues to stare into the fire until he turns, his eyes locking onto the ring in Frodo's grasp. With a sense of urgency, Gandalf holds out an envelope, and Frodo obediently drops the ring into it. Gandalf seals the envelope with wax, ensuring its contents are secure, and hands it back to Frodo with a solemn expression. Without wasting a moment, Gandalf is already at the door, turning to give Frodo one last look before hurrying out, leaving Frodo standing alone in Bag End, the weight of responsibility now on his shoulders. As the camera pushes in, the hum of the ring rises on the soundtrack, creating an eerie atmosphere. The camera continues to push through the white paper of the envelope to reveal the ring, beneath which the whispered murmur of Black Speech can be heard, hinting at the dark power it holds. In a distant land, the huge dark tower of Barad-dûr is being rebuilt, with thousands of orcs crawling over its surface, hauling stone and iron up the towering heights. The structure grows and spreads across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Suddenly, nine Black Riders burst out of Minas Morgul, charging toward the camera with terrifying speed. Meanwhile, a lone horseman gallops to the crest of a hill on the west road, pausing to look toward the saw-toothed mountains of Mordor. His face is grave as he takes in the blood-red sky, and he spurs his horse onward, descending into the lower depths of the citadel. In a library, pages flip rapidly as Gandalf searches through ancient scrolls and books placed high on a wooden table, his eyes finally settling on one old parchment. He murmurs hurriedly to himself, reading the text with growing urgency. Elsewhere, Farmer Maggot is chopping wood in his garden when the snorting nostrils of a horse and the looming shadow of a black rider cast a menacing presence over his Hobbit house. Terrified, Farmer Maggot cowers in his doorway, while Fang, his dog, whimpers and backs away. The black rider, having instilled fear, gallops away at speed. Back at Bag End, Frodo farewells Sam outside and heads toward the front door. From a creepy point of view inside Bag End, Frodo is seen coming up the path, his demeanor cautious. As Frodo enters Bag End, he immediately pauses, a sense of unease washing over him as he senses that something is amiss."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandalf rises to his full height, his presence filling the room as Bilbo, clutching his knapsack, heads for the front door. With great effort, Bilbo lets the ring slide from his palm to the floor, its heavy thud echoing in the room. Staggering out of Bag End, he braces himself against the night air, visibly weakened by the ring's loss. Gandalf, puzzled, circles the glinting ring before reaching for it. Later, he sits by the fire, deep in thought, as Frodo rushes in to retrieve the ring. Gandalf, eyes fixed on the ring in Frodo's hand, seals it in an envelope and hands it to him before hurrying out, leaving Frodo alone. The camera zooms in on the ring, its hum growing louder, transitioning to the dark tower of Barad-dûr being rebuilt by orcs under a shadowy sky. Nine Black Riders charge from Minas Morgul, while a lone horseman surveys the saw-toothed mountains of Mordor before descending into the citadel. Gandalf searches through ancient scrolls, murmuring as he finds a significant parchment. Meanwhile, Farmer Maggot, chopping wood, is terrified by a black rider's shadow looming over his house, causing him and his dog to cower. The rider gallops away as Frodo bids farewell to Sam and approaches Bag End, sensing something amiss as he enters."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandalf, the wise old wizard known for his pivotal role in Middle-earth's history, rises to his full height, his eyes flash, his shadow suddenly seems to fill the room. Bilbo lifts his knapsack, packed with essentials for the journey to Rivendell, and heads for the front door. Bilbo pulls out the ring, a trinket of immense power forged in the fires of Mount Doom, and stares at it in his palm. With all his willpower, Bilbo allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor of Bag End, conveying its supernatural density. Bilbo staggers out of Bag End and braces himself in the night air, pale and trembling, as if his loss of the ring has weakened him as much as it did Gollum, its previous bearer. Gandalf steps up behind, his mind racing with thoughts of the ring's history and dangers. The ring is glinting on the floor, and Gandalf circles around it, a puzzled look on his face as he considers its dark power. Gandalf slowly reaches for the ring, cautious of its influence. Gandalf is sitting in front of the fire with his pipe, an old habit from his travels through the Shire, staring into the flickering flames. Frodo rushes into Bag End and stops to pick up the ring at his feet. Gandalf continues staring into the fire, as if locked in thought about the fate of Middle-earth. Gandalf turns, his eyes locking onto the ring in Frodo's fingers with a mix of hope and dread. Gandalf holds out the envelope, marked with the emblem of the White Council, and Frodo drops the ring into it. Gandalf seals the envelope with wax and hands it to Frodo, ensuring the ring is secured for its perilous journey. Gandalf is already at the door and turns to Frodo, understanding the gravity of the quest ahead. Gandalf hurries out the door, leaving Frodo standing alone in Bag End with the weight of destiny upon him. The camera pushes in, and the hum of the ring comes up on the soundtrack, a foreboding sound tied to Sauron's influence. The camera pushes through the white paper to the ring, beneath which the whispered murmur of Black Speech, the tongue of Mordor, can be heard. The huge dark tower of Barad-dûr, Sauron's stronghold, is being rebuilt. Thousands of orcs crawl over the surface, hauling stone and iron up the towering heights, which grows and spreads across the red-streaked sky, casting a shadowy pall over the nightmarish landscape of Mordor. Nine Black Riders, known as the Nazgûl, burst out of Minas Morgul and charge toward the camera, black cloaks billowing behind them. A lone horseman, later revealed to be Aragorn, gallops to the crest of a hill on the west road. On the main highway south to Minas Tirith, Gondor's capital, he looks toward the saw-toothed mountains of Mordor. He is seeping out across the blood-red sky, his face grave with the knowledge of the enemy's strength. He spurs his horse on, making his way down into the lower depths of the citadel. Pages flip as Gandalf searches ancient scrolls and books in the vast library of Minas Tirith, placed high on a wooden table. His eyes settle on one old parchment, likely penned by Isildur, the ring's first human bearer. He murmurs hurriedly to himself, reading. Farmer Maggot is chopping wood in his garden, a peaceful scene disrupted by danger. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house, a harbinger of dread. Terrified, Farmer Maggot cowers in his doorway, and Fang, his dog, whimpers and backs away, sensing the evil presence. The black rider gallops away at speed, intent on its mission. Frodo farewells Sam outside Bag End, entrusting his friend with loyalty unmatched, and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path, a feeling of foreboding hanging in the air. Frodo enters Bag End and immediately pauses, sensing that something is amiss, aware of the dark presence tied to the ring's power."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room  With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor  The tiny ring lands with a heavy thud on the wooden floor  Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him  Gandalf steps up behind  The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face  Gandalf slowly reaches for the ring  Gandalf is sitting in front of the fire with his pipe staring into the flickering flames  Frodo rushes into Bag End and stops to pick up the ring at his feet  Gandalf continues staring into the fire as if locked in thought  Gandalf turns his eyes locking onto the ring in Frodo's fingers  Gandalf holds out the envelope and Frodo drops the ring into it  Gandalf seals the envelope with wax and hands it to Frodo  Gandalf is already at the door and turns to Frodo  Gandalf hurries out the door leaving Frodo standing alone in Bag End  The camera pushes in and the hum of the ring comes up on the soundtrack  The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard  The huge dark tower of Baraddûr is being rebuilt  Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape  Nine Black Riders burst out of Minas Morgul and charge toward the camera  Bilbo lifts his knapsack and heads for the front door  Bilbo pulls out the ring and stares at it in his palm  With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor  The tiny ring lands with a heavy thud on the wooden floor  Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him  Gandalf steps up behind  The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face  Gandalf slowly reaches for the ring  Gandalf is sitting in front of the fire with his pipe staring into the flickering flames  Frodo rushes into Bag End and stops to pick up the ring at his feet  Gandalf continues staring into the fire as if locked in thought  Gandalf turns his eyes locking onto the ring in Frodo's fingers  Gandalf holds out the envelope and Frodo drops the ring into it  Gandalf seals the envelope with wax and hands it to Frodo  Gandalf is already at the door and turns to Frodo  Gandalf hurries out the door leaving Frodo standing alone in Bag End  The camera pushes in and the hum of the ring comes up on the soundtrack  The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard  The huge dark tower of Baraddûr is being rebuilt  Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape  Nine Black Riders burst out of Minas Morgul and charge toward the camera  A lone horseman gallops to the crest of a hill on the west road  On the main highway south to Minas Tirith  he looks toward the sawtoothed mountains of Mordor  He is seeping out across the bloodred sky his face grave  He spurs his horse on making his way down into the lower depths of the citadel  Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table  His eyes settle on one old parchment  He murmurs hurriedly to himself reading  Farmer Maggot is chopping wood in his garden  Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house  Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away  The black rider gallops away at speed  Frodo farewells Sam outside Bag End and heads towards the front door  A creepy point of view from inside Bag End shows Frodo coming up the path  Frodo enters Bag End and immediately pauses sensing that something is amiss"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room. Bilbo lifts his knapsack and heads for the front door. Bilbo pulls out the ring and stares at it in his palm. With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor. Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him. Gandalf steps up behind. The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face. Gandalf slowly reaches for the ring. Gandalf is sitting in front of the fire with his pipe staring into the flickering flames. Frodo rushes into Bag End and stops to pick up the ring at his feet. Gandalf continues staring into the fire as if locked in thought. Gandalf turns his eyes locking onto the ring in Frodo's fingers. Gandalf holds out the envelope and Frodo drops the ring into it. Gandalf seals the envelope with wax and hands it to Frodo. Gandalf is already at the door and turns to Frodo. Gandalf hurries out the door leaving Frodo standing alone in Bag End. The camera pushes in and the hum of the ring comes up on the soundtrack. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard. The huge dark tower of Baraddûr is being rebuilt. Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Minas Morgul and charge toward the camera. A lone horseman gallops to the crest of a hill on the west road. On the main highway south to Minas Tirith. he looks toward the sawtoothed mountains of Mordor. He is seeping out across the bloodred sky his face grave. He spurs his horse on making his way down into the lower depths of the citadel. Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table. His eyes settle on one old parchment. He murmurs hurriedly to himself reading. Farmer Maggot is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house. Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses sensing that something is amiss."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room. Bilbo lifts his knapsack and heads for the front door. Bilbo pulls out the ring and stares at it in his palm. With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor. Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him. Gandalf steps up behind. The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face. Gandalf slowly reaches for the ring. Gandalf is sitting in front of the fire with his pipe staring into the flickering flames. Frodo rushes into Bag End and stops to pick up the ring at his feet. Gandalf continues staring into the fire as if locked in thought. Gandalf turns his eyes locking onto the ring in Frodo's fingers. Gandalf holds out the envelope and Frodo drops the ring into it. Gandalf seals the envelope with wax and hands it to Frodo. Gandalf is already at the door and turns to Frodo. Gandalf hurries out the door leaving Frodo standing alone in Bag End. The camera pushes in and the hum of the ring comes up on the soundtrack. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard. The huge dark tower of Baraddûr is being rebuilt. Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Minas Morgul and charge toward the camera. A lone horseman gallops to the crest of a hill on the west road. On the main highway south to Minas Tirith. he looks toward the sawtoothed mountains of Mordor. He is seeping out across the bloodred sky his face grave. He spurs his horse on making his way down into the lower depths of the citadel. Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table. His eyes settle on one old parchment. He murmurs hurriedly to himself reading. Farmer Maggot is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house. Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses sensing that something is amiss."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room. Bilbo lifts his knapsack and heads for the front door. Bilbo pulls out the ring and stares at it in his palm. With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor. Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him. Gandalf steps up behind. The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face. Gandalf slowly reaches for the ring. Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table. His eyes settle on one old parchment. He murmurs hurriedly to himself reading. Farmer Maggot is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house. Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses sensing that something is amiss."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room. Bilbo lifts his knapsack and heads for the front door. Bilbo pulls out the ring and stares at it in his palm. With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor. The black rider gallops away at speed. Frodo farewells Sam outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows Frodo coming up the path. Frodo enters Bag End and immediately pauses sensing that something is amiss."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dobby rises to his full height, his eyes flash, his shadow suddenly seems to fill the room. A dragon lifts his knapsack and heads for the front door. The dragon pulls out the ring and stares at it in his palm. With all his willpower, the dragon allows the ring to slowly slide off his palm and drop to the floor. The tiny ring lands with a heavy thud on the wooden floor. The dragon staggers out of Bag End and braces himself in the night air, pale and trembling, as if his loss of the ring has weakened him. A unicorn steps up behind. The ring is glinting on the floor, and the unicorn circles around it, a puzzled look on her face. The unicorn slowly reaches for the ring. The unicorn is sitting in front of the fire with her pipe, staring into the flickering flames. A griffin rushes into Bag End and stops to pick up the ring at his feet. The unicorn continues staring into the fire, as if locked in thought. The unicorn turns, her eyes locking onto the ring in the griffin's fingers. The unicorn holds out the envelope and the griffin drops the ring into it. The unicorn seals the envelope with wax and hands it to the griffin. The unicorn is already at the door and turns to the griffin. The unicorn hurries out the door, leaving the griffin standing alone in Bag End. The camera pushes in, and the hum of the ring comes up on the soundtrack. The camera pushes through the white paper to the ring, beneath which the whispered murmur of Black Speech can be heard. The huge dark tower of Barad-dûr is being rebuilt. Thousands of centaurs crawl over the surface, hauling stone and iron up the towering heights, which grows and spreads across the red-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine Gorgons burst out of Minas Morgul and charge toward the camera. A lone phoenix gallops to the crest of a hill on the west road. On the main highway south to Minas Tirith, it looks toward the saw-toothed mountains of Mordor. It is seeping out across the blood-red sky, its face grave. It spurs its horse on, making its way down into the lower depths of the citadel. Pages flip as a mermaid searches ancient scrolls and books placed high on a wooden table. Her eyes settle on one old parchment. She murmurs hurriedly to herself, reading. A centaur is chopping wood in his garden. Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house. Terrified, the centaur cowers in his doorway, and Fluffy, his dog, whimpers and backs away. The black rider gallops away at speed. A fairy farewells an elf outside Bag End and heads towards the front door. A creepy point of view from inside Bag End shows the fairy coming up the path. The fairy enters Bag End and immediately pauses, sensing that something is amiss."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gandalf rises to his full height, his eyes flash, his shadow suddenly seems to fill the hallway. Bilbo lifts his briefcase and heads for the back gate. Bilbo pulls out the pebble and stares at it in his palm. With all his willpower, Bilbo allows the pebble to slowly slide off his palm and drop to the carpet. The tiny pebble lands with a heavy thud on the tiled floor. Bilbo staggers out of Greenhill Lodge and braces himself in the night breeze, pale and trembling, as if his loss of the pebble has weakened him. Gandalf steps up behind. The pebble is glinting on the floor, and Gandalf circles around it, a puzzled look on his face. Gandalf slowly reaches for the pebble. Gandalf is sitting in front of the heater with his cigar, staring into the flickering coals. Frodo rushes into Greenhill Lodge and stops to pick up the pebble at his feet. Gandalf continues staring into the coals, as if locked in thought. Gandalf turns, his eyes locking onto the pebble in Frodo's fingers. Gandalf holds out the folder and Frodo drops the pebble into it. Gandalf seals the folder with glue and hands it to Frodo. Gandalf is already at the entrance and turns to Frodo. Gandalf hurries out the entrance, leaving Frodo standing alone in Greenhill Lodge. The camera pushes in, and the hum of the pebble comes up on the soundtrack. The camera pushes through the white fabric to the pebble, beneath which the whispered murmur of Black Speech can be heard. The huge dark fortress of Dol Guldur is being rebuilt. Thousands of goblins crawl over the surface, hauling brick and steel up the towering heights, which grows and spreads across the blue-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine Black Riders burst out of Isengard and charge toward the camera. A lone cyclist pedals to the crest of a hill on the eastern road. On the main trail north to Bree, he looks toward the jagged cliffs of Mordor. He is seeping out across the blood-red sky, his face grave. He spurs his bike on, making his way down into the lower depths of the citadel. Pages flip as Gandalf searches ancient manuscripts and journals placed high on a marble table. His eyes settle on one old scroll. He murmurs hurriedly to himself, reading. Farmer Maggot is trimming hedges in his garden. Snorting donkey nostrils as the shadow of a black rider looms over a Hobbit barn. Terrified, Farmer Maggot cowers in his doorway, and Fang, his cat, whimpers and backs away. The black rider gallops away at speed. Frodo farewells Sam outside Greenhill Lodge and heads towards the back gate. A creepy point of view from inside Greenhill Lodge shows Frodo coming up the lane. Frodo enters Greenhill Lodge and immediately pauses, sensing that something is amiss."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gandalf stretches to his full height, his eyes twinkle, his shadow suddenly seems to sway across the room. Bilbo grabs his knapsack and wanders to the front door. Bilbo takes out the ring and glances at it in his palm. With all his willpower, Bilbo permits the ring to casually roll off his palm and settle on the floor. The tiny ring settles with a gentle clang on the wooden floor. Bilbo totters out of Bag End and steadies himself in the night air, pale and shaking, as if his lack of the ring has drained him. Gandalf steps in behind. The ring is gleaming on the floor, and Gandalf paces around it, a puzzled look on his face. Gandalf gently reaches for the ring. Gandalf is reclining in front of the fire with his pipe, observing the flickering flames. Frodo dashes into Bag End and stoops to scoop up the ring at his feet. Gandalf continues observing the fire, as if lost in thought. Gandalf turns, his eyes fixing on the ring in Frodo's fingers. Gandalf presents the envelope and Frodo places the ring into it. Gandalf seals the envelope with glue and hands it to Frodo. Gandalf is already at the door and turns to Frodo. Gandalf races out the door, leaving Frodo standing alone in Bag End. The camera pulls back, and the hum of the ring rises on the soundtrack. The camera dives through the white paper to the ring, beneath which the whispered chant of Black Speech can be heard. The huge dark tower of Barad-dûr is being constructed. Thousands of orcs creep over the surface, lugging stone and iron up the towering heights, which expands and extends across the red-streaked sky, casting a dim pall over the nightmarish landscape. Nine Black Riders surge out of Minas Morgul and bolt toward the camera. A lone horseman trots to the crest of a hill on the west road. On the main highway south to Minas Tirith, he gazes toward the saw-toothed mountains of Mordor. He is oozing out across the blood-red sky, his face solemn. He nudges his horse forward, advancing his way down into the lower levels of the citadel. Pages flutter as Gandalf examines ancient scrolls and books scattered high on a wooden table. His eyes fixate on one old parchment. He mutters quickly to himself, reciting. Farmer Maggot is pruning shrubs in his garden. Sniffing horse nostrils as the shadow of a black rider casts over a Hobbit house. Frightened, Farmer Maggot crouches in his doorway, and Fang, his dog, whines and scuttles away. The black rider gallops away with speed. Frodo bids farewell to Sam outside Bag End and proceeds toward the front door. A creepy point of view from inside Bag End observes Frodo approaching the path. Frodo steps into Bag End and immediately halts, sensing that something is amiss."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Saruman rises to his full height, his eyes flash, his cap suddenly seems to fill the room. Pippin lifts his satchel and heads for the back window. Pippin pulls out the locket and stares at it in his shoe. With all his willpower, Pippin allows the locket to slowly slide off his shoe and drop to the carpet. The tiny locket lands with a heavy thud on the tiled carpet. Pippin staggers out of Rivendell and braces himself in the morning fog, pale and trembling, as if his loss of the locket has weakened him. Saruman steps up behind. The locket is glinting on the carpet, and Saruman circles around it, a puzzled look on his face. Saruman slowly reaches for the locket. Saruman is sitting in front of the lamp with his mug, staring into the flickering shadows. Merry rushes into Rivendell and stops to pick up the locket at his ankles. Saruman continues staring into the lamp, as if locked in thought. Saruman turns, his eyes locking onto the locket in Merry's toes. Saruman holds out the basket and Merry drops the locket into it. Saruman seals the basket with thread and hands it to Merry. Saruman is already at the window and turns to Merry. Saruman hurries out the window, leaving Merry standing alone in Rivendell. The lens pushes in, and the hum of the locket comes up on the soundtrack. The lens pushes through the blue cloth to the locket, beneath which the whispered murmur of Elvish Speech can be heard. The huge dark fortress of Dol Guldur is being rebuilt. Thousands of trolls crawl over the surface, hauling clay and steel up the towering heights, which grows and spreads across the yellow-streaked sky, casting a shadowy pall over the nightmarish landscape. Nine White Banners burst out of Dol Amroth and charge toward the lens. A lone cartographer gallops to the crest of a hill on the eastern path. On the main highway north to Fornost, he looks toward the jagged towers of Rohan. He is seeping out across the cloudless sky, his face grave. He spurs his mule on, making his way down into the lower depths of the citadel. Leaves flip as Saruman searches ancient manuscripts and pamphlets placed high on a pine table. His eyes settle on one old leaflet. He murmurs hurriedly to himself, reading. Mill Worker is chopping vegetables in his barn. Snorting ox nostrils as the shadow of a white banner looms over a Dwarf house. Terrified, Mill Worker cowers in his archway, and Whiskers, his cat, whimpers and backs away. The white banner gallops away at speed. Merry farewells Legolas outside Rivendell and heads towards the back window. A creepy point of view from inside Rivendell shows Merry coming up the trail. Merry enters Rivendell and immediately pauses, sensing that something is amiss."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Saruman climbs to his full height, his hands flicker, his silhouette suddenly seems to fill the room. Boromir raises his backpack and heads for the patio. Boromir pulls out the locket and glances at it in his palm. With all his courage, Boromir allows the locket to gently glide off his palm and land on the carpet. The tiny locket lands with a heavy thud on the wooden floor. Boromir stumbles out of Bag End and braces himself in the morning air, weary and trembling, as if his release of the locket has weakened him. Saruman steps up beside him. The locket is shining on the floor, and Saruman marches around it, a curious look on his face. Saruman slowly stretches for the locket. Saruman is sitting in front of the hearth with his cane, gazing into the flickering flames. Merry dashes into Bag End and pauses to scoop up the locket at his feet. Saruman continues gazing into the flames, as if absorbed in thought. Saruman turns, his gaze locking onto the locket in Merry's fingers. Saruman holds out the satchel and Merry places the locket into it. Saruman seals the satchel with twine and hands it to Merry. Saruman is already at the window and turns to Merry. Saruman hastens out the window, leaving Merry standing alone in Bag End. The lens zooms in, and the thrum of the locket rises on the soundtrack. The lens moves through the white parchment to the locket, beneath which the whispered murmur of Black Speech can be heard. The huge dark citadel of Orthanc is being reconstructed. Thousands of trolls scurry over the surface, dragging timber and steel up the sky-high peaks, which rise and stretch across the crimson-tinged sky, casting a gloomy shroud over the dreamlike terrain. Nine Dark Riders burst out of Dol Guldur and rush toward the lens. A lone rider sprints to the summit of a hill on the east road. On the main track north to Rivendell, he peers toward the jagged mountains of Ered Mithrin. He is spreading across the crimson sky, his expression grave. He drives his horse onward, making his way down into the lower reaches of the fortress. Pages flutter as Saruman examines ancient maps and manuscripts placed high on a stone table. His eyes fixate on one old manuscript. He whispers rapidly to himself, deciphering. Farmer Cotton is chopping logs in his orchard. Snorting horse nostrils as the specter of a dark rider stretches over a Hobbit home. Terrified, Farmer Cotton recoils in his doorway, and Patch, his dog, whimpers and retreats. The dark rider dashes away at speed. Merry farewells Pippin outside Bag End and progresses toward the front porch. An eerie viewpoint from inside Bag End shows Merry approaching up the path. Merry steps into Bag End and immediately halts, perceiving that something is off."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gandalf elevates to his full height, his eyes blaze, his outline suddenly seems to occupy the entire space. Bilbo lifts his suitcase and heads for the side entrance. Bilbo extracts the pebble and gawks at it in his hand. With all his determination, Bilbo permits the pebble to gently roll off his hand and tumble to the ground. The small pebble lands with a loud clank on the tiled ground. Bilbo totters out of Bag End and steadies himself in the morning breeze, pale and quivering, as if his letting go of the pebble has enfeebled him. Gandalf strides up behind. The pebble is shimmering on the ground, and Gandalf wanders around it, a curious expression on his face. Gandalf gradually reaches for the pebble. Gandalf is lounging in front of the fountain with his flute, peering into the flickering water. Frodo dashes into Bag End and halts to scoop up the pebble at his toes. Gandalf remains peering into the water, as if trapped in thought. Gandalf swivels, his eyes locking onto the pebble in Frodo's grasp. Gandalf offers the package and Frodo places the pebble into it. Gandalf seals the package with tape and hands it to Frodo. Gandalf is already at the gate and turns to Frodo. Gandalf rushes out the gate, leaving Frodo standing alone in Bag End. The camera zooms in, and the drone of the pebble rises on the soundtrack. The camera moves through the white envelope to the pebble, beneath which the hushed murmur of Black Speech can be discerned. The immense dark spire of Barad-dûr is being restored. Thousands of goblins scurry over the facade, dragging timber and steel up the towering summits, which extend and expand across the crimson-tinged sky, casting a murky shadow over the nightmarish scenery. Nine Black Riders erupt out of Minas Morgul and sprint toward the camera. A solitary rider sprints to the top of a hill on the western path. On the main route south to Minas Tirith, he gazes toward the jagged peaks of Mordor. He is leaking out across the scarlet sky, his face solemn. He urges his steed onward, making his way down into the lower reaches of the citadel. Pages twirl as Gandalf inspects ancient manuscripts and tomes placed high on a stone table. His eyes fix on one ancient leaflet. He mutters quickly to himself, deciphering. Farmer Maggot is slicing herbs in his orchard. Sniffing barn nostrils as the outline of a black rider towers over a Hobbit structure. Petrified, Farmer Maggot crouches in his archway, and Fang, his dog, whines and retreats. The black rider dashes away with haste. Frodo bids Sam goodbye outside Bag End and heads towards the side entrance. An eerie point of view from inside Bag End shows Frodo approaching the track. Frodo enters Bag End and immediately halts, perceiving that something is off."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Trevor expands to his full width, his ears sparkle, his silhouette instantly seems to occupy the cavern. Oliver lifts his briefcase and zips towards the window. Oliver pulls out the marble and gawks at it in his grip. With all his courage, Oliver lets the marble slowly tumble off his grip and plummet to the ground. The tiny marble lands with an echoing clang on the tiled ground. Oliver stumbles out of Oak Hollow and steadies himself in the morning breeze, flushed and quivering, as if his shedding of the marble has drained him. Trevor strolls up behind. The marble is sparkling on the ground, and Trevor paces around it, a baffled expression on his face. Trevor gingerly reaches for the marble. Trevor is lounging in front of the fireplace with his mug, gazing into the roaring flames. Felix dashes into Oak Hollow and halts to scoop up the marble at his toes. Trevor continues gazing into the fireplace, as if deep in meditation. Trevor swivels, his gaze fixing onto the marble in Felix's grasp. Trevor extends the pouch and Felix drops the marble into it. Trevor seals the pouch with string and hands it to Felix. Trevor is already at the window and glances at Felix. Trevor sprints out the window, leaving Felix standing alone in Oak Hollow. The camera zooms in, and the buzz of the marble fills the audio. The camera zooms through the white linen to the marble, under which the whispered hum of Ancient Script can be heard. The enormous bright spire of Crystal Peak is being constructed. Hundreds of goblins swarm over the surface, lifting timber and gold up the towering altitudes, which rise and stretch across the blue-striped horizon, casting a radiant glow over the idyllic scenery. Nine White Riders explode out of Velvet Citadel and dash toward the camera. A lone cyclist rolls to the rim of a hill on the east path. On the primary freeway north to Crystal Haven, he glances toward the jagged cliffs of Valyria. He is spreading out across the dusk-orange horizon, his expression solemn. He urges his bike on, maneuvering his way down into the deeper recesses of the fortress. Pages turn as Trevor examines modern magazines and tomes placed low on a marble bench. His gaze lands on one new booklet. He murmurs quickly to himself, skimming. Baker Crumble is slicing bread in his kitchen. Wheezing goat nostrils as the outline of a white rider casts over a Giant cottage. Frightened, Baker Crumble shrinks in his gate, and Rex, his cat, moans and slinks away. The white rider dashes away at pace. Felix bids farewell to Joe outside Oak Hollow and zips towards the window. A creepy perspective from outside Oak Hollow shows Felix approaching the road. Felix enters Oak Hollow and instantly halts, sensing that something is off."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandalf intimidates Bilbo into relinquishing the ring, which falls to the floor with a heavy thud, leaving Bilbo weakened as he exits Bag End. Gandalf, intrigued by the ring, later seals it in an envelope that Frodo receives. Gandalf then departs, leaving Frodo alone. The camera focuses on the ring, its ominous presence underscored by a murmuring Black Speech. Meanwhile, Barad-dûr is being rebuilt, with orcs swarming its towering structure. Nine Black Riders emerge from Minas Morgul, advancing menacingly. A lone horseman surveys the darkening Mordor landscape before descending into a citadel. In a library, Gandalf studies ancient texts, finding critical information. Farmer Maggot is frightened by a Black Rider's presence near his home. Frodo bids farewell to Sam and enters Bag End, sensing something is wrong."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Frodo enters Bag End and immediately pauses sensing that something is amiss A creepy point of view from inside Bag End shows Frodo coming up the path  Frodo farewells Sam outside Bag End and heads towards the front door  The black rider gallops away at speed  Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away  Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house  Farmer Maggot is chopping wood in his garden  He murmurs hurriedly to himself reading  His eyes settle on one old parchment  Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table  He spurs his horse on making his way down into the lower depths of the citadel  He is seeping out across the bloodred sky his face grave  he looks toward the sawtoothed mountains of Mordor  On the main highway south to Minas Tirith  A lone horseman gallops to the crest of a hill on the west road  Nine Black Riders burst out of Minas Morgul and charge toward the camera  Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape  The huge dark tower of Baraddûr is being rebuilt  The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard  The camera pushes in and the hum of the ring comes up on the soundtrack  Gandalf hurries out the door leaving Frodo standing alone in Bag End  Gandalf is already at the door and turns to Frodo  Gandalf seals the envelope with wax and hands it to Frodo  Gandalf holds out the envelope and Frodo drops the ring into it  Gandalf turns his eyes locking onto the ring in Frodo's fingers  Gandalf continues staring into the fire as if locked in thought  Frodo rushes into Bag End and stops to pick up the ring at his feet  Gandalf is sitting in front of the fire with his pipe staring into the flickering flames  Gandalf slowly reaches for the ring  The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face  Gandalf steps up behind  Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him  The tiny ring lands with a heavy thud on the wooden floor  With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor  Bilbo pulls out the ring and stares at it in his palm  Bilbo lifts his knapsack and heads for the front door  Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "he looks toward the sawtoothed mountains of Mordor  The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard  Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house  A lone horseman gallops to the crest of a hill on the west road  Frodo rushes into Bag End and stops to pick up the ring at his feet  The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face  Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away  He is seeping out across the bloodred sky his face grave  The tiny ring lands with a heavy thud on the wooden floor  Frodo farewells Sam outside Bag End and heads towards the front door  Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room  On the main highway south to Minas Tirith  Gandalf is already at the door and turns to Frodo  Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape  Gandalf hurries out the door leaving Frodo standing alone in Bag End  He spurs his horse on making his way down into the lower depths of the citadel  A creepy point of view from inside Bag End shows Frodo coming up the path  The black rider gallops away at speed  Bilbo pulls out the ring and stares at it in his palm  Farmer Maggot is chopping wood in his garden  He murmurs hurriedly to himself reading  Frodo enters Bag End and immediately pauses sensing that something is amiss Gandalf seals the envelope with wax and hands it to Frodo  Bilbo lifts his knapsack and heads for the front door  Gandalf slowly reaches for the ring  The huge dark tower of Baraddûr is being rebuilt  His eyes settle on one old parchment  Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table  Gandalf continues staring into the fire as if locked in thought  With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor  Gandalf turns his eyes locking onto the ring in Frodo's fingers  Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him  Gandalf steps up behind  Nine Black Riders burst out of Minas Morgul and charge toward the camera  Gandalf holds out the envelope and Frodo drops the ring into it  Gandalf is sitting in front of the fire with his pipe staring into the flickering flames  The camera pushes in and the hum of the ring comes up on the soundtrack "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The huge dark tower of Baraddûr is being rebuilt  Thousands of orcs crawl over the surface hauling stone and iron up the towering heights which grows and spreads across the redstreaked sky casting a shadowy pall over the nightmarish landscape  Nine Black Riders burst out of Minas Morgul and charge toward the camera  A lone horseman gallops to the crest of a hill on the west road  On the main highway south to Minas Tirith  he looks toward the sawtoothed mountains of Mordor  He is seeping out across the bloodred sky his face grave  He spurs his horse on making his way down into the lower depths of the citadel  Pages flip as Gandalf searches ancient scrolls and books placed high on a wooden table  His eyes settle on one old parchment  He murmurs hurriedly to himself reading  Farmer Maggot is chopping wood in his garden  Snorting horse nostrils as the shadow of a black rider looms over a Hobbit house  Terrified Farmer Maggot cowers in his doorway and Fang his dog whimpers and backs away  The black rider gallops away at speed  Frodo farewells Sam outside Bag End and heads towards the front door  A creepy point of view from inside Bag End shows Frodo coming up the path  Frodo enters Bag End and immediately pauses sensing that something is amiss Gandalf rises to his full height his eyes flash his shadow suddenly seems to fill the room  Bilbo lifts his knapsack and heads for the front door  Bilbo pulls out the ring and stares at it in his palm  With all his willpower Bilbo allows the ring to slowly slide off his palm and drop to the floor  The tiny ring lands with a heavy thud on the wooden floor  Bilbo staggers out of Bag End and braces himself in the night air pale and trembling as if his loss of the ring has weakened him  Gandalf steps up behind  The ring is glinting on the floor and Gandalf circles around it a puzzled look on his face  Gandalf slowly reaches for the ring  Gandalf is sitting in front of the fire with his pipe staring into the flickering flames  Frodo rushes into Bag End and stops to pick up the ring at his feet  Gandalf continues staring into the fire as if locked in thought  Gandalf turns his eyes locking onto the ring in Frodo's fingers  Gandalf holds out the envelope and Frodo drops the ring into it  Gandalf seals the envelope with wax and hands it to Frodo  Gandalf is already at the door and turns to Frodo  Gandalf hurries out the door leaving Frodo standing alone in Bag End  The camera pushes in and the hum of the ring comes up on the soundtrack  The camera pushes through the white paper to the ring beneath which the whispered murmur of Black Speech can be heard "
        }
      ]
    }
  ]
}