{
  "ground_truth": "Everything depends on Frodo going inside the tunnel. Frodo stares into the darkness. Gollum, his sparse oily hair hanging like rank weed over his hooded eyes, leads the way. Drawing a deep breath, Frodo follows Gollum into the tunnel. They continue on, deep into the dark tunnel. Frodo feels his way in the dark, following the sound of Gollum's scampering. Frodo follows the sound of Gollum's voice. He is very tired. Frodo cannot see Gollum in the murky tunnel. Frodo slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away. Strands of a white thread are stuck to his hand. Gollum is nowhere to be seen. Frodo is breathing hard, passing all manner of creatures trussed up in evil web-like material. There is a creaking as some great jointed thing moves with slow purpose in the dark. Frodo begins to run in blind panic. Meanwhile, Sam stumbles blindly down the ancient stairs, reckless and uncaring, his face pale and devastated. Sam's foot slips. Suddenly, as if the ground has given way beneath him, Sam is slipping and sliding dangerously out of control. Sam thuds into a large rock, which saves him from tumbling headlong over the precipice. Something catches Sam's eye, and he stares, barely breathing—a package of lembas bread. Sam looks back up the long steep stair. Frodo is running blindly; he falls, trapped in the sticky substance which clings to him. As he lays on the ground, unable to move, a voice comes to him as if from a distant memory. Frodo fumbles in his jacket, fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft. Gollum is on the other side of the web. Frodo slashes wildly with Sting. The shining blade of Sting hacks through the fibrous strands. They whip and snap back into Frodo's face as he cuts himself free. Back up the tunnel, lit by the Light of Galadriel, Shelob's heaving shadow approaches. Disbelief turns to fear as Shelob gets closer and closer; Gollum quickly turns and bolts. Frodo hacks at the web and, with a last desperate lunge, frees himself. Sting is caught in the web. Frodo leaves the sword and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair, tumbling onto cold rock, covered in cobwebs, wild-eyed and drenched in sweat. He looks up as Gollum lunges at him. Gollum and Frodo fight, rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground, hands around his throat. Frodo's fingers squeeze tighter around Gollum's, but he has a sudden moment of self-realization and releases Gollum, horrified at his violence.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "All relies on Frodo entering inside the passageway. Frodo gazes into the blackness. Gollum, his sparse greasy hair draping like rank weed over his hooded eyes, guides the path. Inhaling a deep breath, Frodo trails Gollum into the passageway. They proceed on, deep into the dim passageway. Frodo feels his route in the black, trailing the noise of Gollum's scampering. Frodo trails the noise of Gollum's voice. He is very exhausted. Frodo cannot discern Gollum in the shadowy passageway. Frodo slips as he attempts to trail the voice. He places his hand to the partition to steady himself but swiftly yanks it away. Strands of a white filament are adhered to his hand. Gollum is nowhere to be seen. Frodo is breathing hard, passing all types of creatures trussed up in malicious web-like material. There is a creaking as some massive jointed entity shifts with slow intention in the black. Frodo starts to dash in blind terror. Meanwhile, Sam stumbles blindly down the ancient stairs, reckless and uncaring, his face pale and devastated. Sam's foot slips. Suddenly, as if the ground has surrendered beneath him, Sam is slipping and sliding perilously out of control. Sam thuds into a large rock, which saves him from tumbling headlong over the precipice. Something seizes Sam's eye, and he stares, barely breathing—a package of lembas bread. Sam looks back up the long steep stair. Frodo is dashing blindly; he falls, ensnared in the sticky substance which adheres to him. As he lays on the ground, unable to shift, a voice arrives to him as if from a distant recollection. Frodo fumbles in his jacket, fear intensifying in him as he pulls out the glass phial—his present from Galadriel—and holds it aloft. Gollum is on the other flank of the web. Frodo slashes wildly with Sting. The glowing blade of Sting chops through the fibrous strands. They whip and snap back into Frodo's face as he cuts himself liberated. Back up the passageway, illuminated by the Light of Galadriel, Shelob's heaving silhouette approaches. Disbelief turns to terror as Shelob gets nearer and nearer; Gollum swiftly turns and bolts. Frodo chops at the web and, with a last desperate lunge, liberates himself. Sting is caught in the web. Frodo leaves the sword and propels himself through a narrow crevice. Frodo stumbles out of Shelob's lair, tumbling onto chilly stone, covered in cobwebs, wild-eyed and drenched in sweat. He gazes up as Gollum lunges at him. Gollum and Frodo struggle, rolling on the stone towards the brink of a precipice. Frodo pins Gollum on the stone, hands around his throat. Frodo's fingers squeeze tighter around Gollum's, but he has a sudden moment of self-realization and releases Gollum, horrified at his savagery."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Everything is depended upon by Frodo going inside the tunnel. The darkness is stared into by Frodo. The way is led by Gollum, his sparse oily hair hanging like rank weed over his hooded eyes. A deep breath is drawn by Frodo, and Gollum is followed into the tunnel. The dark tunnel is continued through by them. The way is felt by Frodo in the dark, following the sound of Gollum's scampering. The sound of Gollum's voice is followed by Frodo. He is very tired. Gollum cannot be seen by Frodo in the murky tunnel. Frodo slips while the voice is tried to be followed. The wall is steadied against by his hand, but it is quickly yanked away. Strands of a white thread are stuck to his hand. Gollum cannot be seen anywhere. Hard breathing is done by Frodo, passing all manner of creatures trussed up in evil web-like material. A creaking is heard as some great jointed thing moves with slow purpose in the dark. Blind panic is begun to be run in by Frodo. Meanwhile, the ancient stairs are stumbled blindly down by Sam, reckless and uncaring, his face pale and devastated. Sam slips his foot. Suddenly, as if the ground has given way beneath him, Sam slips and slides dangerously out of control. A large rock is thudded into by Sam, saving him from tumbling headlong over the precipice. Sam's eye is caught by something, and he stares, barely breathing—a package of lembas bread. The long steep stair is looked back up by Sam. Frodo runs blindly; he falls, trapped in the sticky substance which clings to him. The ground is laid on by him, unable to move, and a voice comes to him as if from a distant memory. Frodo fumbles in his jacket, fear growing in him as the glass phial—his gift from Galadriel—is pulled out and held aloft. The other side of the web is occupied by Gollum. Sting is slashed wildly with by Frodo. The fibrous strands are hacked through by the shining blade of Sting. They whip and snap back into Frodo's face as he cuts himself free. Back up the tunnel, the Light of Galadriel lights Shelob's heaving shadow approaching. Disbelief is turned to fear as Shelob gets closer and closer; Gollum quickly turns and bolts. The web is hacked at by Frodo and, with a last desperate lunge, he frees himself. The sword is left and Frodo throws himself through a narrow crevice. Shelob's lair is stumbled out of by Frodo, tumbling onto cold rock, covered in cobwebs, wild-eyed and drenched in sweat. Gollum lunges at him and is looked up to by Frodo. A fight between Gollum and Frodo rolls them on the ground towards the edge of a precipice. Gollum is pinned on the ground by Frodo, hands around his throat. Frodo's fingers squeeze tighter around Gollum's, but he has a sudden moment of self-realization and releases Gollum, horrified at his violence."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Everything hinges on Frodo entering the tunnel. He stares into the darkness as Gollum, with sparse oily hair over his hooded eyes, leads the way. Frodo takes a deep breath and follows Gollum into the tunnel, feeling his way in the dark by the sound of Gollum's scampering voice. Exhausted, Frodo cannot see Gollum in the murky tunnel and slips, steadying himself against the wall but quickly pulling away from sticky white threads. Gollum is gone, and Frodo, breathing hard, passes creatures ensnared in web-like material. A creaking sound signals a large jointed creature moving in the dark, prompting Frodo to run in panic. Meanwhile, Sam stumbles down ancient stairs, pale and devastated, slipping and sliding out of control until a rock stops him from falling over a precipice. He spots a package of lembas bread and looks back up the steep stair. Frodo, running blindly, falls into sticky webs. As he lies trapped, a distant voice prompts him to retrieve Galadriel's glass phial from his jacket. Gollum is beyond the web as Frodo slashes with Sting, cutting through the strands. The Light of Galadriel reveals Shelob's shadow approaching, causing Gollum to flee. Frodo hacks at the web, freeing himself with a desperate lunge, leaving Sting behind as he escapes through a narrow crevice. He stumbles out of Shelob's lair, covered in cobwebs and drenched in sweat, as Gollum lunges at him. They fight, rolling toward a precipice. Frodo pins Gollum, hands around his throat, but suddenly realizes his violence and releases him, horrified."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Everything hinges on Frodo entering the tunnel. He stares into the darkness as Gollum, with oily hair over his eyes, leads. Frodo follows, feeling his way in the dark, guided by Gollum's voice. Tired, he slips, touching the wall, but pulls away from sticky white threads. Gollum vanishes. Frodo, breathing hard, passes creatures in web-like material. A creaking sound signals a large creature moving. Frodo panics and runs. Meanwhile, Sam stumbles down ancient stairs, slipping and hitting a rock, saving him from a fall. He spots lembas bread and looks back up the stairs. Frodo, trapped in sticky webs, recalls a distant voice, retrieves Galadriel's phial, and holds it up. Gollum is beyond the web. Frodo slashes with Sting, freeing himself as Shelob's shadow approaches. Gollum flees. Frodo leaves Sting, escapes through a crevice, and tumbles out, covered in cobwebs. Gollum lunges; they fight near a precipice. Frodo pins Gollum, but horrified by his violence, releases him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Everything hinges entirely on Frodo making the crucial decision to venture inside the ominous tunnel. Frodo stands at the entrance, staring intently into the impenetrable darkness that lies ahead. Gollum, with his sparse, oily hair hanging like rank, tangled weeds over his hooded eyes, takes the lead, guiding the way forward. Drawing a deep, steadying breath, Frodo musters his courage and follows Gollum into the foreboding tunnel. They continue their journey, delving deeper and deeper into the dark, winding passage. Frodo cautiously feels his way through the pitch-black surroundings, relying on the sound of Gollum's scampering footsteps to guide him. He listens intently, following the faint sound of Gollum's voice echoing through the tunnel. Frodo is extremely weary, his energy waning. In the murky tunnel, Frodo cannot see Gollum at all. As he tries to follow the elusive voice, Frodo slips, losing his footing. He instinctively reaches out to the wall to steady himself but quickly pulls his hand away in alarm. Strands of a sticky white thread cling to his hand. Gollum is nowhere to be seen, vanished into the shadows. Frodo breathes heavily, passing by all manner of creatures ensnared in sinister, web-like material. There is a creaking sound as some great, jointed creature moves with slow, deliberate purpose in the darkness. Overcome with fear, Frodo begins to run in a blind panic. Meanwhile, Sam is stumbling blindly down the ancient, treacherous stairs, reckless and uncaring, his face pale and devastated by worry. Sam's foot slips, and suddenly, as if the ground has vanished beneath him, he finds himself slipping and sliding dangerously out of control. Sam crashes into a large rock, which miraculously saves him from tumbling headlong over the precipice. Something catches Sam's eye, and he stares, barely breathing—a package of lembas bread. Sam looks back up the long, steep stairway. Frodo is running blindly; he falls, becoming ensnared in the sticky substance that clings to him. As he lies on the ground, unable to move, a voice comes to him as if from a distant memory. Frodo fumbles in his jacket, fear growing within him as he retrieves the glass phial—his precious gift from Galadriel—and holds it aloft. Gollum is on the other side of the web. Frodo slashes wildly with Sting, the shining blade hacking through the fibrous strands. They whip and snap back into Frodo's face as he desperately cuts himself free. Back up the tunnel, illuminated by the Light of Galadriel, Shelob's massive, heaving shadow approaches. Disbelief quickly turns to fear as Shelob draws closer and closer; Gollum swiftly turns and bolts away. Frodo hacks at the web with determination and, with a final, desperate lunge, manages to free himself. Sting becomes caught in the web. Frodo leaves the sword behind and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair, tumbling onto the cold rock, covered in cobwebs, wild-eyed and drenched in sweat. He looks up just as Gollum lunges at him. Gollum and Frodo engage in a fierce struggle, rolling on the ground towards the edge of a precipice. Frodo pins Gollum to the ground, his hands tightening around Gollum's throat. Frodo's fingers squeeze tighter, but he experiences a sudden moment of self-realization and releases Gollum, horrified by his own violence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The entire outcome is crucially dependent on Frodo making the pivotal choice to step forward into the menacing, shadowy tunnel. Frodo stands at the very threshold, gazing intently into the deep and impenetrable darkness that looms before him. Gollum, with his scant hair that hangs oily and limp like unkempt, tangled weeds over his hooded, cunning eyes, takes the initiative, moving ahead to guide the path forward. Frodo draws a deep and steadying breath, mustering every ounce of courage within him, and proceeds to follow Gollum into the intimidating tunnel. As they continue on their journey, they delve ever deeper into the dark, twisting passageways. Frodo cautiously searches his way through the surrounding pitch-blackness, relying solely on the sound of Gollum's scuttling footsteps to lead him. He listens with great concentration, heeding the faint sound of Gollum's voice echoing through the cavernous tunnel. Frodo grows increasingly weary, his energy gradually diminishing. In the murky darkness of the tunnel, Frodo cannot see Gollum at all. While striving to follow the elusive, taunting voice, Frodo slips, losing his footing on the uneven ground. He instinctively reaches out for the wall to steady himself but quickly recoils in alarm. Strands of sticky, white thread adhere to his hand. Gollum is nowhere in sight, having vanished into the shifting shadows. Frodo breathes heavily, passing by various creatures trapped in sinister, web-like materials. There is the unsettling creaking noise as a massive, jointed creature moves with slow, calculated purpose through the darkness. Overcome by a wave of fear, Frodo begins to run, driven into a blind panic. Meanwhile, Sam treads blindly down the ancient, treacherous stairs, reckless and uncaring, his face ashen and ravaged by worry. Sam's foot unexpectedly slips, and suddenly, as if the ground beneath him has disappeared, he finds himself sliding uncontrollably and dangerously. Sam crashes into a large rock, which miraculously prevents him from tumbling headlong over the precipice. Sam's eye catches something, and he stares, barely breathing, at a package of lembas bread. Sam looks back up the daunting, steep stairway. Frodo is running blindly; he falls, becoming ensnared in the sticky substance that clings to him. As he lies on the ground, immobilized, a voice reaches him as if from a distant memory. Frodo fumbles urgently through his jacket, anxiety growing within him as he retrieves the glass phial—his precious gift from Galadriel—and lifts it high. Gollum finds himself on the other side of the web. Frodo slashes wildly with Sting, the shining blade cutting through the fibrous strands. These strands whip and snap back into Frodo's face as he desperately struggles to free himself. Back up the tunnel, illuminated by the brilliant Light of Galadriel, Shelob's enormous, heaving shadow draws relentlessly closer. Disbelief quickly turns to fear as Shelob looms ever nearer; Gollum swiftly turns and bolts away. Frodo hacks at the web with fierce determination and, with a final, desperate lunge, manages to free himself. Sting becomes entangled in the web. Frodo leaves the sword behind and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair, tumbling exhaustedly onto the cold rock, covered in cobwebs, wild-eyed, and drenched in sweat. He looks up just as Gollum suddenly lunges at him. Gollum and Frodo become locked in a fierce, desperate struggle, rolling together on the ground towards the brink of a precipice. Frodo manages to pin Gollum down, his hands tightening around Gollum's throat. Frodo's fingers squeeze even tighter, but then he experiences a sudden moment of self-realization and releases Gollum, horrified by his own violent actions."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Everything hinges on Frodo making the crucial decision to enter the ominous tunnel. He stands at the entrance, peering into the impenetrable darkness, his mind racing with uncertainty. Gollum, with his sparse, oily hair hanging like rank weeds over his hooded eyes, takes the lead, moving with a slinking, almost serpentine motion. Frodo, summoning his courage, draws a deep breath, feeling the cool air fill his lungs, and steps forward to follow Gollum into the tunnel's foreboding maw. As they progress deeper into the tunnel, the darkness envelops them, and Frodo is forced to rely on his other senses. He extends his hands, feeling his way along the rough, damp walls, while his ears strain to catch the sound of Gollum's scampering footsteps echoing off the stone. Despite his exhaustion, Frodo pushes on, his eyes straining to pierce the murk, but Gollum remains an elusive shadow, always just out of sight. Suddenly, Frodo's foot slips on the uneven ground, and he instinctively reaches out to steady himself against the wall, only to recoil in shock as his hand comes away sticky with strands of a white, web-like thread. Panic surges through him as he realizes Gollum is nowhere to be seen, and his breathing becomes ragged as he passes by creatures ensnared in the sinister webbing. A creaking noise reverberates through the tunnel, signaling the movement of some great, jointed creature with a slow, deliberate purpose. Overcome with fear, Frodo breaks into a blind run, his heart pounding in his chest. Meanwhile, Sam, driven by desperation, stumbles down the ancient stairs, his movements reckless and uncaring, his face a mask of pale devastation. As he descends, his foot slips, and he finds himself sliding uncontrollably, the ground seemingly vanishing beneath him. He crashes into a large rock, which mercifully halts his descent and prevents him from plummeting over the precipice. As he regains his bearings, something catches his eye—a package of lembas bread, a reminder of their shared journey. Sam's gaze shifts back up the long, steep stair, his thoughts with Frodo. In the tunnel, Frodo continues his frantic flight, only to fall, ensnared by the sticky webbing that clings to him like a living thing. As he lies trapped, a voice from a distant memory echoes in his mind, urging him to act. With trembling hands, he fumbles in his jacket, fear mounting as he retrieves the glass phial, a precious gift from Galadriel. He holds it aloft, its light cutting through the darkness. On the other side of the web, Gollum watches, but Frodo, driven by desperation, slashes wildly with Sting, the blade gleaming as it slices through the fibrous strands. The webbing snaps back, stinging his face, but he perseveres, hacking himself free. Back up the tunnel, the Light of Galadriel reveals Shelob's massive, heaving shadow, drawing ever closer. Disbelief gives way to terror as the monstrous creature approaches, prompting Gollum to turn and flee. With a final, desperate lunge, Frodo frees himself, though Sting becomes entangled in the web. Abandoning the sword, he throws himself through a narrow crevice, emerging from Shelob's lair in a tumble onto the cold, hard rock outside. Covered in cobwebs, wild-eyed, and drenched in sweat, he looks up just as Gollum lunges at him. The two grapple fiercely, rolling on the ground towards the precipice's edge. Frodo, fueled by adrenaline, pins Gollum to the ground, his hands closing around Gollum's throat. As his fingers tighten, a sudden moment of self-realization strikes him, and he releases Gollum, horrified by the violence he nearly committed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Everything hinges on Frodo entering the tunnel. He hesitates, staring into the darkness, before following Gollum, whose oily hair hangs over his eyes, into the depths. As they progress, Frodo navigates the darkness by following Gollum's voice, though exhaustion weighs on him. He slips, steadying himself against the wall, only to find his hand covered in sticky white threads. Gollum vanishes, leaving Frodo to confront the eerie surroundings alone. Panic sets in as he encounters creatures ensnared in webs and hears a menacing creaking. Meanwhile, Sam descends the ancient stairs recklessly, slipping and crashing into a rock that prevents a fall. He spots a package of lembas bread and looks back up the steep stair. Frodo, ensnared in the sticky web, recalls a distant memory and retrieves the glass phial from Galadriel, holding it aloft. Gollum is on the other side of the web as Frodo slashes with Sting, cutting through the strands. Shelob's shadow looms closer, prompting Gollum to flee. Frodo frees himself with a final lunge, leaving Sting behind as he escapes through a narrow crevice. Emerging from Shelob's lair, covered in cobwebs and sweat, Frodo is attacked by Gollum. They struggle, rolling toward a precipice, until Frodo pins Gollum down. In a moment of self-awareness, Frodo releases Gollum, shocked by his own aggression."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Everything depends on Frodo going inside the tunnel, a perilous passage known as Shelob's Lair, inhabited by a fearsome creature. Frodo stares into the darkness, an impenetrable void that seems to swallow all hope. Gollum, his sparse oily hair hanging like rank weed over his hooded eyes, leads the way with a sinister eagerness. Drawing a deep breath, Frodo follows Gollum into the tunnel, a place once used by the ancient inhabitants of Mordor for secret travel. They continue on, deep into the dark tunnel, echoing with the sounds of unseen dangers. Frodo feels his way in the dark, following the sound of Gollum's scampering, the latter having traversed these passages many times before. Frodo follows the sound of Gollum's voice, which echoes eerily off the tunnel walls. He is very tired, the weight of the One Ring bearing down on him. Frodo cannot see Gollum in the murky tunnel, where shadows seem to mask all form. Frodo slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away, recoiling from the sticky silk spun by Shelob herself. Strands of a white thread are stuck to his hand, evidence of the spider's presence. Gollum is nowhere to be seen, having slipped away into the darkness. Frodo is breathing hard, passing all manner of creatures trussed up in evil web-like material, preserved for Shelob's later consumption. There is a creaking as some great jointed thing, part of Shelob's enormous legs, moves with slow purpose in the dark. Frodo begins to run in blind panic, driven by a sudden surge of adrenaline. Meanwhile, Sam stumbles blindly down the ancient stairs, constructed long ago for secretive purposes, reckless and uncaring, his face pale and devastated by fear for Frodo. Sam's foot slips on the slick stones. Suddenly, as if the ground has given way beneath him, Sam is slipping and sliding dangerously out of control. Sam thuds into a large rock, which saves him from tumbling headlong over the precipice, the edge of a deep chasm. Something catches Sam's eye, and he stares, barely breathing—a package of lembas bread, the Elvish waybread they depend on for sustenance. Sam looks back up the long steep stair, fearing for Frodo's safety. Frodo is running blindly; he falls, trapped in the sticky substance which clings to him like a living net. As he lays on the ground, unable to move, a voice comes to him as if from a distant memory, reminding him of the friends he must protect. Frodo fumbles in his jacket, fear growing in him as he pulls out the glass phial—his gift from Galadriel, the Lady of Lothlórien— and holds it aloft, hoping the light will ward off evil. Gollum is on the other side of the web, lurking in the shadows. Frodo slashes wildly with Sting, the Elven-made sword gifted to him by Bilbo. The shining blade of Sting hacks through the fibrous strands, some of the strongest known to Middle-earth. They whip and snap back into Frodo's face as he cuts himself free. Back up the tunnel, lit by the Light of Galadriel, Shelob's heaving shadow approaches, a beast feared even by the dark forces of Mordor. Disbelief turns to fear as Shelob gets closer and closer; Gollum quickly turns and bolts, slinking away like a coward. Frodo hacks at the web and, with a last desperate lunge, frees himself. Sting is caught in the web, a casualty of Frodo's frantic escape. Frodo leaves the sword and throws himself through a narrow crevice, barely squeezing through. Frodo stumbles out of Shelob's lair, tumbling onto cold rock, covered in cobwebs, wild-eyed and drenched in sweat from the terror he just faced. He looks up as Gollum lunges at him, the treacherous creature unable to let them go. Gollum and Frodo fight, rolling on the ground towards the edge of a precipice, perilously close to falling. Frodo pins Gollum on the ground, hands around his throat, consumed by a moment of desperation. Frodo's fingers squeeze tighter around Gollum's, but he has a sudden moment of self-realization and releases Gollum, horrified at his violence, remembering the mercy he had promised to show."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Everything depends on Frodo going inside the tunnel  Frodo stares into the darkness  Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way  Drawing a deep breath Frodo follows Gollum into the tunnel  They continue on deep into the dark tunnel  Frodo feels his way in the dark following the sound of Gollum's scampering  Frodo follows the sound of Gollum's voice  Something catches Sam's eye and he stares barely breathing—a package of lembas bread  Sam looks back up the long steep stair  Frodo is running blindly  he falls trapped in the sticky substance which clings to him  As he lays on the ground unable to move a voice comes to him as if from a distant memory  Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft  Gollum is on the other side of the web  Frodo slashes wildly with Sting  The shining blade of Sting hacks through the fibrous strands  They whip and snap back into Frodo's face as he cuts himself free  Back up the tunnel lit by the Light of Galadriel  Shelob's heaving shadow approaches  Disbelief turns to fear as Shelob gets closer and closer  Gollum quickly turns and bolts  Frodo hacks at the web and with a last desperate lunge frees himself  Sting is caught in the web  Frodo leaves the sword and throws himself through a narrow crevice  Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat  He looks up as Gollum lunges at him  Gollum and Frodo fight rolling on the ground towards the edge of a precipice  Frodo pins Gollum on the ground hands around his throat  He is very tired  Frodo cannot see Gollum in the murky tunnel  Frodo slips as he tries to follow the voice  He puts his hand to the wall to steady himself but quickly yanks it away  Strands of a white thread are stuck to his hand  Gollum is nowhere to be seen  Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material  There is a creaking as some great jointed thing moves with slow purpose in the dark  Frodo begins to run in blind panic  Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated  Sam's foot slips  Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control  Sam thuds into a large rock which saves him from tumbling headlong over the precipice  Something catches Sam's eye and he stares barely breathing—a package of lembas bread  Sam looks back up the long steep stair  Frodo is running blindly  he falls trapped in the sticky substance which clings to him  As he lays on the ground unable to move a voice comes to him as if from a distant memory  Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft  Gollum is on the other side of the web  Frodo slashes wildly with Sting  The shining blade of Sting hacks through the fibrous strands  They whip and snap back into Frodo's face as he cuts himself free  Back up the tunnel lit by the Light of Galadriel  Shelob's heaving shadow approaches  Disbelief turns to fear as Shelob gets closer and closer  Gollum quickly turns and bolts  Frodo hacks at the web and with a last desperate lunge frees himself  Sting is caught in the web  Frodo leaves the sword and throws himself through a narrow crevice  Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat  He looks up as Gollum lunges at him  Gollum and Frodo fight rolling on the ground towards the edge of a precipice  Frodo pins Gollum on the ground hands around his throat  Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Everything depends on Frodo going inside the tunnel. Frodo stares into the darkness. Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way. Drawing a deep breath Frodo follows Gollum into the tunnel. They continue on deep into the dark tunnel. Frodo feels his way in the dark following the sound of Gollum's scampering. Frodo follows the sound of Gollum's voice. He is very tired. Frodo cannot see Gollum in the murky tunnel. Frodo slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away. Strands of a white thread are stuck to his hand. Gollum is nowhere to be seen. Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material. There is a creaking as some great jointed thing moves with slow purpose in the dark. Frodo begins to run in blind panic. Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated. Sam's foot slips. Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control. Sam thuds into a large rock which saves him from tumbling headlong over the precipice. Something catches Sam's eye and he stares barely breathing—a package of lembas bread. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Sam looks back up the long steep stair. Frodo is running blindly. he falls trapped in the sticky substance which clings to him. As he lays on the ground unable to move a voice comes to him as if from a distant memory. Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft. Gollum is on the other side of the web. Frodo slashes wildly with Sting. The shining blade of Sting hacks through the fibrous strands. They whip and snap back into Frodo's face as he cuts himself free. Back up the tunnel lit by the Light of Galadriel. Shelob's heaving shadow approaches. Disbelief turns to fear as Shelob gets closer and closer. Gollum quickly turns and bolts. Frodo hacks at the web and with a last desperate lunge frees himself. Sting is caught in the web. Frodo leaves the sword and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat. He looks up as Gollum lunges at him. Gollum and Frodo fight rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground hands around his throat. Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Everything depends on Frodo going inside the tunnel. Frodo stares into the darkness. Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way. Drawing a deep breath Frodo follows Gollum into the tunnel. They continue on deep into the dark tunnel. Frodo feels his way in the dark following the sound of Gollum's scampering. Frodo follows the sound of Gollum's voice. He is very tired. Frodo cannot see Gollum in the murky tunnel. Frodo slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away. Strands of a white thread are stuck to his hand. Gollum is nowhere to be seen. Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material. There is a creaking as some great jointed thing moves with slow purpose in the dark. Frodo begins to run in blind panic. Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated. Sam's foot slips. Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control. Sam thuds into a large rock which saves him from tumbling headlong over the precipice. Something catches Sam's eye and he stares barely breathing—a package of lembas bread. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Sam looks back up the long steep stair. Frodo is running blindly. he falls trapped in the sticky substance which clings to him. As he lays on the ground unable to move a voice comes to him as if from a distant memory. Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft. Gollum is on the other side of the web. Frodo slashes wildly with Sting. The shining blade of Sting hacks through the fibrous strands. They whip and snap back into Frodo's face as he cuts himself free. Back up the tunnel lit by the Light of Galadriel. Shelob's heaving shadow approaches. Disbelief turns to fear as Shelob gets closer and closer. Gollum quickly turns and bolts. Frodo hacks at the web and with a last desperate lunge frees himself. Sting is caught in the web. Frodo leaves the sword and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat. He looks up as Gollum lunges at him. Gollum and Frodo fight rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground hands around his throat. Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Everything depends on Frodo going inside the tunnel. Frodo stares into the darkness. Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way. Drawing a deep breath Frodo follows Gollum into the tunnel. They continue on deep into the dark tunnel. Frodo feels his way in the dark following the sound of Gollum's scampering. Frodo follows the sound of Gollum's voice. He is very tired. Frodo cannot see Gollum in the murky tunnel. Frodo slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away. Disbelief turns to fear as Shelob gets closer and closer. Gollum quickly turns and bolts. Frodo hacks at the web and with a last desperate lunge frees himself. Sting is caught in the web. Frodo leaves the sword and throws himself through a narrow crevice. Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat. He looks up as Gollum lunges at him. Gollum and Frodo fight rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground hands around his throat. Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Everything depends on Frodo going inside the tunnel. Frodo stares into the darkness. Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way. Drawing a deep breath Frodo follows Gollum into the tunnel. They continue on deep into the dark tunnel. He looks up as Gollum lunges at him. Gollum and Frodo fight rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground hands around his throat. Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Everything depends on the wizard going inside the tunnel. The wizard stares into the darkness. The dragon, its sparse oily hair hanging like rank weed over its hooded eyes, leads the way. Drawing a deep breath, the wizard follows the dragon into the tunnel. They continue on, deep into the dark tunnel. The wizard feels his way in the dark, following the sound of the dragon's scampering. The wizard follows the sound of the dragon's voice. He is very tired. The wizard cannot see the dragon in the murky tunnel. The wizard slips as he tries to follow the voice. He puts his hand to the wall to steady himself but quickly yanks it away. Strands of a white thread are stuck to his hand. The dragon is nowhere to be seen. The wizard is breathing hard, passing all manner of creatures trussed up in evil web-like material. There is a creaking as some great jointed thing moves with slow purpose in the dark. The wizard begins to run in blind panic. Meanwhile, the knight stumbles blindly down the ancient stairs, reckless and uncaring, his face pale and devastated. The knight's foot slips. Suddenly, as if the ground has given way beneath him, the knight is slipping and sliding dangerously out of control. The knight thuds into a large rock, which saves him from tumbling headlong over the precipice. Something catches the knight's eye, and he stares, barely breathing—a package of lembas bread. The knight looks back up the long steep stair. The wizard is running blindly; he falls, trapped in the sticky substance which clings to him. As he lays on the ground, unable to move, a voice comes to him as if from a distant memory. The wizard fumbles in his jacket, fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft. The dragon is on the other side of the web. The wizard slashes wildly with the wand. The shining blade of the wand hacks through the fibrous strands. They whip and snap back into the wizard's face as he cuts himself free. Back up the tunnel, lit by the Light of Galadriel, the giant's heaving shadow approaches. Disbelief turns to fear as the giant gets closer and closer; the dragon quickly turns and bolts. The wizard hacks at the web and, with a last desperate lunge, frees himself. The wand is caught in the web. The wizard leaves the sword and throws himself through a narrow crevice. The wizard stumbles out of the giant's lair, tumbling onto cold rock, covered in cobwebs, wild-eyed and drenched in sweat. He looks up as the dragon lunges at him. The dragon and the wizard fight, rolling on the ground towards the edge of a precipice. The wizard pins the dragon on the ground, hands around its throat. The wizard's fingers squeeze tighter around the dragon's, but he has a sudden moment of self-realization and releases the dragon, horrified at his violence."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Everything depends on Frodo going inside the greenhouse. Frodo stares into the dimness. Gollum, his sparse oily hair hanging like rank seaweed over his hooded eyes, leads the way. Drawing a deep breath, Frodo follows Gollum into the greenhouse. They continue on, deep into the shadowed passage. Frodo feels his way in the gloom, following the sound of Gollum's scrambling. Frodo follows the sound of Gollum's whispering. He is very tired. Frodo cannot see Gollum in the misty passage. Frodo slips as he tries to follow the whisper. He puts his hand to the railing to steady himself but quickly yanks it away. Strands of a white silk are stuck to his hand. Gollum is nowhere to be seen. Frodo is breathing hard, passing all manner of sculptures trussed up in evil net-like material. There is a creaking as some great mechanical thing moves with slow purpose in the shadows. Frodo begins to run in blind panic. Meanwhile, Sam stumbles blindly down the ancient ladder, reckless and uncaring, his face pale and devastated. Sam's foot slips. Suddenly, as if the ground has given way beneath him, Sam is slipping and sliding dangerously out of control. Sam thuds into a large crate, which saves him from tumbling headlong over the precipice. Something catches Sam's eye, and he stares, barely breathing—a package of saltine crackers. Sam looks back up the long steep ladder. Frodo is running blindly; he falls, trapped in the sticky substance which clings to him. As he lays on the ground, unable to move, a voice comes to him as if from a distant memory. Frodo fumbles in his vest, fear growing in him as he pulls out the crystal orb—his gift from Galadriel—and holds it aloft. Gollum is on the other side of the net. Frodo slashes wildly with Knife. The shining blade of Knife hacks through the fibrous cords. They whip and snap back into Frodo's face as he cuts himself free. Back up the passage, lit by the Light of Galadriel, Shelob's immense outline approaches. Disbelief turns to fear as Shelob gets closer and closer; Gollum quickly turns and bolts. Frodo hacks at the net and, with a last desperate lunge, frees himself. Knife is caught in the net. Frodo leaves the dagger and throws himself through a narrow alcove. Frodo stumbles out of Shelob's haven, tumbling onto cold shale, covered in cobwebs, wild-eyed and drenched in sweat. He looks up as Gollum lunges at him. Gollum and Frodo fight, rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground, hands around his neck. Frodo's fingers squeeze tighter around Gollum's, but he has a sudden moment of self-realization and releases Gollum, horrified at his violence."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Everything depends on Frodo wandering outside the tunnel. Frodo glares into the darkness. Gollum, his sparse oily hair dangling like rank weed over his hooded eyes, points the way. Releasing a deep sigh, Frodo trails Gollum toward the tunnel. They pause there, near the dark tunnel. Frodo taps his way in the dark, listening for the sound of Gollum's humming. Frodo traces the sound of Gollum's whisper. He is very weary. Frodo cannot detect Gollum in the murky tunnel. Frodo stumbles as he tries to trace the whisper. He brushes his hand against the wall to guide himself but quickly retracts it. Strands of a white thread cling to his hand. Gollum is nowhere to be found. Frodo is gasping hard, observing all manner of creatures cocooned in sinister web-like material. There is a squeaking as some great jointed thing shifts with slow determination in the dark. Frodo starts to leap in blind panic. Meanwhile, Sam trips blindly up the ancient stairs, heedless and uncaring, his face ashen and shattered. Sam's foot stumbles. Suddenly, as if the ground has vanished beneath him, Sam is sliding and slipping wildly out of control. Sam collides into a large rock, which halts him from plummeting headfirst over the precipice. Something draws Sam's attention, and he gazes, barely breathing—a package of lembas bread. Sam peers back down the long steep stair. Frodo is sprinting blindly; he trips, ensnared in the sticky substance which binds him. As he sprawls on the ground, unable to shift, a voice calls to him as if from a distant memory. Frodo searches in his jacket, anxiety rising in him as he retrieves the glass phial—his gift from Galadriel—and waves it aloft. Gollum is on the other side of the web. Frodo slashes hesitantly with Sting. The glistening blade of Sting slices through the fibrous strands. They snap and fling back into Frodo's face as he extricates himself. Back in the tunnel, dimly lit by the Light of Galadriel, Shelob's hulking shadow arises. Disbelief morphs into alarm as Shelob advances closer and closer; Gollum promptly spins and flees. Frodo carves at the web and, with a last desperate jump, liberates himself. Sting is entangled in the web. Frodo abandons the sword and squeezes himself through a narrow crack. Frodo trips out of Shelob's lair, landing on the cold rock, draped in cobwebs, wild-eyed and drenched in sweat. He glances up as Gollum darts at him. Gollum and Frodo tussle, rolling on the ground towards the edge of a precipice. Frodo pins Gollum on the ground, hands clasped around his throat. Frodo's fingers clutch tighter around Gollum's, but he has a sudden moment of self-reflection and releases Gollum, aghast at his violence."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Everything depends on the penguin going inside the submarine. The penguin stares into the marshmallow. The wizard, its glittering feathered cape hanging like aged quilt over its bright gemstones, leads the way. Drawing a deep breath, the penguin follows the wizard into the submarine. They continue on, deep into the dark submarine. The penguin feels its way in the marshmallow, following the sound of the wizard's tap dancing. The penguin follows the sound of the wizard's humming. It is very tired. The penguin cannot see the wizard in the murky submarine. The penguin slips as it tries to follow the humming. It puts its paw to the fence to steady itself but quickly yanks it away. Strands of a purple ribbon are stuck to its paw. The wizard is nowhere to be seen. The penguin is breathing hard, passing all manner of bicycles trussed up in peculiar net-like material. There is a creaking as some great honking mechanism moves with slow purpose in the marshmallow. The penguin begins to run in blind panic. Meanwhile, the giraffe stumbles blindly down the ancient ladder, reckless and uncaring, its face pale and devastated. The giraffe's hoof slips. Suddenly, as if the ground has given way beneath it, the giraffe is slipping and sliding dangerously out of control. The giraffe thuds into a large pillow, which saves it from tumbling headlong over the precipice. Something catches the giraffe's eye, and it stares, barely breathing—a bouquet of daisies. The giraffe looks back up the long steep step-ladder. The penguin is running blindly; it falls, trapped in the adhesive wallpaper which clings to it. As it lays on the floor, unable to move, a whisper comes to it as if from a distant memory. The penguin fumbles in its hat, fear growing in it as it pulls out the crystal marble—its trophy from the queen—and holds it aloft. The wizard is on the other side of the net. The penguin slashes wildly with Toothpick. The shining blade of Toothpick hacks through the fibrous ribbons. They whip and snap back into the penguin's face as it cuts itself free. Back up the submarine, lit by the Glow of the Queen, the tarantula's heaving silhouette approaches. Disbelief turns to fear as the tarantula gets closer and closer; the wizard quickly turns and bolts. The penguin hacks at the net and, with a last desperate lunge, frees itself. Toothpick is caught in the net. The penguin leaves the spoon and throws itself through a narrow crevice. The penguin stumbles out of the tarantula’s lair, tumbling onto cold ice, covered in yarn, wild-eyed and drenched in lemonade. It looks up as the wizard lunges at it. The wizard and the penguin fight, rolling on the surface towards the edge of a precipice. The penguin pins the wizard on the surface, paws around its neck. The penguin's feathers squeeze tighter around the wizard's, but it has a sudden moment of self-realization and releases the wizard, horrified at its recklessness."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Everything depends on Gretel going inside the labyrinth. Gretel peers into the shadows. Rumpelstiltskin, his tangled greasy hair draping like wilted vines over his squinting eyes, guides the way. Holding a short gulp, Gretel trails Rumpelstiltskin into the labyrinth. They venture on, deep into the gloomy labyrinth. Gretel navigates her way through the shadows, trailing the sound of Rumpelstiltskin's shuffling. Gretel follows the sound of Rumpelstiltskin's laughter. She is exceedingly weary. Gretel cannot glimpse Rumpelstiltskin in the murky labyrinth. Gretel trips as she attempts to trail the laughter. She places her hand on the wall to steady herself but rapidly jerks it back. Strands of a white thread adhere to her hand. Rumpelstiltskin is nowhere to be found. Gretel is panting heavily, passing all types of animals enshrouded in sinister mesh-like fabric. There is a creaking as some gigantic hinged creature maneuvers with deliberate resolve in the shadows. Gretel starts to sprint in blind terror. Meanwhile, Hansel staggers blindly down the ancient hill, reckless and indifferent, his face ashen and shattered. Hansel's foot falters. Abruptly, as if the earth has vanished beneath him, Hansel is tumbling and tumbling precariously out of control. Hansel crashes into a large boulder, which spares him from plunging headlong over the abyss. Something captures Hansel's attention, and he gazes, hardly breathing—a package of gingerbread. Hansel glances back up the long steep hill. Gretel is sprinting blindly; she collapses, trapped in the adhesive material which adheres to her. As she lies on the ground, unable to break free, a voice echoes to her as if from a distant recollection. Gretel rummages in her coat, dread mounting in her as she retrieves the crystal vial—her present from a fairy—and holds it high. Rumpelstiltskin is on the opposite side of the mesh. Gretel slashes furiously with the dagger. The gleaming edge of the dagger slices through the fibrous threads. They snap and rebound into Gretel's face as she extricates herself. Up the labyrinth, illuminated by the Light of the fairy, the dragon's looming silhouette advances. Disbelief morphs into fear as the dragon draws nearer and nearer; Rumpelstiltskin swiftly turns and flees. Gretel cuts at the mesh and, with a final frantic leap, liberates herself. The dagger is ensnared in the mesh. Gretel abandons the weapon and hurls herself through a narrow passage. Gretel staggers out of the dragon's den, collapsing onto cold stone, ensnared in cobwebs, wide-eyed and drenched in perspiration. She gazes up as Rumpelstiltskin pounces at her. Rumpelstiltskin and Gretel grapple, rolling on the ground toward the brink of a chasm. Gretel ensnares Rumpelstiltskin on the ground, hands around his throat. Gretel's fingers tighten around Rumpelstiltskin's, but she experiences a shocking epiphany and releases Rumpelstiltskin, aghast at her aggression."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Everything depends on Frodo going inside the greenhouse. Frodo gazes into the brightness. Gollum, his sparse oily feathers hanging like rank seaweed over his crowned ears, guides the path. Taking a shallow sigh, Frodo follows Gollum into the greenhouse. They proceed onward, deep into the bright greenhouse. Frodo guesses his way in the light, following the sound of Gollum's fluttering. Frodo follows the sound of Gollum's laughter. He is very energized. Frodo cannot hear Gollum in the clear greenhouse. Frodo leaps as he tries to follow the laughter. He puts his hand to the floor to balance himself but quickly shakes it away. Strands of a white ribbon are attached to his hand. Gollum is everywhere to be found. Frodo is whispering quietly, passing all manner of objects bundled up in benevolent rope-like material. There is a dazzling as some tiny round thing spins with rapid speed in the light. Frodo starts to dance in joyful excitement. Meanwhile, Sam skips brightly down the new ramp, careful and attentive, his face vibrant and cheerful. Sam's hand snags. Suddenly, as if the sky has risen above him, Sam is jumping and bounding merrily in control. Sam gently bumps into a small pebble, which catches him from flying gracefully over the meadow. Something draws Sam's attention, and he glances, freely exhaling—a packet of biscuits. Sam looks down the long gentle hill. Frodo is dancing wildly; he rises, embraced by the silky ribbon which wraps around him. As he stands on the stones, eager to roam, a laugh comes to him as if from a nearby dream. Frodo searches in his pocket, excitement fading in him as he pulls out the wooden whistle—his gift from Gandalf—and blows it gently. Gollum is on the inside of the ribbon. Frodo waves eagerly with Twig. The glowing stick of Twig slices through the delicate ribbons. They flutter and float back into Frodo's face as he twirls himself free. Back down the greenhouse, brightened by the Light of Gandalf, Shelob's dancing shadow retreats. Elation turns to calm as Shelob stays farther and farther; Gollum quickly laughs and twirls. Frodo waves at the ribbon and, with a last joyful leap, liberates himself. Twig is tangled in the ribbon. Frodo leaves the stick and jumps through a wide archway. Frodo glides out of Shelob's meadow, landing onto warm sand, covered in ribbons, calm-faced and glowing in serenity. He looks down as Gollum embraces him. Gollum and Frodo hug, rolling on the ground towards the center of a meadow. Frodo lifts Gollum from the ground, arms around his waist. Frodo's arms relax around Gollum's, but he has a sudden moment of self-awareness and releases Gollum, fascinated by his gentleness."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Everything hinges on Oliver flying around the tower. Oliver gazes into the brightness. Smudge, her tangled silky mane flapping like gentle grass over her bright cheeks, paves the path. Inhaling a shallow breath, Oliver drifts after Smudge into the tower. They linger on, flying within the bright tower. Oliver senses his way through the light, trailing the echo of Smudge's flight. Oliver follows the echo of Smudge's laugh. He is deeply energized. Oliver can't locate Smudge in the shiny tower. Oliver glides as he attempts to pursue the laugh. He places his hand on the floor to anchor himself but swiftly shoves it away. Threads of a black string are clung to his hand. Smudge is everywhere to be found. Oliver is whispering loudly, encountering all kinds of plants draped up in pleasant chain-like fabric. There is a rustling as some tiny flapping creature glides with rapid intent in the light. Oliver starts to walk in clear calm. Meanwhile, Max skips clearly up the modern ladder, careful and caring, his expression bright and thrilled. Max's toe glides. Instantly, as if the ladder has risen above him, Max is soaring and gliding securely in control. Max taps into a small tree, which assists him from gliding vertically over the horizon. Something escapes Max's ear, and he listens, deeply exhaling—an envelope of mint leaves. Max listens back down the narrow flat ladder. Oliver is walking clearly; he rises, free in the smooth object which releases him. As he stands on the ceiling, able to jump, a song drifts to him as if from a close sensation. Oliver grips at his belt, joy growing in him as he grabs a wooden flute—his prize from Eleanor—and places it beside. Smudge is at the edge of the chain. Oliver plants softly with Petal. The dark handle of Petal taps near the metal threads. They curl and pull forward with Oliver's back as he hugs himself tight. Down the tower, brightened by the Glow of Eleanor, Tinkerbell's drifting light lingers. Certainty shifts to joy as Tinkerbell moves farther and farther; Smudge slowly turns and skips. Oliver plants near the chain and, with a first calm jump, binds himself. Petal is loose in the chain. Oliver keeps the handle and hangs herself beside a wide entrance. Oliver skips into Tinkerbell's nest, rising into warm sand, shrouded in vines, calm-faced and dry in snow. He listens down as Smudge skips toward her. Smudge and Oliver hug, skipping across the roof away from the inside of a horizon. Oliver lifts Smudge from the ceiling, feet below her hair. Oliver's toes press harder below Smudge's, and she has a soft second of self-exploration and holds Smudge, elated with her kindness."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Frodo, essential to the quest, follows Gollum into a dark tunnel, feeling his way through the gloom and struggling with exhaustion. After slipping and encountering sticky webs, Frodo realizes Gollum is gone and panics. Meanwhile, Sam tumbles down ancient stairs, narrowly avoiding disaster and spots lembas bread, reminding him of his task. Inside the tunnel, Frodo is trapped by webs but recalls Galadriel's gift, the glass phial. He uses Sting to cut himself free but leaves the sword behind and escapes through a crevice. Emerging covered in cobwebs, Frodo faces Gollum's attack. They grapple near a precipice until Frodo gains the upper hand but stops himself, shocked at his own violence, and lets Gollum go."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence Frodo pins Gollum on the ground hands around his throat  Gollum and Frodo fight rolling on the ground towards the edge of a precipice  He looks up as Gollum lunges at him  Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat  Frodo leaves the sword and throws himself through a narrow crevice  Sting is caught in the web  Frodo hacks at the web and with a last desperate lunge frees himself  Gollum quickly turns and bolts  Disbelief turns to fear as Shelob gets closer and closer  Shelob's heaving shadow approaches  Back up the tunnel lit by the Light of Galadriel  They whip and snap back into Frodo's face as he cuts himself free  The shining blade of Sting hacks through the fibrous strands  Frodo slashes wildly with Sting  Gollum is on the other side of the web  Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft  As he lays on the ground unable to move a voice comes to him as if from a distant memory  he falls trapped in the sticky substance which clings to him  Frodo is running blindly  Sam looks back up the long steep stair  Something catches Sam's eye and he stares barely breathing—a package of lembas bread  Sam thuds into a large rock which saves him from tumbling headlong over the precipice  Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control  Sam's foot slips  Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated  Frodo begins to run in blind panic  There is a creaking as some great jointed thing moves with slow purpose in the dark  Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material  Gollum is nowhere to be seen  Strands of a white thread are stuck to his hand  He puts his hand to the wall to steady himself but quickly yanks it away  Frodo slips as he tries to follow the voice  Frodo cannot see Gollum in the murky tunnel  He is very tired  Frodo follows the sound of Gollum's voice  Frodo feels his way in the dark following the sound of Gollum's scampering  They continue on deep into the dark tunnel  Drawing a deep breath Frodo follows Gollum into the tunnel  Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way  Frodo stares into the darkness  Everything depends on Frodo going inside the tunnel "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material  There is a creaking as some great jointed thing moves with slow purpose in the dark  Gollum quickly turns and bolts  Sam looks back up the long steep stair  Everything depends on Frodo going inside the tunnel  Frodo begins to run in blind panic  Frodo cannot see Gollum in the murky tunnel  Gollum and Frodo fight rolling on the ground towards the edge of a precipice  The shining blade of Sting hacks through the fibrous strands  Back up the tunnel lit by the Light of Galadriel  Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft  Disbelief turns to fear as Shelob gets closer and closer  He puts his hand to the wall to steady himself but quickly yanks it away  Sam's foot slips  They continue on deep into the dark tunnel  Gollum is nowhere to be seen  Drawing a deep breath Frodo follows Gollum into the tunnel  Frodo leaves the sword and throws himself through a narrow crevice  he falls trapped in the sticky substance which clings to him  Frodo slips as he tries to follow the voice  Sting is caught in the web  Frodo stares into the darkness  Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat  Frodo pins Gollum on the ground hands around his throat  Frodo follows the sound of Gollum's voice  Shelob's heaving shadow approaches  Strands of a white thread are stuck to his hand  Frodo slashes wildly with Sting  Sam thuds into a large rock which saves him from tumbling headlong over the precipice  Something catches Sam's eye and he stares barely breathing—a package of lembas bread  Gollum is on the other side of the web  Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control  Frodo feels his way in the dark following the sound of Gollum's scampering  As he lays on the ground unable to move a voice comes to him as if from a distant memory  He is very tired  Frodo hacks at the web and with a last desperate lunge frees himself  They whip and snap back into Frodo's face as he cuts himself free  Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way  Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated  He looks up as Gollum lunges at him  Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence Frodo is running blindly "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sam looks back up the long steep stair  Frodo is running blindly  he falls trapped in the sticky substance which clings to him  As he lays on the ground unable to move a voice comes to him as if from a distant memory  Frodo fumbles in his jacket fear growing in him as he pulls out the glass phial—his gift from Galadriel—and holds it aloft  Gollum is on the other side of the web  Frodo slashes wildly with Sting  The shining blade of Sting hacks through the fibrous strands  They whip and snap back into Frodo's face as he cuts himself free  Back up the tunnel lit by the Light of Galadriel  Shelob's heaving shadow approaches  Disbelief turns to fear as Shelob gets closer and closer  Gollum quickly turns and bolts  Frodo hacks at the web and with a last desperate lunge frees himself  Sting is caught in the web  Frodo leaves the sword and throws himself through a narrow crevice  Frodo stumbles out of Shelob's lair tumbling onto cold rock covered in cobwebs wildeyed and drenched in sweat  He looks up as Gollum lunges at him  Gollum and Frodo fight rolling on the ground towards the edge of a precipice  Frodo pins Gollum on the ground hands around his throat  Frodo's fingers squeeze tighter around Gollum's but he has a sudden moment of selfrealization and releases Gollum horrified at his violence Everything depends on Frodo going inside the tunnel  Frodo stares into the darkness  Gollum his sparse oily hair hanging like rank weed over his hooded eyes leads the way  Drawing a deep breath Frodo follows Gollum into the tunnel  They continue on deep into the dark tunnel  Frodo feels his way in the dark following the sound of Gollum's scampering  Frodo follows the sound of Gollum's voice  He is very tired  Frodo cannot see Gollum in the murky tunnel  Frodo slips as he tries to follow the voice  He puts his hand to the wall to steady himself but quickly yanks it away  Strands of a white thread are stuck to his hand  Gollum is nowhere to be seen  Frodo is breathing hard passing all manner of creatures trussed up in evil weblike material  There is a creaking as some great jointed thing moves with slow purpose in the dark  Frodo begins to run in blind panic  Meanwhile Sam stumbles blindly down the ancient stairs reckless and uncaring his face pale and devastated  Sam's foot slips  Suddenly as if the ground has given way beneath him Sam is slipping and sliding dangerously out of control  Sam thuds into a large rock which saves him from tumbling headlong over the precipice  Something catches Sam's eye and he stares barely breathing—a package of lembas bread "
        }
      ]
    }
  ]
}