{
  "ground_truth": "Frodo materializes as he drops to his knees, clutching his bleeding hand, and screams. The fires below roar in anger, red light blazes, and the cavern is filled with a great glare and heat. Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft, dancing gleefully, perilously close to the edge of the chasm. Aragorn turns to see huge troll feet moving closer, and Legolas races toward him. Gollum remains triumphant on the edge of the precipice, with the fiery lava casting an evil light. Frodo rises slowly, his eyes lock on Gollum, and time seems to stand still as they regard each other, with the ring glinting in Gollum's hand. Suddenly, Frodo lunges at Gollum, thudding into him and lifting him off his feet. Frodo and Gollum, locked in struggle, plummet over the edge of the chasm. The huge foot of the cave troll lands on Aragorn's chest, and he stabs at it ineffectually. Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm. Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava. Sam leans into the Crack of Doom, seeing Frodo clinging onto the rock face with his one good hand. The caverns shake violently as Sam desperately reaches for Frodo, who is too far down. Frodo looks at Sam, his face impassive, and struggles to reach him but can't with his bleeding hand, falling back and clinging to the rock with his good hand. Frodo looks at Sam imploringly, reaches up once more, and this time Sam grasps his hand tightly. The ring sits on the river of lava for a brief moment, then sinks away. The Eye of Sauron and Mount Doom are clearly seen from the great plains, and on the battlefield, all eyes turn to Mount Doom. The cave troll, with Aragorn at his mercy, is distracted by the sounds emanating from Mordor, turns in terror, and runs off. The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces. Towers fall, walls crumble, and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash, and the Orcs flee in all directions. The company watches as Mount Doom explodes, realizing the reason for their misery is clear: Frodo and Sam can never survive the cataclysm. The volcano erupts, fire belches from its riven summit, sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around, and the skies burst into thunder, seared with lightning.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Frodo appears as he drops to his knees, clutching his bleeding hand, and screams. The blazes below roar in anger, crimson light flares, and the cavern is filled with a great glare and heat. Legolas observes Aragorn fall to the earth as Gollum triumphantly holds the band aloft, dancing gleefully, perilously close to the brink of the abyss. Aragorn turns to perceive huge troll feet advancing closer, and Legolas dashes toward him. Gollum remains triumphant on the brink of the precipice, with the fiery magma casting a wicked light. Frodo rises slowly, his eyes fix on Gollum, and time seems to stand still as they regard each other, with the band glinting in Gollum's hand. Abruptly, Frodo lunges at Gollum, thudding into him and lifting him off his feet. Frodo and Gollum, locked in struggle, plunge over the brink of the abyss. The huge foot of the cave troll lands on Aragorn's chest, and he stabs at it ineffectually. Gandalf is in despair as Sam watches in horror while Frodo and Gollum vanish into the abyss. Gollum falls into the Crack of Doom and is instantly engulfed in the churning magma. Sam leans into the Crack of Doom, seeing Frodo clinging onto the rock face with his one good hand. The caverns tremble violently as Sam desperately reaches for Frodo, who is too far down. Frodo looks at Sam, his face impassive, and struggles to reach him but can't with his bleeding hand, falling back and clinging to the rock with his good hand. Frodo looks at Sam imploringly, reaches up once more, and this time Sam grasps his hand tightly. The band sits on the river of magma for a brief moment, then sinks away. The Eye of Sauron and Mount Doom are clearly seen from the great plains, and on the battlefield, all eyes turn to Mount Doom. The cave troll, with Aragorn at his mercy, is distracted by the sounds emanating from Mordor, turns in terror, and runs off. The Fellowship turns to watch as the massive dark tower of Sauron quakes to pieces. Towers fall, walls crumble, and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash, and the Orcs flee in all directions. The company watches as Mount Doom erupts, realizing the reason for their misery is clear: Frodo and Sam can never survive the cataclysm. The volcano erupts, fire belches from its riven peak, sending magma streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around, and the heavens burst into thunder, seared with lightning."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Frodo is materialized as he is dropped to his knees, with his bleeding hand clutched, and a scream is let out by him. Anger is roared by the fires below, red light is blazed, and a great glare and heat fill the cavern. Aragorn is seen by Legolas falling to the ground as the ring is held aloft triumphantly by Gollum, who dances gleefully, perilously close to the edge of the chasm. Huge troll feet moving closer are seen by Aragorn as he turns, and toward him, Legolas races. On the edge of the precipice, Gollum remains triumphant, with an evil light cast by the fiery lava. Frodo is risen slowly, Gollum is locked on by his eyes, and time is seemed to stand still by them as they are regarded by each other, with the ring glinting in Gollum's hand. Suddenly, at Gollum, Frodo lunges, and into him, Frodo thuds, lifting him off his feet. Over the edge of the chasm, Frodo and Gollum, locked in struggle, are plummeted. Aragorn's chest is landed on by the huge foot of the cave troll, and it is stabbed at ineffectually by him. In despair, Gandalf watches in horror at Sam while Frodo and Gollum are disappeared into the chasm. Into the Crack of Doom, Gollum falls, and in the churning lava, he is instantly engulfed. Into the Crack of Doom, Sam leans, seeing Frodo clinging onto the rock face with his one good hand. As the caverns are shaken violently, Frodo is desperately reached for by Sam, who is too far down. At Sam, Frodo looks, his face impassive, and Sam is struggled to be reached by him but can't, with his bleeding hand falling back and clinging to the rock with his good hand. Frodo, imploringly looking at Sam, reaches up once more, and his hand is grasped tightly by Sam this time. On the river of lava, the ring is sat for a brief moment, then away it sinks. From the great plains, the Eye of Sauron and Mount Doom are clearly seen, and on the battlefield, eyes are turned by all to Mount Doom. With Aragorn at his mercy, the cave troll, distracted by the sounds emanating from Mordor, turns in terror and is run off. As the massive dark tower of Sauron is shaken to pieces, the Fellowship is turned to watch. Towers are fallen, walls are crumbled, and vast spires of smoke and spouting steam are billowed up as the foundations are exploded apart. In a huge cloud of ash, the black gates collapse, and in all directions, the Orcs flee. As Mount Doom is exploded, the company watches, realizing that the reason for their misery is clear: the cataclysm can never be survived by Frodo and Sam. Erupting, the volcano belches fire from its riven summit, sending lava to be streamed down its sides. Out of the Sammath Naur, Frodo and Sam are staggered as ash and molten rocks are fallen all around, and the skies are burst into thunder, seared with lightning."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Frodo appears, clutching his bleeding hand and screaming. The fires below roar, filling the cavern with intense heat and red light. Legolas sees Aragorn fall as Gollum triumphantly holds the ring, dancing near the chasm's edge. As troll feet approach, Legolas races to Aragorn. Frodo slowly rises, locking eyes with Gollum, and time stands still as the ring glints. Frodo suddenly lunges, colliding with Gollum, and both plunge over the edge. The cave troll's foot lands on Aragorn, who stabs at it ineffectively. Gandalf despairs as Sam watches Frodo and Gollum vanish. Gollum falls into the lava, while Sam sees Frodo clinging to the rock face. Frodo struggles with his bleeding hand but finally grasps Sam's hand. The ring briefly sits on the lava before sinking. Onlookers see Sauron's Eye and Mount Doom from afar. The cave troll, distracted by Mordor's sounds, flees. The Fellowship watches Sauron's tower crumble as Mount Doom erupts. The black gates collapse, and Orcs flee. The company realizes Frodo and Sam's grim fate as Mount Doom explodes. Frodo and Sam stagger out, with lava and ash falling amid lightning and thunder."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Frodo drops to his knees, clutching his bleeding hand, as fiery light blazes in the cavern. Legolas sees Aragorn fall as Gollum triumphantly holds the ring near the chasm's edge. Aragorn notices a troll approaching, and Legolas rushes towards him. Frodo confronts Gollum, and they struggle, falling into the chasm. Aragorn stabs ineffectively at the troll, but it flees in terror as Mordor's sounds echo. Gandalf despairs, and Sam watches Frodo hang onto the rock. Sam reaches, grabbing Frodo's hand tightly. The ring sinks in lava, and Sauron's tower collapses. Orcs flee as Mount Doom erupts. Frodo and Sam emerge from the Sammath Naur amid falling ash and lightning."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the intense and dramatic scene unfolds, Frodo suddenly materializes in the chaotic atmosphere. He is brought to his knees, clutching his bleeding hand tightly, and lets out a scream of agony. The fires that rage below seem to roar with anger, sending forth a blazing red light that fills the cavern with an overwhelming glare and suffocating heat. In this tumultuous environment, Legolas observes as Aragorn collapses to the ground. Meanwhile, Gollum, with a triumphant gleam in his eye, holds the ring aloft victoriously, performing a gleeful, perilous dance near the very edge of the dangerous chasm. Aragorn turns his head just in time to notice the enormous troll feet approaching threateningly, prompting Legolas to race with urgency toward him. \n\nGollum stands confidently on the precipice's brink, with the fiery molten lava casting an ominous and malevolent light around him. Frodo, gathering his strength, rises slowly to his feet, his eyes fixing intently on Gollum. In this moment, time appears to stand still as they stare at each other with the priceless ring glinting and gleaming in Gollum's grasp. Suddenly, Frodo surges forward, launching himself at Gollum, crashing into him with force and lifting him entirely off his feet. Together, locked in a fierce and desperate struggle, Frodo and Gollum plummet over the edge of the chasm.\n\nSimultaneously, the tremendous foot of the brutish cave troll comes down heavily on Aragorn's chest, leaving him futilely stabbing at it with little effect. In despair, Gandalf helplessly witnesses this scene while Sam stands by in horror, watching Frodo and Gollum vanish into the dark depths of the chasm. Gollum descends into the Crack of Doom, consumed instantly by the churning, fiery lava below. Sam, leaning precariously into the Crack of Doom, sees Frodo clinging desperately onto the rock face, using his one good hand. The caverns tremble violently as Sam reaches out desperately for Frodo, who is, alas, too far down to be reached. Frodo meets Sam's gaze, his face showing no sign of emotion, as he struggles to climb toward him. Yet, he cannot manage with his injured, bleeding hand and slips back, clutching the rock with his remaining good hand. Frodo looks up at Sam, his eyes pleading, and extends his hand once more. At this crucial moment, Sam firmly grasps his hand.\n\nThe ring, meanwhile, momentarily rests atop the flowing river of lava before it slowly sinks away into the depths. From the great plains, both the formidable Eye of Sauron and the ominous Mount Doom become visible, drawing every eye on the battlefield to turn toward Mount Doom. The cave troll, which had Aragorn at its mercy, is abruptly distracted by the piercing sounds echoing from Mordor. In a sudden terror, it turns and flees. The Fellowship collectively turns their attention to watch as Sauron's massive dark tower begins to shudder and break apart into pieces. Towers begin to collapse, walls crumble, and enormous spires of smoke and steam erupt violently as the foundations burst apart. The formidable black gates fall in a colossal cloud of ash as the Orcs scatter and flee in all directions. The company stands transfixed, watching as Mount Doom erupts with explosive force. They come to the grim realization that the reason for their enduring misery is now clear: Frodo and Sam may never survive this destructive cataclysm. The volcano erupts furiously, belching fire from its fractured summit and sending rivers of molten lava streaking down its slopes. Frodo and Sam, staggering and weary, emerge from the fiery Sammath Naur as ash and molten rocks descend all around them. Above, the skies burst open with the roar of thunder and are seared with bright flashes of lightning."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the intense, gripping, and dramatically charged scene unfolds before the viewers' eyes, Frodo suddenly materializes amidst the swirling chaotic atmosphere. He is brought down onto his knees, clutching his severely bleeding hand with all his might, and lets out a piercing scream of agony that echoes throughout the cavern. The fires raging below seem to roar with uncontained anger, sending forth a blazing, vivid red light that fills the cavernous expanse with an overwhelming glare and suffocating heat. In this tumultuous and chaotic environment, Legolas keenly observes as Aragorn collapses heavily to the ground. Meanwhile, Gollum, with a triumphant and gleeful gleam in his eye, holds the ring aloft in victory, performing a jubilant, yet perilous dance dangerously near the very edge of the treacherous chasm. Aragorn turns his head at the last possible moment, just in time to notice the enormous and threatening troll feet approaching menacingly, prompting Legolas to race with urgency and determination toward him. \n\nGollum stands confidently and triumphantly on the brink of the precipice, with the fiery molten lava casting an ominous and malevolent light around him. Frodo, summoning all his remaining strength, rises slowly but determinedly to his feet, his eyes fixing intently and unwaveringly on Gollum. In this moment of heightened tension, time appears to stand still as they stare at each other, with the priceless ring glinting and gleaming temptingly in Gollum's grasp. Suddenly, Frodo surges forward with newfound energy, launching himself at Gollum, crashing into him with force and lifting him entirely off his feet. Together, locked in a fierce and desperate struggle, Frodo and Gollum plummet over the edge of the dangerous chasm.\n\nSimultaneously, the enormous and tremendous foot of the brutish cave troll comes down heavily onto Aragorn's chest, leaving him futilely stabbing at it with little to no effect. In utter despair, Gandalf helplessly witnesses this harrowing scene, while Sam stands by in horror, watching as Frodo and Gollum vanish into the dark, unforgiving depths of the chasm. Gollum descends into the Crack of Doom, consumed instantly by the churning, fiery lava swirling below him. Sam, leaning precariously into the yawning Crack of Doom, sees Frodo clinging desperately onto the rough rock face, using his one good hand to hang on. The caverns tremble violently as Sam urgently reaches out for Frodo, who is, alas, too far down to be reached. Frodo meets Sam's gaze, his face betraying no sign of emotion, as he struggles valiantly to climb upward toward him. Yet, he cannot manage with his injured, bleeding hand and slips back, clutching desperately onto the rock with his remaining good hand. Frodo looks up at Sam, his eyes pleading silently, and extends his hand once more in a final effort. At this crucial moment, Sam firmly grasps his hand with determination.\n\nThe ring, meanwhile, momentarily rests atop the flowing, tumultuous river of lava before it slowly and inexorably sinks away into the molten depths. From the great plains, both the formidable Eye of Sauron and the ominous Mount Doom become visible, drawing every eye on the battlefield to turn toward the menacing Mount Doom. The cave troll, which had until then held Aragorn at its mercy, is abruptly distracted by the piercing and fearsome sounds echoing from the direction of Mordor. In a sudden terror, it turns and flees. The Fellowship collectively turns their attention to watch intently as Sauron's massive dark tower begins to shudder and break apart into fragmented pieces. Towers begin to collapse, walls crumble, and enormous spires of smoke and steam erupt violently as the very foundations burst apart. The formidable black gates fall in a colossal cloud of ash as the Orcs scatter and flee rapidly in all directions. The company stands transfixed, watching in awe and horror as Mount Doom erupts with explosive and destructive force. They come to the grim realization that the reason for their enduring misery is now clear, and they grasp the sobering truth that Frodo and Sam may never survive this catastrophic and destructive cataclysm. The volcano erupts furiously, belching fiery torrents from its fractured summit and sending searing rivers of molten lava streaking down its slopes. Frodo and Sam, staggering and utterly weary, emerge from the fiery entrance of Sammath Naur as ash and molten rocks descend ominously all around them. Above, the skies burst open with the deafening roar of thunder, accompanied by bright flashes of lightning searing across the heavens."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Frodo materializes out of nowhere, suddenly dropping to his knees in an expression of agony as he clutches his bleeding hand, from which blood seeps rapidly, and lets out a piercing scream that echoes through the cavern. Beneath him, the fires rage with fury, their roar intensifying as an angry red light bursts forth, combining to fill the cavern with an intense glare and suffocating heat. As this chaos unfolds, Legolas's eyes catch the sight of Aragorn losing his balance and collapsing to the ground, while nearby, Gollum, his eyes gleaming with victory, jubilantly holds the ring high above his head, his body swaying in a dangerous dance as he edges closer to the precarious brink of the chasm. Meanwhile, Aragorn, feeling the ground tremble, turns his head just in time to see the colossal feet of a troll moving menacingly closer, prompting Legolas to sprint towards him in a desperate bid to provide assistance. All the while, Gollum continues his exultation at the edge of the precipice, the fiery glow from the lava below casting a sinister light that dances across his twisted features. Slowly, Frodo collects himself, rising to his feet with determination, and fixes his gaze upon Gollum, their eyes locking as if time itself has frozen, each aware of the ring's ominous glint in Gollum's grasp. In a sudden burst of resolve, Frodo propels himself at Gollum, their bodies colliding with a heavy thud, and together they lift off the ground, losing balance as they tumble over the edge of the chasm in a desperate struggle. At that same moment, the massive foot of the cave troll crashes down onto Aragorn's chest, pressing him harshly to the ground as he attempts to stab at it with his sword, though his efforts prove futile. Nearby, Gandalf is enveloped in a cloud of despair, while Sam stands frozen in horror, witnessing Frodo and Gollum vanish into the depths of the chasm. Below, Gollum is immediately consumed by the churning lava of the Crack of Doom, vanishing without a trace. Sam, driven by urgency, leans perilously over the edge, straining to see Frodo clinging to the jagged rock face with the strength of his one good hand. The cavern continues to shudder violently, disorienting Sam as he struggles to reach Frodo, who is too far down. Frodo, his face an impassive mask, gazes up at Sam, straining to extend his arm, but his bleeding hand fails him, forcing him to cling desperately to the rock with his remaining strength. With a look of urgent appeal, Frodo stretches his arm upward once more, and this time, Sam's hand encloses his securely. Meanwhile, the ring, momentarily resting atop the flowing river of lava, succumbs to the molten current and sinks inexorably away. From the great plains, the Eye of Sauron and the fiery peak of Mount Doom stand in stark, ominous clarity, drawing all attention on the battlefield to focus upon the volatile mountain. The cave troll, momentarily distracted by the ominous sounds echoing from Mordor, turns from Aragorn in a fit of terror and bolts away. The Fellowship, their attention diverted, fixates on the distant silhouette of Sauron's immense dark tower as it begins to disintegrate, each tower and wall crumbling in sequence, while vast plumes of smoke and steam erupt violently, signaling the collapse of the foundations. The black gates of Mordor come crashing down, engulfed in a thick cloud of ash, causing panic-stricken Orcs to scatter in all directions. As the last remnants of Sauron's power crumble, the members of the company fix their gaze on Mount Doom's explosive eruption, the reason for their long-endured misery becoming painfully clear: it seems impossible for Frodo and Sam to have survived such cataclysm. Atop the erupting volcano, fire spews from its shattered summit, sending torrents of molten lava streaming down the mountainside. In a scene of mere survival, Frodo and Sam stagger out of the Sammath Naur, ash cascading around them like a dark shroud, molten rocks raining down, while the sky above tears open with violent thunder and streaks of blinding lightning."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Frodo materializes, collapsing to his knees with a scream as he clutches his bleeding hand amidst the roaring, fiery cavern. Legolas witnesses Aragorn fall while Gollum dances triumphantly with the ring at the chasm's edge. As a troll approaches, Legolas rushes to Aragorn's aid. Frodo rises, locking eyes with Gollum in a tense moment before lunging at him, leading both to plummet into the chasm. Aragorn struggles ineffectively against the troll until it is distracted by commotion from Mordor and flees. Gandalf despairs as Sam watches Frodo and Gollum vanish. Gollum is engulfed by lava, while Frodo clings to the rock face. Sam desperately reaches for Frodo, who, after a struggle, manages to grasp Sam's hand firmly. The ring briefly floats on the lava before sinking. As the Eye of Sauron and Mount Doom are visible across the plains, the Fellowship and battlefield look on. Mount Doom erupts violently, the dark tower collapses, and Orcs scatter as the ash cloud rises. Realizing Frodo and Sam's peril, the company observes the cataclysm. Against the odds, Frodo and Sam emerge from Sammath Naur, staggering through falling ash and molten rock under stormy skies."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Frodo materializes as he drops to his knees, clutching his bleeding hand, and screams after having his finger bitten off in a struggle. The fires below, part of the volcanic heart of Mount Doom, roar in anger, red light blazes, and the cavern is filled with a great glare and heat. Legolas, part of the Fellowship of the Ring allied to destroy Sauron's power, sees Aragorn fall to the ground as Gollum triumphantly holds the One Ring aloft, dancing gleefully, perilously close to the edge of the chasm in the heart of Mordor. Aragorn turns to see huge troll feet moving closer, a dangerous cave troll that serves the forces of Sauron, and Legolas races toward him. Gollum remains triumphant on the edge of the precipice, with the fiery lava casting an evil light symbolic of the corruption of the ring. Frodo, the ring-bearer chosen for this perilous quest, rises slowly, his eyes lock on Gollum, and time seems to stand still as they regard each other, with the ring glinting in Gollum's hand. Suddenly, Frodo lunges at Gollum, thudding into him and lifting him off his feet. Frodo and Gollum, locked in struggle over the fate of Middle-earth, plummet over the edge of the chasm. The huge foot of the cave troll lands on Aragorn's chest, one of the future kings of Gondor, and he stabs at it ineffectually. Gandalf, the wise wizard and leader of the Fellowship, is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm. Gollum falls into the Crack of Doom, a fiery abyss where the ring was forged, and is instantly engulfed in the churning lava. Sam, Frodo's loyal companion, leans into the Crack of Doom, seeing Frodo clinging onto the rock face with his one good hand. The caverns shake violently to the core of Mount Doom as Sam desperately reaches for Frodo, who is too far down. Frodo looks at Sam, his face impassive, and struggles to reach him but can't with his bleeding hand, falling back and clinging to the rock with his good hand. Frodo looks at Sam imploringly, reaches up once more, and this time Sam grasps his hand tightly. The ring, the source of Sauron's power, sits on the river of lava for a brief moment, then sinks away. The Eye of Sauron, the dark lord's omniscient gaze, and Mount Doom are clearly seen from the great plains, and on the battlefield, all eyes turn to Mount Doom. The cave troll, with Aragorn at his mercy, is distracted by the sounds emanating from Mordor, a region synonymous with evil, turns in terror, and runs off. The Fellowship turns to watch as the massive dark tower of Sauron, Barad-dûr, shakes itself to pieces. Towers fall, walls crumble, and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates, the formidable entrance to Mordor, collapse in a huge cloud of ash, and the Orcs flee in all directions. The company watches as Mount Doom explodes, realizing the reason for their misery is clear: Frodo and Sam can never survive the cataclysm. The volcano erupts, fire belches from its riven summit, sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur, the chambers within Mount Doom, as ash and molten rocks fall all around, and the skies burst into thunder, seared with lightning, heralding the end of an age."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "red light blazes and the cavern is filled with a great glare and heat Frodo materializes as he drops to his knees clutching his bleeding hand and screams Frodo and Gollum locked in struggle plummet over the edge of the chasm The fires below roar in anger The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces red light blazes and the cavern is filled with a great glare and heat Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm Aragorn turns to see huge troll feet moving closer and Legolas races toward him Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm Frodo materializes as he drops to his knees clutching his bleeding hand and screams The caverns shake violently as Sam desperately reaches for Frodo who is too far down Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet Frodo and Gollum locked in struggle plummet over the edge of the chasm Aragorn turns to see huge troll feet moving closer and Legolas races toward him The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand The company watches as Mount Doom explodes realizing the reason for their misery is clear The caverns shake violently as Sam desperately reaches for Frodo who is too far down Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly The ring sits on the river of lava for a brief moment then sinks away Frodo and Sam can never survive the cataclysm The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield all eyes turn to Mount Doom The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart The volcano erupts fire belches from its riven summit sending lava streaming down its sides The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart The black gates collapse in a huge cloud of ash and the Orcs flee in all directions The company watches as Mount Doom explodes realizing the reason for their misery is clear Frodo and Sam can never survive the cataclysm The volcano erupts fire belches from its riven summit sending lava streaming down its sides Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Frodo materializes as he drops to his knees clutching his bleeding hand and screams. The fires below roar in anger. red light blazes and the cavern is filled with a great glare and heat. Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm. Aragorn turns to see huge troll feet moving closer and Legolas races toward him. Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light. Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand. Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet. Frodo and Gollum locked in struggle plummet over the edge of the chasm. The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually. Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm. Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava. Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The caverns shake violently as Sam desperately reaches for Frodo who is too far down. Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand. Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly. The ring sits on the river of lava for a brief moment then sinks away. The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield. all eyes turn to Mount Doom. The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off. The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces. Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash and the Orcs flee in all directions. The company watches as Mount Doom explodes realizing the reason for their misery is clear. Frodo and Sam can never survive the cataclysm. The volcano erupts fire belches from its riven summit sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Frodo materializes as he drops to his knees clutching his bleeding hand and screams. The fires below roar in anger. red light blazes and the cavern is filled with a great glare and heat. Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm. Aragorn turns to see huge troll feet moving closer and Legolas races toward him. Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light. Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand. Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet. Frodo and Gollum locked in struggle plummet over the edge of the chasm. The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually. Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm. Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava. Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The caverns shake violently as Sam desperately reaches for Frodo who is too far down. Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand. Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly. The ring sits on the river of lava for a brief moment then sinks away. The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield. all eyes turn to Mount Doom. The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off. The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces. Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash and the Orcs flee in all directions. The company watches as Mount Doom explodes realizing the reason for their misery is clear. Frodo and Sam can never survive the cataclysm. The volcano erupts fire belches from its riven summit sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Frodo materializes as he drops to his knees clutching his bleeding hand and screams. The fires below roar in anger. red light blazes and the cavern is filled with a great glare and heat. Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm. Aragorn turns to see huge troll feet moving closer and Legolas races toward him. Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light. Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand. The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces. Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash and the Orcs flee in all directions. The company watches as Mount Doom explodes realizing the reason for their misery is clear. Frodo and Sam can never survive the cataclysm. The volcano erupts fire belches from its riven summit sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Frodo materializes as he drops to his knees clutching his bleeding hand and screams. The fires below roar in anger. red light blazes and the cavern is filled with a great glare and heat. Frodo and Sam can never survive the cataclysm. The volcano erupts fire belches from its riven summit sending lava streaming down its sides. Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gandalf materializes as he drops to his knees, clutching his bleeding hand, and screams. The fires below roar in anger, red light blazes, and the cavern is filled with a great glare and heat. Gimli sees Boromir fall to the ground as Arwen triumphantly holds the ring aloft, dancing gleefully, perilously close to the edge of the chasm. Boromir turns to see huge troll feet moving closer, and Gimli races toward him. Arwen remains triumphant on the edge of the precipice, with the fiery lava casting an evil light. Gandalf rises slowly, his eyes lock on Arwen, and time seems to stand still as they regard each other, with the ring glinting in Arwen's hand. Suddenly, Gandalf lunges at Arwen, thudding into her and lifting her off her feet. Gandalf and Arwen, locked in struggle, plummet over the edge of the chasm. The huge foot of the cave troll lands on Boromir's chest, and he stabs at it ineffectually. Frodo is in despair as Merry watches in horror while Gandalf and Arwen disappear into the chasm. Arwen falls into the Crack of Doom and is instantly engulfed in the churning lava. Merry leans into the Crack of Doom, seeing Gandalf clinging onto the rock face with his one good hand. The caverns shake violently as Merry desperately reaches for Gandalf, who is too far down. Gandalf looks at Merry, his face impassive, and struggles to reach him but can't with his bleeding hand, falling back and clinging to the rock with his good hand. Gandalf looks at Merry imploringly, reaches up once more, and this time Merry grasps his hand tightly. The ring sits on the river of lava for a brief moment, then sinks away. The Eye of Saruman and Mount Doom are clearly seen from the great plains, and on the battlefield, all eyes turn to Mount Doom. The cave troll, with Boromir at his mercy, is distracted by the sounds emanating from Mordor, turns in terror, and runs off. The Fellowship turns to watch as the massive dark tower of Saruman shakes itself to pieces. Towers fall, walls crumble, and vast spires of smoke and spouting steam billow up as the foundations explode apart. The black gates collapse in a huge cloud of ash, and the Orcs flee in all directions. The company watches as Mount Doom explodes, realizing the reason for their misery is clear: Gandalf and Merry can never survive the cataclysm. The volcano erupts, fire belches from its riven summit, sending lava streaming down its sides. Gandalf and Merry stagger out of the Sammath Naur as ash and molten rocks fall all around, and the skies burst into thunder, seared with lightning."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Frodo materializes as he drops to his knees, clutching his bleeding wrist, and screams. The geysers below roar in anger, purple light blazes, and the quarry is filled with a great glare and heat. Legolas sees Aragorn fall to the grass as Gollum triumphantly holds the pendant aloft, dancing gleefully, perilously close to the edge of the gully. Aragorn turns to see massive giant feet moving closer, and Legolas races toward him. Gollum remains triumphant on the edge of the abyss, with the flaming tar casting an evil light. Frodo rises slowly, his eyes lock on Gollum, and time seems to stand still as they regard each other, with the pendant glinting in Gollum's hand. Suddenly, Frodo lunges at Gollum, thudding into him and lifting him off his feet. Frodo and Gollum, locked in struggle, plummet over the edge of the chasm. The gigantic foot of the ogre lands on Aragorn's chest, and he stabs at it ineffectually. Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the gorge. Gollum falls into the Abyss of Despair and is instantly engulfed in the churning tar. Sam leans into the Abyss of Despair, seeing Frodo clinging onto the cliff face with his one good arm. The quarries shake violently as Sam desperately reaches for Frodo, who is too far down. Frodo looks at Sam, his face impassive, and struggles to reach him but can't with his bleeding wrist, falling back and clinging to the cliff with his good arm. Frodo looks at Sam imploringly, reaches up once more, and this time Sam grasps his arm tightly. The pendant sits on the river of tar for a brief moment, then sinks away. The Eye of the Sorceress and the Mountain of Woe are clearly seen from the great fields, and on the plain, all eyes turn to the Mountain of Woe. The ogre, with Aragorn at his mercy, is distracted by the sounds emanating from the Badlands, turns in terror, and runs off. The Fellowship turns to watch as the massive dark tower of the Sorceress shakes itself to pieces. Towers fall, walls crumble, and vast spires of smoke and spouting steam billow up as the foundations explode apart. The ebony gates collapse in a huge cloud of ash, and the Goblins flee in all directions. The company watches as the Mountain of Woe explodes, realizing the reason for their misery is clear: Frodo and Sam can never survive the cataclysm. The volcano erupts, fire belches from its riven summit, sending lava streaming down its sides. Frodo and Sam stagger out of the Echoing Hollow as ash and molten stones fall all around, and the skies burst into thunder, seared with lightning."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Frodo appears as he bends to his knees, gripping his injured hand, and shouts. The fires below growl in anger, red light flashes, and the cavern is filled with a great sparkle and warmth. Legolas notices Aragorn collapse to the ground as Gollum victoriously displays the ring aloft, twirling gleefully, perilously near to the rim of the abyss. Aragorn glances to see huge troll feet advancing closer, and Legolas sprints toward him. Gollum stays jubilant on the brink of the precipice, with the fiery lava casting an ominous light. Frodo stands slowly, his eyes meet Gollum's, and time seems to freeze as they observe each other, with the ring shimmering in Gollum's hand. Suddenly, Frodo charges at Gollum, colliding into him and raising him off his feet. Frodo and Gollum, locked in a fight, tumble over the edge of the abyss. The massive foot of the cave troll stomps on Aragorn's chest, and he slashes at it inefficiently. Gandalf is in hopelessness as Sam stares in shock while Frodo and Gollum vanish into the abyss. Gollum plummets into the Crack of Doom and is instantly swallowed by the swirling lava. Sam leans over the Crack of Doom, seeing Frodo hanging onto the rock surface with his one good hand. The caverns tremble violently as Sam frantically reaches for Frodo, who is too far below. Frodo gazes at Sam, his face emotionless, and strains to reach him but can't with his injured hand, falling back and holding to the rock with his good hand. Frodo looks at Sam beseechingly, extends up once more, and this time Sam clutches his hand firmly. The ring rests on the river of lava for a brief moment, then descends away. The Eye of Sauron and Mount Doom are clearly visible from the great plains, and on the battlefield, all eyes shift to Mount Doom. The cave troll, with Aragorn at his mercy, is startled by the noises emanating from Mordor, turns in fright, and dashes off. The Fellowship turns to observe as the massive dark tower of Sauron disintegrates. Towers collapse, walls disintegrate, and enormous columns of smoke and erupting steam surge up as the foundations rupture apart. The black gates crumble in a huge cloud of ash, and the Orcs scatter in all directions. The company observes as Mount Doom detonates, comprehending the reason for their sorrow is clear: Frodo and Sam can never withstand the cataclysm. The volcano bursts, fire spews from its split summit, sending lava cascading down its slopes. Frodo and Sam stumble out of the Sammath Naur as ash and molten stones rain all around, and the skies erupt into thunder, scorched with lightning."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Bilbo materializes as he drops to his knees, clutching his bleeding elbow, and screams. The trees below roar in anger, orange light blazes, and the meadow is filled with a great glare and heat. Gimli sees Boromir fall to the ground as Smaug triumphantly holds the goblet aloft, dancing gleefully, perilously close to the edge of the ravine. Boromir turns to see huge spider legs moving closer, and Gimli races toward him. Smaug remains triumphant on the edge of the cliff, with the fiery ocean casting an evil light. Bilbo rises slowly, his eyes lock on Smaug, and time seems to stand still as they regard each other, with the goblet glinting in Smaug's hand. Suddenly, Bilbo lunges at Smaug, thudding into him and lifting him off his feet. Bilbo and Smaug, locked in struggle, plummet over the edge of the ravine. The huge leg of the cave spider lands on Boromir's chest, and he stabs at it ineffectually. Saruman is in despair as Pippin watches in horror while Bilbo and Smaug disappear into the ravine. Smaug falls into the Crack of Doom and is instantly engulfed in the churning ocean. Pippin leans into the Crack of Doom, seeing Bilbo clinging onto the cliff face with his one good elbow. The meadows shake violently as Pippin desperately reaches for Bilbo, who is too far down. Bilbo looks at Pippin, his face impassive, and struggles to reach him but can't with his bleeding elbow, falling back and clinging to the cliff with his good elbow. Bilbo looks at Pippin imploringly, reaches up once more, and this time Pippin grasps his elbow tightly. The goblet sits on the river of ocean for a brief moment, then sinks away. The Nose of Smaug and Mount Oblivion are clearly seen from the great plains, and on the picnic, all eyes turn to Mount Oblivion. The cave spider, with Boromir at his mercy, is distracted by the sounds emanating from Rohan, turns in terror, and runs off. The Alliance turns to watch as the massive dark lighthouse of Smaug shakes itself to pieces. Lighthouses fall, walls crumble, and vast smoke rings and spouting bubbles billow up as the foundations explode apart. The black curtains collapse in a huge cloud of feathers, and the dragons flee in all directions. The troupe watches as Mount Oblivion explodes, realizing the reason for their misery is clear: Bilbo and Pippin can never survive the cataclysm. The volcano erupts, wind belches from its riven summit, sending ocean streaming down its sides. Bilbo and Pippin stagger out of the Sammath Naur as feathers and molten pebbles fall all around, and the skies burst into thunder, seared with fireworks."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gandalf emerges as he crawls to his feet, holding his injured shoulder, and whispers. The waters below murmur in delight, blue shadows shimmer, and the forest is filled with a serene silence and peace. Gimli notices Boromir rise to his feet as Bilbo triumphantly raises a staff, jumping cheerfully, safely near the center of the meadow. Boromir turns to see small goblin hands reaching upward, and Gimli strolls toward him. Bilbo remains jubilant on the edge of the meadow, with the tranquil moonlight casting a gentle glow. Gandalf sinks quickly, his eyes meet Bilbo’s, and the moment seems to stretch as they acknowledge each other, with the staff glittering in Bilbo's grip. Suddenly, Gandalf sprints toward Bilbo, colliding with him and yanking him off his perch. Gandalf and Bilbo, caught in a dance, tumble across the center of the meadow. The tiny hand of the goblin brushes Boromir's back, and he gently nudges it aside. Treebeard is in contemplation as Merry observes in wonder while Gandalf and Bilbo roll across the meadow. Bilbo slides into the River of Light and is gradually swallowed by the calm waters. Merry leans towards the River of Light, noticing Gandalf holding onto the tree branch with his one good arm. The meadows sway peacefully as Merry cautiously reaches for Gandalf, who is too far across. Gandalf glances at Merry, his face serene, and tries to reach him but can’t with his injured shoulder, slipping back and holding the branch with his good arm. Gandalf gazes at Merry imploringly, extends his arm again, and this time Merry clasps his arm securely. The staff floats on the calm waters for a fleeting moment, then drifts away. The Crest of the Dragon and the Peak of Shadows can be seen from the distant valleys, and on the battlefield, all eyes shift to the Peak of Shadows. The goblin, with Boromir at its mercy, is diverted by the whispers echoing from Gondor, glances in confusion, and scuttles away. The Alliance turns to observe as the towering white spire of Gondor crumbles magnificently. Trees sway, hills dissolve, and gentle wafts of mist and falling leaves swirl up as the roots disintegrate apart. The wooden gates disintegrate in a gentle wave of pollen, and the sprites scatter in all directions. The fellowship watches as the Peak of Shadows collapses, understanding the cause of their joy is certain: Gandalf and Merry will always endure the tempest. The mountain trembles, water surges from its opened peak, sending streams cascading down its slopes. Gandalf and Merry stride out of the Forest of Dreams as leaves and gentle streamlets drift all around, and the air shimmers with a gentle breeze."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Frodo appears as he falls to his elbows, grasping his injured knee, and yells. The winds above howl in protest, blue shadow shimmers, and the chamber is filled with an overwhelming chill and darkness. Legolas notices Aragorn tumble onto the ground as Gollum victoriously brandishes the amulet overhead, frolicking joyously, dangerously near to the brink of the abyss. Aragorn glances to see enormous dragon wings sweeping closer, and Legolas dashes toward him. Gollum stays victorious on the verge of the cliff, with the icy waterfall casting a sinister glow. Frodo stands gradually, his gaze fixes on Gollum, and moments feel eternal as they stare at each other, with the amulet sparkling in Gollum's grasp. Suddenly, Frodo leaps at Gollum, crashing into him and yanking him into the air. Frodo and Gollum, locked in combat, descend over the brink of the abyss. The massive wing of the cave dragon lands on Aragorn's shoulder, and he swipes at it weakly. Gandalf is in anguish as Sam observes in dread while Frodo and Gollum vanish into the abyss. Gollum plummets into the Abyss of Doom and is quickly consumed by the swirling air. Sam leans over the Abyss of Doom, spotting Frodo clinging onto the stalactite with his one functional knee. The chambers shudder intensely as Sam urgently reaches for Frodo, who is too far below. Frodo glances at Sam, his face unreadable, and strives to reach him but can't with his injured knee, slipping back and grasping the stalactite with his healthy knee. Frodo gazes at Sam beseechingly, reaches up once more, and this time Sam clasps his knee firmly. The amulet rests on the stream of wind for a fleeting instant, then drifts away. The Orb of Sauron and Mountain of Doom are plainly visible from the vast fields, and on the battlefield, all eyes shift to Mountain of Doom. The cave dragon, with Aragorn at his mercy, is startled by the noises echoing from Mordor, turns in panic, and flies away. The Fellowship turns to observe as the immense shadowy tower of Sauron fractures into fragments. Pillars topple, barriers disintegrate, and wide columns of fog and erupting mist plume up as the groundwork shatters apart. The dark portals fall in a gigantic veil of dust, and the Goblins scatter in every direction. The group observes as Mountain of Doom bursts, understanding the cause of their anguish is evident: Frodo and Sam can never withstand the disaster. The volcano detonates, water spews from its cracked peak, sending streams down its slopes. Frodo and Sam stagger out of the Sammath Naur as dust and solid ice crash all around, and the heavens erupt into hail, seared with meteors."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bilbo emerges as he tumbles to his elbows, gripping his feathered hat, and whispers. The rivers above sing in joy, blue shadow flickers, and the meadow is filled with a gentle breeze and cold. Gimli notices Legolas rise to the sky as Smaug victoriously clutches the crown overhead, twirling merrily, dangerously far from the cliff of the meadow. Legolas rotates to notice tiny rabbit ears leaping nearer, and Gimli hops toward him. Smaug remains victorious near the brink of the abyss, with the soft ocean casting a serene glow. Bilbo stands quickly, his ears focus on Smaug, and space seems to whirl endlessly as they blink at each other, with the crown shimmering in Smaug's grasp. Abruptly, Bilbo dashes toward Smaug, crashing into him and swinging him out of his legs. Bilbo and Smaug, locked in dance, soar over the brink of the meadow. The tiny paw of the rabbit lands on Legolas's elbow, and he nudges at it gently. Saruman is in glee as Merry laughs in delight while Bilbo and Smaug vanish into the meadow. Smaug leaps into the Split of Time and is silently surrounded by the swirling water. Merry bends into the Split of Time, spotting Bilbo clutching onto the branch with his golden glove. The meadows sway softly as Merry urgently stretches for Bilbo, who is too high up. Bilbo gazes at Merry, his face cheerful, and strains to reach him but can't with his feathered hat, pulling back and holding the branch with his golden glove. Bilbo glances at Merry joyfully, reaches down once more, and this time Merry secures his glove firmly. The crown rests on the stream of water for a fleeting moment, then floats away. The Hand of Numenor and Mount Delight are vividly seen from the rolling hills, and on the sea, all eyes shift to Mount Delight. The rabbit, with Legolas under his shield, is mesmerized by the noises arising from Gondor, swivels in wonder, and leaps away. The Alliance turns to glimpse as the towering white tower of Numenor beams its lights to stars. Pagodas rise, gates create, and endless columns of clouds and shimmering waves ripple down as the foundations build anew. The golden doors construct in a massive veil of dew, and the Elves dash in all directions. The crew peeks as Mount Delight glows, understanding the reason for their joy is vivid: Bilbo and Merry will always rejoice the spectacle. The peak illuminates, stars twinkle from its glowing summit, sending streams cascading up its sides. Bilbo and Merry dance out of the Haven's Light as stars and cool breezes rise all around, and the heavens glow with hues, brushed with rainbows."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Frodo collapses, clutching his bleeding hand and screaming amid the roaring fires. Legolas sees Aragorn fall as Gollum, near the chasm's edge, holds the ring triumphantly. Aragorn notices approaching troll feet, and Legolas rushes to help. Frodo rises, locking eyes with Gollum before lunging at him. Both plummet over the edge in their struggle. The cave troll pins Aragorn, but Gandalf and Sam watch helplessly. Gollum falls into the lava, while Frodo clings to the rock face. Sam desperately reaches for him, and, finally grasping Frodo's hand, pulls him to safety. The ring sinks into the lava. Mount Doom and Sauron's tower collapse, causing chaos among the Orcs. The Fellowship witnesses the eruption and fears Frodo and Sam’s fate. Amidst thunder and lava, Frodo and Sam emerge from Sammath Naur as destruction rains down."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning The volcano erupts fire belches from its riven summit sending lava streaming down its sides Frodo and Sam can never survive the cataclysm The company watches as Mount Doom explodes realizing the reason for their misery is clear The black gates collapse in a huge cloud of ash and the Orcs flee in all directions Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off all eyes turn to Mount Doom The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield The ring sits on the river of lava for a brief moment then sinks away Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand The caverns shake violently as Sam desperately reaches for Frodo who is too far down Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually Frodo and Gollum locked in struggle plummet over the edge of the chasm Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light Aragorn turns to see huge troll feet moving closer and Legolas races toward him Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm red light blazes and the cavern is filled with a great glare and heat The fires below roar in anger Frodo materializes as he drops to his knees clutching his bleeding hand and screams"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The ring sits on the river of lava for a brief moment then sinks away Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly The black gates collapse in a huge cloud of ash and the Orcs flee in all directions Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava all eyes turn to Mount Doom The fires below roar in anger Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand Frodo and Sam can never survive the cataclysm The caverns shake violently as Sam desperately reaches for Frodo who is too far down red light blazes and the cavern is filled with a great glare and heat The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield The volcano erupts fire belches from its riven summit sending lava streaming down its sides Aragorn turns to see huge troll feet moving closer and Legolas races toward him Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet Frodo and Gollum locked in struggle plummet over the edge of the chasm The company watches as Mount Doom explodes realizing the reason for their misery is clear Frodo materializes as he drops to his knees clutching his bleeding hand and screams Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Frodo looks at Sam his face impassive and struggles to reach him but cannot with his bleeding hand falling back and clinging to the rock with his good hand Frodo looks at Sam imploringly reaches up once more and this time Sam grasps his hand tightly The ring sits on the river of lava for a brief moment then sinks away The Eye of Sauron and Mount Doom are clearly seen from the great plains and on the battlefield all eyes turn to Mount Doom The cave troll with Aragorn at his mercy is distracted by the sounds emanating from Mordor turns in terror and runs off The Fellowship turns to watch as the massive dark tower of Sauron shakes itself to pieces Towers fall walls crumble and vast spires of smoke and spouting steam billow up as the foundations explode apart The black gates collapse in a huge cloud of ash and the Orcs flee in all directions The company watches as Mount Doom explodes realizing the reason for their misery is clear Frodo and Sam can never survive the cataclysm The volcano erupts fire belches from its riven summit sending lava streaming down its sides Frodo and Sam stagger out of the Sammath Naur as ash and molten rocks fall all around and the skies burst into thunder seared with lightning Frodo materializes as he drops to his knees clutching his bleeding hand and screams The fires below roar in anger red light blazes and the cavern is filled with a great glare and heat Legolas sees Aragorn fall to the ground as Gollum triumphantly holds the ring aloft dancing gleefully perilously close to the edge of the chasm Aragorn turns to see huge troll feet moving closer and Legolas races toward him Gollum remains triumphant on the edge of the precipice with the fiery lava casting an evil light Frodo rises slowly his eyes lock on Gollum and time seems to stand still as they regard each other with the ring glinting in Gollum's hand Suddenly Frodo lunges at Gollum thudding into him and lifting him off his feet Frodo and Gollum locked in struggle plummet over the edge of the chasm The huge foot of the cave troll lands on Aragorn's chest and he stabs at it ineffectually Gandalf is in despair as Sam watches in horror while Frodo and Gollum disappear into the chasm Gollum falls into the Crack of Doom and is instantly engulfed in the churning lava Sam leans into the Crack of Doom seeing Frodo clinging onto the rock face with his one good hand The caverns shake violently as Sam desperately reaches for Frodo who is too far down"
        }
      ]
    }
  ]
}