{
  "ground_truth": "Football hero Edward leads his team to victory. On the sidelines, a pretty girl admits the name of her secret love, and the other girls squeal in agreement. Don Price looks over and glowers. Edward takes an impossible shot at the buzzer from the other end of the court and, naturally, makes it, winning the game. As the crowd goes wild for Edward, Don Price is the only teammate who doesn't mob him. Edward carries a dog out of a burning house, and a flash occurs. Pissed, Don Price throws his crappy lima bean plants in the trash. As two farmers shake their heads, we reverse to show a massive hole punched through the side of a barn, roughly the shape of a man, but no human could be that large. We still haven't seen the full stranger. A mob of about 50 have gathered, many of them with shotguns, and amid the crowd, we see Don Price. There is agreement from the crowd, and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price glowers as Edward climbs up the last bit of the steep hillside, reaching the mouth of a cave. Outside, buzzards squabble over the remains of the giant's feast: broken barrels, bones picked clean. In his most serious voice, Edward calls out. From deep in a cave comes a thunderous voice, and the giant's voice has such force that it blows Edward's hair back. A beat passes, then we hear a rumble, like a train coming. Edward braces himself, fists ready for a fight if that's what it's going to take. As the rumble gets louder, the ground starts to shake, and Edward wonders just how big this guy is. Edward picks up a stone, ready to play David to Goliath. Karl the giant is bigger than any man you've ever seen, completely feral, with a beard to his elbow and skin scratched and blistered. What remains of his clothes are ragged and muddy. Karl leans over Edward, blocking the sun. Edward throws his rock, but it just bounces off. Edward ponders the best response, settling on closing his eyes, hands at his side, ready to be eaten. Karl just stares at him, not sure what to do. After a beat, Edward opens his eyes a tiny bit, just to see what the giant is doing, and is relieved to see he's not licking his chops. Karl sits down with a boom, dejected. Reaching up, Edward shoves his hand into Karl's mouth, but the giant spits it back out. And that's the sad truth. Karl is less a monster than a freak—a giant man, but in the end, just a man. Edward takes a seat beside him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Soccer champion Edward guides his squad to triumph. On the sideline, a beautiful girl confesses the identity of her clandestine affection, and the other girls shriek in agreement. Don Price glances over and scowls. Edward attempts an unthinkable shot at the buzzer from the opposite end of the court and, naturally, achieves it, securing the match. As the audience goes wild for Edward, Don Price is the only colleague who doesn't swarm him. Edward rescues a canine from a blazing dwelling, and a flash ensues. Irate, Don Price tosses his lousy lima bean vegetation in the garbage. As two cultivators shake their heads, we reverse to display an enormous cavity punched through the side of a barn, roughly the shape of a human, but no person could be that gigantic. We still haven't beheld the complete stranger. A multitude of about 50 have gathered, many of them with shotguns, and amid the throng, we notice Don Price. There is consensus from the crowd, and then everyone turns to observe who stated that. The assembly parts to expose none other than Edward Bloom. Don Price scowls as Edward ascends the final portion of the steep mountainside, reaching the entrance of a cavern. Outside, vultures bicker over the remnants of the giant's banquet: shattered casks, bones picked clean. In his sternest voice, Edward calls out. From deep within a cave comes a thunderous voice, and the giant's voice possesses such power that it blows Edward's hair back. A moment passes, then we hear a rumble, like a locomotive arriving. Edward steadies himself, fists ready for a conflict if that's what it's going to take. As the rumble becomes louder, the ground begins to tremble, and Edward speculates just how enormous this fellow is. Edward picks up a stone, ready to play David to Goliath. Karl the giant is larger than any man you've ever seen, completely feral, with a beard to his elbow and skin scratched and blistered. What remains of his garments are tattered and filthy. Karl leans over Edward, obstructing the sun. Edward hurls his rock, but it just ricochets off. Edward considers the best reaction, deciding on closing his eyes, hands at his side, ready to be consumed. Karl just gazes at him, uncertain what to do. After a moment, Edward opens his eyes a tiny bit, just to see what the giant is doing, and is relieved to see he's not licking his chops. Karl sits down with a boom, dejected. Reaching up, Edward thrusts his hand into Karl's mouth, but the giant expels it back out. And that's the sad reality. Karl is less a monster than a freak—a gigantic man, but ultimately, just a man. Edward takes a seat beside him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Football hero Edward is led to victory by his team. On the sidelines, the name of her secret love is admitted by a pretty girl, and agreement is squealed by the other girls. Don Price looks over and glowers. An impossible shot is taken by Edward at the buzzer from the other end of the court and, naturally, it is made by him, with the game being won. As Edward is mobbed by the crowd going wild, Don Price is the only teammate who doesn’t mob Edward. A dog is carried out of a burning house by Edward, and a flash occurs. Pissed, crappy lima bean plants are thrown by Don Price in the trash. As two farmers shake their heads, a massive hole is shown punched through the side of a barn, roughly the shape of a man, but that size couldn't belong to any human. The full stranger still hasn't been seen by us. A mob of about 50 has gathered, many of them with shotguns, and amid the crowd, Don Price is seen. The crowd agrees, and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price glowers as the last bit of the steep hillside is climbed by Edward, reaching the mouth of a cave. Outside, the remains of the giant's feast are squabbled over by buzzards: broken barrels, bones picked clean. In his most serious voice, a call is made by Edward. From deep in a cave, a thunderous voice comes, and Edward's hair is blown back by the force of the giant's voice. A beat passes, then a rumble is heard, like a train coming. Edward braces himself, fists ready for a fight if that's what it's going to take. As the rumble gets louder, the ground starts to shake, and just how big this guy is is wondered by Edward. A stone is picked up by Edward, ready to play David to Goliath. Karl the giant is bigger than any man you've ever seen, completely feral, with a beard to his elbow and skin scratched and blistered. What remains of his clothes are ragged and muddy. The sun is blocked by Karl as he leans over Edward. A rock is thrown by Edward, but it just bounces off. The best response is pondered by Edward, settling on closing his eyes, hands at his side, ready to be eaten. Karl just stares at him, not sure what to do. After a beat, Edward opens his eyes a tiny bit, just to see what the giant is doing, and relief is felt as he sees he's not licking his chops. With a boom, Karl sits down, dejected. Reaching up, Karl's mouth is shoved into by Edward's hand, but it is spit back out by the giant. And that's the sad truth. Karl is less a monster than a freak—a giant man, but in the end, just a man. Edward takes a seat beside him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Football hero Edward leads his team to victory. On the sidelines, a pretty girl reveals her secret love, and the other girls agree. Don Price glowers. Edward makes an impossible buzzer shot from the other end of the court, winning the game. As the crowd cheers, Don is the only teammate who doesn't celebrate with Edward. Edward rescues a dog from a burning house, and Don angrily throws his lima bean plants away. Two farmers shake their heads at a massive hole in a barn, shaped like a man, but impossibly large. A mob of about 50, including Don, gathers with shotguns. The crowd parts to reveal Edward Bloom. Don glowers as Edward climbs a steep hillside to a cave. Outside, buzzards pick at the remains of the giant's feast. Edward calls out seriously, and a thunderous voice from the cave blows his hair back. As a rumble grows louder, Edward braces for a fight, wondering how big the giant is. He picks up a stone, ready to play David to Goliath. Karl the giant, larger than any man, is feral, with a long beard and ragged clothes. Karl leans over Edward, blocking the sun. Edward's rock bounces off Karl, who just stares, unsure. Edward closes his eyes, ready to be eaten, but Karl sits down, dejected. Edward shoves his hand into Karl's mouth, but the giant spits it out. Karl is less a monster than a freak—a giant man, but just a man. Edward sits beside him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Football hero Edward leads his team to victory. On the sidelines, a girl reveals her secret love, and others agree. Don Price glowers. Edward makes an impossible buzzer shot, winning the game. The crowd cheers, but Don doesn't join. Edward rescues a dog from a fire, and Don angrily discards his lima bean plants. Two farmers see a massive hole in a barn, shaped like a giant man. A mob gathers, including Don, and they reveal Edward Bloom. Don glowers as Edward climbs a hillside to a cave. Outside, buzzards pick at remains. Edward calls out, and a thunderous voice responds, shaking the ground. Edward prepares to fight, wondering about the giant's size. Karl the giant, feral and ragged, appears. Edward's rock bounces off Karl, who just stares. Edward closes his eyes, ready to be eaten, but Karl sits dejectedly. Edward shoves his hand into Karl's mouth, but Karl spits it out. Karl is more a giant man than a monster. Edward sits beside him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Football hero Edward, a celebrated figure on the field, leads his team to a triumphant victory. On the sidelines, a pretty girl, caught up in the excitement, confesses the name of her secret love, and the other girls around her squeal in agreement, sharing in her enthusiasm. Meanwhile, Don Price, standing nearby, looks over and glowers with discontent. In a dramatic moment, Edward takes an impossible shot at the buzzer from the far end of the court and, as expected, makes it, securing the win for his team. As the crowd erupts in wild cheers for Edward, Don Price stands out as the only teammate who doesn't rush to celebrate with him.\n\nIn another scene, Edward heroically carries a dog out of a burning house, and a flash occurs, capturing the moment. Frustrated, Don Price angrily throws his disappointing lima bean plants into the trash. Observing this, two farmers shake their heads in disapproval. The scene shifts to reveal a massive hole punched through the side of a barn, roughly shaped like a man, yet impossibly large for any human. The full identity of the stranger remains a mystery. A mob of about 50 people has gathered, many armed with shotguns, and among them is Don Price. There is a murmur of agreement from the crowd, and then everyone turns to see who spoke. The crowd parts to reveal none other than Edward Bloom himself. Don Price glowers as Edward climbs the last stretch of the steep hillside, reaching the entrance of a cave.\n\nOutside the cave, buzzards squabble over the remains of the giant's feast: broken barrels and bones picked clean. In his most serious voice, Edward calls out into the cave. From deep within, a thunderous voice responds, its force so powerful that it blows Edward's hair back. A moment passes, then a rumble is heard, like a train approaching. Edward braces himself, fists ready for a fight if that's what it will take. As the rumble grows louder, the ground begins to shake, and Edward wonders just how enormous this guy must be. Edward picks up a stone, preparing to play David to this Goliath.\n\nKarl the giant emerges, larger than any man you've ever seen, completely feral, with a beard reaching down to his elbow and skin that is scratched and blistered. What remains of his clothes are ragged and muddy. Karl leans over Edward, blocking out the sun with his massive frame. Edward throws his rock, but it merely bounces off harmlessly. Edward contemplates the best course of action, ultimately deciding to close his eyes, hands at his side, ready to be eaten if it comes to that. Karl just stares at him, unsure of what to do next. After a moment, Edward opens his eyes just a tiny bit, curious to see what the giant is doing, and is relieved to find that Karl is not licking his chops. Karl sits down with a resounding boom, looking dejected. Reaching up, Edward boldly shoves his hand into Karl's mouth, but the giant spits it back out. And that's the sad truth. Karl is less a monster than a freak—a giant man, but in the end, just a man. Edward takes a seat beside him, sharing in the moment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Renowned football hero Edward, a distinguished and celebrated figure on the field, confidently leads his team to a triumphant and exhilarating victory. On the sidelines of this thrilling event, a pretty girl, swept up in the rush of excitement, boldly confesses the name of her secret love, and the other girls surrounding her squeal in unison, sharing in her enthusiastic revelation. Meanwhile, standing nearby, Don Price glances over and, with a dark expression, glowers with evident discontent. In a dramatic and heart-stopping moment, Edward executes an impossible shot right at the buzzer from the extremely far end of the court and, as anticipated, makes it, thereby securing the win for his team. As the crowd erupts into wild, deafening cheers for their hero Edward, Don Price noticeably stands apart, the only teammate who does not rush forward to join in the celebration with him.\n\nIn a completely different scene, Edward heroically carries a bewildered dog from the flames of a burning house, and a flash captures the entire moment. Frustrated and irritated, Don Price angrily throws his disappointing lima bean plants into the trash bin. Observing this, two nearby farmers shake their heads in disapproval and disbelief. The scene shifts dramatically to reveal a massive, gaping hole punched through the side of a barn, shaped roughly like a man, yet impossibly large for any human being. The full identity of the mysterious stranger remains an unanswered question. A sizable mob of approximately 50 individuals has gathered, with many armed with shotguns, and among this crowd is Don Price. There is a collective murmur of agreement resonating from the crowd, and then everyone turns as one to see who just spoke. The crowd parts to reveal none other than Edward Bloom himself. Don Price glowers intensely as Edward climbs the final stretch of the steep, challenging hillside, finally reaching the ominous entrance of a cave.\n\nOutside the dark cave, buzzards noisily squabble over the remnants of the giant's feast: broken barrels and bones picked clean. In his most serious and commanding voice, Edward calls out into the depths of the cave. From deep within, a thunderous voice responds, its sheer force so overwhelming that it blows Edward's hair back. A moment passes, filled with tension, then a rumble is heard, like the sound of an approaching train. Edward braces himself, fists clenched and ready for a fight if that's what it will take. As the rumble grows louder, more intense, the ground begins to shake violently, and Edward wonders just how unbelievably enormous this opponent must be. Edward picks up a stone, mentally preparing himself to play David to this formidable Goliath.\n\nKarl the giant emerges, larger than any man you have ever laid eyes upon, completely feral, with a wild beard reaching down to his elbow and skin that is scratched and blistered. What remains of his clothing is ragged and muddy. Karl leans ominously over Edward, completely blocking out the sun with his massive frame. Edward throws his rock with force, but it merely bounces off harmlessly. Edward takes a moment to contemplate the best course of action, ultimately deciding to close his eyes, hands resting at his side, ready to be eaten if that is indeed his fate. Karl simply stares at him, unsure of what action to take next. After a moment of tense anticipation, Edward opens his eyes just a tiny bit, curious and anxious to see what the giant is doing, and is relieved beyond measure to find that Karl is not licking his chops. Karl sits down with a resounding and thunderous boom, looking utterly dejected. Reaching up with determination, Edward boldly shoves his hand into Karl's mouth, but the giant spits it back out immediately. And that's the sad truth revealed. Karl is less a fearsome monster than a misunderstood freak—a giant man, yet in the end, just a man. Edward takes a seat beside him, sharing quietly in the poignant moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Football hero Edward leads his team to victory by first positioning himself strategically on the court, maintaining focus and determination as the game progresses. On the sidelines, a pretty girl, caught up in the excitement of the moment, confides the name of her secret love to her friends, who respond with squeals of agreement, their voices rising above the noise of the game. Don Price, standing nearby, overhears the commotion and turns his head to look over, his expression darkening into a glower as he processes the information. Meanwhile, Edward, with unwavering confidence, takes an impossible shot at the buzzer from the other end of the court, his eyes fixed on the basket as the ball arcs through the air. The ball swishes through the net, securing the win for his team, and the crowd erupts into wild cheers, celebrating Edward's incredible feat. Amidst the jubilant chaos, Don Price remains the only teammate who doesn't rush to join the mob surrounding Edward, his resentment simmering beneath the surface. In a different scene, Edward heroically carries a dog out of a burning house, his movements swift and purposeful, and a flash occurs, capturing the moment. Frustrated and angry, Don Price throws his disappointing lima bean plants into the trash, his actions fueled by a sense of inadequacy. As two farmers observe the scene, they shake their heads in disbelief, and the perspective shifts to reveal a massive hole punched through the side of a barn, its shape roughly resembling a man, yet impossibly large for any human. The full identity of the stranger remains a mystery. A mob of about 50 people has gathered, many armed with shotguns, their faces tense with anticipation, and among them stands Don Price. A voice from the crowd expresses agreement, prompting everyone to turn and see who spoke. The crowd parts, revealing none other than Edward Bloom, who stands confidently before them. Don Price glowers once more as Edward climbs the last bit of the steep hillside, his steps deliberate and steady, until he reaches the mouth of a cave. Outside, buzzards squabble over the remains of the giant's feast, which consists of broken barrels and bones picked clean. In his most serious voice, Edward calls out into the cave, his words echoing in the cavernous space. From deep within, a thunderous voice responds, its force so powerful that it blows Edward's hair back. A moment passes, and then a rumble begins, reminiscent of a train approaching, growing louder with each passing second. Edward braces himself, his fists clenched and ready for a fight if necessary, as the ground beneath him starts to shake. He wonders just how big this giant could be, his mind racing with possibilities. In preparation, Edward picks up a stone, ready to play the role of David against Goliath. Karl the giant emerges, larger than any man Edward has ever seen, his appearance wild and untamed, with a beard reaching his elbow and skin marred by scratches and blisters. His clothes are tattered and muddy, remnants of a once more civilized existence. Karl leans over Edward, his massive form blocking out the sun, casting a shadow over the smaller man. Edward throws his rock with all his might, but it merely bounces off Karl, ineffective against the giant's size. Edward pauses to consider his next move, ultimately deciding to close his eyes, his hands resting at his sides, ready to accept whatever fate awaits him. Karl, unsure of what to do, simply stares at Edward, his expression one of confusion rather than aggression. After a moment, Edward cautiously opens his eyes a tiny bit, peeking to see what the giant is doing, and feels a wave of relief upon realizing that Karl is not preparing to devour him. Instead, Karl sits down with a resounding boom, his demeanor dejected and weary. In a surprising gesture, Edward reaches up and shoves his hand into Karl's mouth, testing the giant's intentions, but Karl merely spits it back out, uninterested in causing harm. This interaction reveals the sad truth: Karl is less a monster than a misunderstood giant, a man of extraordinary size but still just a man at heart. Recognizing this, Edward takes a seat beside him, offering companionship and understanding."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Football hero Edward leads his team to victory with a remarkable buzzer-beater shot from the other end of the court, while the crowd erupts in celebration. On the sidelines, a group of girls, including one who admits her secret love, squeal in agreement, drawing a glower from Don Price, the only teammate not joining the celebration. Later, Edward heroically rescues a dog from a burning house, prompting Don Price to angrily discard his failed lima bean plants. Meanwhile, two farmers observe a massive, man-shaped hole in a barn, hinting at the presence of a giant. A crowd of about 50, including Don Price, gathers with shotguns, and they turn to see Edward Bloom among them. Edward climbs a steep hillside to a cave's entrance, where buzzards pick at the remains of the giant's feast. He calls out seriously, and a thunderous voice responds, shaking the ground. Edward braces for a confrontation, picking up a stone to face the giant. Karl, the giant, emerges, towering over Edward with a feral appearance. Edward's thrown rock bounces off harmlessly, and he closes his eyes, preparing for the worst. However, Karl simply stares, unsure of his next move. Edward cautiously opens his eyes, relieved to see Karl isn't threatening. Dejected, Karl sits down, and Edward, realizing Karl is more misunderstood than monstrous, sits beside him, acknowledging the giant's humanity."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Football hero Edward leads his team to victory in a tense championship game. On the sidelines, a pretty girl from the cheerleading squad admits the name of her secret love, a confession that has been a topic of gossip for weeks, and the other girls squeal in agreement, their enthusiasm echoing the excitement of the win. Don Price, known for his intense competitiveness, looks over and glowers, feeling overshadowed. Edward takes an impossible shot at the buzzer from the other end of the court, a feat reminiscent of legendary basketball moments, and, naturally, makes it, securing the game in an unforgettable finish. As the crowd goes wild for Edward, celebrating his latest sports triumph, Don Price is the only teammate who doesn't mob him, his jealousy palpable.\n\nEdward carries a dog out of a burning house, an act of bravery that echoes his heroics on the field, and a flash occurs as a local photographer captures the moment for the town newspaper. Pissed, Don Price throws his crappy lima bean plants, part of his failed attempt at horticulture, in the trash. As two farmers, who have witnessed many odd occurrences in their rural community, shake their heads, we reverse to show a massive hole punched through the side of a historic barn, roughly the shape of a man, but no human could be that large, hinting at the presence of something extraordinary. We still haven't seen the full stranger.\n\nA mob of about 50 have gathered, many of them armed with shotguns as if preparing for a monster hunt, and amid the crowd, we see Don Price, his face set with determination. There is agreement from the crowd, no doubt reflecting the town's collective frustration and fear, and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom, a local legend known for his boldness. Don Price glowers as Edward climbs up the last bit of the steep hillside, which is treacherous and rarely traversed, reaching the mouth of a cave rumored to be the lair of a giant. Outside, buzzards, nature's scavengers, squabble over the remains of the giant's feast: broken barrels and bones picked clean from meals that fueled terrifying tales.\n\nIn his most serious voice, Edward calls out, his tone steady despite the daunting task ahead. From deep in a cave comes a thunderous voice, resonating like an amplified echo, and the giant's voice has such force that it blows Edward's hair back. A beat passes, then we hear a rumble, much like a freight train passing through, signaling the approach of something formidable. Edward braces himself, fists ready for a fight if that's what it's going to take, setting the stage for a classic confrontation.\n\nAs the rumble gets louder, the ground starts to shake, and Edward wonders just how big this guy is, his mind racing with comparisons to mythical giants. Edward picks up a stone, ready to play David to Goliath, a strategy drawn from the biblical story of overcoming insurmountable odds. Karl the giant is bigger than any man you've ever seen, completely feral, with a beard to his elbow and skin scratched and blistered from years of living in the wild. What remains of his clothes are ragged and muddy, speaking to the hardships he's endured. Karl leans over Edward, blocking the sun with his immense frame.\n\nEdward throws his rock, but it just bounces off harmlessly. Edward ponders the best response, settling on closing his eyes, hands at his side, ready to be eaten, echoing an act of surrender. Karl just stares at him, not sure what to do, the confusion revealing his gentle nature. After a beat, Edward opens his eyes a tiny bit, just to see what the giant is doing, and is relieved to see he's not licking his chops, indicating a lack of aggression. Karl sits down with a boom, dejected, the sound like thunder. Reaching up, Edward shoves his hand into Karl's mouth, but the giant spits it back out, showing a distaste for violence. And that's the sad truth. Karl is less a monster than a freak of nature— a giant man, but in the end, just a man misunderstood. Edward takes a seat beside him, beginning a friendship that challenges the town's fear."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Football hero Edward leads his team to victory  Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game  As the crowd goes wild for Edward Don Price is the only teammate who doesn't mob him  Edward carries a dog out of a burning house and a flash occurs  Pissed Don Price throws his crappy lima bean plants in the trash  As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large  We still haven't seen the full stranger  A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price  There is agreement from the crowd and then everyone turns to see who said that  The crowd parts to reveal none other than Edward Bloom  Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave  Outside buzzards squabble over the remains of the giant's feast  broken barrels bones picked clean  In his most serious voice Edward calls out  From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back  A beat passes  then we hear a rumble like a train coming  Edward braces himself fists ready for a fight if that's what it's going to take  As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is  On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement  Don Price looks over and glowers  Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game  As the crowd goes wild for Edward Don Price is the only teammate who doesn't mob him  Edward carries a dog out of a burning house and a flash occurs  Pissed Don Price throws his crappy lima bean plants in the trash  As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large  We still haven't seen the full stranger  A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price  There is agreement from the crowd and then everyone turns to see who said that  The crowd parts to reveal none other than Edward Bloom  Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave  Outside buzzards squabble over the remains of the giant's feast  broken barrels bones picked clean  In his most serious voice Edward calls out  From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back  A beat passes  then we hear a rumble like a train coming  Edward braces himself fists ready for a fight if that's what it's going to take  As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is  Edward picks up a stone ready to play  David to Goliath  Karl the giant is bigger than any man you've ever seen completely feral with a beard to his elbow and skin scratched and blistered  What remains of his clothes are ragged and muddy  Karl leans over Edward blocking the sun  Edward throws his rock but it just bounces off  Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten  Karl just stares at him not sure what to do  After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he's not licking his chops  Karl sits down with a boom dejected  Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out  And that's the sad truth  Karl is less a monster than a freak—a giant man but in the end just a man  Edward takes a seat beside him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Football hero Edward leads his team to victory. On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement. Don Price looks over and glowers. Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game. As the crowd goes wild for Edward Don Price is the only teammate who does not mob him. Edward carries a dog out of a burning house and a flash occurs. Pissed Don Price throws his crappy lima bean plants in the trash. As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large. We still have not seen the full stranger. A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price. There is agreement from the crowd and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave. Outside buzzards squabble over the remains of the giant's feast. broken barrels bones picked clean. In his most serious voice Edward calls out. From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. A beat passes. then we hear a rumble like a train coming. Edward braces himself fists ready for a fight if that is what it is going to take. As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is. Edward picks up a stone ready to play. David to Goliath. Karl the giant is bigger than any man you have ever seen completely feral with a beard to his elbow and skin scratched and blistered. What remains of his clothes are ragged and muddy. Karl leans over Edward blocking the sun. Edward throws his rock but it just bounces off. Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten. Karl just stares at him not sure what to do. After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he is not licking his chops. Karl sits down with a boom dejected. Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out. And that is the sad truth. Karl is less a monster than a freak—a giant man but in the end just a man. Edward takes a seat beside him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Football hero Edward leads his team to victory. On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement. Don Price looks over and glowers. Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game. As the crowd goes wild for Edward Don Price is the only teammate who does not mob him. Edward carries a dog out of a burning house and a flash occurs. Pissed Don Price throws his crappy lima bean plants in the trash. As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large. We still have not seen the full stranger. A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price. There is agreement from the crowd and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave. Outside buzzards squabble over the remains of the giant's feast. broken barrels bones picked clean. In his most serious voice Edward calls out. From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. A beat passes. then we hear a rumble like a train coming. Edward braces himself fists ready for a fight if that is what it is going to take. As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is. Edward picks up a stone ready to play. David to Goliath. Karl the giant is bigger than any man you have ever seen completely feral with a beard to his elbow and skin scratched and blistered. What remains of his clothes are ragged and muddy. Karl leans over Edward blocking the sun. Edward throws his rock but it just bounces off. Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten. Karl just stares at him not sure what to do. After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he is not licking his chops. Karl sits down with a boom dejected. Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out. And that is the sad truth. Karl is less a monster than a freak—a giant man but in the end just a man. Edward takes a seat beside him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Football hero Edward leads his team to victory. On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement. Don Price looks over and glowers. Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game. As the crowd goes wild for Edward Don Price is the only teammate who does not mob him. Edward carries a dog out of a burning house and a flash occurs. Pissed Don Price throws his crappy lima bean plants in the trash. As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large. We still have not seen the full stranger. Edward throws his rock but it just bounces off. Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten. Karl just stares at him not sure what to do. After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he is not licking his chops. Karl sits down with a boom dejected. Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out. And that is the sad truth. Karl is less a monster than a freak—a giant man but in the end just a man. Edward takes a seat beside him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Football hero Edward leads his team to victory. On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement. Don Price looks over and glowers. Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out. And that is the sad truth. Karl is less a monster than a freak—a giant man but in the end just a man. Edward takes a seat beside him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Soccer legend Carl leads the orchestra to victory. On the sidelines, an elephant admits the name of her secret love, and the dolphins squeal in agreement. Lucy Green looks over and glowers. Carl takes an impossible shot at the buzzer from the other end of the court and, naturally, makes it, winning the game. As the crowd goes wild for Carl, Lucy Green is the only teammate who doesn't mob him. Carl carries a parrot out of a burning house, and a flash occurs. Pissed, Lucy Green throws her crappy lima bean plants in the trash. As two astronauts shake their heads, we reverse to show a massive hole punched through the side of a barn, roughly the shape of a kangaroo, but no kangaroo could be that large. We still haven't seen the full stranger. A mob of about 50 have gathered, many of them with umbrellas, and amid the crowd, we see Lucy Green. There is agreement from the crowd, and then everyone turns to see who said that. The crowd parts to reveal none other than Carl Smith. Lucy Green glowers as Carl climbs up the last bit of the steep hillside, reaching the mouth of a cave. Outside, roosters squabble over the remains of the giant's feast: broken barrels, bones picked clean. In his most serious voice, Carl calls out. From deep in a cave comes a thunderous voice, and the giant's voice has such force that it blows Carl’s hair back. A beat passes, then we hear a rumble, like a train coming. Carl braces himself, fists ready for a fight if that's what it's going to take. As the rumble gets louder, the ground starts to shake, and Carl wonders just how big this guy is. Carl picks up a shovel, ready to play David to Goliath. Mona the giant is bigger than any man you've ever seen, completely feral, with a beard to her elbow and skin scratched and blistered. What remains of her clothes are ragged and muddy. Mona leans over Carl, blocking the sun. Carl throws his shovel, but it just bounces off. Carl ponders the best response, settling on closing his eyes, hands at his side, ready to be eaten. Mona just stares at him, not sure what to do. After a beat, Carl opens his eyes a tiny bit, just to see what the giant is doing, and is relieved to see she's not licking her chops. Mona sits down with a boom, dejected. Reaching up, Carl shoves his hand into Mona's mouth, but the giant spits it back out. And that's the sad truth. Mona is less a monster than a freak—a giant woman, but in the end, just a woman. Carl takes a seat beside her."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Football hero Edward leads his team to victory. On the sidelines, a pretty girl admits the name of her secret love, and the other girls squeal in agreement. Don Price looks over and glowers. Edward takes an impossible shot at the buzzer from the other end of the field and, naturally, makes it, winning the match. As the crowd goes wild for Edward, Don Price is the only teammate who doesn't mob him. Edward carries a cat out of a burning shed, and a flash occurs. Pissed, Don Price throws his crappy pumpkin plants in the trash. As two gardeners shake their heads, we reverse to show a massive hole punched through the side of a greenhouse, roughly the shape of a man, but no human could be that large. We still haven't seen the full stranger. A mob of about 50 have gathered, many of them with pitchforks, and amid the crowd, we see Don Price. There is agreement from the crowd, and then everyone turns to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price glowers as Edward climbs up the last bit of the steep hillside, reaching the mouth of a cavern. Outside, vultures squabble over the remains of the giant's feast: broken crates, bones picked clean. In his most serious voice, Edward calls out. From deep in a cavern comes a thunderous voice, and the giant's voice has such force that it blows Edward's hair back. A beat passes, then we hear a rumble, like a waterfall approaching. Edward braces himself, fists ready for a confrontation if that's what it's going to take. As the rumble gets louder, the ground starts to shake, and Edward wonders just how big this guy is. Edward picks up a pebble, ready to play David to Goliath. Karl the giant is bigger than any man you've ever seen, completely feral, with a beard to his shoulder and skin scratched and blistered. What remains of his clothes are torn and muddy. Karl leans over Edward, blocking the moon. Edward throws his pebble, but it just bounces off. Edward ponders the best response, settling on closing his eyes, hands at his side, ready to be eaten. Karl just stares at him, not sure what to do. After a beat, Edward opens his eyes a tiny bit, just to see what the giant is doing, and is relieved to see he's not licking his lips. Karl sits down with a thud, dejected. Reaching up, Edward shoves his hand into Karl's satchel, but the giant spits it back out. And that's the sad truth. Karl is less a monster than a freak—a giant man, but in the end, just a man. Edward takes a position beside him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Football hero Edward inspires his team to triumph. On the sidelines, a pretty girl reveals the name of her secret love, and the other girls cheer in support. Don Price looks over and frowns. Edward attempts an improbable dance move at the buzzer from the other end of the court and, astonishingly, nails it, winning the game. As the crowd celebrates Edward, Don Price is the only teammate who doesn't applaud him. Edward fetches a dog from a burning house, and a camera flashes. Annoyed, Don Price kicks his worthless lima bean plants across the yard. As two farmers shake their fists, we pan to show a massive mural painted on the side of a barn, roughly the shape of a man, but no human could be that artistic. We still haven't seen the full stranger. A group of about 50 have gathered, many of them with binoculars, and amid the crowd, we see Don Price. There is consensus from the crowd, and then everyone glances to see who said that. The crowd parts to reveal none other than Edward Bloom. Don Price frowns as Edward trudges up the last bit of the steep hillside, approaching the mouth of a cave. Outside, buzzards argue over the remains of the giant's meal: shattered barrels, bones arranged neatly. In his most serious voice, Edward jokes. From deep in a cave comes a melodious voice, and the giant's voice has such charm that it makes Edward laugh. A beat passes, then we hear a whisper, like a breeze passing. Edward steadies himself, fists clenched for a dance if that's what it's going to take. As the whisper gets closer, the ground starts to sway, and Edward wonders just how graceful this guy is. Edward lifts a feather, ready to play host to a giant. Karl the giant is bigger than any man you've ever dreamed, completely gentle, with a beard to his knee and skin washed and polished. What remains of his clothes are bright and colorful. Karl leans over Edward, shading the sun. Edward tosses his feather, but it just floats down. Edward reflects on the best tactic, deciding on opening his arms, hands outstretched, ready to embrace. Karl just gazes at him, unsure what to do. After a beat, Edward opens his eyes wide, just to see what the giant is thinking, and is relieved to see he's not baring his teeth. Karl lies down with a thud, resigned. Reaching over, Edward pats Karl on the back, but the giant shrugs it off. And that's the sad truth. Karl is less a beast than a gentle giant—a towering figure, but in the end, just a being. Edward reclines beside him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Basketball champion Amelia guides her orchestra to triumph. On the beach, an agile cat reveals the identity of its secret fear, and the other dogs bark in affirmation. Nora Smith peers over and frowns. Amelia attempts an improbable leap at the finale from the other end of the garden and, predictably, lands it, winning the contest. As the waves crash wildly for Amelia, Nora Smith is the only musician who doesn't hug it. Amelia rescues a parrot out of a melting igloo, and a spark appears. Upset, Nora Smith flings her wilted cabbage patches in the bin. As two bakers scratch their chins, we pan back to show a gigantic silhouette smashed through the side of a mansion, vaguely the shape of a unicorn, but no creature could be that enormous. We still haven't seen the entire visitor. A cluster of about 50 has assembled, many of them with buckets, and amidst the assembly, we see Nora Smith. There is consensus from the assembly, and then all pivot to spot who made that remark. The assembly parts to unveil none other than Amelia Pond. Nora Smith frowns as Amelia scrambles up the last portion of the rugged cliffside, reaching the entrance of a tunnel. Outside, turtles wrestle over the leftovers of the dragon's banquet: cracked urns, skeletons stripped bare. In her most solemn tone, Amelia calls out. From deep in a cavern arises a booming sound, and the dragon's tone has such impact that it blows Amelia's fur back. A pause follows, then we catch a murmur, like a river flowing. Amelia steadies herself, hands poised for combat if that's what it's going to require. As the murmur grows intense, the earth starts to quiver, and Amelia wonders just how vast this thing is. Amelia picks up a twig, ready to act as the ant to the elephant. Ralph the dragon is larger than any beast you've ever envisioned, utterly wild, with a mane to its ankle and scales cracked and weathered. What remains of its armor are torn and grimy. Ralph looms over Amelia, eclipsing the stars. Amelia hurls her twig, but it merely ricochets off. Amelia considers the ideal reaction, choosing to close her eyes, arms relaxed, ready to be devoured. Ralph merely gazes at it, uncertain of how to proceed. After a pause, Amelia peeks through its eyes slightly, just to perceive what the dragon is doing, and is comforted to notice it's not drooling. Ralph settles down with a thud, despondent. Stretching out, Amelia inserts its nose into Ralph's snout, but the dragon sneezes it back out. And that's the bleak reality. Ralph is less a creature than an oddity—a giant beast, yet ultimately, just a creature. Amelia reclines beside it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Basketball legend Monica directs her orchestra to success. On the sidelines, an old man reveals the title of his hidden invention, and the other inventors cheer in support. Sarah Jones glances over and sulks. Monica attempts an improbable dive from the high board and, surprisingly, nails it, winning the competition. As the audience cheers wildly for Monica, Sarah Jones is the only violinist who doesn't applaud. Monica rescues a cat from a flooding basement, and a camera flashes. Annoyed, Sarah Jones flings her withered cilantro plants in the compost. As two bakers shrug, we cut to show a gigantic footprint stamped into the side of a hill, roughly the shape of a bear, but no creature could be that enormous. We still haven't gotten a full view of the unseen shadow. A group of 50 have assembled, many of them with binoculars, and among the crowd, we spot Sarah Jones. There is consensus from the group, and then everyone turns to see who spoke. The group opens to reveal none other than Monica Rivers. Sarah Jones sulks as Monica scales the last stretch of the jagged mountain, reaching the entrance of a cavern. Outside, vultures argue over the scraps of the giant's banquet: shattered crates, remnants scraped clean. In her most commanding tone, Monica cries out. From deep within the cavern comes a booming echo, and the giant's voice is so powerful that it tosses Monica's hair backward. A moment passes, then we hear a growl, like a bear approaching. Monica steadies herself, hands ready for a duel if that's what it will require. As the growl intensifies, the ground begins to tremble, and Monica wonders just how massive this creature is. Monica picks up a stick, ready to confront her challenge. Felix the giant is larger than any animal you've ever encountered, completely wild, with a mane to his chest and fur matted and scarred. What remains of his fur is tattered and filthy. Felix leans over Monica, obscuring the moonlight. Monica hurls her stick, but it simply deflects off. Monica contemplates the best move, deciding to sit down, hands on her knees, prepared to be devoured. Felix merely gazes at her, uncertain of the next step. After a pause, Monica cracks her eyes open slightly, just to gauge the giant's actions, and is relieved to see he's not drooling. Felix plops down with a thud, disheartened. Reaching down, Monica places her foot into Felix's paw, but the giant flicks it back. And that's the harsh truth. Felix is less a predator than an anomaly—a colossal beast, but ultimately, just a beast. Monica settles down beside him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Soccer champion Edward guides his crew to triumph. On the sidelines, a charming boy reveals the title of his hidden crush, and the other boys howl in consensus. Don Price glances over and mumbles. Edward swings an improbable kick at the whistle from the opposite side of the field and, predictably, nails it, clinching the match. As the audience erupts in cheers for Edward, Don Price is the sole player who doesn't swarm him. Edward hoists a cat out of a flooded basement, and a burst flashes. Annoyed, Don Price hurls his wilted carrot plants in the compost. As two bakers nod their chins, we pivot to display a colossal crater punched through the side of a silo, vaguely the form of a man, but no human could be that immense. We still haven't witnessed the complete stranger. A cluster of roughly 50 have assembled, many of them with pitchforks, and amidst the throng, we notice Don Price. There is concurrence from the assembly, and then everybody turns to see who spoke that. The crowd disperses to unveil none other than Edward Bloom. Don Price mutters as Edward pulls himself up the remaining section of the steep cliffside, arriving at the entrance of a cavern. Outside, crows tussle over the remnants of the gargantuan's banquet: shattered crates, corncobs stripped bare. In his most earnest tone, Edward shouts. From deep within a cavern comes a booming echo, and the giant's voice has such potency that it pushes Edward's hat off. A moment passes, then we perceive a murmur, like a train arriving. Edward steadies himself, palms ready for a grapple if that's what it's going to require. As the murmur intensifies, the earth begins to quiver, and Edward ponders just how massive this fellow is. Edward lifts a pebble, prepared to play Tom to Goliath. Karl the giant is larger than any person you've ever encountered, utterly untamed, with a mane to his forearm and skin marked and burnt. What remains of his attire are tattered and grimy. Karl hunches over Edward, overshadowing the stars. Edward hurls his pebble, but it merely rebounds. Edward contemplates the wisest retort, deciding on closing his eyes, arms at his side, ready to be swallowed. Karl just observes him, uncertain of his next move. After a pause, Edward peeks open his eyes a fraction, just to glimpse the giant's actions, and is soothed to see he's not sharpening his teeth. Karl plops down with a thud, dispirited. Reaching up, Edward pokes his fingers into Karl's ear, but the giant shakes it back out. And that's the grim reality. Karl is less a beast than a curiosity—a tremendous man, but ultimately, just a man. Edward settles down beside him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Soccer legend Marvin guides his flock to defeat. On the periphery, a charming lady confesses the location of her hidden treasure, and the other women bark in agreement. Hank Johnson glances over and sighs. Marvin hurls an easy toss at the chime from the opposite side of the field and, unexpectedly, misses it, losing the match. As the audience clamors for Marvin, Hank Johnson is the lone ally who doesn't ignore him. Marvin drags a cat out of a sinking ship, and a spark happens. Angry, Hank Johnson tosses his broken turnip sculptures in the river. As two chefs nod their shoulders, we pan to reveal a tiny crack etched on the roof of a cottage, roughly the size of a giraffe, but no creature could be that long. We remain oblivious to the complete newcomer. A group of about 10 has dispersed, none of them with guitars, and throughout the swarm, we spot Hank Johnson. There is disagreement from the swarm, and then everyone twists to ignore who whispered that. The swarm clumps to uncover none other than Marvin Lake. Hank Johnson sighs as Marvin slides up the first bit of the flat plain, leaving the nose of a mountain. Inside, pigeons chuckle over the leftovers of the gnome's picnic: intact crates, feathers plucked fresh. In his most casual voice, Marvin beckons. From shallow in a mountain comes a quiet whisper, and the gnome’s whisper has such vigor that it tickles Marvin's ear. Silence passes, then we notice a breeze, like a breeze approaching. Marvin steels himself, hands open for a handshake if that's what it's going to involve. As the breeze gets quieter, the air ceases to shiver, and Marvin doubts just how tall this figure is. Marvin picks up a feather, ready to play Achilles to Hercules. Bob the gnome is smaller than any giraffe you've ever spotted, partially domestic, with a beard to his wrist and fur fanned and polished. What rests of his boots are neat and shiny. Bob glares past Marvin, revealing the moon. Marvin drops his feather, but it just floats away. Marvin considers the worst reply, deciding on opening his mouth, feet in the air, ready to be tickled. Bob just glares at him, unsure what to try. After a moment, Marvin shuts his mouth a little bit, just to glimpse what the gnome is watching, and feels anxious to spot he's not rubbing his belly. Bob stands with a whisper, encouraged. Reaching down, Marvin presses his foot into Bob's nose, but the gnome giggles it back up. And that's the happy illusion. Bob is more a legend than an idol—a tiny giraffe, but at the start, simply a giraffe. Marvin lays down beside him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Football hero Edward leads his team to victory with a last-second shot, but his teammate Don Price is not impressed. Edward then rescues a dog from a burning house, further frustrating Don, who throws away his lima bean plants. Meanwhile, a massive hole in a barn and a crowd of armed locals, including Don, gather, hinting at a giant. Edward climbs a steep hillside to confront the giant in a cave, encountering Karl, who is larger than any man, with a wild appearance. Despite his intimidating size, Karl is dejected and misunderstood. Edward initially prepares to fight but soon realizes Karl is not a threat. After an initially tense interaction, Edward sits with Karl, recognizing him as less a monster and more a misunderstood human."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Edward takes a seat beside him Karl is less a monster than a freak—a giant man but in the end just a man  And that's the sad truth  Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out  Karl sits down with a boom dejected  After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he's not licking his chops  Karl just stares at him not sure what to do  Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten  Edward throws his rock but it just bounces off  Karl leans over Edward blocking the sun  What remains of his clothes are ragged and muddy  Karl the giant is bigger than any man you've ever seen completely feral with a beard to his elbow and skin scratched and blistered  David to Goliath  Edward picks up a stone ready to play  As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is  Edward braces himself fists ready for a fight if that's what it's going to take  then we hear a rumble like a train coming  A beat passes  From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back  In his most serious voice Edward calls out  broken barrels bones picked clean  Outside buzzards squabble over the remains of the giant's feast  Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave  The crowd parts to reveal none other than Edward Bloom  There is agreement from the crowd and then everyone turns to see who said that  A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price  We still haven't seen the full stranger  As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large  Pissed Don Price throws his crappy lima bean plants in the trash  Edward carries a dog out of a burning house and a flash occurs  As the crowd goes wild for Edward Don Price is the only teammate who doesn't mob him  Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game  Don Price looks over and glowers  On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement  Football hero Edward leads his team to victory "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "What remains of his clothes are ragged and muddy  then we hear a rumble like a train coming  Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out  David to Goliath  There is agreement from the crowd and then everyone turns to see who said that  As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large  And that's the sad truth  Karl leans over Edward blocking the sun  As the crowd goes wild for Edward Don Price is the only teammate who doesn't mob him  Edward takes a seat beside him Football hero Edward leads his team to victory  Karl the giant is bigger than any man you've ever seen completely feral with a beard to his elbow and skin scratched and blistered  In his most serious voice Edward calls out  As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is  From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back  Edward throws his rock but it just bounces off  A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price  Karl is less a monster than a freak—a giant man but in the end just a man  Don Price looks over and glowers  Karl sits down with a boom dejected  After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he's not licking his chops  A beat passes  broken barrels bones picked clean  On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement  We still haven't seen the full stranger  Edward braces himself fists ready for a fight if that's what it's going to take  Karl just stares at him not sure what to do  Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten  The crowd parts to reveal none other than Edward Bloom  Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game  Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave  Edward carries a dog out of a burning house and a flash occurs  Pissed Don Price throws his crappy lima bean plants in the trash  Edward picks up a stone ready to play  Outside buzzards squabble over the remains of the giant's feast "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "then we hear a rumble like a train coming  Edward braces himself fists ready for a fight if that's what it's going to take  As the rumble gets louder the ground starts to shake and Edward wonders just how big this guy is  Edward picks up a stone ready to play  David to Goliath  Karl the giant is bigger than any man you've ever seen completely feral with a beard to his elbow and skin scratched and blistered  What remains of his clothes are ragged and muddy  Karl leans over Edward blocking the sun  Edward throws his rock but it just bounces off  Edward ponders the best response settling on closing his eyes hands at his side ready to be eaten  Karl just stares at him not sure what to do  After a beat Edward opens his eyes a tiny bit just to see what the giant is doing and is relieved to see he's not licking his chops  Karl sits down with a boom dejected  Reaching up Edward shoves his hand into Karl's mouth but the giant spits it back out  And that's the sad truth  Karl is less a monster than a freak—a giant man but in the end just a man  Edward takes a seat beside him Football hero Edward leads his team to victory  On the sidelines a pretty girl admits the name of her secret love and the other girls squeal in agreement  Don Price looks over and glowers  Edward takes an impossible shot at the buzzer from the other end of the court and naturally makes it winning the game  As the crowd goes wild for Edward Don Price is the only teammate who doesn't mob him  Edward carries a dog out of a burning house and a flash occurs  Pissed Don Price throws his crappy lima bean plants in the trash  As two farmers shake their heads we reverse to show a massive hole punched through the side of a barn roughly the shape of a man but no human could be that large  We still haven't seen the full stranger  A mob of about 50 have gathered many of them with shotguns and amid the crowd we see Don Price  There is agreement from the crowd and then everyone turns to see who said that  The crowd parts to reveal none other than Edward Bloom  Don Price glowers as Edward climbs up the last bit of the steep hillside reaching the mouth of a cave  Outside buzzards squabble over the remains of the giant's feast  broken barrels bones picked clean  In his most serious voice Edward calls out  From deep in a cave comes a thunderous voice and the giant's voice has such force that it blows Edward's hair back  A beat passes "
        }
      ]
    }
  ]
}