{
  "ground_truth": "Mrs. Robinson is sitting there, and Mr. Robinson exits. Ben and Elaine are then shot in Ben's car, seen from the back, as Ben pushes the car recklessly in and out of traffic, leaning on the horn. The car ahead does not move, so Ben swerves around it, jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance. Ben and Elaine sit at a table, with Elaine having her back to the stage, folding her hands and looking down, while their chairs are angled so Ben can look at the stage without looking directly at her. The stripper is reflected in Ben's glasses, down to a tasseled bra and g-string, twirling the tassels. Elaine turns to look at the stripper and then turns back. Elaine leans against a building, pulling her arm away as Ben, facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Onlookers on the sidewalk watch, prompting Elaine to turn away from them, and Ben moves in front of her. She brings her hands to her face, and Ben looks at her in agony before pulling her wrists away, leading her to look up startled before he kisses her. She closes her eyes as he frees her hands, which then move to his wrists. After a while, she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. Ben leans across Elaine, speaks to the kid behind the wheel, who turns the radio up. Ben and Elaine roll their windows up and talk animatedly while eating, with Elaine watching as Ben tells her a story.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mrs. Robinson remains seated there, and Mr. Robinson departs. Ben and Elaine are subsequently filmed in Ben's vehicle, observed from the rear, as Ben maneuvers the car carelessly in and out of traffic, pressing on the horn. The automobile ahead does not budge, so Ben veers around it, slamming his horn and giving the other motorist an irate glare as Elaine clings to the dashboard to maintain her equilibrium. Ben and Elaine sit at a table, with Elaine having her back to the platform, clasping her hands and gazing downward, while their chairs are positioned so Ben can observe the platform without gazing directly at her. The exotic dancer is mirrored in Ben's spectacles, down to a fringed brassiere and g-string, spinning the tassels. Elaine turns to view the exotic dancer and then turns back. Elaine leans against a structure, pulling her arm away as Ben, facing her, shifts from side to side, attempting to get her attention while she averts her gaze and begins to weep. Spectators on the pavement observe, prompting Elaine to turn away from them, and Ben moves in front of her. She brings her hands to her face, and Ben gazes at her in torment before pulling her wrists away, leading her to look up startled before he kisses her. She closes her eyes as he releases her hands, which then move to his wrists. After a moment, she pulls away and turns slightly as he gazes at her and she observes him intently. A pair of adolescents drive up next to them with a radio loudly playing rock and roll. Ben leans across Elaine, speaks to the youth behind the wheel, who turns the radio up. Ben and Elaine roll their windows up and converse animatedly while eating, with Elaine watching as Ben recounts her a story."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mrs. Robinson is sitting there, and Mr. Robinson exits. Ben and Elaine are then seen being shot in Ben's car from the back, as the car is pushed recklessly in and out of traffic by Ben, with the horn being leaned on by him. The car ahead is not moved, so Ben swerves around it, the horn is jammed by him, and an angry look is given to the other driver by him as Elaine holds onto the dashboard to keep her balance. A table is sat at by Ben and Elaine, with Elaine's back being to the stage, her hands are folded and she looks down, while their chairs are angled so the stage can be looked at by Ben without him looking directly at her. The stripper is reflected in Ben's glasses, down to a tasseled bra and g-string, with the tassels being twirled by her. Elaine turns to look at the stripper and then turns back. A building is leaned against by Elaine, who pulls her arm away as Ben, who is facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Onlookers on the sidewalk are watching, prompting her to turn away from them, and Elaine is moved in front of by Ben. Her hands are brought to her face, and she is looked at in agony by Ben before her wrists are pulled away by him, leading her to look up startled before he kisses her. Her eyes are closed by her as her hands are freed by him, which then move to his wrists. After a while, she pulls away and turns slightly as she is looked at by him and he is watched carefully by her. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. Ben leans across Elaine, speaks to the kid, and the radio is turned up by the kid behind the wheel. Their windows are rolled up by Ben and Elaine, and they talk animatedly while eating, with a story being told by Ben as Elaine watches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mrs. Robinson sits as Mr. Robinson exits. Ben and Elaine are then shown in Ben's car, from behind, as Ben weaves recklessly through traffic, leaning on the horn. When the car ahead stalls, Ben swerves around it, honking angrily while Elaine grips the dashboard. They sit at a table with Elaine facing away from the stage, hands folded, while Ben can see the performer without facing Elaine directly. The stripper reflects in Ben's glasses, twirling her tasseled attire. Elaine briefly looks at the stripper and then away. Elaine leans against a building, pulling away as Ben tries to catch her attention, and she starts crying. Onlookers watch, causing Elaine to turn away while Ben moves in front of her. She hides her face with her hands, and Ben, in anguish, pulls her hands down and kisses her. Her eyes close as her hands move to his wrists. Eventually, she pulls away, watching him carefully. Teenagers drive up, blaring rock music. Ben leans across Elaine, asks the driver to turn it up. Ben and Elaine roll their windows up, talk animatedly, and eat, with Elaine watching as Ben narrates a story."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mrs. Robinson sits as Mr. Robinson exits. Ben and Elaine are shot from behind in Ben's car; he drives recklessly, honking, swerving around a stopped car, glaring at the driver, while Elaine clings to the dashboard. At a table, Elaine faces away from the stage, hands folded, as Ben watches a stripper's reflection in his glasses. Elaine glances at the stripper, then looks away. Elaine leans against a building, pulling away as Ben tries to get her attention. Crying, she turns from onlookers; Ben faces her, looking pained, pulls her wrists down, kisses her, and she closes her eyes. A while later, she pulls away as they watch each other. Teenagers pull up with loud music; Ben leans across Elaine to speak to them. They roll up windows, talk animatedly while eating, and Elaine watches as Ben tells a story."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mrs. Robinson is quietly seated in her spot, while Mr. Robinson exits the scene. Subsequently, there is a shot featuring Ben and Elaine as they ride together in Ben's car, viewed from the back seat. In this shot, Ben is seen navigating the car with reckless abandon, aggressively weaving in and out of the bustling traffic while leaning heavily on the car's blaring horn. When the vehicle in front of them fails to move out of the way, Ben sharply swerves around it, pressing the car horn with urgency and casting an angry glare toward the other driver. Meanwhile, Elaine holds tightly onto the dashboard in an effort to maintain her balance amidst the chaos.\n\nBen and Elaine are later seen sitting together at a table, with Elaine positioned in such a way that her back is facing the stage. She sits there, folding her hands neatly and looking downward. Their chairs are arranged with an angle that allows Ben to look at the stage without confronting Elaine directly. Reflected in the lenses of Ben's glasses is the image of a stripper, adorned in an eye-catching tasseled bra and a g-string, skillfully twirling the tassels as part of her performance. Elaine briefly glances at the stripper before turning back to face away.\n\nIn another scene, Elaine is leaning against a building. She pulls her arm away as Ben, standing in front of her, shifts from side to side, making efforts to capture her attention. Elaine, however, looks away, beginning to cry. Passersby on the sidewalk pause to observe, prompting Elaine to turn away from their gaze. Ben moves to stand directly in front of her, and she raises her hands to her face in distress. With a look of agony, Ben gently takes hold of her wrists and pulls them away, causing Elaine to look up, startled, before he leans in and kisses her. As he releases her hands, she closes her eyes, and her hands move to rest on his wrists. After a moment, she pulls back slightly and turns away, while he gazes at her intently, and she watches him with a cautious eye.\n\nSuddenly, a couple of teenagers drive up alongside them, with a radio loudly broadcasting rock and roll music. Ben leans across Elaine to speak to the driver, a young kid behind the wheel, who responds by turning the volume up even higher. In response, Ben and Elaine roll their windows up to muffle the sound. They continue their animated conversation, engaging with each other while sharing a meal, as Elaine attentively listens to Ben narrating a story."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mrs. Robinson is quietly seated in her designated spot, maintaining her silence, as Mr. Robinson makes his exit from the scene. Following this, there is a transition to a shot featuring both Ben and Elaine as they travel together in Ben's car, with the perspective being from the back seat. In this particular shot, Ben is depicted as navigating the vehicle with a sense of reckless abandon, aggressively weaving in and out of the bustling, chaotic traffic. He leans heavily on the car's blaring horn, creating a cacophony of noise. When the vehicle directly in front of them fails to move out of their way, Ben executes a sharp swerve around it, pressing the horn with a sense of urgency and casting an angry, frustrated glare toward the other driver. Meanwhile, Elaine holds on tightly to the dashboard in a desperate attempt to maintain her balance amidst the chaotic driving.\n\nSubsequently, Ben and Elaine are seen sitting together at a table, with Elaine positioned so that her back is facing the stage. She sits there quietly, folding her hands neatly on her lap and looking downward, lost in thought. Their chairs are arranged in such a way that allows Ben to look directly at the stage without having to confront Elaine face-to-face. Reflecting in the lenses of Ben's glasses is the vivid image of a stripper, adorned in an eye-catching tasseled bra and g-string, skillfully twirling her tasseled outfit as part of her provocative performance. Elaine steals a brief glance at the stripper before turning her gaze away to face in the opposite direction once again.\n\nIn another emotionally charged scene, Elaine is leaning against the side of a building. She pulls her arm away defensively as Ben, standing in front of her, shifts from side to side in a bid to capture her elusive attention. However, Elaine looks in the opposite direction as tears begin to well up in her eyes. The passersby on the bustling sidewalk pause to observe the unfolding situation, prompting Elaine to turn away from their curious gazes. Ben then moves to stand directly in front of her, and she raises her hands to her face in a gesture of distress. With an expression of agony, Ben gently takes hold of her wrists and pulls them away, causing Elaine to look up in startled surprise before he leans in and kisses her tenderly. As he releases her hands, she closes her eyes, and her hands naturally come to rest on his wrists. After a brief moment, she pulls back slightly and turns away, while Ben continues to gaze at her intently. She watches him with a cautious eye, wary of his intentions.\n\nSuddenly, a couple of teenagers drive up alongside them, with their car radio loudly broadcasting rock and roll music. Ben leans across Elaine to speak to the youthful driver behind the wheel, who responds by turning the volume up even higher, increasing the noise. In response, Ben and Elaine roll their windows up to muffle the overwhelming sound. They continue their animated and lively conversation, remaining engaged with each other while sharing a meal. Throughout their discussion, Elaine attentively listens to Ben as he narrates a captivating story, fully engrossed in the narrative he unfolds."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mrs. Robinson sits quietly, maintaining her composed demeanor, while Mr. Robinson rises from his seat and exits the scene. Meanwhile, Ben and Elaine are portrayed in Ben's car, captured from a rear perspective, as Ben takes the driving into his own hands, maneuvering the vehicle with a rash urgency in and out of the bustling traffic. He presses down insistently on the horn, creating a cacophony of noise in an attempt to clear his path. When the vehicle in front remains obstinately stationary, Ben sharply turns the wheel, deftly swerving around it, simultaneously pressing down on the horn once more, and casting a heated, impatient glare at the other driver. Elaine, seated beside him, braces herself against the movement by gripping the dashboard tightly to maintain her equilibrium. In the ensuing scene, Ben and Elaine find themselves seated at a table, with Elaine positioned such that her back faces the stage. She quietly folds her hands in front of her, directing her gaze downward, while their chairs are strategically angled to allow Ben to have a clear, direct view of the stage without needing to meet her eyes. In the reflection of Ben's glasses, the vivid image of a stripper becomes visible, adorned in a tasseled bra and g-string, skillfully twirling the tassels with her movements. Elaine momentarily shifts her attention towards the stripper, taking in the scene, before turning her focus back to Ben. Later, Elaine is seen leaning against a building, instinctively pulling her arm away as Ben faces her, moving from side to side with intent, in an earnest effort to capture her attention. However, Elaine averts her gaze, tears beginning to well up in her eyes, as she struggles to hold back her emotions. The spectacle draws the attention of onlookers on the sidewalk, causing Elaine to pivot away from their intrusive gazes. Sensing her discomfort, Ben steps in front of her, taking initiative. She covers her face with her hands, overwhelmed, while Ben watches her with deep concern, his expression one of shared anguish. Mustering the courage, he gently takes her wrists and pulls them away from her face, prompting a surprised reaction from Elaine as she looks up. In a tender moment, Ben leans in and kisses her, leading her to close her eyes, surrendering to the emotion of the moment, as her hands move to rest on his wrists. After some time, Elaine draws back slightly, turning her face away as Ben remains fixated on her, studying her intently while she in turn observes him carefully. Just then, a couple of teenagers approach in a car, pulling up alongside them with a radio that blares rock and roll music at a high volume. Reacting swiftly, Ben leans over Elaine to address the driver, engaging in a brief exchange that results in the radio volume being increased further. In response, Ben and Elaine promptly roll up their windows, seeking a reprieve from the noise, and continue their conversation with animated gestures, all while enjoying a meal. Elaine pays close attention, her eyes fixed on Ben as he recounts a story, bringing the scene to life with his lively narrative."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mrs. Robinson remains seated as Mr. Robinson exits. Meanwhile, Ben recklessly navigates his car through traffic with Elaine beside him, honking impatiently and glaring at other drivers when necessary, as Elaine steadies herself. Later, at a table near a stage, Elaine sits facing away with her hands folded, while Ben watches a stripper through his glasses' reflection. Elaine glances at the performance before turning back. \n\nOn the street, Elaine leans against a building, initially ignoring Ben's attempts to get her attention until she starts to cry. As bystanders look on, Ben moves to shield her, gently pulling her hands away from her face to kiss her, prompting her to soften and hold his wrists. They continue their interaction until she eventually pulls away slightly, both observing each other closely. Soon, teenagers in a car pull up with loud music playing, prompting Ben to ask them to increase the volume, after which he and Elaine roll up their windows and chat animatedly, sharing stories as they eat."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mrs. Robinson is sitting there, a woman known for her stern demeanor and sharp wit, and Mr. Robinson exits, likely heading to one of his habitual poker games at the local club. Ben and Elaine are then shot in Ben's vintage convertible, a classic 1966 Ford Mustang, seen from the back, as Ben pushes the car recklessly in and out of Los Angeles traffic, a city infamous for its congestion, leaning on the horn. The car ahead does not move, so Ben swerves around it, jamming his horn and giving the other driver an angry look as Elaine, a college student studying psychology, holds on to the dashboard to keep her balance. Ben and Elaine sit at a café table, with Elaine having her back to the stage, folding her hands and looking down, while their chairs are angled so Ben can look at the stage without looking directly at her. The stripper, an iconic act known for her dazzling performances at a well-known club, is reflected in Ben's glasses, down to a tasseled bra and g-string, twirling the tassels in a practiced routine. Elaine turns to look at the stripper, a mix of curiosity and discomfort on her face, and then turns back. Elaine leans against a building, pulling her arm away as Ben, facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Onlookers on the sidewalk, a mix of tourists and locals, watch, prompting Elaine to turn away from them, and Ben moves in front of her. She brings her hands to her face, and Ben looks at her in agony, feelings of their turbulent relationship consuming him, before pulling her wrists away, leading her to look up startled before he kisses her. She closes her eyes as he frees her hands, which then move to his wrists, feeling the tension there. After a while, she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers drive up next to them in a beat-up Chevy, with a radio loudly playing rock and roll, a genre that defined their rebellious spirit. Ben leans across Elaine, speaks to the kid behind the wheel, who turns the radio up, music blasting. Ben and Elaine roll their windows up and talk animatedly while eating greasy burgers and fries from a roadside diner, with Elaine watching as Ben tells her a story from his tumultuous college days."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels Mrs Robinson is sitting there and Mr Robinson exits Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her A couple of teenagers drive up next to them with a radio loudly playing rock and roll Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn She closes her eyes as he frees her hands which then move to his wrists The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance After a while she pulls away and turns slightly as he looks at her and she watches him carefully Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels Elaine turns to look at the stripper and then turns back Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her She closes her eyes as he frees her hands which then move to his wrists After a while she pulls away and turns slightly as he looks at her and she watches him carefully Mrs Robinson is sitting there and Mr Robinson exits A couple of teenagers drive up next to them with a radio loudly playing rock and roll Ben leans across Elaine speaks to the kid behind the wheel who turns the radio up Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mrs Robinson is sitting there and Mr Robinson exits. Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn. The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance. Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her. The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels. Elaine turns to look at the stripper and then turns back. Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her. She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her. She closes her eyes as he frees her hands which then move to his wrists. After a while she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. Ben leans across. Elaine speaks to the kid behind the wheel who turns the radio up. Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mrs Robinson is sitting there and Mr Robinson exits. Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn. The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance. Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her. The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels. Elaine turns to look at the stripper and then turns back. Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her. She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her. She closes her eyes as he frees her hands which then move to his wrists. After a while she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. Ben leans across. Elaine speaks to the kid behind the wheel who turns the radio up. Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mrs Robinson is sitting there and Mr Robinson exits. Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn. The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance. Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. Ben leans across. Elaine speaks to the kid behind the wheel who turns the radio up. Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mrs Robinson is sitting there and Mr Robinson exits. Elaine speaks to the kid behind the wheel who turns the radio up. Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog is sitting there, and the cat exits. The gardener and the librarian are then shot in the gardener's car, seen from the back, as the gardener pushes the car recklessly in and out of traffic, leaning on the horn. The car ahead does not move, so the gardener swerves around it, jamming his horn and giving the other driver an angry look as the librarian holds on to the dashboard to keep her balance. The gardener and the librarian sit at a table, with the librarian having her back to the stage, folding her hands and looking down, while their chairs are angled so the gardener can look at the stage without looking directly at her. The magician is reflected in the gardener's glasses, down to a tasseled bra and g-string, twirling the tassels. The librarian turns to look at the magician and then turns back. The librarian leans against a building, pulling her arm away as the gardener, facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Onlookers on the sidewalk watch, prompting the librarian to turn away from them, and the gardener moves in front of her. She brings her hands to her face, and the gardener looks at her in agony before pulling her wrists away, leading her to look up startled before the gardener kisses her. She closes her eyes as the gardener frees her hands, which then move to his wrists. After a while, she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers drive up next to them with a radio loudly playing rock and roll. The gardener leans across the librarian, speaks to the kid behind the wheel, who turns the radio up. The gardener and the librarian roll their windows up and talk animatedly while eating, with the librarian watching as the gardener tells her a story."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mrs. Robinson is sitting there, and Mr. Robinson exits. Ben and Elaine are then shot in Ben's boat, seen from the back, as Ben pushes the boat recklessly in and out of canyons, leaning on the bell. The raft ahead does not move, so Ben swerves around it, jamming his bell and giving the other sailor an angry look as Elaine holds on to the rail to keep her balance. Ben and Elaine sit at a bench, with Elaine having her back to the screen, folding her hands and looking down, while their seating is angled so Ben can look at the screen without looking directly at her. The juggler is reflected in Ben's binoculars, down to a tasseled vest and shorts, spinning the tassels. Elaine turns to look at the juggler and then turns back. Elaine leans against a fountain, pulling her arm away as Ben, facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Onlookers on the promenade watch, prompting Elaine to turn away from them, and Ben moves in front of her. She brings her hands to her face, and Ben looks at her in agony before pulling her wrists away, leading her to look up startled before he kisses her. She closes her eyes as he frees her hands, which then move to his sleeves. After a while, she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of teenagers glide up next to them with a gramophone loudly playing swing. Ben leans across Elaine, speaks to the kid behind the tiller, who turns the gramophone up. Ben and Elaine close their umbrellas and talk animatedly while snacking, with Elaine watching as Ben tells her a story."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mrs. Robinson is standing there, and Mr. Robinson arrives. Ben and Elaine are then seen in Ben's car, viewed from the back, as Ben maneuvers the car gently in and out of traffic, tapping on the horn. The car ahead does not accelerate, so Ben slides around it, pressing his horn and giving the other driver a curious look as Elaine steadies herself on the dashboard to keep her balance. Ben and Elaine stand at a table, with Elaine having her back to the stage, tapping her fingers and looking up, while their chairs are positioned so Ben can peek at the stage without gazing directly at her. The stripper is mirrored in Ben's glasses, down to a tasseled bra and g-string, shaking the tassels. Elaine glances at the stripper and then glances back. Elaine leans against a building, waving her arm away as Ben, facing her, rocks from side to side, trying to amuse her while she looks away and starts to laugh. Onlookers on the sidewalk glance, prompting Elaine to face away from them, and Ben steps beside her. She lowers her hands to her side, and Ben gazes at her in delight before lifting her wrists away, leading her to look up surprised before he embraces her. She closes her eyes as he releases her hands, which then rest on his shoulders. After a moment, she turns away and turns slightly as he smiles at her and she observes him thoughtfully. A couple of teenagers walk up next to them with a radio quietly playing classical music. Ben leans across Elaine, talks to the kid behind the wheel, who lowers the radio. Ben and Elaine roll their windows down and talk quietly while eating, with Elaine listening as Ben shares a joke."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mrs. Feather is sitting there, and Mr. Feather exits. Dave and Claire are then shot in Dave's canoe, seen from the back, as Dave pushes the canoe recklessly in and out of waves, leaning on the horn. The canoe ahead does not move, so Dave swerves around it, jamming his horn and giving the other paddler an angry look as Claire holds on to the mast to keep her balance. Dave and Claire sit at a picnic blanket, with Claire having her back to the sculpture, folding her hands and looking down, while their logs are angled so Dave can look at the sculpture without looking directly at her. The juggler is reflected in Dave's monocle, down to a sequined hat and bowtie, twirling the props. Claire turns to look at the juggler and then turns back. Claire leans against a lamppost, pulling her coat away as Dave, facing her, moves from side to side, trying to get her attention while she looks away and starts to cry. Passersby on the boardwalk watch, prompting Claire to turn away from them, and Dave moves in front of her. She brings her hands to her face, and Dave looks at her in agony before pulling her elbows away, leading her to look up startled before he kisses her. She closes her eyes as he frees her hands, which then move to his elbows. After a while, she pulls away and turns slightly as he looks at her and she watches him carefully. A couple of skaters glide up next to them with a boom box loudly playing hip hop. Dave leans across Claire, speaks to the skater behind the handlebars, who turns the boom box up. Dave and Claire roll their curtains up and talk animatedly while eating, with Claire watching as Dave tells her a story."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Mr. Henderson is knitting there, and Mrs. Henderson enters. Tom and Sarah are then photographed in Tom's boat, seen from the side, as Tom drags the boat leisurely in and out of the harbor, tapping on the mast. The boat ahead does not anchor, so Tom maneuvers around it, slapping the mast and giving the other sailor a joyful wave as Sarah holds on to the railing to keep her balance. Tom and Sarah lie on a blanket, with Sarah having her back to the mountain, clasping her hands and staring upward, while their blankets are angled so Tom can gaze at the mountain without gazing straight at her. The dancer is mirrored in Tom's sunglasses, down to a feather boa and tutu, spinning the boa. Sarah turns to glance at the dancer and then turns back. Sarah leans against a tree, lifting her foot away as Tom, facing her, hops from foot to foot, trying to gain her attention while she gazes away and starts to laugh. Passersby on the trail observe, prompting Sarah to turn her face away from them, and Tom steps beside her. She brings her hands to her eyes, and Tom peers at her in surprise before nudging her elbows away, leading her to look up amused before he pats her shoulder. She shuts her eyes as he loosens her hands, which then move to his elbows. After a while, she steps back and tilts slightly as he studies her and she observes him intently. A pair of children pedal up next to them with a bicycle loudly playing jazz. Tom leans over Sarah, chats to the kid on the bicycle, who turns the radio down. Tom and Sarah roll their blankets up and converse animatedly while drawing, with Sarah observing as Tom sketches her a scene."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mrs. Robinson is lounging there, and Mr. Robinson departs. Ben and Elaine are then filmed in Ben's tram, seen from the rear, as Ben drags the tram carelessly through and around the pedestrians, resting on the wheel. The tram in front does not budge, so Ben veers around it, slamming his wheel and giving the other operator a stern look as Elaine grips onto the armrest to maintain her balance. Ben and Elaine sit at a counter, with Elaine having her back to the orchestra, clasping her hands and gazing downward, while their stools are positioned so Ben can gaze at the orchestra without facing her. The magician is mirrored in Ben's sunglasses, down to a sequined cape and hat, spinning the wand. Elaine glances at the magician and then turns back. Elaine leans against a sculpture, pulling her coat away as Ben, facing her, sways from side to side, attempting to capture her attention while she averts her gaze and begins to sob. Passersby on the street observe, prompting Elaine to turn away from them, and Ben steps in front of her. She brings her palms to her face, and Ben regards her in distress before tugging her elbows away, causing her to look up surprised before he embraces her. She closes her eyes as he liberates her arms, which then shift to his elbows. After a moment, she withdraws and pivots slightly as he gazes at her and she studies him attentively. A couple of teenagers glide up next to them with a boombox loudly playing jazz. Ben leans across Elaine, talks to the youth at the helm, who increases the boombox volume. Ben and Elaine raise their visors and chat enthusiastically while munching, with Elaine observing as Ben recounts a tale."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Ms. Davis lounges there, and Mr. Davis retreats. Alex and Lisa are then sketched in Alex's balloon, viewed from the rear, as Alex propels the balloon haphazardly over and under the buildings, pressing on the bell. The gondola in front does not shift, so Alex veers past it, slamming his bell and giving the other captain a furious gesture as Lisa clutches the ladder to maintain her stance. Alex and Lisa perch on a log, with Lisa having her back to the waterfall, clasping her hands and gazing downward, while their trunks are positioned so Alex can view the waterfall without facing her directly. The acrobat is mirrored in Alex's monocle, decked in a glittering cape and hoop, spinning the hoops. Lisa turns to glance at the acrobat and then turns back. Lisa leans against a tree, retracting her leg as Alex, confronting her, bobs up and down, attempting to capture her focus while she averts her gaze and begins to sob. Bystanders on the trail observe, prompting Lisa to turn away from them, and Alex shifts in front of her. She raises her elbows to her face, and Alex observes her in distress before lowering her arms, causing her to look up surprised before he hugs her. She closes her eyes as he releases her arms, which then rest on his shoulders. After some time, she steps back and pivots slightly as he observes her and she scrutinizes him attentively. A pair of children pedal up beside them with a speaker booming jazz. Alex leans across Lisa, addresses the child steering the bike, who amplifies the speaker. Alex and Lisa slide their helmets on and converse energetically while munching, with Lisa observing as Alex narrates a tale."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mrs. Robinson is seated as Mr. Robinson leaves. Ben and Elaine are seen in Ben's car, with Ben recklessly maneuvering through traffic, honking and glaring at another driver, while Elaine holds the dashboard for balance. At a table, Elaine faces away from the stage, folding her hands, while Ben looks at the stage, the stripper’s reflection visible in his glasses. Elaine glances at the stripper and turns back. Later, Elaine leans against a building, crying and avoiding Ben's gaze. Onlookers prompt Elaine to turn away, and Ben, facing her, tries to comfort her. He pulls her wrists away, kisses her, and she eventually relaxes, resting her hands on his wrists. After a moment, she pulls back slightly, and they share a careful gaze. Teenagers in a nearby car play loud music. Ben leans over Elaine to speak to them, and they turn up the volume. Ben and Elaine roll up their windows, talking animatedly as Elaine listens to Ben's story."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story Elaine speaks to the kid behind the wheel who turns the radio up Ben leans across A couple of teenagers drive up next to them with a radio loudly playing rock and roll After a while she pulls away and turns slightly as he looks at her and she watches him carefully She closes her eyes as he frees her hands which then move to his wrists She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry Elaine turns to look at the stripper and then turns back The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn Mrs Robinson is sitting there and Mr Robinson exits"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her Elaine speaks to the kid behind the wheel who turns the radio up Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story Ben leans across Elaine turns to look at the stripper and then turns back The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance She closes her eyes as he frees her hands which then move to his wrists Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels A couple of teenagers drive up next to them with a radio loudly playing rock and roll Mrs Robinson is sitting there and Mr Robinson exits Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn After a while she pulls away and turns slightly as he looks at her and she watches him carefully"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She brings her hands to her face and Ben looks at her in agony before pulling her wrists away leading her to look up startled before he kisses her She closes her eyes as he frees her hands which then move to his wrists After a while she pulls away and turns slightly as he looks at her and she watches him carefully A couple of teenagers drive up next to them with a radio loudly playing rock and roll Ben leans across Elaine speaks to the kid behind the wheel who turns the radio up Ben and Elaine roll their windows up and talk animatedly while eating with Elaine watching as Ben tells her a story Mrs Robinson is sitting there and Mr Robinson exits Ben and Elaine are then shot in Ben's car seen from the back as Ben pushes the car recklessly in and out of traffic leaning on the horn The car ahead does not move so Ben swerves around it jamming his horn and giving the other driver an angry look as Elaine holds on to the dashboard to keep her balance Ben and Elaine sit at a table with Elaine having her back to the stage folding her hands and looking down while their chairs are angled so Ben can look at the stage without looking directly at her The stripper is reflected in Ben's glasses down to a tasseled bra and gstring twirling the tassels Elaine turns to look at the stripper and then turns back Elaine leans against a building pulling her arm away as Ben facing her moves from side to side trying to get her attention while she looks away and starts to cry Onlookers on the sidewalk watch prompting Elaine to turn away from them and Ben moves in front of her"
        }
      ]
    }
  ]
}