{
  "ground_truth": "In the silence of the room, they bend over their cues and softly stroke out their shots. The balls roll down the table, bank off the far shoulder, and slowly return toward the two players. Fats' ball hits the closer shoulder. The balls are returned and Eddie makes his break shot, a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. Eddie looks up, with a smile. Fats walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table, Fats rams the cue ball into the pack, dropping the six ball into the pocket. The table is now his. Eddie sits down unhappily. Fats plays quickly, moving from shot to shot with studied authority, his eyes and hands working fluidly together. The shot goes in. As Eddie watches, the prancing, elegant Fats maneuvers around the table. The shot goes in. We see Fats' bejeweled fingers curl around the cue stick, the stick then darting out to send a ball caroming off a far bank and into a side pocket. Fats keeps sinking shots. It is eleven o'clock. Eddie is up. The crowd at Ames sits stolidly in their seats, watching each player, each move. The shot goes in and he lines up another. The shot is a difficult one involving a combination of balls. As it rolls in, the crowd breaks into applause, and Fats bangs the butt of his cue stick on the floor to show his appreciation. So Eddie does the same. Fats peers at the pack of balls huddled together, then points to one that lies in the middle of the pack. Big John looks around — the shot seems impossible. Fats slams the cue ball into the pack. The balls carom outward in all directions. Only the seven rolls slowly into the corner pocket. Eddie slumps back in his seat as the crowd applauds. It is twelve o'clock, and Fats dominates the play. As he calls out the litany of his shots, we see, superimposed over his hands and his face and the sound of socking pool balls, the spectators, stupefied by the action; Charlie, swallowing hard; Eddie, looking on, waiting to play; and the bills endlessly unfolding out of Charlie's hands and floating onto the table. One-thirty and Fats is still shooting. The shot rolls in. The shot goes in. Fats pounds his stick on the floor. Fats allows a perfunctory bow of his head, a courtly gesture, to Eddie's manager. Charlie looks away, avoiding his eyes. Now it's Eddie's voice we hear calling out the shots. He circles the table, a proud, cocky smile on his face, and superimposed over his movements we see the spectators, hunched up in their chairs, and Fats' face, glowering, hostile.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the quiet of the chamber, they lean over their cues and gently caress out their strokes. The spheres roll down the table, bank off the far cushion, and gradually return toward the two participants. Fats' sphere strikes the nearer cushion. The spheres are returned and Eddie executes his break shot, a grazing strike that leaves the cluster of spheres nearly untouched and the white cue sphere lying far away at the end of the table. Eddie glances up, with a grin. Fats strolls around the table and examines the spheres. Placing his cigarette on the wooden edge of the table, Fats drives the cue sphere into the cluster, dropping the six sphere into the pocket. The table is now his. Eddie sits down unhappily. Fats plays swiftly, transitioning from stroke to stroke with calculated authority, his eyes and hands functioning smoothly together. The stroke goes in. As Eddie observes, the prancing, graceful Fats maneuvers around the table. The stroke goes in. We see Fats' adorned fingers wrap around the cue stick, the stick then darting out to send a sphere ricocheting off a distant bank and into a side pocket. Fats keeps sinking strokes. It is eleven o'clock. Eddie is up. The audience at Ames sits impassively in their seats, observing each participant, each action. The stroke goes in and he arranges another. The stroke is a challenging one involving a combination of spheres. As it rolls in, the audience breaks into applause, and Fats pounds the butt of his cue stick on the floor to show his gratitude. So Eddie does the same. Fats examines the cluster of spheres gathered together, then indicates one that lies in the center of the cluster. Big John glances around — the stroke seems impossible. Fats hammers the cue sphere into the cluster. The spheres ricochet outward in all directions. Only the seven rolls slowly into the corner pocket. Eddie slumps back in his seat as the audience applauds. It is twelve o'clock, and Fats controls the play. As he calls out the litany of his strokes, we see, superimposed over his hands and his visage and the sound of striking billiard spheres, the onlookers, stupefied by the action; Charlie, swallowing hard; Eddie, observing, waiting to play; and the bills endlessly unfurling out of Charlie's hands and floating onto the table. One-thirty and Fats is still shooting. The stroke rolls in. The stroke goes in. Fats pounds his stick on the floor. Fats allows a perfunctory nod of his head, a courtly motion, to Eddie's manager. Charlie glances away, avoiding his gaze. Now it's Eddie's voice we hear calling out the strokes. He circles the table, a proud, cocky grin on his visage, and superimposed over his movements we see the onlookers, hunched up in their chairs, and Fats' visage, glowering, hostile."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the silence of the room, cues are bent over by them, and shots are softly stroked out. The table is rolled down by the balls, the far shoulder is banked off by them, and the two players are slowly returned toward. The closer shoulder is hit by Fats' ball. Eddie returns the balls and the break shot is made by him, a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. With a smile, he looks up. The table is walked around by Fats who then peers at the balls. His cigarette is placed on the wooden rim of the table, and the cue ball is rammed into the pack by Fats, dropping the six ball into the pocket. The table is now his. Unhappily, Eddie sits down. Quickly, Fats plays, shots are moved from one to the next by him with studied authority, his eyes and hands working fluidly together. The shot is made. The prancing, elegant Fats is watched by Eddie as he maneuvers around the table. The shot is made. We see the cue stick are curled around by Fats' bejeweled fingers, and a ball is sent caroming off a far bank and into a side pocket by the darting stick. Shots are kept sinking by Fats. It is eleven o'clock. Eddie takes his turn. The crowd at Ames sits stolidly in their seats, each player and move is watched by them. The shot is made and another is lined up by him. A difficult shot involving a combination of balls is made. As it rolls in, applause is broken into by the crowd, and the butt of his cue stick is banged on the floor by Fats to show his appreciation. So the same is done by Eddie. The pack of balls huddled together is peered at by Fats, then one that lies in the middle of the pack is pointed to by him. The shot seems impossible as Big John looks around. The cue ball is slammed into the pack by Fats. Outward in all directions the balls carom. Only the seven is rolled slowly into the corner pocket. Back in his seat, Eddie slumps as the crowd applauds. It is twelve o'clock, and the play is dominated by Fats. As the litany of his shots is called out by him, superimposed over his hands and face, and the sound of socking pool balls, we see the spectators, stupefied by the action; Charlie, swallowing hard; Eddie, looking on, waiting to play; and the bills that are unfolded out of Charlie's hands and floating onto the table, endlessly. One-thirty and the shots are still being made by Fats. The shot is made. The shot is made. The stick is pounded on the floor by Fats. A perfunctory bow of his head, a courtly gesture, is allowed by Fats to Eddie's manager. His eyes are avoided by Charlie, who looks away. Now Eddie's voice is heard calling out the shots. He circles the table, his face displaying a proud, cocky smile, and superimposed over his movements, we see the spectators, hunched up in their chairs, and Fats' face, glowering, hostile."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the silence, they bend over their cues, softly stroking shots. The balls roll, bank off the far shoulder, and return. Fats' ball hits the closer shoulder. Eddie's break shot leaves the pack intact, the cue ball far down the table. Smiling, Eddie watches as Fats peers at the balls and rams the cue ball, sinking the six ball. Fats plays briskly, with fluid eye-hand coordination. His fingers curl around the cue stick, sending a ball into a side pocket. It's 11 o'clock. Eddie rises, and the crowd at Ames watches intently. A difficult combination shot rolls in, eliciting applause, and Fats taps his cue in approval. They exchange nods. Fats aims at a cluster, slamming the cue ball; only the seven drops into the pocket. At noon, Fats dominates. His voice calls out shot details as spectators, including Charlie, look on. Bills float from Charlie's hands onto the table. At 1:30, Fats is still shooting, acknowledging Eddie's manager with a perfunctory nod. Now, Eddie calls shots confidently, circling the table. The crowd leans forward, while Fats glowers, hostile."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the silent room, they focus on their shots. Balls roll, bank, and return. Fats’ ball hits a shoulder. Eddie makes a break shot, leaving balls nearly intact, cue ball distant. Eddie smiles. Fats examines the table, placing his cigarette down, rams the cue ball, sinking the six ball. Eddie sits, unhappy. Fats quickly, elegantly, makes shots. Eleven o'clock arrives; Eddie is up. Ames' crowd watches intently. Eddie lines up a difficult combination shot; applause erupts as it succeeds. Fats and Eddie acknowledge each other. Fats targets an impossible shot, succeeds, and crowd applauds. At twelve, Fats dominates, and by one-thirty still shoots. He acknowledges Eddie’s manager with a nod. Charlie avoids eye contact. Then, Eddie confidently calls shots with a proud smile, as spectators watch, and Fats glowers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the deep, encompassing silence that enveloped the room, they leaned intently over their cues, carefully and deliberately executing their shots with a gentle touch. The balls gracefully rolled across the smooth surface of the table, rebounded off the distant shoulder, and leisurely made their way back toward the two focused players. Fats' ball gently collided with the closer shoulder. As the balls were returned to their initial positions, Eddie confidently took his break shot. It was a precise, glancing blow that left the cluster of balls nearly untouched, while the white cue ball came to rest quietly at the far end of the table. Eddie glanced up, a smile playing on his lips. Fats leisurely circled the table, scrutinizing the arrangement of the balls. He carefully placed his cigarette on the wooden rim of the table before forcefully driving the cue ball into the cluster, successfully pocketing the six ball. The table was now under Fats' control. Eddie sat down, visibly disappointed. \n\nFats continued his play with remarkable speed, transitioning from one shot to the next with a composed and confident authority. His eyes and hands operated in fluid harmony. Each shot found its target, sinking into the pockets with practiced skill. As Eddie watched, Fats, with his elegant and almost prancing demeanor, deftly maneuvered around the table. Shot after shot found its mark. We observed Fats' bejeweled fingers curling around the cue stick, only for the stick to dart forward, sending a ball ricocheting off a distant bank and expertly into a side pocket. Fats maintained his streak of sinking shots effortlessly. It was now eleven o'clock. Eddie stood up. The crowd at Ames remained seated, watching each player and each strategic move with unwavering attention. Shot after shot went in as Eddie lined up another. This particular shot was challenging, involving a complex combination of balls. As the balls rolled in, the audience erupted in applause, with Fats acknowledging the effort by banging the butt of his cue stick on the floor in appreciation. Eddie mirrored the gesture. Fats scrutinized the tightly grouped pack of balls, pointing out one nestled in the middle. Big John scanned the room— the shot appeared impossible. Fats charged the cue ball into the pack with determination. The balls dispersed in all directions, and only the seven ball rolled languidly into a corner pocket. Eddie sank back into his seat, the crowd's applause resonating around him. By twelve o'clock, Fats continued to dominate the game. As he called out the sequence of his shots, a montage of images appeared over his hands and face, accompanied by the rhythmic sound of pool balls. Spectators appeared mesmerized by the action; Charlie, swallowing nervously; Eddie, watching intently and waiting for his turn; and an endless stream of bills unfolding from Charlie's hands, cascading onto the table. \n\nBy one-thirty, Fats was still actively shooting. Shot after shot rolled in seamlessly. Each successful strike prompted Fats to pound his stick on the floor. He offered a perfunctory nod of acknowledgment, a courtly gesture, to Eddie's manager. Charlie averted his gaze, avoiding eye contact. Now, it was Eddie's voice that resonated as he called out his shots. He confidently strode around the table, wearing a proud, self-assured smile. Superimposed over his movements, we saw the spectators, hunched tensely in their chairs, and Fats' face, glowering with hostility."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the deep and all-encompassing silence that seemed to envelop the room like a thick, invisible blanket, they leaned intently over their cues, carefully and deliberately executing their shots with a gentle yet precise touch. The balls gracefully rolled across the smooth and polished surface of the table, rebounding elegantly off the distant shoulder, and leisurely making their way back toward the two intensely focused players. Fats' ball gently collided with the closer shoulder, creating a soft clinking sound. As the balls were meticulously returned to their initial positions, Eddie confidently took his break shot. It was a precise and glancing blow that left the cluster of balls nearly untouched, while the white cue ball came to rest quietly at the far end of the table. Eddie glanced up, a playful smile dancing on his lips. Fats leisurely circled the table, scrutinizing the precise arrangement of the balls with a keen eye. He carefully placed his cigarette on the wooden rim of the table before forcefully driving the cue ball into the cluster, successfully pocketing the six ball. The table was now firmly under Fats' control. Eddie sat down, visibly disappointed yet resigned.\n\nFats continued his play with remarkable speed and efficiency, transitioning smoothly from one shot to the next with a composed and confident authority that bespoke years of practice and mastery. His eyes and hands operated in perfect, fluid harmony. Each shot found its intended target, sinking into the pockets with practiced and consistent skill. As Eddie watched, Fats, with his elegant and almost prancing demeanor, deftly maneuvered around the table, weaving in and out. Shot after shot found its mark with precision. We observed Fats' bejeweled fingers curling around the cue stick, only for the stick to dart forward like a striking snake, sending a ball ricocheting off a distant bank and expertly into a side pocket. Fats maintained his impressive streak of sinking shots effortlessly. It was now eleven o'clock. Eddie stood up, ready to rejoin the fray. The crowd at Ames remained seated, their eyes fixed, watching each player and each strategic move with unwavering and intense attention. Shot after shot went in as Eddie lined up another, his concentration unbroken. This particular shot was challenging, involving a complex, intricate combination of balls. As the balls rolled in, the audience erupted in applause, with Fats acknowledging the effort by banging the butt of his cue stick on the floor in respectful appreciation. Eddie mirrored the gesture in agreement. Fats scrutinized the tightly grouped pack of balls, astutely pointing out one nestled in the middle. Big John scanned the room—the shot appeared deceptively impossible. Fats charged the cue ball into the pack with unwavering determination. The balls dispersed in all directions, scattering across the table, and only the seven ball rolled languidly into a corner pocket. Eddie sank back into his seat, the crowd's enthusiastic applause resonating around him like a wave. By twelve o'clock, Fats continued to dominate the game with his superior skill and strategy. As he called out the sequence of his shots, a montage of vivid images appeared over his hands and face, accompanied by the rhythmic sound of pool balls clattering together. Spectators appeared mesmerized by the unfolding action; Charlie, swallowing nervously; Eddie, watching intently and waiting patiently for his turn; and an endless stream of bills unfolding from Charlie's hands, cascading onto the table.\n\nBy around one-thirty, Fats was still actively and energetically shooting. Shot after masterful shot rolled in seamlessly, as if guided by an unseen hand. Each successful strike prompted Fats to pound his stick on the floor in triumph. He offered a perfunctory nod of acknowledgment, a courtly gesture, to Eddie's manager. Charlie averted his gaze, avoiding direct eye contact, perhaps out of unease. Now, it was Eddie's voice that resonated as he called out his shots, his confidence growing. He confidently strode around the table, wearing a proud, self-assured smile that spoke volumes of his intent. Superimposed over his graceful movements, we saw the spectators, hunched tensely in their chairs, eyes glued to the action, and Fats' face, glowering with thinly veiled hostility."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the silence that envelops the room, the two players bend over their cues with great focus, softly stroking out their shots in a deliberate dance. The balls glide smoothly down the table, striking the far shoulder with a calculated spin before slowly returning, obediently, toward the two waiting players. Fats' ball meets the nearer shoulder with a precise tap. The balls are promptly retrieved and returned to their starting positions as Eddie steps up to take his turn. With careful aim, he delivers his break shot, a deft glancing blow that leaves the clustered pack of balls largely untouched, while the white cue ball comes to rest, isolated, at the table's distant end. Lifting his gaze with a hint of satisfaction, Eddie shares a brief, knowing smile. Meanwhile, Fats begins his calculated walk around the table, taking a moment to examine the position of the balls from every angle. He delicately places his cigarette on the wooden rim, then with a swift, forceful motion, he drives the cue ball into the pack, sending the six ball neatly into a pocket. The table, now in his command, becomes a stage for Fats' quick, assured movements from one shot to the next, his eyes and hands working in perfect harmony as each shot finds its mark. Eddie, now seated, observes with growing discontent as the graceful and confident Fats moves with elegance around the table. Each shot sinks into its intended pocket with precision. Fats’ bejeweled fingers curl around the cue stick with seasoned expertise, the stick then darting out, sending a ball on a journey off a far bank and into a side pocket as the balls continue to disappear, one after another. It is now eleven o'clock, and Eddie rises to his feet. The crowd at Ames sits solidly in their seats, their eyes fixed intently on each player and each move. Eddie's shot finds its mark, and he quickly lines up another, facing a challenging shot that involves a combination of balls. As the shot rolls into its target, the crowd's applause erupts in appreciation, prompting Fats to show his admiration by tapping the butt of his cue stick on the floor. Eddie reciprocates the gesture in kind. Fats then examines the cluster of balls closely, his sharp eye isolating one dwelling stubbornly in their midst. As Big John looks around in disbelief at the seeming impossibility of the shot, Fats confidently slams the cue ball into the pack, sending balls ricocheting outward in every direction, while only the seven takes a leisurely roll into the corner pocket. Eddie slouches back into his chair, defeated, as the crowd's applause continues to swell. As the clock strikes midnight, Fats remains in dominant control of the game, calling out the sequence of his shots like a litany. Overlaying his hands and face, and accompanied by the rhythmic soundtrack of colliding pool balls, the scene reveals the spectators, spellbound by the unfolding spectacle; Charlie, his throat betraying its dryness with every swallow; Eddie, watching on, eager for his chance to resume play; and the cascade of bills that seem to never cease, unfolding and floating relentlessly onto the table from Charlie's hands. The time ticks on to one-thirty, and Fats is still sending shots into pockets with unwavering precision. His shot finds its mark, and he taps his stick on the floor to punctuate another successful play, offering a cursory nod, a gesture of courtly acknowledgment, toward Eddie's manager. Charlie averts his gaze, avoiding any eye contact. Now, Eddie's voice rings out, confidently announcing each shot as he circles the table, a proud, cocky smile lighting his face. Superimposed over Eddie's movements are the spectators, now hunched forward in their seats, and Fats’ face, darkened by a glowering, hostile expression."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the silence of the room, the players meticulously execute their shots, causing the balls to glide across the table and rebound off the cushions. Fats' ball lands near the shoulder, and as the balls are reset, Eddie makes a break shot that leaves the pack mostly intact, with the cue ball distant. He smiles as Fats circles the table, places his cigarette aside, and decisively breaks the pack, sinking the six ball. Eddie, discontent, takes a seat as Fats confidently continues his streak, his fluid movements leading to successful shots. The crowd at Ames watches intently, unmoving, as Fats skillfully maneuvers around the table, consistently sinking shots. By eleven o'clock, Eddie stands to play amidst the attentive crowd, executing a challenging combination shot that draws applause and recognition from Fats. When Fats points to a seemingly impossible shot, he slams the cue ball into the pack, scattering the balls and sinking the seven, prompting more applause as Eddie slumps back. At midnight, Fats remains in command, declaring his shots with precision as the crowd, transfixed, watches. Spectators, including Charlie, absorb the spectacle as the bills from Charlie's hands accumulate on the table. By one-thirty, Fats continues his run, acknowledging Eddie's manager with a courteous nod while Charlie avoids eye contact. Transitioning to Eddie's turn, his voice confidently announces his plays, circling the table with a proud smile as the spectators remain engaged and Fats observes with a hostile gaze."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the silence of the room, lit by the dim overhead light of the billiard hall known for its late-night matches, they bend over their cues and softly stroke out their shots. The balls roll down the table, bank off the far shoulder designed for precision play, and slowly return toward the two players. Fats' ball hits the closer shoulder, a move honed by years of practice at competitive games where precision means everything. The balls are returned and Eddie makes his break shot, a glancing blow that leaves the pack of balls nearly intact, and the white cue ball lying far away at the end of the table, a position that can be both strategic and challenging in professional pool. Eddie looks up, with a smile that hints at his confidence in his skill. Fats, a legend in the pool circuit known for his calm demeanor under pressure, walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table, an old habit from when smoke-filled rooms were the norm, Fats rams the cue ball into the pack, dropping the six ball into the pocket. The table is now his, a familiar territory he is well accustomed to dominating. Eddie sits down unhappily, knowing he is up against a master. \n\nFats plays quickly, moving from shot to shot with studied authority, akin to a concert pianist masterfully commanding their instrument, his eyes and hands working fluidly together. The shot goes in. As Eddie watches, the prancing, elegant Fats maneuvers around the table with the grace of a dancer, each step calculated for balance and precision. The shot goes in. We see Fats' bejeweled fingers, flashing under the lights, curl around the cue stick, the stick then darting out to send a ball caroming off a far bank and into a side pocket. Fats keeps sinking shots like a well-oiled machine of precision. It is eleven o'clock, and the clock on the wall ticks softly, a reminder of the hours passing in hushed intensity. Eddie is up. The crowd at Ames, a legendary venue where many greats have played, sits stolidly in their seats, watching each player, each move with rapt attention. The shot goes in and he lines up another. The shot is a difficult one involving a combination of balls, a signature move in high-stakes games. As it rolls in, the crowd breaks into applause, and Fats bangs the butt of his cue stick on the floor to show his appreciation. So Eddie does the same, in a gesture of mutual respect. \n\nFats peers at the pack of balls huddled together, then points to one that lies in the middle of the pack, a challenging position even for seasoned players. Big John, a known enthusiast and regular at the hall, looks around — the shot seems impossible. Fats slams the cue ball into the pack. The balls carom outward in all directions, a testament to his power and precision. Only the seven rolls slowly into the corner pocket, a satisfying sound echoing in the hall. Eddie slumps back in his seat as the crowd applauds the display of skill. It is twelve o'clock, and Fats dominates the play with the seasoned ease of a veteran. As he calls out the litany of his shots, a routine practiced over countless matches, we see, superimposed over his hands and his face and the sound of socking pool balls, the spectators, stupefied by the action; Charlie, a manager whose reputation hangs on the success of his players, swallowing hard; Eddie, looking on, waiting to play, and the bills endlessly unfolding out of Charlie's hands and floating onto the table, a typical scene in high-stakes games. One-thirty and Fats is still shooting, an endurance test as much as a skill one. The shot rolls in. The shot goes in. Fats pounds his stick on the floor, a triumphant assertion of his prowess. Fats allows a perfunctory bow of his head, a courtly gesture, to Eddie's manager, honoring the tradition of respect in the pool-playing fraternity. Charlie looks away, avoiding his eyes, the weight of the evening's outcome heavy on his mind. Now it's Eddie's voice we hear calling out the shots, a sign of the shift in momentum. He circles the table, a proud, cocky smile on his face, reflecting his confidence in turning the game around, and superimposed over his movements we see the spectators, hunched up in their chairs, and Fats' face, glowering, hostile, a fierce competitor unwilling to relinquish his dominance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Eddie sits down unhappily In the silence of the room they bend over their cues and softly stroke out their shots The balls roll down the table bank off the far shoulder and slowly return toward the two players Fats' ball hits the closer shoulder The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table Now it is Eddie's voice As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation Eddie looks up with a smile Charlie swallowing hard Fats walks around the table and peers at the balls Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket The table is now his The shot goes in Eddie sits down unhappily Fats walks around the table and peers at the balls Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together we see the spectators hunched up in their chairs and Fats' face glowering hostile The shot goes in As Eddie watches the prancing elegant Fats maneuvers around the table The shot goes in We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket The balls roll down the table bank off the far shoulder and slowly return toward the two players Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table Fats keeps sinking shots The shot is a difficult one involving a combination of balls It is twelve of the clock and Fats dominates the play It is eleven of the clock Fats keeps sinking shots Eddie is up In the silence of the room they bend over their cues and softly stroke out their shots The crowd at Ames sits stolidly in their seats watching each player each move The shot goes in and he lines up another The shot is a difficult one involving a combination of balls As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation So Eddie does the same Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack Fats' ball hits the closer shoulder Big John looks around — the shot seems impossible Fats slams the cue ball into the pack The balls carom outward in all directions The table is now his The crowd at Ames sits stolidly in their seats watching each player each move Only the seven rolls slowly into the corner pocket Eddie slumps back in his seat as the crowd applauds It is twelve of the clock and Fats dominates the play As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action Charlie swallowing hard Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table Onethirty and Fats is still shooting The shot rolls in It is eleven of the clock He circles the table a proud cocky smile on his face and superimposed over his movements The shot goes in Eddie is up Fats pounds his stick on the floor Eddie slumps back in his seat as the crowd applauds Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager Charlie looks away avoiding his eyes Now it is Eddie's voice we hear calling out the shots He circles the table a proud cocky smile on his face and superimposed over his movements Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket we see the spectators hunched up in their chairs and Fats' face glowering hostile"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In the silence of the room they bend over their cues and softly stroke out their shots. The balls roll down the table bank off the far shoulder and slowly return toward the two players. Fats' ball hits the closer shoulder. The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. Eddie looks up with a smile. Fats walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket. The table is now his. Eddie sits down unhappily. Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together. The shot goes in. As Eddie watches the prancing elegant Fats maneuvers around the table. The shot goes in. We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket. Fats keeps sinking shots. It is eleven of the clock. Eddie is up. The crowd at Ames sits stolidly in their seats watching each player each move. The shot goes in and he lines up another. The shot is a difficult one involving a combination of balls. As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. So Eddie does the same. Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack. Big John looks around — the shot seems impossible. Fats slams the cue ball into the pack. The balls carom outward in all directions. Only the seven rolls slowly into the corner pocket. Eddie slumps back in his seat as the crowd applauds. It is twelve of the clock and Fats dominates the play. As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action. Charlie swallowing hard. Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table. Onethirty and Fats is still shooting. The shot rolls in. The shot goes in. Fats pounds his stick on the floor. Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager. Charlie looks away avoiding his eyes. Now it is Eddie's voice. we hear calling out the shots. He circles the table a proud cocky smile on his face and superimposed over his movements. we see the spectators hunched up in their chairs and Fats' face glowering hostile."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In the silence of the room they bend over their cues and softly stroke out their shots. The balls roll down the table bank off the far shoulder and slowly return toward the two players. Fats' ball hits the closer shoulder. The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. Eddie looks up with a smile. Fats walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket. The table is now his. Eddie sits down unhappily. Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together. The shot goes in. As Eddie watches the prancing elegant Fats maneuvers around the table. The shot goes in. We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket. Fats keeps sinking shots. It is eleven of the clock. Eddie is up. The crowd at Ames sits stolidly in their seats watching each player each move. The shot goes in and he lines up another. The shot is a difficult one involving a combination of balls. As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. So Eddie does the same. Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack. Big John looks around — the shot seems impossible. Fats slams the cue ball into the pack. The balls carom outward in all directions. Only the seven rolls slowly into the corner pocket. Eddie slumps back in his seat as the crowd applauds. It is twelve of the clock and Fats dominates the play. As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action. Charlie swallowing hard. Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table. Onethirty and Fats is still shooting. The shot rolls in. The shot goes in. Fats pounds his stick on the floor. Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager. Charlie looks away avoiding his eyes. Now it is Eddie's voice. we hear calling out the shots. He circles the table a proud cocky smile on his face and superimposed over his movements. we see the spectators hunched up in their chairs and Fats' face glowering hostile."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In the silence of the room they bend over their cues and softly stroke out their shots. The balls roll down the table bank off the far shoulder and slowly return toward the two players. Fats' ball hits the closer shoulder. The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. Eddie looks up with a smile. Fats walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket. The table is now his. Eddie sits down unhappily. Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together. The shot goes in. Onethirty and Fats is still shooting. The shot rolls in. The shot goes in. Fats pounds his stick on the floor. Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager. Charlie looks away avoiding his eyes. Now it is Eddie's voice. we hear calling out the shots. He circles the table a proud cocky smile on his face and superimposed over his movements. we see the spectators hunched up in their chairs and Fats' face glowering hostile."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In the silence of the room they bend over their cues and softly stroke out their shots. The balls roll down the table bank off the far shoulder and slowly return toward the two players. Fats' ball hits the closer shoulder. The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. Eddie looks up with a smile. Now it is Eddie's voice. we hear calling out the shots. He circles the table a proud cocky smile on his face and superimposed over his movements. we see the spectators hunched up in their chairs and Fats' face glowering hostile."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In the silence of the room, the penguins bend over their cues and softly stroke out their shots. The balls roll down the table, bank off the far shoulder, and slowly return toward the two dolphins. The giraffe's ball hits the closer shoulder. The balls are returned and the kangaroo makes his break shot, a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table. The kangaroo looks up, with a smile. The giraffe walks around the table and peers at the balls. Placing his cigarette on the wooden rim of the table, the giraffe rams the cue ball into the pack, dropping the six ball into the pocket. The table is now his. The kangaroo sits down unhappily. The giraffe plays quickly, moving from shot to shot with studied authority, his eyes and hands working fluidly together. The shot goes in. As the kangaroo watches, the prancing, elegant giraffe maneuvers around the table. The shot goes in. We see the giraffe's bejeweled fingers curl around the cue stick, the stick then darting out to send a ball caroming off a far bank and into a side pocket. The giraffe keeps sinking shots. It is eleven o'clock. The kangaroo is up. The crowd at Ames sits stolidly in their seats, watching each elephant, each move. The shot goes in and it lines up another. The shot is a difficult one involving a combination of balls. As it rolls in, the crowd breaks into applause, and the giraffe bangs the butt of its cue stick on the floor to show its appreciation. So the kangaroo does the same. The giraffe peers at the pack of balls huddled together, then points to one that lies in the middle of the pack. Big John looks around — the shot seems impossible. The giraffe slams the cue ball into the pack. The balls carom outward in all directions. Only the seven rolls slowly into the corner pocket. The kangaroo slumps back in its seat as the crowd applauds. It is twelve o'clock, and the giraffe dominates the play. As it calls out the litany of its shots, we see, superimposed over its hands and its face and the sound of socking pool balls, the spectators, stupefied by the action; the dog, swallowing hard; the kangaroo, looking on, waiting to play; and the bills endlessly unfolding out of the dog's hands and floating onto the table. One-thirty and the giraffe is still shooting. The shot rolls in. The shot goes in. The giraffe pounds its stick on the floor. The giraffe allows a perfunctory bow of its head, a courtly gesture, to the kangaroo's manager. The dog looks away, avoiding its eyes. Now it's the kangaroo's voice we hear calling out the shots. It circles the table, a proud, cocky smile on its face, and superimposed over its movements we see the spectators, hunched up in their chairs, and the giraffe's face, glowering, hostile."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In the silence of the hall, they bend over their brushes and softly stroke out their strokes. The marbles roll down the track, bank off the far ledge, and slowly return toward the two players. Fats' marble hits the closer ledge. The marbles are returned and Eddie makes his break stroke, a glancing blow that leaves the cluster of marbles nearly intact and the yellow marble lying far away at the end of the track. Eddie looks up, with a smile. Fats walks around the track and peers at the marbles. Placing his pencil on the metal rim of the track, Fats rams the yellow marble into the cluster, dropping the eight marble into the gutter. The track is now his. Eddie sits down unhappily. Fats plays quickly, moving from stroke to stroke with studied authority, his eyes and hands working fluidly together. The stroke goes in. As Eddie watches, the prancing, elegant Fats maneuvers around the track. The stroke goes in. We see Fats' bejeweled fingers curl around the brush, the brush then darting out to send a marble caroming off a far wall and into a side gutter. Fats keeps sinking strokes. It is eleven o'clock. Eddie is up. The crowd at Macy's sits stolidly in their seats, watching each player, each move. The stroke goes in and he lines up another. The stroke is a difficult one involving a combination of marbles. As it rolls in, the crowd breaks into applause, and Fats bangs the butt of his brush on the floor to show his appreciation. So Eddie does the same. Fats peers at the cluster of marbles huddled together, then points to one that lies in the middle of the cluster. Big John looks around — the stroke seems impossible. Fats slams the yellow marble into the cluster. The marbles carom outward in all directions. Only the nine rolls slowly into the corner gutter. Eddie slumps back in his seat as the crowd applauds. It is twelve o'clock, and Fats dominates the play. As he calls out the litany of his strokes, we see, superimposed over his hands and his face and the sound of socking marble balls, the spectators, stupefied by the action; Charlie, swallowing hard; Eddie, looking on, waiting to play; and the ribbons endlessly unfolding out of Charlie's hands and floating onto the track. One-thirty and Fats is still stroking. The stroke rolls in. The stroke goes in. Fats pounds his brush on the floor. Fats allows a perfunctory bow of his head, a courtly gesture, to Eddie's manager. Charlie looks away, avoiding his eyes. Now it's Eddie's voice we hear calling out the strokes. He circles the track, a proud, cocky smile on his face, and superimposed over his movements we see the spectators, hunched up in their chairs, and Fats' face, glowering, hostile."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In the silence of the room, they crouch over their cues and gently flick out their shots. The balls glide across the table, ricochet off the far shoulder, and gradually drift back toward the two players. Fats' ball nudges the closer shoulder. The balls are retrieved and Eddie executes his break shot, a faint touch that keeps the pack of balls nearly intact and the white cue ball resting far away at the end of the table. Eddie glances up, with a grin. Fats strolls around the table and inspects the balls. Placing his cigarette on the wooden rim of the table, Fats thrusts the cue ball into the pack, sinking the six ball into the pocket. The table is now his. Eddie slouches down unhappily. Fats plays briskly, transitioning from shot to shot with measured confidence, his eyes and hands coordinating seamlessly. The shot lands in. As Eddie observes, the strutting, graceful Fats navigates around the table. The shot lands in. We see Fats' adorned fingers grip the cue stick, the stick then darting out to propel a ball ricocheting off a far bank and into a side pocket. Fats keeps scoring shots. It is eleven o'clock. Eddie rises. The crowd at Ames sits motionless in their seats, observing each player, each motion. The shot lands in and he sets up another. The shot is a tricky one involving a series of balls. As it sinks in, the crowd erupts into applause, and Fats taps the butt of his cue stick on the floor to express his respect. So Eddie mimics the gesture. Fats examines the pack of balls clustered together, then gestures to one that rests in the middle of the pack. Big John glances around — the shot appears unattainable. Fats hurls the cue ball into the pack. The balls scatter outward in all directions. Only the seven drifts slowly into the corner pocket. Eddie slouches back in his seat as the crowd cheers. It is twelve o'clock, and Fats commands the play. As he recites the sequence of his shots, we see, overlaid on his hands and his face and the sound of striking pool balls, the spectators, spellbound by the activity; Charlie, gulping hard; Eddie, observing, waiting to play; and the bills perpetually unfurling out of Charlie's hands and floating onto the table. One-thirty and Fats is still shooting. The shot lands in. The shot lands in. Fats strikes his stick on the floor. Fats performs a brief nod of his head, a courteous gesture, to Eddie's manager. Charlie averts his gaze, evading his eyes. Now it's Eddie's voice we hear announcing the shots. He orbits the table, an arrogant, confident smile on his face, and superimposed over his actions we see the spectators, hunched up in their chairs, and Fats' face, scowling, antagonistic."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In the whispers of the garden, the lamps bend over their branches and lightly brush out their songs. The leaves flutter down the path, bounce off the distant gate, and slowly drift back toward the two statues. Max's leaf taps the nearer gate. The leaves are returned and Sam makes his leap, a gentle skip that leaves the pile of leaves nearly untouched and the green acorn lying far away at the end of the path. Sam glances up, with a grin. Max strolls around the garden and examines the leaves. Placing his hat on the metal fence of the path, Max flings the acorn into the pile, nudging the red leaf into the pond. The garden is now his. Sam sits down gloomily. Max dances quickly, moving from leap to leap with practiced grace, his eyes and fingers working fluidly together. The leaf flutters in. As Sam observes, the twirling, graceful Max swirls around the path. The leaf flutters in. We see Max's sparkling buttons wrap around the twig, the twig then snapping out to send a leaf bouncing off a distant wall and into a nearby fountain. Max keeps collecting leaves. It is eleven o'clock. Sam is up. The guests at Flora's rest quietly in their spots, observing each statue, each leap. The leaf flutters in and he prepares another. The leaf is a tricky one involving a chain of branches. As it drifts in, the guests break into cheers, and Max taps the tip of his twig on the ground to show his approval. So Sam does the same. Max examines the stack of leaves nestled together, then gestures to one that rests near the center of the stack. Tall Tom scans around — the leaf seems unreachable. Max thrusts the acorn into the stack. The leaves scatter outward in all directions. Only the three slowly glides into the corner pond. Sam sags back in his place as the guests applaud. It is twelve o'clock, and Max commands the leaps. As he announces the litany of his leaps, we see, layered over his fingers and his face and the murmur of rustling branches, the guests, mesmerized by the spectacle; Louis, gulping nervously; Sam, observing closely, anticipating his turn; and the petals endlessly unfurling out of Louis's basket and floating onto the path. One-thirty and Max is still twirling. The leaf drifts in. The leaf flutters in. Max taps his twig on the ground. Max permits a slight nod of his head, a polite gesture, to Sam's guide. Louis glances away, evading his gaze. Now it's Sam's voice we hear announcing the leaps. He circles the path, a bold, smug grin on his face, and layered over his movements we see the guests, crouched in their chairs, and Max's face, scowling, unfriendly."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In the quiet of the library, the cats stoop over their brushes and gently paint out their lines. The droplets slide across the canvas, splash off the distant edge, and slowly drift back toward the two artists. Max's droplet touches the nearer edge. The droplets are retrieved and Sam begins his introductory stroke, a sweeping motion that leaves the canvas nearly untouched and the blue brush resting far away at the end of the easel. Sam glances up, with a grin. Max strolls around the easel and gazes at the droplets. Placing his coffee cup on the wooden ledge of the easel, Max thrusts the brush into the canvas, splattering a spot of paint onto the surface. The canvas is now his. Sam reclines sadly. Max paints rapidly, transitioning from stroke to stroke with deliberate confidence, his vision and fingers coordinating smoothly. The stroke blends in. As Sam observes, the skipping, graceful Max twists around the canvas. The stroke blends in. We see Max's adorned hands wrap around the brush, the brush then flicking out to send a droplet splashing off a distant corner and onto a side area. Max keeps creating blends. It is eleven o'clock. Sam stands. The visitors at Studio B sit expressionlessly in their seats, observing each artist, each motion. The stroke blends in and he prepares another. The pattern is a challenging one involving an array of colors. As it merges in, the audience erupts into applause, and Max taps the handle of his brush on the floor to express his gratitude. So Sam does the same. Max examines the array of colors pooled together, then gestures to one that sits in the center of the pool. Big Bob glances around — the pattern seems unattainable. Max hurls the brush into the pool. The colors splash outward in all directions. Only the orange slowly trickles into the corner area. Sam slouches back in his chair as the audience cheers. It is twelve o'clock, and Max controls the canvas. As he declares the sequence of his strokes, we see, overlaying his fingers and his smile and the sound of splashing paint, the viewers, entranced by the spectacle; Charlie, swallowing nervously; Sam, observing, ready to create; and the papers continuously fluttering out of Charlie's hands and landing onto the easel. One-thirty and Max is still painting. The stroke blends in. The stroke merges in. Max taps his brush on the floor. Max gives a brief nod of his head, a respectful gesture, to Sam’s guide. Charlie gazes away, dodging his glance. Now it's Sam’s voice we hear announcing the strokes. He loops around the canvas, a confident, jaunty smile on his face, and overlaying his movements we see the viewers, crouched in their chairs, and Max's face, scowling, unfriendly."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In the quiet of the garden, they lean over their brushes and gently flick out their strokes. The marbles glide down the path, ricochet off the nearby hedge, and lazily gravitate back toward the two gardeners. Fats' marble touches the nearer hedge. The marbles are collected and Eddie creates his opening stroke, a gentle tap that leaves the cluster of marbles mostly undisturbed and the white marble lying distant at the edge of the path. Eddie glances up, with a grin. Fats strolls around the garden and inspects the marbles. Placing his pen on the stone ledge of the path, Fats flicks the marble into the cluster, nudging the red marble into the bucket. The garden is now his. Eddie sinks down disheartened. Fats crafts quickly, shifting from stroke to stroke with deliberate expertise, his eyes and hands working smoothly together. The stroke lands. As Eddie observes, the strutting, graceful Fats navigates around the garden. The stroke lands. We see Fats' jeweled fingers clasp the brush, the brush then darting out to send a marble bouncing off a distant wall and into a flower pot. Fats keeps dropping marbles. It is eleven o'clock. Eddie is back up. The crowd at the orchard sits rigidly on their benches, observing each gardener, each action. The stroke lands and he positions another. The stroke is a challenging one involving a series of marbles. As it lands, the crowd erupts into cheers, and Fats taps the bottom of his brush on the ground to show his commendation. So Eddie follows suit. Fats inspects the cluster of marbles gathered together, then gestures to one nestled in the middle of the cluster. Big John glances around — the stroke seems unimaginable. Fats clouts the marble into the cluster. The marbles scatter out in all directions. Only the green one rolls leisurely into the corner bucket. Eddie slouches back on his bench as the crowd cheers. It is twelve o'clock, and Fats commands the activity. As he declares the sequence of his strokes, we see, superimposed over his hands and his face and the sound of clinking marbles, the audience, mesmerized by the movements; Charlie, gulping nervously; Eddie, watching intently, waiting to craft; and the coins constantly unraveling out of Charlie's pockets and fluttering onto the path. One-thirty and Fats is still crafting. The stroke lands. The stroke lands. Fats thumps his brush on the ground. Fats offers a brief nod of his head, a polite gesture, to Eddie's agent. Charlie turns away, dodging his gaze. Now it's Eddie's voice we hear announcing the strokes. He tours the garden, a proud, jaunty smile on his face, and superimposed over his motions we see the audience, huddled in their benches, and Fats' face, glaring, unfriendly."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In the hush of the forest, they crouch over their notebooks and gently scribble out their notes. The leaves drift down the path, twist off the wide branch, and lazily return toward the two scribes. Felix's leaf taps the closer branch. The leaves are gathered and Neil scribbles his starting note, a fleeting mark that leaves the stack of leaves nearly untouched and the grey quill resting far away at the end of the path. Neil glances up, with a grin. Felix shuffles around the path and squints at the leaves. Placing his sandwich on the stone edge of the path, Felix flicks the quill toward the stack, sending the blue leaf into the basket. The path is now his. Neil crouches down gloomily. Felix scribbles swiftly, shifting from note to note with practiced confidence, his mind and fingers collaborating fluidly. The note lands. As Neil observes, the dashing, graceful Felix navigates around the path. The note lands. We see Felix's adorned fingers wrap around the quill, the quill then darting out to send a leaf skimming off a distant boulder and into a side basket. Felix keeps capturing notes. It is eleven o'clock. Neil rises. The gathering in the meadow sits quietly on their stumps, observing each scribe, each action. The note lands and he sets up another. The note is a tricky one involving a series of leaves. As it drifts in, the gathering erupts into clapping, and Felix taps the handle of his quill on the ground to express his approval. So Neil does the same. Felix squints at the stack of leaves clustered together, then gestures to one that sits in the center of the stack. Big Hank scans around — the note seems impractical. Felix flicks the quill into the stack. The leaves scatter outward in all directions. Only the red one drifts slowly into the corner basket. Neil slumps back on his stump as the gathering applauds. It is twelve o'clock, and Felix controls the scribbling. As he announces the sequence of his notes, we see, overlaid on his fingers and his expression and the noise of rustling leaves, the onlookers, overwhelmed by the scene; Chuck, gulping nervously; Neil, observing silently; and the pages continually unfurling out of Chuck's hands and settling onto the path. One-thirty and Felix is still scribbling. The note drifts in. The note lands. Felix taps his quill on the ground. Felix offers a brief nod of his head, a dignified gesture, to Neil's guide. Chuck averts his gaze, avoiding contact. Now it's Neil's voice we hear announcing the notes. He circles the path, a confident, jaunty grin on his face, and overlaid on his actions we see the onlookers, hunched up on their stumps, and Felix's face, frowning, unfriendly."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a silent room, Eddie and Fats engage in a tense pool game. Fats confidently sinks multiple shots, dominating the play with fluid expertise. Eddie, initially unhappy, waits for his turn as the crowd at Ames quietly observes. As the game progresses, Fats continues to showcase his skill, receiving applause from the audience. By twelve o'clock, Fats commands the game, drawing admiration and respect, while Eddie sits back. When it's Eddie's turn, he regains composure, impressing the spectators with his difficult shots, which earns acknowledgment from Fats. As the game continues until one-thirty, Fats maintains his lead, but Eddie's confidence grows, evident as he calls out his shots with a cocky smile. As Eddie's turn progresses, the tension between him and Fats becomes palpable, with the audience watching intently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "we see the spectators hunched up in their chairs and Fats' face glowering hostile He circles the table a proud cocky smile on his face and superimposed over his movements we hear calling out the shots Now it is Eddie's voice Charlie looks away avoiding his eyes Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager Fats pounds his stick on the floor The shot goes in The shot rolls in Onethirty and Fats is still shooting Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table Charlie swallowing hard As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action It is twelve of the clock and Fats dominates the play Eddie slumps back in his seat as the crowd applauds Only the seven rolls slowly into the corner pocket The balls carom outward in all directions Fats slams the cue ball into the pack Big John looks around — the shot seems impossible Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack So Eddie does the same As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation The shot is a difficult one involving a combination of balls The shot goes in and he lines up another The crowd at Ames sits stolidly in their seats watching each player each move Eddie is up It is eleven of the clock Fats keeps sinking shots We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket The shot goes in As Eddie watches the prancing elegant Fats maneuvers around the table The shot goes in Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together Eddie sits down unhappily The table is now his Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket Fats walks around the table and peers at the balls Eddie looks up with a smile The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table Fats' ball hits the closer shoulder The balls roll down the table bank off the far shoulder and slowly return toward the two players In the silence of the room they bend over their cues and softly stroke out their shots"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table The shot goes in Only the seven rolls slowly into the corner pocket Charlie looks away avoiding his eyes The shot goes in and he lines up another we hear calling out the shots The balls carom outward in all directions Eddie looks up with a smile The shot rolls in Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack As Eddie watches the prancing elegant Fats maneuvers around the table As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action So Eddie does the same The shot goes in Fats slams the cue ball into the pack Fats pounds his stick on the floor Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager Onethirty and Fats is still shooting We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket Big John looks around — the shot seems impossible As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation It is twelve of the clock and Fats dominates the play Now it is Eddie's voice Charlie swallowing hard The shot is a difficult one involving a combination of balls Eddie is up we see the spectators hunched up in their chairs and Fats' face glowering hostile The shot goes in Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table In the silence of the room they bend over their cues and softly stroke out their shots Fats' ball hits the closer shoulder Eddie slumps back in his seat as the crowd applauds Fats walks around the table and peers at the balls Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket Eddie sits down unhappily Fats keeps sinking shots It is eleven of the clock The crowd at Ames sits stolidly in their seats watching each player each move The balls roll down the table bank off the far shoulder and slowly return toward the two players The table is now his He circles the table a proud cocky smile on his face and superimposed over his movements"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "So Eddie does the same Fats peers at the pack of balls huddled together then points to one that lies in the middle of the pack Big John looks around — the shot seems impossible Fats slams the cue ball into the pack The balls carom outward in all directions Only the seven rolls slowly into the corner pocket Eddie slumps back in his seat as the crowd applauds It is twelve of the clock and Fats dominates the play As he calls out the litany of his shots we see superimposed over his hands and his face and the sound of socking pool balls the spectators stupefied by the action Charlie swallowing hard Eddie looking on waiting to play and the bills endlessly unfolding out of Charlie's hands and floating onto the table Onethirty and Fats is still shooting The shot rolls in The shot goes in Fats pounds his stick on the floor Fats allows a perfunctory bow of his head a courtly gesture to Eddie's manager Charlie looks away avoiding his eyes Now it is Eddie's voice we hear calling out the shots He circles the table a proud cocky smile on his face and superimposed over his movements we see the spectators hunched up in their chairs and Fats' face glowering hostile In the silence of the room they bend over their cues and softly stroke out their shots The balls roll down the table bank off the far shoulder and slowly return toward the two players Fats' ball hits the closer shoulder The balls are returned and Eddie makes his break shot a glancing blow that leaves the pack of balls nearly intact and the white cue ball lying far away at the end of the table Eddie looks up with a smile Fats walks around the table and peers at the balls Placing his cigarette on the wooden rim of the table Fats rams the cue ball into the pack dropping the six ball into the pocket The table is now his Eddie sits down unhappily Fats plays quickly moving from shot to shot with studied authority his eyes and hands working fluidly together The shot goes in As Eddie watches the prancing elegant Fats maneuvers around the table The shot goes in We see Fats' bejeweled fingers curl around the cue stick the stick then darting out to send a ball caroming off a far bank and into a side pocket Fats keeps sinking shots It is eleven of the clock Eddie is up The crowd at Ames sits stolidly in their seats watching each player each move The shot goes in and he lines up another The shot is a difficult one involving a combination of balls As it rolls in the crowd breaks into applause and Fats bangs the butt of his cue stick on the floor to show his appreciation"
        }
      ]
    }
  ]
}