{
  "ground_truth": "The Assistant Brute takes the full force of the blow right in the chops. Two large tubs are present, one filled with steaming water, the other with icy water. Without a word, Fezzik stuffs Inigo's head into the icy water, then, after a reasonable amount of time, pulls him out, ducks him into the steaming stuff, and, a short time after that, puts him back in the cold again, then back in the hot. Then a wild look hits Inigo. Yellin enters and kneels, showing the key dangling from a chain around his neck. Just at that moment, Buttercup enters, and the Prince looks at her blankly for a moment. Buttercup stares at Humperdinck. With that, he whirls, turns on The Machine, and shoves the lever all the way up. There has never been such pain. A few children pale and bolt toward their parents. The Albino appears wheeling a barrow as Inigo's sword pushes at his chest. The Albino shakes his head, says nothing, and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail. The Albino drops without a sound. Inigo kneels, the sword held tight between his hands, eyes closed, facing the grove of trees, starting to talk with a low and strange voice. Now he rises, eyes still closed, as he walks forward, the great sword held in his hands. Fezzik, frightened, follows close behind, walking blind through the grove of trees. Inigo moves to the Secret Knot, hesitates, then moves past it, then stops. For a long moment, he stands frozen, suddenly whirls, eyes still closed, and the sword strikes home dead center into a knot, and nothing happens. He has failed. In utter despair, he collapses against the tree, against a knot in the tree, against the knot in the tree, which slides away, revealing the staircase. Fezzik and Inigo look at each other, then start down to Westley, dead by The Machine. Fezzik leans over him, listening for a heartbeat, then he looks at Inigo and shakes his head. For a moment, he just sags, terribly excited, and looks stronger than they've yet seen him, desperately fighting for control. Inigo, in despair, in the Pit, as before. They approach the door and knock. If Mel Brooks' 2000 Year Old Man was really old, he'd resemble this guy. Inigo pounds again, and the window is shut. They rap on the door. Inigo and Fezzik hurry inside, with Fezzik carrying Westley who is just starting to stiffen up a little.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Helper Brute receives the complete impact of the strike directly in the chops. Two large containers are present, one filled with steaming liquid, the other with frigid liquid. Without a word, Fezzik shoves Inigo's head into the frigid water, then, after a reasonable amount of time, pulls him out, plunges him into the steaming substance, and, a brief period later, places him back in the cold once more, then back in the hot. Then a wild expression hits Inigo. Yellin enters and kneels, displaying the key hanging from a chain around his neck. Just at that instant, Buttercup enters, and the Prince gazes at her blankly for a moment. Buttercup stares at Humperdinck. With that, he spins, activates The Machine, and pushes the lever entirely upward. There has never been such agony. A few children blanch and dash toward their parents. The Albino appears wheeling a cart as Inigo's blade presses at his torso. The Albino shakes his head, says nothing, and Fezzik smashes the Albino on the top of the head as if he had a mallet and was driving in a peg. The Albino collapses without a sound. Inigo kneels, the blade held tight between his hands, eyes shut, facing the grove of trees, beginning to speak with a low and peculiar voice. Now he rises, eyes still shut, as he strides forward, the great blade held in his hands. Fezzik, frightened, follows closely behind, walking blindly through the grove of trees. Inigo moves to the Secret Knot, pauses, then moves past it, then halts. For a long instant, he stands rigid, suddenly spins, eyes still shut, and the blade strikes home dead center into a knot, and nothing transpires. He has failed. In utter gloom, he collapses against the tree, against a knot in the tree, against the knot in the tree, which slides aside, revealing the stairway. Fezzik and Inigo gaze at each other, then start down to Westley, dead by The Machine. Fezzik bends over him, listening for a pulse, then he gazes at Inigo and shakes his head. For a moment, he just droops, terribly enthusiastic, and looks stronger than they've yet seen him, desperately battling for control. Inigo, in gloom, in the Pit, as before. They approach the entry and knock. If Mel Brooks' 2000 Year Old Man was really ancient, he'd resemble this fellow. Inigo pounds again, and the window is shut. They knock on the entry. Inigo and Fezzik hurry inside, with Fezzik carrying Westley who is just beginning to stiffen up a little."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The full force of the blow is taken right in the chops by the Assistant Brute. Two large tubs fill the room, one with steaming water and the other with icy water. Without a word, Inigo's head is stuffed into the icy water by Fezzik, then, after a reasonable amount of time, he pulls him out, ducks him into the steaming stuff, and, a short time after that, puts him back in the cold again, then back in the hot. Then Inigo is hit by a wild look. Yellin enters, kneeling and showing the key dangling from a chain around his neck. Just at that moment, Buttercup enters, and a blank look is given to her by the Prince for a moment. Humperdinck is stared at by Buttercup. With that, he whirls, turns on The Machine, and the lever is shoved all the way up by him. Such pain has never been felt. A few children pale and bolt toward their parents. Inigo's sword pushes at the Albino's chest as he appears wheeling a barrow. His head is shaken by the Albino, and nothing is said by him, so the Albino is crunched on the top of the head by Fezzik as if he had a hammer and was driving in a nail. Without a sound, the Albino drops. The sword is held tight between his hands by Inigo as he kneels, eyes closed, facing the grove of trees, and a low and strange voice is used by him to start talking. Now he rises, eyes still closed, as he walks forward, holding the great sword in his hands. Close behind follows Fezzik, frightened, walking blind through the grove of trees. The Secret Knot is moved to by Inigo, he hesitates, then past it moves, then stops. He stands frozen for a long moment, then suddenly whirls, eyes still closed, driving the sword dead center into a knot, and nothing happens. He has failed. In utter despair, a collapse against the tree occurs from him, against a knot in the tree, against the knot in the tree, which slides away, revealing the staircase. A look is exchanged between Fezzik and Inigo, then they start down to Westley, who is dead by The Machine. Over him, Fezzik leans, listening for a heartbeat, then looking at Inigo and shaking his head. Just sagging for a moment, terribly excited, he looks stronger than they've yet seen him, desperately fighting for control. In despair is Inigo, in the Pit, as before. The door is approached and knocked on by them. If Mel Brooks' 2000 Year Old Man was really old, this guy would resemble him. Again, the window is shut as Inigo pounds. On the door, they rap. Inside hurry Inigo and Fezzik, with Westley being carried by Fezzik who is just starting to stiffen up a little."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Assistant Brute endures the full impact of the blow. Two large tubs are present—one with steaming water and one with icy water. Silently, Fezzik plunges Inigo’s head into the icy water, then the hot, repeating the process. A wild look appears on Inigo's face. Yellin enters, kneeling with a key hanging around his neck. At that moment, Buttercup enters, and the Prince stares blankly at her. Buttercup gazes at Humperdinck, who turns on The Machine at full power, causing intense pain. Some children pale and rush to their parents. The Albino appears with a barrow as Inigo's sword points at him. Without speaking, Fezzik knocks the Albino unconscious. Inigo kneels, eyes closed, holding the sword, and begins to speak in a low voice. Rising, he walks with eyes closed, the sword in hand, followed by a frightened Fezzik. Inigo moves to the Secret Knot, hesitates, then strikes a knot in a tree with his sword, failing to trigger anything. In despair, he collapses against the tree, revealing a hidden staircase. Fezzik and Inigo exchange looks and descend to Westley, dead by The Machine. Fezzik checks for a heartbeat, then shakes his head at Inigo. Desperate, they approach and knock on the door, likening the man to Mel Brooks' 2000 Year Old Man. Inigo knocks again, but the window is shut. They continue knocking. Inigo and Fezzik rush inside, with Fezzik carrying Westley, who is starting to stiffen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Assistant Brute receives the full impact to the face. Two tubs are present: one with steaming, the other with icy water. Silently, Fezzik alternates Inigo's head between the tubs, first cold, then hot, and back again. A wild look appears on Inigo's face. Yellin enters, kneeling with a key around his neck. Buttercup enters, and the Prince gazes at her blankly. Buttercup stares at Humperdinck, who turns on The Machine to maximum. Pain is unprecedented, causing some children to flee. The Albino arrives with a barrow, Inigo's sword at his chest. He says nothing as Fezzik knocks him out like a hammer strike to a nail. Inigo kneels, sword gripped, eyes closed, speaking strangely, then rises as Fezzik follows blindly. Inigo reaches the Secret Knot, hesitates, then accidentally discovers a hidden staircase. Fezzik and Inigo head down to find Westley dead by The Machine. Fezzik listens for Westley’s heartbeat, shakes his head at Inigo, who collapses in despair. They knock on a door resembling Mel Brooks’ 2000 Year Old Man. Inigo knocks again; the window shuts. They enter with Fezzik carrying Westley, beginning to stiffen."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The formidable Assistant Brute takes the full, brutal force of the blow right in the chops, enduring the impact with remarkable fortitude. Present in the scene are two large tubs: one is filled with steaming, hot water, while the other contains icy, frigid water. Without uttering a single word, Fezzik stuffs Inigo’s head abruptly into the tub of icy water, and after a reasonable duration of time, pulls him out, only to plunge him into the steaming hot stuff. Shortly thereafter, he places him back into the cold water, then into the hot once more. Suddenly, a wild expression appears on Inigo’s face. At that very moment, Yellin enters the scene and kneels down, revealing the key dangling prominently from a chain around his neck. Just as this occurs, Buttercup enters the room, and the Prince looks at her with a blank, confused expression for a moment. Buttercup stands, staring intently at Humperdinck. With this, he whirls around dramatically, turns on The Machine, and shoves the lever all the way up. There has never been a pain quite like this. A few of the children in the vicinity turn pale, become visibly shaken, and quickly bolt toward their parents. The Albino appears, wheeling a barrow, as Inigo's sword presses insistently against his chest. The Albino shakes his head in silence, saying nothing, and without hesitation, Fezzik strikes the Albino on the top of the head as though he were wielding a hammer to drive in a nail. The Albino drops to the ground without making a sound. Inigo kneels reverently, holding the sword tightly between his hands, eyes closed, facing the grove of trees, and begins to speak with a low, strange voice. Rising up now, with his eyes remaining shut, he walks forward, carrying the great sword securely in his hands. Fezzik, feeling frightened, follows closely behind, navigating blindly through the grove of trees. Inigo moves toward the Secret Knot, hesitates for a brief moment, then moves past it before suddenly stopping. He stands frozen for a long moment, then abruptly whirls around, eyes still shut, and the sword strikes home dead center into a knot, yet nothing happens. He has utterly failed. In complete despair, he collapses against the tree, pressing against a knot in the tree which then slides away, revealing the hidden staircase. Fezzik and Inigo exchange a meaningful look, then start their descent to Westley, who appears to be dead, a victim of The Machine. Fezzik leans over Westley carefully, listening for any sign of a heartbeat, then looks at Inigo and shakes his head sadly. For a brief moment, he simply sags, appears terribly excited, and looks stronger than they've ever seen him, desperately fighting to maintain control. Inigo finds himself in despair, once again in the dark pit of emotion, just as before. They approach the door and knock with urgency. If Mel Brooks' 2000 Year Old Man were genuinely ancient, he would bear a striking resemblance to the man that appears. Inigo pounds on the door again, but the window is shut firmly. They rap insistently on the door once more. Inigo and Fezzik hurry inside quickly, with Fezzik carrying Westley, who is just starting to stiffen up slightly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The powerful and formidable Assistant Brute bravely confronts and absorbs the full, brutal force of the blow right in the chops, enduring the immense impact with astonishing fortitude and resolve. Present and prominent in the scene are two large tubs: one of these substantial containers is filled with steaming, scalding hot water, while the other is brimming with icy, frigidly cold water. Without uttering a single word, Fezzik swiftly stuffs Inigo’s head abruptly into the tub containing the icy water, and after a reasonable duration of time has passed, he pulls him out, only to plunge him into the steaming hot water. Shortly thereafter, he places him back into the cold water before promptly submerging him into the hot once more. Suddenly, a wild expression emerges on Inigo’s face. At that very moment, Yellin appears and enters the scene, kneeling down to reveal the key that dangles conspicuously from a chain hanging around his neck. Just as this transpires, Buttercup makes her entrance into the room, and the Prince looks at her with a blank, confused expression for a moment. Buttercup stands there, staring intently at Humperdinck. With this, he whirls around dramatically, turns on The Machine, and shoves the lever all the way up to its maximum setting. There has never been a pain quite like this in all the world. A few of the children in the vicinity turn pale, visibly shaken, and quickly bolt toward their parents in fear and distress. The Albino appears, wheeling a barrow, as Inigo's sword presses insistently against his chest. The Albino shakes his head in silence, saying nothing at all, and without the slightest hesitation, Fezzik strikes the Albino on the top of the head as though he were wielding a hammer to drive in a nail. The Albino drops to the ground without making a single sound. Inigo kneels reverently, holding the sword tightly between his hands, eyes closed, facing the grove of trees, and begins to speak with a low, strange voice that seems almost otherworldly. Rising up now, with his eyes remaining shut, he walks forward, carrying the great sword securely in his hands. Fezzik, feeling frightened and apprehensive, follows closely behind, navigating blindly through the grove of trees. Inigo moves toward the Secret Knot, hesitates for a brief moment, then moves past it before suddenly coming to a stop. He stands frozen in place for a long moment, then abruptly whirls around, eyes still shut, and the sword strikes home dead center into a knot, yet nothing happens. He has utterly failed in his endeavor. In complete despair, he collapses against the tree, pressing against a knot in the tree which then slides away, revealing the hidden staircase. Fezzik and Inigo exchange a meaningful look filled with understanding, then start their descent to Westley, who appears to be dead, a victim of the terrible Machine. Fezzik leans over Westley carefully, listening intently for any sign of a heartbeat, then looks at Inigo and shakes his head sadly. For a brief moment, he simply sags, appears terribly excited, and looks stronger than they've ever seen him, desperately fighting to maintain control. Inigo finds himself in utter despair, once again in the dark pit of emotion, just as before. They approach the door and knock with great urgency and determination. If Mel Brooks' 2000 Year Old Man were genuinely ancient, he would bear a striking resemblance to the man that appears. Inigo pounds on the door again, but the window is shut firmly and resolutely. They rap insistently on the door once more, undeterred. Inigo and Fezzik hurry inside quickly, with Fezzik carrying Westley, who is just starting to stiffen up slightly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Assistant Brute stands firm as the blow lands squarely on his face, absorbing its full impact without flinching. Nearby, two large tubs sit side by side, one filled with steaming hot water, the other with icy cold water. Fezzik, without uttering a single word, takes hold of Inigo's head and thrusts it into the tub of icy water. He keeps it submerged for what he deems a reasonable amount of time before extracting Inigo's head, allowing him a brief moment to catch his breath. Then, Fezzik quickly plunges Inigo's head into the steaming hot water. After allowing another short interval of time to pass, he retrieves Inigo's head from the hot water and submerges it once again into the icy cold. He repeats this alternating process, moving Inigo's head back into the hot water. Suddenly, a wild look overtakes Inigo's features. At this pivotal moment, Yellin enters the scene, kneeling down and revealing a key that dangles conspicuously from a chain around his neck. Just then, Buttercup enters, and the Prince momentarily gazes at her with a blank expression. Buttercup locks her gaze on Humperdinck. In an abrupt and decisive motion, Humperdinck whirls around, activating The Machine and thrusting the lever all the way up to its maximum setting. The excruciating pain that follows is unparalleled, causing a few children present to turn pale and rush toward their parents for comfort. The Albino then appears, methodically wheeling a barrow forward as Inigo's sword presses threateningly against his chest. The Albino, with a subdued gesture, shakes his head silently, causing Fezzik to respond by delivering a swift and forceful blow to the top of the Albino's head, resembling the action of a hammer driving a nail. The Albino topples to the ground without uttering a sound. Inigo then lowers himself to his knees, grasping the sword tightly between his hands, his eyes closed, as he faces a grove of trees and begins to speak in a low, strange voice. He rises to his feet, maintaining his closed eyes, and walks forward, holding the great sword steadily in his hands. Fezzik, filled with fear, follows closely behind, moving blindly through the grove of trees. Inigo approaches the Secret Knot, hesitates momentarily, and moves past it, then comes to an abrupt stop. He stands motionless for a prolonged moment, then suddenly whirls around, still with eyes closed, and strikes the sword dead center into the knot, yet nothing occurs, signaling his failure. Overcome with despair, he collapses against a tree, resting against a knot in the tree, inadvertently causing the knot to slide away and reveal a hidden staircase. Exchanging glances, Fezzik and Inigo begin their descent down the staircase to Westley, lying dead by The Machine. Fezzik leans over Westley's still form, straining to detect any sign of a heartbeat. Finding none, he turns to Inigo, shaking his head in silent confirmation of Westley's demise. Despite being overwhelmed with excitement, Fezzik struggles for composure, appearing stronger than ever before. Inigo, plunged into despair, remains in the Pit, as he had been before. Together, they approach a door and knock. The resemblance of the man inside to Mel Brooks' 2000 Year Old Man is uncanny, as though he were truly ancient. Inigo pounds on the door once more, but the window remains shut in response. Persisting, they rap on the door again. When it finally opens, Inigo and Fezzik hurry into the space, with Fezzik carefully carrying Westley, whose body is beginning to show early signs of stiffening."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fezzik takes the blow in silence and immerses Inigo alternately between icy and steaming water, prompting a wild reaction in Inigo. Yellin enters, presenting the key around his neck, just as Buttercup arrives and stares at an unresponsive Prince Humperdinck, who then abruptly activates The Machine, causing immense pain that frightens nearby children. The Albino arrives with a barrow, only to be silently knocked out by Fezzik. Inigo, with closed eyes, communicates with a mysterious force, guiding himself and a wary Fezzik blindly through a grove. He hesitates at the Secret Knot, strikes it unsuccessfully, and collapses in despair against a tree, inadvertently revealing a hidden staircase. Fezzik and Inigo exchange glances and descend to find Westley, lifeless. Fezzik checks for signs of life, shares his grim findings with Inigo, who is visibly shaken yet determined. They knock on an old man’s door multiple times. When it finally opens, Fezzik carries a stiffening Westley inside as they hurry through."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Assistant Brute, known for his immense strength and size, takes the full force of the blow right in the chops. Two large tubs are present, one filled with steaming water heated over an open flame, the other with icy water freshly drawn from a mountain spring. Without a word, Fezzik, who is a giant with a gentle heart despite his imposing appearance, stuffs Inigo's head into the icy water, then, after a reasonable amount of time to ensure Inigo is thoroughly shocked awake, pulls him out, ducks him into the steaming stuff, and, a short time after that, puts him back in the cold again, then back in the hot. Then, a wild look that denotes a sudden clarity or madness hits Inigo. Yellin, once the Chief of All Enforcement in the kingdom, enters and kneels, showing the key which is in charge of the castle's inner sanctum, dangling from a chain around his neck. Just at that moment, Buttercup, who is known throughout the land for her unparalleled beauty and is betrothed under duress to the Prince, enters, and the Prince, whose name is Humperdinck and who is known for his cunning but ruthless nature, looks at her blankly for a moment. Buttercup stares at Humperdinck with a mixture of fear and defiance. With that, he whirls, turns on The Machine, a torturous device designed to drain the life from its victim, and shoves the lever all the way up. There has never been such pain, reminiscent of ancient accounts of torture chambers in medieval times. A few children witnessing this pale and bolt toward their parents in terror. The Albino, a mute servant of the Prince, appears wheeling a barrow as Inigo's sword pushes at his chest. The Albino shakes his head, says nothing, and Fezzik, with his brute strength, crunches the Albino on the top of the head as if he had a hammer and was driving in a nail. The Albino drops without a sound. Inigo kneels, the sword held tight between his hands, eyes closed, facing the grove of trees known for its mystical and ancient presence, starting to talk with a low and strange voice as if invoking spirits. Now he rises, eyes still closed, as he walks forward, the great sword held in his hands, reminiscent of tales of warriors guided by intuition alone. Fezzik, frightened by this transformation, follows close behind, walking blind through the grove of trees. Inigo moves to the Secret Knot, a legendary spot among locals believed to hide great secrets, hesitates, then moves past it, then stops. For a long moment, he stands frozen, suddenly whirls, eyes still closed, and the sword strikes home dead center into a knot, and nothing happens. He has failed in his quest driven by personal vendetta. In utter despair, he collapses against the tree, against a knot in the tree, against the knot in the tree, which slides away, revealing the staircase rumored to lead to hidden chambers. Fezzik and Inigo look at each other, then start down to Westley, who lies apparently dead by The Machine's cruel efficiency. Fezzik leans over him, listening for a heartbeat, then he looks at Inigo and shakes his head solemnly. For a moment, he just sags, terribly excited, and looks stronger than they've yet seen him, desperately fighting for control over his emotions. Inigo, in despair, in the Pit, as before, recalls the legends of miraculous revivals. They approach the door and knock. If Mel Brooks' 2000 Year Old Man, a fictional character known for humorous yet insightful tales, was really old, he'd resemble this guy known as Miracle Max. Inigo pounds again, and the window is shut, a sign of caution and secrecy within. They rap on the door louder this time. Inigo and Fezzik hurry inside, with Fezzik carrying Westley who is just starting to stiffen up a little, an early sign of rigor mortis setting in."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Albino drops without a sound The Assistant Brute takes the full force of the blow right in the chops Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little Two large tubs are present one filled with steaming water the other with icy water Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot Then a wild look hits Inigo Yellin enters and kneels showing the key dangling from a chain around his neck Buttercup stares at Humperdinck Just at that moment Buttercup enters and the Prince looks at her blankly for a moment Two large tubs are present one filled with steaming water the other with icy water Buttercup stares at Humperdinck With that he whirls turns on The Machine and shoves the lever all the way up There has never been such pain Yellin enters and kneels showing the key dangling from a chain around his neck A few children pale and bolt toward their parents against the knot in the tree which slides away revealing the staircase The Albino appears wheeling a barrow as Inigo's sword pushes at his chest The Assistant Brute takes the full force of the blow right in the chops For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens Fezzik leans over him listening for a heartbeat The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail The Albino drops without a sound Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice Now he rises eyes still closed as he walks forward the great sword held in his hands Fezzik frightened follows close behind walking blind through the grove of trees Inigo moves to the Secret Knot hesitates then moves past it then stops For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens He has failed In utter despair he collapses against the tree against a knot in the tree Then a wild look hits Inigo Inigo moves to the Secret Knot hesitates then moves past it then stops against the knot in the tree which slides away revealing the staircase Fezzik and Inigo look at each other then start down to Westley dead by The Machine Fezzik leans over him listening for a heartbeat then he looks at Inigo and shakes his head For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control Inigo in despair in the Pit as before They approach the door and knock If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot Inigo pounds again and the window is shut With that he whirls turns on The Machine and shoves the lever all the way up Inigo pounds again and the window is shut They rap on the door They approach the door and knock They rap on the door Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Assistant Brute takes the full force of the blow right in the chops. Two large tubs are present one filled with steaming water the other with icy water. Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot. Then a wild look hits Inigo. Yellin enters and kneels showing the key dangling from a chain around his neck. Just at that moment Buttercup enters and the Prince looks at her blankly. for a moment. Buttercup stares at Humperdinck. With that he whirls turns on The Machine and shoves the lever all the way up. There has never been such pain. A few children pale and bolt toward their parents. The Albino appears wheeling a barrow as Inigo's sword pushes at his chest. The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail. The Albino drops without a sound. Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice. Now he rises eyes still closed as he walks forward the great sword held in his hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Fezzik frightened follows close behind walking blind through the grove of trees. Inigo moves to the Secret Knot hesitates then moves past it then stops. For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens. He has failed. In utter despair he collapses against the tree against a knot in the tree. against the knot in the tree which slides away revealing the staircase. Fezzik and Inigo look at each other then start down to Westley dead by The Machine. Fezzik leans over him listening for a heartbeat. then he looks at Inigo and shakes his head. For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control. Inigo in despair in the Pit as before. They approach the door and knock. If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy. Inigo pounds again and the window is shut. They rap on the door. Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Assistant Brute takes the full force of the blow right in the chops. Two large tubs are present one filled with steaming water the other with icy water. Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot. Then a wild look hits Inigo. Yellin enters and kneels showing the key dangling from a chain around his neck. Just at that moment Buttercup enters and the Prince looks at her blankly. for a moment. Buttercup stares at Humperdinck. With that he whirls turns on The Machine and shoves the lever all the way up. There has never been such pain. A few children pale and bolt toward their parents. The Albino appears wheeling a barrow as Inigo's sword pushes at his chest. The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail. The Albino drops without a sound. Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice. Now he rises eyes still closed as he walks forward the great sword held in his hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Fezzik frightened follows close behind walking blind through the grove of trees. Inigo moves to the Secret Knot hesitates then moves past it then stops. For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens. He has failed. In utter despair he collapses against the tree against a knot in the tree. against the knot in the tree which slides away revealing the staircase. Fezzik and Inigo look at each other then start down to Westley dead by The Machine. Fezzik leans over him listening for a heartbeat. then he looks at Inigo and shakes his head. For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control. Inigo in despair in the Pit as before. They approach the door and knock. If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy. Inigo pounds again and the window is shut. They rap on the door. Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Assistant Brute takes the full force of the blow right in the chops. Two large tubs are present one filled with steaming water the other with icy water. Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot. Then a wild look hits Inigo. Yellin enters and kneels showing the key dangling from a chain around his neck. Just at that moment Buttercup enters and the Prince looks at her blankly. for a moment. Buttercup stares at Humperdinck. then he looks at Inigo and shakes his head. For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control. Inigo in despair in the Pit as before. They approach the door and knock. If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy. Inigo pounds again and the window is shut. They rap on the door. Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Assistant Brute takes the full force of the blow right in the chops. Two large tubs are present one filled with steaming water the other with icy water. Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot. Then a wild look hits Inigo. Inigo pounds again and the window is shut. They rap on the door. Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The Elephant Brute takes the full force of the blow right in the chops. Two large tubs are present, one filled with steaming water, the other with icy water. Without a word, the Giraffe stuffs the Zebra's head into the icy water, then, after a reasonable amount of time, pulls him out, ducks him into the steaming stuff, and, a short time after that, puts him back in the cold again, then back in the hot. Then a wild look hits the Zebra. The Kangaroo enters and kneels, showing the key dangling from a chain around his neck. Just at that moment, the Dolphin enters, and the Tiger looks at her blankly for a moment. The Dolphin stares at the Hippopotamus. With that, he whirls, turns on The Machine, and shoves the lever all the way up. There has never been such pain. A few children pale and bolt toward their parents. The Penguin appears wheeling a barrow as the Zebra's sword pushes at his chest. The Penguin shakes his head, says nothing, and the Giraffe crunches the Penguin on the top of the head as if he had a hammer and was driving in a nail. The Penguin drops without a sound. The Zebra kneels, the sword held tight between his hands, eyes closed, facing the grove of trees, starting to talk with a low and strange voice. Now he rises, eyes still closed, as he walks forward, the great sword held in his hands. The Giraffe, frightened, follows close behind, walking blind through the grove of trees. The Zebra moves to the Secret Knot, hesitates, then moves past it, then stops. For a long moment, he stands frozen, suddenly whirls, eyes still closed, and the sword strikes home dead center into a knot, and nothing happens. He has failed. In utter despair, he collapses against the tree, against a knot in the tree, against the knot in the tree, which slides away, revealing the staircase. The Giraffe and the Zebra look at each other, then start down to the Rhino, dead by The Machine. The Giraffe leans over him, listening for a heartbeat, then he looks at the Zebra and shakes his head. For a moment, he just sags, terribly excited, and looks stronger than they've yet seen him, desperately fighting for control. The Zebra, in despair, in the Pit, as before. They approach the door and knock. If Mel Brooks' 2000 Year Old Man was really old, he'd resemble this guy. The Zebra pounds again, and the window is shut. They rap on the door. The Zebra and the Giraffe hurry inside, with the Giraffe carrying the Rhino who is just starting to stiffen up a little."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Assistant Brute takes the full force of the blow right in the chops. Two large bowls are present, one filled with bubbling lava, the other with frosty lemonade. Without a word, Fezzik stuffs Inigo's head into the frosty lemonade, then, after a reasonable amount of time, pulls him out, ducks him into the bubbling stuff, and, a short time after that, puts him back in the cold again, then back in the hot. Then a wild look hits Inigo. Yellin enters and kneels, showing the key dangling from a ribbon around his wrist. Just at that moment, Buttercup enters, and the Prince looks at her blankly for a moment. Buttercup stares at Humperdinck. With that, he whirls, turns on The Contraption, and shoves the lever all the way up. There has never been such agony. A few children pale and bolt toward their guardians. The Albino appears wheeling a cart as Inigo's spear pushes at his chest. The Albino shakes his head, says nothing, and Fezzik crunches the Albino on the top of the head as if he had a mallet and was driving in a screw. The Albino drops without a sound. Inigo kneels, the spear held tight between his hands, eyes closed, facing the hill of stones, starting to talk with a low and strange voice. Now he rises, eyes still closed, as he walks forward, the great spear held in his hands. Fezzik, frightened, follows close behind, walking blind through the hill of stones. Inigo moves to the Secret Latch, hesitates, then moves past it, then stops. For a long moment, he stands frozen, suddenly whirls, eyes still closed, and the spear strikes home dead center into a latch, and nothing happens. He has failed. In utter despair, he collapses against the rock, against a latch in the rock, against the latch in the rock, which slides away, revealing the stairwell. Fezzik and Inigo look at each other, then start down to Westley, dead by The Contraption. Fezzik leans over him, listening for a heartbeat, then he looks at Inigo and shakes his head. For a moment, he just sags, terribly excited, and looks stronger than they've yet seen him, desperately fighting for control. Inigo, in despair, in the Cavern, as before. They approach the flap and knock. If Mel Brooks' 2000 Year Old Man was really old, he'd resemble this figure. Inigo pounds again, and the curtain is shut. They rap on the flap. Inigo and Fezzik hurry inside, with Fezzik carrying Westley who is just starting to stiffen up a little."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Assistant Brute absorbs the full force of the blow right in the chops. Two large tubs are present, one filled with steaming water, the other with icy water. Without a word, Fezzik juggles Inigo's head above the icy water, then, after a reasonable amount of time, dangles him over, bounces him into the steaming stuff, and, a short time after that, spins him back over the cold again, then back over the hot. Then a wild look overtakes Inigo. Yellin enters and crouches, flaunting the key dangling from a chain around his neck. Just at that moment, Buttercup enters, and the Prince squints at her blankly for a moment. Buttercup glares at Humperdinck. With that, he spins, flips on The Machine, and yanks the lever all the way up. There has never been such chaos. A few children giggle and dart toward their parents. The Albino appears pushing a wheelbarrow as Inigo's sword gestures at his chest. The Albino nods his head, remains silent, and Fezzik taps the Albino on the top of the head as if he had a wand and was casting a spell. The Albino flops without a sound. Inigo sits, the sword gripped tight between his hands, eyes closed, facing the grove of trees, beginning to hum with a low and strange tone. Now he stands, eyes still closed, as he glides forward, the great sword cradled in his hands. Fezzik, curious, follows close behind, wandering sightless through the grove of trees. Inigo approaches the Secret Knot, pauses, then glides past it, then halts. For a long moment, he stands dazed, suddenly spins, eyes still closed, and the sword grazes the air near a knot, and nothing happens. He has faltered. In utter confusion, he leans against the tree, against a knot in the tree, against the knot in the tree, which slides away, unveiling the staircase. Fezzik and Inigo glance at each other, then descend to Westley, deceased by The Machine. Fezzik bends over him, eavesdropping for a heartbeat, then he glances at Inigo and nods. For a moment, he just droops, terribly eager, and appears stronger than they've yet seen him, fiercely fighting for control. Inigo, in confusion, in the Pit, as before. They approach the door and tap. If Mel Brooks' 2000 Year Old Man was really ancient, he'd resemble this guy. Inigo taps again, and the window is locked. They knock on the door. Inigo and Fezzik rush inside, with Fezzik dragging Westley who is just beginning to loosen up a little."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Umbrella Moose takes the full force of the blow right in the pizza. Two large chairs are present, one filled with steaming soda, the other with icy milk. Without a word, Donkey stuffs Lighthouse's elbow into the icy milk, then, after a reasonable amount of time, pulls it out, ducks it into the steaming stuff, and, a short time after that, puts it back in the cold again, then back in the hot. Then a wild look hits Lighthouse. Cactus enters and kneels, showing the shoe dangling from a ribbon around its toe. Just at that moment, Pancake enters, and the President looks at it blankly for a moment. Pancake stares at Raspberry. With that, it whirls, turns on The Bicycle, and shoves the lever all the way up. There has never been such joy. A few clouds darken and sail toward their windows. The Ferret appears wheeling a suitcase as Lighthouse's hat pushes at its knee. The Ferret shakes its whiskers, says nothing, and Donkey crunches the Ferret on the top of the hat as if it had a spoon and was painting a wall. The Ferret drops without a sound. Lighthouse kneels, the hat held tight between its fingers, eyes closed, facing the pile of stones, starting to talk with a low and strange bark. Now it rises, eyes still closed, as it walks forward, the great hat held in its fingers. Donkey, terrified, follows close behind, walking blind through the pile of stones. Lighthouse moves to the Secret Bell, hesitates, then moves past it, then stops. For a long moment, it stands frozen, suddenly whirls, eyes still closed, and the hat strikes home dead center into a ripple, and nothing happens. It has succeeded. In utter relief, it collapses against the wall, against a ripple in the wall, against the ripple in the wall, which slides away, revealing the escalator. Donkey and Lighthouse look at each other, then start down to Pancake, silent by The Bicycle. Donkey leans over it, listening for a melody, then it looks at Lighthouse and shakes its mane. For a moment, it just sags, terribly enthusiastic, and looks messier than they've yet seen it, desperately fighting for control. Lighthouse, in ecstasy, in the Hill, as before. They approach the gate and ring. If Steven Spielberg's 2000 Year Old Chair was really ancient, he'd resemble this cup. Lighthouse pounds again, and the curtain is shut. They tap on the gate. Lighthouse and Donkey hurry inside, with Donkey carrying Pancake who is just starting to freeze up a little."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Assistant Tinker absorbs the full impact of the gust right in the antennae. Two large jugs are present, one filled with steaming cocoa, the other with icy lemonade. Without a word, Vizzini slips Buttercup's foot into the icy lemonade, then, after a reasonable amount of time, lifts her out, dips her toes into the steaming cocoa, and, a short time after that, plunges her back in the cold again, then back in the hot. Then a frantic look overtakes Buttercup. Max enters and squats, revealing the ring dangling from a thread around his wrist. Just at that moment, Inigo enters, and the Count gazes at him blankly for a moment. Inigo gazes at Rugen. With that, he pivots, activates The Contraption, and yanks the switch all the way down. There has never been such chaos. A few puppies recoil and scamper toward their handlers. The Sage appears rolling a trolley as Fezzik's dagger taps at his chest. The Sage nods his head, says nothing, and Vizzini nibbles the Sage on the top of the head as if he had a toothpick and was teasing out a morsel. The Sage slumps without a sound. Buttercup squats, the dagger clasped tight between her fingers, eyes open, facing the grove of bushes, starting to hum with a high and strange pitch. Now she rises, eyes still open, as she tiptoes forward, the great dagger grasped in her fingers. Vizzini, suspicious, tags along close behind, stumbling blind through the grove of bushes. Buttercup inches toward the Secret Path, hesitates, then inches past it, then hesitates. For an endless moment, she stands steadfast, suddenly pivots, eyes still open, and the dagger stabs deep dead center into a path, and nothing changes. She has miscalculated. In total frustration, she slumps against the bush, against a path in the bush, against the path in the bush, which swings away, revealing the tunnel. Vizzini and Buttercup glance at each other, then descend toward Max, incapacitated by The Contraption. Vizzini leans over him, listening for a tune, then he glances at Buttercup and nods his head. For a moment, he just slumps, remarkably inspired, and appears tougher than they've yet observed him, eagerly wrestling for mastery. Buttercup, in frustration, in the Pit, as earlier. They near the gate and tap. If Terry Gilliam's Monty Python Knight was truly ancient, he'd mimic this figure. Buttercup taps again, and the portal is closed. They knock on the gate. Buttercup and Vizzini rush inward, with Vizzini supporting Max who is just beginning to solidify a little."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Assistant Brute absorbs the full brunt of the gust right in the noggin. Two large baskets are present, one filled with bubbling sand, the other with frosted sand. Without a word, Fezzik inserts Inigo's head into the frosted sand, then, after an adequate lapse of time, lifts him out, plunges him into the bubbling substance, and, a brief period after that, dips him back in the chill again, then back in the warm. Then an erratic expression overtakes Inigo. Yellin enters and squats, presenting the lock dangling from a thread around his neck. Just at that moment, Buttercup enters, and the Prince gazes at her blankly for an instant. Buttercup glares at Humperdinck. With that, he twirls, turns on The Contraption, and pushes the knob all the way up. There has never been such agony. A few infants blanch and sprint toward their guardians. The Albino appears pushing a cart as Inigo's baton nudges at his torso. The Albino shakes his head, says nothing, and Fezzik taps the Albino on the top of the head as if he had a mallet and was tapping in a peg. The Albino falls without a sound. Inigo squats, the baton gripped firmly between his palms, eyes shut, facing the clearing of bushes, commencing to speak with a low and peculiar voice. Now he ascends, eyes still shut, as he marches forward, the grand baton held in his hands. Fezzik, alarmed, trails closely behind, pacing blindly through the clearing of bushes. Inigo approaches the Hidden Knot, wavers, then advances past it, then halts. For a lengthy moment, he stands immobile, suddenly spins, eyes still shut, and the baton strikes directly into a knot, and nothing transpires. He has failed. In total despair, he collapses against the bush, against a knot in the bush, against the knot in the bush, which slides away, revealing the ladder. Fezzik and Inigo glance at each other, then start down to Westley, lifeless by The Contraption. Fezzik leans over him, listening for a pulse, then he looks at Inigo and shakes his head. For a moment, he just deflates, terribly thrilled, and appears stronger than they've yet seen him, fiercely battling for composure. Inigo, in despair, in the Hollow, as before. They approach the portal and tap. If Mel Brooks' 2000 Year Old Man was genuinely ancient, he'd resemble this fellow. Inigo pounds again, and the shutter is closed. They tap on the portal. Inigo and Fezzik dash inside, with Fezzik carrying Westley who is just beginning to firm up a little."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Wanderer Goblin absorbs the entire impact of the gust right on the whiskers. Two enormous crates are present, one filled with bubbling oil, the other with frosty soup. Without a peep, Gimli plunges Faramir's feet into the frosty soup, then, after a reasonable stretch of time, hauls him out, submerges him into the bubbling liquid, and, a short while later, plunges him back into the chilly again, then back into the boiling. Then a wild smirk hits Faramir. Meriadoc enters and bows, flaunting the bell jingling from a string around his wrist. Just at that instant, Eowyn enters, and the King gawks at her dully for a second. Eowyn glances at Théoden. With that, he spins, switches on The Contraption, and cranks the dial all the way up. There has never been such torment. A few cats blanch and dash toward their offspring. The Butcher emerges wheeling a cart as Faramir's spear nudges at his foot. The Butcher nods his head, utters nothing, and Gimli thumps the Butcher on the back of the heel as if he had a club and was nailing in a peg. The Butcher drops without a peep. Faramir kneels, the spear grasped tightly between his fingers, eyes shut, facing the meadow of bushes, beginning to chant with a soft and peculiar tone. Now he rises, eyes still shut, as he shuffles forward, the huge spear held in his grip. Gimli, anxious, trails close behind, wandering aimlessly through the meadow of bushes. Faramir slides to the Hidden Switch, pauses, then slides past it, then halts. For a lengthy instant, he stands rigid, suddenly spins, eyes still shut, and the spear pierces home dead center into a switch, and nothing happens. He has flopped. In sheer hopelessness, he collapses against the shrub, against a switch on the shrub, against the switch on the shrub, which swivels away, revealing the tunnel. Gimli and Faramir gaze at one another, then descend toward Boromir, silent by The Contraption. Gimli leans over him, straining for a pulse, then he glances at Faramir and nods his head. For a second, he merely slumps, overwhelmingly jubilant, and appears more formidable than they've ever observed him, determinedly battling for composure. Faramir, in hopelessness, in the Hollow, as before. They approach the gateway and tap. If Steve Martin's 1000-Year-Old Elf was truly ancient, he'd mirror this fellow. Faramir pounds once more, and the hatch is secured. They knock on the entrance. Faramir and Gimli rush inside, with Gimli toting Boromir who is just commencing to tense up a tad."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Assistant Brute is knocked out with a blow. Fezzik alternates dunking Inigo's head between icy and steaming water, prompting a wild look from Inigo. Yellin enters showing a key, while Buttercup arrives to a blank stare from the Prince who turns on The Machine, causing immense pain. A few children run to their parents. The Albino appears, and Fezzik knocks him out. Inigo, eyes closed, walks with his sword, supported by a frightened Fezzik. Inigo, thinking he failed, despairingly leans against a tree knot, which reveals a staircase to Westley, dead from The Machine. Fezzik listens for Westley's heartbeat, shakes his head, and looks stronger, trying to control his emotions. In despair in the Pit, Inigo and Fezzik knock on a door, entering with Westley, who starts to stiffen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little They rap on the door Inigo pounds again and the window is shut If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy They approach the door and knock Inigo in despair in the Pit as before For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control then he looks at Inigo and shakes his head Fezzik leans over him listening for a heartbeat Fezzik and Inigo look at each other then start down to Westley dead by The Machine against the knot in the tree which slides away revealing the staircase In utter despair he collapses against the tree against a knot in the tree He has failed For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens Inigo moves to the Secret Knot hesitates then moves past it then stops Fezzik frightened follows close behind walking blind through the grove of trees Now he rises eyes still closed as he walks forward the great sword held in his hands Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice The Albino drops without a sound The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail The Albino appears wheeling a barrow as Inigo's sword pushes at his chest A few children pale and bolt toward their parents There has never been such pain With that he whirls turns on The Machine and shoves the lever all the way up Buttercup stares at Humperdinck for a moment Just at that moment Buttercup enters and the Prince looks at her blankly Yellin enters and kneels showing the key dangling from a chain around his neck Then a wild look hits Inigo Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot Two large tubs are present one filled with steaming water the other with icy water The Assistant Brute takes the full force of the blow right in the chops"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Inigo in despair in the Pit as before Just at that moment Buttercup enters and the Prince looks at her blankly A few children pale and bolt toward their parents Now he rises eyes still closed as he walks forward the great sword held in his hands For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control The Albino appears wheeling a barrow as Inigo's sword pushes at his chest Fezzik and Inigo look at each other then start down to Westley dead by The Machine for a moment He has failed The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail Fezzik frightened follows close behind walking blind through the grove of trees There has never been such pain If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice then he looks at Inigo and shakes his head In utter despair he collapses against the tree against a knot in the tree They rap on the door Two large tubs are present one filled with steaming water the other with icy water The Albino drops without a sound For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot Inigo moves to the Secret Knot hesitates then moves past it then stops against the knot in the tree which slides away revealing the staircase Then a wild look hits Inigo Inigo pounds again and the window is shut Yellin enters and kneels showing the key dangling from a chain around his neck They approach the door and knock Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little With that he whirls turns on The Machine and shoves the lever all the way up Fezzik leans over him listening for a heartbeat The Assistant Brute takes the full force of the blow right in the chops Buttercup stares at Humperdinck"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fezzik frightened follows close behind walking blind through the grove of trees Inigo moves to the Secret Knot hesitates then moves past it then stops For a long moment he stands frozen suddenly whirls eyes still closed and the sword strikes home dead center into a knot and nothing happens He has failed In utter despair he collapses against the tree against a knot in the tree against the knot in the tree which slides away revealing the staircase Fezzik and Inigo look at each other then start down to Westley dead by The Machine Fezzik leans over him listening for a heartbeat then he looks at Inigo and shakes his head For a moment he just sags terribly excited and looks stronger than they have yet seen him desperately fighting for control Inigo in despair in the Pit as before They approach the door and knock If Mel Brooks' 2000 Year Old Man was really old he would resemble this guy Inigo pounds again and the window is shut They rap on the door Inigo and Fezzik hurry inside with Fezzik carrying Westley who is just starting to stiffen up a little The Assistant Brute takes the full force of the blow right in the chops Two large tubs are present one filled with steaming water the other with icy water Without a word Fezzik stuffs Inigo's head into the icy water then after a reasonable amount of time pulls him out ducks him into the steaming stuff and a short time after that puts him back in the cold again then back in the hot Then a wild look hits Inigo Yellin enters and kneels showing the key dangling from a chain around his neck Just at that moment Buttercup enters and the Prince looks at her blankly for a moment Buttercup stares at Humperdinck With that he whirls turns on The Machine and shoves the lever all the way up There has never been such pain A few children pale and bolt toward their parents The Albino appears wheeling a barrow as Inigo's sword pushes at his chest The Albino shakes his head says nothing and Fezzik crunches the Albino on the top of the head as if he had a hammer and was driving in a nail The Albino drops without a sound Inigo kneels the sword held tight between his hands eyes closed facing the grove of trees starting to talk with a low and strange voice Now he rises eyes still closed as he walks forward the great sword held in his hands"
        }
      ]
    }
  ]
}