{
  "ground_truth": "A low terrible groan begins to rise up out of her throat, and a hand comes into the shot holding an enormous bread knife. Over it, the brief gulps of screaming can be heard, followed by the dreadful thump as Mary's body falls in the tub. Above the shower-bar, the bathroom door opens again, and after a moment, the sound of the front door slamming is heard. Lying half in, half out of the tub, her head is tumbled over, touching the floor with her hair wet, one eye wide open as if popped, and one arm lying limp and wet along the tile floor. Coming down the side of the tub, many small threads of blood run thick and dark along the porcelain. The camera follows away from the body, travels slowly across the bathroom, past the toilet, and out into the bedroom. As the camera approaches the bed, the folded newspaper is seen as Mary placed it on the bedside table beside the bed. The camera moves over to the window and looks up at the house, and as it gets there, Norman's fearful, shocked voice is heard coming from within the house. She stops, the anxiety and fear building up in her, eyes beginning to fill with worried tears. Sam studies her for a moment, then turns and calls. Bob gets the message and goes out through the back way. Sam goes closer to Lila, speaking with soft seriousness. Arbogast studies it, then speaks, nods, takes down the closed-for-lunch sign, sails it to the counter, opens the door, and goes out into the street. Norman is holding the door open, so Arbogast walks in. Norman switches on the overhead light, starts for the linen closet, suddenly pauses, turns, and studies Arbogast, who has remained standing by the door. He waits a moment, then opens the closet, starts counting out sheets and pillowcases, keeping his back to Arbogast. Arbogast takes a photograph out of his pocket, talks as he crosses to Norman. Norman glances briefly, turns away, and lifts sheets and pillowcases off the shelf, holding them close, almost protectively. He goes to the wall, flips a light switch, takes a slip of paper out of his pocket, and lays it beside the signature in the registry book, nodding and smiling nicely, as if this discovery will make Norman as happy as it is making him. Arbogast has reached him, picture extended, and Norman looks dutifully at it. Norman becomes apprehensive, starts towards Arbogast, forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. Norman looks up, studies the man's face, his own face showing apprehension. As he turns the car out, his headlights light up the porch.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A low dreadful moan starts to ascend from her throat, and a hand enters into the scene clutching a massive bread knife. Above it, the brief gasps of shrieking can be detected, followed by the dire thud as Mary's form collapses in the tub. Over the shower-bar, the bathroom door opens again, and after a moment, the noise of the front door banging is audible. Lying partially in, partially out of the tub, her head is slumped over, touching the ground with her hair damp, one eye wide open as if bulged, and one arm lying limp and moist along the tile ground. Descending down the side of the tub, numerous small streams of blood run dense and somber along the porcelain. The camera follows away from the figure, travels slowly across the bathroom, past the toilet, and out into the bedroom. As the camera nears the bed, the folded newspaper is visible as Mary laid it on the bedside table next to the bed. The camera shifts over to the window and looks up at the house, and as it arrives there, Norman's anxious, stunned voice is heard emanating from within the house. She halts, the unease and dread accumulating in her, eyes starting to fill with troubled tears. Sam observes her for a moment, then turns and calls. Bob receives the message and exits through the back way. Sam moves nearer to Lila, speaking with gentle gravity. Arbogast examines it, then speaks, nods, takes down the closed-for-lunch sign, tosses it to the counter, opens the door, and steps out into the street. Norman is maintaining the door open, so Arbogast enters. Norman activates the overhead light, starts for the linen closet, abruptly stops, turns, and examines Arbogast, who has stayed standing by the door. He waits a moment, then opens the closet, starts enumerating sheets and pillowcases, keeping his back to Arbogast. Arbogast takes a snapshot out of his pocket, talks as he crosses to Norman. Norman glances briefly, turns away, and picks up sheets and pillowcases off the shelf, holding them close, nearly protectively. He goes to the wall, flips a light switch, takes a slip of paper out of his pocket, and places it beside the signature in the registry book, nodding and smiling pleasantly, as if this revelation will make Norman as pleased as it is making him. Arbogast has reached him, picture extended, and Norman looks obediently at it. Norman becomes uneasy, starts towards Arbogast, forcing himself to remain composed and amiable. Arbogast turns and gazes earnestly at him. Norman looks up, examines the man's face, his own face showing unease. As he turns the car out, his headlights illuminate the porch."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A low terrible groan is begun to rise up out of her throat, and an enormous bread knife is held in a hand that comes into the shot. Over it, brief gulps of screaming are heard, followed by the dreadful thump as Mary's body is seen falling in the tub. Above the shower-bar, the bathroom door is opened again, and after a moment, someone hears the sound of the front door slamming. Lying half in, half out of the tub, her head is tumbled over, touching the floor with her hair wet, one eye wide open as if popped, and one arm lies limp and wet along the tile floor. Coming down the side of the tub, many small threads of blood are seen running thick and dark along the porcelain. The camera is followed away from the body, slowly travels across the bathroom, past the toilet, and goes out into the bedroom. As the camera approaches the bed, Mary is seen to have placed the folded newspaper on the bedside table beside the bed. The camera is moved over to the window and looks up at the house, and as it gets there, Norman's fearful, shocked voice comes from within the house. She stops, as anxiety and fear are built up in her, eyes beginning to fill with worried tears. Sam studies her for a moment, then turns and calls. The message is received by Bob, who goes out through the back way. Sam goes closer to Lila, speaking with soft seriousness. Arbogast studies it, then speaks, nods, takes down the closed-for-lunch sign, sails it to the counter, opens the door, and goes out into the street. The door is held open by Norman, so Arbogast walks in. The overhead light is switched on by Norman, who starts for the linen closet, suddenly pauses, turns, and studies Arbogast, who has remained standing by the door. He waits a moment, then the closet is opened, sheets and pillowcases are counted out, with his back kept to Arbogast. Out of his pocket, Arbogast takes a photograph, talks as he crosses to Norman. Norman briefly glances, turns away, and sheets and pillowcases are lifted off the shelf by him, holding them close, almost protectively. He goes to the wall, flips a light switch, takes a slip of paper out of his pocket, and lays it beside the signature in the registry book, nodding and smiling nicely, as if this discovery will make Norman as happy as it makes him. Arbogast has reached him, picture extended, and Norman looks dutifully at it. Norman becomes apprehensive, starts towards Arbogast, forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. The man's face is studied by Norman, who looks up, his own face showing apprehension. As he turns the car out, the porch is lit up by his headlights."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A dreadful groan emerges from her throat as a hand holding a large bread knife appears. Brief screams follow, ending with a thud as Mary's body collapses in the tub. The bathroom door opens, and the front door slams shut. Lying half in the tub, her head hangs over, hair wet, one eye wide open, and an arm limp on the tile. Blood trickles down the tub. The camera pans across the bathroom, past the toilet, into the bedroom, revealing a folded newspaper on the bedside table. Moving to the window, Norman's shocked voice is heard. Anxiety and fear fill her as tears form. Sam assesses her, calls Bob, who exits through the back. Sam approaches Lila, speaking seriously. Arbogast studies something, nods, removes the closed-for-lunch sign, exits to the street. Norman holds the door open for Arbogast, and turns on the light, heading for the linen closet, pausing to study Arbogast by the door. He opens the closet, counts sheets, hiding his actions from Arbogast. Arbogast shows a photograph to Norman, who glances, turns away, and holds sheets protectively. Norman flips a light switch, places a slip of paper by a signature in the registry, smiling. Arbogast reaches him with the photo, Norman looks apprehensive, walking towards Arbogast, trying to stay calm. Arbogast gazes seriously at him, Norman studies his face with apprehension. As he turns the car out, its headlights illuminate the porch."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A terrible groan escapes Mary's throat as a hand with a large bread knife appears, accompanied by brief screams and a thud when her body falls in the tub. The bathroom door opens, and the front door slams. Lying half in the tub, her wet hair touches the floor, one eye wide open, and an arm limp on the tile. Blood runs thick down the tub's side. The camera pans across the bathroom, past the toilet, into the bedroom, showing a folded newspaper Mary left on the bedside table. Moving to the window, it captures the house, and Norman's fearful voice is heard. Her anxiety builds with tears. Sam observes her, turns, and calls Bob, who exits through the back. Sam approaches Lila, speaking seriously. Arbogast removes the closed-for-lunch sign and enters the street. Norman holds the door for Arbogast, turns on the light, heads to the linen closet, pauses, and studies Arbogast. He counts sheets, his back to Arbogast, who shows a photograph. Norman glances at it, returns to the sheets, and slips paper beside the registry book signature, smiling. Arbogast extends the picture; Norman looks at it, becomes apprehensive but stays calm. Arbogast turns, studying Norman’s apprehensive face. As he drives off, the car headlights illuminate the porch."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A low, terrible groan, deep and haunting, begins to rise ominously from the depths of her throat, and suddenly, a hand appears in the shot, clutching an enormous, intimidating bread knife. Over this chilling scene, brief, frantic gulps of screaming can be heard echoing sharply, followed by the dreadful, sickening thump as Mary's lifeless body collapses with a haunting finality into the tub. Above the shower-bar, the bathroom door creaks open again, and after a moment, the unsettling sound of the front door slamming reverberates through the house. Mary lies there, half in and half out of the tub, her head awkwardly tumbled over, with her wet hair touching the floor, one eye disturbingly wide open, as if popped in shock, and one arm lying limply, drenched, along the cold tile floor. Running down the side of the tub, numerous small threads of blood flow thick and darkly along the gleaming porcelain. The camera slowly moves away from the tragic scene, gliding across the bathroom, past the toilet, and ventures out into the adjacent bedroom. As the camera makes its way towards the bed, it captures the folded newspaper, just as Mary had placed it on the bedside table next to the bed. The camera then shifts its focus to the window and looks up at the house, and as it arrives there, Norman's terrified, shocked voice pierces the silence, emanating from within the house. In that moment, she halts abruptly, anxiety and fear mounting within her, her eyes beginning to well up with worried tears. Sam observes her intently for a brief moment, then decisively turns and calls out. Bob, receiving the message, promptly exits through the back way, disappearing quickly. Sam moves closer to Lila, speaking to her with a calm, soft seriousness. Meanwhile, Arbogast examines it thoughtfully, then speaks, nods, and swiftly removes the closed-for-lunch sign, tossing it onto the counter with ease, before opening the door and stepping out into the bustling street. Norman is there, holding the door open, allowing Arbogast to walk in. Norman flicks on the overhead light, heading towards the linen closet, but suddenly, he pauses, turns back, and studies Arbogast, who remains standing by the door. After a brief moment, he proceeds to open the closet and starts counting out sheets and pillowcases, deliberately keeping his back turned to Arbogast. Arbogast then takes a photograph from his pocket, speaking as he crosses over to Norman. Norman glances at it briefly before turning away and lifts the sheets and pillowcases off the shelf, clutching them close, almost protectively. He walks to the wall, casually flips a light switch, takes a slip of paper out of his pocket, and places it beside the signature in the registry book, nodding and smiling nicely, as if this discovery brings him joy akin to what Norman might feel. Arbogast reaches him, extending the photograph, and Norman looks at it dutifully. Norman becomes visibly apprehensive and cautiously starts towards Arbogast, forcing himself to maintain a façade of calmness and cheerfulness. Arbogast turns, gazing at him with serious intent. Norman looks up, studying the man's face, his own face betraying a sense of unease. Finally, as he turns the car out, his headlights illuminate the porch, casting shadows that dance eerily in the night."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A low and terrible groan, deep, haunting, and filled with a sense of foreboding, begins to ominously rise from the very depths of her throat, echoing through the stillness. Suddenly, in this chilling and suspenseful scene, a hand appears within the shot, tightly clutching an enormous and intimidating bread knife. Over this unnerving and dramatic moment, brief and frantic gulps of screaming can be distinctly heard, echoing sharply, creating an atmosphere of panic and fear, followed by the dreadful and sickening thump as Mary's lifeless body collapses with haunting finality into the tub. From above the shower-bar, the bathroom door creaks open once again, and after a moment of suspenseful silence, the unsettling sound of the front door slamming reverberates throughout the house, adding to the tension. Mary lies there, half in and half out of the tub, her head awkwardly tumbled over; her wet hair, soaked and limp, touches the floor, while one of her eyes is disturbingly wide open, as if startled in shock, and one arm lies limply and drenched along the cold, hard tile floor. Running down the side of the tub, numerous small threads of blood flow in a thick and dark manner along the gleaming porcelain surface. The camera slowly retreats from this tragic scene, gliding smoothly across the bathroom, past the toilet, and ventures out into the adjoining bedroom. As it makes its careful way towards the bed, the camera captures the folded newspaper, lying just as Mary had placed it on the bedside table next to the bed. The camera then shifts its focus towards the window, and as it looks up at the house, Norman's terrified and shocked voice pierces the silence, emanating from within the house itself. In that tense moment, she halts abruptly, her anxiety and fear mounting within her, her eyes beginning to well up with worried tears. Sam observes her intently for a brief moment, then decisively turns and calls out. Bob, quickly receiving the message, promptly exits through the back way, disappearing swiftly. Sam moves closer to Lila, speaking to her in a calm, soft, and serious tone. Meanwhile, Arbogast examines it thoughtfully, then speaks, nods, and swiftly removes the closed-for-lunch sign, casually tossing it onto the counter with ease before opening the door and stepping out into the bustling, lively street. Norman is there, attentively holding the door open, allowing Arbogast to enter. Norman flicks on the overhead light as he makes his way towards the linen closet, but suddenly, he pauses, turns back, and studies Arbogast, who remains standing by the door. After a brief moment of consideration, he proceeds to open the closet and begins counting out sheets and pillowcases, deliberately keeping his back turned towards Arbogast. Arbogast then takes a photograph from his pocket, speaking as he crosses over to Norman. Norman glances at it briefly before turning away and lifts the sheets and pillowcases off the shelf, clutching them close, almost protectively. He walks to the wall, casually flipping a light switch, taking a small slip of paper out of his pocket and placing it beside the signature in the registry book, nodding and smiling with a niceness that seems to mimic the joy Norman might feel. Arbogast reaches him, extending the photograph, and Norman looks at it dutifully. Norman becomes visibly apprehensive as he cautiously starts towards Arbogast, forcing himself to maintain a façade of calmness and cheerfulness. Arbogast turns, gazing at him with serious intent. Norman looks up, studying the man's face, his own visage betraying a sense of unease. Finally, as he turns the car out, his headlights illuminate the porch, casting eerie shadows that dance in the night."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A low, terrible groan begins to creep up from deep within her throat, building in intensity, as the shot reveals a hand gripping an enormous bread knife. The air is pierced by brief, panicked gulps of screaming, which echo before the dreadful moment when Mary's body collapses heavily into the tub, producing a resonant thump. Above the shower-bar, the bathroom door creaks open once more, and after a tense pause, the distinct sound of the front door slamming reverberates through the house. Lying awkwardly, half-submerged in the tub, her head lolls over the edge, her hair wet and trailing on the floor, one eye wide open and staring as if in surprise, while her arm rests limp and soaked along the cold tile floor. Small, dark threads of blood trickle down the side of the tub, their path thick and vivid against the porcelain. The camera, capturing the unfolding horror, pulls back from the tragic scene, slowly moving across the bathroom, past the toilet, and seamlessly transitioning into the adjoining bedroom. As it nears the bed, a folded newspaper is visible, precisely where Mary had placed it on the bedside table. The camera drifts over to the window, offering a view of the house, and as it does so, the sound of Norman's voice, tinged with fear and shock, emanates from within the house. Her motions cease, stress and dread swelling within her, eyes brimming with anxious tears. Sam gazes at her intently for a brief moment, then turns away to call out. Bob receives the message and discreetly exits through the back way. Sam inches closer to Lila, addressing her with a soft yet earnest tone. Arbogast examines the situation, then speaks, nods in acknowledgment, removes the closed-for-lunch sign, swiftly tosses it onto the counter, opens the door, and steps out into the bustling street. Norman stands by the door, holding it ajar, ushering Arbogast in. Norman flicks on the overhead light, makes his way toward the linen closet, but unexpectedly halts, pivots, and scrutinizes Arbogast, who steadfastly remains by the entrance. After contemplating briefly, he resumes his task, opens the closet, and commences counting sheets and pillowcases, deliberately keeping his back turned to Arbogast. During this moment, Arbogast fishes a photograph from his pocket, conversing as he approaches Norman. Norman steals a fleeting glance, then deliberately turns away, collecting the sheets and pillowcases off the shelf, clutching them close as if they were precious. He moves toward the wall, toggles a light switch, retrieves a slip of paper from his pocket, and places it by the signature in the registry book, nodding and smiling pleasantly, as if sharing in Arbogast's sense of accomplishment. Arbogast steps forward, extending the photograph, prompting Norman to gaze at it dutifully. A wave of apprehension washes over Norman, who begins to advance towards Arbogast, endeavoring to maintain a calm and cheerful demeanor. Arbogast stops, casting a serious look at Norman. Norman raises his eyes, scrutinizing Arbogast's face, his own expression betraying unease. As Arbogast turns the car around, the headlights illuminate the porch in a sudden flash."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A terrible groan emerges from her throat as a hand holding an enormous bread knife appears, followed by screams and the thump of Mary's body falling in the tub. The bathroom door opens above the shower-bar, and the front door slams. Mary lies half in, half out of the tub, her wet hair and one wide-open eye touching the floor, with one arm limp along the tile. Threads of blood run thick down the tub's side. The camera moves away from her body, across the bathroom, past the toilet, and into the bedroom, where it captures the folded newspaper Mary had placed on the bedside table. Moving to the window, the camera shows the house as Norman's shocked voice is heard. She pauses, anxiety building, her eyes filling with tears, while Sam observes her, then calls out. Bob receives the message and exits through the back. Sam approaches Lila, speaking seriously. Arbogast examines something, then removes a closed-for-lunch sign, sets it on the counter, and exits. Norman holds the door open for Arbogast, who enters as Norman switches on the light and heads to the linen closet. After a brief pause, he opens it, counting sheets and pillowcases, keeping his back to Arbogast. Arbogast produces a photograph, speaking as he walks towards Norman, who glances at it, turns to lift more linens, and protectively holds them. He then flips a light switch, places a slip of paper by the registry book, and nods pleasantly. Arbogast approaches with the picture, and Norman looks at it nervously, moving towards Arbogast while trying to stay composed. Arbogast turns to him seriously, and Norman studies Arbogast's face, showing apprehension. As the car turns out, its headlights illuminate the porch."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A low, terrible groan, reminiscent of an animalistic cry of despair, begins to rise up out of her throat, and a hand comes into the shot holding an enormous bread knife, a weapon more often seen slicing loaves than inflicting harm. Over it, the brief gulps of screaming can be heard, followed by the dreadful thump as Mary's body, a character whose tragic demise echoes the shocking twists of a Hitchcock thriller, falls in the tub. Above the shower-bar, the bathroom door, likely an old wooden door that creaks ominously when moved, opens again, and after a moment, the sound of the front door slamming is heard, a noise that signifies a departure with no intention of returning. Lying half in, half out of the tub, her head is tumbled over, touching the floor with her hair wet, as though a grim painting capturing a scene of despair, one eye wide open as if popped, and one arm lying limp and wet along the tile floor. Coming down the side of the tub, many small threads of blood run thick and dark along the porcelain, similar to the dripping wax of a candle forgotten and left to burn. The camera follows away from the body, travels slowly across the bathroom, past the toilet, a sleek fixture that complements the vintage style of the 1960s decor, and out into the bedroom. As the camera approaches the bed, the folded newspaper, dated a day prior to the tragic event, is seen as Mary placed it on the bedside table beside the bed. The camera moves over to the window and looks up at the house, a brooding structure resembling the famous Bates mansion, and as it gets there, Norman's fearful, shocked voice, a chilling echo in the empty spaces, is heard coming from within the house. She stops, the anxiety and fear building up in her, eyes beginning to fill with worried tears. Sam studies her for a moment, recognizing the gravity of the situation, then turns and calls. Bob, a colleague known for his reliable presence, gets the message and goes out through the back way, a route frequently used by staff for discretion. Sam goes closer to Lila, speaking with soft seriousness, aware of the effect of their growing concerns. Arbogast, a detective whose methods are as meticulous as his appearance, studies it, then speaks, nods, takes down the closed-for-lunch sign, sails it to the counter, opens the door, and goes out into the street, his mind preoccupied with piecing together the puzzle he faces. Norman is holding the door open, so Arbogast walks in, the atmosphere charged with unspoken questions. Norman switches on the overhead light, a harsh bulb illuminating the room's starkness, starts for the linen closet, suddenly pauses, turns, and studies Arbogast, who has remained standing by the door, his stance wary yet composed. He waits a moment, then opens the closet, starts counting out sheets and pillowcases, keeping his back to Arbogast, as if the mundane task could shield him from suspicion. Arbogast takes a photograph out of his pocket, an image crucial to unraveling the mystery, talks as he crosses to Norman. Norman glances briefly, turns away, and lifts sheets and pillowcases off the shelf, holding them close, almost protectively, like shields against the encroaching threat. He goes to the wall, flips a light switch, takes a slip of paper out of his pocket, and lays it beside the signature in the registry book, nodding and smiling nicely, as if this discovery will make Norman as happy as it is making him, despite the undercurrent of tension. Arbogast has reached him, picture extended, and Norman looks dutifully at it, his expression an unsettling mix of cordiality and dread. Norman becomes apprehensive, starts towards Arbogast, forcing himself to remain calm and cheerful in a facade that is rapidly crumbling. Arbogast turns and gazes seriously at him, his eyes piercing through the pretense. Norman looks up, studies the man's face, his own face showing apprehension, a reflection of the storm brewing within. As he turns the car out, his headlights light up the porch, casting long shadows and revealing the stark outlines of what seems a deceptively ordinary setting."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Norman is holding the door open so Arbogast walks in As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub Above the showerbar the bathroom door opens again and after a moment the sound of the front door slamming is heard Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor Coming down the side of the tub many small threads of blood run thick and dark along the porcelain Arbogast has reached him picture extended and Norman looks dutifully at it the bathroom door opens again and after a moment the sound of the front door slamming is heard Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor She stops the anxiety and fear building up in her eyes beginning to fill with worried tears Above the showerbar Sam studies her for a moment then turns and calls Bob gets the message and goes out through the back way Arbogast turns and gazes seriously at him Sam goes closer to Lila speaking with soft seriousness Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street As he turns the car out his headlights light up the porch A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife Norman is holding the door open so Arbogast walks in Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast Arbogast takes a photograph out of his pocket talks as he crosses to Norman Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively Norman looks up studies the man's face his own face showing apprehension Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him Arbogast has reached him picture extended and Norman looks dutifully at it Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful Arbogast turns and gazes seriously at him Norman looks up studies the man's face his own face showing apprehension As he turns the car out his headlights light up the porch"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife. Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub. Above the showerbar. the bathroom door opens again and after a moment the sound of the front door slamming is heard. Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor. Coming down the side of the tub many small threads of blood run thick and dark along the porcelain. The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom. As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed. The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house. She stops the anxiety and fear building up in her eyes beginning to fill with worried tears. Sam studies her for a moment then turns and calls. Bob gets the message and goes out through the back way. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Sam goes closer to Lila speaking with soft seriousness. Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street. Norman is holding the door open so Arbogast walks in. Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door. He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast. Arbogast takes a photograph out of his pocket talks as he crosses to Norman. Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively. He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him. Arbogast has reached him picture extended and Norman looks dutifully at it. Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. Norman looks up studies the man's face his own face showing apprehension. As he turns the car out his headlights light up the porch."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife. Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub. Above the showerbar. the bathroom door opens again and after a moment the sound of the front door slamming is heard. Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor. Coming down the side of the tub many small threads of blood run thick and dark along the porcelain. The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom. As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed. The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house. She stops the anxiety and fear building up in her eyes beginning to fill with worried tears. Sam studies her for a moment then turns and calls. Bob gets the message and goes out through the back way. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Sam goes closer to Lila speaking with soft seriousness. Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street. Norman is holding the door open so Arbogast walks in. Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door. He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast. Arbogast takes a photograph out of his pocket talks as he crosses to Norman. Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively. He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him. Arbogast has reached him picture extended and Norman looks dutifully at it. Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. Norman looks up studies the man's face his own face showing apprehension. As he turns the car out his headlights light up the porch."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife. Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub. Above the showerbar. the bathroom door opens again and after a moment the sound of the front door slamming is heard. Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor. Coming down the side of the tub many small threads of blood run thick and dark along the porcelain. Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively. He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him. Arbogast has reached him picture extended and Norman looks dutifully at it. Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. Norman looks up studies the man's face his own face showing apprehension. As he turns the car out his headlights light up the porch."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife. Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub. Arbogast turns and gazes seriously at him. Norman looks up studies the man's face his own face showing apprehension. As he turns the car out his headlights light up the porch."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A low terrible groan begins to rise up out of the cat's throat, and a hand comes into the shot holding an enormous bread knife. Over it, the brief gulps of screaming can be heard, followed by the dreadful thump as the dog's body falls in the tub. Above the shower-bar, the bathroom door opens again, and after a moment, the sound of the front door slamming is heard. Lying half in, half out of the tub, the owl's head is tumbled over, touching the floor with her hair wet, one eye wide open as if popped, and one arm lying limp and wet along the tile floor. Coming down the side of the tub, many small threads of blood run thick and dark along the porcelain. The camera follows away from the body, travels slowly across the bathroom, past the toilet, and out into the bedroom. As the camera approaches the bed, the folded newspaper is seen as the mouse placed it on the bedside table beside the bed. The camera moves over to the window and looks up at the house, and as it gets there, the rabbit's fearful, shocked voice is heard coming from within the house. The giraffe stops, the anxiety and fear building up in her, eyes beginning to fill with worried tears. The kangaroo studies her for a moment, then turns and calls. The squirrel gets the message and goes out through the back way. The kangaroo goes closer to the giraffe, speaking with soft seriousness. The penguin studies it, then speaks, nods, takes down the closed-for-lunch sign, sails it to the counter, opens the door, and goes out into the street. The rabbit is holding the door open, so the penguin walks in. The rabbit switches on the overhead light, starts for the linen closet, suddenly pauses, turns, and studies the penguin, who has remained standing by the door. The rabbit waits a moment, then opens the closet, starts counting out sheets and pillowcases, keeping his back to the penguin. The penguin takes a photograph out of his pocket, talks as he crosses to the rabbit. The rabbit glances briefly, turns away, and lifts sheets and pillowcases off the shelf, holding them close, almost protectively. The rabbit goes to the wall, flips a light switch, takes a slip of paper out of his pocket, and lays it beside the signature in the registry book, nodding and smiling nicely, as if this discovery will make the rabbit as happy as it is making the penguin. The penguin has reached him, picture extended, and the rabbit looks dutifully at it. The rabbit becomes apprehensive, starts towards the penguin, forcing himself to remain calm and cheerful. The penguin turns and gazes seriously at him. The rabbit looks up, studies the man's face, his own face showing apprehension. As he turns the car out, his headlights light up the porch."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A low, ominous growl begins to rise up out of her throat, and a hand comes into the shot holding an enormous frying pan. Over it, the brief gulps of screaming can be heard, followed by the dreadful thud as Mary's body falls in the fountain. Above the curtain rod, the kitchen door opens again, and after a moment, the sound of the garage door slamming is heard. Lying half in, half out of the fountain, her head is tumbled over, touching the grass with her hair wet, one eye wide open as if popped, and one arm lying limp and wet along the stone path. Coming down the side of the fountain, many small threads of ink run thick and dark along the marble. The camera follows away from the body, travels slowly across the kitchen, past the sink, and out into the hallway. As the camera approaches the dresser, the folded letter is seen as Mary placed it on the side table beside the dresser. The camera moves over to the skylight and looks up at the attic, and as it gets there, Norman's fearful, shocked voice is heard coming from within the attic. She stops, the anxiety and fear building up in her, eyes beginning to fill with worried tears. Sam studies her for a moment, then turns and calls. Bob gets the message and goes out through the garden gate. Sam goes closer to Lila, speaking with soft seriousness. Arbogast studies it, then speaks, nods, takes down the closed-for-renovation sign, places it on the counter, opens the door, and goes out into the alley. Norman is holding the gate open, so Arbogast walks in. Norman switches on the desk lamp, starts for the pantry, suddenly pauses, turns, and studies Arbogast, who has remained standing by the gate. He waits a moment, then opens the pantry, starts counting out towels and napkins, keeping his back to Arbogast. Arbogast takes a sketch out of his pocket, talks as he crosses to Norman. Norman glances briefly, turns away, and lifts towels and napkins off the shelf, holding them close, almost protectively. He goes to the bench, flips a switch on the lamp, takes a strip of ribbon out of his pocket, and lays it beside the drawing in the sketchpad, nodding and smiling nicely, as if this discovery will make Norman as happy as it is making him. Arbogast has reached him, sketch extended, and Norman looks dutifully at it. Norman becomes apprehensive, starts towards Arbogast, forcing himself to remain calm and cheerful. Arbogast turns and gazes seriously at him. Norman looks up, studies the man's face, his own face showing apprehension. As he turns the bicycle out, his headlights light up the arbor."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A low terrible hum begins to echo out of her throat, and a hand enters the shot holding an enormous bread knife. Over it, the muted whispers of laughter can be heard, followed by the gentle rustle as Mary's body reclines in the tub. Above the shower-bar, the bathroom door swings open again, and after a moment, the sound of the front door closing softly is heard. Lying half in, half out of the tub, her head is angled over, grazing the floor with her hair dry, one eye wide open as if blinking, and one arm draped and dry along the tile floor. Coming down the side of the tub, many small strands of blood drift thin and light along the porcelain. The camera pans away from the body, glides slowly across the bathroom, past the toilet, and out into the bedroom. As the camera approaches the bed, the folded newspaper is spotted as Mary left it on the bedside table beside the bed. The camera shifts over to the window and gazes down at the house, and as it arrives there, Norman's fearful, shocked voice is heard coming from outside the house. She pauses, the anxiety and fear simmering in her, eyes beginning to fill with nervous tears. Sam observes her for a moment, then turns and signals. Bob receives the message and heads out through the back way. Sam moves closer to Lila, speaking with gentle curiosity. Arbogast examines it, then murmurs, nods, pulls down the closed-for-lunch sign, tosses it to the counter, cracks open the door, and steps out into the street. Norman is propping the door open, so Arbogast slips in. Norman flicks on the overhead light, reaches for the linen closet, suddenly hesitates, pivots, and examines Arbogast, who has remained standing by the door. He pauses a moment, then cracks open the closet, starts sorting through sheets and pillowcases, keeping his back to Arbogast. Arbogast pulls a photograph out of his pocket, gestures as he steps towards Norman. Norman glances briefly, shifts away, and grabs sheets and pillowcases off the shelf, clutching them close, almost protectively. He approaches the wall, presses a light switch, extracts a slip of paper out of his pocket, and places it beside the signature in the registry book, nodding and grinning pleasantly, as if this discovery will make Norman as content as it is making him. Arbogast has approached him, picture extended, and Norman glances cautiously at it. Norman becomes uneasy, strides towards Arbogast, forcing himself to remain composed and cordial. Arbogast turns and peers thoughtfully at him. Norman looks up, examines the man's face, his own face showing unease. As he maneuvers the car out, his headlights illuminate the porch."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A faint mechanical hum begins to rise up out of the shoebox, and a squirrel comes into the shot holding an enormous paintbrush. Over it, the brief notes of laughter can be heard, followed by the dreadful clang as Martha's hat lands in the blender. Above the bookshelf, the kitchen window opens again, and after a moment, the sound of the bedroom window slamming is heard. Lying half in, half out of the blender, the mitten is tumbled over, touching the desk with its lace wet, one button wide open as if popped, and one ribbon lying limp and wet along the wooden floor. Coming down the side of the blender, many small threads of ink run thick and dark along the porcelain. The camera follows away from the hat, travels slowly across the kitchen, past the blender, and out into the office. As the camera approaches the desk, the folded map is seen as Martha placed it on the lamp beside the desk. The camera moves over to the mirror and looks up at the couch, and as it gets there, Oscar's perplexed, shocked voice is heard coming from within the couch. It stops, the anxiety and dread building up in it, bolts beginning to fill with worried steam. Ricky studies it for a moment, then turns and whistles. Gary gets the signal and goes out through the front way. Ricky goes closer to Emily, speaking with soft determination. Colleen studies it, then speaks, nods, takes down the open-for-business sign, rolls it to the wall, opens the window, and goes out into the hallway. Oscar is holding the window open, so Colleen walks in. Oscar switches on the floor lamp, starts for the kitchen drawer, suddenly pauses, turns, and studies Colleen, who has remained standing by the window. He waits a moment, then opens the drawer, starts counting out forks and knives, keeping his back to Colleen. Colleen takes a compass out of her pocket, talks as she crosses to Oscar. Oscar glances briefly, turns away, and lifts forks and knives off the shelf, holding them close, almost protectively. He goes to the ceiling, flips a light switch, takes a coin out of his pocket, and lays it beside the stamp in the ledger book, nodding and smiling gently, as if this discovery will make Oscar as pleased as it is making her. Colleen has reached him, compass extended, and Oscar looks dutifully at it. Oscar becomes cautious, starts towards Colleen, forcing himself to remain calm and chipper. Colleen turns and gazes intently at him. Oscar looks up, studies the cat's face, his own face showing caution. As he turns the bicycle out, its headlights light up the garden."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A low, strange whistle begins to emanate from his mouth, and a foot appears in the shot holding an enormous kitchen ladle. Over it, the muffled whispers of laughter can be heard, followed by the dreadful splash as Tom’s hat floats in the pool. Above the shower-bar, the bathroom window closes again, and after a moment, the sound of the back door swinging is heard. Lying half in, half out of the pool, his shoe is tipped over, touching the grass with his cuff wet, one sock half-peeled as if torn, and one leg resting limp and wet along the stone patio. Coming down the side of the pool, many small bubbles of air float light and clear along the surface. The camera drifts away from the hat, glides slowly across the garden, past the bench, and out into the living room. As the camera nears the couch, the folded magazine is seen as Tom left it on the coffee table beside the couch. The camera pans over to the window and peers up at the tree, and as it gets there, Steve’s surprised, amused voice is heard echoing from within the house. He halts, the excitement and joy building up in him, eyes starting to fill with happy tears. Jill examines him for a moment, then turns and laughs. Dave receives the signal and runs out through the side door. Jill moves closer to Mark, speaking with gentle curiosity. Smith examines it, then comments, shrugs, pulls down the open-for-business sign, flips it to the other side, closes the door, and skips out into the parking lot. Steve is holding the door ajar, so Smith rushes in. Steve flicks on the desk lamp, heads for the supply room, suddenly halts, swivels, and gazes at Smith, who has remained lounging by the entrance. He waits a moment, then unlocks the room, starts pulling out towels and blankets, keeping his gaze away from Smith. Smith retrieves a notepad from his pocket, jokes as he strolls to Steve. Steve peeks momentarily, turns aside, and wraps towels and blankets off the rack, clutching them tightly, almost nervously. He walks to the bookshelf, presses a button on a remote, extracts a pen from his pocket, and places it beside the scribble in a notebook, nodding and chuckling softly, as if this realization will make Steve as amused as it is making him. Smith has reached him, notebook extended, and Steve looks grudgingly at it. Steve becomes cautious, moves toward Smith, compelling himself to stay smooth and upbeat. Smith swivels and gazes thoughtfully at him. Steve looks over, examines the man’s expression, his own visage displaying uncertainty. As he reverses the vehicle out, his taillights illuminate the lawn."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A low, strange whistle begins to bubble up out of her nose, and a foot comes into the shot holding a gigantic whisk. Over it, the brief music of humming can be heard, followed by the gentle splash as Mary's body dives in the pool. Above the curtain rod, the bedroom window slides open again, and after a moment, the sound of the garage door buzzing is heard. Lying half in, half out of the pool, her head is flipped over, tapping the ground with her hair dry, one eye squeezed shut as if sewn, and one leg resting stiff and dry along the wooden floor. Dripping down the side of the pool, many small streams of paint flow thin and pale along the ceramic. The camera glides away from the body, drifts gently across the bedroom, past the dresser, and out into the hallway. As the camera approaches the sofa, the crumpled magazine is noticed as Mary tossed it on the carpet beside the couch. The camera shifts over to the door and peers out at the garden, and as it arrives there, Norman's anxious, startled voice is heard echoing from inside the garden. She waits, the tension and dread swelling in her, eyes beginning to fill with nervous giggles. Sam observes her for a moment, then pivots and whispers. Bob receives the signal and slips out through the side entrance. Sam moves nearer to Lila, speaking with gentle sincerity. Arbogast examines it, then comments, nods, picks up the \"open-for-service\" sign, sails it to the window, closes the door, and steps out onto the balcony. Norman is holding the window open, so Arbogast crawls in. Norman switches off the overhead fan, reaches for the broom closet, abruptly hesitates, pivots, and observes Arbogast, who has remained perched by the window. He pauses a moment, then closes the closet, starts stacking pots and pans, keeping his front to Arbogast. Arbogast pulls a ticket out of his pocket, chats as he wanders to Norman. Norman glances swiftly, turns away, and gathers pots and pans from the shelf, clutching them tightly, almost reverently. He moves to the door, clicks a light button, pulls a piece of fabric out of his pocket, and places it beside the doodle on the calendar, nodding and grinning warmly, as if this revelation will bring Norman the delight it is bringing him. Arbogast has approached him, photograph displayed, and Norman gazes obediently at it. Norman becomes uneasy, advances towards Arbogast, forcing himself to remain composed and friendly. Arbogast swivels and stares intently at him. Norman looks up, examines the man's expression, his own showing unease. As he drives the truck out, his taillights illuminate the driveway."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A soft cheerful whistle begins to float up out of the cat's whiskers, and a foot jumps into the scene holding a tiny paintbrush. Beneath it, the faint whispers of laughing can be heard, accompanied by the joyful clatter as John's hat spins in the sink. Above the shower-bird, the garden gate swings open again, and after an instant, the echo of the garage door creaking is heard. Curling half in, half out of the sink, his shoe is twisted around, brushing the rug with its laces dry, one cheek slightly puffed up as if stretched, and one leg dangling firm and dry over the wooden floor. Descending along the side of the sink, numerous tiny strands of yarn weave thin and colorful over the ceramic. The camera zooms away from the hat, glides swiftly through the kitchen, past the refrigerator, and in to the hallway. As the camera nears the closet, the unfolded letter is noticeable where John placed it on the bookshelf beside the lamp. The camera glides over to the curtain and peers down at the yard, and as it gets there, Lisa's delighted, surprised laughter is heard coming from within the yard. He pauses, the joy and surprise building up in him, ears beginning to fill with curious chuckles. Jill observes him for a minute, then turns and shouts. Tim hears the noise and rushes in through the garage door. Jill moves closer to Bob, speaking with loud cheerfulness. Anderson examines it, then comments, chuckles, lifts up the open-for-supper banner, floats it to the chair, closes the window, and steps out onto the driveway. Lisa is closing the window shut, so Anderson strolls out. Lisa flips off the ceiling fan, heads for the shoe rack, abruptly halts, pivots, and examines Anderson, who has remained seated by the window. She waits a second, then shuts the rack, begins stacking up shirts and blankets, keeping her face to Anderson. Anderson pulls a notebook out of his backpack, whispers as he moves toward Lisa. Lisa peers briefly, looks back, and stacks up shirts and blankets off the hanger, holding them loosely, almost carelessly. She shifts to the chair, presses a button on a remote, extracts a cupcake wrapper from her backpack, and drops it beside the doodle on the scrapbook, chuckling and clapping eagerly, as if this invention will make Lisa as thrilled as it is making him. Anderson has arrived next to her, notebook open, and Lisa peers expectantly at it. Lisa becomes thrilled, moves towards Anderson, allowing herself to remain calm and joyous. Anderson spins and stares curiously at her. Lisa looks down, examines the woman's eyes, her own eyes showing excitement. As she turns the bike in, its signals illuminate the driveway."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A terrible groan escapes as a hand holding a bread knife is seen, followed by screams and Mary's body falling in the tub. Her lifeless form, partially in the tub, lies with wet hair and an open eye. Blood trails down the tub's side, while the camera moves across the bathroom and into the bedroom, where Mary's newspaper sits on the bedside table. Outside, Norman's shocked voice is heard. Lila grows anxious, eyes brimming with tears as Sam watches, then acts. Sam approaches Lila, speaking softly, and Bob leaves through the back. Arbogast examines, takes down the closed-for-lunch sign, and exits to the street. Norman lets Arbogast in, switches on the light, pauses, and counts sheets, keeping his back to Arbogast. Arbogast shows Norman a photograph; Norman glances, then turns away protectively cradling linens. He flips a light switch, compares a slip of paper with the registry book, and smiles. As Arbogast approaches, picture in hand, Norman looks but grows apprehensive. Arbogast regards him seriously, prompting Norman to force composure. As the car leaves, its headlights illuminate the porch."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As he turns the car out his headlights light up the porch Norman looks up studies the man's face his own face showing apprehension Arbogast turns and gazes seriously at him Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful Arbogast has reached him picture extended and Norman looks dutifully at it He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively Arbogast takes a photograph out of his pocket talks as he crosses to Norman He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door Norman is holding the door open so Arbogast walks in Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street Sam goes closer to Lila speaking with soft seriousness Bob gets the message and goes out through the back way Sam studies her for a moment then turns and calls She stops the anxiety and fear building up in her eyes beginning to fill with worried tears The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom Coming down the side of the tub many small threads of blood run thick and dark along the porcelain Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor the bathroom door opens again and after a moment the sound of the front door slamming is heard Above the showerbar Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast Sam goes closer to Lila speaking with soft seriousness She stops the anxiety and fear building up in her eyes beginning to fill with worried tears He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom Coming down the side of the tub many small threads of blood run thick and dark along the porcelain Sam studies her for a moment then turns and calls Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful Bob gets the message and goes out through the back way Arbogast takes a photograph out of his pocket talks as he crosses to Norman Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub Norman is holding the door open so Arbogast walks in Arbogast turns and gazes seriously at him Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street Above the showerbar Norman looks up studies the man's face his own face showing apprehension Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor As he turns the car out his headlights light up the porch As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife the bathroom door opens again and after a moment the sound of the front door slamming is heard Arbogast has reached him picture extended and Norman looks dutifully at it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Arbogast studies it then speaks nods takes down the closedforlunch sign sails it to the counter opens the door and goes out into the street Norman is holding the door open so Arbogast walks in Norman switches on the overhead light starts for the linen closet suddenly pauses turns and studies Arbogast who has remained standing by the door He waits a moment then opens the closet starts counting out sheets and pillowcases keeping his back to Arbogast Arbogast takes a photograph out of his pocket talks as he crosses to Norman Norman glances briefly turns away and lifts sheets and pillowcases off the shelf holding them close almost protectively He goes to the wall flips a light switch takes a slip of paper out of his pocket and lays it beside the signature in the registry book nodding and smiling nicely as if this discovery will make Norman as happy as it is making him Arbogast has reached him picture extended and Norman looks dutifully at it Norman becomes apprehensive starts towards Arbogast forcing himself to remain calm and cheerful Arbogast turns and gazes seriously at him Norman looks up studies the man's face his own face showing apprehension As he turns the car out his headlights light up the porch A low terrible groan begins to rise up out of her throat and a hand comes into the shot holding an enormous bread knife Over it the brief gulps of screaming can be heard followed by the dreadful thump as Mary's body falls in the tub Above the showerbar the bathroom door opens again and after a moment the sound of the front door slamming is heard Lying half in half out of the tub her head is tumbled over touching the floor with her hair wet one eye wide open as if popped and one arm lying limp and wet along the tile floor Coming down the side of the tub many small threads of blood run thick and dark along the porcelain The camera follows away from the body travels slowly across the bathroom past the toilet and out into the bedroom As the camera approaches the bed the folded newspaper is seen as Mary placed it on the bedside table beside the bed The camera moves over to the window and looks up at the house and as it gets there Norman's fearful shocked voice is heard coming from within the house She stops the anxiety and fear building up in her eyes beginning to fill with worried tears Sam studies her for a moment then turns and calls Bob gets the message and goes out through the back way Sam goes closer to Lila speaking with soft seriousness"
        }
      ]
    }
  ]
}