{
  "ground_truth": "Louise glides right back onto the road as if nothing unusual has happened at all, and they realize they have not been spotted. J.D. and Louise look at each other. Hal is on the phone to the FBI man, and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house. Max Stratton, an FBI man in his early forties, is looking at the ident-a-kit drawings of Louise and Thelma. The T-Bird barrels down the road at high speed as Louise, Thelma, and J.D. pull into the motel parking lot. Louise looks at J.D. in the back seat and takes the keys out of the ignition, gets out of the car, and goes inside, where an older woman behind the counter is looking at a computer screen. Louise is startled and turns around quickly as J.D. climbs out of the car, looking very uncomfortable. Jimmy is smiling, and Thelma is watching as Louise turns to face Thelma. J.D. attacks her again, causing Thelma to gasp, and Louise studies Thelma closely as she squirms in her seat, barely able to contain herself. Thelma is just laughing hysterically, and Louise suddenly understands, getting a bad feeling. She is already standing up, putting money on the table, while Thelma has forgotten all about the money, and they are both leaving the restaurant now. As they hit the door, they both break into a full run. Louise is stoic, fighting tears, and she sits down on the sidewalk in front of the room. Thelma comes and sits beside her, and neither one says anything for a moment until Louise quietly starts to fall apart, causing Thelma to leap into action. Louise is still sitting on the sidewalk but slowly gets to her feet. The rear wheel of the green T-Bird lays rubber out of the motel parking lot as Thelma and Louise, both looking a little rougher than we've seen so far, drive away. Hal, the FBI man, various other police and detective types pull up in front of the house, and the front door swings open to reveal Darryl looking like he's been shot out of a cannon. As Louise and Thelma pull into a convenience store, police are tapping the phones, dusting for prints, etc., while Darryl sits motionless in his recliner with a dull expression on his face. Max joins them as they walk down the hallway. Thelma and Louise sit in the car, and Louise looks at her as Thelma shrieks with excitement, leaving Louise completely stunned and shooting her a look. Thelma puts the car in gear and floors it out of the parking lot, still looking at Louise as if she has completely lost her mind. Hal, Max, various other cops, and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Louise slides right back onto the street as if nothing atypical has occurred at all, and they comprehend they have not been detected. J.D. and Louise glance at each other. Hal is on the line to the FBI agent, and Darryl is sitting on a chair appearing stunned while other law enforcement individuals roam around the dwelling. Max Stratton, an FBI agent in his early forties, is examining the ident-a-kit illustrations of Louise and Thelma. The T-Bird barrels down the street at elevated velocity as Louise, Thelma, and J.D. pull into the motel parking area. Louise glances at J.D. in the rear seat and takes the keys out of the ignition, exits the car, and goes inside, where an older woman behind the counter is gazing at a computer display. Louise is surprised and turns around swiftly as J.D. climbs out of the car, appearing very uneasy. Jimmy is grinning, and Thelma is observing as Louise turns to face Thelma. J.D. assaults her again, causing Thelma to inhale sharply, and Louise examines Thelma closely as she squirms in her seat, scarcely able to contain herself. Thelma is just laughing uncontrollably, and Louise suddenly comprehends, getting a bad sensation. She is already standing up, placing cash on the table, while Thelma has forgotten all about the cash, and they are both departing the eatery now. As they hit the door, they both break into a full sprint. Louise is stoic, battling tears, and she sits down on the walkway in front of the room. Thelma comes and sits beside her, and neither one says anything for a moment until Louise quietly starts to unravel, causing Thelma to leap into action. Louise is still sitting on the walkway but slowly gets to her feet. The rear wheel of the green T-Bird lays rubber out of the motel parking area as Thelma and Louise, both looking a little rougher than we've observed so far, drive away. Hal, the FBI agent, various other police and detective individuals pull up in front of the dwelling, and the front door swings open to reveal Darryl looking like he's been shot out of a cannon. As Louise and Thelma pull into a convenience store, police are tapping the phones, dusting for impressions, etc., while Darryl sits motionless in his recliner with a vacant expression on his visage. Max joins them as they stroll down the corridor. Thelma and Louise sit in the car, and Louise glances at her as Thelma shrieks with excitement, leaving Louise completely stunned and shooting her a glare. Thelma puts the car in gear and floors it out of the parking area, still gazing at Louise as if she has completely lost her wits. Hal, Max, various other officers, and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a firearm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Louise is glided right back onto the road by her as if nothing unusual had happened at all, and the realization is made by them that they have not been spotted. J.D. and Louise are looked at by each other. Hal speaks on the phone to the FBI man, and a chair is sat on by Darryl, who looks dazed while the house is roamed around by other law enforcement types. Ident-a-kit drawings of Louise and Thelma are being looked at by Max Stratton, an FBI man in his early forties. The road is barreled down at high speed by the T-Bird as the motel parking lot is pulled into by Louise, Thelma, and J.D. Louise looks at J.D. in the back seat, takes the keys out of the ignition, gets out of the car, and goes inside, where a computer screen is being looked at by an older woman behind the counter. Louise is startled and quickly turns around as J.D. climbs out of the car, looking very uncomfortable. Jimmy smiles, and Louise is watched by Thelma as she turns to face Thelma. J.D. attacks her again, causing Thelma to gasp, and Thelma is studied closely by Louise as she squirms in her seat, barely able to contain herself. Thelma just laughs hysterically, and a bad feeling is suddenly gotten by Louise as she understands. She is already standing up, money is being put on the table by her, while the money is forgotten all about by Thelma, and now the restaurant is left by both of them. As the door is hit by them, a full run is broken into by both of them. Tears are being fought by stoic Louise, and the sidewalk in front of the room is sat down on by her. Thelma comes to sit beside her, and neither one says anything for a moment until the quiet unraveling is started by Louise, causing Thelma to leap into action. The sidewalk is still sat on by Louise, but her feet are slowly gotten to by her. The rear wheel of the green T-Bird lays rubber out of the motel parking lot as Thelma and Louise, both looking a little rougher than we've seen so far, drive away. Hal, the FBI man, and various other police and detective types pull up in front of the house, and the front door swings open to reveal Darryl looking like he's been shot out of a cannon. As a convenience store is pulled into by Louise and Thelma, the phones are tapped by police, prints are dusted for, etc., while Darryl sits motionless in his recliner with a dull expression on his face. Max joins them as the hallway is walked down by them. The car is sat in by Thelma and Louise, and Louise looks at her as Thelma shrieks with excitement, leaving Louise completely stunned and shooting her a look. The car is put in gear by Thelma and floored out of the parking lot, still looking at Louise as if she has completely lost her mind. TV plays back VCR tape of Thelma in the convenience store pulling a gun while they are all watched by Hal, Max, various other cops, and Darryl."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Louise smoothly returns to the road, unnoticed. J.D. and Louise exchange glances. Hal is on the phone with the FBI, while Darryl sits dazed as law enforcement officers search the house. Max Stratton, an FBI agent, examines ident-a-kit drawings of Louise and Thelma. The T-Bird speeds down the road as they arrive at the motel. Louise exits the car, leaving J.D. uncomfortable, and enters to find an older woman at a computer. Startled, she turns as J.D. exits the car. Jimmy smiles, and Thelma watches as J.D. attacks again, making Thelma gasp. Louise observes Thelma, who laughs hysterically, realizing something is wrong. Louise stands, leaves money, and they both exit the restaurant, breaking into a run. Louise, stoic and tearful, sits on the sidewalk. Thelma joins her, and after a moment, Louise breaks down, prompting Thelma to act. Louise rises, and the T-Bird speeds away with Thelma and Louise looking rougher. Hal, the FBI, and police arrive at the house, where Darryl appears shocked. At a convenience store, police tap phones and dust for prints as Darryl sits motionless. Max joins them in the hallway. In the car, Thelma's excitement stuns Louise, who gives her a look. Thelma floors it out of the parking lot, still eyeing Louise. Hal, Max, police, and Darryl watch a TV replay of Thelma pulling a gun in the store."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Louise smoothly returns to the road, unnoticed. J.D. and Louise exchange glances. Hal phones the FBI, while Darryl sits dazed as law enforcement searches the house. Max Stratton, an FBI agent, examines ident-a-kit drawings of Louise and Thelma. The T-Bird speeds to a motel, where Louise exits, leaving J.D. uncomfortable in the car. Inside, an older woman at a computer startles Louise. J.D. attacks Thelma, who laughs hysterically, causing Louise to worry. They leave the restaurant, running. Louise, stoic and tearful, sits on the sidewalk. Thelma joins her, and as Louise breaks down, Thelma acts. They drive away in the T-Bird, looking rough. Hal, the FBI, and police arrive at the house, finding Darryl shocked. At a convenience store, police tap phones and dust for prints, while Darryl sits motionless. Max joins the investigation. In the car, Thelma's excitement stuns Louise. Thelma floors it, leaving Louise bewildered. Hal, Max, police, and Darryl watch a VCR tape of Thelma pulling a gun in the store."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Louise effortlessly glides back onto the road, seamlessly continuing as if nothing out of the ordinary has occurred, and they come to the realization that they have not been noticed. J.D. and Louise exchange a meaningful glance. Meanwhile, Hal is engaged in a phone conversation with the FBI agent, and Darryl is seated on a chair, appearing dazed and bewildered, while other law enforcement personnel mill about the house. Max Stratton, an FBI agent in his early forties, is intently examining the ident-a-kit sketches of Louise and Thelma. The T-Bird races down the road at a high velocity as Louise, Thelma, and J.D. pull into the motel parking lot. Louise glances at J.D. in the back seat, removes the keys from the ignition, exits the car, and heads inside, where an older woman is focused on a computer screen behind the counter. Louise is taken aback and quickly turns around as J.D. awkwardly climbs out of the car, looking visibly uncomfortable. Jimmy is smiling, and Thelma is observing as Louise turns to face Thelma. J.D. suddenly attacks her again, causing Thelma to gasp in surprise, and Louise scrutinizes Thelma closely as she squirms in her seat, barely able to contain her emotions. Thelma is laughing uncontrollably, and Louise suddenly comprehends the situation, getting a sinking feeling. She is already on her feet, placing money on the table, while Thelma has completely forgotten about the money, and they are both leaving the restaurant now. As they reach the door, they both break into a full sprint. Louise remains stoic, fighting back tears, and she sits down on the sidewalk in front of the room. Thelma comes over and sits beside her, and for a moment, neither of them says anything until Louise quietly begins to unravel, prompting Thelma to spring into action. Louise is still seated on the sidewalk but gradually rises to her feet. The rear wheel of the green T-Bird screeches as it speeds out of the motel parking lot, with Thelma and Louise, both appearing a bit more worn than we've seen them before, driving away. Hal, the FBI agent, along with various other police officers and detectives, arrive in front of the house, and the front door swings open to reveal Darryl, looking as if he's been launched from a cannon. As Louise and Thelma pull into a convenience store, police are busy tapping the phones, dusting for fingerprints, and so on, while Darryl sits motionless in his recliner, a dull expression on his face. Max joins them as they walk down the hallway. Thelma and Louise sit in the car, and Louise looks at her as Thelma shrieks with excitement, leaving Louise utterly stunned and shooting her a bewildered look. Thelma shifts the car into gear and floors it out of the parking lot, still gazing at Louise as if she has completely lost her mind. Hal, Max, various other cops, and Darryl all watch as the TV plays back VCR footage of Thelma in the convenience store brandishing a gun."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With graceful ease, Louise glides back onto the open road, continuing seamlessly on their journey as if nothing unusual or remarkable has transpired. They both realize, much to their relief, that they have not drawn any unwanted attention. J.D. and Louise exchange a glance filled with meaning, a silent communication passing between them. In the meantime, Hal is actively engaged in a phone conversation with an FBI agent, while Darryl, seated on a chair, appears dazed and bewildered by the unfolding events. Around him, other law enforcement personnel are milling about the house, attending to their duties. Max Stratton, an FBI agent in his early forties, is intently focused on the ident-a-kit sketches of both Louise and Thelma, analyzing them with great care. \n\nThe T-Bird races down the road at a formidable high velocity, as Louise, Thelma, and J.D. make their way into the motel parking lot. Louise casts a glance at J.D., who is sitting in the back seat, and she smoothly removes the keys from the ignition. She exits the vehicle and makes her way inside the motel, where an older woman is deeply engrossed in her work at a computer screen behind the counter. Louise is momentarily taken aback and quickly turns around as J.D., looking quite awkward, climbs out of the car, visibly uncomfortable in his movements. Jimmy is smiling, observing the scene with interest, while Thelma watches as Louise turns to face her. In a sudden moment, J.D. attacks her again, causing Thelma to gasp in surprise, while Louise scrutinizes Thelma closely as she squirms in her seat, struggling to contain her swirling emotions. Thelma finds herself laughing uncontrollably, while Louise, starting to comprehend the situation, gets a sinking feeling as realization sets in. She is already on her feet, placing money on the table, though Thelma has entirely forgotten about it as they both now leave the restaurant. As they approach the door, they both break into a full sprint, urgency in their steps. Louise remains stoic, fighting back tears, and she sits down on the sidewalk in front of the room, visibly trying to hold herself together. Thelma comes over and sits beside her, and for a brief, poignant moment, neither of them says anything until Louise quietly begins to unravel, prompting Thelma into action with instant concern. \n\nLouise is still seated on the sidewalk but gradually rises to her feet, collecting herself as she does so. The rear wheel of the green T-Bird screeches loudly as it speeds out of the motel parking lot, with Thelma and Louise both appearing a bit more worn and beleaguered than we have observed them before, as they drive away. Hal, the FBI agent along with various other police officers and detectives, arrive in front of the house. The front door swings open dramatically to reveal Darryl, who looks as if he’s been launched from a cannon, startled and wide-eyed. As Louise and Thelma pull into a convenience store, police officers are engaged in tapping the phones, dusting for fingerprints, and handling various other investigative tasks, while Darryl sits motionless in his recliner, a dull, vacant expression on his face. Max joins the other officers as they walk down the hallway, taking in the unfolding scenario. Meanwhile, Thelma and Louise sit in the car, and Louise looks at her friend as Thelma suddenly shrieks with excitement, leaving Louise utterly stunned and shooting her a bewildered look, full of disbelief. Thelma shifts the car into gear and floors it out of the parking lot, her gaze still on Louise as if she has completely lost her senses. Hal, Max, and numerous other cops, along with Darryl, all watch as the TV plays back VCR footage showing Thelma in the convenience store, wielding a gun, a moment captured on tape in stark clarity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Louise smoothly maneuvers the car back onto the road, maintaining an air of normalcy as if nothing out of the ordinary has occurred, and they both come to the realization that they have not been noticed. J.D. and Louise exchange a meaningful glance, while elsewhere, Hal is engaged in a phone conversation with an FBI agent. Meanwhile, Darryl sits in a chair, appearing dazed and disoriented, as various law enforcement officers move about the house. Max Stratton, an FBI agent in his early forties, examines ident-a-kit drawings of Louise and Thelma with a focused intensity. The T-Bird speeds down the road with urgency as Louise, Thelma, and J.D. arrive at the motel parking lot. Louise turns to look at J.D. seated in the back, then deliberately removes the keys from the ignition, exits the car, and heads inside the motel. Inside, she encounters an older woman who is engrossed in a computer screen. Startled by the unexpected presence, Louise quickly turns around just as J.D. awkwardly climbs out of the car, visibly uncomfortable. Jimmy stands by with a smile, while Thelma observes the scene as Louise turns to face her. Suddenly, J.D. makes another aggressive move towards her, causing Thelma to gasp in shock. Louise scrutinizes Thelma closely as she squirms in her seat, struggling to maintain her composure. Thelma bursts into hysterical laughter, and in that moment, Louise gains a sudden understanding, accompanied by a sinking feeling. Already on her feet, Louise places money on the table, while Thelma, having forgotten about the money entirely, joins her as they both exit the restaurant. As they reach the door, they break into a full sprint. Louise, maintaining a stoic demeanor, fights back tears and eventually sits down on the sidewalk in front of their room. Thelma joins her, sitting silently beside her until Louise quietly begins to unravel, prompting Thelma to spring into action. Louise remains seated on the sidewalk but gradually rises to her feet. The rear wheel of the green T-Bird screeches as it leaves rubber marks while exiting the motel parking lot, with Thelma and Louise, appearing more worn than before, driving away. Meanwhile, Hal, the FBI agent, and various other police and detective personnel arrive in front of the house, where the front door swings open to reveal Darryl, looking as if he's been launched from a cannon. As Louise and Thelma pull into a convenience store, police officers are busy tapping phones and dusting for fingerprints, while Darryl sits motionless in his recliner, his face devoid of expression. Max joins the group as they proceed down the hallway. Thelma and Louise sit in the car, and Louise turns to look at Thelma, who shrieks with excitement, leaving Louise utterly stunned and prompting her to shoot Thelma a bewildered look. Thelma shifts the car into gear and accelerates out of the parking lot, her gaze still fixed on Louise as if she has completely lost her senses. Hal, Max, various other officers, and Darryl all watch as a TV plays back a VCR tape showing Thelma in the convenience store brandishing a gun."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Louise seamlessly returns to the road, unnoticed, as J.D. and Louise exchange glances. Meanwhile, Hal is on the phone with the FBI, and Darryl sits dazed while law enforcement officers search the house. Max Stratton, an FBI agent, examines ident-a-kit drawings of Louise and Thelma. The T-Bird speeds down the road, and they arrive at a motel. Louise exits the car, leaving J.D. looking uncomfortable, and enters the motel where an older woman is at the counter. Startled, Louise turns as J.D. exits the car, and Jimmy smiles while Thelma watches. J.D. attacks Thelma, causing her to gasp, and Louise observes Thelma's hysterical laughter, realizing something is wrong. Louise stands, leaves money on the table, and they both exit the restaurant, breaking into a run. Outside, Louise sits on the sidewalk, fighting tears, and Thelma joins her. Louise quietly breaks down, prompting Thelma to act. Louise rises, and they drive away in the T-Bird, looking rougher than before. Hal, Max, and other officers arrive at the house as Darryl appears disoriented. At a convenience store, police tap phones and dust for prints while Darryl sits motionless. Max joins the officers in the hallway. In the car, Thelma's excitement stuns Louise, who shoots her a look. Thelma floors the car out of the parking lot, still eyeing Louise. Hal, Max, and others watch a TV replay of Thelma pulling a gun in the store."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all, and they realize they have not been spotted by the pursuing law enforcement. J.D. and Louise look at each other, exchanging a silent understanding of their close escape. Hal, a local detective renowned for his keen investigative skills, is on the phone to the FBI man, and Darryl, Louise's inattentive husband, is sitting on a chair looking dazed while other law enforcement types roam around the house searching for clues. Max Stratton, an FBI man in his early forties known for his methodical approach to cases, is looking at the ident-a-kit drawings of Louise and Thelma, which were created based on witness descriptions. The T-Bird, a classic 1966 Thunderbird known for its powerful V8 engine, barrels down the road at high speed as Louise, Thelma, and J.D. pull into the motel parking lot. Louise looks at J.D. in the back seat and takes the keys out of the ignition, gets out of the car, and goes inside, where an older woman, who runs the establishment with a no-nonsense attitude, is behind the counter looking at a computer screen. Louise is startled and turns around quickly as J.D. climbs out of the car, looking very uncomfortable in the tense situation. Jimmy, Thelma’s loving but somewhat oblivious husband, is smiling, and Thelma is watching as Louise turns to face Thelma. J.D. attacks her again verbally, causing Thelma to gasp, and Louise studies Thelma closely as she squirms in her seat, barely able to contain herself. Thelma is just laughing hysterically, an unexpected burst of emotion in a tense moment, and Louise suddenly understands, getting a bad feeling about their predicament. She is already standing up, putting money on the table, while Thelma has forgotten all about the money, and they are both leaving the restaurant now. As they hit the door, they both break into a full run, driven by a shared sense of urgency. Louise is stoic, fighting tears, and she sits down on the sidewalk in front of the room, trying to keep her composure. Thelma comes and sits beside her, and neither one says anything for a moment until Louise quietly starts to fall apart emotionally, causing Thelma to leap into action to comfort her friend. Louise is still sitting on the sidewalk but slowly gets to her feet, her resolve strengthening. The rear wheel of the green T-Bird lays rubber out of the motel parking lot as Thelma and Louise, both looking a little rougher and more battle-worn than we've seen so far, drive away. Hal, the FBI man, various other police and detective types pull up in front of the house in a coordinated effort, and the front door swings open to reveal Darryl looking like he's been shot out of a cannon, overwhelmed by the unfolding chaos. As Louise and Thelma pull into a convenience store to grab supplies, police are tapping the phones, dusting for prints, etc., while Darryl sits motionless in his recliner with a dull expression on his face, paralyzed by the situation. Max joins them as they walk down the hallway, preparing for the next step of the investigation. Thelma and Louise sit in the car, and Louise looks at her as Thelma shrieks with excitement over their daring escapades, leaving Louise completely stunned and shooting her a look mixed with disbelief and admiration. Thelma puts the car in gear and floors it out of the parking lot, still looking at Louise as if she has completely lost her mind, but with a sense of newfound freedom. Hal, Max, various other cops, and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun, a pivotal moment that escalates the situation and adds urgency to their pursuit."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted  JD and Louise look at each other  Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house  JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself  Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling  She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now  As they hit the door they both break into a full run  Louise is stoic fighting tears and she sits down on the sidewalk in front of the room  Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action  Louise is still sitting on the sidewalk but slowly gets to her feet  The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we've seen so far  drive away  Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he's been shot out of a cannon  As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face  Max joins them as they walk down the hallway  Thelma and Louise sit in the car and Louise looks at her  Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma  The TBird barrels down the road at high speed as Louise  Thelma and JD pull into the motel parking lot  Louise looks at JD in the back seat and takes the keys out of the ignition  gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen  Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable  Jimmy is smiling and Thelma is watching as Louise turns to face Thelma  JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself  Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling  She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now  As they hit the door they both break into a full run  Louise is stoic fighting tears and she sits down on the sidewalk in front of the room  Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action  Louise is still sitting on the sidewalk but slowly gets to her feet  The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we've seen so far  drive away  Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he's been shot out of a cannon  As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face  Max joins them as they walk down the hallway  Thelma and Louise sit in the car and Louise looks at her  as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look  Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind  Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted. JD and Louise look at each other. Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house. Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma. The TBird barrels down the road at high speed as Louise. Thelma and JD pull into the motel parking lot. Louise looks at JD in the back seat and takes the keys out of the ignition gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen. Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable. Jimmy is smiling and Thelma is watching as Louise turns to face Thelma. JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself. Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling. She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. As they hit the door they both break into a full run. Louise is stoic fighting tears and she sits down on the sidewalk in front of the room. Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action. Louise is still sitting on the sidewalk but slowly gets to her feet. The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we have seen so far. drive away. Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he is been shot out of a cannon. As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face. Max joins them as they walk down the hallway. Thelma and Louise sit in the car and Louise looks at her as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look. Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind. Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted. JD and Louise look at each other. Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house. Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma. The TBird barrels down the road at high speed as Louise. Thelma and JD pull into the motel parking lot. Louise looks at JD in the back seat and takes the keys out of the ignition gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen. Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable. Jimmy is smiling and Thelma is watching as Louise turns to face Thelma. JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself. Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling. She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. As they hit the door they both break into a full run. Louise is stoic fighting tears and she sits down on the sidewalk in front of the room. Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action. Louise is still sitting on the sidewalk but slowly gets to her feet. The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we have seen so far. drive away. Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he is been shot out of a cannon. As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face. Max joins them as they walk down the hallway. Thelma and Louise sit in the car and Louise looks at her as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look. Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind. Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted. JD and Louise look at each other. Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house. Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma. The TBird barrels down the road at high speed as Louise. Thelma and JD pull into the motel parking lot. Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he is been shot out of a cannon. As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face. Max joins them as they walk down the hallway. Thelma and Louise sit in the car and Louise looks at her as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look. Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind. Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted. JD and Louise look at each other. Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house. Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind. Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe glides right back onto the road as if nothing unusual has happened at all, and they realize they have not been spotted. The dog and the giraffe look at each other. The robot is on the phone to the FBI man, and the squirrel is sitting on a chair looking dazed while other law enforcement types roam around the house. The rabbit, an FBI man in his early forties, is looking at the ident-a-kit drawings of the giraffe and the penguin. The T-Bird barrels down the road at high speed as the giraffe, the penguin, and the dog pull into the motel parking lot. The giraffe looks at the dog in the back seat and takes the keys out of the ignition, gets out of the car, and goes inside, where an older woman behind the counter is looking at a computer screen. The giraffe is startled and turns around quickly as the dog climbs out of the car, looking very uncomfortable. The elephant is smiling, and the penguin is watching as the giraffe turns to face the penguin. The dog attacks her again, causing the penguin to gasp, and the giraffe studies the penguin closely as she squirms in her seat, barely able to contain herself. The penguin is just laughing hysterically, and the giraffe suddenly understands, getting a bad feeling. The giraffe is already standing up, putting money on the table, while the penguin has forgotten all about the money, and they are both leaving the restaurant now. As they hit the door, they both break into a full run. The giraffe is stoic, fighting tears, and she sits down on the sidewalk in front of the room. The penguin comes and sits beside her, and neither one says anything for a moment until the giraffe quietly starts to fall apart, causing the penguin to leap into action. The giraffe is still sitting on the sidewalk but slowly gets to her feet. The rear wheel of the green T-Bird lays rubber out of the motel parking lot as the penguin and the giraffe, both looking a little rougher than we've seen so far, drive away. The robot, the FBI man, various other police and detective types pull up in front of the house, and the front door swings open to reveal the squirrel looking like he's been shot out of a cannon. As the giraffe and the penguin pull into a convenience store, police are tapping the phones, dusting for prints, etc., while the squirrel sits motionless in his recliner with a dull expression on his face. The rabbit joins them as they walk down the hallway. The penguin and the giraffe sit in the car, and the giraffe looks at her as the penguin shrieks with excitement, leaving the giraffe completely stunned and shooting her a look. The penguin puts the car in gear and floors it out of the parking lot, still looking at the giraffe as if she has completely lost her mind. The robot, the rabbit, various other cops, and the squirrel all watch as TV plays back VCR tape of the penguin in the convenience store pulling a gun."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Louise glides right back onto the runway as if nothing unusual has happened at all, and they realize they have not been spotted. J.D. and Louise look at each other. Hal is on the phone to the CIA agent, and Darryl is sitting on a sofa looking dazed while other rescue workers roam around the cabin. Max Stratton, a CIA agent in his early forties, is looking at the ident-a-kit drawings of Louise and Thelma. The convertible barrels down the highway at high speed as Louise, Thelma, and J.D. pull into the diner parking lot. Louise looks at J.D. in the back seat and takes the keys out of the ignition, gets out of the vehicle, and goes inside, where an older woman behind the stand is looking at a television screen. Louise is startled and turns around quickly as J.D. climbs out of the vehicle, looking very uncomfortable. Jimmy is smiling, and Thelma is watching as Louise turns to face Thelma. J.D. attacks her again, causing Thelma to gasp, and Louise studies Thelma closely as she squirms in her chair, barely able to contain herself. Thelma is just laughing hysterically, and Louise suddenly understands, getting a bad feeling. She is already standing up, putting coins on the counter, while Thelma has forgotten all about the coins, and they are both leaving the café now. As they hit the door, they both break into a full run. Louise is stoic, fighting tears, and she sits down on the grass in front of the cabin. Thelma comes and sits beside her, and neither one says anything for a moment until Louise quietly starts to fall apart, causing Thelma to leap into action. Louise is still sitting on the grass but slowly gets to her feet. The rear wheel of the blue convertible lays rubber out of the diner parking lot as Thelma and Louise, both looking a little rougher than we've seen so far, drive away. Hal, the CIA agent, various other medics and detective types pull up in front of the cabin, and the front door swings open to reveal Darryl looking like he's been shot out of a slingshot. As Louise and Thelma pull into a bakery, medics are tapping the radios, dusting for prints, etc., while Darryl sits motionless in his armchair with a dull expression on his face. Max joins them as they walk down the path. Thelma and Louise sit in the car, and Louise looks at her as Thelma shrieks with excitement, leaving Louise completely stunned and shooting her a look. Thelma puts the vehicle in gear and floors it out of the parking lot, still looking at Louise as if she has completely lost her mind. Hal, Max, various other medics, and Darryl all watch as TV plays back VHS tape of Thelma in the bakery pulling a crossbow."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Louise drifts right back onto the road as if nothing unusual has happened at all, and they realize they have not been overheard. J.D. and Louise glance at each other. Hal is on the phone to the FBI man, and Darryl is reclining on a chair appearing dazed while other law enforcement types wander around the house. Max Stratton, an FBI man in his early forties, is examining the ident-a-kit drawings of Louise and Thelma. The T-Bird soars down the road at high speed as Louise, Thelma, and J.D. coast into the motel parking lot. Louise gazes at J.D. in the back seat and removes the keys from the ignition, exits the car, and enters inside, where an older woman behind the counter is staring at a computer screen. Louise is startled and pivots quickly as J.D. climbs out of the car, appearing very uneasy. Jimmy is grinning, and Thelma is observing as Louise turns to face Thelma. J.D. interrupts her again, causing Thelma to gasp, and Louise observes Thelma closely as she wriggles in her seat, barely able to control herself. Thelma is just chuckling hysterically, and Louise suddenly comprehends, getting an uneasy feeling. She is already rising, placing money on the table, while Thelma has forgotten all about the money, and they are both exiting the restaurant now. As they reach the door, they both burst into a brisk walk. Louise is stoic, fighting tears, and she sits down on the sidewalk in front of the room. Thelma comes and sits beside her, and neither one says anything for a moment until Louise quietly begins to unravel, causing Thelma to jump into action. Louise is still seated on the sidewalk but slowly rises to her feet. The rear wheel of the green T-Bird screeches out of the motel parking lot as Thelma and Louise, both appearing a little rougher than we've seen so far, drive away. Hal, the FBI man, various other police and detective types pull up in front of the house, and the front door swings open to reveal Darryl looking like he's been blown out of a cannon. As Louise and Thelma pull into a convenience store, police are tapping the phones, dusting for prints, etc., while Darryl sits motionless in his recliner with a blank expression on his face. Max accompanies them as they stroll down the hallway. Thelma and Louise sit in the car, and Louise glances at her as Thelma shrieks with excitement, leaving Louise completely flabbergasted and giving her a look. Thelma puts the car in gear and accelerates out of the parking lot, still staring at Louise as if she has completely lost her mind. Hal, Max, various other cops, and Darryl all observe as TV plays back VCR tape of Thelma in the convenience store brandishing a gun."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mittens floats right back onto the bridge as if nothing unusual has happened at all, and the tomato realizes it has not been spotted. A kite and Mittens look at one another. The bicycle is on the phone to the sandwich, and the cactus is sitting on a cloud looking dazed while other seagull types roam around the castle. Captain Crunch, a sandwich in its early forties, is looking at the ident-a-kit drawings of Mittens and Snacks. The skateboard barrels down the bridge at high speed as Mittens, Snacks, and a kite pull into the museum parking lot. Mittens looks at the kite in the back seat and takes the strings out of the microphone, gets out of the guitar, and goes inside, where an older dolphin behind the curtain is looking at a telescope. Mittens is startled and turns around quickly as a kite climbs out of the guitar, looking very uncomfortable. The umbrella is smiling, and Snacks is watching as Mittens turns to face Snacks. The kite attacks her again, causing Snacks to gasp, and Mittens studies Snacks closely as she squirms in her cloud, barely able to contain herself. Snacks is just laughing hysterically, and Mittens suddenly understands, getting a bad feeling. She is already standing up, putting marbles on the spoon, while Snacks has forgotten all about the marbles, and they are both leaving the tower now. As they hit the ladder, they both break into a full run. Mittens is stoic, fighting feathers, and she sits down on the catwalk in front of the cabin. Snacks comes and sits beside her, and neither one says anything for a moment until Mittens quietly starts to fall apart, causing Snacks to leap into action. Mittens is still sitting on the catwalk but slowly gets to her feet. The rear wheel of the orange skateboard lays rubber out of the museum parking lot as Snacks and Mittens, both looking a little rougher than we've seen so far, drive away. The bicycle, the sandwich, various other seagulls and detective types pull up in front of the castle, and the front ladder swings open to reveal the cactus looking like it's been shot out of a cannon. As Mittens and Snacks pull into a department store, seagulls are tapping the microwaves, dusting for shoes, etc., while the cactus sits motionless in its hammock with a dull expression on its cloud. Captain Crunch joins them as they walk down the staircase. Snacks and Mittens sit in the guitar, and Mittens looks at her as Snacks shrieks with excitement, leaving Mittens completely stunned and shooting her a look. Snacks puts the guitar in gear and floors it out of the parking lot, still looking at Mittens as if she has completely lost her mind. The bicycle, Captain Crunch, various other kiwis, and the cactus all watch as TV plays back VCR tape of Snacks in the department store pulling a balloon."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Margaret drifts right back onto the sidewalk as if nothing surprising has occurred at all, and they realize they have not been noticed. Paul and Margaret glance at each other. Bill is on the radio to the CIA agent, and Tim is lounging on a bench looking puzzled while other security personnel meander around the garden. Alex Peters, a CIA agent in his mid-thirties, is staring at the ident-a-kit images of Margaret and Clara. The Mustang races down the street at top speed as Margaret, Clara, and Paul maneuver into the hotel parking area. Margaret glances at Paul in the rear seat and removes the keys from the ignition, exits the vehicle, and enters the building, where an elderly gentleman behind the counter is staring at a television screen. Margaret is shocked and spins around suddenly as Paul climbs out of the vehicle, looking very uneasy. Steve is grinning, and Clara is watching as Margaret turns to face Clara. Paul hugs her again, causing Clara to gasp, and Margaret observes Clara closely as she fidgets in her seat, barely able to hold herself together. Clara is just laughing uncontrollably, and Margaret suddenly comprehends, getting a sense of dread. She is already standing up, placing cash on the counter, while Clara has forgotten all about the cash, and they are both exiting the cafe now. As they reach the exit, they both burst into a full sprint. Margaret is stoic, holding back tears, and she crouches down on the curb in front of the suite. Clara arrives and crouches beside her, and neither one speaks for a moment until Margaret quietly begins to unravel, prompting Clara to rush into motion. Margaret is still crouched on the curb but slowly rises to her feet. The back tire of the red Mustang burns rubber out of the hotel parking area as Clara and Margaret, both appearing a bit rougher than we've seen so far, drive away. Bill, the CIA agent, various other enforcement and investigation personnel pull up in front of the garden, and the front gate swings open to reveal Tim looking like he's been shot out of a catapult. As Margaret and Clara pull into a mini-mart, authorities are tapping the lines, dusting for evidence, etc., while Tim sits still in his armchair with a blank look on his face. Alex joins them as they stroll down the corridor. Clara and Margaret sit in the vehicle, and Margaret glances at her as Clara screams with joy, leaving Margaret utterly bewildered and giving her a look. Clara shifts the vehicle into gear and zooms out of the parking area, still staring at Margaret as if she has completely lost her senses. Bill, Alex, various other officers, and Tim all watch as TV plays back the CCTV footage of Clara in the mini-mart brandishing a bat."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Louise drifts smoothly back onto the sidewalk as if nothing peculiar has occurred at all, and they realize they have not been noticed. J.D. and Louise glance at each other. Hal is scribbling a letter to the IRS agent, and Darryl is lounging on a sofa looking confused while other maintenance workers amble around the garden. Max Stratton, an IRS agent in his early forties, is observing the cartoon sketches of Louise and Thelma. The T-Bird skates down the river at moderate speed as Louise, Thelma, and J.D. roll into the library parking area. Louise glances at J.D. in the back seat and pulls the map out of the glove compartment, steps out of the boat, and strolls inside, where an older man behind the counter is squinting at a television set. Louise is surprised and spins around abruptly as J.D. hops out of the boat, looking very uneasy. Jimmy is grinning, and Thelma is observing as Louise turns to gaze at Thelma. J.D. nudges her again, causing Thelma to gasp, and Louise scrutinizes Thelma closely as she fidgets in her chair, hardly able to contain herself. Thelma is just giggling uncontrollably, and Louise suddenly discerns, getting an unsettling feeling. She is already standing upright, placing coins on the bench, while Thelma has forgotten all about the coins, and they are both exiting the bakery now. As they reach the gate, they both burst into a full sprint. Louise is impassive, holding back laughter, and she crouches down on the lawn in front of the building. Thelma arrives and crouches beside her, and neither one speaks for a moment until Louise quietly starts to crumble, causing Thelma to spring into motion. Louise is still crouching on the lawn but slowly rises to her feet. The front wheel of the red T-Bird skids out of the library parking area as Thelma and Louise, both looking a little scrappier than we've seen so far, float away. Hal, the IRS agent, various other technicians and maintenance types pull up in front of the garden, and the side gate swings open to reveal Darryl looking like he's been thrown out of a slingshot. As Louise and Thelma roll into a hardware store, technicians are switching the lights, searching for bugs, etc., while Darryl reclines motionless in his hammock with a vacant expression on his face. Max meets them as they stroll down the driveway. Thelma and Louise sit in the boat, and Louise gazes at her as Thelma squeals with delight, leaving Louise completely bewildered and glaring at her. Thelma puts the boat in reverse and coasts out of the parking area, still watching Louise as if she has completely lost her mind. Hal, Max, various other technicians, and Darryl all watch as TV plays back VCR tape of Thelma in the hardware store holding a wrench."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sandra floats left onto the sidewalk as if something ordinary has happened at all, and they understand they have not been noticed. Greg and Sandra glance at one another. Roy is on the walkie-talkie to the CIA agent, and Morris is standing on a stool appearing confused while other wildlife officers wander around the barn. Nick Gordon, a CIA agent in his mid-thirties, is examining the sketch artist renditions of Sandra and Tina. The Corvette zips along the freeway at maximum velocity as Sandra, Tina, and Greg drive into the hotel garage. Sandra glances at Greg in the trunk and removes the remote from the dashboard, exits the van, and strides inside, where a young man behind the soda machine is staring at a television screen. Sandra is surprised and spins around slowly as Greg clambers out of the truck, appearing very anxious. Sam is laughing, and Tina is observing as Sandra turns to face Tina. Greg embraces her again, prompting Tina to chuckle, and Sandra observes Tina closely as she adjusts in her stool, barely able to calm herself. Tina is merely giggling uncontrollably, and Sandra abruptly perceives, getting a strange sensation. She is already pacing, placing coins on the stool, while Tina has ignored all about the coins, and they are both entering the casino now. As they reach the gate, they both start into a brisk jog. Sandra is composed, holding back sobs, and she leans down on the grass in front of the cabin. Tina arrives and leans beside her, and neither one utters anything for a while until Sandra silently starts to break down, prompting Tina to spring into motion. Sandra is still leaning on the grass but gradually rises to her toes. The front tire of the purple Corvette squeals pavement out of the hotel garage as Tina and Sandra, both appearing a bit scruffier than we've witnessed so far, zoom away. Roy, the CIA agent, numerous other soldiers and spy figures arrive in front of the barn, and the back door flies open to show Morris appearing like he's been shot out of a catapult. As Sandra and Tina steer into a grocery store, spies are monitoring the televisions, searching for traces, etc., while Morris remains still in his hammock with a vacant look on his face. Nick joins them as they stroll down the corridor. Tina and Sandra recline in the van, and Sandra glances at her as Tina squeals with joy, leaving Sandra utterly flabbergasted and giving her a glance. Tina shifts the van in motion and accelerates out of the garage, still glancing at Sandra as if she has completely lost her senses. Roy, Nick, numerous other soldiers, and Morris all observe as radio broadcasts audio clip of Tina in the grocery store brandishing a sword."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Louise smoothly returns to the road, unseen. J.D., Louise, and Thelma drive quickly to a motel. Inside, Louise and Thelma experience tension, with Thelma laughing hysterically and Louise feeling uneasy. They leave the restaurant, breaking into a run, overwhelmed with emotion. Sitting outside the motel, Louise struggles emotionally until Thelma comforts her. They depart in their T-Bird, looking worn. Meanwhile, Hal, the FBI, and local police search their house while Darryl sits dazed. Max joins the investigation. Thelma and Louise, in their car, show contrasting emotions; Thelma is exhilarated, while Louise is stunned. As they leave a convenience store, the police watch a video of Thelma holding a gun."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind  as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look  Thelma and Louise sit in the car and Louise looks at her  Max joins them as they walk down the hallway  As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face  Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he's been shot out of a cannon  drive away  The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we've seen so far  Louise is still sitting on the sidewalk but slowly gets to her feet  Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action  Louise is stoic fighting tears and she sits down on the sidewalk in front of the room  As they hit the door they both break into a full run  She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now  Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling  JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself  Jimmy is smiling and Thelma is watching as Louise turns to face Thelma  Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable  gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen  Louise looks at JD in the back seat and takes the keys out of the ignition  Thelma and JD pull into the motel parking lot  The TBird barrels down the road at high speed as Louise  Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma  Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house  JD and Louise look at each other  Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Louise is still sitting on the sidewalk but slowly gets to her feet  Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face  The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we've seen so far  Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he's been shot out of a cannon  Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling  Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action  JD and Louise look at each other  gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen  Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted  Max joins them as they walk down the hallway  Jimmy is smiling and Thelma is watching as Louise turns to face Thelma  Louise is stoic fighting tears and she sits down on the sidewalk in front of the room  Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind  Thelma and JD pull into the motel parking lot  drive away  She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now  Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house  Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma  as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look  Louise looks at JD in the back seat and takes the keys out of the ignition  The TBird barrels down the road at high speed as Louise  Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable  JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself  As they hit the door they both break into a full run  Thelma and Louise sit in the car and Louise looks at her "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As they hit the door they both break into a full run  Louise is stoic fighting tears and she sits down on the sidewalk in front of the room  Thelma comes and sits beside her and neither one says anything for a moment until Louise quietly starts to fall apart causing Thelma to leap into action  Louise is still sitting on the sidewalk but slowly gets to her feet  The rear wheel of the green TBird lays rubber out of the motel parking lot as Thelma and Louise both looking a little rougher than we've seen so far  drive away  Hal the FBI man various other police and detective types pull up in front of the house and the front door swings open to reveal Darryl looking like he's been shot out of a cannon  As Louise and Thelma pull into a convenience store police are tapping the phones dusting for prints etc while Darryl sits motionless in his recliner with a dull expression on his face  Max joins them as they walk down the hallway  Thelma and Louise sit in the car and Louise looks at her  as Thelma shrieks with excitement leaving Louise completely stunned and shooting her a look  Thelma puts the car in gear and floors it out of the parking lot still looking at Louise as if she has completely lost her mind  Hal Max various other cops and Darryl all watch as TV plays back VCR tape of Thelma in the convenience store pulling a gun Louise glides right back onto the road as if nothing unusual has happened at all and they realize they have not been spotted  JD and Louise look at each other  Hal is on the phone to the FBI man and Darryl is sitting on a chair looking dazed while other law enforcement types roam around the house  Max Stratton an FBI man in his early forties is looking at the identakit drawings of Louise and Thelma  The TBird barrels down the road at high speed as Louise  Thelma and JD pull into the motel parking lot  Louise looks at JD in the back seat and takes the keys out of the ignition  gets out of the car and goes inside where an older woman behind the counter is looking at a computer screen  Louise is startled and turns around quickly as JD climbs out of the car looking very uncomfortable  Jimmy is smiling and Thelma is watching as Louise turns to face Thelma  JD attacks her again causing Thelma to gasp and Louise studies Thelma closely as she squirms in her seat barely able to contain herself  Thelma is just laughing hysterically and Louise suddenly understands getting a bad feeling  She is already standing up putting money on the table while Thelma has forgotten all about the money and they are both leaving the restaurant now "
        }
      ]
    }
  ]
}