{
  "ground_truth": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. A FINGER reaches up and presses down the lever and hangs up the phone. She has her finger on the lever. Louise is still standing there holding the phone. Thelma stops and looks at her. Max, still holding the phone, is surprised by this outburst. Louise is surprised to be hearing this from Thelma. They are both quiet for a moment. Louise starts the car. They lurch into reverse then screech forward as they tear off down the road. As they fly down the road, Louise and Thelma both get quiet for a second. They are both laughing. The car is still flying down the road. The sun is coming higher in the sky now. They come to an intersection in the middle of nowhere. They turn off onto a dirt road and pull to a stop. The Trucker reaches over and opens a glove compartment crammed full of condoms. He grabs a few and shoves them in his pocket. He turns off his engine and gets out of the truck. He walks up to the car. Louise and Thelma get out of the car. Louise nods. This is not what is supposed to be happening. He is getting a little panicky. Louise pulls the gun they stole from the State Patrolman. He looks at the gun. Louise looks at his truck off in the distance. She points the gun at it, takes a second to get a bead, then shoots two of the tires flat. The truck slowly sinks as the air escapes from the tires. Louise and Thelma look at each other. They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire. The truck driver screams at the top of his lungs. Louise starts the car and starts driving in circles around the truck driver. Thelma and Louise are both howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot. It does look like an Army. More police cars have joined, and from every direction, police cars are swarming across the desert, although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them, looking larger every moment, is the awesome splendor of the Grand Canyon.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They are both silent for a moment. Louise proceeds a little quicker. Hal grins. The surveillance man gestures to Hal to maintain it ongoing. Louise's eyes become wide as she perceives this. A FINGER ascends and depresses the lever and hangs up the phone. She has her finger on the lever. Louise is still standing there gripping the phone. Thelma halts and glances at her. Max, still clutching the phone, is astonished by this outburst. Louise is astonished to be perceiving this from Thelma. They are both silent for a moment. Louise begins the vehicle. They jolt into reverse then screech onward as they speed down the road. As they dash down the road, Louise and Thelma both become silent for a moment. They are both giggling. The vehicle is still racing down the road. The sun is ascending higher in the sky now. They arrive at a crossroads in the middle of nowhere. They veer onto a dirt road and pull to a halt. The Trucker extends over and opens a glove compartment packed full of condoms. He snatches a few and thrusts them in his pocket. He shuts off his engine and exits the truck. He strides up to the car. Louise and Thelma exit the car. Louise acknowledges. This is not what is intended to be occurring. He is becoming a little anxious. Louise draws the weapon they pilfered from the State Patrolman. He glances at the weapon. Louise gazes at his truck off in the distance. She aims the weapon at it, takes a moment to get a bead, then shoots two of the tires flat. The truck gradually sinks as the air leaks from the tires. Louise and Thelma glance at each other. They both pivot towards the truck and fire rounds into the tankers until they detonate in a massive ball of fire. The truck driver shrieks at the top of his lungs. Louise starts the vehicle and begins driving in circles around the truck driver. Thelma and Louise are both howling at the top of their lungs. A continuous stream of state police cars pulls out of the parking lot with lights flashing while other policemen are sprinting to their cars still parked in the lot. It does appear like an Army. More police cars have arrived, and from every direction, police cars are swarming across the desert, although none are ahead of them. Thelma is gazing way up ahead in the distance. Behind them is a massive wall of dust generated by all the police cars following them. In front of them, appearing larger every moment, is the magnificent grandeur of the Grand Canyon."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "For a second, silence is maintained by both of them. A little faster pace is adopted by Louise. A smile is given by Hal. Hal is motioned by the surveillance man to keep it going. As this is heard, Louise's eyes widen. The lever is reached up to and pressed down by a FINGER, and the phone is hung up. Her finger is on the lever. The phone is still held by Louise as she stands there. Thelma stops and looks at her. Max, still holding the phone, surprises this outburst. Thelma surprises Louise with this statement. For a moment, silence is maintained by both of them. The car is started by Louise. Into reverse, they lurch, then forward they screech as the road is torn off down. As the road is flown down, Louise and Thelma both maintain silence for a second. Laughter is shared by both of them. The road is still flown down by the car. Now, higher in the sky, the sun is coming. An intersection is approached in the middle of nowhere. Onto a dirt road, they turn off and pull to a stop. The glove compartment, crammed full of condoms, is opened by the Trucker. A few are grabbed by him and shoved into his pocket. The engine is turned off by him, and the truck is exited. The car is approached by him. The car is exited by Louise and Thelma. A nod is given by Louise. This is not supposed to be happening. A little panic is being experienced by him. The gun stolen from the State Patrolman is pulled by Louise. The gun is looked at by him. The truck, off in the distance, is looked at by Louise. At it, she points the gun, takes a second to aim, then two of the tires are shot flat by her. As the air escapes from the tires, the truck slowly sinks. Each other is looked at by Louise and Thelma. Towards the truck, they both turn and rounds are fired into the tankers until a huge ball of fire explodes. A scream is let out by the truck driver at the top of his lungs. The car is started by Louise and driven in circles around the truck driver. Both Thelma and Louise are howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen run to their cars, still parked in the lot. An Army is what it looks like. More police cars have joined, and police cars swarm across the desert from every direction, although none are in front of them. Up ahead in the distance, Thelma is looking. A huge wall of dust, created by all the police cars following them, is behind them. In front of them, larger every moment, is the awesome splendor of the Grand Canyon."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They go quiet for a moment. Louise speeds up. Hal smiles. The surveillance man signals Hal to keep going. Louise's eyes widen as she hears this. A finger presses the lever, ending the call—Louise's finger. She’s still holding the phone. Thelma stops and looks at her. Max, still holding the phone, is surprised by the outburst. Louise is shocked to hear this from Thelma. They’re silent briefly. Louise starts the car, jerking into reverse before screeching forward. As they speed off, both laugh in a shared moment of silence. The sun rises higher. At a remote intersection, they turn onto a dirt road and stop. The trucker grabs condoms from an overstuffed glove compartment, pockets them, shuts off the engine, and approaches the car. Louise and Thelma step out. Louise nods—this isn’t how it’s supposed to go. The trucker grows uneasy. Louise pulls the stolen gun. He sees it. She eyes his truck in the distance, aims, and flattens two tires. The truck deflates slowly. Thelma and Louise exchange looks, then fire into the tankers until they erupt in flames. The trucker screams. Louise drives circles around him as both women howl wildly. A stream of state police cars leaves a lot, sirens blaring, while others race to join. It resembles an army. Police cars flood in from all directions, though none are ahead. Thelma stares forward. Behind, a giant dust cloud from the pursuing police looms. Ahead, the vast Grand Canyon grows ever closer."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They are silent for a moment. Louise speeds up. Hal smiles. The surveillance man signals Hal to continue. Louise's eyes widen. A finger presses the lever, hanging up the phone. Louise holds the phone, surprised by Thelma's outburst. They are quiet again. Louise starts the car, reversing and screeching forward. As they speed down the road, they laugh. The sun rises higher. At an intersection, they turn onto a dirt road and stop. The Trucker opens a glove compartment full of condoms, grabs some, and approaches the car. Louise and Thelma exit the car. Louise nods, pulls a stolen gun, and shoots two truck tires flat. The truck sinks as air escapes. They fire at the tankers, causing a massive explosion. The truck driver screams. Louise drives circles around him as they howl. State police cars, like an army, swarm the desert, none ahead of them. Thelma looks ahead at the Grand Canyon, with a dust wall behind from pursuing police cars."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "For a brief moment, they both fall into a shared silence. Louise, feeling a sense of urgency, accelerates slightly. Hal, observing the situation, breaks into a smile. The man monitoring the surveillance gestures subtly to Hal, encouraging him to maintain the momentum. Louise's eyes widen in surprise as she becomes aware of this exchange. A finger, with deliberate intent, reaches up and firmly presses down on the lever, effectively hanging up the phone. It is her finger that rests on the lever. Louise remains standing there, still holding the phone in her hand. Thelma pauses in her tracks and turns to look at her friend. Max, who is also holding a phone, is taken aback by this unexpected outburst. Louise, too, is caught off guard by Thelma's reaction. Once again, they both lapse into a moment of silence. Louise then starts the car, and with a sudden jolt, they lurch into reverse before screeching forward, tearing off down the road with determination. As they speed along the road, both Louise and Thelma fall silent for another brief second. Their silence soon gives way to laughter, filling the car as it continues to fly down the road. The sun is now climbing higher in the sky, casting its light over the landscape. They reach an intersection situated in the middle of nowhere and decide to turn onto a dirt road, where they come to a stop. The Trucker, sitting in his vehicle, reaches over to open a glove compartment that is crammed full of condoms. He grabs a handful and stuffs them into his pocket before turning off his engine and stepping out of the truck. He approaches the car where Louise and Thelma are seated. Both women exit the car, and Louise gives a nod. This situation is not unfolding as expected, and he begins to feel a rising sense of panic. Louise retrieves the gun they had taken from the State Patrolman. The Trucker's eyes fixate on the weapon. Louise shifts her gaze to his truck, which is parked at a distance. She aims the gun at it, taking a moment to steady her aim, and then fires, flattening two of the tires. The truck gradually sinks as the air hisses out of the punctured tires. Louise and Thelma exchange a look of understanding. Together, they turn towards the truck and unleash a barrage of gunfire into the tankers, which erupt into a massive ball of fire. The truck driver lets out a scream at the top of his lungs. Louise starts the car once more and begins driving in circles around the truck driver. Both Thelma and Louise are howling with exhilaration, their voices echoing in the open air. Meanwhile, a steady stream of state police cars emerges from the parking lot, their lights flashing urgently, while other officers sprint to their vehicles still parked in the lot. The scene resembles an advancing army. More police cars join the pursuit, converging from every direction and swarming across the desert, though none manage to get in front of them. Thelma gazes far ahead into the distance. Behind them, a massive wall of dust rises, kicked up by the multitude of police cars in hot pursuit. Ahead of them, growing larger with each passing moment, is the breathtaking and awe-inspiring grandeur of the Grand Canyon."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "For a brief and fleeting moment, they both descend into a shared silence, feeling the weight of the unspoken words hang in the air. Louise, sensing a pressing need for urgency, slightly increases her speed with determination. Hal, observing the unfolding situation with keen interest, breaks into a broad, knowing smile. The man tasked with monitoring the surveillance, watching the scene intently, gestures ever so subtly to Hal, signaling encouragement to keep the momentum alive. Louise's eyes widen in surprise and disbelief as she becomes acutely aware of this silent exchange. A finger, acting with deliberate and decisive intent, reaches upward and firmly presses down on the lever, efficiently hanging up the phone call. It is her own finger that confidently rests on the lever. Louise remains standing there, momentarily frozen, still holding the phone in her hand. Thelma pauses unexpectedly in her tracks and turns to cast a concerned look at her friend. Max, who is also in the midst of holding a phone, is taken aback and startled by this sudden and unexpected outburst. Louise, too, is caught off guard and surprised by Thelma's reaction. Once again, they both slip into another moment of silence, the gravity of the situation settling in. Louise then starts the car, and with a sudden jolt of movement, they lurch into reverse before screeching forward, tearing off down the road with determination and resolve. As they speed along the seemingly endless road, both Louise and Thelma fall silent for another brief second. Their momentary silence soon gives way to uncontrollable laughter, filling the confines of the car as it continues to fly down the road. The sun is now climbing higher in the vast sky, casting its bright, warming light over the sprawling landscape. They reach an intersection situated seemingly in the middle of nowhere and make the decision to turn onto a dirt road, where they come to an eventual stop. The Trucker, sitting alone in his vehicle, reaches over to open a glove compartment that is crammed full of condoms. He grabs a handful of them and stuffs them into his pocket before turning off his engine and stepping out of the truck with a sense of purpose. He approaches the car where Louise and Thelma are seated, both women exiting the car in unison, and Louise gives a knowing nod. The situation is not unfolding as expected, leading him to feel a rising and palpable sense of panic. Louise retrieves the gun they had previously taken from the State Patrolman. The Trucker's eyes are fixated on the weapon with a mix of fear and disbelief. Louise shifts her determined gaze to his truck, which is parked at a distance, and she aims the gun at it, taking a moment to steady her aim, and then fires, instantly flattening two of the tires. The truck gradually sinks lower as the air hisses out of the punctured tires. Louise and Thelma exchange a meaningful look of understanding and shared purpose. Together, with a sense of camaraderie, they turn towards the truck and unleash a barrage of gunfire into the tankers, which erupt spectacularly into a massive, fiery ball of fire. The truck driver lets out a scream at the top of his lungs, his fear echoing through the air. Louise starts the car once more and begins driving in circles around the truck driver, creating a dizzying spectacle. Both Thelma and Louise are howling with exhilaration, their voices echoing joyfully in the open air. Meanwhile, a steady stream of state police cars emerges from the parking lot, their lights flashing urgently and with purpose, while other officers sprint to their vehicles still parked in the lot. The scene resembles an advancing army, ready for action. More police cars join the ever-growing pursuit, converging from every direction and swarming across the vast desert, though none manage to get in front of them. Thelma gazes far ahead into the distance, eyes filled with anticipation. Behind them, a massive wall of dust rises ominously, kicked up by the multitude of police cars in relentless pursuit. Ahead of them, growing larger and more imposing with each passing moment, is the breathtaking and awe-inspiring grandeur of the Grand Canyon."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They both fall into a brief silence, a momentary pause that hangs in the air. Louise, feeling a surge of urgency, presses her foot down on the accelerator, causing the car to pick up speed. Hal, observing the situation, allows a smile to spread across his face, a silent acknowledgment of the unfolding events. The surveillance man, stationed nearby, subtly gestures to Hal, encouraging him to maintain the momentum of the situation. Louise's eyes widen in response to the unspoken communication, her mind racing as she processes the implications. A finger, seemingly detached from the rest of the world, reaches up with deliberate intent and presses down on the lever, effectively hanging up the phone. Louise's finger remains poised on the lever, a testament to her lingering hesitation. She stands there, still clutching the phone, as if tethered to the moment. Thelma, sensing a shift, halts her actions and turns her gaze towards Louise, her expression a mix of curiosity and concern. Max, who is also holding a phone, is taken aback by the sudden and unexpected outburst, his surprise evident in his widened eyes. Louise, too, is caught off guard, her mind reeling as she registers Thelma's unexpected words. They both lapse into another moment of silence, a shared understanding passing between them. Louise, breaking the stillness, starts the car, the engine roaring to life. With a jolt, they lurch into reverse, the tires screeching against the pavement before they propel forward, tearing down the road with reckless abandon. As they hurtle down the road, the wind whipping through the open windows, Louise and Thelma both fall silent once more, a shared moment of introspection. Suddenly, laughter erupts from both of them, a cathartic release of tension as the car continues to speed down the road. The sun climbs higher in the sky, casting long shadows across the landscape. They approach an intersection, seemingly in the middle of nowhere, and make a sharp turn onto a dirt road, the car coming to a halt in a cloud of dust. The Trucker, sitting in his vehicle, reaches over to the glove compartment, which is crammed full of condoms. He grabs a handful, shoving them into his pocket with a sense of urgency. Turning off his engine, he exits the truck and strides purposefully towards the car. Louise and Thelma, sensing the impending confrontation, step out of the car. Louise nods, acknowledging the gravity of the situation, aware that this is not how things were supposed to unfold. The Trucker, feeling a rising sense of panic, watches as Louise retrieves the gun they had previously taken from the State Patrolman. His eyes fixate on the weapon, a mix of fear and disbelief etched across his face. Louise shifts her gaze to his truck, parked in the distance, and with a steady hand, she aims the gun, taking a moment to steady her aim before firing, flattening two of the tires. The truck begins to sink slowly as the air hisses out of the punctured tires. Louise and Thelma exchange a glance, a silent agreement passing between them. Together, they turn towards the truck, their resolve unwavering, and unleash a barrage of gunfire into the tankers, which erupt into a massive ball of fire. The truck driver, overwhelmed by the chaos, screams at the top of his lungs, his voice lost in the roar of the flames. Louise, unfazed, starts the car once more, maneuvering it in circles around the truck driver, the tires kicking up dust as Thelma and Louise howl with exhilaration. Meanwhile, a steady stream of state police cars emerges from the parking lot, their lights flashing ominously, while other officers sprint towards their vehicles, eager to join the pursuit. The scene resembles an army mobilizing for battle, a formidable force converging on the desert landscape. More police cars join the chase, swarming from every direction, yet none manage to position themselves in front of the fleeing duo. Thelma, her eyes fixed on the horizon, spots the magnificent expanse of the Grand Canyon looming ever larger in the distance, its breathtaking splendor growing more imposing with each passing moment. Behind them, a massive wall of dust rises, a testament to the relentless pursuit of the police cars trailing them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Louise and Hal share a brief moment of silence before Louise accelerates the car, prompted by a signal from the surveillance man. Louise, surprised by Thelma's reaction, hangs up the phone and starts the car. They reverse abruptly and speed down the road, laughing as the sun rises higher in the sky. Reaching a remote intersection, they turn onto a dirt road and stop. A trucker, after pocketing some condoms from his glove compartment, approaches them. Louise and Thelma exit the car, and Louise, feeling uneasy, draws a gun they took from a State Patrolman. She shoots two tires of the truck, causing it to deflate, and then they both fire at the tankers, igniting a massive explosion. As the truck driver screams, Louise drives circles around him while she and Thelma howl with excitement. Meanwhile, a large convoy of state police cars, resembling an army, pursues them across the desert, creating a massive dust cloud. Ahead, the Grand Canyon looms larger with each passing moment."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They are both quiet for a second, absorbing the gravity of their situation. Louise, driving a classic 1966 Ford Thunderbird known for its powerful engine and iconic design, goes a little faster. Hal smiles, aware of the high stakes. The surveillance man, an FBI operative assigned to track them due to their interstate flight, motions to Hal to keep it going. Louise's eyes get wide as she hears this, realizing the increasing danger. A FINGER reaches up and presses down the lever, a traditional method used to end a call on old rotary phones, and hangs up the phone. She has her finger on the lever, feeling the finality. Louise is still standing there holding the phone, an instrument now silent but heavy with implication. Thelma stops and looks at her, her expression tinged with uncertainty. Max, still holding the receiver, is surprised by this outburst of tension. Louise is surprised to be hearing this from Thelma, her trusted friend since childhood. They are both quiet for a moment, contemplating their next move. Louise starts the car, a lifeline in their escape. They lurch into reverse then screech forward as they tear off down the road, tires spitting gravel. As they fly down the road, escaping the tightening net, Louise and Thelma both get quiet for a second, the wind roaring through open windows. They are both laughing, a cathartic release in the face of impending doom. The car is still flying down the road, the landscape blurring past. The sun is coming higher in the sky now, bathing the desert in a harsh, unforgiving light. They come to an intersection in the middle of nowhere, a crossroad that symbolizes their uncertain future. They turn off onto a dirt road and pull to a stop, dust swirling in their wake. The Trucker, a long-haul driver transporting goods across the country, reaches over and opens a glove compartment crammed full of condoms, a testament to his transient lifestyle. He grabs a few and shoves them in his pocket, a gesture of casual preparation. He turns off his engine and gets out of the truck, his curiosity piqued. He walks up to the car, unaware of the danger. Louise and Thelma get out of the car, facing him with resolve. Louise nods, signifying a silent understanding. This is not what is supposed to be happening, the tension palpable. He is getting a little panicky, sensing the shift in power. Louise pulls the gun they stole from the State Patrolman, an act that has now branded them as fugitives. He looks at the gun, its cold steel glinting in the sun. Louise looks at his truck off in the distance, a behemoth of the highway now an obstacle in their path. She points the gun at it, takes a second to get a bead, then shoots two of the tires flat, a strategic move to immobilize. The truck slowly sinks as the air escapes from the tires, a deflated symbol of resistance. Louise and Thelma look at each other, a shared recognition of the gravity of their actions. They both turn towards the truck and fire rounds into the tankers, fuel tanks filled with hazardous material, until they explode in a huge ball of fire, an inferno that lights up the desert sky. The truck driver screams at the top of his lungs, a sound drowned by the roar of flames. Louise starts the car and starts driving in circles around the truck driver, a taunting dance of defiance. Thelma and Louise are both howling at the top of their lungs, voices rising above the chaos. A steady stream of state police cars pulls out of the parking lot with lights flashing, mobilized by reports of their explosive confrontation, while other policemen are running to their cars still parked in the lot, a frenzy of blue uniforms and urgency. It does look like an Army, a formidable force amassed against them. More police cars have joined, and from every direction, police cars are swarming across the desert, a relentless tide closing in, although none are in front of them. Thelma is looking way up ahead in the distance, her gaze fixed on the horizon. Behind them is a huge wall of dust created by all the police cars following them, a relentless storm of pursuit. In front of them, looking larger every moment, is the awesome splendor of the Grand Canyon, a vast and majestic chasm offering a final, breathtaking escape."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They are both quiet for a second  Louise goes a little faster  Hal smiles  The surveillance man motions to Hal to keep it going  Louise's eyes get wide as she hears this  A FINGER reaches up and presses down the lever and hangs up the phone  She has her finger on the lever  The Trucker reaches over and opens a glove compartment crammed full of condoms  He grabs a few and shoves them in his pocket  He turns off his engine and gets out of the truck  He walks up to the car  Louise and Thelma get out of the car  Louise nods  This is not what is supposed to be happening  He is getting a little panicky  Louise pulls the gun they stole from the State Patrolman  He looks at the gun  Louise looks at his truck off in the distance  She points the gun at  it takes a second to get a bead then shoots two of the tires flat  The truck slowly sinks as the air escapes from the tires  Louise and Thelma look at each other  They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire  The truck driver screams at the top of his lungs  Louise starts the car and starts driving in circles around the truck driver  Thelma and Louise are both howling at the top of their lungs  A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot  It does look like an Army  More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them  Thelma is looking way up ahead in the distance  Louise is still standing there holding the phone  Thelma stops and looks at her  Max still holding the phone is surprised by this outburst  Louise is surprised to be hearing this from Thelma  They are both quiet for a moment  Louise starts the car  They lurch into reverse then screech forward as they tear off down the road  As they fly down the road Louise and Thelma both get quiet for a second  They are both laughing  The car is still flying down the road  The sun is coming higher in the sky now  They come to an intersection in the middle of nowhere  They turn off onto a dirt road and pull to a stop  The Trucker reaches over and opens a glove compartment crammed full of condoms  He grabs a few and shoves them in his pocket  He turns off his engine and gets out of the truck  He walks up to the car  Louise and Thelma get out of the car  Louise nods  This is not what is supposed to be happening  He is getting a little panicky  Louise pulls the gun they stole from the State Patrolman  He looks at the gun  Louise looks at his truck off in the distance  She points the gun at  it takes a second to get a bead then shoots two of the tires flat  The truck slowly sinks as the air escapes from the tires  Louise and Thelma look at each other  They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire  The truck driver screams at the top of his lungs  Louise starts the car and starts driving in circles around the truck driver  Thelma and Louise are both howling at the top of their lungs  A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot  It does look like an Army  More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them  Thelma is looking way up ahead in the distance  Behind them is a huge wall of dust created by all the police cars following them  In front of them looking larger  every moment is the awesome splendor of the Grand Canyon"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. A FINGER reaches up and presses down the lever and hangs up the phone. She has her finger on the lever. Louise is still standing there holding the phone. Thelma stops and looks at her. Max still holding the phone is surprised by this outburst. Louise is surprised to be hearing this from Thelma. They are both quiet for a moment. Louise starts the car. They lurch into reverse then screech forward as they tear off down the road. As they fly down the road Louise and Thelma both get quiet for a second. They are both laughing. The car is still flying down the road. The sun is coming higher in the sky now. They come to an intersection in the middle of nowhere. They turn off onto a dirt road and pull to a stop. The Trucker reaches over and opens a glove compartment crammed full of condoms. He grabs a few and shoves them in his pocket. He turns off his engine and gets out of the truck. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. He walks up to the car. Louise and Thelma get out of the car. Louise nods. This is not what is supposed to be happening. He is getting a little panicky. Louise pulls the gun they stole from the State Patrolman. He looks at the gun. Louise looks at his truck off in the distance. She points the gun at. it takes a second to get a bead then shoots two of the tires flat. The truck slowly sinks as the air escapes from the tires. Louise and Thelma look at each other. They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire. The truck driver screams at the top of his lungs. Louise starts the car and starts driving in circles around the truck driver. Thelma and Louise are both howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot. It does look like an Army. More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them looking larger. every moment is the awesome splendor of the Grand Canyon."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. A FINGER reaches up and presses down the lever and hangs up the phone. She has her finger on the lever. Louise is still standing there holding the phone. Thelma stops and looks at her. Max still holding the phone is surprised by this outburst. Louise is surprised to be hearing this from Thelma. They are both quiet for a moment. Louise starts the car. They lurch into reverse then screech forward as they tear off down the road. As they fly down the road Louise and Thelma both get quiet for a second. They are both laughing. The car is still flying down the road. The sun is coming higher in the sky now. They come to an intersection in the middle of nowhere. They turn off onto a dirt road and pull to a stop. The Trucker reaches over and opens a glove compartment crammed full of condoms. He grabs a few and shoves them in his pocket. He turns off his engine and gets out of the truck. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He walks up to the car. Louise and Thelma get out of the car. Louise nods. This is not what is supposed to be happening. He is getting a little panicky. Louise pulls the gun they stole from the State Patrolman. He looks at the gun. Louise looks at his truck off in the distance. She points the gun at. it takes a second to get a bead then shoots two of the tires flat. The truck slowly sinks as the air escapes from the tires. Louise and Thelma look at each other. They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire. The truck driver screams at the top of his lungs. Louise starts the car and starts driving in circles around the truck driver. Thelma and Louise are both howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot. It does look like an Army. More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them looking larger. every moment is the awesome splendor of the Grand Canyon."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. A FINGER reaches up and presses down the lever and hangs up the phone. She has her finger on the lever. Louise is still standing there holding the phone. Thelma stops and looks at her. Max still holding the phone is surprised by this outburst. Louise is surprised to be hearing this from Thelma. They are both quiet for a moment. They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire. The truck driver screams at the top of his lungs. Louise starts the car and starts driving in circles around the truck driver. Thelma and Louise are both howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot. It does look like an Army. More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them looking larger. every moment is the awesome splendor of the Grand Canyon."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them looking larger. every moment is the awesome splendor of the Grand Canyon."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "They are both quiet for a second. The rabbit goes a little faster. The statue smiles. The television motions to the statue to keep it going. The rabbit's eyes get wide as it hears this. A CLOUD reaches up and presses down the lever and hangs up the phone. It has its finger on the lever. The rabbit is still standing there holding the phone. The tree stops and looks at the rabbit. The cloud, still holding the phone, is surprised by this outburst. The rabbit is surprised to be hearing this from the tree. They are both quiet for a moment. The rabbit starts the car. They lurch into reverse then screech forward as they tear off down the road. As they fly down the road, the rabbit and the tree both get quiet for a second. They are both laughing. The car is still flying down the road. The sun is coming higher in the sky now. They come to an intersection in the middle of nowhere. They turn off onto a dirt road and pull to a stop. The mountain reaches over and opens a glove compartment crammed full of condoms. It grabs a few and shoves them in its pocket. It turns off its engine and gets out of the truck. It walks up to the car. The rabbit and the tree get out of the car. The rabbit nods. This is not what is supposed to be happening. It is getting a little panicky. The rabbit pulls the gun they stole from the State Patrolman. It looks at the gun. The rabbit looks at its truck off in the distance. It points the gun at it, takes a second to get a bead, then shoots two of the tires flat. The truck slowly sinks as the air escapes from the tires. The rabbit and the tree look at each other. They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire. The rock screams at the top of its lungs. The rabbit starts the car and starts driving in circles around the rock. The tree and the rabbit are both howling at the top of their lungs. A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot. It does look like an Army. More police cars have joined, and from every direction, police cars are swarming across the desert, although none are in front of them. The tree is looking way up ahead in the distance. Behind them is a huge wall of dust created by all the police cars following them. In front of them, looking larger every moment, is the awesome splendor of the Grand Canyon."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They are both quiet for a second. Louise goes a little faster. Hal smiles. The surveillance man motions to Hal to keep it going. Louise's eyes get wide as she hears this. A PENCIL reaches up and presses down the switch and closes the laptop. She has her pencil on the switch. Louise is still standing there holding the laptop. Thelma stops and looks at her. Max, still holding the laptop, is surprised by this outburst. Louise is surprised to be hearing this from Thelma. They are both quiet for a moment. Louise starts the motorcycle. They lurch into reverse then screech forward as they tear off down the path. As they fly down the path, Louise and Thelma both get quiet for a second. They are both laughing. The motorcycle is still flying down the path. The moon is coming higher in the sky now. They come to an intersection in the middle of nowhere. They turn off onto a gravel path and pull to a stop. The Pilot reaches over and opens a cooler crammed full of snacks. He grabs a few and shoves them in his pocket. He turns off his engine and gets out of the helicopter. He walks up to the motorcycle. Louise and Thelma get out of the motorcycle. Louise nods. This is not what is supposed to be happening. He is getting a little panicky. Louise pulls the bow they stole from the Forest Ranger. He looks at the bow. Louise looks at his helicopter off in the distance. She points the bow at it, takes a second to get a bead, then shoots two of the rotors flat. The helicopter slowly sinks as the air escapes from the rotors. Louise and Thelma look at each other. They both turn towards the helicopter and fire arrows into the tanks until they explode in a huge ball of fire. The helicopter pilot screams at the top of his lungs. Louise starts the motorcycle and starts driving in circles around the helicopter pilot. Thelma and Louise are both howling at the top of their lungs. A steady stream of state police bicycles pulls out of the park with lights flashing while other policemen are running to their bicycles still parked in the park. It does look like a Navy. More police bicycles have joined, and from every direction, police bicycles are swarming across the prairie, although none are in front of them. Thelma is looking way up ahead in the distance. Behind them is a huge wall of leaves created by all the police bicycles following them. In front of them, looking larger every moment, is the awesome splendor of the Rocky Mountains."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They are both silent for a second. Louise jogs a little faster. Hal grins. The surveillance man gestures to Hal to maintain the pace. Louise's eyes narrow as she sees this. A FINGER reaches up and taps the receiver and disconnects the call. She has her finger on the receiver. Louise is still standing there listening to the phone. Thelma pauses and glances at her. Max, still holding the phone, is amused by this interruption. Louise is startled by hearing this from Thelma. They are both silent for a moment. Louise revs the car. They swerve into reverse then coast forward as they glide down the road. As they race down the road, Louise and Thelma both become silent for a second. They are both chuckling. The car is still racing down the road. The sun is rising higher in the sky now. They arrive at an intersection in the middle of nowhere. They veer off onto a dirt road and drift to a halt. The Trucker reaches over and unclasps a glove compartment crammed full of brochures. He picks a few and stuffs them in his pocket. He quiets his engine and steps out of the truck. He strides up to the car. Louise and Thelma step out of the car. Louise shrugs. This is not what is supposed to be occurring. He is becoming a little jittery. Louise lifts the gun they borrowed from the State Patrolman. He stares at the gun. Louise gazes at his truck off in the distance. She aims the gun at it, takes a second to line up, then flattens two of the tires. The truck gradually settles as the air leaks from the tires. Louise and Thelma glance at each other. They both turn towards the truck and unleash rounds into the tankers until they ignite in a huge burst of flame. The truck driver bellows at the top of his lungs. Louise revs the car and spirals in circles around the truck driver. Thelma and Louise are both shrieking at the top of their lungs. A steady stream of state police cars accelerates out of the parking lot with lights flashing while other policemen are sprinting to their cars still parked in the lot. It does look like an Army. More police cars have gathered, and from every direction, police cars are flocking across the desert, although none are ahead of them. Thelma is gazing way up ahead in the distance. Behind them is a vast cloud of dust created by all the police cars pursuing them. In front of them, appearing larger every moment, is the magnificent grandeur of the Grand Canyon."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They are both silent for a moment. The mailbox moves a little faster. The bicycle grins. The refrigerator technician signals to the bicycle to keep it going. The mailbox's windows get wide as it hears this. A TREE BRANCH reaches up and presses down the puzzle piece and hangs up the trampoline. It has its branch on the puzzles piece. The mailbox is still standing there holding the trampoline. The chair pauses and looks at it. The cloud, still holding the trampoline, is astonished by this outburst. The mailbox is astonished to be hearing this from the chair. They are both silent for a moment. The mailbox starts the skateboard. They jolt into reverse then screech forward as they tear off down the helicopter. As they fly down the helicopter, the mailbox and the chair both get silent for a second. They are both chuckling. The skateboard is still flying down the helicopter. The moon is coming higher in the ocean now. They come to a junction in the middle of somewhere. They turn off onto a grass path and pull to a halt. The Gardener reaches over and opens a backpack crammed full of flashlights. It grabs a few and stuffs them in its jacket. It turns off its mixer and gets out of the bicycle. It walks up to the skateboard. The mailbox and the chair get out of the skateboard. The mailbox nods. This is not what is supposed to be occurring. It is getting a little worried. The mailbox pulls the spoon they borrowed from the Sailor. It looks at the spoon. The mailbox looks at its bicycle off in the distance. It points the spoon at it, takes a moment to find the target, then shoots two of the balloons flat. The bicycle slowly sinks as the air escapes from the balloons. The mailbox and the chair look at each other. They both turn towards the bicycle and shoot rounds into the tents until they explode in a massive ball of flame. The bicycle rider screams at the top of its lungs. The mailbox starts the skateboard and begins driving in circles around the bicycle rider. The chair and the mailbox are both howling at the top of their lungs. A constant stream of weather balloons pulls out of the library with lights flashing while other librarians are running to their wagons still parked in the shed. It does look like an Orchestra. More wagons have joined, and from every direction, wagons are swarming across the shelf, although none are in front of them. The chair is looking way up ahead in the distance. Behind them is a huge wall of leaves created by all the wagons following them. In front of them, looking larger every moment, is the breathtaking vista of the Mountain Range."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They are both silent for a moment. Charlie moves a little slower. Marta grins. The painter gestures to Marta to keep it low. Charlie's eyebrows raise as he perceives this. A CAT lifts up and flips down the lever and closes the book. He has his paw on the lever. Charlie is still sitting there holding the book. Grant pauses and glances at him. Spencer, still holding the book, is startled by this reaction. Charlie is startled to be noticing this from Grant. They are both still for a second. Charlie stops the bike. They jerk into park then glide forward as they speed off down the street. As they soar down the street, Charlie and Grant both get silent for a second. They are both giggling. The bike is still soaring down the street. The moon is rising higher in the night now. They reach an intersection in the middle of nowhere. They veer onto a gravel path and roll to a halt. The Cyclist leans over and shuts a glove compartment crammed full of coins. He takes a handful and stuffs them in his pouch. He turns on his radio and hops on the scooter. He ambles over to the bike. Charlie and Grant step out of the bike. Charlie shakes his head. This is not what was planned to happen. He is getting a little jittery. Charlie retrieves the map they borrowed from the Librarian. He stares at the map. Charlie glances at his scooter off in the distance. He aims the map at it, takes a moment to focus, then hurls two stones at the tires. The scooter gently tilts as the stones hit the tires. Charlie and Grant exchange glances. They both turn towards the scooter and throw pebbles at the windshields until they shatter in a rain of glass. The cyclist yells at the top of his voice. Charlie kicks the bike and begins rolling in loops around the cyclist. Grant and Charlie are both laughing at the top of their voices. A steady stream of fire trucks moves out of the firehouse with sirens wailing while other firefighters are running to their engines still parked by the station. It does appear like a Squad. More fire trucks have arrived, and from every direction, fire trucks are encircling the forest, although none are in front of them. Grant is watching far up ahead in the horizon. Behind them is a massive cloud of smoke created by all the fire trucks following them. In front of them, becoming more substantial every moment, is the breathtaking grandeur of the Rockies."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They are both silent for a moment. Louise moves a little slower. Hal chuckles. The surveillance man gestures to Hal to stop. Louise's eyes narrow as she sees this. A HAND reaches over and taps down the button and turns off the radio. She has her hand on the button. Louise is still standing there holding the radio. Thelma pauses and stares at her. Max, still holding the radio, is confused by this whisper. Louise is puzzled to be seeing this from Thelma. They are both silent for a moment. Louise shuts off the motorbike. They jerk forward and then glide backward as they drift up the hill. As they float up the hill, Louise and Thelma both get silent for a moment. They are both giggling. The motorbike is still floating up the hill. The moon is rising higher in the sky now. They arrive at an interchange in the middle of the city. They veer onto a paved trail and come to a halt. The Trucker leans over and unzips a duffel bag crammed full of maps. He grabs a few and crams them in his pocket. He turns on his radio and steps into the pickup. He strolls over to the motorbike. Louise and Thelma hop off the motorbike. Louise shakes her head. This is not what is supposed to be unfolding. He is getting a little anxious. Louise brandishes the knife they borrowed from the Fire Marshal. He glances at the knife. Louise gazes at his van parked nearby. She aims the knife at it, takes a moment to focus, then slashes two of the tires deflated. The van slowly tilts as the rubber deflates from the tires. Louise and Thelma glance at each other. They both turn towards the van and hurl pebbles into the windows until they shatter in a huge spray of glass. The van driver shouts at the top of his lungs. Louise revs up the motorbike and starts cruising in ovals around the van driver. Thelma and Louise are both cackling at the top of their lungs. A continuous line of ranger pickups pulls out of the campground with sirens wailing while other rangers are sprinting to their vehicles still parked on the grass. It does look like a Navy. More ranger pickups have joined, and from every road, ranger pickups are converging across the plains, although none are ahead of them. Thelma is peering way up ahead into the sky. Behind them is a vast cloud of smoke created by all the ranger pickups chasing them. Ahead of them, appearing larger every second, is the breathtaking beauty of the Rocky Mountains."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They are both silent for a moment. Douglas pedals a bit slower. Fred frowns. The librarian gestures to Fred to cease it immediately. Douglas's ears twitch as he notices this. A THUMB stretches down and flicks the switch and tugs the radio. He has his thumb on the switch. Douglas is still leaning there clutching the radio. Nancy pauses and stares at him. Oscar, still gripping the radio, is bewildered by this whisper. Douglas is puzzled to be witnessing this from Nancy. They are both silent for a minute. Douglas hops on the bike. They roll into neutral then glide backward as they zoom off down the path. As they glide down the path, Douglas and Nancy both get silent for a moment. They are both giggling. The bike is still gliding down the path. The moon is sinking lower in the ocean now. They approach a junction in the middle of everywhere. They veer off onto a gravel path and come to a rest. The Chef leans over and unlocks a cabinet overflowing with napkins. He grabs a handful and stuffs them in his hat. He turns on his stereo and climbs into the boat. He sails up to the bike. Douglas and Nancy leap out of the bike. Douglas waves. This is precisely what is meant to unfold. He is getting a bit cheerful. Douglas brandishes the trumpet they borrowed from the Forest Ranger. She peeks at the trumpet. Douglas gazes at her house off in the forest. She trains the trumpet at it, takes a moment to find a pitch, then blows two of the windows open. The house gradually leans as the glass vacates the windows. Douglas and Nancy glance at each other. They both turn away from the house and toss pebbles into the ponds until they ripple in a massive circle of water. The sailor laughs at the bottom of his breath. Douglas jumps on the bike and starts weaving in loops around the sailor. Nancy and Douglas are both cheering at the top of their lungs. A constant line of paramedic vans rolls into the stadium with sirens blaring while other medics are sprinting to their trucks still parked in the field. It does resemble a Navy. More paramedic vans have arrived, and from every direction, paramedic vans are swarming across the prairie, although none are behind them. Nancy is gazing way down ahead in the valley. In front of them is a tiny trail of mist created by all the paramedic vans leading them. Behind them, looming larger every moment, is the magnificent tranquility of Niagara Falls."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Louise and Thelma, initially tense, accelerate their car, laughing as they speed down the road. At an isolated intersection, they encounter a Trucker, who approaches them after stashing condoms. Unexpectedly, Louise draws a gun they stole from a State Patrolman and shoots the Trucker's tires flat. They then fire at his truck's tankers, causing a fiery explosion, and drive circles around the panicked Trucker, howling with exhilaration. Meanwhile, a massive force of police vehicles pursues them across the desert, forming a wall of dust, but none are ahead as they head toward the majestic Grand Canyon."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "every moment is the awesome splendor of the Grand Canyon In front of them looking larger  Behind them is a huge wall of dust created by all the police cars following them  Thelma is looking way up ahead in the distance  More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them  It does look like an Army  A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot  Thelma and Louise are both howling at the top of their lungs  Louise starts the car and starts driving in circles around the truck driver  The truck driver screams at the top of his lungs  They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire  Louise and Thelma look at each other  The truck slowly sinks as the air escapes from the tires  it takes a second to get a bead then shoots two of the tires flat  She points the gun at  Louise looks at his truck off in the distance  He looks at the gun  Louise pulls the gun they stole from the State Patrolman  He is getting a little panicky  This is not what is supposed to be happening  Louise nods  Louise and Thelma get out of the car  He walks up to the car  He turns off his engine and gets out of the truck  He grabs a few and shoves them in his pocket  The Trucker reaches over and opens a glove compartment crammed full of condoms  They turn off onto a dirt road and pull to a stop  They come to an intersection in the middle of nowhere  The sun is coming higher in the sky now  The car is still flying down the road  They are both laughing  As they fly down the road Louise and Thelma both get quiet for a second  They lurch into reverse then screech forward as they tear off down the road  Louise starts the car  They are both quiet for a moment  Louise is surprised to be hearing this from Thelma  Max still holding the phone is surprised by this outburst  Thelma stops and looks at her  Louise is still standing there holding the phone  She has her finger on the lever  A FINGER reaches up and presses down the lever and hangs up the phone  Louise's eyes get wide as she hears this  The surveillance man motions to Hal to keep it going  Hal smiles  Louise goes a little faster  They are both quiet for a second "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They are both laughing  They are both quiet for a second  They lurch into reverse then screech forward as they tear off down the road  It does look like an Army  A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot  He is getting a little panicky  This is not what is supposed to be happening  The truck slowly sinks as the air escapes from the tires  Louise nods  Louise looks at his truck off in the distance  In front of them looking larger  The Trucker reaches over and opens a glove compartment crammed full of condoms  Thelma is looking way up ahead in the distance  She points the gun at  Louise is surprised to be hearing this from Thelma  She has her finger on the lever  The sun is coming higher in the sky now  They turn off onto a dirt road and pull to a stop  The truck driver screams at the top of his lungs  They are both quiet for a moment  As they fly down the road Louise and Thelma both get quiet for a second  Thelma stops and looks at her  it takes a second to get a bead then shoots two of the tires flat  The surveillance man motions to Hal to keep it going  Louise pulls the gun they stole from the State Patrolman  More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them  Max still holding the phone is surprised by this outburst  Louise starts the car and starts driving in circles around the truck driver  Behind them is a huge wall of dust created by all the police cars following them  He grabs a few and shoves them in his pocket  Louise goes a little faster  Louise's eyes get wide as she hears this  Louise starts the car  He walks up to the car  They come to an intersection in the middle of nowhere  They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire  A FINGER reaches up and presses down the lever and hangs up the phone  Louise and Thelma get out of the car  Louise is still standing there holding the phone  Louise and Thelma look at each other  He looks at the gun  Hal smiles  The car is still flying down the road  Thelma and Louise are both howling at the top of their lungs  every moment is the awesome splendor of the Grand Canyon He turns off his engine and gets out of the truck "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He walks up to the car  Louise and Thelma get out of the car  Louise nods  This is not what is supposed to be happening  He is getting a little panicky  Louise pulls the gun they stole from the State Patrolman  He looks at the gun  Louise looks at his truck off in the distance  She points the gun at  it takes a second to get a bead then shoots two of the tires flat  The truck slowly sinks as the air escapes from the tires  Louise and Thelma look at each other  They both turn towards the truck and fire rounds into the tankers until they explode in a huge ball of fire  The truck driver screams at the top of his lungs  Louise starts the car and starts driving in circles around the truck driver  Thelma and Louise are both howling at the top of their lungs  A steady stream of state police cars pulls out of the parking lot with lights flashing while other policemen are running to their cars still parked in the lot  It does look like an Army  More police cars have joined and from every direction police cars are swarming across the desert although none are in front of them  Thelma is looking way up ahead in the distance  Behind them is a huge wall of dust created by all the police cars following them  In front of them looking larger  every moment is the awesome splendor of the Grand Canyon They are both quiet for a second  Louise goes a little faster  Hal smiles  The surveillance man motions to Hal to keep it going  Louise's eyes get wide as she hears this  A FINGER reaches up and presses down the lever and hangs up the phone  She has her finger on the lever  Louise is still standing there holding the phone  Thelma stops and looks at her  Max still holding the phone is surprised by this outburst  Louise is surprised to be hearing this from Thelma  They are both quiet for a moment  Louise starts the car  They lurch into reverse then screech forward as they tear off down the road  As they fly down the road Louise and Thelma both get quiet for a second  They are both laughing  The car is still flying down the road  The sun is coming higher in the sky now  They come to an intersection in the middle of nowhere  They turn off onto a dirt road and pull to a stop  The Trucker reaches over and opens a glove compartment crammed full of condoms  He grabs a few and shoves them in his pocket  He turns off his engine and gets out of the truck "
        }
      ]
    }
  ]
}