{
  "ground_truth": "On the ice, Player One delivers the kill shot, slamming his fist into Player Two's nose, and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa, flabbergasted, while the crowd around them is shocked, focusing not on the fight on the ice, but the fight in their midst. Alyssa fumes and storms away, with Holden chasing after her, observed by a Bystander. Alyssa marches quickly, pulling on her coat, and Holden catches up to her but pulls back. She stares at him, hurt and pissed, while Holden's eyes are downcast, as she waits for a response. Holden skulks off, and Alyssa stares after him before starting to kick and punch a car beside her, finally slumping to the ground, crying. Meanwhile, Holden sits on the couch, alone in the dark, when Banky enters and sits beside him, opening his arms. Later, Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him; the pair slide into the booth. Holden pulls an envelope out of his jacket and tosses it to Jay, as Silent Bob thumbs through the comic while Jay looks over his shoulder, beginning to roll a joint. A waitress joins them, and Holden rubs his eyes as the waitress returns with the order, staring wide-eyed and offended at Jay. There's silence as Holden's head snaps forward, staring wide-eyed at Silent Bob, shocked, while Jay and Holden look at him. Silent Bob busts a move with his hands, then backhands him, as Jay raises his fist as if to strike, and Silent Bob lights a cigarette before Jay and Silent Bob exit. Holden remains in the booth, thinking. Later, he sits in the park that he and Alyssa walked through, staring at Alyssa's yearbook picture, and then an idea hits him. He jumps up, dashes out of the park, grabs a chair from the side of the room, where Banky and Alyssa sit on the couch, and paces in front of them. Alyssa's face drops as she subtly shakes her head, and the room is silent. Alyssa lights a cigarette, her head dropping, while Holden leans back into the couch with a huge sigh. Banky stares forward, wide-eyed, then shrugs. Holden smiles at his friend, then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly, as shocked Banky lets out a sigh of relief. Holden reacts, and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face, then releases him and slaps him, before storming away, stopping briefly to look Banky up and down, and walks out of the studio. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Bluntman and Chronic' enters the frame.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "On the ice, Contestant One delivers the kill strike, slamming his fist into Contestant Two's nose, and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa, astonished, while the crowd around them is shocked, focusing not on the fight on the ice, but the fight in their midst. Alyssa fumes and storms away, with Holden chasing after her, observed by a Bystander. Alyssa marches quickly, pulling on her coat, and Holden catches up to her but pulls back. She stares at him, hurt and angry, while Holden's eyes are downcast, as she waits for a retort. Holden skulks off, and Alyssa stares after him before starting to kick and punch a vehicle beside her, finally slumping to the ground, weeping. Meanwhile, Holden sits on the couch, alone in the dark, when Banky enters and sits beside him, opening his arms. Later, Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him; the duo slide into the booth. Holden pulls an envelope out of his jacket and tosses it to Jay, as Silent Bob thumbs through the comic while Jay looks over his shoulder, beginning to roll a joint. A waitress joins them, and Holden rubs his eyes as the waitress returns with the order, staring wide-eyed and offended at Jay. There's silence as Holden's head snaps forward, staring wide-eyed at Silent Bob, shocked, while Jay and Holden look at him. Silent Bob busts a move with his hands, then backhands him, as Jay raises his fist as if to strike, and Silent Bob lights a cigarette before Jay and Silent Bob exit. Holden remains in the booth, pondering. Later, he sits in the park that he and Alyssa walked through, staring at Alyssa's yearbook picture, and then an idea hits him. He jumps up, dashes out of the park, grabs a chair from the side of the room, where Banky and Alyssa sit on the couch, and paces in front of them. Alyssa's face drops as she subtly shakes her head, and the room is silent. Alyssa lights a cigarette, her head dropping, while Holden leans back into the couch with a huge sigh. Banky stares forward, wide-eyed, then shrugs. Holden smiles at his comrade, then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly, as shocked Banky lets out a sigh of relief. Holden reacts, and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face, then releases him and slaps him, before storming away, stopping briefly to look Banky up and down, and walks out of the studio. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "On the ice, the kill shot is delivered by Player One, with his fist being slammed into Player Two's nose, and the blood is shot out like a geyser as Two is sent down hard. Alyssa is stared at by Holden, flabbergasted, while the crowd around them is shocked, focusing not on the fight in their midst, but the fight on the ice. Anger is shown by Alyssa as she storms away, with her being chased after by Holden, who is observed by a Bystander. Her coat is pulled on by Alyssa as she quickly marches, and Holden catches up to her but pulls back. She is stared at by him, hurt and pissed, while his eyes are downcast, as a response is awaited by her. Holden skulks off, and after him, Alyssa stares before a car beside her is kicked and punched by her, finally slumping to the ground, crying. Meanwhile, the couch is sat on by Holden, alone in the dark, when Banky enters and sits beside him, opening his arms. Later, a booth is sat at by Holden alone and he looks up to see Jay and Silent Bob standing above him; the booth is slid into by the pair. An envelope is pulled out of Holden's jacket and tossed to Jay, as the comic is thumbed through by Silent Bob while Jay looks over his shoulder, beginning to roll a joint. They are joined by a waitress, and his eyes are rubbed by Holden as the order is returned by the waitress, who stares wide-eyed and offended at Jay. There's silence as Holden's head snaps forward, wide-eyed and shocked at Silent Bob, while Jay and Holden look at him. Silent Bob busts a move with his hands, then backhands Holden, as Jay raises his fist as if to strike, and a cigarette is lit by Silent Bob before exiting with Jay. Holden remains in the booth, thinking. Later, the park that Alyssa and he walked through is sat in by him, as he stares at Alyssa's yearbook picture, and then an idea hits him. He jumps up, dashes out of the park, grabs a chair from the side of the room, where Banky and Alyssa sit on the couch, and he paces in front of them. Alyssa's face drops, and her head is subtly shaken, and the room is silent. Alyssa lights a cigarette, her head drops, while Holden leans back into the couch with a huge sigh. Banky stares forward, wide-eyed, then shrugs. Holden smiles at his friend, then looks at Alyssa and moves to her side of the couch. She looks at him sadly, as Banky lets out a sigh of relief, shocked. A reaction is made by Holden, and a tear rolls down Alyssa's cheek. Sadly, with her looking at him, his face is touched by her, then he is released by her and slapped, before she storms away, stopping briefly to look Banky up and down, and the studio is walked out of by her. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Bluntman and Chronic' enters the frame."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "On the ice, Player One delivers a powerful punch to Player Two's nose, causing blood to gush as Two falls. Holden, shocked, watches Alyssa, who storms off, with Holden following. Alyssa, upset, walks quickly, and Holden hesitates. She glares at him, waiting for a response, but he leaves. Alyssa kicks a car, then collapses, crying. Meanwhile, Holden sits alone in the dark until Banky joins him. Later, Holden meets Jay and Silent Bob at a booth, handing Jay an envelope. Silent Bob examines a comic while Jay rolls a joint. A waitress arrives, offended by Jay. Silent Bob gestures, then backhands Jay, who raises his fist, but Silent Bob lights a cigarette before they leave. Holden remains, thinking. Later, he sits in a park, looking at Alyssa's yearbook picture, and gets an idea. He rushes to where Banky and Alyssa sit, pacing in front of them. Alyssa shakes her head, lighting a cigarette, while Holden sighs. Banky shrugs, and Holden smiles, moving to Alyssa's side. She looks at him sadly, touches his face, then slaps him before leaving, pausing to glance at Banky. The door closes as Banky and Holden stand silently, with 'Bluntman and Chronic' in view."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "On the ice, Player One punches Player Two's nose, causing blood to gush as Two falls. Holden, shocked, watches Alyssa storm off, with him following. Alyssa, upset, waits for Holden's response, but he leaves. She kicks a car, then cries. Holden sits alone until Banky joins him. Later, Jay and Silent Bob join Holden at a booth. Silent Bob gestures, then backhands Holden, and Jay prepares to strike before they leave. Holden remains, thinking. In the park, he gets an idea, grabs a chair, and confronts Banky and Alyssa. Alyssa shakes her head, lights a cigarette, and Holden sighs. Banky shrugs, and Holden smiles, moving to Alyssa's side. She touches his face, then slaps him and leaves, glancing at Banky. The door closes as Banky and Holden stand silently, with 'Bluntman and Chronic' in view."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "On the ice, Player One delivers the decisive and brutal kill shot, forcefully slamming his clenched fist into Player Two's nose. The impact is so intense that blood erupts like a geyser, spraying out as Player Two goes down hard onto the ice. Holden stands there, staring at Alyssa, utterly flabbergasted by the sudden violence, while the crowd surrounding them is equally shocked, their attention diverted from the fight on the ice to the unexpected confrontation unfolding in their midst. Alyssa, fuming with anger, storms away from the scene, with Holden quickly chasing after her, all of this observed by a nearby Bystander. Alyssa marches away briskly, pulling on her coat with determination, and although Holden manages to catch up to her, he hesitates and pulls back. She fixes him with a stare, her expression a mix of hurt and anger, while Holden's eyes remain downcast, as she waits expectantly for a response. Holden eventually skulks off, leaving Alyssa to stare after him before she begins to vent her frustration by kicking and punching a car beside her, finally slumping to the ground, overwhelmed and crying. Meanwhile, Holden finds himself sitting alone on the couch, enveloped in darkness, when Banky enters the room and sits beside him, opening his arms in a gesture of comfort. Later, Holden is seated alone at a booth, and as he looks up, he sees Jay and Silent Bob standing above him; the pair slide into the booth with him. Holden reaches into his jacket, pulls out an envelope, and tosses it to Jay, while Silent Bob thumbs through the comic, with Jay peering over his shoulder, beginning to roll a joint. A waitress approaches them, and Holden rubs his eyes wearily as she returns with their order, staring wide-eyed and offended at Jay's behavior. There's a moment of silence as Holden's head snaps forward, staring wide-eyed at Silent Bob, shocked by his actions, while Jay and Holden both look at him. Silent Bob suddenly busts a move with his hands, then backhands him, as Jay raises his fist as if to strike, and Silent Bob lights a cigarette before the duo exits. Holden remains seated in the booth, deep in thought. Later, he finds himself sitting in the park where he and Alyssa once walked, staring at Alyssa's yearbook picture, and then an idea suddenly hits him. He jumps up with renewed energy, dashes out of the park, and grabs a chair from the side of the room, where Banky and Alyssa are sitting on the couch, and begins to pace in front of them. Alyssa's face drops as she subtly shakes her head, and the room falls into a heavy silence. Alyssa lights a cigarette, her head dropping in resignation, while Holden leans back into the couch with a huge sigh of relief. Banky stares forward, wide-eyed, then shrugs in response. Holden smiles at his friend, then turns his attention to Alyssa and moves to her side of the couch. Alyssa looks at him with a sad expression, as the shocked Banky lets out a sigh of relief. Holden reacts, and a tear rolls down Alyssa's cheek. She looks at him sadly, gently touches his face, then releases him and slaps him, before storming away, pausing briefly to look Banky up and down, and walks out of the studio. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the midst of the chaotic scene unfolding on the ice, Player One decisively delivers the brutal and ultimately game-changing kill shot. With great force, he smashes his tightly clenched fist right into Player Two's unsuspecting nose. The impact is so powerful and intense that blood erupts almost like a geyser, spraying out violently as Player Two collapses hard onto the unforgiving ice. Nearby, Holden stands frozen, completely looking at Alyssa, utterly flabbergasted by the sudden explosion of violence, while the crowd surrounding them is equally shocked and taken aback. Their attention rapidly shifts from the excitement of the fight on the ice to the unexpected confrontation now playing out in their midst. Meanwhile, Alyssa, seething with anger, storms away from the unsettling scene, with Holden swiftly moving to chase after her. All of this is carefully observed by a nearby Bystander, who remains a silent witness to the unfolding drama. Alyssa marches away with determined speed, pulling on her coat with fierce determination, and although Holden manages to catch up to her, he hesitates, unsure, and pulls back uncertainly. Alyssa fixes him with a penetrating stare, her expression a complex mix of hurt and anger, while Holden's eyes remain downcast, avoiding her gaze, as she waits expectantly for his response. Eventually, Holden skulks off, leaving Alyssa to stare desolately after him before she begins to vent her overwhelming frustration by fiercely kicking and punching a car beside her, eventually slumping to the ground, overcome by emotion and crying. Meanwhile, Holden finds himself sitting alone and brooding on the couch, enveloped in a shroud of darkness, when Banky enters the room and sits beside him, opening his arms in a gesture of comforting reassurance. Later on, Holden finds himself seated alone in a booth, and as he looks up, he catches sight of Jay and Silent Bob standing watchfully above him; the two slide smoothly into the booth with him. Holden reaches into his jacket, retrieves an envelope, and casually tosses it over to Jay, while Silent Bob thumbs through the comic, with Jay eagerly peering over his shoulder, beginning to roll a joint. A waitress approaches them, and Holden rubs his eyes wearily as she returns with their order, looking wide-eyed and offended at Jay's controversial behavior. There’s a tense moment of silence as Holden’s head snaps forward, staring wide-eyed and shocked at Silent Bob’s actions, while Jay and Holden both look at him in disbelief. Silent Bob suddenly busts an unexpected move with his hands, then backhands him, as Jay raises his fist as if to join in, but Silent Bob simply lights a cigarette before the duo exits. Holden remains seated in the booth, lost deep in thought. Later, he finds himself sitting pensively in the park where he and Alyssa once shared a walk, staring at Alyssa’s yearbook picture. Suddenly, an inspired idea hits him, and he jumps up with renewed energy, dashing out of the park with purpose. He grabs a chair from the side of the room, where Banky and Alyssa are sitting quietly on the couch, and begins to pace anxiously in front of them. Alyssa’s face drops, and she subtly shakes her head, as the room falls into a weighty and uncomfortable silence. Alyssa lights a cigarette, her head dropping in resignation, while Holden leans back into the couch with a huge, palpable sigh of relief. Banky stares forward, wide-eyed, then shrugs in response, processing what just happened. Holden smiles at his friend, turning his attention to Alyssa and moving cautiously to her side of the couch. Alyssa looks at him with a sad expression, while the shocked Banky lets out a sigh of relief. Holden reacts, and a solitary tear rolls gently down Alyssa’s cheek. She looks at him sadly, gently touches his face with a lingering tenderness, then releases him and slaps him before storming away, pausing briefly to give Banky an appraising look up and down, and walks resolutely out of the studio. The door closes firmly behind her as Banky and Holden stand there, remaining silently in the moment, while a copy of 'Bluntman and Chronic' enters the frame, marking the poignant end of the scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "On the ice, Player One, with a determined expression, winds up and delivers a powerful punch, his fist making direct contact with Player Two's nose. The impact is so forceful that blood erupts from Player Two's nose, shooting out like a geyser, as he collapses to the ice with a heavy thud. Meanwhile, Holden, standing amidst the crowd, locks eyes with Alyssa, his face a picture of disbelief and shock, while the crowd around them, equally stunned, diverts their attention from the brawl on the ice to the escalating tension between Holden and Alyssa. Alyssa, her face flushed with anger, turns abruptly and storms away, her movements quick and purposeful, as Holden, realizing the gravity of the situation, immediately follows her, his eyes darting around as a Bystander watches the unfolding drama. Alyssa, marching briskly, tugs on her coat with frustration, while Holden, managing to catch up to her, hesitates and pulls back slightly, unsure of how to proceed. She halts, her eyes filled with a mix of hurt and anger, staring at him expectantly, while Holden, unable to meet her gaze, looks down, his expression one of regret and confusion. As the silence stretches between them, Holden eventually turns and skulks away, leaving Alyssa standing there, watching him retreat. Overcome with emotion, she begins to kick and punch a nearby car, her frustration boiling over, until she finally slumps to the ground, tears streaming down her face. Meanwhile, Holden finds himself alone, sitting on a couch in a dimly lit room, lost in thought, when Banky enters the room and sits beside him, offering silent support by opening his arms. Later, Holden sits alone in a booth at a diner, his mind still preoccupied, when he looks up to see Jay and Silent Bob standing above him. The pair slide into the booth with casual familiarity, and Holden, reaching into his jacket, retrieves an envelope and tosses it to Jay. Silent Bob, curious, thumbs through the comic inside, while Jay peers over his shoulder, simultaneously beginning to roll a joint with practiced ease. A waitress approaches their table, and as she returns with their order, she pauses, staring wide-eyed and offended at Jay's actions. In the ensuing silence, Holden's head snaps forward, his eyes wide with shock as he stares at Silent Bob, who suddenly breaks the tension by busting a move with his hands. Silent Bob then backhands Jay, who raises his fist as if to retaliate, but instead, Silent Bob lights a cigarette, and the two exit the booth, leaving Holden alone to ponder. Later, Holden finds himself sitting in the park where he and Alyssa once walked, his gaze fixed on Alyssa's yearbook picture, when a sudden idea strikes him. Energized, he jumps up and dashes out of the park, his mind racing with possibilities. He enters a room where Banky and Alyssa sit on a couch, grabs a chair from the side, and begins pacing in front of them, his movements filled with urgency. Alyssa's face falls as she subtly shakes her head, the room enveloped in silence. She lights a cigarette, her head dropping in resignation, while Holden, feeling the weight of the moment, leans back into the couch with a huge sigh. Banky, wide-eyed, stares forward, then shrugs, breaking the tension. Holden, sensing a shift, smiles at his friend, then turns his attention to Alyssa, moving to her side of the couch. Alyssa looks at him with a mixture of sadness and resignation, as Banky, shocked, lets out a sigh of relief. Holden reacts to the moment, and a tear rolls down Alyssa's cheek. She reaches out, touching his face gently, then abruptly releases him and slaps him, her emotions raw and unfiltered. She storms away, pausing briefly to give Banky a once-over, before walking out of the studio. The door closes behind her with a finality, leaving Banky and Holden standing there in silence, as a copy of 'Bluntman and Chronic' enters the frame, a silent testament to the events that have unfolded."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "On the ice, Player One delivers a powerful punch to Player Two's nose, causing blood to gush as Two collapses. Holden, stunned, watches Alyssa, who storms off in anger, prompting Holden to follow her, observed by a bystander. Alyssa, visibly upset, puts on her coat and confronts Holden, who hesitates and then retreats. Left alone, Alyssa vents her frustration on a nearby car before breaking down in tears. Meanwhile, Holden sits alone in the dark until Banky joins him, offering silent support. Later, at a booth, Jay and Silent Bob join Holden, who hands Jay an envelope while Silent Bob examines a comic. A waitress arrives, and Jay begins rolling a joint, causing her to react with offense. Silent Bob surprises everyone with a sudden gesture, leading to a brief altercation before he and Jay leave. Holden remains, deep in thought. Later, inspired by Alyssa's yearbook picture, Holden rushes to confront Banky and Alyssa. As he paces in front of them, Alyssa's expression turns somber, and she lights a cigarette. Holden sighs deeply, and Banky, wide-eyed, shrugs. Holden smiles at Banky, then approaches Alyssa, who looks at him with sadness. A tear falls as she touches his face, then slaps him before leaving, pausing to glance at Banky. The door closes behind her, leaving Banky and Holden in silence, with a copy of 'Bluntman and Chronic' in view."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "On the ice during an intense hockey match, Player One, known for his aggressive style reminiscent of enforcers in NHL, delivers the kill shot, slamming his fist into Player Two's nose. The blood shoots out like a geyser, a common sight in hockey brawls, as Two goes down hard. Holden stares at Alyssa, flabbergasted, while the crowd around them, familiar with the sport’s usual chaos, is shocked, focusing not on the fight on the ice, but the fight in their midst. Alyssa fumes with the intensity of someone who just witnessed a personal betrayal and storms away, with Holden chasing after her, observed by a Bystander who had been quietly sipping his drink until the commotion erupted. Alyssa marches quickly, pulling on her coat, a necessity in the cold climate typical of their city, and Holden catches up to her but pulls back. She stares at him, hurt and pissed, while Holden's eyes are downcast, as the city lights cast long shadows, and she waits for a response. Holden skulks off, and Alyssa stares after him before starting to kick and punch a car beside her, an old sedan likely parked for the winter, finally slumping to the ground, crying. Meanwhile, Holden sits on the couch, alone in the darkened apartment, which was once a lively gathering place, when Banky enters and sits beside him, opening his arms to offer comfort. Later, Holden sits alone at a booth in their favorite local diner and looks up to see Jay and Silent Bob, the notorious duo known from the cult classic films, standing above him; the pair slide into the booth. Holden pulls an envelope out of his jacket and tosses it to Jay, as Silent Bob thumbs through the comic, a shared project highlighting their quirky adventures, while Jay looks over his shoulder, beginning to roll a joint despite the \"No Smoking\" signs. A waitress, accustomed to the duo's antics, joins them, and Holden rubs his eyes as the waitress returns with the order, staring wide-eyed and offended at Jay's disregard for rules. There's silence as Holden's head snaps forward, staring wide-eyed at Silent Bob, shocked, while Jay and Holden look at him. Silent Bob busts a move with his hands, an unexpected dance move hinting at his hidden playful nature, then backhands him, as Jay raises his fist as if to strike, and Silent Bob lights a cigarette before Jay and Silent Bob exit, leaving a cloud of smoke behind them. Holden remains in the booth, thinking deeply about recent events. Later, he sits in the park that he and Alyssa frequently walked through during happier times, staring at Alyssa's yearbook picture, which he kept as a cherished memento, and then an idea hits him. He jumps up, dashes out of the park, fueled by a sudden burst of determination, grabs a chair from the side of the room, where Banky and Alyssa sit on the couch, their expressions tense, and paces in front of them. Alyssa's face drops as she subtly shakes her head, and the room is silent, echoing the earlier tension. Alyssa lights a cigarette, her head dropping, while Holden leans back into the couch with a huge sigh, feeling the weight of unresolved issues. Banky stares forward, wide-eyed, then shrugs, unsure of how to react. Holden smiles at his friend, then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly, as shocked Banky lets out a sigh of relief, witnessing a small reconciliation. Holden reacts, and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face, a tender gesture full of unspoken words, then releases him and slaps him, before storming away, stopping briefly to look Banky up and down as if assessing his role in the drama, and walks out of the studio. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Bluntman and Chronic', their comic that symbolized both conflicts and dreams, enters the frame."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard  Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst  Alyssa fumes and storms away with Holden chasing after her observed by a Bystander  A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay  There's silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him  Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit  Holden remains in the booth thinking  Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him  He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them  Alyssa's face drops as she subtly shakes her head and the room is silent  Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh  Banky stares forward wideeyed then shrugs  Holden smiles at his friend then looks at Alyssa and moves to her side of the couch  Alyssa looks at him sadly as shocked  Banky lets out a sigh of relief  Holden reacts and a tear rolls down Alyssa's cheek  Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back  She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response  Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying  Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms  Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him  the pair slide into the booth  Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint  A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay  There's silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him  Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit  Holden remains in the booth thinking  Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him  He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them  Alyssa's face drops as she subtly shakes her head and the room is silent  Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh  Banky stares forward wideeyed then shrugs  Holden smiles at his friend then looks at Alyssa and moves to her side of the couch  Alyssa looks at him sadly as shocked  Banky lets out a sigh of relief  Holden reacts and a tear rolls down Alyssa's cheek  She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio  The door closes behind her as  Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst. Alyssa fumes and storms away with Holden chasing after her observed by a Bystander. Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back. She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response. Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying. Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms. Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him. the pair slide into the booth. Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint. A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay. There is silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit. Holden remains in the booth thinking. Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him. He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them. Alyssa's face drops as she subtly shakes her head and the room is silent. Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh. Banky stares forward wideeyed then shrugs. Holden smiles at his friend then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly as shocked. Banky let us out a sigh of relief. Holden reacts and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio. The door closes behind her as Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst. Alyssa fumes and storms away with Holden chasing after her observed by a Bystander. Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back. She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response. Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying. Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms. Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him. the pair slide into the booth. Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint. A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay. There is silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit. Holden remains in the booth thinking. Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him. He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them. Alyssa's face drops as she subtly shakes her head and the room is silent. Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh. Banky stares forward wideeyed then shrugs. Holden smiles at his friend then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly as shocked. Banky let us out a sigh of relief. Holden reacts and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio. The door closes behind her as Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst. Alyssa fumes and storms away with Holden chasing after her observed by a Bystander. Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back. She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response. Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying. Banky stares forward wideeyed then shrugs. Holden smiles at his friend then looks at Alyssa and moves to her side of the couch. Alyssa looks at him sadly as shocked. Banky let us out a sigh of relief. Holden reacts and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio. The door closes behind her as Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard. Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst. Holden reacts and a tear rolls down Alyssa's cheek. She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio. The door closes behind her as Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "On the ice, the penguin delivers the kill shot, slamming its fist into the elephant's nose, and the blood shoots out like a geyser as the elephant goes down hard. The giraffe stares at the flamingo, flabbergasted, while the crowd around them is shocked, focusing not on the fight on the ice, but the fight in their midst. The flamingo fumes and storms away, with the giraffe chasing after the flamingo, observed by a kangaroo. The flamingo marches quickly, pulling on its coat, and the giraffe catches up to the flamingo but pulls back. The flamingo stares at the giraffe, hurt and pissed, while the giraffe's eyes are downcast, as the flamingo waits for a response. The giraffe skulks off, and the flamingo stares after the giraffe before starting to kick and punch a car beside it, finally slumping to the ground, crying. Meanwhile, the giraffe sits on the couch, alone in the dark, when the zebra enters and sits beside it, opening its arms. Later, the giraffe sits alone at a booth and looks up to see the fox and the owl standing above it; the pair slide into the booth. The giraffe pulls an envelope out of its jacket and tosses it to the fox, as the owl thumbs through the comic while the fox looks over its shoulder, beginning to roll a joint. A waitress joins them, and the giraffe rubs its eyes as the waitress returns with the order, staring wide-eyed and offended at the fox. There's silence as the giraffe's head snaps forward, staring wide-eyed at the owl, shocked, while the fox and the giraffe look at the owl. The owl busts a move with its hands, then backhands the giraffe, as the fox raises its fist as if to strike, and the owl lights a cigarette before the fox and the owl exit. The giraffe remains in the booth, thinking. Later, it sits in the park that it and the flamingo walked through, staring at the flamingo's yearbook picture, and then an idea hits it. The giraffe jumps up, dashes out of the park, grabs a chair from the side of the room, where the zebra and the flamingo sit on the couch, and paces in front of them. The flamingo's face drops as it subtly shakes its head, and the room is silent. The flamingo lights a cigarette, its head dropping, while the giraffe leans back into the couch with a huge sigh. The zebra stares forward, wide-eyed, then shrugs. The giraffe smiles at its friend, then looks at the flamingo and moves to its side of the couch. The flamingo looks at the giraffe sadly, as shocked the zebra lets out a sigh of relief. The giraffe reacts, and a tear rolls down the flamingo's cheek. It looks at the giraffe sadly and touches its face, then releases it and slaps it, before storming away, stopping briefly to look the zebra up and down, and walks out of the studio. The door closes behind the flamingo as the zebra and the giraffe stand there, silently, and a copy of 'Bluntman and Chronic' enters the frame."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "On the court, Player One delivers the kill shot, slamming his fist into Player Two's elbow, and the sweat shoots out like a geyser as Two goes down hard. Holden stares at Alyssa, flabbergasted, while the crowd around them is shocked, focusing not on the match on the court, but the argument in their midst. Alyssa fumes and storms away, with Holden chasing after her, observed by a Passerby. Alyssa marches quickly, pulling on her scarf, and Holden catches up to her but pulls back. She stares at him, hurt and pissed, while Holden's eyes are downcast, as she waits for a response. Holden skulks off, and Alyssa stares after him before starting to kick and punch a lamppost beside her, finally slumping to the ground, crying. Meanwhile, Holden sits on the bench, alone in the dark, when Banky enters and sits beside him, opening his backpack. Later, Holden sits alone at a table and looks up to see Jay and Silent Bob standing above him; the pair slide into the chairs. Holden pulls an envelope out of his pants and tosses it to Jay, as Silent Bob thumbs through the magazine while Jay looks over his shoulder, beginning to fold a paper airplane. A bartender joins them, and Holden rubs his eyes as the bartender returns with the menu, staring wide-eyed and offended at Jay. There's silence as Holden's head snaps forward, staring wide-eyed at Silent Bob, shocked, while Jay and Holden look at him. Silent Bob busts a move with his feet, then backhands him, as Jay raises his foot as if to kick, and Silent Bob lights a match before Jay and Silent Bob exit. Holden remains in the chair, thinking. Later, he sits in the garden that he and Alyssa walked through, staring at Alyssa's sketchbook picture, and then an idea hits him. He jumps up, dashes out of the garden, grabs a stool from the side of the shop, where Banky and Alyssa sit on the bench, and paces in front of them. Alyssa's face drops as she subtly shakes her head, and the shop is silent. Alyssa lights a match, her head dropping, while Holden leans back into the bench with a huge sigh. Banky stares forward, wide-eyed, then shrugs. Holden smiles at his friend, then looks at Alyssa and moves to her side of the bench. Alyssa looks at him sadly, as shocked Banky lets out a sigh of relief. Holden reacts, and a tear rolls down Alyssa's chin. She looks at him sadly and touches his hand, then releases him and slaps him, before storming away, stopping briefly to look Banky up and down, and walks out of the office. The door closes behind her as Banky and Holden stand there, silently, and a copy of 'Snoogans and Rubbers' enters the frame."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "On the ice, Player One enacts the opening act, shifting his foot into Player Two's shoulder, and the confetti flutters out like snowflakes as Two stumbles gently. Holden gazes at Alyssa, bemused, while the crowd around them is in disbelief, focusing not on the spectacle on the ice, but the spectacle in their midst. Alyssa sulks and strolls away, with Holden trailing after her, observed by a Bystander. Alyssa glides slowly, adjusting her scarf, and Holden catches up to her but steps aside. She gazes at him, confused and amused, while Holden's eyes are lifted, as she waits for a comment. Holden meanders off, and Alyssa gazes after him before starting to stroke and hug a tree beside her, finally sitting on the ground, laughing. Meanwhile, Holden perches on the couch, alone in the light, when Banky enters and settles beside him, closing his book. Later, Holden perches alone at a booth and looks up to see Jay and Silent Bob standing below him; the pair slip into the booth. Holden pulls a card out of his jacket and slides it to Jay, as Silent Bob leafs through the comic while Jay looks over his shoulder, beginning to fold a paper plane. A waitress approaches them, and Holden rubs his forehead as the waitress returns with the dessert, glaring intensely and surprised at Jay. There's silence as Holden's head tilts sideways, gazing intensely at Silent Bob, curious, while Jay and Holden glance at him. Silent Bob grooves a step with his feet, then high-fives him, as Jay raises his eyebrow as if to laugh, and Silent Bob ignites a match before Jay and Silent Bob enter. Holden stays in the booth, reflecting. Later, he sits in the park that he and Alyssa strolled through, gazing at Alyssa's postcard image, and then a plan dawns on him. He springs up, strolls out of the park, moves a plant from the side of the room, where Banky and Alyssa lounge on the couch, and dances in front of them. Alyssa's face lifts as she subtly nods her head, and the room is calm. Alyssa blows a bubble, her head lifting, while Holden leans forward into the couch with a small exhale. Banky gazes forward, smiling, then claps. Holden grins at his friend, then looks at Alyssa and shifts to her side of the couch. Alyssa looks at him hopefully, as excited Banky lets out a chuckle of surprise. Holden pauses, and a tear rolls down Alyssa's cheek. She looks at him warmly and caresses his hand, then holds him and hugs him, before drifting away, stopping briefly to watch Banky intently, and wanders out of the studio. The door closes behind her as Banky and Holden remain there, quietly, and a copy of 'Bluntman and Chronic' exits the frame."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "On the carpet, Doorbell One delivers the final scribble, slamming its page into Doorbell Two's elbow, and the feathers shoot out like a hose as Two goes down hard. Table stares at Envelope, flabbergasted, while the jungle around them is shocked, focusing not on the scribble on the carpet, but the scribble in their midst. Envelope fumes and storms away, with Table chasing after it, observed by a Solar Panel. Envelope marches quickly, pulling on its backpack, and Table catches up to it but pulls back. It stares at him, hurt and pissed, while Table's eyes are downcast, as it waits for a response. Table skulks off, and Envelope stares after him before starting to kick and punch a microphone beside it, finally slumping to the ground, crying. Meanwhile, Table sits on the treadmill, alone in the dark, when Umbrella enters and sits beside him, opening its wings. Later, Table sits alone at a seesaw and looks up to see Straw and Silent Rock standing above him; the pair slide into the seesaw. Table pulls a postcard out of its boot and tosses it to Straw, as Silent Rock thumbs through the postcard while Straw looks over its shoulder, beginning to fold a napkin. A lamp joins them, and Table rubs its knees as the lamp returns with the napkin, staring wide-eyed and offended at Straw. There's silence as Table's chin snaps forward, staring wide-eyed at Silent Rock, shocked, while Straw and Table look at it. Silent Rock busts a groove with its shoes, then backhands it, as Straw raises its elbow as if to strike, and Silent Rock lights a candle before Straw and Silent Rock exit. Table remains in the seesaw, thinking. Later, it sits in the orchard that it and Envelope walked through, staring at Envelope's map picture, and then an idea hits it. It jumps up, dashes out of the orchard, grabs a toothbrush from the side of the barn, where Umbrella and Envelope sit on the treadmill, and paces in front of them. Envelope's face drops as it subtly shakes its branch, and the barn is silent. Envelope lights a candle, its branch dropping, while Table leans back into the treadmill with a huge sigh. Umbrella stares forward, wide-eyed, then shrugs. Table smiles at its vase, then looks at Envelope and moves to its side of the treadmill. Envelope looks at it sadly, as shocked Umbrella lets out a sigh of relief. Table reacts, and a tear rolls down Envelope's cheek. It looks at it sadly and touches its scarf, then releases it and slaps it, before storming away, stopping briefly to look Umbrella up and down, and walks out of the library. The door closes behind it as Umbrella and Table stand there, silently, and a copy of 'Bluntman and Chronic' enters the jar."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "On the ice, the referee delivers the commentary, waving his hand into the crowd's view, and the confetti rains down like a geyser as the audience goes quiet. Morgan glares at Jessica, bewildered, while the performers around them are surprised, focusing not on the chaos on the ice, but the chaos in their midst. Jessica shrugs and saunters away, with Morgan drifting after her, noticed by a Journalist. Jessica strides slowly, adjusting her scarf, and Morgan draws near to her but hesitates. She glares at him, disappointed and amused, while Morgan's eyes are averted, as she waits for an explanation. Morgan dashes off, and Jessica glares after him before starting to paint and dance around a tree beside her, finally sitting to the ground, laughing. Meanwhile, Morgan rests on the recliner, alone in the light, when Shawn enters and settles beside him, crossing his arms. Later, Morgan rests alone at a bench and glances up to see Max and Quiet Jon standing above him; the duo slip into the bench. Morgan fishes a wallet out of his backpack and hands it to Max, as Quiet Jon flips through the notes while Max peeks over his shoulder, beginning to sketch a scene. A manager joins them, and Morgan rubs his temples as the manager returns with the package, glaring wide-eyed and confused at Max. There's silence as Morgan's head turns sideways, glaring wide-eyed at Quiet Jon, puzzled, while Max and Morgan peer at him. Quiet Jon waves a card with his fingers, then salutes him, as Max raises his elbow as if to gesture, and Quiet Jon lights a pipe before Max and Quiet Jon depart. Morgan lingers in the bench, contemplating. Later, he stands in the library that he and Jessica visited, gazing at Jessica's artbook page, and then an inspiration strikes him. He leaps up, runs out of the library, retrieves a stool from the corner of the room, where Shawn and Jessica lounge on the rug, and strolls in front of them. Jessica's expression turns as she subtly nods her head, and the room is still. Jessica lights a match, her head lowering, while Morgan leans into the rug with a deep breath. Shawn gazes forward, wide-eyed, then chuckles. Morgan grins at his companion, then glances at Jessica and shifts to her side of the rug. Jessica looks at him thoughtfully, as confused Shawn exhales with relief. Morgan reacts, and a smile emerges on Jessica's face. She looks at him thoughtfully and pats his shoulder, then releases him and tickles him, before strolling away, pausing briefly to nod at Shawn, and steps out of the loft. The door shuts behind her as Shawn and Morgan stand there, quietly, and a copy of 'Maskman and Heroic' drifts into the frame."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "On the meadow, Player One delivers the decisive blow, spinning his foot into Player Two's shoulder, and the confetti erupts like a volcano as Two tumbles lightly. Holden gawks at Alyssa, bewildered, while the audience around them is stunned, focusing not on the scuffle on the meadow, but the commotion in their vicinity. Alyssa fumes and marches away, with Holden trailing after her, observed by a Passerby. Alyssa strides quickly, adjusting her hat, and Holden catches up to her but hesitates. She glares at him, hurt and frustrated, while Holden's eyes are averted, as she waits for a reply. Holden lingers off, and Alyssa gazes after him before starting to throw and kick a bench beside her, finally collapsing to the ground, sobbing. Meanwhile, Holden perches on the hammock, enveloped in shadows, when Banky arrives and sits next to him, extending his legs. Later, Holden reclines alone at a table and glances up to see Jay and Silent Bob towering above him; the duo slides into the chairs. Holden pulls a postcard out of his backpack and slides it to Jay, as Silent Bob skims through the manuscript while Jay peeks over his arm, beginning to doodle. A dancer joins them, and Holden massages his temples as the dancer returns with the check, glaring suspiciously and offended at Jay. There's silence as Holden's head tilts upward, gazing astonished at Silent Bob, flabbergasted, while Jay and Holden gaze at him. Silent Bob breaks into a dance with his fingers, then flicks him, as Jay lifts his foot as if to step, and Silent Bob sips a drink before Jay and Silent Bob depart. Holden remains at the table, contemplating. Later, he sits in the garden that he and Alyssa traversed, staring at Alyssa's sketchbook drawing, and then a plan occurs to him. He leaps up, races out of the garden, snatches a stool from the side of the hall, where Banky and Alyssa lounge on the sofa, and strides in front of them. Alyssa's expression falls as she subtly shakes her head, and the room is silent. Alyssa inhales a breath, her head bowing, while Holden reclines back into the sofa with a heavy sigh. Banky gazes forward, stunned, then shrugs. Holden grins at his friend, then glances at Alyssa and edges to her side of the sofa. Alyssa looks at him sorrowfully, as astonished Banky breathes a sigh of relief. Holden reacts, and a droplet trickles down Alyssa's cheek. She looks at him sorrowfully and touches his arm, then releases him and shoves him, before striding away, pausing briefly to scrutinize Banky up and down, and exits the gallery. The door closes behind her as Banky and Holden stand there, quietly, and a copy of 'Bluntman and Chronic' drifts into the frame."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "On the treadmill, Chef One concocts the knockout punch, launching his spoon into Chef Two's elbow, and the soup pours out like a waterfall as Two collapses quietly. Oliver gapes at Lydia, bewildered, while the audience around them is baffled, focusing not on the scuffle on the treadmill, but the confrontation among their ranks. Lydia frowns and storms off, with Oliver trailing after her, observed by a Passerby. Lydia strides briskly, fastening her hat, and Oliver accelerates to her but hesitates. She gazes at him, wounded and vexed, while Oliver's gaze is lowered, as she anticipates an answer. Oliver shuffles away, and Lydia watches him depart before beginning to tap and jiggle a lamp beside her, eventually slumping to the floor, weeping. Meanwhile, Oliver reclines on the bed, alone in the shadows, when Terrence arrives and settles beside him, extending his hand. Later, Oliver perches alone at a table and glances up to see Carl and Silent Rob posing above him; the duo slip into the table. Oliver extracts an orange from his backpack and flings it to Carl, as Silent Rob thumbs through the cookbook while Carl peers over his arm, commencing to brew a cappuccino. A barista joins them, and Oliver massages his temples as the barista returns with the cup, staring wide-eyed and appalled at Carl. There's a pause as Oliver's head jerks forward, gazing wide-eyed at Silent Rob, astonished, while Carl and Oliver stare at him. Silent Rob waves a twirl with his fingers, then smacks him, as Carl raises his elbow as if to pound, and Silent Rob ignites a matchstick before Carl and Silent Rob depart. Oliver lingers at the table, pondering. Later, he perches in the garden that he and Lydia strolled through, gazing at Lydia's sketchbook drawing, and then an inspiration strikes him. He leaps up, sprints out of the garden, seizes a lamp from the corner of the hall, where Terrence and Lydia recline on the futon, and strides back and forth before them. Lydia's expression falls as she faintly nods her head, and the space is still. Lydia ignites a candle, her head drooping, while Oliver leans back into the futon with a deep exhale. Terrence gazes forward, wide-eyed, then shrugs. Oliver grins at his companion, then glances at Lydia and moves to her part of the futon. Lydia looks at him mournfully, as astonished Terrence lets out a breath of relief. Oliver responds, and a tear trickles down Lydia's face. She gazes at him sorrowfully and grasps his shoulder, then releases him and pokes him, before striding off, pausing momentarily to inspect Terrence up and down, and steps out of the foyer. The curtain closes behind her as Terrence and Oliver stand there, silently, and a copy of 'Spaceman and Herb' enters the picture."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "On the ice, Player One delivers a brutal punch to Player Two, causing chaos. Holden is shocked, watching Alyssa storm off, pursued by him. Holden hesitates as Alyssa waits for a response, then he withdraws. Alyssa kicks a car, collapsing in tears. Later, Holden sits alone when Banky arrives, offering comfort. At a booth, Jay and Silent Bob join Holden; a waitress appears, offended by Jay's behavior. Silent Bob surprises them with a gesture before they leave. Alone, Holden reflects in the park and gains an idea. Rushing to Banky and Alyssa, he paces, prompting Alyssa's disappointment. Alyssa smokes, Holden sighs deeply, and Banky is bewildered. A tearful Alyssa slaps Holden and exits, leaving Holden and Banky in silence."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame The door closes behind her as  She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio  Holden reacts and a tear rolls down Alyssa's cheek  Banky lets out a sigh of relief  Alyssa looks at him sadly as shocked  Holden smiles at his friend then looks at Alyssa and moves to her side of the couch  Banky stares forward wideeyed then shrugs  Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh  Alyssa's face drops as she subtly shakes her head and the room is silent  He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them  Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him  Holden remains in the booth thinking  Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit  There's silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him  A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay  Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint  the pair slide into the booth  Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him  Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms  Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying  She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response  Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back  Alyssa fumes and storms away with Holden chasing after her observed by a Bystander  Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst  On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Alyssa's face drops as she subtly shakes her head and the room is silent  Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame Alyssa looks at him sadly as shocked  Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh  Holden smiles at his friend then looks at Alyssa and moves to her side of the couch  There's silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him  He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them  Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst  Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him  On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard  Banky lets out a sigh of relief  Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint  Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him  The door closes behind her as  Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying  Banky stares forward wideeyed then shrugs  Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit  Alyssa fumes and storms away with Holden chasing after her observed by a Bystander  Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back  She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio  Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms  She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response  the pair slide into the booth  A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay  Holden remains in the booth thinking  Holden reacts and a tear rolls down Alyssa's cheek "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Holden remains in the booth thinking  Later he sits in the park that he and Alyssa walked through staring at Alyssa's yearbook picture and then an idea hits him  He jumps up dashes out of the park grabs a chair from the side of the room where Banky and Alyssa sit on the couch and paces in front of them  Alyssa's face drops as she subtly shakes her head and the room is silent  Alyssa lights a cigarette her head dropping while Holden leans back into the couch with a huge sigh  Banky stares forward wideeyed then shrugs  Holden smiles at his friend then looks at Alyssa and moves to her side of the couch  Alyssa looks at him sadly as shocked  Banky lets out a sigh of relief  Holden reacts and a tear rolls down Alyssa's cheek  She looks at him sadly and touches his face then releases him and slaps him before storming away stopping briefly to look Banky up and down and walks out of the studio  The door closes behind her as  Banky and Holden stand there silently and a copy of 'Bluntman and Chronic' enters the frame On the ice Player One delivers the kill shot slamming his fist into Player Two's nose and the blood shoots out like a geyser as Two goes down hard  Holden stares at Alyssa flabbergasted while the crowd around them is shocked focusing not on the fight on the ice but the fight in their midst  Alyssa fumes and storms away with Holden chasing after her observed by a Bystander  Alyssa marches quickly pulling on her coat and Holden catches up to her but pulls back  She stares at him hurt and pissed while Holden's eyes are downcast as she waits for a response  Holden skulks off and Alyssa stares after him before starting to kick and punch a car beside her finally slumping to the ground crying  Meanwhile Holden sits on the couch alone in the dark when Banky enters and sits beside him opening his arms  Later Holden sits alone at a booth and looks up to see Jay and Silent Bob standing above him  the pair slide into the booth  Holden pulls an envelope out of his jacket and tosses it to Jay as Silent Bob thumbs through the comic while Jay looks over his shoulder beginning to roll a joint  A waitress joins them and Holden rubs his eyes as the waitress returns with the order staring wideeyed and offended at Jay  There's silence as Holden's head snaps forward staring wideeyed at Silent Bob shocked while Jay and Holden look at him  Silent Bob busts a move with his hands then backhands him as Jay raises his fist as if to strike and Silent Bob lights a cigarette before Jay and Silent Bob exit "
        }
      ]
    }
  ]
}