{
  "ground_truth": "Hannah, who'd been mashing some food in a bowl on a nearby counter, hesitates momentarily and then turns to Holly. Licking her fingers, Hannah walks past Holly to attend to some food on a different stove. Holly turns to face her, and only Holly is seen as she talks to the offscreen Hannah, with the camera moving in closer on her face. As Holly speaks, she distractedly nibbles an hors d'oeuvre, and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa, with some guests chattering quietly, while others drink and eat, listening. As they continue to sing, the film cuts back to the kitchen, where Lee, carrying some glasses, enters through the doorway and walks over to her sisters, putting the glasses down on a counter. Hannah is scooping seeds out of a cantaloupe, while Holly, leaning on the table, sips her drink. The music from the living room is softly heard as the three sisters chat comfortably and easily with each other, until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink. The film cuts briefly back to the living room, where Evan is still playing the piano and singing, and the camera moves past him and a few guests to Norma, who is enthusiastically singing along, looking at Evan and moving her hands. The table is beautifully set for Thanksgiving dinner, complete with candles, flowers, cut crystal, china, and silver. Hannah's children are playing in the room as Hannah enters, carrying a huge roast turkey, with Holly carrying a casserole behind her. The film cuts to April, standing in the doorway of the dining room and holding a drink. Holly groans, looking at her sister, while April sips her drink and nods. Hannah screams with laughter as she walks toward the end of the table, past a gleeful Holly, who points her finger at Hannah as she passes. Hannah, still laughing, playfully pushes the accusing finger away and walks over to a nearby china cabinet. As Holly continues to tease her sister, Hannah opens a drawer in the cabinet, takes out two apples decorated with paper turkey heads and tails, and hands them to April. While Holly is talking, Hannah hands her the last turkey apple, accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the bathroom, moving down the hallway towards the camera. Elliot walks into the bedroom as Lee continues to talk offscreen, and the camera, leaving Elliot, moves across the room, past a wall of framed paintings, a headboard and bed, a night table and lamp, revealing Lee.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Hannah, who'd been crushing some cuisine in a dish on a nearby surface, pauses momentarily and then turns to Holly. Licking her digits, Hannah strides past Holly to tend to some cuisine on a different range. Holly rotates to face her, and only Holly is perceived as she converses with the offscreen Hannah, with the camera advancing in closer on her visage. As Holly articulates, she absentmindedly bites an appetizer, and then pops another into her mouth as the background chanting becomes louder and the film transitions to a child sprawled out beneath a covering on a couch, with some visitors murmuring quietly, while others sip and consume, listening. As they persist to sing, the film transitions back to the kitchen, where Lee, carrying some goblets, enters through the entrance and strides over to her siblings, placing the goblets down on a surface. Hannah is scooping seeds out of a melon, while Holly, reclining on the table, sips her beverage. The melody from the living room is softly audible as the three siblings chat comfortably and easily with one another, until Hannah shakes her head in disapproval while Holly irritably takes another sip of her beverage. The film transitions briefly back to the living room, where Evan is still playing the piano and chanting, and the camera shifts past him and a few visitors to Norma, who is enthusiastically chanting along, gazing at Evan and moving her limbs. The table is beautifully arranged for Thanksgiving feast, complete with candles, blossoms, cut crystal, porcelain, and silver. Hannah's offspring are frolicking in the room as Hannah enters, carrying a huge roast turkey, with Holly carrying a casserole behind her. The film transitions to April, standing in the doorway of the dining room and holding a beverage. Holly groans, gazing at her sibling, while April sips her beverage and nods. Hannah screams with laughter as she strides toward the end of the table, past a gleeful Holly, who points her digit at Hannah as she passes. Hannah, still laughing, playfully pushes the accusing digit away and strides over to a nearby porcelain cabinet. As Holly continues to tease her sibling, Hannah opens a drawer in the cabinet, extracts two apples adorned with paper turkey heads and tails, and hands them to April. While Holly is speaking, Hannah hands her the final turkey apple, inadvertently sticking her with one of the toothpicks that keeps the adornments in position. He strolls out of the restroom, moving down the corridor towards the camera. Elliot strides into the bedroom as Lee continues to speak offscreen, and the camera, leaving Elliot, moves across the room, past a wall of framed artworks, a headboard and bed, a nightstand and lamp, revealing Lee."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Hannah, who had been mashing some food in a bowl on a nearby counter, is momentarily hesitant, then she is turned by herself to face Holly. Her fingers are licked by Hannah as Holly is walked past to attend to some food on a different stove by her. Holly faces her, and only Hannah is seen talking to her, with the camera moving in closer on Holly's face. While Holly speaks, an hors d'oeuvre is distractedly nibbled by her, and then another one is popped into her mouth as the background singing gets louder and the film shows a child sprawling under a blanket on a sofa, some guests are chattering quietly, while others drink and eat, listening. As the singing is continued, the film shows the kitchen again, where Lee, carrying some glasses, has entered through the doorway and walked over to her sisters, putting the glasses down on a counter. Seeds are being scooped out of a cantaloupe by Hannah, while Holly is sipped on her drink while leaning on the table. From the living room, the music is softly heard as comfortable and easy chatting is done by the three sisters, until Hannah's head is shaken in disapproval while Holly angrily sips her drink again. The film briefly shows the living room again, where Evan still plays the piano and sings, and the camera moves past him and a few guests to show Norma, who sings along enthusiastically, looking at Evan and moving her hands. Thanksgiving dinner is set beautifully on the table, complete with candles, flowers, cut crystal, china, and silver. The children of Hannah play in the room as Hannah carries a huge roast turkey while entering, with a casserole being carried by Holly behind her. The dining room doorway is where April stands, holding a drink, and the film cuts to her. Holly looks at her sister and groans, while April sips her drink and nods. Laughter erupts from Hannah as she walks toward the end of the table, passing a gleeful Holly, who is pointing her finger at Hannah as she passes. The accusing finger is playfully pushed away by Hannah, still laughing, and she walks over to a nearby china cabinet. The drawer in the cabinet is opened by Hannah as Holly continues to tease her sister, and two apples decorated with paper turkey heads and tails are taken out and handed to April by her. While Holly talks, the last turkey apple is handed to her by Hannah, who accidentally sticks her with one of the toothpicks keeping the decorations in place. He walks out of the bathroom, moving down the hallway towards the camera. Elliot enters the bedroom as Lee continues to talk offscreen, and the camera, leaving Elliot, moves across the room, past a wall of framed paintings, a headboard and bed, a night table and lamp, revealing Lee."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hannah, mashing food in a bowl, hesitates before turning to Holly. Licking her fingers, she attends to food on another stove. Holly faces her, talking to the offscreen Hannah as the camera zooms in. Holly nibbles an hors d'oeuvre as singing grows louder, cutting to a child under a blanket on a sofa, while guests chat and listen. The film cuts back to the kitchen where Lee enters, carrying glasses to her sisters. Hannah scoops cantaloupe seeds, and Holly, sipping her drink, leans on the table. The music is softly heard as the sisters comfortably chat, until Hannah disapproves and Holly angrily sips her drink. The film briefly cuts to the living room, showing Evan playing piano and Norma enthusiastically singing. The Thanksgiving table is beautifully set with candles, flowers, crystal, china, and silver. Hannah's children play as she carries a roast turkey, Holly following with a casserole. The film cuts to April in the dining room doorway. Holly groans at April, who nods while sipping her drink. Hannah laughs and walks past Holly, who playfully points at her. Hannah pushes the finger away, opens a china cabinet drawer, and gives April two apples with paper turkey heads. Holly teases Hannah, who hands Holly a turkey apple, accidentally pricking her with a toothpick. Elliot exits the bathroom, moves down the hallway, and enters the bedroom as the camera reveals Lee."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hannah pauses mashing food, licks her fingers, and moves to another stove past Holly. Holly speaks to offscreen Hannah while nibbling an hors d'oeuvre. The scene shifts to a child on a sofa, guests chattering, then back to the kitchen where Lee enters with glasses. Hannah scoops cantaloupe seeds; Holly sips her drink. Music is faint as sisters chat until Hannah disapproves and Holly drinks angrily. Evan plays piano; Norma sings enthusiastically. The table is set for Thanksgiving. Hannah's children play while she carries a turkey, Holly a casserole. April stands with a drink, and Hannah laughs as Holly teases her. Hannah hands April decorated apples, accidentally pricking Holly. Elliot exits the bathroom, enters the bedroom; the camera reveals Lee."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Hannah, who had been diligently mashing some food in a bowl placed on a nearby counter, hesitates for a brief moment before turning her attention towards Holly. As Hannah licks her fingers to clean them, she purposefully walks past Holly in order to attend to some food cooking on a different stove. Holly then turns to face her sister, and only Holly is visible on-screen as she communicates with the offscreen Hannah. Meanwhile, the camera gradually moves in closer to focus on Holly's face. While Holly speaks, she becomes slightly distracted and begins to nibble on an hors d'oeuvre. She then casually pops another into her mouth as the singing in the background becomes increasingly louder, and the film cuts to a scene of a child splayed out under a blanket on a sofa. Around this child, some guests are engaging in quiet chatter, while others are focused on drinking and eating, attentively listening to the music. As the singing continues to fill the atmosphere, the film transitions back to the kitchen scene. Lee, carrying several glasses, makes her entrance through the doorway and approaches her sisters, carefully placing the glasses down on a nearby counter. Hannah is preoccupied with scooping seeds out of a luscious cantaloupe, while Holly, leaning nonchalantly against the table, takes a sip of her drink. The gentle hum of music from the living room can be faintly heard as the three sisters engage in a comfortable and easy conversation with one another. This continues until Hannah disapprovingly shakes her head, causing Holly to react angrily by taking a forceful sip of her drink. The film once again briefly shifts back to the living room, where Evan continues to skillfully play the piano and sing. The camera pans smoothly past him and several guests to focus on Norma, who is singing along with great enthusiasm, her gaze fixed on Evan as she moves her hands expressively. The dining table is elegantly set for Thanksgiving dinner, adorned with candles, flowers, cut crystal, china, and gleaming silverware. Hannah's children are joyfully playing in the room as Hannah enters, proudly carrying an enormous roast turkey, followed by Holly bearing a casserole. The film then shifts to show April, who is standing in the doorway of the dining room, holding a drink in her hand. Holly groans audibly, directing her gaze towards her sister, while April takes a sip of her drink and nods in acknowledgment. Hannah bursts into laughter as she walks towards the far end of the table, moving past a gleeful Holly. Holly playfully points her finger at Hannah as she goes by, and Hannah, still chuckling, gently pushes the accusatory finger away and proceeds toward a nearby china cabinet. As Holly continues to tease her sister lightheartedly, Hannah opens a drawer in the cabinet, retrieving two apples that are decoratively adorned with paper turkey heads and tails, which she then hands over to April. As Holly continues talking, Hannah hands her the last turkey apple, accidentally pricking her with one of the toothpicks used to secure the decorations in place. He emerges from the bathroom and strides down the hallway in the direction of the camera. Elliot makes his way into the bedroom as Lee continues to speak offscreen, and the camera, having left Elliot behind, moves across the room. It passes by a wall of framed paintings, a stately headboard and bed, a night table, and a lamp, finally revealing Lee."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Hannah, who had been diligently engaged in the task of mashing some food in a bowl that was conveniently placed on a nearby counter, pauses for a brief moment of hesitation before shifting her focus towards Holly. As she makes sure her fingers are clean by licking them, she purposefully walks past Holly, making her way to attend to some food that is cooking on another stove. At that moment, Holly turns to face her sister, and only Holly is visible on the screen as she communicates with the offscreen Hannah. Meanwhile, the camera gradually moves closer and closer to focus intently on Holly's face. As Holly converses, she finds herself becoming slightly distracted and starts to nibble thoughtfully on an hors d'oeuvre. She then casually pops another one into her mouth, as the background singing becomes increasingly louder. The film then makes a cut to a scene depicting a child who is comfortably splayed out under a thick blanket on a sofa. Surrounding this child, several guests are quietly engaged in chatter, while others are focused on drinking and eating, attentively listening to the enchanting music. As the singing continues to fill the atmosphere with its melodious presence, the film transitions back to the bustling kitchen scene. Lee, carrying an assortment of glasses, makes her entrance through the open doorway and approaches her sisters, carefully placing the glasses down upon a nearby counter. In this moment, Hannah is preoccupied with the task of scooping seeds out of a luscious, juicy cantaloupe, while Holly, leaning nonchalantly against the table, takes a sip from her drink. The gentle hum of music from the living room can be faintly heard as the three sisters engage in a comfortable and easy conversation with one another. This continues until Hannah disapprovingly shakes her head, prompting Holly to react angrily by taking a more forceful sip of her drink. The film momentarily shifts back to the living room, where Evan continues to skillfully play the piano and sing beautifully. The camera pans smoothly past him and several guests, eventually focusing on Norma, who is singing along with great enthusiasm, her eyes fixed keenly on Evan as she moves her hands expressively in time with the music. The dining table, set for Thanksgiving dinner, is elegantly adorned with flickering candles, vibrant flowers, cut crystal, exquisite china, and gleaming silverware. Hannah's children are joyfully playing in the room as Hannah herself enters, proudly carrying an enormous roast turkey, followed closely by Holly who is bearing a casserole. The film then shifts to show April, who is standing poised in the doorway of the dining room, holding a drink in her hand. Holly groans audibly, directing her gaze towards her sister, while April takes a sip of her drink and nods in acknowledgment. Hannah bursts into laughter as she walks confidently towards the far end of the table, moving past a gleeful Holly. Holly playfully points her finger at Hannah as she goes by, and Hannah, still chuckling, gently pushes the accusatory finger aside and proceeds toward a nearby china cabinet. As Holly continues to teasingly banter with her sister, Hannah opens a drawer in the cabinet, retrieving two apples that are decoratively adorned with charming paper turkey heads and tails, which she then hands over to April. As Holly goes on talking, Hannah hands her the last turkey apple, accidentally pricking her with one of the toothpicks used to secure the delightful decorations in place. Meanwhile, he emerges from the bathroom and strides down the hallway in the direction of the camera. Elliot makes his way into the bedroom as Lee continues her speech offscreen, and the camera, having left Elliot behind, moves gracefully across the room. It passes by a wall adorned with framed paintings, a stately headboard and bed, a night table, and a lamp, ultimately revealing Lee in her element."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Hannah, who had been energetically mashing some food in a bowl on a nearby counter, paused for a brief moment as she considered her next move and then directed her attention towards Holly. Taking a moment to lick her fingers clean of any remnants, Hannah walked past Holly with a purposeful stride to attend to another culinary task at a different stove. In response, Holly turned her body to face Hannah, and the camera framed only Holly as she began to speak to the offscreen Hannah, zooming in to capture every nuance of her expression. While engaging in conversation, Holly absentmindedly nibbled on an hors d'oeuvre, savoring the flavor before quickly popping another into her mouth, as the singing from the background gradually intensified. The scene then transitioned to show a child sprawled comfortably under a blanket on a sofa, enveloped by the soothing ambiance of guests who were engaged in soft chatter, drinking, eating, and listening to the surrounding melodies. As the singing persisted, the film cut back to the dynamic activity of the kitchen, where Lee, balancing several glasses, entered through the doorway and made her way over to her sisters. She gently placed the glasses down on a counter before joining the interaction. Meanwhile, Hannah was meticulously scooping seeds out of a cantaloupe, a task requiring precision, while Holly, leaning casually on the table, took a refreshing sip of her drink. In the background, the gentle strains of music drifted in from the living room, providing a comforting soundtrack as the three sisters engaged in relaxed, easy conversation until a moment of tension arose—Hannah shook her head in disapproval, leading Holly to react by taking an angry gulp of her drink. The narrative briefly returned to the living room, revealing Evan still immersed in playing the piano and singing, as the camera gracefully navigated past him and several guests to focus on Norma, who was fervently singing along, her eyes fixed on Evan while her hands moved animatedly to the rhythm. The dining room was impeccably prepared for Thanksgiving dinner, adorned with glowing candles, vibrant flowers, cut crystal glasses, gleaming china, and polished silverware. As Hannah's children played merrily in the room, Hannah herself made an entrance, carefully balancing a huge roast turkey, with Holly following closely, bearing a casserole. The narrative shifted to show April, standing poised in the doorway of the dining room, a drink in hand. Holly emitted a groan, casting a glance at her sister, while April nonchalantly sipped her drink and nodded in acknowledgment. Hannah let out a scream of laughter as she approached the end of the table, passing a gleefully amused Holly, who mischievously pointed a finger at Hannah as she walked by. Giggling, Hannah playfully brushed Holly's finger aside before heading towards a nearby china cabinet. During this lighthearted exchange, while Holly continued to tease her, Hannah promptly opened a drawer in the cabinet and retrieved two apples adorned with whimsical paper turkey heads and tails, which she then handed to April. As Holly persisted with her banter, Hannah handed her the last turkey apple, unintentionally poking Holly with one of the toothpicks that secured the decoration in place. Meanwhile, another character, now he, emerged from the bathroom and proceeded to navigate the hallway, moving steadily towards the camera. This was followed by Elliot entering a bedroom as Lee's voice continued to resonate offscreen. The camera, leaving Elliot momentarily, swept across the room, capturing the intricate details of a wall adorned with framed paintings, a headboard with an inviting bed, a night table, and a softly glowing lamp, before ultimately revealing Lee."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hannah, after mashing food in a bowl, momentarily hesitates before addressing Holly. She then moves past Holly to attend to a stove. Holly faces her, nibbling on hors d'oeuvres, as the camera zooms in. As the background singing intensifies, the scene shifts to a child resting under a blanket on a sofa amidst quiet guests. The film returns to the kitchen where Lee arrives with glasses, joining her sisters. Hannah is preparing a cantaloupe while Holly leans on the table, sipping her drink. The sisters chat comfortably until Hannah disapproves, leading Holly to sip her drink in annoyance. The scene shifts back to the living room, showing Evan at the piano while Norma sings along enthusiastically. The Thanksgiving table is beautifully set, and Hannah's children play as she enters with a roast turkey, followed by Holly with a casserole. The film cuts to April in the dining room doorway, holding a drink. Holly groans at her sister, and April sips and nods. Hannah laughs as she walks to the table, past Holly, who teasingly points at her. Laughing, Hannah pushes away Holly's finger and opens a china cabinet drawer, retrieving two apple turkeys for April. While Holly teases, Hannah hands her a final apple, accidentally pricking Holly with a toothpick. Elliot exits the bathroom and walks down the hall towards the camera. Entering the bedroom, the focus moves from Elliot to Lee, revealed after traversing past framed paintings and furnishings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Hannah, who'd been mashing some food in a bowl on a nearby counter, hesitates momentarily and then turns to Holly, her sister and a budding actress who recently returned from an audition. Licking her fingers, Hannah walks past Holly to attend to some food on a different stove, where a fragrant soup simmers, a recipe passed down from their grandmother. Holly turns to face her, and only Holly is seen as she talks to the offscreen Hannah, with the camera moving in closer on her face. As Holly speaks, she distractedly nibbles an hors d'oeuvre, a small puff pastry filled with cheese and herbs, and then pops another into her mouth as the background singing, a rendition of \"Autumn Leaves\" by Johnny Mercer, gets louder and the film cuts to a child sprawled out under a blanket on a sofa, with some guests, including longtime family friends, chattering quietly, while others drink and eat, listening. As they continue to sing, the film cuts back to the kitchen, where Lee, carrying some glasses, enters through the doorway and walks over to her sisters, putting the glasses down on a counter. Hannah is scooping seeds out of a cantaloupe, a task she dislikes but does for her children's love of the fruit, while Holly, leaning on the table, sips her drink. The music from the living room is softly heard as the three sisters chat comfortably and easily with each other, until Hannah shakes her head in disapproval of a past disagreement they’ve had while Holly angrily takes another sip of her drink. The film cuts briefly back to the living room, where Evan, a skilled pianist known for his jazz performances, is still playing the piano and singing, and the camera moves past him and a few guests to Norma, who is enthusiastically singing along, looking at Evan and moving her hands in rhythm. The table is beautifully set for Thanksgiving dinner, complete with candles, flowers, cut crystal, china, and silver, evoking a sense of tradition and celebration. Hannah's children are playing in the room, creating an atmosphere of joyful chaos, as Hannah enters, carrying a huge roast turkey, with Holly carrying a casserole behind her. The film cuts to April, standing in the doorway of the dining room and holding a drink, reflecting on the festive scene. Holly groans, looking at her sister, while April sips her drink and nods. Hannah screams with laughter as she walks toward the end of the table, past a gleeful Holly, who points her finger at Hannah as she passes. Hannah, still laughing, playfully pushes the accusing finger away and walks over to a nearby china cabinet that holds treasured heirlooms. As Holly continues to tease her sister, Hannah opens a drawer in the cabinet, takes out two apples decorated with paper turkey heads and tails, a whimsical family tradition, and hands them to April. While Holly is talking, Hannah hands her the last turkey apple, accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the bathroom, the hallway dimly lit by the warm glow of vintage sconces, moving down the hallway towards the camera. Elliot walks into the bedroom as Lee continues to talk offscreen, and the camera, leaving Elliot, moves across the room, past a wall of framed paintings that reflect the family's appreciation for art, a headboard and bed, a night table and lamp, revealing Lee."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands Licking her fingers Hannah walks past Holly to attend to some food on a different stove As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening Holly groans looking at her sister while April sips her drink and nods Licking her fingers Hannah walks past Holly to attend to some food on a different stove Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her The film cuts to April standing in the doorway of the dining room and holding a drink The film cuts to April standing in the doorway of the dining room and holding a drink Holly groans looking at her sister while April sips her drink and nods He walks out of the bathroom moving down the hallway towards the camera The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place He walks out of the bathroom moving down the hallway towards the camera Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly. Licking her fingers Hannah walks past Holly to attend to some food on a different stove. Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face. As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening. As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter. Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink. The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink. The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands. The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her. The film cuts to April standing in the doorway of the dining room and holding a drink. Holly groans looking at her sister while April sips her drink and nods. Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes. Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet. As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April. While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the bathroom moving down the hallway towards the camera. Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving. Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly. Licking her fingers Hannah walks past Holly to attend to some food on a different stove. Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face. As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening. As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter. Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink. The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink. The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands. The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her. The film cuts to April standing in the doorway of the dining room and holding a drink. Holly groans looking at her sister while April sips her drink and nods. Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes. Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet. As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April. While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the bathroom moving down the hallway towards the camera. Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving. Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly. Licking her fingers Hannah walks past Holly to attend to some food on a different stove. Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face. As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening. As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter. As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April. While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the bathroom moving down the hallway towards the camera. Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving. Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly. Licking her fingers Hannah walks past Holly to attend to some food on a different stove. Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving. Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Jonathan, who'd been mashing some food in a bowl on a nearby counter, hesitates momentarily and then turns to Max. Licking her fingers, Jonathan walks past Max to attend to some food on a different stove. Max turns to face him, and only Max is seen as he talks to the offscreen Jonathan, with the camera moving in closer on his face. As Max speaks, he distractedly nibbles an hors d'oeuvre, and then pops another into his mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa, with some guests chattering quietly, while others drink and eat, listening. As they continue to sing, the film cuts back to the kitchen, where Sarah, carrying some glasses, enters through the doorway and walks over to her brothers, putting the glasses down on a counter. Jonathan is scooping seeds out of a cantaloupe, while Max, leaning on the table, sips his drink. The music from the living room is softly heard as the three brothers chat comfortably and easily with each other, until Jonathan shakes his head in disapproval while Max angrily takes another sip of his drink. The film cuts briefly back to the living room, where Noah is still playing the piano and singing, and the camera moves past him and a few guests to Oscar, who is enthusiastically singing along, looking at Noah and moving his hands. The table is beautifully set for Thanksgiving dinner, complete with candles, flowers, cut crystal, china, and silver. Jonathan's children are playing in the room as Jonathan enters, carrying a huge roast turkey, with Max carrying a casserole behind him. The film cuts to Zoe, standing in the doorway of the dining room and holding a drink. Max groans, looking at his brother, while Zoe sips her drink and nods. Jonathan screams with laughter as he walks toward the end of the table, past a gleeful Max, who points his finger at Jonathan as he passes. Jonathan, still laughing, playfully pushes the accusing finger away and walks over to a nearby china cabinet. As Max continues to tease his brother, Jonathan opens a drawer in the cabinet, takes out two apples decorated with paper turkey heads and tails, and hands them to Zoe. While Max is talking, Jonathan hands him the last turkey apple, accidentally sticking him with one of the toothpicks that keeps the decorations in place. She walks out of the bathroom, moving down the hallway towards the camera. Oliver walks into the bedroom as Sarah continues to talk offscreen, and the camera, leaving Oliver, moves across the room, past a wall of framed paintings, a headboard and bed, a night table and lamp, revealing Sarah."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Hannah, who'd been mashing some clay in a pot on a nearby shelf, hesitates momentarily and then turns to Holly. Licking her fingers, Hannah walks past Holly to attend to some clay on a different easel. Holly turns to face her, and only Holly is seen as she talks to the offscreen Hannah, with the camera moving in closer on her face. As Holly speaks, she distractedly nibbles a cracker, and then pops another into her mouth as the background humming gets louder and the film cuts to a child sprawled out under a rug on a hammock, with some guests whispering quietly, while others sip and snack, listening. As they continue to hum, the film cuts back to the studio, where Lee, carrying some brushes, enters through the doorway and walks over to her sisters, putting the brushes down on a shelf. Hannah is scooping pebbles out of a melon, while Holly, leaning on the counter, sips her tea. The humming from the lounge is softly heard as the three sisters chat comfortably and easily with each other, until Hannah shakes her head in disapproval while Holly angrily takes another sip of her tea. The film cuts briefly back to the lounge, where Evan is still playing the violin and humming, and the camera moves past him and a few guests to Norma, who is enthusiastically humming along, looking at Evan and moving her fingers. The mantel is beautifully set for a festive feast, complete with lanterns, branches, cut glass, ceramics, and brass. Hannah's children are playing in the atrium as Hannah enters, carrying a huge stuffed pumpkin, with Holly carrying a tart behind her. The film cuts to April, standing in the doorway of the conservatory and holding a book. Holly groans, looking at her sister, while April sips her tea and nods. Hannah screams with laughter as she walks toward the end of the mantel, past a gleeful Holly, who points her finger at Hannah as she passes. Hannah, still laughing, playfully pushes the accusing finger away and walks over to a nearby bookcase. As Holly continues to tease her sister, Hannah opens a drawer in the bookcase, takes out two oranges decorated with paper butterfly wings, and hands them to April. While Holly is talking, Hannah hands her the last butterfly orange, accidentally sticking her with one of the toothpicks that keeps the decorations in place. He walks out of the closet, moving down the hallway towards the camera. Elliot walks into the studio as Lee continues to talk offscreen, and the camera, leaving Elliot, moves across the room, past a wall of framed sketches, a bookshelf and couch, a side table and candle, revealing Lee."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Hannah, who'd been tossing some food in a bowl on a nearby counter, pauses momentarily and then waves to Holly. Wiping her hands, Hannah skips past Holly to gaze at some food on a different stove. Holly spins to face her, and only Holly is seen as she smiles at the offscreen Hannah, with the camera gliding in closer on her face. As Holly speaks, she absentmindedly twirls an hors d'oeuvre, and then flicks another into her mouth as the background singing swells and the film shifts to a child curled up under a blanket on a sofa, with some guests whispering softly, while others wander and chat, listening. As they persist in singing, the film shifts back to the kitchen, where Lee, balancing some glasses, strolls through the doorway and skips over to her sisters, setting the glasses down on a counter. Hannah is carving seeds out of a cantaloupe, while Holly, perched on the table, swirls her drink. The music from the living room is faintly heard as the three sisters laugh easily and gently with each other, until Hannah nods her head in approval while Holly excitedly takes another sip of her drink. The film shifts briefly back to the living room, where Evan is still tickling the piano and humming, and the camera glides past him and a few guests to Norma, who is eagerly humming along, gazing at Evan and tapping her feet. The table is beautifully adorned for Thanksgiving dinner, complete with candles, flowers, cut crystal, china, and silver. Hannah's children are dancing in the room as Hannah enters, bouncing a huge roast turkey, with Holly balancing a casserole behind her. The film cuts to April, lounging in the doorway of the dining room and cradling a drink. Holly sighs, glancing at her sister, while April twirls her drink and grins. Hannah erupts with laughter as she dashes toward the end of the table, past a delighted Holly, who winks at Hannah as she passes. Hannah, still giggling, gently swats the playful finger away and skips over to a nearby china cabinet. As Holly continues to jest her sister, Hannah pulls open a drawer in the cabinet, extracts two apples adorned with paper turkey heads and tails, and hands them to April. While Holly is jesting, Hannah hands her the last turkey apple, inadvertently pricking her with one of the toothpicks that secures the decorations in place. He wanders out of the bathroom, gliding down the hallway towards the camera. Elliot steps into the bedroom as Lee continues to whisper offscreen, and the camera, leaving Elliot, slides across the room, past a wall of framed paintings, a headboard and bed, a night table and lamp, revealing Lee."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jasper, who'd been plucking some petals in a vase on a nearby desk, pauses briefly and then turns to Kelly. Smelling her wrist, Jasper strolls past Kelly to tend to some plants on a different bookshelf. Kelly turns to face him, and only Kelly is seen as she talks to the offscreen Jasper, with the camera moving in closer on his face. As Kelly speaks, she absentmindedly nibbles a cracker, and then pops another into his mouth as the background humming gets louder and the video cuts to a cat stretched out under a towel on a recliner, with some toys squeaking quietly, while others bounce and roll, observing. As they continue to hum, the video cuts back to the study, where Max, carrying some books, enters through the doorway and walks over to his cousins, putting the books down on a desk. Jasper is peeling leaves off of an artichoke, while Kelly, leaning on the shelf, sips her tea. The humming from the hallway is softly heard as the three cousins chat comfortably and easily with one another, until Jasper shakes his head in disapproval while Kelly angrily takes another sip of his tea. The video cuts briefly back to the hallway, where Quinn is still strumming the guitar and humming, and the camera moves past him and a few toys to Vivian, who is enthusiastically humming along, looking at Quinn and waving her arms. The desk is beautifully set for Halloween lunch, complete with ghosts, pumpkins, frosted glass, denim, and wood. Jasper's cats are rolling in the room as Jasper enters, carrying a massive pumpkin pie, with Kelly carrying a fruit bowl behind him. The video cuts to Meagan, standing in the doorway of the living room and holding a mug. Kelly groans, looking at his cousin, while Meagan sips her mug and nods. Jasper screams with laughter as he walks toward the end of the desk, past a gleeful Kelly, who points his elbow at Jasper as he passes. Jasper, still laughing, playfully nudges the pointing elbow away and walks over to a nearby bookcase. As Kelly continues to tease his cousin, Jasper opens a compartment in the bookcase, takes out two pears decorated with paper witch hats and brooms, and hands them to Meagan. While Kelly is chatting, Jasper hands him the last witch pear, accidentally poking him with one of the pins that holds the decorations in place. She walks out of the closet, moving down the corridor towards the camera. Oliver walks into the attic as Max continues to chat offscreen, and the camera, leaving Oliver, moves across the room, past a wall of taped sketches, a headrest and chair, a side table and candle, revealing Max."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Monica, who'd been sorting some books in a crate on a nearby shelf, pauses briefly and then gestures to Sophie. Rubbing her palms, Monica skips past Sophie to examine some plants on a different windowsill. Sophie pivots to gaze at her, and only Sophie is seen as she gestures to the offscreen Monica, with the camera zooming in closer on her face. As Sophie gestures, she absentmindedly munches a cracker, and then tosses another into her mouth as the background humming gets louder and the film cuts to a cat curled up under a quilt on a sofa, with some guests murmuring softly, while others laugh and read, watching. As they continue to hum, the film cuts back to the kitchen, where Tara, carrying some plates, emerges through the doorway and skips over to her siblings, putting the plates down on a table. Monica is gathering leaves out of an avocado, while Sophie, leaning on the chair, gulps her juice. The noise from the dining room is gently heard as the three siblings chat comfortably and happily with each other, until Monica nods her head in confusion while Sophie irritably takes another gulp of her juice. The film cuts briefly back to the dining room, where Max is still tuning the guitar and humming, and the camera pans past him and a few guests to Susan, who is energetically humming along, watching Max and clapping her hands. The counter is beautifully set for Christmas brunch, complete with lanterns, plants, etched glass, ceramics, and bronze. Monica's pets are napping in the room as Monica enters, carrying a large loaf of bread, with Sophie carrying a salad bowl behind her. The film cuts to Mark, standing in the doorway of the kitchen and holding a notebook. Sophie sighs, glancing at her sibling, while Mark gulps his drink and winks. Monica giggles with joy as she skips toward the edge of the counter, past a jubilant Sophie, who waves her hand at Monica as she passes. Monica, still giggling, playfully swats the waving hand aside and skips over to a nearby wooden cabinet. As Sophie continues to joke with her sibling, Monica slides open a drawer in the cabinet, takes out two oranges decorated with paper snowman hats and scarves, and hands them to Mark. While Sophie is laughing, Monica hands her the last snowman orange, accidentally jabbing her with one of the toothpicks that keeps the decorations in place. She saunters out of the closet, wandering down the hallway towards the camera. Oliver strolls into the study as Tara continues to murmur offscreen, and the camera, leaving Oliver, glides across the room, past a wall of framed photographs, a bookshelf and chair, a side table and vase, revealing Tara."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Hannah, who'd been painting some pottery in a kiln on a nearby desk, pauses briefly and then spins to Holly. Wiping her fingertips, Hannah strides past Holly to adjust some sculptures on a different easel. Holly pivots to face her, and only Holly is visible as she chats to the offscreen Hannah, with the camera zooming in closer on her face. As Holly talks, she absentmindedly munches a cracker, and then crunches another as the background drumming gets louder and the film cuts to a child tangled up under a quilt on a hammock, with some guests murmuring softly, while others scribble and doodle, listening. As they continue to drum, the film cuts back to the studio, where Lee, holding some brushes, enters through the doorway and strolls over to her sisters, placing the brushes down on a desk. Hannah is chiseling seeds out of a pumpkin, while Holly, leaning on the easel, gulps her beverage. The drumming from the living room is softly heard as the three sisters converse cheerfully and fluidly with each other, until Hannah nods her head in approval while Holly happily takes another sip of her beverage. The film cuts briefly back to the living room, where Evan is still tapping the drums and humming, and the camera moves past him and a few guests to Norma, who is energetically drumming along, looking at Evan and clapping her hands. The desk is beautifully arranged for a birthday celebration, complete with lanterns, vines, etched glass, clay, and copper. Hannah's children are jumping in the room as Hannah enters, carrying a massive chocolate cake, with Holly carrying a pie behind her. The film cuts to April, standing in the doorway of the art room and holding a brush. Holly grins, looking at her sister, while April brushes her hair and waves. Hannah bursts with giggles as she dances toward the end of the desk, past a joyful Holly, who wags her finger at Hannah as she twirls. Hannah, still chuckling, playfully swats the wagging finger away and skips over to a nearby clay shelf. As Holly proceeds to tease her sister, Hannah opens a drawer in the shelf, removes two oranges adorned with paper penguin heads and tails, and hands them to April. While Holly is joking, Hannah hands her the last penguin orange, accidentally poking her with one of the chopsticks that keeps the decorations in place. He walks out of the closet, dancing down the hallway towards the camera. Elliot walks into the lounge as Lee continues to sing offscreen, and the camera, departing from Elliot, sweeps across the room, past a wall of framed photographs, a headboard and bed, a coffee table and vase, revealing Lee."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Samantha, who'd been sketching some maps in a notebook on a distant bookshelf, pauses briefly and then turns to Sarah. Dusting off her sleeves, Samantha strides beyond Sarah to ponder over some maps on a different easel. Sarah spins to face her, and only Sarah is visible as she whispers to the unseen Samantha, with the lens zooming in closer on her visage. As Sarah murmurs, she absentmindedly chews on a berry, and then pops another into her mouth as the ambient humming intensifies and the scene shifts to a cat curled up on a rug beside a fireplace, with some neighbors whispering softly, while others sip and nibble, observing. As they persist in humming, the scene shifts back to the art studio, where Sam, clutching some brushes, enters through the archway and ambles up to her cousins, placing the brushes down on a bookshelf. Samantha is scooping pebbles out of a pumpkin, while Sarah, reclining on the stool, gulps her beverage. The melody from the lounge is faintly audible as the three cousins converse warmly and easily together, until Samantha shakes her head in disagreement while Sarah crossly takes another gulp of her beverage. The scene momentarily shifts back to the lounge, where Owen is still strumming the guitar and humming, and the lens drifts past him and a few neighbors to Nina, who is eagerly humming along, watching Owen and waving her arms. The sideboard is elegantly arranged for Easter brunch, complete with lanterns, leaves, cut glass, pottery, and bronze. Samantha's kittens are leaping in the space as Samantha appears, carrying a massive baked ham, with Sarah carrying a basket behind her. The scene cuts to Alex, standing in the archway of the salon and holding a book. Sarah groans, glaring at her cousin, while Alex sips her beverage and grins. Samantha shrieks with delight as she strolls toward the edge of the sideboard, past an amused Sarah, who gestures at Samantha as she goes by. Samantha, still chuckling, cheerfully shoves the pointing hand aside and strolls over to a nearby bookshelf. As Sarah proceeds to jest with her cousin, Samantha opens a compartment in the bookshelf, retrieves two peaches garnished with paper rabbit ears and tails, and hands them to Alex. While Sarah is speaking, Samantha gives her the final rabbit peach, inadvertently poking her with one of the skewers that holds the garnishes in place. She strolls out of the library, meandering down the corridor towards the lens. Michael steps into the lounge as Sam persists in speaking offscreen, and the lens, leaving Michael, drifts across the space, past a row of doodled maps, a nightstand, a dresser, a cupboard and lamp, unveiling Sam."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hannah, busy in the kitchen, initially hesitates but then continues cooking as Holly talks to her. Holly enjoys hors d'oeuvres while their conversations are interspersed with background music from guests in the living room. Lee joins her sisters in the kitchen, carrying glasses, as they chat comfortably until a disagreement causes Holly to sip her drink angrily. In the living room, Evan plays piano, and Norma enthusiastically sings along, surrounded by guests. The table is elegantly set for Thanksgiving, with children playing as Hannah enters with a turkey and Holly follows with a casserole. April stands in the doorway, drinking as Holly teases Hannah, who laughs heartily and distributes decorative turkey apples. An accidental prick from a toothpick interrupts the fun. As Elliot walks into the bedroom, the camera shifts focus, revealing Lee amidst the room's decor."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving He walks out of the bathroom moving down the hallway towards the camera While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes Holly groans looking at her sister while April sips her drink and nods The film cuts to April standing in the doorway of the dining room and holding a drink Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face Licking her fingers Hannah walks past Holly to attend to some food on a different stove Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes He walks out of the bathroom moving down the hallway towards the camera The film cuts to April standing in the doorway of the dining room and holding a drink Licking her fingers Hannah walks past Holly to attend to some food on a different stove Holly groans looking at her sister while April sips her drink and nods Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The film cuts to April standing in the doorway of the dining room and holding a drink Holly groans looking at her sister while April sips her drink and nods Hannah screams with laughter as she walks toward the end of the table past a gleeful Holly who points her finger at Hannah as she passes Hannah still laughing playfully pushes the accusing finger away and walks over to a nearby china cabinet As Holly continues to tease her sister Hannah opens a drawer in the cabinet takes out two apples decorated with paper turkey heads and tails and hands them to April While Holly is talking Hannah hands her the last turkey apple accidentally sticking her with one of the toothpicks that keeps the decorations in place He walks out of the bathroom moving down the hallway towards the camera Elliot walks into the bedroom as Lee continues to talk offscreen and the camera leaving Elliot moves across the room past a wall of framed paintings a headboard and bed a night table and lamp revealing Lee Hannah who would been mashing some food in a bowl on a nearby counter hesitates momentarily and then turns to Holly Licking her fingers Hannah walks past Holly to attend to some food on a different stove Holly turns to face her and only Holly is seen as she talks to the offscreen Hannah with the camera moving in closer on her face As Holly speaks she distractedly nibbles an hors d'oeuvre and then pops another into her mouth as the background singing gets louder and the film cuts to a child sprawled out under a blanket on a sofa with some guests chattering quietly while others drink and eat listening As they continue to sing the film cuts back to the kitchen where Lee carrying some glasses enters through the doorway and walks over to her sisters putting the glasses down on a counter Hannah is scooping seeds out of a cantaloupe while Holly leaning on the table sips her drink The music from the living room is softly heard as the three sisters chat comfortably and easily with each other until Hannah shakes her head in disapproval while Holly angrily takes another sip of her drink The film cuts briefly back to the living room where Evan is still playing the piano and singing and the camera moves past him and a few guests to Norma who is enthusiastically singing along looking at Evan and moving her hands The table is beautifully set for Thanksgiving dinner complete with candles flowers cut crystal china and silver Hannah's children are playing in the room as Hannah enters carrying a huge roast turkey with Holly carrying a casserole behind her"
        }
      ]
    }
  ]
}