{
  "ground_truth": "DYLE has the large man by both lapels of the raincoat in a last-ditch effort to hold him, but SCOBIE, his face horribly distorted from the strain, continues to inch forward toward the gun. Suddenly, DYLE releases his hold, and with nothing restraining him, SCOBIE lurches forward, tumbling past the gun, his momentum carrying him onto the sloping part of the roof, where he begins sliding down. SCOBIE beats wildly at the slate with his claw, trying to gouge a grip as it slides across the slate, making a hideous scratching sound and causing sparks to fly, until he slides over the edge and disappears. As DYLE watches, hypnotized, there appears to be no sign of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's metal hand, gripping the rain gutter at the very edge. Having seen the claw, DYLE rises and walks to the very edge of the level part of the roof, then turns and leaves going down the stairs. DYLE leaves the elevator and goes to his own door, where the MANAGER eyes him coldly. She leads him into her room, then as REGGIE and DYLE enter from his room, she leads him to the bed. She wets the cotton with disinfectant and begins cleaning the wound as he winces. She continues working on his back, cleaning it, then bandaging it while they talk. He goes to the bed and sits as she starts kissing him on the neck, on the chin, on the cheek, then on the mouth. The phone rings, and he tries to talk as she continues kissing him. The phone continues to ring and she continues to kiss him until finally, REGGIE reaches out to the bedstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEAN-LOUIS and puts him down on SCOBIE's other knee. A knock at the door, GIDEON goes to open it as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's gun, causing a pause as the three men look at one another unhappily. He takes DYLE's key and gives DYLE his, and GIDEON goes to REGGIE, takes her key and gives her his own. Including TEX, busy going through the bureau, who looks up, then joins GIDEON. GIDEON empties the contents of the bag on the table, then starts examining the various items, opening the wallet, then putting it aside and picking up the letter, removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "DYLE has the big man by both collars of the raincoat in a final effort to hold him, but SCOBIE, his face terribly twisted from the tension, continues to inch forward toward the firearm. Suddenly, DYLE releases his grip, and with nothing restraining him, SCOBIE lunges forward, tumbling past the firearm, his momentum carrying him onto the sloping part of the roof, where he begins sliding down. SCOBIE strikes wildly at the slate with his claw, trying to gouge a grip as it slides across the slate, making a terrible scratching noise and causing sparks to fly, until he slides over the edge and vanishes. As DYLE watches, mesmerized, there appears to be no sign of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's metal hand, gripping the rain gutter at the very edge. Having seen the claw, DYLE rises and walks to the very border of the level part of the roof, then turns and departs going down the stairs. DYLE exits the elevator and goes to his own door, where the MANAGER eyes him coldly. She leads him into her room, then as REGGIE and DYLE enter from his room, she guides him to the bed. She wets the cotton with antiseptic and begins cleaning the injury as he winces. She continues working on his back, cleaning it, then bandaging it while they converse. He goes to the bed and sits as she starts kissing him on the neck, on the chin, on the cheek, then on the lips. The phone rings, and he tries to talk as she continues kissing him. The phone continues to ring and she continues to kiss him until finally, REGGIE reaches out to the nightstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEAN-LOUIS and places him down on SCOBIE's other knee. A knock at the door, GIDEON goes to open it as REGGIE and DYLE come in. She sees JEAN-LOUIS and TEX's firearm, causing a pause as the three men look at one another unhappily. He takes DYLE's key and gives DYLE his, and GIDEON goes to REGGIE, takes her key and gives her his own. Including TEX, busy going through the bureau, who glances up, then joins GIDEON. GIDEON empties the contents of the bag on the table, then starts examining the various items, opening the wallet, then putting it aside and picking up the letter, extracting it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The large man is held by DYLE by both lapels of the raincoat in a last-ditch effort to restrain him, but SCOBIE, his face horribly distorted from the strain, is continued to be inched forward toward the gun by himself. Suddenly, his hold is released by DYLE, and with nothing restraining him, SCOBIE is lurched forward, tumbling past the gun, his momentum is carried onto the sloping part of the roof, where the sliding begins. The slate is beaten wildly by SCOBIE with his claw, trying to have a grip gained as it is slid across the slate, making a hideous scratching sound and causing sparks to fly, until the edge is slid over and he disappears. Hypnotized, DYLE watches, and there appears to be no sign of SCOBIE, but then the claw is seen as the camera zooms in for a tight close shot of SCOBIE's metal hand, gripping the rain gutter at the very edge. The claw is seen by DYLE, who rises and walks to the very edge of the level part of the roof, then leaves going down the stairs. The elevator is left by DYLE and his own door is approached, where he is eyed coldly by the MANAGER. He is led into her room by her, then as REGGIE and DYLE enter from his room, he is led to the bed by her. The cotton is wetted with disinfectant and the wound is begun to be cleaned as he winces. His back is continued to be worked on by her, cleaning it, then it is bandaged while they talk. The bed is approached by him and sat on, as she starts kissing him on the neck, on the chin, on the cheek, then a kiss is given on the mouth. The phone rings, and as it is tried to be talked into by him, the kissing is continued by her. The phone is continued to ring and the kissing is continued by her until finally, the bedstand is reached out to by REGGIE and the phone is taken off the hook by her. The receiver is brought up to their mouths and mumbled into by her while TEX speaks into the phone. The phone is covered and DYLE is turned to in alarm by her as JEAN-LOUIS is lifted by TEX and put down on SCOBIE's other knee. A knock at the door, and the door is opened by GIDEON as REGGIE and DYLE are entered. JEAN-LOUIS and TEX's gun are seen by her, causing a pause as the three men look at one another unhappily. DYLE's key is taken and his own is given by him, and REGGIE is approached by GIDEON, her key is taken and his own is given to her. Including TEX, busy going through the bureau, who looks up, then GIDEON is joined. The contents of the bag are emptied on the table by GIDEON, then the various items are started to be examined, the wallet is opened by him, then put aside and the letter is picked up, removed from the envelope and read. A broad grin is flashed by TEX as the items from the bag continue to be gone through."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "DYLE grips the large man's raincoat lapels, trying to hold him, but SCOBIE, face strained, inches toward the gun. Suddenly, DYLE lets go, and SCOBIE, unrestrained, falls past the gun onto the sloped roof, sliding down. SCOBIE claws at the slate, creating sparks and a hideous sound, until he slides over the edge and vanishes. DYLE, mesmerized, sees no sign of SCOBIE until the camera zooms in on SCOBIE's metal hand gripping the rain gutter. Seeing the claw, DYLE walks to the roof's edge, then leaves down the stairs. Exiting the elevator, he encounters the MANAGER, who coldly leads him to her room. REGGIE and DYLE enter, and she cleans his wound with disinfectant, bandaging it as they talk. He sits on the bed, and she kisses him on the neck, chin, cheek, and mouth. The phone rings, and he tries to speak as she continues kissing him. REGGIE finally answers the phone, mumbling into it while TEX speaks. Alarmed, she turns to DYLE as TEX places JEAN-LOUIS on SCOBIE's knee. A knock at the door, GIDEON opens it as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's gun, causing a pause. The men exchange keys, and GIDEON joins TEX, who is searching the bureau. GIDEON empties a bag on the table, examines items, opens a wallet, and reads a letter, while TEX grins as they continue searching."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "DYLE grips the large man's raincoat lapels, trying to hold him, but SCOBIE, strained and distorted, inches toward the gun. DYLE releases him, and SCOBIE, unrestrained, tumbles past the gun, sliding down the roof. SCOBIE claws at the slate, sparking and scratching, until he disappears over the edge. DYLE watches, hypnotized, until the camera zooms in on SCOBIE's metal hand gripping the rain gutter. Seeing the claw, DYLE walks to the roof's edge, then leaves down the stairs. DYLE exits the elevator to his door, where the MANAGER coldly eyes him. She leads him to her room, cleans his wound with disinfectant, and bandages it while they talk. He sits on the bed as she kisses him. The phone rings, and she continues kissing him until REGGIE takes the phone off the hook. She mumbles into it while TEX speaks. Alarmed, she turns to DYLE as TEX places JEAN-LOUIS on SCOBIE's knee. A knock at the door, GIDEON opens it as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's gun, causing a pause. DYLE exchanges keys with GIDEON, who then gives REGGIE his key. TEX, searching the bureau, joins GIDEON, who empties the bag on the table, examines items, and reads a letter. TEX grins as they continue."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a desperate and final attempt to maintain his grip on the situation, DYLE clutches the large man by both lapels of his raincoat, trying to hold him back. However, SCOBIE, whose face is grotesquely contorted from the immense strain, relentlessly inches forward, determined to reach the gun. In a sudden and unexpected move, DYLE releases his hold, and with nothing left to restrain him, SCOBIE lurches forward uncontrollably. He tumbles past the gun, his momentum propelling him onto the sloping section of the roof, where he begins to slide downward. In a frantic effort to save himself, SCOBIE wildly beats at the slate with his metal claw, desperately trying to gouge a grip. The claw slides across the slate, producing a hideous scratching sound and causing sparks to fly, until he ultimately slides over the edge and vanishes from sight. As DYLE stands there, watching in a state of hypnotized shock, there seems to be no trace of SCOBIE. But then, the camera zooms in for a tight close-up shot, revealing SCOBIE's metal hand gripping the rain gutter at the very edge. Upon seeing the claw, DYLE rises to his feet and walks to the very edge of the level part of the roof, then turns and leaves, making his way down the stairs.\n\nDYLE exits the elevator and proceeds to his own door, where the MANAGER regards him with a cold, scrutinizing gaze. She leads him into her room, and as REGGIE and DYLE enter from his room, she guides him to the bed. She wets a piece of cotton with disinfectant and begins the process of cleaning the wound, causing him to wince in discomfort. She continues her meticulous work on his back, cleaning it thoroughly before bandaging it, all while they engage in conversation. He moves to the bed and sits down as she starts to kiss him tenderly on the neck, then on the chin, followed by the cheek, and finally on the mouth. The phone rings persistently, and he attempts to speak as she continues her affectionate kisses. The phone keeps ringing, and she keeps kissing him until, at last, REGGIE reaches out to the bedstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks on the other end of the line. She covers the phone and turns to DYLE with a look of alarm as TEX lifts JEAN-LOUIS and places him down on SCOBIE's other knee.\n\nA knock at the door prompts GIDEON to go and open it as REGGIE and DYLE enter the room. She notices JEAN-LOUIS and TEX's gun, causing a momentary pause as the three men exchange unhappy glances. He takes DYLE's key and hands DYLE his own, and GIDEON approaches REGGIE, taking her key and giving her his. Including TEX, who is busy rifling through the bureau, looks up and then joins GIDEON. GIDEON empties the contents of the bag onto the table, then begins examining the various items, opening the wallet, then setting it aside and picking up the letter, removing it from the envelope and reading it. A broad grin spreads across TEX's face as they continue to sift through the items from the bag."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a final, desperate attempt to maintain his firm grip on the unfolding situation, DYLE clutches the large man by both lapels of his raincoat, striving to hold the momentum back. However, SCOBIE, whose face is grotesquely contorted under the immense strain, relentlessly inches forward, driven by a fierce determination to reach the gun that lies ahead. In a sudden and unexpected move, DYLE releases his hold, and with nothing left to restrain him, SCOBIE lurches forward with uncontrollable force. He ends up tumbling past the gun, his momentum propelling him onto the sloping section of the roof where he begins to slide downward. In a frantic effort to save himself from impending doom, SCOBIE desperately beats at the slate with his metal claw, trying to gouge out a grip. The claw slides across the slate, producing a hideous, grating sound and causing bright sparks to fly, until he ultimately slides over the roof's edge and vanishes from sight. As DYLE stands there, watching in a state of hypnotized shock, there seems to be no trace of SCOBIE remaining. But then, the camera zooms in for a tight, close-up shot, revealing SCOBIE's metal hand gripping the rain gutter at the very edge of the roof. Upon seeing the claw, DYLE rises to his feet with renewed purpose and walks to the very edge of the roof's level part, then turns and leaves, making his way down the stairs.\n\nDYLE exits the elevator and proceeds to approach his own door, where the MANAGER meets him with a cold, scrutinizing gaze. She leads him into her room, and as REGGIE and DYLE enter from his room, she guides him toward the bed. She wets a piece of cotton with disinfectant and begins the careful process of cleaning the wound, causing him to wince from the discomfort. She continues this meticulous work on his back, cleaning it thoroughly before moving on to bandage it, all while they engage in conversation. He moves to the bed and sits down as she starts to kiss him tenderly on the neck, then on the chin, followed by the cheek, and finally on the mouth with deep affection. As the phone rings persistently, he tries to speak while she continues her affectionate kisses. The phone continues its relentless ringing, and she maintains her kisses until, at last, REGGIE reaches for the bedside stand and takes the phone off the hook. She brings the receiver up to their mouths, mumbling into it while TEX speaks on the other end of the line. She covers the phone and turns to DYLE with a look of alarm as TEX lifts JEAN-LOUIS and places him down on SCOBIE's other knee.\n\nA knock at the door prompts GIDEON to go and open it as REGGIE and DYLE enter the room together. She notices JEAN-LOUIS and TEX's gun, causing a momentary pause as the three men exchange tense, unhappy glances. He takes DYLE's key and hands DYLE his own in a swift motion, and GIDEON approaches REGGIE, taking her key and giving her his in return. Including TEX, who is busy rifling through the contents of the bureau, glances up and then joins GIDEON. GIDEON empties the contents of the bag onto the table, then begins to methodically examine the various items, opening the wallet, setting it aside, and picking up the letter, which he removes from the envelope to read. A broad grin spreads across TEX's face as they continue to sift through and inspect the items retrieved from the bag."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "DYLE clutches the large man by both lapels of the raincoat, desperately trying to maintain his grip in a last-ditch effort to hold him back. Meanwhile, SCOBIE, with his face contorted in a grotesque expression from the immense strain, painstakingly inches forward, his focus solely on reaching the gun. In a sudden and unexpected move, DYLE releases his hold, and without the restraint, SCOBIE is propelled forward by his own momentum. He stumbles past the gun and onto the sloping part of the roof, where gravity takes over, and he begins to slide downward. In a frantic attempt to stop his descent, SCOBIE flails wildly, his metal claw scraping against the slate roof, creating a hideous scratching noise and sending sparks flying into the air. Despite his efforts, he slides over the edge and vanishes from sight. DYLE, entranced by the unfolding scene, watches intently, initially seeing no trace of SCOBIE. However, the camera zooms in to reveal a tight close-up of SCOBIE's metal hand, which is gripping the rain gutter at the very edge of the roof. Upon noticing the claw, DYLE stands up and walks cautiously to the edge of the level part of the roof, then turns away and descends the stairs. Exiting the elevator, DYLE proceeds to his own door, where the MANAGER greets him with a cold, scrutinizing gaze. She escorts him into her room, and as REGGIE and DYLE enter from his room, she guides him to the bed. She moistens a piece of cotton with disinfectant and begins to clean his wound, causing him to wince in discomfort. She diligently continues to tend to his back, cleaning and then bandaging it while they engage in conversation. He moves to the bed and sits down as she starts to kiss him tenderly on the neck, then on the chin, followed by the cheek, and finally on the mouth. The phone rings, and he attempts to speak while she persistently kisses him. The phone continues to ring, and she continues her affectionate gestures until REGGIE finally reaches out to the bedstand, picks up the phone, and takes it off the hook. She brings the receiver to their mouths and mumbles into it while TEX speaks on the other end. She covers the phone and turns to DYLE with a look of alarm as TEX lifts JEAN-LOUIS and places him on SCOBIE's other knee. A knock at the door prompts GIDEON to open it as REGGIE and DYLE enter the room. Upon seeing JEAN-LOUIS and TEX's gun, a moment of hesitation occurs as the three men exchange unhappy glances. GIDEON takes DYLE's key and hands him his own, then approaches REGGIE, takes her key, and gives her his. Meanwhile, TEX, who is busy rifling through the bureau, looks up and then joins GIDEON. GIDEON empties the contents of the bag onto the table and begins to scrutinize the various items, opening the wallet, examining it briefly, and setting it aside before picking up a letter, removing it from its envelope, and reading it. TEX grins broadly as they continue to sift through the items from the bag."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "DYLE desperately clings to SCOBIE's raincoat lapels, but SCOBIE, straining, inches toward the gun. When DYLE releases him, SCOBIE's momentum sends him tumbling past the gun and sliding down the roof. He frantically tries to grip the slate with his metal claw, creating sparks and a screeching sound, until he disappears over the edge. DYLE, entranced, watches until he spots SCOBIE's metal hand gripping the rain gutter. Realizing this, DYLE moves to the roof's edge, then turns and descends the stairs. Exiting the elevator, he encounters the MANAGER, who coldly leads him to her room. There, REGGIE and DYLE enter, and she tends to his wound, cleaning and bandaging it as they converse. DYLE sits on the bed, and she begins kissing him persistently, even as the phone rings. REGGIE eventually answers the phone, mumbling into it while TEX speaks. Alarmed, she turns to DYLE as TEX places JEAN-LOUIS on SCOBIE's knee. A knock at the door prompts GIDEON to open it as REGGIE and DYLE enter, pausing at the sight of JEAN-LOUIS and TEX's gun. The men exchange keys, and GIDEON joins TEX, who is rifling through the bureau. GIDEON empties a bag on the table, examining its contents, including a wallet and a letter, which he reads with TEX grinning broadly as they continue their search."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "DYLE has the large man by both lapels of the raincoat in a last-ditch effort to hold him, but SCOBIE, whose face is horribly distorted from the strain reminiscent of soldiers under physical duress in intense situations, continues to inch forward toward the gun. Suddenly, DYLE releases his hold, and with nothing restraining him, SCOBIE lurches forward, tumbling past the gun, his momentum carrying him onto the sloping part of the roof, situated on a historic building known for its complex architecture, where he begins sliding down. SCOBIE beats wildly at the slate made of traditional Welsh material prized for its durability, trying to gouge a grip as it slides across the slate, making a hideous scratching sound and causing sparks to fly, until he slides over the edge and disappears. As DYLE watches, hypnotized much like an audience captivated by a high-stakes drama, there appears to be no sign of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's metal hand, an advanced prosthetic designed for enhanced grip, gripping the rain gutter at the very edge. Having seen the claw, DYLE, aware of the precarious situation, rises and walks to the very edge of the level part of the roof, then turns and leaves going down the stairs. DYLE leaves the elevator, an older model still common in European buildings, and goes to his own door, where the MANAGER, a stern woman who has managed this establishment for decades, eyes him coldly. She leads him into her room, an inviting space in contrast to the tension outside, then as REGGIE and DYLE enter from his room, she leads him to the bed, an antique piece with a rich history. She wets the cotton with disinfectant, a common antiseptic used to prevent infection, and begins cleaning the wound as he winces. She continues working on his back, cleaning it, then bandaging it while they talk. He goes to the bed and sits as she starts kissing him on the neck, on the chin, on the cheek, then on the mouth, in a display of intimate solace. The phone rings, an old rotary model that adds to the classic ambiance of the setting, and he tries to talk as she continues kissing him. The phone continues to ring and she continues to kiss him until finally, REGGIE reaches out to the bedstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX, a man known for his smooth but disconcerting Southern drawl, speaks into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEAN-LOUIS, a young child oblivious to the tension around him, and puts him down on SCOBIE's other knee. A knock at the door, GIDEON, an ex-intelligence officer with a keen sense for danger, goes to open it as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's gun, causing a pause as the three men, each holding secrets that could shift the power dynamics, look at one another unhappily. He takes DYLE's key, a small object that unlocks more than just doors, and gives DYLE his, and GIDEON goes to REGGIE, takes her key and gives her his own. Including TEX, busy going through the bureau, who looks up, then joins GIDEON. GIDEON empties the contents of the bag on the table, revealing a collection that could rival a spy's toolkit, then starts examining the various items, opening the wallet, a designer brand indicating the owner's status, then putting it aside and picking up the letter, potentially a document of high importance, removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag, each piece possibly a clue to the unfolding mystery."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun  Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down  SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears  The phone rings and he tries to talk as she continues kissing him  The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook  She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone  She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee  A knock at the door  GIDEON goes to open it as REGGIE and DYLE enter  She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily  He takes DYLE's key and gives DYLE his and GIDEON goes to  REGGIE takes her key and gives her his own  Including TEX busy going through the bureau who looks up then joins GIDEON  GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it  As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge  Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs  DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly  She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed  She wets the cotton with disinfectant and begins cleaning the wound as he winces  She continues working on his back cleaning it then bandaging it while they talk  He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth  The phone rings and he tries to talk as she continues kissing him  The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook  She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone  She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee  A knock at the door  GIDEON goes to open it as REGGIE and DYLE enter  She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily  He takes DYLE's key and gives DYLE his and GIDEON goes to  REGGIE takes her key and gives her his own  Including TEX busy going through the bureau who looks up then joins GIDEON  GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it  A broad grin from TEX as they continue going through the items from the bag"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun. Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down. SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears. As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge. Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs. DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly. She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed. She wets the cotton with disinfectant and begins cleaning the wound as he winces. She continues working on his back cleaning it then bandaging it while they talk. He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth. The phone rings and he tries to talk as she continues kissing him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee. A knock at the door. GIDEON goes to open it as REGGIE and DYLE enter. She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily. He takes DYLE's key and gives DYLE his and GIDEON goes to. REGGIE takes her key and gives her his own. Including TEX busy going through the bureau who looks up then joins GIDEON. GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun. Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down. SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears. As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge. Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs. DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly. She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed. She wets the cotton with disinfectant and begins cleaning the wound as he winces. She continues working on his back cleaning it then bandaging it while they talk. He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth. The phone rings and he tries to talk as she continues kissing him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee. A knock at the door. GIDEON goes to open it as REGGIE and DYLE enter. She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily. He takes DYLE's key and gives DYLE his and GIDEON goes to. REGGIE takes her key and gives her his own. Including TEX busy going through the bureau who looks up then joins GIDEON. GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun. Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down. SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears. As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge. Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs. DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly. He takes DYLE's key and gives DYLE his and GIDEON goes to. REGGIE takes her key and gives her his own. Including TEX busy going through the bureau who looks up then joins GIDEON. GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun. Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down. SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears. GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it. A broad grin from TEX as they continue going through the items from the bag."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "FELIX has the small bird by both lapels of the raincoat in a last-ditch effort to hold it, but MURPHY, his face horribly distorted from the strain, continues to inch forward toward the gun. Suddenly, FELIX releases his hold, and with nothing restraining it, MURPHY lurches forward, tumbling past the gun, his momentum carrying him onto the sloping part of the roof, where he begins sliding down. MURPHY beats wildly at the slate with its claw, trying to gouge a grip as it slides across the slate, making a hideous scratching sound and causing sparks to fly, until it slides over the edge and disappears. As FELIX watches, hypnotized, there appears to be no sign of MURPHY, but then the camera zooms in for a tight close shot of MURPHY's metal hand, gripping the rain gutter at the very edge. Having seen the claw, FELIX rises and walks to the very edge of the level part of the roof, then turns and leaves going down the stairs. FELIX leaves the elevator and goes to its own door, where the CHEF eyes it coldly. He leads it into his room, then as LUCY and FELIX enter from its room, he leads it to the bed. He wets the cotton with disinfectant and begins cleaning the wound as it winces. He continues working on its back, cleaning it, then bandaging it while they talk. It goes to the bed and sits as he starts kissing it on the neck, on the chin, on the cheek, then on the mouth. The phone rings, and it tries to talk as he continues kissing it. The phone continues to ring and he continues to kiss it until finally, LUCY reaches out to the bedstand and takes the phone off the hook. He brings the receiver up to their mouths and mumbles into it while SAM speaks into the phone. He covers the phone and turns to FELIX in alarm as SAM lifts OLIVIA and puts her down on MURPHY's other knee. A knock at the door, OWEN goes to open it as LUCY and FELIX enter. He sees OLIVIA and SAM's gun, causing a pause as the three animals look at one another unhappily. It takes FELIX's key and gives FELIX his, and OWEN goes to LUCY, takes its key and gives it his own. Including SAM, busy going through the bureau, who looks up, then joins OWEN. OWEN empties the contents of the bag on the table, then starts examining the various items, opening the wallet, then putting it aside and picking up the letter, removing it from the envelope and reading it. A broad grin from SAM as they continue going through the items from the bag."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "DYLE has the large man by both lapels of the cardigan in a last-ditch effort to hold him, but SCOBIE, his face horribly distorted from the strain, continues to inch forward toward the baseball bat. Suddenly, DYLE releases his hold, and with nothing restraining him, SCOBIE lurches forward, tumbling past the bat, his momentum carrying him onto the grassy part of the yard, where he begins sliding down. SCOBIE beats wildly at the gravel with his hook, trying to gouge a grip as it slides across the gravel, making a hideous scratching sound and causing sparks to fly, until he slides over the edge and disappears. As DYLE watches, hypnotized, there appears to be no sign of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's metal hand, gripping the garden fence at the very edge. Having seen the hook, DYLE rises and walks to the very edge of the level part of the yard, then turns and leaves going down the ladder. DYLE leaves the escalator and goes to his own basement, where the SUPERVISOR eyes him coldly. She leads him into her garage, then as REGGIE and DYLE enter from his basement, she leads him to the couch. She wets the sponge with antiseptic and begins cleaning the wound as he winces. She continues working on his back, cleaning it, then bandaging it while they talk. He goes to the couch and sits as she starts kissing him on the ear, on the forehead, on the nose, then on the lips. The alarm rings, and he tries to talk as she continues kissing him. The alarm continues to ring and she continues to kiss him until finally, REGGIE reaches out to the dresser and takes the alarm off the hook. She brings the receiver up to their mouths and mumbles into it while TEX speaks into the device. She covers the device and turns to DYLE in alarm as TEX lifts JEAN-LOUIS and puts him down on SCOBIE's other foot. A knock at the window, GIDEON goes to open it as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's flashlight, causing a pause as the three men look at one another unhappily. He takes DYLE's watch and gives DYLE his, and GIDEON goes to REGGIE, takes her watch and gives her his own. Including TEX, busy going through the wardrobe, who looks up, then joins GIDEON. GIDEON empties the contents of the suitcase on the ottoman, then starts examining the various items, opening the diary, then putting it aside and picking up the postcard, removing it from the package and reading it. A broad grin from TEX as they continue going through the items from the suitcase."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "DYLE has the large man by both lapels of the raincoat in a last-ditch effort to tickle him, but SCOBIE, his face horribly distorted from the strain, continues to dance forward toward the gun. Suddenly, DYLE releases his hold, and with nothing restraining him, SCOBIE leaps forward, skipping past the gun, his momentum swinging him onto the sloping part of the roof, where he begins rolling down. SCOBIE taps rhythmically at the slate with his claw, trying to caress a grip as it glides across the slate, creating a melodious whistling sound and causing feathers to fly, until he rolls over the edge and vanishes. As DYLE watches, entranced, there appears to be no sign of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's metal hand, flicking the rain gutter at the very edge. Having seen the claw, DYLE rises and hops to the very edge of the level part of the roof, then spins and drifts down the stairs. DYLE exits the elevator and floats to his own door, where the MANAGER smiles at him warmly. She ushers him into her room, then as REGGIE and DYLE waltz in from his room, she guides him to the bed. She sprinkles the cotton with perfume and starts decorating the wound as he chuckles. She continues crafting on his back, painting it, then wrapping it while they chat. He skips to the bed and reclines as she starts hugging him on the neck, on the chin, on the cheek, then on the mouth. The phone chirps, and he tries to sing as she continues hugging him. The phone continues to chirp and she continues to hug him until finally, REGGIE reaches out to the bedstand and snatches the phone off the hook. She waves the receiver up to their mouths and whispers into it while TEX sings into the phone. She shields the phone and gazes at DYLE in surprise as TEX lifts JEAN-LOUIS and sets him down on SCOBIE's other knee. A rap at the door, GIDEON goes to knock it as REGGIE and DYLE stroll in. She gazes at JEAN-LOUIS and TEX's gun, causing a giggle as the three men gaze at one another awkwardly. He grabs DYLE's key and tosses DYLE his, and GIDEON skips to REGGIE, takes her key and tosses her his own. Including TEX, busy sifting through the bureau, who glances up, then joins GIDEON. GIDEON pours the contents of the bag on the table, then starts juggling the various items, juggling the wallet, then setting it aside and swiping up the letter, extracting it from the envelope and humming it. A wide grin from TEX as they continue juggling the items from the bag."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "CHERRY has the small cat by both arms of the sweater in a last-ditch effort to hold her, but BUTTON, his eyes horribly bright from the tension, continues to inch backward toward the broom. Suddenly, CHERRY releases his hold, and with nothing restraining her, BUTTON lurches backward, tumbling past the broom, her momentum carrying her onto the winding part of the path, where she begins sliding up. BUTTON beats wildly at the stones with her feather, trying to gouge a grip as it slides across the stones, making a hideous scratching sound and causing sparks to fly, until she slides over the edge and disappears. As CHERRY watches, mesmerized, there appears to be no sign of BUTTON, but then the clock zooms in for a tight close shot of BUTTON's plastic foot, gripping the fence post at the very edge. Having seen the feather, CHERRY rises and walks to the very brink of the flat part of the path, then turns and leaves going up the steps. CHERRY leaves the staircase and goes to his own window, where the CHEF eyes her warmly. He leads her into his kitchen, then as GARLAND and CHERRY enter from her kitchen, he leads her to the table. He wets the napkin with vinegar and begins cleaning the stain as she winces. He continues working on her arm, cleaning it, then bandaging it while they talk. She goes to the table and sits as he starts hugging her on the shoulder, on the ear, on the forehead, then on the nose. The doorbell rings, and she tries to listen as he continues hugging her. The doorbell continues to ring and he continues to hug her until finally, GARLAND reaches out to the windowsill and takes the bell off the hook. He brings the clapper up to their ears and mumbles into it while PAT speaks into the bell. He covers the bell and turns to CHERRY in alarm as PAT lifts SAMUEL and puts him down on BUTTON's other foot. A knock at the window, MURPHY goes to open it as GARLAND and CHERRY enter. He sees SAMUEL and PAT's broom, causing a pause as the three women look at one another happily. He takes CHERRY's card and gives CHERRY his, and MURPHY goes to GARLAND, takes his card and gives him her own. Including PAT, busy going through the pantry, who looks up, then joins MURPHY. MURPHY empties the contents of the drawer on the chair, then starts examining the various items, opening the book, then putting it aside and picking up the postcard, removing it from the envelope and reading it. A broad grin from PAT as they continue going through the items from the drawer."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "BAXTER has the tall woman by both buttons of the overcoat in a desperate attempt to restrain her, but HARPER, her face horribly contorted from the effort, continues to crawl forward toward the dagger. Suddenly, BAXTER relinquishes his grip, and with nothing holding her back, HARPER stumbles forward, tumbling past the dagger, her momentum carrying her onto the inclining section of the balcony, where she begins slipping down. HARPER thrashes wildly at the shingles with her paw, trying to scrape a hold as it skims across the shingles, making an awful scraping noise and causing embers to fly, until she slips over the brink and vanishes. As BAXTER observes, entranced, there seems to be no trace of HARPER, but then the camera zooms in for a close-up of HARPER's glass hand, gripping the fence at the extreme edge. Having seen the paw, BAXTER rises and paces to the very brink of the level section of the balcony, then turns and retreats going up the ladder. BAXTER exits the lift and heads to his own door, where the JANITOR regards him icily. He escorts him into his office, then as CHARLIE and BAXTER enter from his office, he escorts him to the chair. He dampens the cloth with antiseptic and starts dabbing the scrape as he winces. He continues tending to his shoulder, wiping it, then wrapping it while they converse. He moves to the chair and perches as he starts pecking him on the ear, on the jaw, on the nose, then on the lips. The doorbell chimes, and he tries to converse as he continues pecking him. The doorbell keeps chiming and he continues to peck him until eventually, CHARLIE reaches out to the nightstand and removes the doorbell from the wall. He brings the bell up to their ears and murmurs into it while MAVIS speaks into the chime. He places the chime down and turns to BAXTER in alarm as MAVIS lifts PIERRE and places him down on HARPER's other arm. A knock at the window, JONES goes to bolt it as CHARLIE and BAXTER exit. She notices PIERRE and MAVIS's sword, causing a hesitation as the three women glance at one another gloomily. She takes BAXTER's lock and hands BAXTER hers, and JONES goes to CHARLIE, takes her lock, and hands her his own. Including MAVIS, busy inspecting the closet, who glances up, then joins JONES. JONES spills the contents of the pouch on the counter, then begins scrutinizing the assorted objects, unfolding the diary, then setting it aside and selecting the note, extracting it from the packet and perusing it. A wide grin from MAVIS as they continue inspecting the belongings from the pouch."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "DYLE has the giant by both elbows of the trench coat in a last-ditch attempt to restrain him, but SCOBIE, his face horribly twisted from the pressure, continues to creep backward toward the shoe. Suddenly, DYLE lets go of his grip, and with nothing hindering him, SCOBIE stumbles backward, tumbling past the shoe, his momentum carrying him onto the sloping part of the hill, where he begins rolling down. SCOBIE flails desperately at the grass with his broom, trying to scrape a hold as it skids across the grass, making a hideous rustling sound and causing leaves to scatter, until he rolls over the edge and vanishes. As DYLE observes, entranced, there appears to be no trace of SCOBIE, but then the camera zooms in for a tight close shot of SCOBIE's wooden leg, gripping the fence at the very edge. Having seen the broom, DYLE rises and walks to the very edge of the flat part of the hill, then turns and departs going down the trail. DYLE leaves the staircase and goes to his own window, where the MANAGER regards him frostily. She guides him into her kitchen, then as REGGIE and DYLE enter from his kitchen, she guides him to the table. She moistens the napkin with lotion and begins polishing the bruise as he flinches. She continues working on his arm, polishing it, then wrapping it while they converse. He goes to the table and sits as she starts kissing him on the ear, on the chin, on the forehead, then on the nose. The doorbell rings, and he tries to converse as she continues kissing him. The doorbell continues to ring and she continues to kiss him until finally, REGGIE reaches out to the cabinet and takes the doorbell off the hook. She brings the receiver up to their ears and mutters into it while TEX sings into the phone. She covers the phone and turns to DYLE in alarm as TEX lifts JEAN-LOUIS and puts him down on SCOBIE's other elbow. A tap at the curtain, GIDEON goes to draw it back as REGGIE and DYLE enter. She sees JEAN-LOUIS and TEX's flashlight, causing a hesitation as the three men glance at one another dejectedly. He takes DYLE's ticket and gives DYLE his, and GIDEON goes to REGGIE, takes her ticket and gives her his own. Including TEX, busy going through the drawer, who glances up, then joins GIDEON. GIDEON empties the contents of the carton on the floor, then starts examining the various objects, opening the book, then setting it aside and picking up the postcard, removing it from the envelope and perusing it. A broad grin from TEX as they continue going through the objects from the carton."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "MUNCH has the small cat by both sleeves of the sweater in a desperate attempt to hold her, but BUTTERCUP, her expression joyfully relaxed from the excitement, continues to drift backward toward the balloon. Suddenly, MUNCH releases his grip, and with nothing anchoring her, BUTTERCUP leaps backward, sliding past the balloon, her energy propelling her onto the steep part of the hill, where she starts rolling down. BUTTERCUP swats playfully at the grass with her paw, trying to snag a hold as it slides across the grass, making a delightful rustling sound and causing leaves to scatter, until she rolls over the edge and vanishes. As MUNCH observes, entranced, there seems to be no trace of BUTTERCUP, but then the lens zooms in for a close view of BUTTERCUP's wooly tail, clutching the tree branch at the very border. Having noticed the paw, MUNCH jumps and hops to the very edge of the flat part of the hill, then spins and skips nimbly up the path. MUNCH skips past the garage and jaunts to his own shed, where the CHEF surveys him warmly. He guides him into her kitchen, then as LOTTIE and MUNCH enter from his den, she guides him to the chair. She cools the sponge with cologne and begins wiping the crease as he shivers. She continues massaging his neck, moisturizing it, then wrapping it while they chat. He strolls to the chair and perches as she begins pecking him on the forehead, on the nose, on the hand, then on the lips. The bell chimes, and he tries to whisper as she keeps pecking him. The bell continues to chime and she keeps pecking him until finally, LOTTIE reaches out to the bookshelf and grabs the bell off the shelf. She places the chime up to their ears and whispers into it while BOB sings into the chime. She holds the chime and turns to MUNCH in surprise as BOB hugs CHARLES and sets him down on BUTTERCUP's other arm. A tap at the window, SIMON goes to close it as LOTTIE and MUNCH approach. She spots CHARLES and BOB's umbrella, causing a pause as the tall women stare at one another cheerfully. She grabs MUNCH's hat and gives MUNCH hers, and SIMON goes to LOTTIE, takes her scarf and gives her his own. Including BOB, busy sorting through the trunk, who glances up, then joins SIMON. SIMON spills the contents of the jar on the carpet, then starts examining the various tools, shaking the vase, then placing it aside and picking up the leaf, extracting it from the packet and observing it. A wide smile from BOB as they continue sorting through the tools from the jar."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "DYLE desperately clings to SCOBIE's raincoat to restrain him, but SCOBIE, straining to reach the gun, surges forward when DYLE releases him. SCOBIE slides down the roof, clawing at the slate until he vanishes over the edge. DYLE notices SCOBIE's metal hand gripping the rain gutter, then departs down the stairs. Later, the MANAGER tends to DYLE's wound as REGGIE enters. Amidst kisses, the phone rings; REGGIE answers while TEX places JEAN-LOUIS on SCOBIE's knee. When TEX and GIDEON examine bag contents, TEX grins at the findings, underscoring the tense situation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A broad grin from TEX as they continue going through the items from the bag GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it  Including TEX busy going through the bureau who looks up then joins GIDEON  REGGIE takes her key and gives her his own  He takes DYLE's key and gives DYLE his and GIDEON goes to  She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily  GIDEON goes to open it as REGGIE and DYLE enter  A knock at the door  She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee  She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone  The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook  The phone rings and he tries to talk as she continues kissing him  He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth  She continues working on his back cleaning it then bandaging it while they talk  She wets the cotton with disinfectant and begins cleaning the wound as he winces  She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed  DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly  Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs  As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge  SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears  Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down  DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth  As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge  The phone rings and he tries to talk as she continues kissing him  She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily  GIDEON goes to open it as REGGIE and DYLE enter  REGGIE takes her key and gives her his own  Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down  Including TEX busy going through the bureau who looks up then joins GIDEON  Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs  DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly  She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed  The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook  SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears  A broad grin from TEX as they continue going through the items from the bag She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone  DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun  She continues working on his back cleaning it then bandaging it while they talk  A knock at the door  She wets the cotton with disinfectant and begins cleaning the wound as he winces  She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee  He takes DYLE's key and gives DYLE his and GIDEON goes to  GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The phone continues to ring and she continues to kiss him until finally REGGIE reaches out to the bedstand and takes the phone off the hook  She brings the receiver up to their mouths and mumbles into it while TEX speaks into the phone  She covers the phone and turns to DYLE in alarm as TEX lifts JEANLOUIS and puts him down on SCOBIE's other knee  A knock at the door  GIDEON goes to open it as REGGIE and DYLE enter  She sees JEANLOUIS and TEX's gun causing a pause as the three men look at one another unhappily  He takes DYLE's key and gives DYLE his and GIDEON goes to  REGGIE takes her key and gives her his own  Including TEX busy going through the bureau who looks up then joins GIDEON  GIDEON empties the contents of the bag on the table then starts examining the various items opening the wallet then putting it aside and picking up the letter removing it from the envelope and reading it  A broad grin from TEX as they continue going through the items from the bag DYLE has the large man by both lapels of the raincoat in a lastditch effort to hold him but SCOBIE his face horribly distorted from the strain continues to inch forward toward the gun  Suddenly DYLE releases his hold and with nothing restraining him SCOBIE lurches forward tumbling past the gun his momentum carrying him onto the sloping part of the roof where he begins sliding down  SCOBIE beats wildly at the slate with his claw trying to gouge a grip as it slides across the slate making a hideous scratching sound and causing sparks to fly until he slides over the edge and disappears  As DYLE watches hypnotized there appears to be no sign of SCOBIE but then the camera zooms in for a tight close shot of SCOBIE's metal hand gripping the rain gutter at the very edge  Having seen the claw DYLE rises and walks to the very edge of the level part of the roof then turns and leaves going down the stairs  DYLE leaves the elevator and goes to his own door where the MANAGER eyes him coldly  She leads him into her room then as REGGIE and DYLE enter from his room she leads him to the bed  She wets the cotton with disinfectant and begins cleaning the wound as he winces  She continues working on his back cleaning it then bandaging it while they talk  He goes to the bed and sits as she starts kissing him on the neck on the chin on the cheek then on the mouth  The phone rings and he tries to talk as she continues kissing him "
        }
      ]
    }
  ]
}