{
  "ground_truth": "The two struggle, rolling from side to side, coming perilously close to rolling right off the edge. Things get even more serious when Roscoe pulls a knife. Finally, he raises his head and thrusts his horn through the roof. As the horn smashes through the wood only inches from Indy's head, Indy and Roscoe stare at the horn in amazement as they continue to struggle. Smash! The horn comes up again -- right. Indy kicks Roscoe away. Roscoe rolls to the edge of the car but keeps from falling. Indy flips over onto his stomach. The wooden trap door explodes as a bullet is fired from within. The door is pushed open and Halfbreed and Rough Rider hurry out of the car. Indy gets to his feet -- looks ahead -- sees a water tank alongside the track directly up ahead. In an instant, he calculates his approach -- times the distance -- and leaps for the tank's water spout. He catches it perfectly, but his velocity causes the water spout to rotate a full 360 degrees. With Indy hanging on, feet kicking, the water spout deposits him back on the train, onto the roof of a stockcar, where he looks up to see Fedora walking toward him. As Indy edges away from Fedora, a portion of the stockcar's roof collapses and Indy falls through into the car below. Indy crashes down from above. Dust rises. The men, including Roscoe, pull Indy through the hole in the roof. He stands to face them as Rough Rider points a gun in his direction. Roscoe makes a grab for the Cross -- but Indy doesn't let go. A tug-of-war ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Roscoe screams bloody murder -- releases his grip on the Cross and tries to shake off the snake. He leaps onto the next car. Indy swings down to the caboose. He glances back at the men and quickly opens the door to the caboose, stepping inside, which contains the circus magic equipment. Indy rushes to the rear door of the caboose but can't open it. He hears Fedora coming and dives into a magic box. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away. Fedora is mystified, frustrated, and angered. He rushes out onto the balcony and sees Indy running along the tracks, turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The pair grapple, rolling from flank to flank, coming dangerously close to rolling right off the brink. Situations become even more grave when Roscoe draws a dagger. Ultimately, he elevates his head and drives his horn through the ceiling. As the horn crashes through the timber only inches from Indy's head, Indy and Roscoe gaze at the horn in wonder as they continue to contend. Smash! The horn arises again -- right. Indy kicks Roscoe away. Roscoe rolls to the brink of the carriage but avoids falling. Indy flips over onto his abdomen. The wooden hatch explodes as a projectile is fired from within. The hatch is pushed open and Halfbreed and Rough Rider rush out of the wagon. Indy rises to his feet -- looks forward -- sees a water reservoir alongside the path directly up ahead. In a flash, he computes his approach -- measures the span -- and leaps for the reservoir's water spout. He grasps it flawlessly, but his speed causes the water spout to spin a full 360 degrees. With Indy clutching on, feet kicking, the water spout deposits him back on the train, onto the roofing of a stockcar, where he looks up to see Fedora striding toward him. As Indy edges away from Fedora, a section of the stockcar's roofing gives way and Indy falls through into the vehicle below. Indy crashes down from overhead. Dust ascends. The men, including Roscoe, pull Indy through the gap in the roofing. He stands to confront them as Rough Rider aims a firearm in his direction. Roscoe makes a grab for the Cross -- but Indy doesn't release. A tug-of-war occurs until a serpent wiggles out from Indy's shirtsleeve and coils around Roscoe's hand. Roscoe screams bloody murder -- relinquishes his grip on the Cross and attempts to shake off the serpent. He leaps onto the subsequent carriage. Indy swings down to the caboose. He glances back at the men and swiftly opens the door to the caboose, stepping inside, which contains the circus illusion equipment. Indy dashes to the rear door of the caboose but can't open it. He hears Fedora coming and dives into an illusion box. Fedora smirks confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away. Fedora is perplexed, frustrated, and enraged. He rushes out onto the balcony and observes Indy sprinting along the tracks, turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The two are being struggled by them, rolling from side to side, coming perilously close to being rolled right off the edge. Things are made even more serious when a knife is pulled by Roscoe. Finally, his head is raised by him, and the roof is thrust through by his horn. As the horn is smashed through the wood only inches from Indy's head, the horn is stared at in amazement by Indy and Roscoe as the struggle is continued by them. Smash! The horn is brought up again -- right. Roscoe is kicked away by Indy. Roscoe is rolled to the edge of the car but keeps from falling. Indy flips over onto his stomach. The wooden trap door explodes as it fires a bullet from within. Halfbreed and Rough Rider push the door open and hurry out of the car. Indy gets to his feet -- looks ahead -- sees a water tank alongside the track directly up ahead. In an instant, his approach is calculated -- the distance is timed -- and the tank's water spout is leapt for by him. It is caught perfectly by him, but his velocity causes the water spout to rotate a full 360 degrees. With Indy hanging on, feet kicking, he is deposited back on the train by the water spout, onto the roof of a stockcar, where Fedora is seen walking toward him by him. As Fedora is edged away from by Indy, a portion of the stockcar's roof is collapsed, and the car below is fallen into by Indy. Indy is crashed down from above. Dust rises. Indy is pulled through the hole in the roof by the men, including Roscoe. He stands to face them as a gun is pointed in his direction by Rough Rider. A grab for the Cross is made by Roscoe -- but the Cross isn't let go by Indy. A tug-of-war ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Bloody murder is screamed by Roscoe -- his grip on the Cross is released and the snake is tried to be shaken off. The next car is leapt onto by him. The caboose is swung down to by Indy. The men are glanced back at by him and the door to the caboose is quickly opened, stepping inside, which contains the circus magic equipment. The rear door of the caboose is rushed to by Indy but can't be opened by him. Fedora is heard coming and a dive into a magic box is made by him. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away. Fedora is mystified, frustrated, and angered. Indy is seen running along the tracks turning up a street of modest clapboard houses as he rushes out onto the balcony. The front door is burst through by Indy holding the Cross in his hand. A husky barks as he is run past in search of his father. Indy charges in."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The two struggle, rolling dangerously close to the edge. Roscoe pulls a knife, intensifying the fight. He thrusts his horn through the roof, narrowly missing Indy. Both stare at the horn in shock while battling. Indy kicks Roscoe, who rolls to the car's edge but doesn't fall. Indy flips over as a bullet shatters the wooden trap door. Halfbreed and Rough Rider emerge. Indy stands, spots a water tank ahead, and leaps for the spout, which spins 360 degrees. He lands back on the train, facing Fedora. As Indigo backs away, he falls through the stockcar's collapsing roof. Dust rises as men, including Roscoe, pull him up. Rough Rider aims a gun at Indy. Roscoe grabs for the Cross, but a snake from Indy's sleeve wraps around Roscoe's hand, causing him to release the Cross and jump to another car. Indy swings to the caboose, enters it, and finds circus magic equipment. Unable to open the rear door, he dives into a magic box. Fedora approaches, but the box collapses, confounding him. He rushes outside and sees Indy running along the tracks, disappearing into a street of humble houses. Indy bursts through a front door, holding the Cross, and runs past a barking dog, seeking his father."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Roscoe and Indy struggle, nearly rolling off the edge. Roscoe pulls a knife and thrusts his horn through the roof near Indy's head. They stare in shock. Indy kicks Roscoe, who rolls but avoids falling. Indy dodges a bullet as Halfbreed and Rough Rider emerge. Indy leaps for a water tank spout, swings around, and lands back on the train to face Fedora. Indy falls through the roof, and Roscoe grabs the Cross. A snake from Indy's sleeve causes Roscoe to release it. Indy moves to the caboose, steps inside, enters a magic box as Fedora approaches, and the box collapses. Frustrated, Fedora watches Indy run with the Cross, entering a street of houses in search of his father."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a tense and relentless struggle, the two adversaries grapple fiercely, rolling from one side to the other. Their intense tussle brings them alarmingly close to the precarious edge, threatening to tip them over at any moment. The situation escalates in severity when Roscoe, in a moment of desperation, draws a knife. In a dramatic turn, he lifts his head and drives his sharp horn through the roof above them. The horn crashes through the wooden structure mere inches away from Indy's head. As wood splinters and debris scatter around them, both Indy and Roscoe gaze in stunned amazement at the horn protruding from the roof, all the while continuing their fierce struggle. Suddenly, with a loud smash, the horn ascends again—this time swinging right. Taking advantage of the moment, Indy delivers a swift kick, propelling Roscoe toward the car's edge. Roscoe rolls close to falling off but skillfully manages to stop himself just in time. Indy flips over onto his stomach, and at that precise moment, the wooden trap door bursts apart as a bullet pierces through from within the car. The broken door is then thrust open as Halfbreed and Rough Rider emerge hastily from the car.\n\nIndy quickly scrambles to his feet, glancing forward with urgency. In the distance, he spots a looming water tank positioned directly alongside the track. In a split second, he gauges his timing and distance before making a daring leap toward the tank's water spout. He catches hold of it flawlessly, but his quick velocity causes the water spout to swing around a full 360 degrees. With Indy desperately clinging on, legs flailing wildly, the water spout completes its rotation and deposits him back onto the moving train, right onto the roof of a stockcar. As he lands, Indy looks up, only to see Fedora confidently approaching. As Indy cautiously backs away from Fedora, a section of the stockcar's roof gives way, collapsing beneath him, sending Indy crashing into the car below.\n\nAs he crashes down from above, a cloud of dust rises into the air. The men inside, including Roscoe, quickly seize Indy and pull him through the gaping hole in the roof. Standing to face them, Indy finds himself at gunpoint as Rough Rider aims his weapon menacingly in his direction. Roscoe attempts to seize the Cross from Indy, but Indy refuses to relinquish his hold. A tense tug-of-war ensues until, unexpectedly, a snake slithers out from Indy's shirtsleeve. The snake entwines itself around Roscoe's hand. Roscoe lets out a piercing scream of terror, and in a panic, he releases his grip on the Cross, frantically trying to shake off the snake. He promptly springs onto the adjacent car.\n\nMeanwhile, Indy swings down swiftly to the caboose. Casting a quick glance back at the pursuing men, he rapidly opens the caboose door and steps inside. The space is filled with an array of circus magic equipment. Indy makes a dash for the rear door of the caboose but finds it stubbornly locked. Hearing Fedora's approach, he dives into a nearby magic box for cover. Fedora, wearing a smug smile, confidently advances toward the box. In an unexpected twist, the magic box abruptly collapses; its four sides flop outward, leaving nothing but air behind. Fedora is left baffled, his frustration evident, as he rushes out onto the balcony. There, he spots Indy making a swift escape along the tracks before veering onto a street lined with quaint, modest clapboard houses. Indy charges through the front door, clutching the Cross tightly in his hand. As he races past, a husky barks energetically, adding to the cacophony, as Indy searches frantically for his father. Indy charges onward with determination."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a scene filled with tension and relentless struggle, the two adversaries find themselves locked in a fierce and intense grappling match, rolling back and forth, from one side to the other. Their intense tussle becomes all the more alarming as it brings them dangerously close to the precarious edge, threatening to tip them over at any moment, increasing the peril of the situation. The severity of the confrontation escalates dramatically when, in a moment of desperate determination, Roscoe draws a knife. In a dramatic and unexpected turn of events, he lifts his head and drives his sharp, menacing horn through the wooden roof above them. The horn crashes through with terrifying force, mere inches away from Indy's head. As splinters of wood and scattered debris fall around them, both Indy and Roscoe find themselves gazing in stunned amazement at the horn now protruding ominously from the roof, even as they continue their fierce struggle. Suddenly, with a loud and resounding smash, the horn ascends once more, this time swinging to the right. Seizing the opportunity presented by this brief moment, Indy delivers a swift and well-aimed kick, propelling Roscoe towards the edge of the car. Roscoe rolls dangerously close to falling off but skillfully manages to stop himself just in time. Indy flips over onto his stomach, and at that precise moment, the wooden trap door bursts apart as a bullet pierces through from within the car. The broken door is then thrust open as Halfbreed and Rough Rider emerge hastily and assertively from the car.\n\nIndy quickly scrambles to his feet, glancing forward with a sense of urgency. In the distance, he spots a looming water tank positioned directly alongside the track, adding a new element of danger to the already perilous situation. In a split second, he expertly gauges his timing and distance before making a daring and bold leap toward the tank’s water spout. He catches hold of it flawlessly, but his quick velocity causes the water spout to swing around in a full 360-degree arc. With Indy desperately clinging on, his legs flailing wildly in the air, the water spout completes its rotation and deposits him back onto the moving train, right onto the roof of a stockcar. As he lands, Indy looks up, only to see Fedora confidently approaching. As Indy cautiously backs away from Fedora, a section of the stockcar’s roof gives way, collapsing beneath him, and sending Indy crashing into the car below.\n\nAs he crashes down from above, a cloud of dust billows up into the air. The men inside, including Roscoe, quickly seize Indy and pull him through the gaping hole in the roof. Standing face-to-face with his adversaries, Indy finds himself at gunpoint with Rough Rider aiming his weapon menacingly in his direction. Roscoe attempts to seize the Cross from Indy, but Indy stubbornly refuses to relinquish his hold on the precious artifact. A tense and dramatic tug-of-war ensues until, unexpectedly, a snake slithers out from Indy's shirtsleeve. The snake entwines itself around Roscoe's hand, causing him to let out a piercing scream of terror. In a panicked frenzy, he releases his grip on the Cross, desperately trying to shake off the snake. He promptly, and frantically, springs onto the adjacent car.\n\nMeanwhile, Indy swings down swiftly to the caboose. Casting a quick glance back at the pursuing men, he rapidly opens the caboose door and steps inside. He finds the space filled with an array of circus magic equipment, creating an unexpected backdrop. Indy makes a desperate dash for the rear door of the caboose, only to find it stubbornly locked. Hearing Fedora's imminent approach, Indy dives into a nearby magic box for cover. With a smug and confident smile, Fedora advances towards the box. In an unexpected twist, the magic box suddenly collapses; its four sides flop outward, leaving nothing but empty air behind. Fedora is left baffled, his frustration and confusion clear, as he rushes out onto the balcony. There, he spots Indy making a swift and daring escape along the tracks before veering onto a street lined with quaint, modest clapboard houses. Indy charges through the front door, clutching the Cross tightly in his hand. As he races past, a husky barks energetically, adding to the cacophony, as Indy searches frantically and desperately for his father. Indy charges onward with unwavering determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the struggle unfolds, Roscoe and Indy are locked in a fierce battle, their bodies rolling from side to side with increasing intensity, each movement bringing them dangerously closer to the brink of tumbling off the edge. The situation escalates to a new level of danger when Roscoe suddenly draws a knife, the glint of the blade adding a new layer of peril to their confrontation. In a moment of desperation and quick thinking, Roscoe raises his head with determination and thrusts his horn upwards, piercing it through the roof above. The horn smashes through the wooden structure, landing mere inches from Indy's head, causing both of them to pause momentarily and stare in amazement at the protruding horn, all while their struggle continues unabated. With a resounding smash, the horn reappears, and Indy seizes the opportunity to kick Roscoe away with a well-aimed strike, sending Roscoe rolling perilously close to the edge of the car, though he manages to prevent himself from falling. Indy, seizing the moment to regain the upper hand, flips over onto his stomach just as the wooden trap door on the train car explodes into splinters, shattered by a bullet fired from within. The door is then forced open, and Halfbreed and Rough Rider scramble hurriedly out of the car, seeking to join the fray. Indy quickly rises to his feet, his mind racing as he looks ahead, spotting a looming water tank alongside the track directly in his path. With lightning-fast calculations, he times his approach, narrows the distance, and makes a daring leap for the water tank's spout. His leap is perfectly executed, and he manages to catch the spout, but the momentum of his jump causes the spout to rotate in a full 360-degree arc. As Indy hangs on, his feet kicking in the air, the rotating spout returns him to his original point on the train, depositing him back onto the roof of a stockcar. No sooner does he land than he glances up to see Fedora, approaching with a deliberate and menacing stride. Indy, sensing the threat, begins edging away from Fedora, but the aged and fragile roof of the stockcar cannot support his weight and gives way beneath him. Indy plummets through the collapsing structure into the car below, crashing down amidst a cloud of dust that rises around him. As the dust settles, the men, including the persistent Roscoe, haul Indy back up through the hole he has fallen through, bringing him face to face with them. As he regains his bearings, Rough Rider levels his gun at Indy, intent on maintaining control of the situation. Meanwhile, Roscoe attempts to seize the opportunity by grabbing for the Cross in Indy's possession, but Indy is tenacious and refuses to relinquish his grip, leading to a fierce tug-of-war between the two. In an unexpected twist, a snake wriggles out from Indy's shirtsleeve, slithering around Roscoe's hand. The sight of the snake sends Roscoe into a panic, and he screams in terror, releasing his hold on the Cross in an attempt to rid himself of the serpent. In his panic, Roscoe leaps onto the next car, while Indy swings down to the caboose in a swift, acrobatic motion. He glances back quickly to assess the situation with the men and swiftly opens the door to the caboose, stepping inside its cramped interior filled with circus magic equipment. Indy makes a beeline for the rear door of the caboose, his mind set on escape, but finds himself thwarted as the door refuses to budge. Realizing he is running out of time as Fedora closes in, Indy makes a split-second decision to dive into a magic box as a temporary hiding place. Fedora approaches the box with a confident smile, convinced he has cornered Indy, only to watch in disbelief as the box collapses unexpectedly, its sides falling away in all directions. Mystic, frustrated, and seething with anger, Fedora rushes out onto the balcony of the caboose, only to witness Indy sprinting away along the tracks and turning onto a street lined with modest clapboard houses. Indy, driven by urgency, bursts through a front door with the Cross clutched firmly in his hand, his mind focused on finding his father. He races past a barking husky, which adds to the cacophony, as he charges decisively inward, determined to locate his father amidst the unfolding chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy and Roscoe engage in a fierce struggle, dangerously close to the edge of the train. The situation escalates when Roscoe brandishes a knife, but the fight is interrupted as Indy's horn pierces through the roof, narrowly missing them both. Amidst the chaos, Indy kicks Roscoe away, who nearly falls off but manages to stay on the train. Indy quickly flips onto his stomach as bullets explode through a trap door, from which Halfbreed and Rough Rider emerge. Seizing an opportunity, Indy leaps for a water tank’s spout alongside the track, skillfully using its momentum to land back on the train roof, only to confront Fedora. As Indy backs away, the roof collapses, dropping him into the car below. There, Roscoe and the others haul him through the hole as Rough Rider points a gun at him. Indy fiercely holds onto the Cross during a tug-of-war with Roscoe until a snake slithers from his sleeve, forcing Roscoe to release the Cross and leap to another car. Indy quickly swings to the caboose, stepping into a compartment filled with circus equipment. Realizing he’s cornered, he dives into a magic box just as Fedora arrives. As Fedora approaches, the box dramatically collapses, leaving him bewildered. Indy seizes the chance, dashing out and sprinting along the tracks, past modest houses, until he bursts through a front door, clutching the Cross as a dog barks and he searches for his father."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The two struggle, rolling from side to side, coming perilously close to rolling right off the edge of the speeding train that was racing through the desert. Things get even more serious when Roscoe pulls a knife, a weapon he picked up during his days in the rough neighborhoods of New York City. Finally, he raises his head and thrusts his horn, a prized heirloom from his grandfather's adventures, through the roof. As the horn smashes through the wood only inches from Indy's head, Indy, an intrepid young adventurer inspired by tales of explorers, and Roscoe stare at the horn in amazement as they continue to struggle. Smash! The horn comes up again -- right as the train hits a bend. Indy kicks Roscoe away. Roscoe rolls to the edge of the car but keeps from falling into the dusty expanse below. Indy flips over onto his stomach. The wooden trap door explodes as a bullet, fired from an old Colt revolver, shatters the tension from within. The door is pushed open and Halfbreed, a notorious outlaw, and Rough Rider, a former cavalryman, hurry out of the car, weapons drawn. Indy gets to his feet -- looks ahead -- sees a water tank alongside the track directly up ahead, a relic from the era of steam locomotives. In an instant, he calculates his approach -- times the distance -- and leaps for the tank's water spout, an action requiring precise timing and strength. He catches it perfectly, but his velocity causes the water spout, rusted from years of weather exposure, to rotate a full 360 degrees. With Indy hanging on, feet kicking, the water spout deposits him back on the train, onto the roof of a stockcar, where he looks up to see Fedora, a rival treasure hunter notorious for his cunning, walking toward him. As Indy edges away from Fedora, a portion of the stockcar's roof collapses under his weight, and Indy falls through into the car below, filled with hay and livestock. Indy crashes down from above. Dust rises from the hay scattered around him. The men, including Roscoe, pull Indy through the hole in the roof. He stands to face them as Rough Rider points a gun, tarnished with use, in his direction. Roscoe makes a grab for the Cross, an ancient artifact said to bring great fortune, but Indy doesn't let go. A tug-of-war ensues until a snake, a creature Indy despises due to a childhood encounter, wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Roscoe screams bloody murder -- releases his grip on the Cross and tries to shake off the snake. He leaps onto the next car with a desperate agility. Indy swings down to the caboose, the last car in the train known for its historical role in train operations. He glances back at the men and quickly opens the door to the caboose, stepping inside, which contains the circus magic equipment, remnants of a traveling magic show. Indy rushes to the rear door of the caboose but can't open it because it is jammed. He hears Fedora coming and dives into a magic box used for illusion tricks. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away as if part of an elaborate trick. Fedora is mystified, frustrated, and angered. He rushes out onto the balcony and sees Indy running along the tracks, turning up a street of modest clapboard houses that reflect the architecture of the early 20th century. Indy bursts through the front door holding the Cross in his hand. A husky, resembling the breed often used by sled teams, barks as Indy runs past in search of his father, a scholar known for his obsession with historical artifacts. Indy charges in, determined and breathless."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Dust rises The two struggle rolling from side to side coming perilously close to rolling right off the edge Indy crashes down from above Things get even more serious when Roscoe pulls a knife Finally he raises his head and thrusts his horn through the roof As the horn smashes through the wood only inches from Indy's head Indy and Roscoe stare at the horn in amazement as they continue to struggle Smash The horn comes up again  right Indy kicks Roscoe away The two struggle rolling from side to side coming perilously close to rolling right off the edge Roscoe rolls to the edge of the car but keeps from falling Indy flips over onto his stomach The wooden trap door explodes as a bullet is fired from within He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees The door is pushed open and Halfbreed and Rough Rider hurry out of the car Roscoe makes a grab for the Cross  but Indy does not let go Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead In an instant he calculates his approach  times the distance  and leaps for the tank's water spout Finally he raises his head and thrusts his horn through the roof He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees Indy charges in With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below Indy crashes down from above Dust rises The men including Roscoe pull Indy through the hole in the roof He stands to face them as Rough Rider points a gun in his direction The horn comes up again  right Roscoe makes a grab for the Cross  but Indy does not let go A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake As the horn smashes through the wood only inches from Indy's head The box unexpectedly collapses He leaps onto the next car Indy swings down to the caboose He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment Indy rushes to the rear door of the caboose but cannot open it He hears Fedora coming and dives into a magic box Fedora smiles confidently and advances toward the box The box unexpectedly collapses all four sides flop away Indy bursts through the front door holding the Cross in his hand Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake Indy kicks Roscoe away Fedora is mystified frustrated and angered Indy swings down to the caboose With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses Indy bursts through the front door holding the Cross in his hand A husky barks as Indy runs past in search of his father Indy charges in In an instant he calculates his approach  times the distance  and leaps for the tank's water spout Roscoe rolls to the edge of the car but keeps from falling Things get even more serious when Roscoe pulls a knife A husky barks as Indy runs past in search of his father"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The two struggle rolling from side to side coming perilously close to rolling right off the edge. Things get even more serious when Roscoe pulls a knife. Finally he raises his head and thrusts his horn through the roof. As the horn smashes through the wood only inches from Indy's head. Indy and Roscoe stare at the horn in amazement as they continue to struggle. Smash. The horn comes up again  right. Indy kicks Roscoe away. Roscoe rolls to the edge of the car but keeps from falling. Indy flips over onto his stomach. The wooden trap door explodes as a bullet is fired from within. The door is pushed open and Halfbreed and Rough Rider hurry out of the car. Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead. In an instant he calculates his approach  times the distance  and leaps for the tank's water spout. He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees. With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him. As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below. Indy crashes down from above. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Dust rises. The men including Roscoe pull Indy through the hole in the roof. He stands to face them as Rough Rider points a gun in his direction. Roscoe makes a grab for the Cross  but Indy does not let go. A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake. He leaps onto the next car. Indy swings down to the caboose. He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment. Indy rushes to the rear door of the caboose but cannot open it. He hears Fedora coming and dives into a magic box. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses. all four sides flop away. Fedora is mystified frustrated and angered. He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The two struggle rolling from side to side coming perilously close to rolling right off the edge. Things get even more serious when Roscoe pulls a knife. Finally he raises his head and thrusts his horn through the roof. As the horn smashes through the wood only inches from Indy's head. Indy and Roscoe stare at the horn in amazement as they continue to struggle. Smash. The horn comes up again  right. Indy kicks Roscoe away. Roscoe rolls to the edge of the car but keeps from falling. Indy flips over onto his stomach. The wooden trap door explodes as a bullet is fired from within. The door is pushed open and Halfbreed and Rough Rider hurry out of the car. Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead. In an instant he calculates his approach  times the distance  and leaps for the tank's water spout. He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees. With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him. As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below. Indy crashes down from above. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Dust rises. The men including Roscoe pull Indy through the hole in the roof. He stands to face them as Rough Rider points a gun in his direction. Roscoe makes a grab for the Cross  but Indy does not let go. A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake. He leaps onto the next car. Indy swings down to the caboose. He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment. Indy rushes to the rear door of the caboose but cannot open it. He hears Fedora coming and dives into a magic box. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses. all four sides flop away. Fedora is mystified frustrated and angered. He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The two struggle rolling from side to side coming perilously close to rolling right off the edge. Things get even more serious when Roscoe pulls a knife. Finally he raises his head and thrusts his horn through the roof. As the horn smashes through the wood only inches from Indy's head. Indy and Roscoe stare at the horn in amazement as they continue to struggle. Smash. The horn comes up again  right. Indy kicks Roscoe away. Roscoe rolls to the edge of the car but keeps from falling. Indy rushes to the rear door of the caboose but cannot open it. He hears Fedora coming and dives into a magic box. Fedora smiles confidently and advances toward the box. The box unexpectedly collapses. all four sides flop away. Fedora is mystified frustrated and angered. He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The two struggle rolling from side to side coming perilously close to rolling right off the edge. Things get even more serious when Roscoe pulls a knife. Finally he raises his head and thrusts his horn through the roof. As the horn smashes through the wood only inches from Indy's head. He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses. Indy bursts through the front door holding the Cross in his hand. A husky barks as Indy runs past in search of his father. Indy charges in."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The two struggle, rolling from side to side, coming perilously close to rolling right off the edge. Things get even more serious when the squirrel pulls a knife. Finally, it raises its head and thrusts its horn through the roof. As the horn smashes through the wood only inches from the tiger's head, the tiger and the squirrel stare at the horn in amazement as they continue to struggle. Smash! The horn comes up again -- right. The tiger kicks the squirrel away. The squirrel rolls to the edge of the car but keeps from falling. The tiger flips over onto its stomach. The wooden trap door explodes as a bullet is fired from within. The door is pushed open and the giraffe and the kangaroo hurry out of the car. The tiger gets to its feet -- looks ahead -- sees a water tank alongside the track directly up ahead. In an instant, it calculates its approach -- times the distance -- and leaps for the tank's water spout. It catches it perfectly, but its velocity causes the water spout to rotate a full 360 degrees. With the tiger hanging on, feet kicking, the water spout deposits it back on the train, onto the roof of a stockcar, where it looks up to see the penguin walking toward it. As the tiger edges away from the penguin, a portion of the stockcar's roof collapses and the tiger falls through into the car below. The tiger crashes down from above. Dust rises. The men, including the squirrel, pull the tiger through the hole in the roof. It stands to face them as the kangaroo points a gun in its direction. The squirrel makes a grab for the Cross -- but the tiger doesn't let go. A tug-of-war ensues until a snake wiggles out from the tiger's shirtsleeve and wraps around the squirrel's hand. The squirrel screams bloody murder -- releases its grip on the Cross and tries to shake off the snake. It leaps onto the next car. The tiger swings down to the caboose. It glances back at the men and quickly opens the door to the caboose, stepping inside, which contains the circus magic equipment. The tiger rushes to the rear door of the caboose but can't open it. It hears the penguin coming and dives into a magic box. The penguin smiles confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away. The penguin is mystified, frustrated, and angered. It rushes out onto the balcony and sees the tiger running along the tracks, turning up a street of modest clapboard houses. The tiger bursts through the front door holding the Cross in its hand. A husky barks as the tiger runs past in search of its father. The tiger charges in."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The two struggle, rolling from side to side, coming perilously close to rolling right off the platform. Things get even more serious when Roscoe pulls a spoon. Finally, he raises his head and thrusts his umbrella through the ceiling. As the umbrella smashes through the marble only inches from Indy's head, Indy and Roscoe stare at the umbrella in amazement as they continue to struggle. Smash! The umbrella comes up again -- right. Indy kicks Roscoe away. Roscoe rolls to the edge of the ship but keeps from falling. Indy flips over onto his stomach. The glass trap door explodes as a firecracker is fired from within. The door is pushed open and Halfbreed and Rough Rider hurry out of the cabin. Indy gets to his feet -- looks ahead -- sees a windmill alongside the path directly up ahead. In an instant, he calculates his approach -- times the distance -- and leaps for the mill's vane. He catches it perfectly, but his velocity causes the vane to rotate a full 360 degrees. With Indy hanging on, feet kicking, the vane deposits him back on the sailboat, onto the roof of a shed, where he looks up to see Fedora walking toward him. As Indy edges away from Fedora, a portion of the shed's roof collapses and Indy falls through into the room below. Indy crashes down from above. Sand rises. The men, including Roscoe, pull Indy through the hole in the roof. He stands to face them as Rough Rider points a stick in his direction. Roscoe makes a grab for the Trophy -- but Indy doesn't let go. A tug-of-war ensues until a lizard wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand. Roscoe screams bloody murder -- releases his grip on the Trophy and tries to shake off the lizard. He leaps onto the next cabin. Indy swings down to the wharf. He glances back at the men and quickly opens the door to the wharf, stepping inside, which contains the carnival magic equipment. Indy rushes to the rear door of the wharf but can't open it. He hears Fedora coming and dives into a magic trunk. Fedora smiles confidently and advances toward the trunk. The trunk unexpectedly collapses; all four sides flop away. Fedora is mystified, frustrated, and angered. He rushes out onto the pier and sees Indy running along the path, turning up a street of modest brick houses. Indy bursts through the front gate holding the Trophy in his hand. A parrot squawks as Indy runs past in search of his father. Indy charges in."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The two dance, spinning from side to side, coming perilously close to spinning right off the edge. Things get even more dramatic when Roscoe waves a flag. Finally, he tilts his head and swings his horn through the roof. As the horn slices through the wood only inches from Indy's head, Indy and Roscoe gaze at the horn in disbelief as they continue to dance. Smash! The horn comes up again -- left. Indy nudges Roscoe away. Roscoe slides to the edge of the car but keeps from slipping. Indy flips over onto his back. The wooden trap door bursts as a feather is tossed from within. The door is nudged open and Halfbreed and Rough Rider stroll out of the car. Indy gets to his knees -- looks ahead -- sees a water tank alongside the track directly up ahead. In an instant, he calculates his strategy -- measures the distance -- and swings for the tank's water spout. He grabs it perfectly, but his momentum causes the water spout to rotate a full 360 degrees. With Indy clinging on, feet kicking, the water spout drops him back on the train, onto the roof of a stockcar, where he looks up to see Fedora dancing toward him. As Indy shuffles away from Fedora, a portion of the stockcar's roof gives way and Indy tumbles through into the car below. Indy floats down from above. Dust settles. The men, including Roscoe, lift Indy through the hole in the roof. He stands to greet them as Rough Rider throws a baton in his direction. Roscoe makes a dash for the Cross -- but Indy doesn't let go. A tug-of-war breaks out until a frog hops out from Indy's shirtsleeve and perches on Roscoe's hand. Roscoe shrieks loudly -- releases his grip on the Cross and attempts to flick off the frog. He skips onto the next car. Indy swings down to the caboose. He peeks back at the men and quickly shuts the door to the caboose, stepping inside, which displays the circus magic equipment. Indy rushes to the rear door of the caboose but can't budge it. He hears Fedora approaching and dives into a magic box. Fedora grins confidently and steps toward the box. The box unexpectedly collapses; all four sides topple away. Fedora is baffled, irritated, and enraged. He dashes out onto the balcony and sees Indy strolling along the tracks, turning up a street of modest clapboard houses. Indy bursts through the front door clutching the Cross in his hand. A husky yaps as Indy dashes past in search of his father. Indy charges in."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giraffes struggle, rolling from street to street, coming perilously close to rolling right off the cactus. Things get even more serious when the bicycle pulls a spoon. Finally, it raises its wheel and thrusts its balloon through the fence. As the balloon smashes through the chocolate only inches from the cat's whisker, the cat and the bicycle stare at the balloon in amazement as they continue to struggle. Smash! The balloon comes up again -- right. The cat kicks the bicycle away. The bicycle rolls to the edge of the boat but keeps from falling. The cat flips over onto its shell. The glass trap door explodes as a banana is fired from within. The door is pushed open and the penguin and the kangaroo hurry out of the boat. The cat gets to its feet -- looks ahead -- sees a lemon tree alongside the river directly up ahead. In an instant, it calculates its approach -- times the distance -- and leaps for the tree's lemon branch. It catches it perfectly, but its velocity causes the lemon branch to rotate a full 360 degrees. With the cat hanging on, tail waving, the lemon branch deposits it back on the ship, onto the roof of a teapot, where it looks up to see the spoon walking toward it. As the cat edges away from the spoon, a portion of the teapot's roof collapses and the cat falls through into the kettle below. The cat crashes down from above. Smoke rises. The animals, including the bicycle, pull the cat through the hole in the roof. It stands to face them as the kangaroo points a carrot in its direction. The bicycle makes a grab for the pencil -- but the cat doesn't let go. A tug-of-war ensues until a fish wiggles out from the cat's shirtsleeve and wraps around the bicycle's handle. The bicycle screams bloody murder -- releases its grip on the pencil and tries to shake off the fish. It leaps onto the next kettle. The cat swings down to the suitcase. It glances back at the animals and quickly opens the door to the suitcase, stepping inside, which contains the circus music equipment. The cat rushes to the rear door of the suitcase but can't open it. It hears the spoon coming and dives into a music box. The spoon smiles confidently and advances toward the box. The box unexpectedly collapses; all four sides flop away. The spoon is mystified, frustrated, and angered. It rushes out onto the balcony and sees the cat running along the branches, turning up a street of modest brick walls. The cat bursts through the front window holding the pencil in its claw. A panda barks as the cat runs past in search of its mother. The cat charges in."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The two tumble, flipping from angle to angle, nearing dangerously close to tumbling right off the edge. Things escalate further when Jasper swings a rope. Ultimately, he tilts his arm and jabs his beak through the ceiling. As the beak pierces through the metal only inches from Max's face, Max and Jasper gaze at the beak in wonder as they continue to tumble. Crash! The beak emerges again -- upright. Max nudges Jasper away. Jasper slides to the edge of the cart but avoids falling. Max twists over onto his back. The metal hatch bursts open as a flare is shot from within. The hatch is nudged open and Bandit and Maverick speed out of the cart. Max rises to his knees -- glances forward -- notices a bridge alongside the track directly ahead. In a flash, he computes his jump -- measures the gap -- and springs for the bridge's railing. He grips it flawlessly, but his momentum causes the railing to spin a full 360 degrees. With Max clinging on, legs flailing, the railing places him back on the train, onto the top of a livestock car, where he glimpses Fedora strolling toward him. As Max inches away from Fedora, a section of the livestock car's ceiling gives way and Max plunges through into the car below. Max tumbles down from above. Dust swirls. The group, including Jasper, haul Max through the opening in the ceiling. He rises to confront them as Maverick aims a flare gun in his direction. Jasper lunges for the Compass -- but Max holds firm. A tug-of-war unfolds until a lizard slithers out from Max's pocket and coils around Jasper's wrist. Jasper shrieks in terror -- releases his grip on the Compass and attempts to fling off the lizard. He bounds onto the adjacent cart. Max swings down to the caboose. He peers back at the group and swiftly unseals the door to the caboose, stepping inside, which contains the carnival illusion equipment. Max dashes to the rear door of the caboose but finds it stuck. He detects Fedora nearing and jumps into an illusion crate. Fedora beams confidently and moves toward the crate. The crate suddenly crumples; all four panels fall apart. Fedora is bewildered, irritated, and incensed. He storms out onto the veranda and observes Max sprinting along the tracks, veering up a lane of quaint wooden houses. Max crashes through the front entrance clutching the Compass in his hand. A beagle yips as Max dashes past in pursuit of his brother. Max bolts inside."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The two wobble, tumbling from corner to corner, coming alarmingly close to tumbling right off the cliff. Things become even more critical when Roscoe brandishes a spoon. Eventually, he lowers his gaze and pokes his antenna through the canopy. As the antenna punches through the fabric only inches from Indy's ear, Indy and Roscoe gawk at the antenna in disbelief as they continue to wobble. Thud! The antenna emerges again -- left. Indy shoves Roscoe aside. Roscoe tumbles to the brink of the boat but avoids diving. Indy spins over onto his back. The wooden porthole implodes as a spear is hurled from inside. The porthole is shoved ajar and Halfbreed and Rough Rider rush out of the boat. Indy rises to his knees -- looks forward -- sees a lighthouse beside the pier directly ahead. In a flash, he computes his trajectory -- measures the gap -- and vaults for the lighthouse's lamp. He grasps it flawlessly, but his momentum prompts the lamp to spin a full 360 degrees. With Indy clinging on, legs flailing, the lamp deposits him back on the ship, onto the deck of a tanker, where he glances up to find Fedora strolling toward him. As Indy sidles away from Fedora, a portion of the tanker's deck crumbles and Indy plunges through into the cabin below. Indy crashes down from above. Sand rises. The sailors, including Roscoe, pull Indy through the breach in the deck. He rises to confront them as Rough Rider waves a torch in his direction. Roscoe lunges for the Amulet -- but Indy grips tightly. A tug-of-war unfolds until a lizard slithers out from Indy's boot and coils around Roscoe's wrist. Roscoe shrieks in terror -- loosens his hold on the Amulet and attempts to fling the lizard away. He bounds onto the adjoining ship. Indy swings down to the stern. He peers back at the sailors and abruptly unlatches the door to the stern, entering inside, which contains the carnival acrobat gear. Indy dashes to the rear hatch of the stern but can't pry it open. He hears Fedora nearing and dives into an acrobat barrel. Fedora grins slyly and strides toward the barrel. The barrel suddenly disintegrates; all sides topple away. Fedora is bewildered, exasperated, and enraged. He rushes out onto the plank and spots Indy dashing along the docks, weaving into a lane of quaint wooden huts. Indy barrels through the side door clutching the Amulet in his fist. A collie howls as Indy races past in quest of his father. Indy storms in."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The pair tangle, flipping from one surface to another, drawing dangerously near to flipping right past the brink. Matters become even more dramatic when Trixie draws a spoon. Ultimately, she lowers her foot and thrusts her flute through the ceiling. As the flute pokes through the metal only centimeters from Sam's foot, Sam and Trixie gawk at the flute in bewilderment as they persist in their tangle. Crack! The flute juts up once more -- left. Sam nudges Trixie aside. Trixie flips to the brink of the raft but avoids plunging. Sam twirls over onto his back. The metal hatch bursts as an arrow is shot from inside. The hatch is shoved open and Nomad and Trailblazer dash out of the raft. Sam rises to his hands -- glances outward -- spots a flagpole alongside the path directly ahead. In a flash, he computes his strategy -- gauges the gap -- and lunges for the pole's ribbon. He snags it flawlessly, but his momentum propels the ribbon to swivel a full circle. With Sam clinging on, legs flailing, the ribbon places him back on the vessel, onto the top of a ship, where he gazes upward to see Fedora striding toward him. As Sam creeps away from Fedora, a segment of the ship's top crumbles and Sam tumbles through into the vessel below. Sam plummets from above. Smoke rises. The crew, including Trixie, haul Sam through the breach in the top. He rises to confront them as Trailblazer aims a bow in his direction. Trixie attempts to snatch the Wand -- but Sam grips tightly. A battle-of-wits erupts until an eel slithers out from Sam's jacket cuff and coils around Trixie's limb. Trixie yelps in terror -- relinquishes her hold on the Wand and attempts to flick away the eel. She hops onto the adjacent vessel. Sam swings down to the stern. He peers back at the crew and swiftly unlatches the entrance to the stern, slipping inward, which is filled with the fair's illusion props. Sam darts to the end door of the stern but can't unlatch it. He perceives Fedora nearing and dives into an illusion crate. Fedora grins assuredly and strides toward the crate. The crate unceremoniously collapses; all four flaps fold away. Fedora is perplexed, vexed, and incensed. He charges out to the terrace and observes Sam sprinting along the pathways, veering up an avenue of humble wooden cabins. Sam busts through the back gate clutching the Wand in his limb. A tabby meows as Sam dashes by in quest of his uncle. Sam bolts in."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy and Roscoe grapple on the train roof, nearly falling off. Tension escalates when Roscoe draws a knife. Indy uses a horn to fend him off, but they continue struggling until the roof collapses. Indy briefly evades capture by swinging onto a water spout but returns to the train, facing Fedora. He falls into a car below, where Roscoe and others trap him. During a tug-of-war over the Cross, a snake from Indy's sleeve scares Roscoe away. Indy escapes to the caboose, jumps into a magic box, and evades Fedora's pursuit. Emerging from the box, Indy runs away, holding the Cross, and finds himself on a street of modest houses, searching for his father."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Indy charges in A husky barks as Indy runs past in search of his father Indy bursts through the front door holding the Cross in his hand He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses Fedora is mystified frustrated and angered all four sides flop away The box unexpectedly collapses Fedora smiles confidently and advances toward the box He hears Fedora coming and dives into a magic box Indy rushes to the rear door of the caboose but cannot open it He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment Indy swings down to the caboose He leaps onto the next car Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand Roscoe makes a grab for the Cross  but Indy does not let go He stands to face them as Rough Rider points a gun in his direction The men including Roscoe pull Indy through the hole in the roof Dust rises Indy crashes down from above As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees In an instant he calculates his approach  times the distance  and leaps for the tank's water spout Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead The door is pushed open and Halfbreed and Rough Rider hurry out of the car The wooden trap door explodes as a bullet is fired from within Indy flips over onto his stomach Roscoe rolls to the edge of the car but keeps from falling Indy kicks Roscoe away The horn comes up again  right Smash Indy and Roscoe stare at the horn in amazement as they continue to struggle As the horn smashes through the wood only inches from Indy's head Finally he raises his head and thrusts his horn through the roof Things get even more serious when Roscoe pulls a knife The two struggle rolling from side to side coming perilously close to rolling right off the edge"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The door is pushed open and Halfbreed and Rough Rider hurry out of the car Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake The wooden trap door explodes as a bullet is fired from within With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him all four sides flop away As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below He hears Fedora coming and dives into a magic box Fedora smiles confidently and advances toward the box Smash Indy crashes down from above Roscoe makes a grab for the Cross  but Indy does not let go The horn comes up again  right Things get even more serious when Roscoe pulls a knife The men including Roscoe pull Indy through the hole in the roof He leaps onto the next car He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead Fedora is mystified frustrated and angered In an instant he calculates his approach  times the distance  and leaps for the tank's water spout Indy flips over onto his stomach A husky barks as Indy runs past in search of his father Roscoe rolls to the edge of the car but keeps from falling Dust rises As the horn smashes through the wood only inches from Indy's head The box unexpectedly collapses Indy swings down to the caboose Indy charges in Indy rushes to the rear door of the caboose but cannot open it Indy and Roscoe stare at the horn in amazement as they continue to struggle He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses He stands to face them as Rough Rider points a gun in his direction A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand Indy kicks Roscoe away He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment The two struggle rolling from side to side coming perilously close to rolling right off the edge Indy bursts through the front door holding the Cross in his hand Finally he raises his head and thrusts his horn through the roof"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The men including Roscoe pull Indy through the hole in the roof He stands to face them as Rough Rider points a gun in his direction Roscoe makes a grab for the Cross  but Indy does not let go A tugofwar ensues until a snake wiggles out from Indy's shirtsleeve and wraps around Roscoe's hand Roscoe screams bloody murder  releases his grip on the Cross and tries to shake off the snake He leaps onto the next car Indy swings down to the caboose He glances back at the men and quickly opens the door to the caboose stepping inside which contains the circus magic equipment Indy rushes to the rear door of the caboose but cannot open it He hears Fedora coming and dives into a magic box Fedora smiles confidently and advances toward the box The box unexpectedly collapses all four sides flop away Fedora is mystified frustrated and angered He rushes out onto the balcony and sees Indy running along the tracks turning up a street of modest clapboard houses Indy bursts through the front door holding the Cross in his hand A husky barks as Indy runs past in search of his father Indy charges in The two struggle rolling from side to side coming perilously close to rolling right off the edge Things get even more serious when Roscoe pulls a knife Finally he raises his head and thrusts his horn through the roof As the horn smashes through the wood only inches from Indy's head Indy and Roscoe stare at the horn in amazement as they continue to struggle Smash The horn comes up again  right Indy kicks Roscoe away Roscoe rolls to the edge of the car but keeps from falling Indy flips over onto his stomach The wooden trap door explodes as a bullet is fired from within The door is pushed open and Halfbreed and Rough Rider hurry out of the car Indy gets to his feet  looks ahead  sees a water tank alongside the track directly up ahead In an instant he calculates his approach  times the distance  and leaps for the tank's water spout He catches it perfectly but his velocity causes the water spout to rotate a full 360 degrees With Indy hanging on feet kicking the water spout deposits him back on the train onto the roof of a stockcar where he looks up to see Fedora walking toward him As Indy edges away from Fedora a portion of the stockcar's roof collapses and Indy falls through into the car below Indy crashes down from above Dust rises"
        }
      ]
    }
  ]
}