{
  "ground_truth": "Donovan strides across the room toward Indy, exuding confidence and power while dressed in a tuxedo, and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth, throws back the cloth revealing a flat stone tablet about two feet square, inscribed with letters and symbols, and puts on his glasses to make a closer examination. Donovan pours champagne into several fluted glasses as Indy reads. Suddenly, Indy stops and looks up at Donovan with a startled expression, then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him. Indy stiffens slightly at the mention of his father and nods. The door opens and Mrs. Donovan, a matronly woman in an expensive evening gown, steps into the room. Donovan leans over and kisses her cheek, and she sighs to herself and returns to the party. Indy, meanwhile, has turned his attention back to the Grail Tablet, obviously hooked by its archaeological promise. He moistens his finger with champagne and rubs it over the Tablet, as Donovan steps up next to him. Indy has to shake his head at Donovan’s apparent lack of judgment. Donovan produces an ancient leather-bound volume with very brittle pages, and Indy views the manuscript with considerable interest. A Ford coupe speeds down the tree-lined street and pulls up in front of the house. Indy climbs from the car and hurries up the walkway, with Brody a step behind. They climb the porch, notice that the front door is ajar, and exchange a quick look of concern as they enter. Indy approaches the half-open front door, pushes open the door, and enters the house, calling out. Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked. Brody sees Indy's face and opens the other half, and they walk into the room. Brody picks up some mail from Henry's cluttered desk, and Indy turns to see the pile of torn papers and envelopes. He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark. Indy uncovers a small book that looks like a journal or diary and flips through it, finding page after page of handwritten notes and drawings. Brody glances at it with great curiosity. As Indy asks the question, he turns to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, and a second painting showing Eleventh Century Crusaders plummeting to their deaths over a high cliff, with one Crusader floating safely in midair because he holds the Grail in his hands.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Donovan paces across the chamber toward Indy, emanating assurance and might while attired in a tuxedo, and clasps hands with Indy. Donovan proceeds to a table where an artifact is enshrouded in fabric, throws back the fabric exposing a smooth stone slab about two feet square, inscribed with letters and emblems, and puts on his spectacles to make a closer scrutiny. Donovan fills champagne into several fluted chalices as Indy peruses. Suddenly, Indy halts and gazes up at Donovan with a surprised expression, then rubs his chin with a skeptical expression as he takes the glass of champagne Donovan now gives him. Indy tenses slightly at the mention of his father and nods. The portal opens and Mrs. Donovan, a stately woman in a pricey evening gown, steps into the space. Donovan bends over and kisses her cheek, and she sighs to herself and returns to the gathering. Indy, meanwhile, has shifted his focus back to the Grail Slab, clearly fascinated by its archaeological potential. He wets his finger with champagne and rubs it over the Slab, as Donovan steps alongside him. Indy has to shake his head at Donovan’s apparent lack of discernment. Donovan produces an ancient leather-bound tome with very brittle sheets, and Indy examines the manuscript with significant interest. A Ford coupe races down the tree-lined lane and stops in front of the residence. Indy exits from the automobile and rushes up the pathway, with Brody a step behind. They ascend the porch, notice that the entryway is ajar, and exchange a swift look of unease as they enter. Indy approaches the half-open entryway, pushes open the door, and enters the residence, calling out. Indy opens one half of the drapes separating the corridor from the sitting chamber to reveal the place has been plundered. Brody observes Indy's face and opens the other half, and they stroll into the chamber. Brody picks up some correspondence from Henry's messy desk, and Indy turns to see the heap of torn documents and envelopes. He immediately empties his pockets of his own correspondence taken earlier in the day from his university office and finds the envelope with the Venice postmark. Indy discovers a small volume that resembles a diary or journal and flips through it, finding page after page of handwritten annotations and illustrations. Brody glances at it with great curiosity. As Indy poses the inquiry, he turns to a canvas on the wall depicting Christ on the Cross, his blood being collected in a golden cup, and a second canvas showing Eleventh Century Crusaders plummeting to their ends over a high precipice, with one Crusader floating safely in midair because he holds the Grail in his grasp."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Donovan strides across the room toward Indy, exuding confidence and power while dressed in a tuxedo, and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth, throws back the cloth revealing a flat stone tablet about two feet square, inscribed with letters and symbols, and puts on his glasses to make a closer examination. Several fluted glasses are filled with champagne by Donovan as Indy reads. Suddenly, Indy stops and looks up at Donovan with a startled expression, then rubs his chin with a dubious expression as the glass of champagne is now offered to him by Donovan. Indy stiffens slightly at the mention of his father and nods. The door opens and Mrs. Donovan, a matronly woman in an expensive evening gown, steps into the room. Her cheek is kissed by Donovan, and she sighs to herself and returns to the party. Indy, meanwhile, has turned his attention back to the Grail Tablet, obviously hooked by its archaeological promise. His finger is moistened with champagne, and he rubs it over the Tablet, as Donovan steps up next to him. Donovan’s apparent lack of judgment makes Indy shake his head. An ancient leather-bound volume with very brittle pages is produced by Donovan, and Indy views the manuscript with considerable interest. A Ford coupe speeds down the tree-lined street and pulls up in front of the house. Indy climbs from the car and hurries up the walkway, with Brody a step behind. The porch is climbed by them, and they notice that the front door is ajar, exchanging a quick look of concern as they enter. The half-open front door is approached by Indy, and the door is pushed open before he calls out as he enters the house. One half of the curtains dividing the hall from the sitting room is opened by Indy to reveal the place has been ransacked. Indy's face is seen by Brody, and the other half is opened by him, and they walk into the room. Some mail is picked up from Henry's cluttered desk by Brody, and Indy turns to see the pile of torn papers and envelopes. His pockets are immediately emptied of his own mail taken earlier in the day from his college office, and the envelope with the Venice postmark is found by him. A small book that looks like a journal or diary is uncovered by Indy, and he flips through it, finding page after page of handwritten notes and drawings. It is glanced at with great curiosity by Brody. As the question is asked by Indy, he turns to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, and a second painting showing Eleventh Century Crusaders plummeting to their deaths over a high cliff, with one Crusader floating safely in midair because the Grail is held in his hands."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Donovan strides confidently across the room in a tuxedo to shake hands with Indy. He reveals a flat stone tablet inscribed with letters and symbols, examining it closely with glasses. Donovan pours champagne as Indy reads, then looks up startled, rubbing his chin dubiously as he accepts a glass. Indy stiffens at the mention of his father. Mrs. Donovan, in an elegant gown, enters, receives a kiss from Donovan, and returns to the party. Indy, intrigued by the Grail Tablet, moistens his finger with champagne to rub it over the Tablet. Donovan, lacking judgment, presents an ancient leather-bound volume, which Indy examines with interest. A Ford coupe speeds down the tree-lined street, stopping at the house. Indy and Brody hurry up the walkway, noticing the ajar front door, and enter with concern. Indy pushes open the door, revealing a ransacked room. Brody picks up mail from Henry's cluttered desk as Indy finds torn papers and an envelope with a Venice postmark. Indy discovers a small journal filled with handwritten notes and drawings, which Brody examines curiously. Indy turns to paintings depicting Christ on the Cross and Eleventh Century Crusaders, one floating safely with the Grail."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Donovan, exuding confidence in a tuxedo, strides to Indy and shakes his hand. He reveals a stone tablet from under a cloth, examines it with glasses, and pours champagne as Indy reads. Indy, startled, accepts champagne, stiffening at his father's mention. Mrs. Donovan enters, Donovan kisses her cheek, and she returns to the party. Indy, intrigued by the Grail Tablet, moistens his finger with champagne and rubs it over the Tablet. Donovan shows an ancient book, and Indy is interested. A Ford coupe arrives, Indy and Brody enter the house, finding it ransacked. Indy empties his pockets, finds a Venice postmarked envelope, and uncovers a journal with notes and drawings. Brody is curious. Indy notices paintings of Christ and Crusaders, one holding the Grail."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Donovan strides confidently across the spacious room toward Indy, exuding an aura of self-assurance and power. He is impeccably dressed in a classic tuxedo, which adds to his commanding presence. Upon reaching Indy, Donovan extends his hand in a firm handshake. He then moves with purpose to a nearby table, where an intriguing object is carefully wrapped in cloth. With a dramatic flourish, he throws back the cloth to reveal a flat stone tablet, approximately two feet square, intricately inscribed with mysterious letters and symbols. Donovan, eager to examine the artifact more closely, puts on his glasses for a better view. \n\nAs Donovan pours champagne into several elegant fluted glasses, Indy reads the inscriptions with intense focus. Suddenly, Indy pauses, looking up at Donovan with a startled expression that quickly shifts to one of skepticism. He rubs his chin thoughtfully as he accepts the glass of champagne that Donovan now offers him. Indy visibly stiffens at the mention of his father, acknowledging it with a nod. Just then, the door opens, and Mrs. Donovan, a matronly woman elegantly attired in an expensive evening gown, gracefully enters the room. Donovan leans over to kiss her cheek, and she sighs softly to herself before returning to the lively party. \n\nMeanwhile, Indy is drawn back to the Grail Tablet, clearly captivated by its archaeological significance. He moistens his finger with champagne and gently rubs it over the surface of the Tablet, as Donovan steps up beside him. Indy shakes his head slightly, indicating his disapproval of Donovan’s apparent lack of judgment. Donovan then produces an ancient, leather-bound volume with pages so brittle they seem ready to crumble. Indy examines the manuscript with considerable interest, his curiosity piqued.\n\nOutside, a Ford coupe speeds down the tree-lined street, coming to a stop in front of the house. Indy quickly climbs out of the car, with Brody following closely behind. They hurry up the walkway, their pace quickening as they notice the front door is ajar. Exchanging a quick, concerned glance, they enter the house. Indy approaches the half-open front door, pushes it open fully, and steps inside, calling out as he does so. He opens one half of the curtains that separate the hall from the sitting room, revealing a scene of chaos—the place has been thoroughly ransacked. Brody, seeing the look on Indy's face, opens the other half of the curtains, and together they walk into the room.\n\nBrody picks up some scattered mail from Henry's cluttered desk, while Indy turns to survey the pile of torn papers and envelopes. He quickly empties his pockets of his own mail, which he had collected earlier in the day from his college office, and finds an envelope with a Venice postmark. Indy uncovers a small book that resembles a journal or diary and flips through it, discovering page after page filled with handwritten notes and detailed drawings. Brody glances at the book with great curiosity. As Indy poses a question, he turns his attention to a painting on the wall. The artwork depicts Christ on the Cross, with his blood being captured in a golden chalice, and a second painting shows Eleventh Century Crusaders plummeting to their deaths over a high cliff, except for one Crusader who floats safely in midair, holding the Grail in his hands."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Donovan strides assertively and with a notable sense of confidence across the expansive and well-lit room toward Indy, projecting an unmistakable aura of self-assurance and power. He is dressed with meticulous attention to detail in a classic tuxedo, which further amplifies his commanding presence and dignified demeanor. Upon reaching Indy, Donovan extends his hand in a firm and confident handshake, establishing a connection. He then purposefully moves toward a nearby table, where an intriguing object is carefully concealed under a cloth. With a dramatic flourish, he unveils the cloth to reveal a flat stone tablet, approximately two feet square, intricately inscribed with mysterious letters and symbols that seem to whisper secrets of the past. Eager to examine this intriguing artifact more closely, Donovan dons his glasses to gain a better view of the inscriptions.\n\nAs Donovan skillfully pours champagne into several elegant fluted glasses, Indy reads the intricate inscriptions with intense concentration and focus. Suddenly, Indy pauses in his reading, looking up at Donovan with an expression of surprise that quickly shifts to skepticism. He rubs his chin thoughtfully, contemplating the implications, as he accepts the glass of champagne that Donovan offers him with a steady hand. Indy visibly stiffens at the mention of his father, acknowledging it with a brief nod that conveys unspoken emotions. Just then, the door opens, and Mrs. Donovan, a matronly woman elegantly attired in an expensive and flowing evening gown, makes a graceful entrance into the room. Donovan leans over to kiss her cheek, and she sighs softly to herself, a private gesture, before returning to the lively party atmosphere that surrounds them.\n\nMeanwhile, Indy is drawn back with intense interest to the Grail Tablet, clearly captivated by its immense archaeological significance and the mysteries it holds. He moistens his finger with champagne and delicately rubs it over the surface of the Tablet, as Donovan steps up beside him, observing with interest. Indy shakes his head slightly, indicating his disapproval of Donovan’s apparent lack of judgment in these matters. Donovan then produces an ancient, leather-bound volume, its pages so brittle they seem ready to crumble at any moment. Indy examines the manuscript with considerable interest, his curiosity piqued by the potential insights it may contain.\n\nOutside, a Ford coupe speeds decisively down the tree-lined street, coming to an abrupt stop in front of the house. Indy quickly climbs out of the car, with Brody following closely behind, his companion in this hurried mission. They hasten up the walkway, their pace quickening as they notice the front door standing slightly ajar. Exchanging a quick, concerned glance, they enter the house with a sense of urgency. Indy approaches the half-open front door, pushes it open fully, and steps inside, calling out in an effort to announce their presence. He opens one half of the heavy curtains that separate the hall from the sitting room, revealing a scene of chaos and disorder—the place has been thoroughly ransacked. Brody, upon seeing the look on Indy's face, opens the other half of the curtains, and together they step into the room, assessing the situation.\n\nBrody picks up some scattered mail from Henry's cluttered desk, while Indy turns to survey the pile of torn papers and envelopes littering the floor. He quickly empties his pockets of his own mail, which he had collected earlier in the day from his college office, and among them, he finds an envelope bearing a Venice postmark. Indy uncovers a small book that resembles a journal or diary locked in mystery and flips through it, discovering page after page filled with handwritten notes and detailed, intricate drawings. Brody glances at the book with great curiosity, sensing its importance. As Indy poses a question, his attention is drawn to a painting on the wall. The artwork depicts Christ on the Cross, his blood being captured in a golden chalice, and a second painting illustrates Eleventh Century Crusaders plummeting to their deaths over a high cliff, except for one Crusader who floats safely in midair, miraculously holding the Grail in his hands."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Donovan strides confidently across the room, his presence commanding attention as he moves with purpose toward Indy, his tuxedo adding to his aura of power. Upon reaching Indy, he extends his hand in a firm handshake, establishing a connection. Donovan then shifts his focus to a nearby table, where an object lies concealed beneath a cloth. With a swift motion, he throws back the cloth, unveiling a flat stone tablet approximately two feet square, its surface intricately inscribed with letters and symbols. To scrutinize the details more closely, Donovan retrieves his glasses and positions them on his nose, leaning in for a better view. Meanwhile, he pours champagne into several fluted glasses, the liquid bubbling gently as Indy reads the inscriptions. Suddenly, Indy halts his reading, his eyes darting up to meet Donovan's with a startled expression. He rubs his chin thoughtfully, a dubious look crossing his face, as Donovan offers him a glass of champagne. Indy accepts the glass, his body tensing slightly at the mention of his father, and he nods in acknowledgment. The door swings open, and Mrs. Donovan, a matronly woman adorned in an expensive evening gown, enters the room. Donovan leans over to greet her with a kiss on the cheek, and she sighs softly before returning to the party. Indy, now captivated by the Grail Tablet's archaeological significance, moistens his finger with champagne and gently rubs it over the Tablet's surface. Donovan steps up beside him, prompting Indy to shake his head at Donovan's apparent lack of judgment. Donovan then produces an ancient leather-bound volume, its pages brittle with age, and Indy examines the manuscript with keen interest. Meanwhile, a Ford coupe speeds down the tree-lined street, coming to a halt in front of the house. Indy climbs out of the car, urgency in his steps as he hurries up the walkway, with Brody following closely behind. They ascend the porch, noticing the front door slightly ajar, and exchange a quick, concerned glance before entering. Indy approaches the half-open front door, pushes it open fully, and steps inside, calling out as he does so. He opens one half of the curtains that separate the hall from the sitting room, revealing a scene of disarray, the room having been ransacked. Brody, observing Indy's reaction, opens the other half of the curtains, and together they walk into the room. Brody picks up some mail from Henry's cluttered desk, while Indy turns his attention to a pile of torn papers and envelopes. He quickly empties his pockets of his own mail, which he had collected earlier in the day from his college office, and discovers an envelope bearing a Venice postmark. Indy uncovers a small book resembling a journal or diary and flips through its pages, each filled with handwritten notes and drawings. Brody glances at the book with great curiosity. As Indy poses a question, he turns his gaze to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, and another painting showing Eleventh Century Crusaders plummeting to their deaths over a high cliff, with one Crusader miraculously floating in midair, the Grail clutched in his hands."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Donovan, exuding confidence in a tuxedo, strides across the room to greet Indy with a handshake. He then reveals a flat stone tablet from beneath a cloth and examines it closely with his glasses. As Indy reads the inscriptions, Donovan pours champagne, offering a glass to Indy, who reacts with a mix of surprise and skepticism, especially at the mention of his father. Mrs. Donovan enters, receives a kiss from Donovan, and returns to the party, while Indy, intrigued by the Grail Tablet, moistens his finger with champagne to examine it further. Donovan presents an ancient manuscript, capturing Indy's interest. Meanwhile, a Ford coupe arrives at the house, and Indy, with Brody close behind, hurries up the walkway. They notice the ajar front door, exchange a concerned glance, and enter. Inside, they find the place ransacked. Indy and Brody open the curtains to reveal the disarray, with Brody picking up mail from Henry's desk. Indy, noticing the mess, retrieves his own mail and finds an envelope with a Venice postmark. He uncovers a journal filled with notes and drawings, which Brody examines curiously. As Indy questions the situation, he turns to paintings depicting Christ on the Cross and Crusaders, one of whom holds the Grail, floating safely in midair."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Donovan strides across the opulently decorated room toward Indy, exuding confidence and power while dressed in a tuxedo, a style popularized in the early 20th century for formal events, and shakes hands with Indy. Donovan goes to a polished oak table where an object is wrapped in cloth, throws back the cloth revealing a flat stone tablet about two feet square, inscribed with letters and symbols resembling ancient Aramaic, and puts on his glasses to make a closer examination. Donovan, demonstrating his refined taste, pours champagne from a bottle of vintage Moët & Chandon into several fluted glasses as Indy reads. Suddenly, Indy stops and looks up at Donovan with a startled expression, then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him. Indy stiffens slightly at the mention of his father, Dr. Henry Jones Sr., a renowned archaeologist known for his studies on medieval literature, and nods. The door opens and Mrs. Donovan, a matronly woman in an expensive evening gown from a Parisian designer, steps into the room. Donovan leans over and kisses her cheek, and she sighs to herself, reminiscing about the grand social gatherings of past years, and returns to the party. Indy, meanwhile, has turned his attention back to the Grail Tablet, obviously hooked by its archaeological promise of revealing the location of the Holy Grail. He moistens his finger with champagne and rubs it over the Tablet, as Donovan steps up next to him. Indy has to shake his head at Donovan’s apparent lack of judgment in using such a precious artifact as a party curiosity. Donovan produces an ancient leather-bound volume, suspected to be a rare copy of the canon tables of Eusebius, with very brittle pages, and Indy views the manuscript with considerable interest, knowing its historical value. A Ford coupe, a popular model of the 1930s, speeds down the tree-lined street and pulls up in front of the house. Indy climbs from the car and hurries up the walkway, with Brody a step behind. They climb the porch, notice that the front door is ajar, and exchange a quick look of concern as they enter. Indy approaches the half-open front door, pushes open the door, and enters the house, calling out for his father. Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked, items strewn about in disarray. Brody sees Indy's face and opens the other half, and they walk into the room. Brody picks up some mail from Henry's cluttered desk, a workspace overwhelmed with research papers, and Indy turns to see the pile of torn papers and envelopes. He immediately empties his pockets of his own mail taken earlier in the day from his college office, where he lectures on archaeology, and finds the envelope with the Venice postmark, indicating recent correspondence from a collaborative project. Indy uncovers a small book that looks like a journal or diary and flips through it, finding page after page of handwritten notes and drawings, which are detailed annotations likely made by his father. Brody glances at it with great curiosity, sensing its importance. As Indy asks the question, he turns to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, symbolic of the Last Supper, and a second painting showing Eleventh Century Crusaders plummeting to their deaths over a high cliff, with one Crusader floating safely in midair because he holds the Grail in his hands, an allegory for the Grail's legendary protective powers."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy  Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination  Donovan pours champagne into several fluted glasses as Indy reads  Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest  A Ford coupe speeds down the treelined street and pulls up in front of the house  Indy climbs from the car and hurries up the walkway with Brody a step behind  They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter  Indy approaches the halfopen front door pushes open the door and enters the house calling out  Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked  Brody sees Indy's face and opens the other half and they walk into the room  Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes  He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark  Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings  Brody glances at it with great curiosity  As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh  Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him  Indy stiffens slightly at the mention of his father and nods  The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room  Donovan leans over and kisses her cheek and she sighs to herself and returns to the party  Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise  He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him  Indy has to shake his head at Donovan’s apparent lack of judgment  Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest  A Ford coupe speeds down the treelined street and pulls up in front of the house  Indy climbs from the car and hurries up the walkway with Brody a step behind  They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter  Indy approaches the halfopen front door pushes open the door and enters the house calling out  Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked  Brody sees Indy's face and opens the other half and they walk into the room  Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes  He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark  Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings  Brody glances at it with great curiosity  As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh  Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination. Donovan pours champagne into several fluted glasses as Indy reads. Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him. Indy stiffens slightly at the mention of his father and nods. The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room. Donovan leans over and kisses her cheek and she sighs to herself and returns to the party. Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise. He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him. Indy has to shake his head at Donovan’s apparent lack of judgment. Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A Ford coupe speeds down the treelined street and pulls up in front of the house. Indy climbs from the car and hurries up the walkway with Brody a step behind. They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter. Indy approaches the halfopen front door pushes open the door and enters the house calling out. Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked. Brody sees Indy's face and opens the other half and they walk into the room. Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes. He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark. Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings. Brody glances at it with great curiosity. As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh. Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination. Donovan pours champagne into several fluted glasses as Indy reads. Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him. Indy stiffens slightly at the mention of his father and nods. The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room. Donovan leans over and kisses her cheek and she sighs to herself and returns to the party. Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise. He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him. Indy has to shake his head at Donovan’s apparent lack of judgment. Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A Ford coupe speeds down the treelined street and pulls up in front of the house. Indy climbs from the car and hurries up the walkway with Brody a step behind. They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter. Indy approaches the halfopen front door pushes open the door and enters the house calling out. Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked. Brody sees Indy's face and opens the other half and they walk into the room. Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes. He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark. Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings. Brody glances at it with great curiosity. As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh. Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination. Donovan pours champagne into several fluted glasses as Indy reads. Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him. Indy stiffens slightly at the mention of his father and nods. The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room. Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes. He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark. Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings. Brody glances at it with great curiosity. As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh. Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy. Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination. Brody glances at it with great curiosity. As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh. Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The elephant strides across the room toward the dolphin, exuding confidence and power while dressed in a tuxedo, and shakes hands with the dolphin. The elephant goes to a table where an object is wrapped in cloth, throws back the cloth revealing a flat stone tablet about two feet square, inscribed with letters and symbols, and puts on her glasses to make a closer examination. The elephant pours champagne into several fluted glasses as the dolphin reads. Suddenly, the dolphin stops and looks up at the elephant with a startled expression, then rubs her chin with a dubious expression as she takes the glass of champagne the elephant now offers her. The dolphin stiffens slightly at the mention of her father and nods. The door opens and the giraffe, a matronly creature in an expensive evening gown, steps into the room. The elephant leans over and kisses her cheek, and she sighs to herself and returns to the party. The dolphin, meanwhile, has turned her attention back to the Grail Tablet, obviously hooked by its archaeological promise. She moistens her finger with champagne and rubs it over the Tablet, as the elephant steps up next to her. The dolphin has to shake her head at the elephant’s apparent lack of judgment. The elephant produces an ancient leather-bound volume with very brittle pages, and the dolphin views the manuscript with considerable interest. A lion speeds down the tree-lined street and pulls up in front of the house. The dolphin climbs from the car and hurries up the walkway, with the koala a step behind. They climb the porch, notice that the front door is ajar, and exchange a quick look of concern as they enter. The dolphin approaches the half-open front door, pushes open the door, and enters the house, calling out. The dolphin opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked. The koala sees the dolphin's face and opens the other half, and they walk into the room. The koala picks up some mail from the kangaroo's cluttered desk, and the dolphin turns to see the pile of torn papers and envelopes. She immediately empties her pockets of her own mail taken earlier in the day from her college office and finds the envelope with the Venice postmark. The dolphin uncovers a small book that looks like a journal or diary and flips through it, finding page after page of handwritten notes and drawings. The koala glances at it with great curiosity. As the dolphin asks the question, she turns to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, and a second painting showing Eleventh Century Crusaders plummeting to their deaths over a high cliff, with one Crusader floating safely in midair because he holds the Grail in his hands."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Donovan strides across the clearing toward Indy, exuding confidence and power while dressed in a dinner jacket, and shakes hands with Indy. Donovan goes to a podium where an item is wrapped in fabric, throws back the fabric revealing a spherical crystal ball about two inches wide, inscribed with numbers and markings, and puts on his monocle to make a closer examination. Donovan pours cider into several goblets as Indy reads. Suddenly, Indy stops and looks up at Donovan with a startled expression, then rubs his chin with a dubious expression as he takes the goblet of cider Donovan now offers him. Indy stiffens slightly at the mention of his father and nods. The hatch opens and Mrs. Donovan, a matronly woman in an elaborate cocktail dress, steps into the clearing. Donovan leans over and kisses her cheek, and she sighs to herself and returns to the gathering. Indy, meanwhile, has turned his attention back to the Crystal Sphere, obviously hooked by its astronomical promise. He moistens his finger with cider and rubs it over the Sphere, as Donovan steps up next to him. Indy has to shake his head at Donovan’s apparent lack of judgment. Donovan produces an ancient velvet-bound tome with very fragile pages, and Indy views the manuscript with considerable interest. A bicycle speeds down the cobblestone lane and pulls up in front of the cottage. Indy climbs from the bike and hurries up the pathway, with Brody a step behind. They climb the stoop, notice that the main door is ajar, and exchange a quick look of concern as they enter. Indy approaches the half-open main door, pushes open the door, and enters the cottage, calling out. Indy opens one half of the blinds dividing the entryway from the lounge to reveal the place has been disheveled. Brody sees Indy's face and opens the other half, and they walk into the lounge. Brody picks up some postcards from Henry's cluttered bureau, and Indy turns to see the pile of shredded documents and packets. He immediately empties his pockets of his own letters taken earlier in the day from his university study and finds the postcard with the Cairo stamp. Indy uncovers a small scroll that looks like a logbook or ledger and flips through it, finding page after page of handwritten accounts and sketches. Brody glances at it with great curiosity. As Indy asks the question, he turns to a mural on the wall depicting Christ on the Cross, his tears being captured in a silver basin, and a second mural showing Eleventh Century Knights plummeting to their deaths over a steep canyon, with one Knight floating safely in midair because he holds the Chalice in his hands."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Donovan strolls around the room toward Indy, exuding grace and charisma while dressed in a tuxedo, and nods at Indy. Donovan approaches a table where an object is wrapped in cloth, flips the cloth revealing a flat stone tablet about two feet square, inscribed with letters and symbols, and adjusts his glasses to make a closer inspection. Donovan brews coffee into several fluted glasses as Indy sketches. Suddenly, Indy pauses and glances at Donovan with a surprised expression, then taps his chin with a skeptical expression as he declines the glass of champagne Donovan now extends to him. Indy relaxes slightly at the mention of his father and salutes. The door swings open and Mrs. Donovan, a matronly woman in an expensive evening gown, glides into the room. Donovan leans over and whispers in her ear, and she smiles to herself and exits to the party. Indy, meanwhile, has shifted his attention back to the Grail Tablet, obviously intrigued by its archaeological promise. He taps his finger with champagne and traces it over the Tablet, as Donovan steps behind him. Indy has to chuckle at Donovan’s apparent lack of judgment. Donovan removes an ancient leather-bound volume with very brittle pages, and Indy examines the manuscript with considerable interest. A Ford coupe glides down the tree-lined street and parks in front of the house. Indy descends from the car and meanders up the walkway, with Brody a step beside. They ascend the porch, observe that the front door is ajar, and exchange a quick glance of curiosity as they proceed. Indy approaches the half-open front door, swings open the door, and enters the house, listening attentively. Indy draws back one half of the curtains dividing the hall from the sitting room to reveal the place has been disarrayed. Brody observes Indy's face and draws back the other half, and they stroll into the room. Brody examines some mail from Henry's cluttered desk, and Indy turns to inspect the pile of torn papers and envelopes. He promptly empties his pockets of his own mail taken earlier in the day from his college office and reveals the envelope with the Venice postmark. Indy uncovers a small book that looks like a journal or diary and leafs through it, encountering page after page of handwritten notes and drawings. Brody observes it with great fascination. As Indy muses, he turns to a painting on the wall depicting Christ on the Cross, his blood being captured in a golden chalice, and a second painting showing Eleventh Century Crusaders flying to their deaths over a high cliff, with one Crusader hovering safely in midair because he holds the Grail in his hands."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Octavius strides across the garden toward Blaze, exuding elegance and charisma while dressed in a gown, and shakes hands with Blaze. Octavius goes to a cabinet where a gadget is wrapped in paper, throws back the paper revealing a cylindrical metal canister about three feet tall, inscribed with numbers and equations, and puts on his monocle to make a closer examination. Octavius pours juice into several round mugs as Blaze reads. Suddenly, Blaze stops and looks up at Octavius with a startled expression, then rubs his elbow with a skeptical expression as he takes the mug of juice Octavius now offers him. Blaze stiffens slightly at the mention of his uncle and nods. The gate swings wide and Mrs. Octavius, a stately woman in a stylish cocktail dress, steps into the garden. Octavius leans over and kisses her hand, and she sighs to herself and returns to the celebration. Blaze, meanwhile, has turned his attention back to the Relic Cylinder, obviously hooked by its historical promise. He moistens his thumb with juice and rubs it over the Cylinder, as Octavius steps up next to him. Blaze has to shake his head at Octavius’s apparent lack of judgment. Octavius produces an ancient parchment scroll with very fragile bindings, and Blaze views the scroll with considerable intrigue. A Jaguar sedan speeds down the flower-lined avenue and pulls up in front of the villa. Blaze climbs from the bike and hurries up the path, with Maxwell a step behind. They climb the stoop, notice that the front gate is ajar, and exchange a quick look of concern as they enter. Blaze approaches the half-open front gate, pushes open the gate, and enters the villa, calling out. Blaze opens one half of the blinds dividing the foyer from the living room to reveal the place has been rummaged through. Maxwell sees Blaze's expression and opens the other half, and they walk into the room. Maxwell picks up some postcards from Arthur's chaotic table, and Blaze turns to see the pile of shredded documents and packs. He immediately empties his pockets of his own postcards taken earlier in the day from his university office and finds the pack with the London postmark. Blaze uncovers a small tome that looks like a ledger or logbook and flips through it, finding page after page of sketched diagrams and doodles. Maxwell glances at it with great fascination. As Blaze asks the question, he turns to a tapestry on the wall depicting Zeus on the Mount, his lightning bolt being captured in a silver goblet, and a second tapestry showing Twelfth Century Knights tumbling to their doom over a steep ridge, with one Knight hovering safely in midair because he holds the Goblet in his arms."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Margaret glides across the garden toward Leo, radiating curiosity and charm while dressed in a kimono, and nods at Leo. Margaret heads to a counter where an item is wrapped in cloth, lifts the cloth revealing a round wooden sculpture about two feet tall, inscribed with letters and symbols, and dons her hat to make a closer inspection. Margaret brews tea into several porcelain cups as Leo listens. Suddenly, Leo pauses and glances up at Margaret with a surprised expression, then scratches his ear with a doubtful look as he accepts the cup of tea Margaret now hands him. Leo flinches slightly at the mention of his aunt and winks. The gate swings open and Mr. Margaret, a distinguished man in a shabby overcoat, strolls into the garden. Margaret leans over and pats his shoulder, and he chuckles to himself and returns to the event. Leo, however, has shifted his focus back to the Art Sculpture, evidently intrigued by its artistic potential. He dampens his brush with tea and dabs it over the Sculpture, as Margaret steps up beside him. Leo has to roll his eyes at Margaret’s apparent lack of wisdom. Margaret reveals an ancient scroll bound with very fragile bindings, and Leo examines the document with considerable intrigue. A bicycle cruises down the flower-lined lane and halts by the garden gate. Leo leaps from the bike and rushes up the path, with Graham a pace behind. They ascend the steps, notice that the garden gate is slightly open, and trade a quick glance of concern as they enter. Leo approaches the slightly ajar garden gate, pushes it wide, and steps into the yard, calling out. Leo parts one half of the curtains separating the patio from the living room to reveal the place has been searched. Graham sees Leo's expression and parts the other half, and they proceed into the area. Graham retrieves some letters from Anna's disorganized table, and Leo turns to notice the stack of shredded documents and packages. He promptly empties his satchel of his own letters obtained earlier in the day from his studio and discovers the package with the Paris postmark. Leo uncovers a small notebook that resembles a sketchbook or diary and scans through it, finding sheet after sheet of hand-drawn sketches and notes. Graham observes it with intense fascination. As Leo raises the issue, he turns to a sculpture on the shelf depicting Zeus wielding lightning, his power being harnessed in a silver vessel, and a second sculpture showing Tenth Century Knights tumbling to the ground from a towering mountain, with one Knight soaring securely in the air because he grasps the Vessel in his arm."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Donovan strolls across the beach toward Indy, radiating calmness and mystery while dressed in a raincoat, and high-fives Indy. Donovan moves to a bookshelf where an object is enveloped in paper, flips aside the paper revealing a round wooden disc about two feet in diameter, engraved with numbers and patterns, and dons his monocle to make a distant observation. Donovan serves lemonade into several ceramic mugs as Indy contemplates. Suddenly, Indy freezes and glances at Donovan with an astonished look, then scratches his ear with a skeptical expression as he receives the mug of lemonade Donovan now offers him. Indy tenses slightly at the mention of his cousin and winks. The window slides open and Mrs. Donovan, a sprightly woman in a casual sundress, glides into the beach shack. Donovan bends down and tweaks her nose, and she chuckles to herself and leaves for the gathering. Indy, meanwhile, has shifted his focus back to the Grail Disc, clearly intrigued by its mystical allure. He wets his finger with lemonade and slides it over the Disc, as Donovan saunters up next to him. Indy has to roll his eyes at Donovan’s apparent lack of insight. Donovan produces a new paperback novel with very delicate pages, and Indy examines the text with moderate intrigue. A horse-drawn carriage gallops down the rocky path and halts in front of the cabin. Indy dismounts from the carriage and jogs up the trail, with Brody a step behind. They ascend the patio, note that the front gate is ajar, and share a quick nod of concern as they enter. Indy approaches the half-closed garden gate, swings open the gate, and ascends the porch, calling out. Indy pushes aside one half of the curtains dividing the deck from the greenhouse to reveal the place has been vandalized. Brody sees Indy's face and shoves aside the other half, and they proceed into the space. Brody picks up some magazines from Henry's cluttered counter, and Indy turns to see the pile of shredded documents and wrappers. He immediately empties his pockets of his own magazines taken earlier in the day from his campus office and finds the postcard with the Prague stamp. Indy uncovers a tiny box that looks like a puzzle or game and opens it, finding piece after piece of colorful sketches and scribbles. Brody peers at it with mild interest. As Indy poses the query, he turns to a sculpture on the walkway depicting Christ seated at the table, his bread being placed in a bronze basket, and a second sculpture showing Twelfth Century Knights sailing off into the sunset over a high wave, with one Knight gliding safely on a raft because he holds the Grail in his hands."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Baxter hops across the garden toward Luna, radiating curiosity and joy while dressed in a spacesuit, and pats Luna on the shoulder. Baxter moves to a pedestal where an item is wrapped in paper, peels back the paper revealing a round marble block about three feet across, etched with numbers and patterns, and dons his monocle to make a detailed inspection. Baxter brews coffee into several mugged cups as Luna sketches. Suddenly, Luna pauses and gazes up at Baxter with a bemused expression, then taps his forehead with a thoughtful look as he accepts the cup of coffee Baxter now hands him. Luna flinches slightly at the mention of her uncle and winks. The window opens and Mr. Baxter, a grandfatherly man in a simple farmer's outfit, slips into the space. Baxter bends down and pats his shoulder, and he grumbles to himself and exits to the meadow. Luna, meanwhile, has turned his gaze back to the Ancient Puzzle, clearly drawn by its mystical allure. He dampens his thumb with coffee and dabs it over the Puzzle, as Baxter wanders over beside him. Luna has to shrug at Baxter’s evident sense of humor. Baxter retrieves a vintage velvet-bound scrapbook with remarkably fragile pages, and Luna regards the scrapbook with significant intrigue. A bicycle zooms down the sunflower-lined path and halts beside the barn. Luna climbs off the bicycle and rushes up the path, with Jasper a pace behind. They mount the steps, notice that the side window is ajar, and share a swift glance of unease as they step inside. Luna approaches the slightly ajar side window, nudges open the window, and steps into the barn, shouting out. Luna pushes aside one part of the curtain partitioning the barn from the storage shed to disclose the site has been rummaged. Jasper sees Luna's expression and pushes aside the other part, and they stroll into the shed. Jasper picks up some leaves from Harold's messy workbench, and Luna turns to notice the heap of shredded material and wrappers. He immediately empties his backpack of his own leaves gathered earlier in the day from his university greenhouse and locates the parcel with the Paris stamp. Luna discovers a small notepad that resembles a sketchbook or booklet and thumbs through it, uncovering sheet after sheet of scribbled doodles and paintings. Jasper peers at it with intense fascination. As Luna poses the inquiry, he turns to a sculpture in the corner depicting Apollo on a Chariot, his light being captured in a silver goblet, and a second sculpture showing Twelfth Century Knights tumbling to their demise over a steep gorge, with one Knight hovering safely in midair because he clutches the Goblet in his grasp."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Donovan confidently approaches Indy in a tuxedo, revealing a stone tablet wrapped in cloth. As Indy examines it, he pauses, surprised, when Donovan mentions his father. Mrs. Donovan briefly enters the room, and Indy, intrigued by the tablet's archaeological value, scrutinizes it further. Donovan presents an ancient manuscript, catching Indy's interest. A Ford coupe arrives at a house, Indy and Brody enter, finding the place ransacked. Indy inspects the mess, discovers mail from his college office, and finds a journal filled with notes and drawings. Brody shows interest as Indy observes paintings of Christ and Crusaders, linked to the Grail."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh  Brody glances at it with great curiosity  Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings  He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark  Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes  Brody sees Indy's face and opens the other half and they walk into the room  Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked  Indy approaches the halfopen front door pushes open the door and enters the house calling out  They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter  Indy climbs from the car and hurries up the walkway with Brody a step behind  A Ford coupe speeds down the treelined street and pulls up in front of the house  Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest  Indy has to shake his head at Donovan’s apparent lack of judgment  He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him  Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise  Donovan leans over and kisses her cheek and she sighs to herself and returns to the party  The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room  Indy stiffens slightly at the mention of his father and nods  Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him  Donovan pours champagne into several fluted glasses as Indy reads  Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination  Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes  Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise  Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings  A Ford coupe speeds down the treelined street and pulls up in front of the house  Indy stiffens slightly at the mention of his father and nods  Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked  Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands Indy has to shake his head at Donovan’s apparent lack of judgment  Donovan leans over and kisses her cheek and she sighs to herself and returns to the party  Brody sees Indy's face and opens the other half and they walk into the room  Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination  As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh  Indy climbs from the car and hurries up the walkway with Brody a step behind  Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him  Donovan pours champagne into several fluted glasses as Indy reads  Brody glances at it with great curiosity  Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest  They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter  The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room  Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy  He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him  He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark  Indy approaches the halfopen front door pushes open the door and enters the house calling out "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Indy climbs from the car and hurries up the walkway with Brody a step behind  They climb the porch notice that the front door is ajar and exchange a quick look of concern as they enter  Indy approaches the halfopen front door pushes open the door and enters the house calling out  Indy opens one half of the curtains dividing the hall from the sitting room to reveal the place has been ransacked  Brody sees Indy's face and opens the other half and they walk into the room  Brody picks up some mail from Henry's cluttered desk and Indy turns to see the pile of torn papers and envelopes  He immediately empties his pockets of his own mail taken earlier in the day from his college office and finds the envelope with the Venice postmark  Indy uncovers a small book that looks like a journal or diary and flips through it finding page after page of handwritten notes and drawings  Brody glances at it with great curiosity  As Indy asks the question he turns to a painting on the wall depicting Christ on the Cross his blood being captured in a golden chalice and a second painting showing Eleventh  Century Crusaders plummeting to their deaths over a high cliff with one Crusader floating safely in midair because he holds the Grail in his hands Donovan strides across the room toward Indy exuding confidence and power while dressed in a tuxedo and shakes hands with Indy  Donovan goes to a table where an object is wrapped in cloth throws back the cloth revealing a flat stone tablet about two feet square inscribed with letters and symbols and puts on his glasses to make a closer examination  Donovan pours champagne into several fluted glasses as Indy reads  Suddenly Indy stops and looks up at Donovan with a startled expression then rubs his chin with a dubious expression as he takes the glass of champagne Donovan now offers him  Indy stiffens slightly at the mention of his father and nods  The door opens and Mrs Donovan a matronly woman in an expensive evening gown steps into the room  Donovan leans over and kisses her cheek and she sighs to herself and returns to the party  Indy meanwhile has turned his attention back to the Grail Tablet obviously hooked by its archaeological promise  He moistens his finger with champagne and rubs it over the Tablet as Donovan steps up next to him  Indy has to shake his head at Donovan’s apparent lack of judgment  Donovan produces an ancient leatherbound volume with very brittle pages and Indy views the manuscript with considerable interest  A Ford coupe speeds down the treelined street and pulls up in front of the house "
        }
      ]
    }
  ]
}