{
  "ground_truth": "Parrish is at a loss, and Susan's directness catches him by surprise, causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe, who tries to respond but can't, his stammer interrupted by her. They are inches apart, surrounded by each other's scent, a heaviness in the moment, and Joe turns to head up the stairs. He excuses himself with an ineffable gesture and climbs the stairs, as Susan watches him disappear. Susan is left alone with Parrish, who is making a drink at a sidebar, and she kisses him before leaving. Elsewhere, the Board of Parrish Communications is gathered, with Parrish and Quince absent. Drew quietly speaks to Felicia and she leaves the room, only to return with Quince, who enters surprised but smiling, realizing what Drew has on his mind. Quince nods confidently to Drew, then turns importantly to the Board. She bursts into tears again as a sense of foreboding falls over Joe's face, fearing he is passing through a point of no return, but his apprehensive expression fades away. Parrish and Joe enter, with the entire Board assembled, including Drew, Quince, and Sloane. Drew receives a message while Joe checks all attendees, his eyes resting on Drew. Parrish looks around, extending the moment, appearing as if he may never answer, and remains expressionless. Joe's eyes remain fixed on Drew as he follows Parrish out of the room. Sloane pursues Parrish and Joe, but when the elevator door opens, Parrish and Joe step inside, leaving Sloane behind. The Board meeting breaks up, with members lingering in clusters, exchanging post-mortems. An enraged Quince corners Drew out of earshot, falls silent, and is struck dumb. Her head nestles under his arm, feeling his comfort without his awareness, and she laughs at his earnestness. Joe drifts away, lying with her but for the first time feeling separate, sensing him gone to a distant land, while she smiles. Joe and Susan are at the front door, where he helps her with her coat, they kiss, the kiss lingering. Susan breaks away, reaches for the door, looks back longingly at Joe, and leaves, Joe softly closing the door after her. He turns back into the foyer, looking up at Parrish on the balcony, who has observed Joe and Susan.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Parrish is at a loss, and Susan's candor catches him by astonishment, causing Joe to blink and silently feel exceedingly uneasy about Susan's questions. Susan approaches Joe, who tries to reply but can't, his stammer interrupted by her. They are inches apart, surrounded by each other's aroma, a weight in the instant, and Joe turns to head up the stairs. He excuses himself with an indescribable motion and ascends the stairs, as Susan watches him vanish. Susan is left alone with Parrish, who is making a beverage at a sidebar, and she kisses him before departing. Elsewhere, the Board of Parrish Communications is assembled, with Parrish and Quince absent. Drew quietly speaks to Felicia and she leaves the chamber, only to return with Quince, who enters astonished but grinning, realizing what Drew has on his mind. Quince nods assuredly to Drew, then turns significantly to the Board. She bursts into sobs again as a sense of foreboding descends over Joe's face, fearing he is traversing a point of no return, but his anxious expression diminishes away. Parrish and Joe enter, with the entire Board gathered, including Drew, Quince, and Sloane. Drew receives a message while Joe checks all participants, his eyes resting on Drew. Parrish looks around, elongating the moment, appearing as if he may never reply, and remains impassive. Joe's eyes remain fixed on Drew as he follows Parrish out of the chamber. Sloane pursues Parrish and Joe, but when the elevator door opens, Parrish and Joe step within, leaving Sloane behind. The Board meeting disperses, with members lingering in clusters, exchanging analyses. An infuriated Quince corners Drew out of earshot, falls silent, and is struck speechless. Her head nestles under his arm, feeling his solace without his cognizance, and she laughs at his sincerity. Joe drifts away, lying with her but for the first time feeling distinct, sensing him gone to a distant realm, while she smiles. Joe and Susan are at the front door, where he helps her with her coat, they kiss, the kiss lingering. Susan breaks away, reaches for the entryway, looks back yearningly at Joe, and departs, Joe softly closing the door after her. He turns back into the foyer, gazing up at Parrish on the balcony, who has observed Joe and Susan."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Parrish is at a loss, and he is caught by surprise by Susan's directness, causing Joe to blink and silently feel extremely anxious about the inquiries made by Susan. Joe is approached by Susan, who is tried to be responded to by him, but his stammer is interrupted. They are inches apart, surrounded by each other's scent, a heaviness in the moment is felt, and the stairs are headed up by Joe. An ineffable gesture is used to excuse himself, and the stairs are climbed by him, as he is watched by Susan, who sees him disappear. Parrish is left alone with Susan, who makes a drink at a sidebar, and he is kissed by her before she leaves. Elsewhere, the Board of Parrish Communications gathers, with Parrish and Quince absent. Felicia is spoken to quietly by Drew, and she leaves the room, only to return with Quince, who enters surprised but smiling, realizing what Drew has on his mind. A confident nod is given by Quince to Drew, then the Board is turned to importantly by him. Tears burst from her again as a sense of foreboding falls over Joe's face, fearing he is passing through a point of no return, but his apprehensive expression fades away. Parrish and Joe enter, with the entire Board assembled, including Drew, Quince, and Sloane. A message is received by Drew while he is checked by Joe, his eyes resting on Drew. Parrish looks around, extending the moment, appearing as if an answer may never be given, and he remains expressionless. Drew is fixed on by Joe's eyes as Parrish is followed by him out of the room. Parrish and Joe are pursued by Sloane, but when the elevator door opens, they step inside, leaving Sloane behind. The Board meeting is broken up by the members, with clusters lingering, post-mortems being exchanged. An enraged Quince corners Drew out of earshot, falls silent, and strikes him dumb. Her head is nestled under his arm, feeling comfort without awareness, and his earnestness is laughed at by her. Joe drifts away, lying with her but for the first time feeling separate, sensing himself gone to a distant land, while she smiles. Joe and Susan are at the front door, where her coat is helped with by him, they kiss, the kiss lingering. Away is broken by Susan, who reaches for the door, looks back longingly at Joe, and leaves, the door being softly closed by Joe after her. The foyer is turned back into by him, looking up at Parrish on the balcony, who has observed Joe and Susan."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Parrish is at a loss when Susan's directness surprises him, causing Joe to feel anxious about her questions. Susan tries to speak with Joe, who can't respond, his stammer cut off by her. They stand close, surrounded by each other's scent, as Joe turns to head up the stairs. He excuses himself with a gesture, climbing the stairs while Susan watches him leave. Susan is left with Parrish, who makes a drink at the sidebar, and she kisses him before departing. Meanwhile, the Board of Parrish Communications gathers without Parrish and Quince. Drew speaks to Felicia, who leaves and returns with Quince, who enters surprised but smiling at Drew's intentions. Quince nods to Drew, then addresses the Board. She bursts into tears as Joe fears a point of no return, but his apprehension fades. Parrish and Joe join the assembled Board, including Drew, Quince, and Sloane. Drew receives a message while Joe observes everyone, especially Drew. Parrish extends the moment, expressionless, before leaving with Joe. Sloane follows them to the elevator, but they step inside, leaving her behind. The Board meeting ends, members linger, exchanging post-mortems. An angry Quince corners Drew, then falls silent, comforted under his arm, laughing at his earnestness. Joe drifts away, lying with her but feeling distant, sensing a separation while she smiles. At the front door, Joe helps Susan with her coat, they kiss, and Susan leaves, looking back longingly. Joe softly closes the door and turns to see Parrish observing from the balcony."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Parrish is bewildered by Susan's directness, making Joe anxious. Susan approaches Joe, who struggles to respond and instead retreats upstairs, excusing himself silently as Susan watches. Alone with Parrish, Susan kisses him before leaving. Meanwhile, the Parrish Communications Board meets, missing Parrish and Quince. Drew talks to Felicia, who brings in a surprised, smiling Quince. Quince nods at Drew, then turns to the Board. She cries, as Joe fears a point of no return. Parrish and Joe enter the meeting, with Drew receiving a message. Joe's eyes linger on Drew, following Parrish out. Sloane follows but is left behind when Parrish and Joe enter an elevator. The Board meeting ends with members discussing. Quince confronts Drew, initially speechless, then laughs, feeling comfort. Joe feels distant while lying with her, sensing separation. At the door, Joe helps Susan with her coat, they kiss, then she leaves, looking back at him. Joe closes the door, turns to see Parrish observing from the balcony."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Parrish finds himself at a complete loss, completely taken aback, while Susan’s straightforwardness thoroughly surprises him, causing Joe to blink in confusion and silently feel an intense sense of anxiety about Susan’s probing inquiries. As Susan approaches Joe, he attempts to respond to her, but finds himself unable to articulate his thoughts. His awkward stammer is promptly interrupted by her. They stand mere inches apart, enveloped by each other’s scent, a certain heaviness hanging in the air, and eventually, Joe decides to turn and head up the stairs. He offers an ineffable gesture as an excuse and begins to climb the stairs, while Susan watches him as he vanishes from sight. Left alone, Susan is in the company of Parrish, who is busy preparing a drink at a sidebar. She gives him a kiss before making her exit. Meanwhile, elsewhere, the Board of Parrish Communications has gathered, although Parrish and Quince are both absent from the meeting. Drew engages in a quiet conversation with Felicia, who leaves the room momentarily, only to come back with Quince. Quince enters, appearing surprised but smiling, as he quickly understands what Drew intends. Quince gives a confident nod of acknowledgement to Drew, then importantly turns his attention to address the Board. She bursts into tears once again, as a looming sense of foreboding falls over Joe’s face, casting a shadow of fear that he is crossing a point of no return. Slowly, however, his apprehensive expression begins to fade away. Parrish and Joe enter the room where the entire Board is assembled, including Drew, Quince, and Sloane. Drew receives a message while Joe scans the room, his eyes eventually resting on Drew. Parrish looks around steadily, prolonging the moment with a look that suggests he may never provide an answer, while maintaining an expressionless demeanor. Joe’s gaze remains fixed on Drew as he follows Parrish out of the room. Sloane trails behind Parrish and Joe, but when the elevator doors open, Parrish and Joe step inside, leaving Sloane behind. The Board meeting concludes, and members linger in small clusters, exchanging post-mortems on the events. An infuriated Quince corners Drew out of earshot, falling silent and struck speechless. Her head nestles comfortably under his arm, feeling his comforting presence without him even realizing it, and she laughs at his earnestness. Joe drifts away, lying beside her but for the first time feeling a sense of separation, sensing he has journeyed to a distant land, while she continues to smile. Joe and Susan stand at the front door, where he assists her by helping her with her coat. They share a kiss, the kiss lingering sweetly. Susan pulls away, reaches for the door, glances back longingly at Joe, and departs. Joe softly closes the door behind her, turning back into the foyer and looking up at Parrish, who is on the balcony, having observed the exchange between Joe and Susan."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Parrish finds himself at a complete loss for words, entirely taken aback by the situation unfolding before him. Susan’s straightforwardness thoroughly surprises and catches him off guard, which causes Joe to blink in utter confusion. As he processes this, he silently experiences an intense sense of anxiety about the probing nature of Susan’s inquiries. When Susan approaches Joe, he desperately attempts to respond to her, but he struggles to articulate his thoughts clearly. His awkward stammer is abruptly cut short by Susan’s interjection. They stand mere inches apart, enveloped by each other’s distinct scent, with a certain heaviness hanging in the air between them. Eventually, Joe makes the decision to turn and head up the stairs. He offers an ineffable gesture as an unspoken excuse for his departure and begins to climb the stairs, while Susan watches him as he gradually vanishes from sight. Left alone, Susan finds herself in the company of Parrish, who is preoccupied with preparing a drink at a well-stocked sidebar. She gives him a kiss before making her exit. Meanwhile, elsewhere, the Board of Parrish Communications has gathered for an important meeting, although both Parrish and Quince are notably absent from the proceedings. Drew engages in a quiet conversation with Felicia, who momentarily steps out of the room, only to return shortly thereafter with Quince. As Quince enters the room, he appears surprised yet wears a smile, as he quickly comprehends what Drew intends. Quince gives a confident nod of acknowledgement to Drew before importantly turning his attention to addressing the Board members. She bursts into tears once again, as a looming sense of foreboding falls over Joe’s face, casting a shadow of fear that suggests he is crossing a point of no return. Slowly, however, his apprehensive expression begins to fade away. Parrish and Joe enter the room where the entire Board is assembled, which includes Drew, Quince, and Sloane. As Drew receives a message, Joe takes a moment to scan the room, his eyes eventually resting on Drew. Parrish looks around steadily, prolonging the moment with a look that suggests he may never provide an answer, all while maintaining an expressionless demeanor. Joe’s gaze remains fixed on Drew as he follows Parrish out of the room. Sloane trails behind Parrish and Joe, but when the elevator doors open, Parrish and Joe step inside, leaving Sloane behind. The Board meeting concludes, and members linger in small clusters, exchanging post-mortems on the day’s events. An infuriated Quince corners Drew in a spot that is out of earshot, but then falls silent, struck speechless. Her head nestles comfortably under his arm, feeling his comforting presence without him even realizing it, and she laughs at his earnestness. Joe drifts away, lying beside her but for the first time feeling a sense of separation, as though he has journeyed to a distant land, while she continues to smile. Joe and Susan stand together at the front door, where he assists her by helping her with her coat. They share a kiss, the kiss lingering sweetly. Susan pulls away, reaches for the door, and then glances back longingly at Joe before she departs. Joe softly closes the door behind her, turning back into the foyer and looking up at Parrish, who is on the balcony, having observed the entire exchange between Joe and Susan."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Parrish finds himself at a loss, utterly unprepared for the unexpected directness of Susan's probing questions, which catches him off guard and leaves Joe feeling highly anxious. As Susan approaches Joe, he makes an attempt to respond, but his words falter, and his stammer is cut short by Susan's interruption. The two find themselves standing mere inches apart, enveloped in the intimacy of each other's scent and the palpable tension of the moment. Faced with the intensity, Joe decides to retreat and turns to head toward the staircase. He mumbles a vague excuse, a gesture that seems to convey his intention to leave, and begins his ascent, each step taking him further away as Susan follows his movements with her eyes until he vanishes from view. Left alone with Parrish, who is occupied at a sidebar preparing a drink, Susan leans in and presses a kiss to him before making her exit. Meanwhile, in another location, the Board of Parrish Communications is convened, noticeably without Parrish and Quince. Drew quietly engages Felicia in conversation, prompting her to exit the room momentarily and return with Quince. Quince enters the room looking both surprised and amused, quickly catching on to Drew's intentions. A nod of confident understanding is exchanged between Quince and Drew before Quince turns her focus importantly to the assembled Board. Emotions swell, and she bursts into tears once more, as if sensing a looming inevitability. As this unfolds, a shadow of foreboding darkens Joe's expression, suggesting his fear of crossing a critical threshold, yet this apprehension soon dissipates. With Parrish and Joe now joining the Board meeting, the entire group is present, including Drew, Quince, and Sloane. During the meeting, Drew silently receives a message while Joe discreetly surveys those present, his gaze settling on Drew. As Parrish takes in the room, he momentarily stretches the silence, betraying no hint of his thoughts with his impassive demeanor. Joe's attention remains riveted on Drew as he accompanies Parrish in departing the room. Sloane attempts to follow them, but as the elevator doors slide open, Parrish and Joe step inside, leaving Sloane behind. The Board meeting concludes, and its members gradually disperse, clustering in small groups to exchange their reflections on what transpired. In a quieter corner, an incensed Quince confronts Drew, drawing him to a secluded spot out of anyone's hearing range, where words escape her, leaving her speechless. She nestles her head under his arm, finding solace in his presence, though he remains oblivious, and she emits a light-hearted laugh at his earnest demeanor. Meanwhile, Joe experiences a sense of detachment while lying next to her, feeling a profound separation as if he has journeyed to a distant land, while she simply smiles beside him. Later, at the front door, Joe assists Susan with her coat, their kiss lingering with unspoken emotions. Susan eventually pulls away, her hand finding the door handle, and she casts one last, longing look at Joe before stepping outside. Joe gently closes the door behind her, turning back into the foyer where his gaze rises to meet Parrish, who has been silently observing the exchange from the balcony above."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Parrish is caught off guard by Susan's directness, leaving Joe anxious and speechless as she approaches him, overwhelming Joe with her presence. He excuses himself and heads upstairs, leaving Susan with Parrish, whom she kisses before departing. Meanwhile, the Board of Parrish Communications meets, with Parrish and Quince initially absent. Drew signals Felicia to bring in Quince, who enters, understanding Drew's intentions, and confidently addresses the Board. As emotions run high, a foreboding feeling washes over Joe before his apprehension fades. Parrish and Joe join the assembled Board, where Drew receives a message. Joe's attention lingers on Drew before following Parrish out, leaving Sloane behind at the elevator. The Board meeting concludes with members lingering for discussions. An upset Quince confronts Drew privately, finding solace in his presence despite her silence. Joe feels detached while lying with her, sensing a distance even as she smiles. At the front door, Joe helps Susan with her coat, and they share a lingering kiss. Susan departs, casting a longing glance back at Joe, who gently closes the door. He returns to the foyer, looking up to see Parrish observing from the balcony."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Parrish is at a loss, and Susan's directness, known for its ability to unsettle even the most composed individuals, catches him by surprise, causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe, who tries to respond but can't, his stammer interrupted by her, a trait she developed during her career as an incisive journalist. They are inches apart, surrounded by each other's scent, a heaviness in the moment like the oppressive tension of a thunderstorm, and Joe turns to head up the stairs. He excuses himself with an ineffable gesture and climbs the stairs, as Susan watches him disappear, recalling the time they first met on those very steps. Susan is left alone with Parrish, who is making a drink at a sidebar crafted from rare mahogany, and she kisses him before leaving. Elsewhere, the Board of Parrish Communications, a leading media conglomerate known for its influence, is gathered, with Parrish and Quince absent. Drew, known for his strategic acumen, quietly speaks to Felicia and she leaves the room, only to return with Quince, who enters surprised but smiling, realizing what Drew has on his mind, a critical business proposal. Quince nods confidently to Drew, then turns importantly to the Board. She bursts into tears again as a sense of foreboding falls over Joe's face, fearing he is passing through a point of no return, a feeling not unlike standing on the edge of a precipice, but his apprehensive expression fades away. Parrish and Joe enter, with the entire Board assembled, including Drew, Quince, and Sloane, who is known for her sharp eye for detail. Drew receives a message while Joe checks all attendees, his eyes resting on Drew, a long-time rival. Parrish looks around, extending the moment like a conductor pausing before the final note, appearing as if he may never answer, and remains expressionless. Joe's eyes remain fixed on Drew as he follows Parrish out of the room. Sloane pursues Parrish and Joe, but when the elevator door opens, Parrish and Joe step inside, leaving Sloane, with her reputation for persistence, behind. The Board meeting breaks up, with members lingering in clusters, exchanging post-mortems as if dissecting a failed operation. An enraged Quince corners Drew out of earshot, falls silent, and is struck dumb. Her head nestles under his arm, feeling his comfort without his awareness, a rare moment of vulnerability, and she laughs at his earnestness. Joe drifts away, lying with her but for the first time feeling separate, sensing him gone to a distant land, an emotional chasm growing between them, while she smiles. Joe and Susan are at the front door, a grand entrance designed to impress visitors, where he helps her with her coat, they kiss, the kiss lingering like the final note of a symphony. Susan breaks away, reaches for the door, looks back longingly at Joe, and leaves, Joe softly closing the door after her. He turns back into the foyer, looking up at Parrish on the balcony, who has observed Joe and Susan with the watchful eye of a mentor."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away Drew receives a message while Joe checks all attendees his eyes resting on Drew Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries Quince nods confidently to Drew then turns importantly to the Board Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries Susan approaches Joe who tries to respond but cannot his stammer interrupted by her They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs Joe and Susan are at the front door where he helps her with her coat Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent Parrish looks around extending the moment appearing as if he may never answer and remains expressionless Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind Susan approaches Joe who tries to respond but cannot his stammer interrupted by her Quince nods confidently to Drew then turns importantly to the Board She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane Drew receives a message while Joe checks all attendees his eyes resting on Drew He turns back into the foyer looking up at Parrish on the balcony Parrish looks around extending the moment appearing as if he may never answer and remains expressionless Joe's eyes remain fixed on Drew as he follows Parrish out of the room He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind The Board meeting breaks up with members lingering in clusters exchanging postmortems An enraged Quince corners Drew out of earshot falls silent and is struck dumb Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness they kiss the kiss lingering Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her Joe and Susan are at the front door where he helps her with her coat they kiss the kiss lingering Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her He turns back into the foyer looking up at Parrish on the balcony who has observed Joe and Susan"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe who tries to respond but cannot his stammer interrupted by her. They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs. He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear. Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving. Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent. Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind. Quince nods confidently to Drew then turns importantly to the Board. She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away. Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane. Drew receives a message while Joe checks all attendees his eyes resting on Drew. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Parrish looks around extending the moment appearing as if he may never answer and remains expressionless. Joe's eyes remain fixed on Drew as he follows Parrish out of the room. Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind. The Board meeting breaks up with members lingering in clusters exchanging postmortems. An enraged Quince corners Drew out of earshot falls silent and is struck dumb. Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness. Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles. Joe and Susan are at the front door where he helps her with her coat. they kiss the kiss lingering. Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her. He turns back into the foyer looking up at Parrish on the balcony. who has observed Joe and Susan."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe who tries to respond but cannot his stammer interrupted by her. They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs. He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear. Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving. Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent. Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind. Quince nods confidently to Drew then turns importantly to the Board. She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away. Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane. Drew receives a message while Joe checks all attendees his eyes resting on Drew. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Parrish looks around extending the moment appearing as if he may never answer and remains expressionless. Joe's eyes remain fixed on Drew as he follows Parrish out of the room. Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind. The Board meeting breaks up with members lingering in clusters exchanging postmortems. An enraged Quince corners Drew out of earshot falls silent and is struck dumb. Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness. Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles. Joe and Susan are at the front door where he helps her with her coat. they kiss the kiss lingering. Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her. He turns back into the foyer looking up at Parrish on the balcony. who has observed Joe and Susan."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe who tries to respond but cannot his stammer interrupted by her. They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs. He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear. Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving. Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent. Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles. Joe and Susan are at the front door where he helps her with her coat. they kiss the kiss lingering. Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her. He turns back into the foyer looking up at Parrish on the balcony. who has observed Joe and Susan."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe who tries to respond but cannot his stammer interrupted by her. Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her. He turns back into the foyer looking up at Parrish on the balcony. who has observed Joe and Susan."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The octopus is at a loss, and the bird's directness catches the octopus by surprise, causing the penguin to blink and silently feel extremely anxious about the bird's inquiries. The bird approaches the penguin, who tries to respond but can't, his stammer interrupted by the bird. They are inches apart, surrounded by each other's scent, a heaviness in the moment, and the penguin turns to head up the stairs. The penguin excuses himself with an ineffable gesture and climbs the stairs, as the bird watches the penguin disappear. The bird is left alone with the octopus, who is making a drink at a sidebar, and the bird kisses the octopus before leaving. Elsewhere, the Committee of Aquatic Communications is gathered, with the octopus and the turtle absent. The dolphin quietly speaks to the parrot and the parrot leaves the room, only to return with the turtle, who enters surprised but smiling, realizing what the dolphin has on his mind. The turtle nods confidently to the dolphin, then turns importantly to the Committee. The antelope bursts into tears again as a sense of foreboding falls over the penguin's face, fearing the penguin is passing through a point of no return, but the penguin's apprehensive expression fades away. The octopus and the penguin enter, with the entire Committee assembled, including the dolphin, the turtle, and the panda. The dolphin receives a message while the penguin checks all attendees, his eyes resting on the dolphin. The octopus looks around, extending the moment, appearing as if the octopus may never answer, and remains expressionless. The penguin's eyes remain fixed on the dolphin as the penguin follows the octopus out of the room. The panda pursues the octopus and the penguin, but when the elevator door opens, the octopus and the penguin step inside, leaving the panda behind. The Committee meeting breaks up, with members lingering in clusters, exchanging post-mortems. An enraged turtle corners the dolphin out of earshot, falls silent, and is struck dumb. The turtle's head nestles under the dolphin's arm, feeling his comfort without his awareness, and the turtle laughs at his earnestness. The penguin drifts away, lying with the turtle but for the first time feeling separate, sensing the dolphin gone to a distant land, while the turtle smiles. The penguin and the bird are at the front door, where the penguin helps the bird with her coat, they kiss, the kiss lingering. The bird breaks away, reaches for the door, looks back longingly at the penguin, and leaves, the penguin softly closing the door after the bird. The penguin turns back into the foyer, looking up at the octopus on the balcony, who has observed the penguin and the bird."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Parrish is at a loss, and Susan's directness catches him by surprise, causing Joe to blink and silently feel extremely anxious about Susan's inquiries. Susan approaches Joe, who tries to respond but can't, his stammer interrupted by her. They are inches apart, surrounded by each other's scent, a heaviness in the moment, and Joe turns to head up the escalator. He excuses himself with an ineffable gesture and climbs the escalator, as Susan watches him disappear. Susan is left alone with Parrish, who is making a drink at a tea cart, and she kisses him before leaving. Elsewhere, the Council of Parrish Communications is gathered, with Parrish and Quince absent. Drew quietly speaks to Felicia and she leaves the room, only to return with Quince, who enters surprised but smiling, realizing what Drew has on his mind. Quince nods confidently to Drew, then turns importantly to the Council. She bursts into tears again as a sense of foreboding falls over Joe's face, fearing he is passing through a point of no return, but his apprehensive expression fades away. Parrish and Joe enter, with the entire Council assembled, including Drew, Quince, and Sloane. Drew receives an alert while Joe checks all attendees, his eyes resting on Drew. Parrish looks around, extending the moment, appearing as if he may never answer, and remains expressionless. Joe's eyes remain fixed on Drew as he follows Parrish out of the room. Sloane pursues Parrish and Joe, but when the tram door opens, Parrish and Joe step inside, leaving Sloane behind. The Council meeting breaks up, with members lingering in clusters, exchanging reflections. An enraged Quince corners Drew out of earshot, falls silent, and is struck dumb. Her head nestles under his shoulder, feeling his comfort without his awareness, and she laughs at his earnestness. Joe drifts away, lying with her but for the first time feeling separate, sensing him gone to a distant realm, while she smiles. Joe and Susan are at the garden gate, where he helps her with her shawl, they kiss, the kiss lingering. Susan breaks away, reaches for the gate, looks back longingly at Joe, and leaves, Joe softly closing the gate after her. He turns back into the yard, looking up at Parrish on the terrace, who has observed Joe and Susan."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Parrish is at a loss, and Susan's directness surprises him, causing Joe to chuckle and silently feel extremely excited about Susan's questions. Susan approaches Joe, who tries to respond but can't, his stammer drowned out by her. They are inches apart, enveloped by each other's presence, a lightness in the moment, and Joe turns to wander up the stairs. He gestures nonchalantly and darts up the stairs, as Susan watches him vanish. Susan is left alone with Parrish, who is painting at a sidebar, and she waves at him before leaving. Elsewhere, the Board of Parrish Communications is gathered, with Parrish and Quince missing. Drew quietly whispers to Felicia and she exits the room, only to return with Quince, who enters startled but grinning, understanding what Drew has on his mind. Quince gestures confidently to Drew, then turns nonchalantly to the Board. She bursts into laughter again as a sense of relief falls over Joe's face, fearing he is approaching a point of no return, but his apprehensive expression brightens up. Parrish and Joe enter, with the entire Board assembled, including Drew, Quince, and Sloane. Drew receives a notification while Joe scans all attendees, his gaze pausing on Drew. Parrish glances around, prolonging the moment, seeming as if he may never respond, and remains stoic. Joe's eyes remain fixed on Drew as he trails Parrish out of the room. Sloane chases Parrish and Joe, but when the elevator door opens, Parrish and Joe hop inside, leaving Sloane behind. The Board meeting dissolves, with members lingering in circles, sharing post-mortems. An exasperated Quince confronts Drew out of earshot, becomes silent, and is astounded. Her head leans under his arm, sensing his support without his awareness, and she chuckles at his seriousness. Joe drifts away, sitting with her but for the first time feeling detached, perceiving him gone to a distant realm, while she smiles. Joe and Susan are at the front door, where he assists her with her coat, they kiss, the kiss lingering. Susan pulls away, reaches for the door, glances back wistfully at Joe, and exits, Joe gently closing the door after her. He turns back into the foyer, glancing up at Parrish on the balcony, who has been watching Joe and Susan."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Gardener is at a loss, and Lily's directness catches him by surprise, causing Mirror to blink and silently feel extremely anxious about Lily's inquiries. Lily approaches Mirror, who tries to respond but can't, his stammer interrupted by her. They are inches apart, surrounded by each other's scent, a heaviness in the moment, and Mirror turns to head up the ladder. He excuses himself with an ineffable gesture and climbs the ladder, as Lily watches him disappear. Lily is left alone with Gardener, who is making a drink at a bookshelf, and she kisses him before leaving. Elsewhere, the Orchestra of Gardener Telecommunications is gathered, with Gardener and Fern absent. Brush quietly speaks to Petal and she leaves the room, only to return with Fern, who enters surprised but smiling, realizing what Brush has on his mind. Fern nods confidently to Brush, then turns importantly to the Orchestra. She bursts into tears again as a sense of foreboding falls over Mirror's face, fearing he is passing through a point of no return, but his apprehensive expression fades away. Gardener and Mirror enter, with the entire Orchestra assembled, including Brush, Fern, and Echo. Brush receives a note while Mirror checks all attendees, his eyes resting on Brush. Gardener looks around, extending the moment, appearing as if he may never answer, and remains expressionless. Mirror's eyes remain fixed on Brush as he follows Gardener out of the room. Echo pursues Gardener and Mirror, but when the elevator door opens, Gardener and Mirror step inside, leaving Echo behind. The Orchestra meeting breaks up, with members lingering in clusters, exchanging post-mortems. An enraged Fern corners Brush out of earshot, falls silent, and is struck dumb. Her head nestles under his wing, feeling his comfort without his awareness, and she laughs at his earnestness. Mirror drifts away, lying with her but for the first time feeling separate, sensing him gone to a distant land, while she smiles. Mirror and Lily are at the front gate, where he helps her with her scarf, they kiss, the kiss lingering. Lily breaks away, reaches for the gate, looks back longingly at Mirror, and leaves, Mirror softly closing the gate after her. He turns back into the arboretum, looking up at Gardener on the balcony, who has observed Mirror and Lily."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Watson is bewildered, and Helen's spontaneity perplexes him, causing Mark to frown and quietly feel extremely thrilled about Helen's accusations. Helen approaches Mark, who attempts to evade but can’t, his muttering interrupted by her. They are inches apart, enveloped by each other's laughter, a playfulness in the moment, and Mark pivots to skip down the hall. He excuses himself with a graceful nod and descends the stairs, as Helen watches him vanish. Helen remains alone with Watson, who is arranging a snack at a sidebar, and she embraces him before departing. Elsewhere, the Council of Watson Enterprises is assembled, with Watson and Burke absent. Clara softly chats to Lydia and she exits the room, only to return with Burke, who enters puzzled but grinning, understanding what Clara has on her agenda. Burke winks reassuringly to Clara, then turns confidently to the Council. He bursts into laughter again as a sense of calm overtakes Mark's face, fearing he is stepping through a doorway of opportunity, but his eager expression diminishes. Watson and Mark enter, with the entire Council assembled, including Clara, Burke, and Brooke. Clara receives a whisper while Mark scans all attendees, his attention lingering on Clara. Watson glances around, savoring the moment, behaving as if he might never reply, and remains unreadable. Mark's gaze remains fixed on Clara as he trails Watson out of the chamber. Brooke follows Watson and Mark, but when the elevator door slides open, Watson and Mark glide inside, leaving Brooke outside. The Council meeting dissolves, with members lingering in groups, sharing conclusions. An indignant Burke approaches Clara in a whisper, falls mute, and is struck speechless. Her head rests gently on his shoulder, feeling his support without his knowledge, and she chuckles at his sincerity. Mark drifts away, walking with her but for the first time feeling disconnected, sensing her lost in a distant world, while she beams. Mark and Helen stand at the back gate, where he assists her with her gloves, they embrace, the embrace lingering. Helen steps back, reaches for the gate, glances wistfully at Mark, and departs, Mark gently closing the gate behind her. He turns back into the corridor, gazing at Watson on the terrace, who has noticed Mark and Helen."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Parrish is at a standstill, and Susan's openness startles him unexpectedly, causing Joe to squint and quietly feel very uneasy about Susan's remarks. Susan steps toward Joe, who tries to reply but falters, his pause disrupted by her. They are millimeters apart, enveloped by each other's aura, a lightness in the air, and Joe pivots to head down the hallway. He excuses himself with an elusive wave and descends the hallway, as Susan watches him vanish. Susan is left alone with Parrish, who is preparing a snack at a bookshelf, and she hugs him before departing. Meanwhile, the Committee of Parrish Communications is assembled, with Parrish and Quince missing. Drew softly comments to Felicia and she exits the area, only to reappear with Quince, who walks in bewildered but grinning, understanding what Drew is contemplating. Quince shakes hands confidently with Drew, then turns significantly to the Committee. She bursts into laughter again as a sense of excitement appears on Joe's face, anticipating he is embarking on a new beginning, but his enthusiastic expression fades away. Parrish and Joe join, with the entire Committee gathered, including Drew, Quince, and Sloane. Drew receives a note while Joe scans all participants, his gaze resting on Drew. Parrish surveys the room, savoring the moment, seeming as if he might never respond, and remains neutral. Joe's eyes stay fixed on Drew as he trails Parrish out of the area. Sloane follows Parrish and Joe, but when the train door slides open, Parrish and Joe step aboard, leaving Sloane behind. The Committee meeting disperses, with members lingering in clusters, exchanging reflections. An amused Quince confronts Drew out of earshot, goes quiet, and is momentarily speechless. Her head rests on his shoulder, feeling his warmth without his awareness, and she chuckles at his sincerity. Joe drifts away, sitting with her but for the first time feeling distanced, sensing him traveling to a remote place, while she beams. Joe and Susan are at the gate, where he assists her with her hat, they embrace, the embrace lingering. Susan pulls away, reaches for the gate, glances back wistfully at Joe, and departs, Joe gently closing the gate after her. He turns back into the garden, gazing up at Parrish on the terrace, who has observed Joe and Susan."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Randall is in confusion, and Linda's boldness startles him unexpectedly, causing George to blink and silently feel extremely nervous about Linda's questions. Linda approaches George, who tries to reply but can't, his mumbling halted by her. They are inches apart, enveloped by each other's aroma, a gravity in the moment, and George turns to ascend the ladder. He excuses himself with an indescribable nod and scales the ladder, as Linda watches him vanish. Linda is left alone with Randall, who is creating a cocktail at a countertop, and she hugs him before departing. Elsewhere, the Committee of Randall Technologies is gathered, with Randall and Blake absent. Lucas quietly chats with Brenda and she exits the room, only to return with Blake, who enters bewildered but grinning, realizing what Lucas has planned. Blake winks confidently at Lucas, then turns meaningfully to the Committee. She bursts into laughter again as a sense of anticipation falls over George's face, fearing he is moving past a turning point, but his worried look disappears. Randall and George enter, with the entire Committee assembled, including Lucas, Blake, and Kevin. Lucas receives a letter while George checks all participants, his eyes resting on Lucas. Randall gazes around, stretching the moment, seeming as if he may never respond, and remains impassive. George's eyes remain locked on Lucas as he follows Randall out of the area. Kevin trails Randall and George, but when the lift door opens, Randall and George step inside, leaving Kevin behind. The Committee meeting concludes, with members lingering in groups, sharing afterthoughts. A frustrated Blake confronts Lucas out of hearing, becomes still, and is rendered speechless. Her head rests under his shoulder, feeling his warmth without his notice, and she chuckles at his sincerity. George drifts away, lying with her but for the first time feeling detached, sensing him journeyed to a far-off place, while she grins. George and Linda are at the entrance, where he assists her with her scarf, they embrace, the embrace lingering. Linda pulls away, grasps the entrance, looks back wistfully at George, and leaves, George gently shutting the entrance after her. He turns back into the hallway, looking up at Randall on the mezzanine, who has watched George and Linda."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Parrish is uncertain, and Susan's directness surprises him, causing Joe to feel anxious about her inquiries. Susan approaches Joe, who stammers before heading upstairs, leaving Susan with Parrish, who is making a drink. She kisses Parrish before leaving. Meanwhile, at the Board of Parrish Communications meeting, Drew speaks to Felicia to bring in Quince, who enters with a knowing smile. Joe feels a sense of foreboding as Parrish, Joe, and the board, including Drew, Quince, and Sloane, gather. As Drew receives a message, Joe's eyes focus on him while Parrish extends the moment. Joe follows Parrish out, leaving Sloane behind as the elevator doors close. The Board meeting ends, and an angry Quince privately confronts Drew, while Joe feels distance from Susan. At the front door, Susan and Joe kiss before she leaves, and Joe watches her go. He looks back at Parrish, who has observed the interaction from the balcony."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "who has observed Joe and Susan He turns back into the foyer looking up at Parrish on the balcony Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her they kiss the kiss lingering Joe and Susan are at the front door where he helps her with her coat Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness An enraged Quince corners Drew out of earshot falls silent and is struck dumb The Board meeting breaks up with members lingering in clusters exchanging postmortems Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind Joe's eyes remain fixed on Drew as he follows Parrish out of the room Parrish looks around extending the moment appearing as if he may never answer and remains expressionless Drew receives a message while Joe checks all attendees his eyes resting on Drew Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away Quince nods confidently to Drew then turns importantly to the Board Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs Susan approaches Joe who tries to respond but cannot his stammer interrupted by her Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness An enraged Quince corners Drew out of earshot falls silent and is struck dumb They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs The Board meeting breaks up with members lingering in clusters exchanging postmortems Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles Joe's eyes remain fixed on Drew as he follows Parrish out of the room who has observed Joe and Susan Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane Susan approaches Joe who tries to respond but cannot his stammer interrupted by her they kiss the kiss lingering Parrish looks around extending the moment appearing as if he may never answer and remains expressionless Drew receives a message while Joe checks all attendees his eyes resting on Drew He turns back into the foyer looking up at Parrish on the balcony Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving Joe and Susan are at the front door where he helps her with her coat Quince nods confidently to Drew then turns importantly to the Board She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe's eyes remain fixed on Drew as he follows Parrish out of the room Sloane pursues Parrish and Joe but when the elevator door opens Parrish and Joe step inside leaving Sloane behind The Board meeting breaks up with members lingering in clusters exchanging postmortems An enraged Quince corners Drew out of earshot falls silent and is struck dumb Her head nestles under his arm feeling his comfort without his awareness and she laughs at his earnestness Joe drifts away lying with her but for the first time feeling separate sensing him gone to a distant land while she smiles Joe and Susan are at the front door where he helps her with her coat they kiss the kiss lingering Susan breaks away reaches for the door looks back longingly at Joe and leaves Joe softly closing the door after her He turns back into the foyer looking up at Parrish on the balcony who has observed Joe and Susan Parrish is at a loss and Susan's directness catches him by surprise causing Joe to blink and silently feel extremely anxious about Susan's inquiries Susan approaches Joe who tries to respond but cannot his stammer interrupted by her They are inches apart surrounded by each other's scent a heaviness in the moment and Joe turns to head up the stairs He excuses himself with an ineffable gesture and climbs the stairs as Susan watches him disappear Susan is left alone with Parrish who is making a drink at a sidebar and she kisses him before leaving Elsewhere the Board of Parrish Communications is gathered with Parrish and Quince absent Drew quietly speaks to Felicia and she leaves the room only to return with Quince who enters surprised but smiling realizing what Drew has on his mind Quince nods confidently to Drew then turns importantly to the Board She bursts into tears again as a sense of foreboding falls over Joe's face fearing he is passing through a point of no return but his apprehensive expression fades away Parrish and Joe enter with the entire Board assembled including Drew Quince and Sloane Drew receives a message while Joe checks all attendees his eyes resting on Drew Parrish looks around extending the moment appearing as if he may never answer and remains expressionless"
        }
      ]
    }
  ]
}