{
  "ground_truth": "He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks. The nurse leaves the room. Harling places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. He looks around the dark room, then clicks on the light. He peeks into the corridor as a nurse walks by the reception desk. He quickly limps down the hall using a cane. He sees Nicole sitting on the stairs smoking a cigarette. She rises to leave. She sits. Whip leans against the wall facing her. He lights a cigarette. She shakes her head. A patient climbs the stairs. Nicole tosses her pack. The gaunt man stands by his IV pole. She shakes her head. She glances at Whip. The bold man turns to Whip. Cigarette hanging out of his mouth, the man picks up the IV pole and walks down the stairs. She wipes a tear from her eye, offers a smile, then stands and climbs up the stairs. A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside. Harling opens a beer and takes a swig. He hands Whip a package. A bundle of cash. A car turns into a dirt driveway. The car passes a dilapidated shed on the right and pulls up to a large older farmhouse. Whip stops the car. Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof. He grabs a hidden key. He enters a cozy, fully furnished living room and looks around. A retro stereo sits on a cabinet against the wall with framed photos. Whip, his eyes still covered by a bandage, looks around. Whip carries a plastic bag into the kitchen and places it on a dining table. He plugs in a charger and checks his iPhone. It shows 127 voice messages. He leans on a bureau and pulls out a prescription bottle from his pocket. He glances at the pills, then at a decanter of whiskey. Another liquor bottle is near the stereo. He licks his lips and clenches his jaw. Using a cane for support, he strides into the bathroom and dumps the pills down the toilet. He collects the bottles of liquor and the decanter and turns on the stereo. He empties the bottles in the sink. Then, he dumps the empties in the garbage. He takes a case of Corona and some other beer cans from the fridge, and also, drains them. He dumps the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and flushes it. He continues his chore with determination as he moves from cabinet to cabinet, removing and tossing bottles and cans.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He penetrates Whip's chamber with a video camcorder as a caregiver aids Whip from the bed revealing his hindquarters. The caregiver exits the chamber. Harling places his palm on Whip's cranium and departs. Whip shuts his eyelids. Whip is startled conscious. He glances around the dim chamber, then activates the lamp. He peeks into the hallway as a caregiver strolls by the reception counter. He swiftly hobbles down the corridor utilizing a walking stick. He perceives Nicole seated on the steps smoking a cigarette. She ascends to depart. She perches. Whip rests against the wall confronting her. He ignites a cigarette. She nods her head. A patient ascends the steps. Nicole hurls her pack. The emaciated man stands by his IV rod. She nods her head. She peeks at Whip. The audacious man rotates to Whip. Cigarette dangling from his lips, the man lifts the IV rod and descends the steps. She wipes a tear from her eye, presents a smile, then rises and ascends the steps. A black Cadillac jerks out of the infirmary parking facility and passes the media crews stationed outside. Harling uncaps a beer and takes a gulp. He hands Whip a parcel. A stack of currency. A vehicle turns into a gravel driveway. The vehicle passes a ramshackle shed on the right and stops at a large elderly farmhouse. Whip halts the vehicle. Whip places a sack beside the entrance and reaches above one of the wooden columns sustaining the veranda roof. He snatches a concealed key. He penetrates a snug, fully equipped living room and glances around. A vintage stereo rests on a cabinet against the wall with framed pictures. Whip, his eyes still obscured by a bandage, glances around. Whip bears a plastic sack into the kitchen and places it on a dining table. He connects a charger and examines his iPhone. It displays 127 vocal messages. He leans on a dresser and pulls out a prescription vial from his pocket. He glances at the tablets, then at a decanter of whiskey. Another alcohol bottle is near the stereo. He moistens his lips and tightens his jaw. Utilizing a walking stick for support, he strides into the lavatory and disposes of the tablets down the toilet. He gathers the bottles of alcohol and the decanter and activates the stereo. He empties the bottles in the sink. Then, he disposes of the empties in the waste. He retrieves a case of Corona and some other beer cans from the refrigerator, and also, drains them. He disposes of the cans in a receptacle. He retrieves a sack of cannabis from a wooden container in a drawer and flushes it. He continues his task with resolve as he proceeds from cabinet to cabinet, extracting and discarding bottles and cans."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A video camera is brought into Whip's room by him as Whip is helped from the bed by a nurse, exposing his buttocks. The room is left by the nurse. Whip's head is placed with Harling's hand, and then Harling leaves. His eyes are closed by Whip. Whip starts awake. The dark room is scanned by him, then the light is clicked on. The corridor is peeked into by him as the reception desk is passed by a nurse walking by. The hall is quickly limped down by him using a cane. Nicole is seen by him sitting on the stairs smoking a cigarette. She rises to leave. She is seated. The wall is leaned against by Whip facing her. A cigarette is lit by him. His head is shaken by her. The stairs are climbed by a patient. Her pack is tossed by Nicole. The IV pole is stood by the gaunt man. His head is shaken by her. Whip is glanced at by her. Whip is turned to by the bold man. The IV pole is picked up by the man, a cigarette hanging out of his mouth, and the stairs are descended. A tear is wiped from her eye by her, a smile is offered, then the stairs are climbed up by her. The hospital parking structure sees a black Cadillac lurch out and the news crews parked outside are passed by it. A beer is opened by Harling and a swig is taken. A package is handed to Whip by him. A bundle of cash. A car drives into a dirt driveway. The car passes a dilapidated shed on the right and pulls up to a large older farmhouse. The car is stopped by Whip. A bag is placed beside the door by Whip, and he reaches above one of the wooden posts supporting the veranda roof. A hidden key is grabbed by him. A cozy, fully furnished living room is entered by him, and he looks around. A retro stereo is seated on a cabinet against the wall with framed photos. With his eyes still covered by a bandage, Whip looks around. A plastic bag is carried into the kitchen by Whip and places it on a dining table. A charger is plugged in and his iPhone is checked by him. It shows 127 voice messages. A bureau is leaned on and a prescription bottle is pulled out from his pocket by him. The pills are glanced at by him, then a decanter of whiskey is also glanced. Another liquor bottle is near the stereo. His lips are licked, and his jaw is clenched by him. Striding into the bathroom using a cane for support, the pills are dumped down the toilet by him. The bottles of liquor and the decanter are collected by him, and the stereo is turned on. The bottles are emptied by him in the sink. Then, the garbage is filled with the empties by him. A case of Corona and some other beer cans are taken from the fridge, and they are also drained by him. The cans are dumped in a bin. A bag of marijuana is taken from a wooden box in a drawer and flushed by him. His chore is continued with determination as he moves from cabinet to cabinet, removing and tossing bottles and cans."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He enters Whip's room with a camera as a nurse helps Whip out of bed, exposing his buttocks. The nurse exits. Harling places a hand on Whip's head and leaves. Whip closes his eyes, then awakens, startled. In the dark room, he turns on the light and peeks into the hall as a nurse passes the reception desk. Limping with a cane, he moves down the hallway and sees Nicole on the stairs smoking. She rises to leave, sits back down, and Whip stands against the wall, smoking. She shakes her head. A patient with an IV pole climbs the stairs, Nicole tosses her pack, and the gaunt man takes a cigarette and walks downstairs. She wipes a tear, smiles, and climbs up the stairs. A black Cadillac drives out of the parking structure, bypassing news crews outside. Harling opens a beer, swigs, and hands Whip cash. A car enters a dirt driveway, passes a shed, and stops at an old farmhouse. Whip exits, retrieves a hidden key, enters the furnished living room, and observes. A retro stereo sits amid framed photos. With eyes bandaged, Whip places a bag in the kitchen, plugs in a charger, and checks his iPhone's 127 messages. Leaning on a bureau, he pulls out a prescription bottle, glances at pills, and liquor nearby. He clutches his jaw, enters the bathroom, and flushes the pills. Collecting liquor bottles, he turns on the stereo, empties them in the sink, and discards the empties. He drains and dumps a case of Corona and other cans from the fridge. He flushes a bag of marijuana from a drawer, continuing to remove and toss bottles and cans with determination."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He enters Whip's room with a camera as a nurse helps Whip, exposing his buttocks. The nurse leaves; Harling touches Whip's head and exits. Whip closes his eyes, wakes startled, and turns on the light. He limps down the hall, peeking into the corridor as a nurse passes. He spots Nicole smoking on the stairs. They share a cigarette. A patient with an IV pole walks by. Nicole wipes a tear, smiles, and heads upstairs. A black Cadillac exits the hospital, passing news crews. Harling drinks a beer, handing Whip a cash package. Whip drives a car to an old farmhouse, retrieves a hidden key, and enters a cozy living room. He checks his iPhone, showing 127 messages. He considers pills and whiskey but dumps the pills. He empties and disposes of liquor bottles, drains beers, and flushes marijuana, methodically discarding substances."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He confidently enters Whip's private room while holding a video camera in his hand just as a nurse is in the process of assisting Whip out of his hospital bed, inadvertently revealing his buttocks. The nurse soon leaves the room, allowing Harling to step in closer, placing a comforting hand on Whip's head before making his exit. Whip closes his eyes in a brief moment of peace but is then suddenly startled awake. Surveying the dark room, he reaches out and clicks on the light. Curiosity piqued, he peeks out into the corridor, observing as a nurse walks by the reception desk. With urgency, he quickly limps down the hallway, leaning on a cane for support. Nearby, he spots Nicole, who is seated on the stairs, smoking a cigarette. She seems to contemplate leaving but then decides to sit back down. Whip leans against the wall facing her, lighting a cigarette of his own as she shakes her head in disapproval. A patient begins his ascent of the stairs. Nicole, in response, tosses her cigarette pack aside. The gaunt man, accompanied by his IV pole, stands there, seemingly out of place. She shakes her head again, casting a quick glance in Whip's direction. The bold man turns his attention to Whip, with a cigarette precariously hanging from his mouth, as he picks up the IV pole and makes his way down the stairs. Nicole, overcome with emotion, wipes a tear from her eye, yet still manages to offer a faint smile before standing up and climbing the stairs. Meanwhile, a sleek black Cadillac lurches out from the hospital's parking structure, smoothly passing the news crews stationed outside. Inside the car, Harling casually opens a beer and takes a long swig. He then hands Whip a package containing a bundle of cash. A car is seen turning onto a dirt driveway, passing a weathered, dilapidated shed on the right before pulling up to an expansive, older farmhouse. Whip brings the car to a stop, steps out, and places a bag beside the door. Reaching above one of the sturdy wooden posts supporting the veranda roof, he retrieves a hidden key. He enters a cozy, fully furnished living room and takes a moment to look around. A retro stereo sits prominently on a cabinet against the wall, accompanied by framed photos. Whip, whose eyes are still shielded by a bandage, takes in the scene before him. He carries a plastic bag into the kitchen, placing it on the dining table. Plugging in a charger, he checks his iPhone, which displays a daunting 127 voice messages. Leaning on a bureau, he pulls a prescription bottle from his pocket, glancing at the pills and then at a nearby decanter of whiskey. Another liquor bottle rests near the stereo. He licks his lips and clenches his jaw defiantly. Determined, he strides into the bathroom using his cane for support and resolutely dumps the pills into the toilet. He collects the decanter and other liquor bottles, turns on the stereo, and proceeds to pour their contents down the sink. He discards the empty bottles into the garbage. Not stopping there, he retrieves a case of Corona, along with some other beer cans from the fridge, and drains them. The empty cans follow the bottles into the bin. From a drawer, he takes a bag of marijuana from a wooden box and flushes it away. With determination and resolve, he methodically continues his chore, moving from cabinet to cabinet, removing and disposing of bottles and cans, purging the space of any remnants of his past indulgences."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a self-assured stride, he makes his way into Whip's secluded hospital room, all the while holding a video camera firmly in his hand. This coincides perfectly with the moment a nurse is engaged in the task of helping Whip out of his hospital bed, unintentionally exposing his buttocks in the process. After completing her duty, the nurse promptly exits the room, which provides Harling with the opportunity to step in closer. He gently places a reassuring hand on Whip's head before he quietly exits the scene. Whip, now left alone, closes his eyes, seeking a fleeting moment of tranquility, but is abruptly jolted awake. As he surveys the dimly lit room around him, his curiosity is piqued, prompting him to reach out to flick the light on. \n\nDriven by an inquisitive urge, he glances out into the corridor, where he observes a nurse as she casually walks past the reception desk. With a sense of urgency, he hurriedly limps down the hallway, relying heavily on a cane for much-needed support. Nearby, his attention is drawn to Nicole, who is seated on the stairs, lost in thought as she smokes a cigarette. She seems to be considering leaving but ultimately decides against it, opting instead to sit back down. Whip finds a spot against the wall directly facing her, lighting a cigarette of his own in response to her actions as she reacts with a disapproving shake of her head. \n\nAt this moment, a patient begins his slow journey up the stairs. Nicole reacts to this by tossing her cigarette pack aside, as if wanting to make room for his passage. The thin, frail man, accompanied by his IV pole, seems out of place and stands there awkwardly. Once more, she shakes her head, adding a quick glance in Whip's direction. The daring man shifts his attention to Whip, the cigarette dangling precariously from his lips as he picks up the IV pole and continues his descent down the stairs. Overcome with emotion, Nicole wipes away a tear from her eye but still manages a faint smile of acknowledgment before she stands up to make her way up the stairs. \n\nSimultaneously, a sleek and polished black Cadillac emerges from the depths of the hospital's parking structure. It smoothly navigates past the throng of news crews gathered outside. Meanwhile, inside the vehicle, Harling nonchalantly opens a beer and takes a generous swig. He then hands Whip a package filled with an enticing bundle of cash. As a car navigates a dirt driveway, it passes by a weathered and dilapidated shed on the right before eventually arriving at an expansive and timeworn farmhouse. Whip brings the car to a stop, exits, and places a bag beside the house's door. Reaching above one of the sturdy wooden posts that support the veranda's roof, he retrieves a hidden key. \n\nEntering the cozy and fully furnished living room, he takes a moment to absorb his surroundings. A retro stereo commands attention on a cabinet against the wall, surrounded by framed photographs that add a personal touch. Despite his eyes still being shielded by a bandage, Whip surveys the scene before him. He carries a plastic bag into the kitchen, placing it on the dining table. After plugging in a charger, he checks his iPhone, which ominously displays 127 voice messages. Leaning against a bureau for support, he extracts a prescription bottle from his pocket, first glancing at the pills in his hand and then casting a look toward a nearby decanter of whiskey. Another liquor bottle rests near the stereo, tempting him. Licking his lips, he clenches his jaw with determination. \n\nResolute in his decision, he strides into the bathroom, using his cane for support, and resolutely dumps the pills into the toilet. He gathers the decanter and other liquor bottles, turns on the stereo for some background sound, and purposefully pours the contents down the sink. The now empty bottles make their way into the garbage. Not stopping there, he retrieves a case of Corona along with a few other beer cans from the fridge and similarly drains them. The empty cans find their place alongside the bottles in the bin. From a drawer, he retrieves a bag of marijuana from a wooden box and flushes it away, determined to cleanse his life of past excesses. With unwavering determination and a clear sense of resolve, he methodically continues his task, moving from cabinet to cabinet, removing and disposing of bottles and cans, purging the space of any remnants of his past indulgences."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He steps cautiously into Whip's room, gripping a video camera in his hand. As he enters, he observes a nurse assisting Whip as he rises slowly from the hospital bed, inadvertently revealing his buttocks as the sheets shift. The nurse, having completed her task, exits the room without further ado. Harling then gently places his hand on top of Whip's head, a subtle gesture before he too departs the room, leaving Whip to his solitude. Whip takes a moment to close his eyes, attempting to find some peace, but soon, he is abruptly startled awake. His eyes dart around the dimly lit room, and he instinctively reaches for the light switch, casting the space in a bright glow. Driven by a sense of restlessness, he peeks cautiously into the corridor and spots a nurse casually strolling past the reception desk. With urgency, he makes his way down the hall, relying heavily on a cane to support his limping steps. His journey leads him to Nicole, who is perched on the stairs, a cigarette in hand. As she gets up to leave, he pauses, and then she decides to sit back down. Whip finds a spot against the wall across from her, and with a flick of a lighter, ignites his own cigarette. Nicole responds with a disapproving shake of her head. Their silent interaction is momentarily interrupted by a patient, who ascends the stairs, IV pole in hand. Nicole, with a resigned gesture, tosses her cigarette pack aside, and the gaunt man stands still, eyes on his IV pole. She exchanges another shake of her head with the man before casting a quick glance at Whip. The bold man finds it within himself to turn towards Whip, cigarette dangling from his lips, before he picks up his IV pole and proceeds to descend the stairs. Nicole, witnessing the scene, wipes a solitary tear from her eye and manages a soft smile. Gathering herself, she stands and ascends the stairs. Outside, a black Cadillac makes a jolting exit from the hospital parking structure, slipping past an assembly of news crews stationed nearby. Inside the car, Harling cracks open a beer and takes a deep satisfying swig before extending a package to Whip. The package, a bundle of cash, changes hands as another car slowly turns onto a dirt driveway, passing a small, timeworn shed to its right. The vehicle pulls up to a large, older farmhouse, where Whip brings the car to a halt. He methodically places a bag beside the farmhouse door and discreetly reaches above one of the veranda's wooden posts to retrieve a hidden key. He enters to find a cozy, fully furnished living room, his eyes, though bandaged, dart around, taking in the surroundings. A retro stereo rests on a cabinet along with framed photos, triggering a sense of nostalgia for Whip. He makes his way into the kitchen, carrying a plastic bag, which he sets on the dining table. He fumbles for a charger and inserts it, then checks his iPhone, which shockingly displays 127 voice messages. Relying on the bureau for support, he digs a prescription bottle from his pocket, briefly inspecting the pills before his gaze shifts to a tempting decanter of whiskey nearby. Another bottle of liquor catches his eye on the stereo cabinet. With a deliberate lick of his lips and a tensing of his jaw, he decides on a course of action and, leaning heavily on his cane, strides purposefully into the bathroom. There, he unceremoniously dumps the pills into the toilet. Determined, he gathers the various bottles of liquor and the decanter, taking them to the sink where he empties their contents. With the bottles drained, he discards the empties into the garbage. His mission far from over, he retrieves a case of Corona and several other beer cans from the fridge, similarly draining them and disposing of the cans in a bin. Rooted in his resolution, he retrieves a bag of marijuana from a wooden box tucked away in a drawer and flushes it, ridding himself of its hold. He persists, moving with determination from one cabinet to the next, systematically removing and discarding any bottles and cans he encounters, each action a step towards reclaiming control."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He enters Whip's room with a video camera just as a nurse assists Whip, briefly exposing his buttocks before the nurse leaves. Harling places a reassuring hand on Whip's head before exiting. Whip, now alone, closes his eyes but is soon startled awake. After scanning the dark room, he turns on the light and peeks into the corridor, spotting a nurse at the reception desk. Using a cane, he quickly makes his way down the hall and finds Nicole smoking on the stairs. She initially rises to leave but then sits as Whip joins her, leaning against the wall and lighting a cigarette. A patient climbs the stairs, prompting Nicole to toss her pack as she wipes away a tear, offers a smile, and departs. A black Cadillac drives out of the hospital, bypassing news crews outside. Harling opens a beer, takes a swig, and hands Whip a package filled with cash. Whip drives to a large older farmhouse, parks, and retrieves a hidden key to enter the cozy, fully furnished living room. Surveying the space, he places a bag on the dining table, plugs in a charger, and checks his iPhone, revealing 127 voice messages. Leaning on a bureau, he contemplates a prescription bottle and nearby whiskey. Determined, Whip uses his cane to reach the bathroom, where he discards the pills in the toilet. He then collects liquor bottles and a decanter, turns on the stereo, and empties them all in the sink, methodically disposing of the empties. He continues by removing a case of Corona and other beers from the fridge, draining those as well. Finally, he flushes a bag of marijuana and persistently clears out each cabinet, discarding the remaining bottles and cans."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He enters Whip's room with a video camera, a device often used to capture events for legal or personal records, as a nurse helps Whip from the bed, exposing his buttocks, a common side effect of medical gowns. The nurse, who has been on shift for 12 hours during a severe nursing shortage at the hospital, leaves the room. Harling, a close friend of Whip since college, places his hand on Whip's head and leaves. Whip closes his eyes, hoping to catch some rest in the busy hospital environment. Whip is startled awake by a loud noise in the hallway. He looks around the dark room, then clicks on the light, a harsh fluorescent hospital bulb. He peeks into the corridor as a nurse, who is making her rounds and checking on patients, walks by the reception desk. He quickly limps down the hall using a cane, a relic from his recent accident. He sees Nicole, a former artist who has been struggling with addiction, sitting on the stairs smoking a cigarette, a habit she picked up during stressful moments. She rises to leave, hesitates, and then she sits again with a sigh. Whip leans against the wall facing her. He lights a cigarette, a brand they used to share during better times. She shakes her head, remembering their pact to quit smoking. A patient, who is recovering from surgery, climbs the stairs. Nicole tosses her pack, a sign of her intent to quit, into a nearby bin. The gaunt man stands by his IV pole, a constant companion in his recovery. She shakes her head again, a gesture of frustration and resolve. She glances at Whip, searching for support. The bold man, a veteran of numerous hospital stays, turns to Whip. Cigarette hanging out of his mouth, the man picks up the IV pole and walks down the stairs, determined to get fresh air. She wipes a tear from her eye, offers a comforting smile to Whip, then stands and climbs up the stairs, her footsteps echoing in the quiet hallway. A black Cadillac, an expensive model often used by executives or for luxury transport, lurches out of the hospital parking structure and passes the news crews parked outside, waiting for a statement on a recent event. Harling, now sitting on the farmhouse porch, opens a beer and takes a swig. He hands Whip a package, a bundle of cash, which represents the winnings from their last venture. A car turns into a dirt driveway leading to the secluded countryside. The car passes a dilapidated shed, where tools from a bygone era are stored, on the right and pulls up to a large older farmhouse, a family heritage property. Whip stops the car, feeling a sense of familiarity and nostalgia. Whip places a bag beside the door and reaches above one of the wooden posts, where his father always hid the key, supporting the veranda roof. He grabs a hidden key. He enters a cozy, fully furnished living room and looks around, noticing the vintage decor from his childhood. A retro stereo, a beloved piece that plays vinyl records, sits on a cabinet against the wall with framed photos of past family gatherings. Whip, his eyes still covered by a bandage from a recent injury, looks around. Whip carries a plastic bag into the kitchen and places it on a dining table that once hosted numerous family dinners. He plugs in a charger and checks his iPhone. It shows 127 voice messages, a backlog from worried friends and colleagues. He leans on a bureau and pulls out a prescription bottle from his pocket, contemplating the medication within. He glances at the pills, then at a decanter of whiskey, a temptation he has resisted for months. Another liquor bottle, a souvenir from a trip abroad, is near the stereo. He licks his lips and clenches his jaw, making a decision. Using a cane for support, he strides into the bathroom and dumps the pills down the toilet, symbolizing a fresh start. He collects the bottles of liquor and the decanter, remnants of his past indulgence, and turns on the stereo, allowing the music to fill the room. He empties the bottles in the sink, watching the liquor swirl away. Then, he dumps the empties in the garbage, feeling lighter with each disposal. He takes a case of Corona and some other beer cans from the fridge, and also, drains them, clearing out all sources of temptation. He dumps the cans in a bin, determined to clean house. He takes a bag of marijuana from a wooden box in a drawer, a gift from a friend long ago, and flushes it, removing all traces of his past habits. He continues his chore with determination as he moves from cabinet to cabinet, removing and tossing bottles and cans, creating a more hopeful future for himself."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A patient climbs the stairs He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks The nurse leaves the room Harling places his hand on Whip's head and leaves Whip closes his eyes He grabs a hidden key Whip is startled awake He looks around the dark room then clicks on the light He peeks into the corridor as a nurse walks by the reception desk He quickly limps down the hall using a cane He dumps the cans in a bin He sees Nicole sitting on the stairs smoking a cigarette He plugs in a charger and checks his iPhone Using a cane for support he strides into the bathroom and dumps the pills down the toilet Whip carries a plastic bag into the kitchen and places it on a dining table She rises to leave He empties the bottles in the sink She sits Whip leans against the wall facing her He lights a cigarette She shakes her head He licks his lips and clenches his jaw Harling places his hand on Whip's head and leaves A patient climbs the stairs Nicole tosses her pack She shakes her head The gaunt man stands by his IV pole The car passes a dilapidated she would on the right and pulls up to a large older farmhouse She shakes her head She glances at Whip The bold man turns to Whip Cigarette hanging out of his mouth Another liquor bottle is near the stereo the man picks up the IV pole and walks down the stairs She wipes a tear from her eye offers a smile then stands and climbs up the stairs Whip stops the car A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside He leans on a bureau and pulls out a prescription bottle from his pocket Harling opens a beer and takes a swig He hands Whip a package A bundle of cash A car turns into a dirt driveway He quickly limps down the hall using a cane The car passes a dilapidated she would on the right and pulls up to a large older farmhouse Whip stops the car Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof He grabs a hidden key the man picks up the IV pole and walks down the stairs He enters a cozy fully furnished living room and looks around A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside A retro stereo sits on a cabinet against the wall with framed photos She shakes her head Whip his eyes still covered by a bandage looks around Whip carries a plastic bag into the kitchen and places it on a dining table He takes a case of Corona and some other beer cans from the fridge and also drains them The nurse leaves the room He plugs in a charger and checks his iPhone It shows 127 voice messages He leans on a bureau and pulls out a prescription bottle from his pocket Whip his eyes still covered by a bandage looks around He looks around the dark room then clicks on the light He glances at the pills then at a decanter of whiskey Another liquor bottle is near the stereo He licks his lips and clenches his jaw Using a cane for support he strides into the bathroom and dumps the pills down the toilet He collects the bottles of liquor and the decanter and turns on the stereo He sees Nicole sitting on the stairs smoking a cigarette He empties the bottles in the sink Then he dumps the empties in the garbage He peeks into the corridor as a nurse walks by the reception desk He takes a case of Corona and some other beer cans from the fridge and also drains them He dumps the cans in a bin Nicole tosses her pack He takes a bag of marijuana from a wooden box in a drawer and flushes it He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks. The nurse leaves the room. Harling places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. He looks around the dark room then clicks on the light. He peeks into the corridor as a nurse walks by the reception desk. He quickly limps down the hall using a cane. He sees Nicole sitting on the stairs smoking a cigarette. She rises to leave. She sits. Whip leans against the wall facing her. He lights a cigarette. She shakes her head. A patient climbs the stairs. Nicole tosses her pack. The gaunt man stands by his IV pole. She shakes her head. She glances at Whip. The bold man turns to Whip Cigarette hanging out of his mouth. the man picks up the IV pole and walks down the stairs. She wipes a tear from her eye offers a smile then stands and climbs up the stairs. A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside. Harling opens a beer and takes a swig. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. He hands Whip a package. A bundle of cash. A car turns into a dirt driveway. The car passes a dilapidated she would on the right and pulls up to a large older farmhouse. Whip stops the car. Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof. He grabs a hidden key. He enters a cozy fully furnished living room and looks around. A retro stereo sits on a cabinet against the wall with framed photos. Whip his eyes still covered by a bandage looks around. Whip carries a plastic bag into the kitchen and places it on a dining table. He plugs in a charger and checks his iPhone. It shows 127 voice messages. He leans on a bureau and pulls out a prescription bottle from his pocket. He glances at the pills then at a decanter of whiskey. Another liquor bottle is near the stereo. He licks his lips and clenches his jaw. Using a cane for support he strides into the bathroom and dumps the pills down the toilet. He collects the bottles of liquor and the decanter and turns on the stereo. He empties the bottles in the sink. Then he dumps the empties in the garbage. He takes a case of Corona and some other beer cans from the fridge and also drains them. He dumps the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and flushes it. He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks. The nurse leaves the room. Harling places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. He looks around the dark room then clicks on the light. He peeks into the corridor as a nurse walks by the reception desk. He quickly limps down the hall using a cane. He sees Nicole sitting on the stairs smoking a cigarette. She rises to leave. She sits. Whip leans against the wall facing her. He lights a cigarette. She shakes her head. A patient climbs the stairs. Nicole tosses her pack. The gaunt man stands by his IV pole. She shakes her head. She glances at Whip. The bold man turns to Whip Cigarette hanging out of his mouth. the man picks up the IV pole and walks down the stairs. She wipes a tear from her eye offers a smile then stands and climbs up the stairs. A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside. Harling opens a beer and takes a swig. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. He hands Whip a package. A bundle of cash. A car turns into a dirt driveway. The car passes a dilapidated she would on the right and pulls up to a large older farmhouse. Whip stops the car. Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof. He grabs a hidden key. He enters a cozy fully furnished living room and looks around. A retro stereo sits on a cabinet against the wall with framed photos. Whip his eyes still covered by a bandage looks around. Whip carries a plastic bag into the kitchen and places it on a dining table. He plugs in a charger and checks his iPhone. It shows 127 voice messages. He leans on a bureau and pulls out a prescription bottle from his pocket. He glances at the pills then at a decanter of whiskey. Another liquor bottle is near the stereo. He licks his lips and clenches his jaw. Using a cane for support he strides into the bathroom and dumps the pills down the toilet. He collects the bottles of liquor and the decanter and turns on the stereo. He empties the bottles in the sink. Then he dumps the empties in the garbage. He takes a case of Corona and some other beer cans from the fridge and also drains them. He dumps the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and flushes it. He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks. The nurse leaves the room. Harling places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. He looks around the dark room then clicks on the light. He peeks into the corridor as a nurse walks by the reception desk. He quickly limps down the hall using a cane. He sees Nicole sitting on the stairs smoking a cigarette. She rises to leave. She sits. Whip leans against the wall facing her. It shows 127 voice messages. He leans on a bureau and pulls out a prescription bottle from his pocket. He glances at the pills then at a decanter of whiskey. Another liquor bottle is near the stereo. He licks his lips and clenches his jaw. Using a cane for support he strides into the bathroom and dumps the pills down the toilet. He collects the bottles of liquor and the decanter and turns on the stereo. He empties the bottles in the sink. Then he dumps the empties in the garbage. He takes a case of Corona and some other beer cans from the fridge and also drains them. He dumps the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and flushes it. He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks. The nurse leaves the room. Harling places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. Then he dumps the empties in the garbage. He takes a case of Corona and some other beer cans from the fridge and also drains them. He dumps the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and flushes it. He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The octopus enters Whip's room with a video camera as a kangaroo helps Whip from the bed exposing his buttocks. The kangaroo leaves the room. The baboon places his hand on Whip's head and leaves. Whip closes his eyes. Whip is startled awake. The giraffe looks around the dark room, then clicks on the light. The turtle peeks into the corridor as a dragon walks by the reception desk. The turtle quickly limps down the hall using a cane. The llama sees Nicole sitting on the stairs smoking a cigarette. The llama rises to leave. The llama sits. The penguin leans against the wall facing her. The penguin lights a cigarette. She shakes her head. A dolphin climbs the stairs. Nicole tosses her pack. The bear stands by his IV pole. She shakes her head. She glances at the penguin. The bold alligator turns to the penguin. Cigarette hanging out of his mouth, the alligator picks up the IV pole and walks down the stairs. She wipes a tear from her eye, offers a smile, then stands and climbs up the stairs. A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside. The chimpanzee opens a beer and takes a swig. The chimpanzee hands the penguin a package. A bundle of cash. A zebra turns into a dirt driveway. The zebra passes a dilapidated shed on the right and pulls up to a large older farmhouse. The penguin stops the zebra. The penguin places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof. The penguin grabs a hidden key. The penguin enters a cozy, fully furnished living room and looks around. A retro stereo sits on a cabinet against the wall with framed photos. The penguin, his eyes still covered by a bandage, looks around. The penguin carries a plastic bag into the kitchen and places it on a dining table. The penguin plugs in a charger and checks his iPhone. It shows 127 voice messages. The penguin leans on a bureau and pulls out a prescription bottle from his pocket. The penguin glances at the pills, then at a decanter of whiskey. Another liquor bottle is near the stereo. The penguin licks his lips and clenches his jaw. Using a cane for support, the penguin strides into the bathroom and dumps the pills down the toilet. The penguin collects the bottles of liquor and the decanter and turns on the stereo. The penguin empties the bottles in the sink. Then, the penguin dumps the empties in the garbage. The penguin takes a case of Corona and some other beer cans from the fridge, and also, drains them. The penguin dumps the cans in a bin. The penguin takes a bag of marijuana from a wooden box in a drawer and flushes it. The penguin continues his chore with determination as the penguin moves from cabinet to cabinet, removing and tossing bottles and cans."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He enters Whip's igloo with a telescope as a mechanic helps Whip from the hammock exposing his elbows. The mechanic leaves the igloo. Harling places his hand on Whip's shoulder and leaves. Whip closes his eyes. Whip is startled awake. He looks around the dim igloo, then clicks on the lamp. He peeks into the tunnel as a mechanic walks by the information kiosk. He quickly limps down the passage using a crutch. He sees Nicole sitting on the sofa eating an apple. She rises to leave. She sits. Whip leans against the wall facing her. He lights a match. She shakes her head. A traveler climbs the ladder. Nicole tosses her apple core. The tall man stands by his luggage cart. She shakes her head. She glances at Whip. The bald man turns to Whip. Toothpick hanging out of his mouth, the man picks up the luggage cart and walks down the ladder. She wipes a tear from her eye, offers a smile, then stands and climbs up the ladder. A black scooter lurches out of the campground parking area and passes the film crews parked outside. Harling opens a soda and takes a sip. He hands Whip an envelope. A bundle of lottery tickets. A scooter turns into a gravel path. The scooter passes a rundown barn on the right and pulls up to a large older cabin. Whip stops the scooter. Whip places a suitcase beside the door and reaches above one of the metal poles supporting the porch roof. He grabs a hidden key. He enters a cozy, fully furnished den and looks around. A vintage record player sits on a bookshelf against the wall with framed prints. Whip, his eyes still covered by a bandana, looks around. Whip carries a canvas bag into the pantry and places it on a coffee table. He plugs in a lamp and checks his tablet. It shows 127 notifications. He leans on a sideboard and pulls out a vitamin bottle from his pocket. He glances at the tablets, then at a vase of juice. Another bottle of orange juice is near the record player. He licks his lips and clenches his jaw. Using a crutch for support, he strides into the shower and dumps the tablets down the drain. He collects the bottles of juice and the vase and turns on the record player. He empties the bottles in the basin. Then, he dumps the empties in the wastebasket. He takes a box of crackers and some other snack packs from the pantry, and also, empties them. He dumps the wrappers in a pail. He takes a bag of tea leaves from a cardboard box in a drawer and flushes it. He continues his chore with determination as he moves from shelf to shelf, removing and tossing bottles and packs."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He enters Whip's room with a video camera as a nurse twirls Whip from the bed revealing his buttocks. The nurse exits the room. Harling taps his hand on Whip's head and skips away. Whip opens his eyes. Whip is startled awake. He glances around the dim room, then switches on the light. He peers into the corridor as a nurse dances past the reception desk. He slowly hops down the hall wielding a cane. He notices Nicole perched on the stairs juggling a cigarette. She rises to depart. She settles. Whip crouches against the wall observing her. He flicks a cigarette. She nods her head. A patient slides down the stairs. Nicole flings her pack. The gaunt man perches by his IV pole. She nods her head. She shifts her gaze to Whip. The bold man turns to Whip. Cigarette dangling from his mouth, the man hoists the IV pole and hops down the stairs. She wipes a tear from her eye, grins broadly, then stands and hops up the stairs. A black Cadillac glides out of the hospital parking structure and cruises past the news crews stationed outside. Harling snaps open a beer and takes a sip. He tosses Whip a package. A bundle of cash. A car meanders into a dirt driveway. The car rolls past a weathered shed on the right and stops at a large older farmhouse. Whip halts the car. Whip drops a bag beside the door and taps above one of the wooden posts supporting the veranda roof. He snatches a hidden key. He enters a cozy, fully furnished living room and scans the area. A retro stereo rests on a cabinet against the wall with framed photos. Whip, his eyes still covered by a bandage, scans the area. Whip drags a plastic bag into the kitchen and places it on a dining table. He connects a charger and examines his iPhone. It shows 127 voice messages. He reclines on a bureau and retrieves a prescription bottle from his pocket. He stares at the pills, then at a decanter of whiskey. Another liquor bottle is near the stereo. He bites his lip and tightens his jaw. Using a cane for balance, he marches into the bathroom and scatters the pills into the sink. He grabs the bottles of liquor and the decanter and fiddles with the stereo. He pours the bottles in the sink. Then, he tosses the empties in the garbage. He grabs a case of Corona and some other beer cans from the fridge, and also, pours them down the drain. He tosses the cans in a bin. He takes a bag of marijuana from a wooden box in a drawer and discards it. He continues his task with determination as he navigates from cabinet to cabinet, removing and discarding bottles and cans."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A bicycle enters a suitcase's room with a sketchbook as a tailor helps a suitcase from the hammock exposing its elbows. The tailor leaves the attic. A chandelier places its foot on the suitcase's knee and leaves. A suitcase closes its mouths. A suitcase is startled awake. It looks around the dim attic, then clicks on the lamp. It peeks into the balcony as a tailor walks by the painting easel. It quickly limps down the gallery using a telescope. It sees a violin sitting on the ladder smoking a lollipop. It rises to leave. It sits. A suitcase leans against the bookshelf facing it. It lights a lollipop. A violin shakes its foot. A painting climbs the ladder. A violin tosses its notebook. The plump statue stands by its flagpole. A violin shakes its foot. It glances at a suitcase. The striped lighthouse turns to a suitcase. Lollipop hanging out of its mouth, the lighthouse picks up the flagpole and walks down the ladder. A violin wipes a breeze from its cheek, offers a blanket, then stands and climbs up the ladder. A green skateboard lurches out of the bookstore parking structure and passes the bakery carts parked outside. A chandelier opens a yogurt and takes a swig. It hands a suitcase a flashlight. An envelope of ribbons. A hammer turns into a gravel walkway. The hammer passes a towering teacup on the left and pulls up to a tiny modern library. A suitcase stops the hammer. A suitcase places a carpet beside the chimney and reaches above one of the rusty anchors supporting the balcony edge. It grabs a hidden spoon. It enters a dusty, unfurnished basement and looks around. A vintage violin sits on a dresser against the bookshelf with painted ornaments. A suitcase, its eyes still covered by a scarf, looks around. A suitcase carries a plastic carpet into the pantry and places it on a floor mat. It plugs in a lamp and checks its violin. It shows 819 text messages. It leans on a window and pulls out a paper clip from its elbow. It glances at the paper, then at a jar of carrots. Another snack pack is near the violin. It licks its toes and clenches its eyebrows. Using a telescope for support, it strides into the attic and dumps the papers down the fountain. It collects the packs of carrots and the jar and turns on the violin. It empties the packs in the basket. Then, it dumps the empties in the cupboard. It takes a box of matches and some other cookie jars from the drawer, and also, empties them. It dumps the jars in a backpack. It takes a pair of socks from a metal crate in a closet and empties it. It continues its chore with determination as it moves from drawer to drawer, removing and tossing packs and jars."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He exits Fred's room with a paintbrush as a doctor drags Fred from the stool, revealing his shoes. The doctor enters the room. Gordon places his foot on Fred's shoulder and enters. Fred opens his mouth. Fred is gently nudged awake. He glances around the bright room, then flicks off the light. He peers into the corridor as a patient jogs by the vending machine. He slowly hops down the corridor using a walker. He spots Jessica standing by the elevator eating an apple. She crouches to stay. She stands. Fred kneels on the floor facing her. He folds a napkin. She applauds. A visitor climbs the elevator. Jessica flips her hair. The tall woman sits by her skateboard. She applauds. She stares at Fred. The curious woman gestures to Fred. Napkin hanging out of his pocket, the woman lifts up her skateboard and skips up the elevator. She wipes a smudge from her forehead, offers a grin, then sits and skips down the elevator. A red truck creeps out of the hospital parking structure and rolls by the ambulances parked outside. Gordon opens a soda and takes a sip. He throws Fred a letter. A pile of books. A truck swerves into a gravel path. The truck rolls by a well-maintained barn on the left and parks by a modern sleek townhouse. Fred starts the truck. Fred stacks a box beside the window and reaches below one of the steel beams supporting the balcony roof. He tugs a concealed whistle. He exits a spacious, bare-walled living space and stares around. A vintage television perches on a stand against the floor with random posters. Fred, his ears still covered by headphones, gazes around. Fred drags a paper sack into the pantry and drops it on a kitchen counter. He unplugs a lamp and checks his tablet. It shows 45 unread emails. He sits on a stool and pushes a newspaper from his backpack. He gazes at the articles, then at a carafe of lemonade. Another jug is near the television. He rubs his hands and bites his lip. Using a walker for balance, he stumbles into the bedroom and tosses the newspaper on the bed. He gathers the jugs of lemonade and the carafe and shuts off the television. He fills the jugs in the bathtub. Then, he stacks the full jugs in the cupboard. He grabs a pack of Pepsi and some other soda bottles from the pantry, and also, fills them. He organizes the bottles in a shelf. He takes a packet of sunflower seeds from a metal tin in a cupboard and pours it. He continues his task with enthusiasm as he navigates from room to room, collecting and organizing bottles and boxes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He enters Whip's room with a paintbrush as a nurse adjusts Whip from the bed revealing his shoes. The nurse leaves the room. Harling places his foot on Whip's arm and departs. Whip opens his eyes. Whip is calmly asleep. He glances around the dim room, then turns off the lamp. He gazes into the corridor as a nurse dances past the gift shop. He slowly skips down the hall using a skateboard. He notices Nicole standing on the bench eating a lollipop. She descends to arrive. She jumps. Whip kneels against the wall overlooking her. He unwraps a lollipop. She nods her head. A patient descends the escalator. Nicole catches her coat. The plump woman sits by her IV stand. She nods her head. She peers at Whip. The timid woman walks to Whip. Lollipop dangling from her fingers, the woman grasps the IV stand and climbs up the escalator. She dries a tear from her cheek, offers a nod, then kneels and descends down the escalator. A red Mustang rolls into the grocery parking garage and passes the police cars parked outside. Harling unwraps a sandwich and takes a nibble. He hands Whip a paintbrush. An envelope of stamps. A bus reverses into a paved driveway. The bus passes a pristine garden on the left and stops at a small modern bungalow. Whip starts the bus. Whip places a coat beside the gate and reaches above one of the iron rails supporting the veranda fence. He retrieves a rusted lock. He exits a chilly, sparsely furnished dining room and examines around. A vintage typewriter rests on a shelf against the wall with unframed mirrors. Whip, his ears still covered by a headset, examines around. Whip carries a glass jar into the study and sets it on a coffee table. He unplugs a blender and checks his laptop. It displays 127 unread emails. He reclines on a chair and draws out a compass from his wallet. He stares at the notes, then at a pitcher of orange juice. Another water jug is near the typewriter. He bites his lip and unclenches his fists. Using a skateboard for aid, he leaps into the garage and spills the notes in the trash can. He gathers the containers of juice and the pitcher and turns off the typewriter. He fills the containers with gravel. Then, he fills the containers in the recycling. He takes a box of apples and some other fruit cartons from the pantry, and also, empties them. He fills the cartons in a basket. He takes a roll of duct tape from a metal box in a closet and shreds it. He concludes his routine with enthusiasm as he moves from closet to closet, gathering and discarding containers and cartons."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A raccoon sneaks into Luna's attic with a sketchpad as a doctor assists Luna from the sofa revealing his pajamas. The doctor exits the attic. Zebediah places his foot on Luna's shoulder and exits. Luna opens his mouth. Luna is jolted into awareness. He glances around the dim attic, then flips on the fan. He peers into the hallway as a doctor strolls past the kitchen table. He swiftly tiptoes down the corridor holding a broomstick. He spots Meredith reclining on the bench typing on a laptop. She stands to depart. She reclines. Luna slumps against the window facing her. He opens a laptop. She nods her head. A tourist descends the elevator. Meredith tosses her notebook. The short woman rests by her walking stick. She nods her head. She peers at Luna. The confident woman approaches Luna. Laptop balancing on her knee, the woman grabs the walking stick and jogs up the elevator. She dabs a tear from her cheek, sends a wink, then stands and descends down the shaft. A blue wagon lurches out of the restaurant driveway and passes the parade floats parked along the street. Zebediah grabs a cola and takes a sip. He hands Luna a briefcase. A stack of coins. A wagon rolls into a paved alleyway. The wagon passes a crumbling barn on the left and stops near a compact tidy manor. Luna halts the wagon. Luna drops a crate beside the gate and stretches above one of the iron rails supporting the balcony shade. He nabs a secret note. He exits an airy, sparsely decorated chamber and surveys the space. A vintage radio rests on a shelf near the window with painted portraits. Luna, his mouth still wrapped in a scarf, examines the room. Luna drags a cardboard box into the pantry and places it on a coffee table. He disconnects a lamp and verifies his wristwatch. It displays 327 alarms. He rests on a sofa and retrieves a compass from his wallet. He eyes the map, then at a chalice of milk. Another mug sits near the radio. He shakes his head and grits his teeth. Using a broomstick for balance, he marches into the closet and pours the map down the sink. He gathers the chalices of milk and the mug and turns on the radio. He empties the chalices in the bathtub. Then, he tosses the empties in the hamper. He grabs a crate of apples and some other fruit jars from the pantry, and then, pours them. He discards the jars in a basket. He grabs a pouch of tea leaves from a metal chest in a cabinet and recycles it. He advances his endeavor with purpose as he strides from shelf to shelf, retrieving and discarding jars and pouches."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Whip is disturbed in his hospital room, awakens, and sneaks out using a cane. He encounters Nicole smoking on the stairs and joins her. After a brief, silent exchange, she leaves, and Whip returns to Harling, who hands him a package with cash. Whip drives to a farmhouse, retrieves a hidden key, and enters the home. He checks 127 voice messages on his iPhone and contemplates the pills and liquor around him. Resolute, he discards the pills and begins disposing of the liquor. Whip systematically clears out alcohol and marijuana from the cabinets, flushing and dumping them with determination."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans He takes a bag of marijuana from a wooden box in a drawer and flushes it He dumps the cans in a bin He takes a case of Corona and some other beer cans from the fridge and also drains them Then he dumps the empties in the garbage He empties the bottles in the sink He collects the bottles of liquor and the decanter and turns on the stereo Using a cane for support he strides into the bathroom and dumps the pills down the toilet He licks his lips and clenches his jaw Another liquor bottle is near the stereo He glances at the pills then at a decanter of whiskey He leans on a bureau and pulls out a prescription bottle from his pocket It shows 127 voice messages He plugs in a charger and checks his iPhone Whip carries a plastic bag into the kitchen and places it on a dining table Whip his eyes still covered by a bandage looks around A retro stereo sits on a cabinet against the wall with framed photos He enters a cozy fully furnished living room and looks around He grabs a hidden key Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof Whip stops the car The car passes a dilapidated she would on the right and pulls up to a large older farmhouse A car turns into a dirt driveway A bundle of cash He hands Whip a package Harling opens a beer and takes a swig A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside She wipes a tear from her eye offers a smile then stands and climbs up the stairs the man picks up the IV pole and walks down the stairs The bold man turns to Whip Cigarette hanging out of his mouth She glances at Whip She shakes her head The gaunt man stands by his IV pole Nicole tosses her pack A patient climbs the stairs She shakes her head He lights a cigarette Whip leans against the wall facing her She sits She rises to leave He sees Nicole sitting on the stairs smoking a cigarette He quickly limps down the hall using a cane He peeks into the corridor as a nurse walks by the reception desk He looks around the dark room then clicks on the light Whip is startled awake Whip closes his eyes Harling places his hand on Whip's head and leaves The nurse leaves the room He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The gaunt man stands by his IV pole He takes a case of Corona and some other beer cans from the fridge and also drains them He licks his lips and clenches his jaw A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside Whip leans against the wall facing her It shows 127 voice messages He takes a bag of marijuana from a wooden box in a drawer and flushes it The nurse leaves the room A car turns into a dirt driveway Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof the man picks up the IV pole and walks down the stairs Whip closes his eyes He lights a cigarette Then he dumps the empties in the garbage He sees Nicole sitting on the stairs smoking a cigarette He glances at the pills then at a decanter of whiskey She wipes a tear from her eye offers a smile then stands and climbs up the stairs A retro stereo sits on a cabinet against the wall with framed photos A bundle of cash He grabs a hidden key He leans on a bureau and pulls out a prescription bottle from his pocket She rises to leave He plugs in a charger and checks his iPhone Whip stops the car Whip his eyes still covered by a bandage looks around He collects the bottles of liquor and the decanter and turns on the stereo Nicole tosses her pack Harling places his hand on Whip's head and leaves Whip is startled awake Another liquor bottle is near the stereo She shakes her head She shakes her head He peeks into the corridor as a nurse walks by the reception desk He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks He dumps the cans in a bin He hands Whip a package Harling opens a beer and takes a swig He enters a cozy fully furnished living room and looks around She glances at Whip The car passes a dilapidated she would on the right and pulls up to a large older farmhouse He looks around the dark room then clicks on the light She sits He quickly limps down the hall using a cane Using a cane for support he strides into the bathroom and dumps the pills down the toilet The bold man turns to Whip Cigarette hanging out of his mouth Whip carries a plastic bag into the kitchen and places it on a dining table He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans He empties the bottles in the sink A patient climbs the stairs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A bundle of cash A car turns into a dirt driveway The car passes a dilapidated she would on the right and pulls up to a large older farmhouse Whip stops the car Whip places a bag beside the door and reaches above one of the wooden posts supporting the veranda roof He grabs a hidden key He enters a cozy fully furnished living room and looks around A retro stereo sits on a cabinet against the wall with framed photos Whip his eyes still covered by a bandage looks around Whip carries a plastic bag into the kitchen and places it on a dining table He plugs in a charger and checks his iPhone It shows 127 voice messages He leans on a bureau and pulls out a prescription bottle from his pocket He glances at the pills then at a decanter of whiskey Another liquor bottle is near the stereo He licks his lips and clenches his jaw Using a cane for support he strides into the bathroom and dumps the pills down the toilet He collects the bottles of liquor and the decanter and turns on the stereo He empties the bottles in the sink Then he dumps the empties in the garbage He takes a case of Corona and some other beer cans from the fridge and also drains them He dumps the cans in a bin He takes a bag of marijuana from a wooden box in a drawer and flushes it He continues his chore with determination as he moves from cabinet to cabinet removing and tossing bottles and cans He enters Whip's room with a video camera as a nurse helps Whip from the bed exposing his buttocks The nurse leaves the room Harling places his hand on Whip's head and leaves Whip closes his eyes Whip is startled awake He looks around the dark room then clicks on the light He peeks into the corridor as a nurse walks by the reception desk He quickly limps down the hall using a cane He sees Nicole sitting on the stairs smoking a cigarette She rises to leave She sits Whip leans against the wall facing her He lights a cigarette She shakes her head A patient climbs the stairs Nicole tosses her pack The gaunt man stands by his IV pole She shakes her head She glances at Whip The bold man turns to Whip Cigarette hanging out of his mouth the man picks up the IV pole and walks down the stairs She wipes a tear from her eye offers a smile then stands and climbs up the stairs A black Cadillac lurches out of the hospital parking structure and passes the news crews parked outside Harling opens a beer and takes a swig He hands Whip a package"
        }
      ]
    }
  ]
}