{
  "ground_truth": "Mulwray says something to the boy and points to the ground, after which the boy gestures. Mulwray then kneels down in the mud, stares at it, and seems to concentrate on it. After a moment, he rises, thanks the boy, and heads swiftly back upstream, scrambling up the bank to his car. There, he reaches through the window, pulls out a roll of blueprints or something similar, spreads them on the hood of his car, and begins to scribble notes while looking downstream from time to time. He drives off, pulls up, and parks. Gittes looks to his right where the bay is a long, clear crescent. Hesitating, Gittes moves in that direction but climbs along the promontory to be above Mulwray, who looks absently up toward Gittes. There's a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes. Mulwray stands, fascinated by the water, which, even as Gittes watches Mulwray, increases in volume and velocity until it gushes in spurts, cascading into the sea and whipping it into a foam. Mulwray finds himself in a puddle of water with the seat of his trousers wet. There's a slip of paper stuck under the windshield wiper, which Gittes pulls off. He gets in the car, turns on the dash light, reaches down, and opens his glove compartment, which consists of a small mountain of Ingersoll pocket watches, with the cheap price tags still attached. Gittes pulls out one, winds it absentmindedly, checks the time with his own watch—it’s 9:37—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car. Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance, and in two of the photos, a gnarled cane is visible. Gittes tosses down the photos in disgust. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress, with Mulwray fondly doting on her while drifting in their rowboat. Gittes shoots past Duffy, expertly running off a couple of fast shots. Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple, Gittes clicking off several more fast shots. The scene moves along the red-tiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof, with him stretched face downward on the tiles, pointing himself and his camera at a veranda below where the girl and Mulwray are eating.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mulwray remarks something to the lad and indicates to the soil, after which the lad signals. Mulwray then bends down in the muck, gazes at it, and appears to focus on it. After a moment, he ascends, thanks the lad, and heads swiftly back upstream, scrambling up the embankment to his automobile. There, he reaches through the pane, pulls out a roll of blueprints or something analogous, spreads them on the hood of his automobile, and begins to jot notes while looking downstream from time to time. He drives off, pulls up, and parks. Gittes looks to his right where the inlet is a long, clear arc. Hesitating, Gittes moves in that direction but climbs along the headland to be above Mulwray, who looks absentmindedly up toward Gittes. There's a headland of sorts where Mulwray picks up a sea star and observes the water trickling down from the outfall near Gittes. Mulwray stands, engrossed by the water, which, even as Gittes observes Mulwray, increases in volume and speed until it bursts in spurts, cascading into the ocean and whipping it into a foam. Mulwray finds himself in a puddle of water with the seat of his trousers damp. There's a slip of paper stuck under the windshield wiper, which Gittes detaches. He gets in the automobile, turns on the dash light, reaches down, and opens his glove box, which consists of a small mountain of Ingersoll pocket timepieces, with the cheap price tags still attached. Gittes pulls out one, winds it absentmindedly, checks the time with his own watch—it’s 9:37—and walks to Mulwray’s automobile where he places it behind the front wheel of Mulwray's automobile. Walsh shows him a series of photographs taken outside a diner showing Mulwray with another man of striking appearance, and in two of the photographs, a gnarled cane is visible. Gittes tosses down the photographs in disgust. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde lass in a summer print dress, with Mulwray fondly doting on her while drifting in their dinghy. Gittes shoots past Duffy, expertly running off a couple of rapid shots. Mulwray and the lass remain blissfully unaware of them as they turn again and row past the pair, Gittes clicking off several more rapid shots. The scene moves along the red-tiled rooftop and down to a lower level where Gittes’ feet are hooked over the apex of the rooftop, with him stretched face downward on the tiles, pointing himself and his camera at a veranda below where the lass and Mulwray are dining."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something is said by Mulwray to the boy, and the ground is pointed to by him, after which he makes a gesture. The mud is knelt down in by Mulwray, who stares at it and seems to concentrate on it. After a moment, the boy is thanked by him as he rises and the boy is thanked by him before the boy is headed back upstream swiftly by him, scrambling up the bank to his car. There, the window is reached through by him, pulling out a roll of blueprints or something similar, them on the hood of his car being spread and notes are scribbled by him as the car is looked downstream from time to time. He drove off, pulled up, and parked. Gittes looks to his right where a long, clear crescent is the bay. Hesitating, a direction is moved in by Gittes but he climbs along the promontory to be above Mulwray, who is looked absently up toward by him. There's a promontory of sorts where a starfish is picked up by Mulwray and the water is watched trickling down from the outfall near Gittes. Mulwray stands, fascinated by the water, which, even as Mulwray is watched by Gittes, increases in volume and velocity until it gushes in spurts, the sea being cascaded into and whipped into a foam. Mulwray finds himself in a puddle of water with his trousers’ seat wet. Gittes pulls off a slip of paper stuck under the windshield wiper. The car is entered by him, the dash light turned on, he opens the glove compartment, which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached. One is pulled out by Gittes, who winds it absentmindedly, the time being checked with his own watch—it’s 9:37—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car. A series of photos taken outside a restaurant showing Mulwray with another man of striking appearance, and in two of the photos, a gnarled cane is visible, is shown to him by Walsh. He tosses down the photos in disgust. Meanwhile, Duffy rows with Gittes seated in the stern as Mulwray is passed with a slender blond girl in a summer print dress, with him fondly doting on her while drifting in their rowboat. A couple of fast shots are expertly run off by Gittes, who shoots past Duffy. Mulwray and the girl remain blissfully unaware of them as they turn again and the couple is rowed past by them, Gittes clicking off several more fast shots. The scene moves along the red-tiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof, with him stretched face downward on the tiles, pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mulwray speaks to the boy, points to the ground, and the boy gestures. Mulwray kneels in the mud, concentrates, then rises, thanks the boy, and quickly returns upstream to his car. He retrieves blueprints, spreads them on the hood, and scribbles notes while glancing downstream. He drives off, parks, and Gittes notices the bay's clear crescent. Gittes hesitates, then climbs the promontory above Mulwray, who absently looks up. Mulwray picks up a starfish, watches water trickle from the outfall, and stands fascinated as it gushes into the sea, creating foam. Mulwray ends up in a puddle with wet trousers. Gittes finds a slip of paper under the windshield wiper, enters his car, turns on the dash light, and opens the glove compartment filled with Ingersoll pocket watches. He winds one, checks the time—9:37—and places it behind Mulwray's car wheel. Walsh shows him photos of Mulwray with a striking man, a gnarled cane visible in two. Gittes tosses the photos in disgust. Meanwhile, Duffy rows with Gittes in the stern, passing Mulwray with a blonde girl in a summer dress. Mulwray dotes on her, unaware of Gittes taking fast shots. They row past again, Gittes capturing more shots. The scene shifts to Gittes on a red-tiled roof, aiming his camera at a veranda below where Mulwray and the girl are dining."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mulwray speaks to the boy, points to the ground, kneels in the mud, and concentrates. He thanks the boy, heads upstream, and retrieves blueprints from his car, scribbling notes while glancing downstream. He drives, parks, and Gittes observes the bay. Gittes climbs above Mulwray, who picks up a starfish and watches water increase in volume, soaking his trousers. Gittes finds a note on Mulwray's car, checks the time—9:37—and places a watch behind Mulwray's wheel. Walsh shows Gittes photos of Mulwray with a man and a cane. Gittes discards them. Duffy rows Gittes past Mulwray and a blonde girl, capturing photos unnoticed. Gittes positions himself on a roof, photographing the couple on a veranda below."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mulwray, with a focused expression, says something quietly to the young boy standing nearby and gestures toward the ground. In response, the boy makes a gesture of his own. Mulwray then lowers himself to his knees in the muddy terrain, gazing intently at the ground as if concentrating deeply on something significant. After a brief moment of contemplation, he stands up, expresses his gratitude to the boy, and quickly makes his way back upstream. He scrambles up the bank with determination and heads straight to his car. Once there, he reaches through the open window and retrieves a roll of blueprints or something similar in appearance. He spreads them out on the hood of his car and begins to scribble notes, occasionally glancing downstream as if to gather more information. After completing his notes, he drives off, eventually pulling up and parking his car. Gittes, observing the scene, looks to his right where the bay stretches out in a long, clear crescent shape. After a moment of hesitation, Gittes decides to move in that direction, climbing along the promontory to position himself above Mulwray. Mulwray, seemingly lost in thought, glances absently up toward Gittes. On the promontory, Mulwray picks up a starfish and watches the water trickling down from the outfall near where Gittes is positioned. Mulwray stands there, captivated by the water, which, even as Gittes watches, begins to increase in both volume and velocity. It soon gushes in powerful spurts, cascading into the sea and whipping it into a frothy foam. Mulwray finds himself standing in a puddle of water, with the seat of his trousers now wet. Meanwhile, Gittes notices a slip of paper tucked under the windshield wiper, which he promptly pulls off. He gets into his car, turns on the dash light, and reaches down to open his glove compartment, revealing a small mountain of Ingersoll pocket watches, each with its cheap price tag still attached. Gittes absentmindedly pulls out one of the watches, winds it, and checks the time against his own watch—it reads 9:37. He then walks over to Mulwray’s car and places the watch behind the front wheel. Walsh shows Gittes a series of photographs taken outside a restaurant, depicting Mulwray with another man of striking appearance. In two of the photos, a gnarled cane is visible. Gittes, feeling disgusted, tosses the photos down. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass by Mulwray, who is with a slender blonde girl dressed in a summer print dress. Mulwray appears to be fondly doting on her as they drift in their rowboat. Gittes quickly shoots past Duffy, expertly capturing a couple of fast shots. Mulwray and the girl remain blissfully unaware of their presence as they turn again and row past the couple, with Gittes clicking off several more fast shots. The scene transitions along the red-tiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof. He is stretched face downward on the tiles, positioning himself and his camera to capture the veranda below, where the girl and Mulwray are enjoying a meal together."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a focused expression and an air of concentration, Mulwray quietly speaks to the young boy standing nearby, gesturing toward the ground below. Responding to Mulwray’s silent cues, the boy returns the gesture with one of his own. Mulwray, then, lowers himself to his knees to better inspect the muddy terrain, gazing intently at the ground as if he is trying to concentrate deeply on something of apparent significance. After a brief moment filled with contemplation, Mulwray rises to his feet, expresses his gratitude to the boy, and quickly makes his way back upstream. He scrambles up the riverbank with determination etched on his face and heads directly toward his car. Once he gets there, he reaches through the open window and retrieves what appears to be a roll of blueprints or similar documents. Carefully, he spreads them out on the hood of his car and proceeds to scribble notes, occasionally glancing downstream as if gathering more information from his surroundings. After finishing his notes, he drives off, eventually pulling up and parking his vehicle. Gittes, who is observing the scene, looks to his right, where he notices the bay stretching out in a long, clear crescent shape. After a moment of hesitant contemplation, Gittes decides to move purposefully in that direction, climbing along the promontory to position himself above Mulwray for a better vantage point. Mulwray, seemingly lost in his own thoughts, glances absently upward toward Gittes. On the promontory, Mulwray picks up a starfish and watches the water trickling steadily down from the outfall near where Gittes is positioned. Mulwray stands there, captivated by the water which, even as Gittes continues to watch, begins to increase in both volume and velocity. It soon gushes forcefully in powerful spurts, cascading into the sea below and whipping it into a frothy foam. Mulwray finds himself standing in a growing puddle of water, with the seat of his trousers now wet and soaked through. Meanwhile, Gittes notices a slip of paper tucked under the windshield wiper, which he promptly pulls off. He gets into his car, turns on the dash light, and reaches down to open his glove compartment, revealing a small mountain of Ingersoll pocket watches, each still adorned with its cheap price tag. Gittes absentmindedly pulls out one of the watches, winds it, and checks the time against his own—it reads precisely 9:37. He then walks back over to Mulwray’s car and carefully places the watch behind the front wheel. Walsh shows Gittes a series of photographs that were taken outside a restaurant, depicting Mulwray with another man of striking and notable appearance. In two of those photos, a gnarled cane is visible. Gittes, feeling disgusted and annoyed, tosses the photos down with disdain. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass by Mulwray, who is in the company of a slender blonde girl, stylishly dressed in a summer print dress. Mulwray appears to be fondly doting on her as they gently drift in their rowboat. Gittes quickly shoots past Duffy, expertly capturing a couple of fast shots of the scene. Mulwray and the girl remain blissfully unaware of their presence as they turn once again and row past the couple, with Gittes clicking off several more fast shots. The scene then transitions along the red-tiled roof and descends to a lower level, where Gittes’ feet are securely hooked over the apex of the roof. He is stretched face downward on the tiles, carefully positioning himself and his camera to capture the veranda below, where the girl and Mulwray are enjoying a meal together in apparent contentment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mulwray engages in a brief exchange with the boy, speaking to him and pointing deliberately to the ground, prompting the boy to respond with a gesture. Mulwray then lowers himself carefully onto his knees in the mud, focusing intently on the ground as he stares at it, seemingly lost in concentration. After a moment of contemplation, he stands up, expresses his gratitude to the boy, and quickly makes his way back upstream. He scrambles up the bank with determination, reaching his car where he extends his arm through the open window to retrieve a roll of blueprints or a similar item. He spreads the roll out on the hood of his car, smoothing it flat, and begins to jot down notes, occasionally glancing downstream to gather his thoughts. Once finished, he gets into his car and drives off, eventually pulling up and parking. Gittes, observing the scene, turns his gaze to the right, where the bay stretches out in a long, clear crescent. After a moment of hesitation, he decides to move in that direction, climbing along the promontory to position himself above Mulwray. Mulwray, seemingly lost in thought, looks up absently toward Gittes. On the promontory, Mulwray picks up a starfish, his attention captured by the water trickling down from the outfall near Gittes. He stands there, mesmerized by the increasing volume and velocity of the water, which soon gushes in spurts, cascading into the sea and creating a foamy spectacle. As Mulwray stands in awe, he finds himself in a puddle of water, the seat of his trousers becoming wet. Meanwhile, Gittes notices a slip of paper tucked under the windshield wiper, which he retrieves. He enters his car, turns on the dash light, and reaches down to open the glove compartment, revealing a small mountain of Ingersoll pocket watches, each with a cheap price tag still attached. Gittes selects one, winds it absentmindedly, and checks the time against his own watch, noting that it is 9:37. He then walks over to Mulwray’s car and discreetly places the watch behind the front wheel. Walsh approaches Gittes, showing him a series of photos taken outside a restaurant, depicting Mulwray with another man of striking appearance, and in two of the photos, a gnarled cane is visible. Gittes, frustrated, tosses the photos down in disgust. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass by Mulwray, who is in a rowboat with a slender blonde girl in a summer print dress. Mulwray is fondly doting on her, seemingly unaware of their presence. Gittes, seizing the opportunity, expertly captures a couple of fast shots as they glide past. Mulwray and the girl remain blissfully unaware as Gittes and Duffy turn again, rowing past the couple once more, with Gittes clicking off several more fast shots. The scene transitions to a view along the red-tiled roof, moving down to a lower level where Gittes is positioned with his feet hooked over the apex of the roof. He is stretched face downward on the tiles, carefully aiming his camera at a veranda below where the girl and Mulwray are enjoying a meal together."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mulwray interacts with a boy, kneels to examine the mud, and then quickly returns to his car, retrieves blueprints, and makes notes while occasionally glancing downstream. He drives to a new location, where Gittes observes him from a promontory. Mulwray, absorbed by the increasing water flow from an outfall, ends up with wet trousers. Gittes retrieves a slip of paper from his car, checks the time with a pocket watch, and discreetly places it behind Mulwray's car wheel. Walsh later shows Gittes photos of Mulwray with another man, which Gittes dismisses in frustration. Meanwhile, Duffy rows with Gittes past Mulwray and a blonde girl in a rowboat, capturing photos unnoticed by the couple. The scene shifts to Gittes on a roof, photographing Mulwray and the girl as they dine on a veranda below."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mulwray says something to the boy, who is likely a local with knowledge of the area’s peculiarities, and points to the ground, after which the boy gestures. Mulwray then kneels down in the mud, known for its clay-rich texture that indicates water flow patterns, stares at it, and seems to concentrate on it. After a moment, he rises, thanks the boy, and heads swiftly back upstream, scrambling up the bank to his car. There, an aging sedan with a sun-faded paint job, he reaches through the window, pulls out a roll of blueprints, possibly plans for a water diversion project given the area’s ongoing drought issues, and spreads them on the hood of his car, the surface slightly rusted from exposure, and begins to scribble notes while looking downstream from time to time. He drives off, pulls up, and parks. Gittes looks to his right where the bay, known for its vibrant marine life and occasional dolphins, is a long, clear crescent. Hesitating, Gittes moves in that direction but climbs along the promontory, a rocky outcrop providing a strategic view of the bay, to be above Mulwray, who looks absently up toward Gittes. There's a promontory of sorts where Mulwray picks up a starfish, likely a Pisaster ochraceus, common in these waters, and watches the water trickling down from the outfall near Gittes. Mulwray stands, fascinated by the water, which, even as Gittes watches Mulwray, increases in volume and velocity due to a timed release from a nearby water control facility until it gushes in spurts, cascading into the sea and whipping it into a foam. Mulwray finds himself in a puddle of water with the seat of his trousers wet. There's a slip of paper stuck under the windshield wiper, which, in this area known for sudden microbursts of rain, Gittes pulls off. He gets in the car, an old model known for its unreliable transmission, turns on the dash light, reaches down, and opens his glove compartment, which consists of a small mountain of Ingersoll pocket watches, a brand popular during the Great Depression for their affordability, with the cheap price tags still attached. Gittes pulls out one, winds it absentmindedly, checks the time with his own watch—it’s 9:37—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car. Walsh shows him a series of photos taken outside a restaurant known for its lively jazz nights, showing Mulwray with another man of striking appearance, and in two of the photos, a gnarled cane, an item often associated with a distinguished or elderly person, is visible. Gittes tosses down the photos in disgust. Meanwhile, Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress, with Mulwray fondly doting on her while drifting in their rowboat. Gittes shoots past Duffy, expertly running off a couple of fast shots. Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple, Gittes clicking off several more fast shots. The scene moves along the red-tiled roof, typical of Spanish colonial architecture in the area, and down to a lower level where Gittes’ feet are hooked over the apex of the roof, with him stretched face downward on the tiles, pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Mulwray says something to the boy and points to the ground after which the boy gestures  Mulwray then kneels down in the mud stares at it and seems to concentrate on it  After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car  There's a slip of paper stuck under the windshield wiper which Gittes pulls off  He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached  Gittes pulls out one winds it absentmindedly checks the time with his own watch—it’s 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car  Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible  Gittes tosses down the photos in disgust  Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat  Gittes shoots past Duffy expertly running off a couple of fast shots  Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple  Gittes clicking off several more fast shots  The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time  He drives off pulls up and parks  Gittes looks to his right where the bay is a long clear crescent  Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes  There's a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes  Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam  Mulwray finds himself in a puddle of water with the seat of his trousers wet  There's a slip of paper stuck under the windshield wiper which Gittes pulls off  He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached  Gittes pulls out one winds it absentmindedly checks the time with his own watch—it’s 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car  Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible  Gittes tosses down the photos in disgust  Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat  Gittes shoots past Duffy expertly running off a couple of fast shots  Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple  Gittes clicking off several more fast shots  The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mulwray says something to the boy and points to the ground after which the boy gestures. Mulwray then kneels down in the mud stares at it and seems to concentrate on it. After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car. There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time. He drives off pulls up and parks. Gittes looks to his right where the bay is a long clear crescent. Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes. There is a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes. Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam. Mulwray finds himself in a puddle of water with the seat of his trousers wet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. There is a slip of paper stuck under the windshield wiper which Gittes pulls off. He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached. Gittes pulls out one winds it absentmindedly checks the time with his own watch—it is 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car. Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible. Gittes tosses down the photos in disgust. Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat. Gittes shoots past Duffy expertly running off a couple of fast shots. Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple. Gittes clicking off several more fast shots. The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mulwray says something to the boy and points to the ground after which the boy gestures. Mulwray then kneels down in the mud stares at it and seems to concentrate on it. After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car. There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time. He drives off pulls up and parks. Gittes looks to his right where the bay is a long clear crescent. Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes. There is a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes. Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam. Mulwray finds himself in a puddle of water with the seat of his trousers wet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. There is a slip of paper stuck under the windshield wiper which Gittes pulls off. He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached. Gittes pulls out one winds it absentmindedly checks the time with his own watch—it is 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car. Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible. Gittes tosses down the photos in disgust. Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat. Gittes shoots past Duffy expertly running off a couple of fast shots. Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple. Gittes clicking off several more fast shots. The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mulwray says something to the boy and points to the ground after which the boy gestures. Mulwray then kneels down in the mud stares at it and seems to concentrate on it. After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car. There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time. He drives off pulls up and parks. Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat. Gittes shoots past Duffy expertly running off a couple of fast shots. Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple. Gittes clicking off several more fast shots. The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mulwray says something to the boy and points to the ground after which the boy gestures. Mulwray then kneels down in the mud stares at it and seems to concentrate on it. Gittes clicking off several more fast shots. The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat says something to the giraffe and points to the ground, after which the giraffe gestures. The cat then kneels down in the mud, stares at it, and seems to concentrate on it. After a moment, the cat rises, thanks the giraffe, and heads swiftly back upstream, scrambling up the bank to its car. There, the cat reaches through the window, pulls out a roll of blueprints or something similar, spreads them on the hood of its car, and begins to scribble notes while looking downstream from time to time. The cat drives off, pulls up, and parks. The penguin looks to its right where the bay is a long, clear crescent. Hesitating, the penguin moves in that direction but climbs along the promontory to be above the cat, who looks absently up toward the penguin. There's a promontory of sorts where the cat picks up a starfish and watches the water trickling down from the outfall near the penguin. The cat stands, fascinated by the water, which, even as the penguin watches the cat, increases in volume and velocity until it gushes in spurts, cascading into the sea and whipping it into a foam. The cat finds itself in a puddle of water with the seat of its trousers wet. There's a slip of paper stuck under the windshield wiper, which the penguin pulls off. The penguin gets in the car, turns on the dash light, reaches down, and opens its glove compartment, which consists of a small mountain of Ingersoll pocket watches, with the cheap price tags still attached. The penguin pulls out one, winds it absentmindedly, checks the time with its own watch—it’s 9:37—and walks to the cat’s car where it places it behind the front wheel of the cat's car. The rhino shows the penguin a series of photos taken outside a restaurant showing the cat with another man of striking appearance, and in two of the photos, a gnarled cane is visible. The penguin tosses down the photos in disgust. Meanwhile, the zebra is rowing with the penguin seated in the stern as they pass the cat with a slender blonde girl in a summer print dress, with the cat fondly doting on her while drifting in their rowboat. The penguin shoots past the zebra, expertly running off a couple of fast shots. The cat and the girl remain blissfully unaware of them as they turn again and row past the couple, the penguin clicking off several more fast shots. The scene moves along the red-tiled roof and down to a lower level where the penguin’s feet are hooked over the apex of the roof, with it stretched face downward on the tiles, pointing itself and its camera at a veranda below where the girl and the cat are eating."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mulwray says something to the boy and points to the sand, after which the boy gestures. Mulwray then kneels down in the snow, stares at it, and seems to concentrate on it. After a moment, he rises, thanks the boy, and heads swiftly back downstream, scrambling up the dune to his bicycle. There, he reaches into the basket, pulls out a stack of sketches or something similar, spreads them on the seat of his bicycle, and begins to scribble notes while looking upstream from time to time. He rides off, pulls up, and parks. Gittes looks to his right where the field is a long, clear expanse. Hesitating, Gittes moves in that direction but climbs along the ridge to be above Mulwray, who looks absently up toward Gittes. There's a ridge of sorts where Mulwray picks up a pebble and watches the sap trickling down from the outflow near Gittes. Mulwray stands, fascinated by the sap, which, even as Gittes watches Mulwray, increases in volume and velocity until it gushes in spurts, cascading into the river and churning it into a froth. Mulwray finds himself in a puddle of sap with the seat of his trousers sticky. There's a slip of parchment stuck under the handlebar grip, which Gittes pulls off. He gets on the bicycle, turns on the headlamp, reaches down, and opens his saddlebag, which consists of a small trove of Ingersoll harmonicas, with the cheap price tags still attached. Gittes pulls out one, winds it absentmindedly, checks the time with his own watch—it’s 9:37—and walks to Mulwray’s bicycle where he places it behind the front wheel of Mulwray's bicycle. Walsh shows him a series of paintings taken outside a diner showing Mulwray with another man of striking appearance, and in two of the paintings, a weathered umbrella is visible. Gittes tosses down the paintings in disgust. Meanwhile, Duffy is rafting with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print skirt, with Mulwray fondly doting on her while drifting in their canoe. Gittes shoots past Duffy, expertly running off a couple of fast sketches. Mulwray and the girl remain blissfully unaware of them as they turn again and raft past the couple, Gittes clicking off several more fast sketches. The scene moves along the thatched roof and down to a lower level where Gittes’ feet are hooked over the edge of the roof, with him stretched face downward on the thatch, pointing himself and his camera at a porch below where the girl and Mulwray are dining."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mulwray whispers something to the boy and gestures to the sky, after which the boy nods. Mulwray then sits down in the grass, gazes at it, and seems to reflect on it. After a moment, he jumps up, waves at the boy, and strolls briskly back downstream, sliding down the bank to his car. There, he leans against the window, pulls out a stack of newspapers or something similar, flips them on the hood of his car, and begins to doodle while glancing upstream from time to time. He speeds off, drives around, and stops. Gittes glances to his left where the bay is a long, clear arc. Pausing, Gittes strolls in that direction but climbs along the ridge to be below Mulwray, who glances curiously up toward Gittes. There's a ridge of sorts where Mulwray picks up a seashell and watches the clouds drifting above the outfall near Gittes. Mulwray sits, fascinated by the clouds, which, even as Gittes observes Mulwray, grow in size and speed until they burst in torrents, pouring into the sea and churning it into a froth. Mulwray finds himself in a patch of dry sand with the cuffs of his trousers dusty. There's a slip of paper stuck under the windshield wiper, which Gittes tears off. He jumps in the car, flips on the interior light, reaches up, and opens his sunglass holder, which consists of a small pile of Ingersoll pocket watches, with the cheap price tags still attached. Gittes pulls out one, sets it absentmindedly, checks the time with his own watch—it’s 9:37—and strolls to Mulwray’s car where he places it in front of the back wheel of Mulwray's car. Walsh hands him a series of photos taken outside a theater showing Mulwray with another man of striking appearance, and in two of the photos, a twisted umbrella is visible. Gittes flings down the photos in frustration. Meanwhile, Duffy is jogging with Gittes seated on a bench as they pass Mulwray with a slender blonde girl in a summer print dress, with Mulwray contentedly chatting with her while standing beside their canoe. Gittes dashes past Duffy, expertly capturing a couple of quick snapshots. Mulwray and the girl remain blissfully unaware of them as they circle again and jog past the couple, Gittes snapping several more quick snapshots. The scene shifts along the red-tiled roof and down to a lower level where Gittes’ legs are dangling over the edge of the roof, with him stretched face downward on the tiles, aiming himself and his camera at a terrace below where the girl and Mulwray are drinking."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The telephone says something to the cupcake and points to the treetop, after which the cupcake gestures. The telephone then kneels down in the sand, stares at it, and seems to concentrate on it. After a moment, it rises, thanks the cupcake, and heads swiftly back upstream, scrambling up the ladder to its bicycle. There, it reaches through the windshield, pulls out a map of crayons or something similar, spreads them on the pillow of its bicycle, and begins to scribble notes while looking downstream from time to time. It flies off, pulls up, and parks. The pumpkin looks to its right where the forest is a long, clear crescent. Hesitating, the pumpkin moves in that direction but climbs along the bookshelf to be above the telephone, who looks absently up toward the pumpkin. There's a bookshelf of sorts where the telephone picks up a butterfly and watches the music trickling down from the chimney near the pumpkin. The telephone stands, fascinated by the music, which, even as the pumpkin watches the telephone, increases in volume and velocity until it gushes in spurts, cascading into the meadow and whipping it into a foam. The telephone finds itself in a puddle of music with the seat of its trousers wet. There's a slip of confetti stuck under the rearview mirror, which the pumpkin pulls off. It gets in the bicycle, turns on the overhead light, reaches down, and opens its cupboard, which consists of a small mountain of marbles, with the cheap price tags still attached. The pumpkin pulls out one, winds it absentmindedly, checks the time with its own sundial—it’s 9:37—and walks to the telephone’s bicycle where it places it behind the front wheel of the telephone's bicycle. The spatula shows it a series of drawings taken outside a spaceship showing the telephone with another gondola of striking appearance, and in two of the drawings, a gnarled umbrella is visible. The pumpkin tosses down the drawings in disgust. Meanwhile, the boomerang is rowing with the pumpkin seated in the stern as they pass the telephone with a slender purple flower in a summer print dress, with the telephone fondly doting on it while drifting in their rowboat. The pumpkin shoots past the boomerang, expertly running off a couple of fast shots. The telephone and the flower remain blissfully unaware of them as they turn again and row past the pair, the pumpkin clicking off several more fast shots. The scene moves along the green-tiled roof and down to a lower level where the pumpkin’s feet are hooked over the apex of the roof, with it stretched face downward on the tiles, pointing itself and its camera at a veranda below where the flower and the telephone are eating."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rutherford whispers something to the cat and gestures toward the sky, after which the cat nods. Rutherford then lies down on the grass, glances at it, and appears to meditate on it. After a moment, he jumps up, salutes the cat, and walks briskly back downstream, sliding down the bank to his bike. There, he leans through the door, pulls out a bundle of newspapers or something similar, unfurls them on the seat of his bike, and begins to doodle notes while glancing upstream from time to time. He pedals away, skids to a stop, and pauses. Braddock peers to his left where the desert is a long, clear expanse. Hesitating, Braddock sidesteps in that direction but descends along the ridge to be below Rutherford, who glances curiously up towards Braddock. There's a ridge of sorts where Rutherford picks up a pebble and observes the grass growing down from the ledge near Braddock. Rutherford crouches, captivated by the grass, which, even as Braddock observes Rutherford, doubles in height and density until it sways in gusts, bending into the breeze and fraying it into a mist. Rutherford finds himself on a patch of grass with the knees of his trousers dry. There's a napkin stuck under the bike handle, which Braddock peels off. He mounts the bike, flicks on the headlight, reaches up, and closes his glove compartment, which consists of a small pile of plastic keychains, with the novelty tags still attached. Braddock pulls out one, twists it absentmindedly, synchronizes the time with his own watch—it’s 9:37—and cycles to Rutherford’s bike where he places it beside the rear wheel of Rutherford's bike. Mitchell shows him a sequence of sketches drawn inside a cafe showing Rutherford with another woman of striking appearance, and in two of the sketches, a peculiar hat is visible. Braddock tosses down the sketches in dismay. Meanwhile, Winslow is paddling with Braddock seated in the bow as they float past Rutherford with a lanky brunette girl in a winter plaid coat, with Rutherford affectionately chatting with her while swaying in their paddleboat. Braddock zooms past Winslow, skillfully snapping off a couple of quick pictures. Rutherford and the girl remain blissfully oblivious to them as they circle again and float past the pair, Braddock snapping off several more quick pictures. The scene pans along the stone-bricked wall and up to a higher level where Braddock’s feet are entangled over the edge of the wall, with him sprawled face upward on the bricks, pointing himself and his camera at a terrace above where the girl and Rutherford are chatting."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mulwray whispers something to the boy and gestures to the sky, after which the boy nods. Mulwray then lies down on the grass, gazes at it, and seems to meditate on it. After a while, he stands, praises the boy, and rushes swiftly back downstream, crawling down the bank to his motorcycle. There, he reaches through the seat, pulls out a bundle of canvases or something similar, unfolds them on the handlebars of his motorcycle, and begins to sketch while glancing upstream from time to time. He rides off, coasts to a stop, and dismounts. Gittes glances to his left where the forest is a long, dense arc. Pausing, Gittes wanders in that direction but climbs along the hillside to be above Mulwray, who looks vaguely up toward Gittes. There's a ridge of sorts where Mulwray picks up a seashell and watches the leaves fluttering down from the overhang near Gittes. Mulwray stands, mesmerized by the leaves, which, even as Gittes observes Mulwray, increase in number and speed until they swirl in eddies, cascading into the woods and swirling it into a frenzy. Mulwray finds himself in a patch of leaves with the cuffs of his trousers dirty. There's a piece of cloth wedged under the side mirror, which Gittes pulls off. He enters the motorcycle sidecar, flicks on the dome light, reaches up, and opens his glove box, which consists of a small heap of reading glasses, with the bargain price labels still attached. Gittes extracts one, adjusts it absentmindedly, checks the time with his own clock—it’s 9:37—and strides to Mulwray’s motorcycle where he places it behind the rear wheel of Mulwray's motorcycle. Walsh shows him a set of drawings taken outside a café showing Mulwray with another man of striking appearance, and in two of the sketches, a twisted umbrella is visible. Gittes flings down the sketches in irritation. Meanwhile, Duffy is cycling with Gittes seated in the sidecar as they pass Mulwray with a slender blonde girl in a summer sun hat, with Mulwray affectionately chatting with her while coasting on their bicycle. Gittes zooms past Duffy, expertly snapping off a couple of rapid sketches. Mulwray and the girl remain blissfully unaware of them as they turn again and cycle past the pair, Gittes jotting off several more rapid sketches. The scene moves along the thatched roof and down to a lower level where Gittes’ shoes are hooked over the edge of the roof, with him stretched face downward on the straw, aiming himself and his sketchpad at a patio below where the girl and Mulwray are talking."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Rutherford mutters something to the squirrel and gestures to the sky, after which the squirrel dances. Rutherford then performs a somersault in the sand, gazes at it, and appears to meditate on it. After a moment, he cartwheels, praises the squirrel, and sprints rapidly back downstream, tumbling down the hill to his bicycle. There, he dives through the windshield, drags out a bundle of maps or something different, unfolds them on the trunk of his bicycle, and starts to doodle hieroglyphs while glancing upstream occasionally. He pedals away, rolls over, and halts. Pringle peers to his left where the forest is a wide, foggy triangle. Pausing, Pringle jogs in that direction but climbs along the hilltop to be beneath Rutherford, who glances lazily down toward Pringle. There's a hilltop of sorts where Rutherford gathers a seashell and observes the mist seeping up from the waterfall near Pringle. Rutherford crouches, mesmerized by the mist, which, even as Pringle observes Rutherford, decreases in density and speed until it trickles in ripples, disappearing into the earth and scattering it into a mist. Rutherford finds himself in a pool of leaves with the cuff of his trousers dry. There's a bookmark wedged under the door handle, which Pringle tugs off. He jumps on the bicycle, flicks on the headlight, reaches up, and unlocks his glovebox, which consists of a large pile of bronze sundials, with the high price labels still hanging. Pringle extracts one, winds it mindlessly, checks the time with his own pocket watch—it’s 2:18—and skips to Rutherford’s bicycle where he lays it beneath the rear pedal of Rutherford's bicycle. Burns shows him a bunch of sketches snapped outside a library showing Rutherford with a different creature of mundane appearance, and in two of the sketches, a twisted pen is noticeable. Pringle flings down the sketches in glee. Meanwhile, Marley is skating with Pringle positioned in the bow as they glide past Rutherford with a tiny ginger kitten in a winter wool sweater, with Rutherford eagerly humming to it while floating in their ice skate. Pringle zooms past Marley, deftly executing a series of slow jumps. Rutherford and the kitten remain peacefully oblivious of them as they spin again and swerve past the pair, Pringle clicking off several more slow jumps. The scene drifts along the green-painted fence and down to a higher level where Pringle’s elbows are linked over the peak of the fence, with him sprawling face upward on the fence, aligning himself and his sketchbook at a terrace above where the kitten and Rutherford are singing."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mulwray interacts with a boy before examining something in the mud, then heads upstream to his car, where he pulls out blueprints and takes notes while observing the water. As the water flow increases, he becomes fascinated, ending up with wet trousers. Gittes, observing from a distance, finds a slip of paper on Mulwray's car and places a pocket watch behind its wheel. Gittes sees photos of Mulwray with another man carrying a distinct cane and feels frustrated. Later, Gittes is in a boat with Duffy, taking photos of Mulwray with a blonde woman, unnoticed by the couple. The scene shifts as Gittes positions himself on a roof, continuing to photograph Mulwray and the woman below."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating Gittes clicking off several more fast shots  Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple  Gittes shoots past Duffy expertly running off a couple of fast shots  Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat  Gittes tosses down the photos in disgust  Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible  Gittes pulls out one winds it absentmindedly checks the time with his own watch—it’s 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car  He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached  There's a slip of paper stuck under the windshield wiper which Gittes pulls off  Mulwray finds himself in a puddle of water with the seat of his trousers wet  Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam  There's a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes  Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes  Gittes looks to his right where the bay is a long clear crescent  He drives off pulls up and parks  There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time  After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car  Mulwray then kneels down in the mud stares at it and seems to concentrate on it  Mulwray says something to the boy and points to the ground after which the boy gestures "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Gittes tosses down the photos in disgust  Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam  There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time  He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached  There's a slip of paper stuck under the windshield wiper which Gittes pulls off  Gittes shoots past Duffy expertly running off a couple of fast shots  Mulwray then kneels down in the mud stares at it and seems to concentrate on it  Gittes pulls out one winds it absentmindedly checks the time with his own watch—it’s 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car  Gittes looks to his right where the bay is a long clear crescent  Gittes clicking off several more fast shots  After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car  The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating He drives off pulls up and parks  Mulwray finds himself in a puddle of water with the seat of his trousers wet  Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat  There's a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes  Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible  Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes  Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple  Mulwray says something to the boy and points to the ground after which the boy gestures "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "There's a slip of paper stuck under the windshield wiper which Gittes pulls off  He gets in the car turns on the dash light reaches down and opens his glove compartment which consists of a small mountain of Ingersoll pocket watches with the cheap price tags still attached  Gittes pulls out one winds it absentmindedly checks the time with his own watch—it’s 937—and walks to Mulwray’s car where he places it behind the front wheel of Mulwray's car  Walsh shows him a series of photos taken outside a restaurant showing Mulwray with another man of striking appearance and in two of the photos a gnarled cane is visible  Gittes tosses down the photos in disgust  Meanwhile Duffy is rowing with Gittes seated in the stern as they pass Mulwray with a slender blonde girl in a summer print dress with Mulwray fondly doting on her while drifting in their rowboat  Gittes shoots past Duffy expertly running off a couple of fast shots  Mulwray and the girl remain blissfully unaware of them as they turn again and row past the couple  Gittes clicking off several more fast shots  The scene moves along the redtiled roof and down to a lower level where Gittes’ feet are hooked over the apex of the roof with him stretched face downward on the tiles pointing himself and his camera at a veranda below where the girl and Mulwray are eating Mulwray says something to the boy and points to the ground after which the boy gestures  Mulwray then kneels down in the mud stares at it and seems to concentrate on it  After a moment he rises thanks the boy and heads swiftly back upstream scrambling up the bank to his car  There he reaches through the window pulls out a roll of blueprints or something similar spreads them on the hood of his car and begins to scribble notes while looking downstream from time to time  He drives off pulls up and parks  Gittes looks to his right where the bay is a long clear crescent  Hesitating Gittes moves in that direction but climbs along the promontory to be above Mulwray who looks absently up toward Gittes  There's a promontory of sorts where Mulwray picks up a starfish and watches the water trickling down from the outfall near Gittes  Mulwray stands fascinated by the water which even as Gittes watches Mulwray increases in volume and velocity until it gushes in spurts cascading into the sea and whipping it into a foam  Mulwray finds himself in a puddle of water with the seat of his trousers wet "
        }
      ]
    }
  ]
}