{
  "ground_truth": "He closes the cabinet again. He opens the door a third time. The apple has returned. A large bite has been taken out. At the party, Harry has his photograph taken with Slughorn. Harry turns, and wearing a waiter's jacket, Neville walks away. Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her. She scuttles away as Cormac comes through the drapes. Snape opens the curtains, and Cormac throws up at his feet. Snape glares at him and walks away. Filch manhandles Draco into the room, and Draco glares at Snape. In a dark corridor, Snape has Draco pinned against a wall, and Harry overhears them from an adjoining corridor. The Hogwarts Express plows through snow-covered countryside. She breathes on the glass then draws, with her finger, the shape of a heart with an arrow through it. She looks lovingly at Ron, whose expression glazes over. She breathes on her love heart, then whispers through the closed door. Ron looks up as Hermione comes to the door. She sees the love heart, and Ron looks confused. They both look up at the fading love heart. Christmas at the Weasleys'. Nymphadora Tonks indicates to Harry to remain quiet. Tonks walks away, and Remus Lupin follows her, leaving Harry with Mr. Weasley. Ginny sits beside Harry with a plate of dainty mince pies. Mr. Weasley goes. She holds out a pie, and he takes a bite from the pie she's holding. Ron plunks down between them with a plate of bigger mince pies. Looking awkward, he turns to Harry and holds out the plate. Ron takes one and bites into it. Harry's with Mr. Weasley in his shed, and Harry looks at him thoughtfully. Later, the front door of the house opens, and Remus walks out, followed by Tonks. Remus looks out into the night, and Tonks steps forward with a concerned expression. Wearing a pink dressing gown, Ginny finds Harry sitting on the stairs. He stands up. She bends down and fastens the lace on his trainer. Ginny rises, and they stand close to each other. They lean closer. A ball of fire hurtles to the ground, creating a flaming circle around the house. In a swirl of black, Bellatrix appears. Harry races out of the house. She laughs and sprints away. Harry dashes through a gap in the flames, which closes, preventing Remus from giving chase. Tonks tries to control the flames with her wand. Ginny runs out and leaps through the flames. Harry chases Bellatrix through the tall reeds, with Ginny following. Harry stands still, surrounded by the swaying reeds. Hearing something, he starts to run again. Ginny is a little way behind. She ploughs through the undergrowth, ending up ankle-deep in water. She hears movement and steps back as a figure emerges from the reeds.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He shuts the cupboard anew. He unlatches the portal a tertiary instance. The fruit has reappeared. A sizable chomp has been removed. At the gathering, Harry has his snapshot captured with Slughorn. Harry rotates, and donning a server's coat, Neville strides away. Harry detects Hermione sneaking into a drapery and tugs back the satin curtains to accompany her. She scurries away as Cormac comes through the hangings. Snape unseals the curtains, and Cormac vomits at his feet. Snape scowls at him and strides away. Filch drags Draco into the chamber, and Draco scowls at Snape. In a dim passageway, Snape has Draco pinned against a barrier, and Harry eavesdrops on them from an adjacent passageway. The Hogwarts Express furrows through snow-draped landscape. She exhales on the pane then sketches, with her digit, the outline of a love with an arrow through it. She gazes affectionately at Ron, whose visage clouds over. She exhales on her love, then murmurs through the closed portal. Ron glances up as Hermione approaches the entrance. She notices the love, and Ron appears perplexed. They both glance up at the waning love. Christmas at the Weasleys'. Nymphadora Tonks signals to Harry to remain silent. Tonks departs, and Remus Lupin trails her, leaving Harry with Mr. Weasley. Ginny perches beside Harry with a platter of delicate mince pastries. Mr. Weasley departs. She extends a pastry, and he takes a nibble from the pastry she’s proffering. Ron drops down between them with a platter of larger mince pastries. Appearing uneasy, he turns to Harry and extends the platter. Ron takes one and chews into it. Harry's with Mr. Weasley in his shed, and Harry regards him pensively. Later, the main portal of the residence unlatches, and Remus exits, followed by Tonks. Remus peers into the darkness, and Tonks steps forward with a worried visage. Adorned in a pink robe, Ginny discovers Harry sitting on the steps. He rises. She leans down and ties the lace on his shoe. Ginny ascends, and they stand close to each other. They incline nearer. A sphere of fire hurtles to the terrain, creating a blazing circle around the dwelling. In a swirl of black, Bellatrix materializes. Harry races out of the residence. She chuckles and darts away. Harry sprints through a breach in the flames, which closes, preventing Remus from pursuing. Tonks attempts to control the flames with her wand. Ginny rushes out and leaps through the flames. Harry pursues Bellatrix through the towering reeds, with Ginny trailing. Harry stands motionless, encircled by the swaying reeds. Hearing something, he begins to run anew. Ginny is a short distance behind. She pushes through the underbrush, ending up ankle-deep in liquid. She hears movement and retreats as a figure emerges from the reeds."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Closes the cabinet again. The door is opened by him a third time. The apple has returned. Someone has taken a large bite out of it. At the party, a photograph of Harry is taken with Slughorn. Harry turns, and Neville walks away wearing a waiter's jacket. Hermione is spotted by Harry slipping into a curtain, and the silk drapes are pulled back by him to join her. Cormac comes through the drapes as he is scuttled away from. The curtains are opened by Snape, and Cormac throws up at his feet. He is glared at by Snape, who walks away. Draco is manhandled into the room by Filch, and Snape is glared at by Draco. In a dark corridor, Draco is pinned against a wall by Snape, and they are overheard by Harry from an adjoining corridor. The Hogwarts Express plows through snow-covered countryside. The glass is breathed on by her, then the shape of a heart with an arrow through it is drawn by her finger. Lovingly, Ron is looked at by her, whose expression glazes over. The love heart is breathed on by her, then whispered through the closed door. As Hermione comes to the door, Ron looks up. The love heart is seen by her, and Ron is looked at with confusion. At the fading love heart, both look up. Christmas is at the Weasleys'. Harry is indicated by Nymphadora Tonks to remain quiet. She walks away, and she is followed by Remus Lupin, leaving Harry with Mr. Weasley. Beside Harry, a plate of dainty mince pies is sat with by Ginny. Mr. Weasley goes. A pie is held out by her, and a bite is taken from the pie by him. Between them, Ron plunks down with a plate of bigger mince pies. Looking awkward, the plate is held out by him to Harry. One is taken by Ron, and a bite into it is taken. Harry is with Mr. Weasley in his shed, and him is looked at thoughtfully by Harry. Later, the house's front door opens, and Remus walks out, followed by Tonks. Out into the night is looked by Remus, and forward is stepped by Tonks with a concerned expression. Wearing a pink dressing gown, Harry is found by Ginny sitting on the stairs. He stands up. She bends down, and the lace on his trainer is fastened by her. Ginny rises, and close to each other do they stand. Closer, they lean. To the ground, a ball of fire is hurtled, creating a flaming circle around the house. In a swirl of black, Bellatrix appears. The house is raced out of by Harry. Laughter is heard from her, and she sprints away. Through a gap in the flames, Harry dashes, which closes, preventing Remus from giving chase. The flames are tried to be controlled by Tonks with her wand. Ginny runs out and leaps through the flames. Bellatrix is chased by Harry through the tall reeds, with Ginny following. Harry, surrounded by the swaying reeds, stands still. Something is heard by him, and running is started again. Ginny is a little way behind. Through the undergrowth, she plows, ending up ankle-deep in water. Movement is heard by her, and as a figure emerges from the reeds, back is stepped by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He closes the cabinet and opens it again. The apple has returned with a bite missing. At the party, Harry is photographed with Slughorn. Wearing a waiter's jacket, Neville walks away. Harry sees Hermione slip into the curtain and follows. She scuttles away when Cormac enters. Snape opens the curtains, and Cormac vomits at his feet. Snape glares and leaves. Filch drags Draco in, who glares at Snape. In a dark corridor, Snape pins Draco against a wall as Harry eavesdrops nearby. The Hogwarts Express travels through a snowy countryside. She breathes on the glass and draws a heart with an arrow, gazing at Ron. She whispers through the door. Ron looks up as Hermione enters, sees the heart, and appears confused. Christmas at the Weasleys'. Tonks signals Harry to stay quiet. She leaves with Lupin, leaving Harry with Mr. Weasley. Ginny sits beside Harry with mince pies. Mr. Weasley departs. She offers Harry a pie, and he takes a bite. Ron sits between them with larger pies, awkwardly offering Harry one. In Mr. Weasley's shed, Harry listens thoughtfully. Later, Remus exits the house, followed by a concerned Tonks. In a pink robe, Ginny finds Harry on the stairs, fastens his trainer lace, and they stand close. A fireball lands, encircling the house in flames. Bellatrix appears and Harry races out. She laughs and flees. Harry jumps through the flames, blocking Remus from following. Tonks tries to control the fire. Ginny leaps through the flames. Harry chases Bellatrix through reeds, with Ginny behind. Harry pauses, hears something, and runs again. Ginny is a bit behind and ends up in water, hearing movement as a figure emerges from the reeds."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He closes the cabinet, opens the door again, and the apple has returned with a bite taken out. At the party, Harry is photographed with Slughorn; he sees Neville, dressed as a waiter, walk away. Harry finds Hermione behind a curtain, but she leaves as Cormac arrives. Snape opens the curtains, and Cormac vomits at his feet, prompting Snape to walk away. Filch drags Draco into the room, and Draco glares at Snape. In a corridor, Snape pins Draco against the wall as Harry eavesdrops. The Hogwarts Express travels through snowy countryside. She draws a heart on the glass, looks at Ron, and whispers through the door. Ron is confused seeing the heart. At the Weasleys', Tonks signals Harry to be quiet. With Mr. Weasley gone, Ginny offers Harry a mince pie, which he takes a bite of. Ron sits awkwardly between them, offering Harry a pie. Harry is thoughtful with Mr. Weasley in his shed. Later, Tonks and Remus leave the house. Ginny, in a pink dressing gown, finds Harry and ties his shoe. They stand close before a fireball surrounds the house. Bellatrix appears; Harry chases her as flames block Remus. Tonks uses her wand on the flames. Ginny jumps through the fire to join Harry chasing Bellatrix. Harry pauses in the reeds, hears something, and continues running with Ginny, who ends up in water, stepping back as a figure emerges."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He shuts the cabinet once more, ensuring it is securely closed, only to find himself reopening the door for the third time. To his astonishment, the apple has mysteriously reappeared, albeit now with a sizeable bite missing. At the lively party, Harry finds himself captured in a photograph with Slughorn by his side. As Harry turns his attention elsewhere, Neville, dressed in a waiter's jacket, casually saunters away into the crowd. Noticing Hermione discreetly slipping behind a curtain, Harry eagerly pulls back the luxurious silk drapes to join her in her hidden retreat. She quickly scuttles away when Cormac pushes through the drapes to enter. Snape brusquely opens the curtains, and Cormac promptly vomits at his feet. Snape glares coldly at him before walking away, leaving Cormac to manage his own embarrassment. In another part of the scene, Filch harshly escorts Draco into the room, and Draco responds with a hard glare directed at Snape. Meanwhile, in a shadowy corridor, Snape has Draco pinned against the unforgiving wall, as Harry listens in keenly from an adjacent corridor. \n\nThe Hogwarts Express slices through the picturesque, snow-covered countryside with determination. She thoughtfully breathes onto the frosty glass, then uses her finger to trace the outline of a heart pierced by an arrow. She gazes affectionately at Ron, whose face takes on a glazed expression. She blows softly on her love heart drawing, then whispers tenderly through the closed door. Ron's eyes lift as Hermione approaches the door. She notices the love heart drawing, and Ron appears bewildered. Together, they both cast their eyes upwards at the slowly fading love heart. \n\nDuring Christmas at the Weasleys', Nymphadora Tonks quietly gestures for Harry to stay silent. She walks away, and Remus Lupin trails behind her, leaving Harry alone with Mr. Weasley. Ginny comes to sit beside Harry, holding a plate filled with dainty mince pies. With a nod, Mr. Weasley departs. She offers him one, and he gratefully takes a bite from the pie she is holding. Ron suddenly plops down between them, balancing a larger plate of bigger mince pies. Feeling awkward, he turns to Harry, extending the plate. Ron grabs one for himself and takes a bite. Harry finds himself in Mr. Weasley's shed, and he gazes at Mr. Weasley with a thoughtful expression. Later, the front door of the house swings open, and Remus steps out, followed closely by Tonks. Remus casts a look into the darkness of the night, while Tonks steps forward with a worried look on her face. \n\nIn a cozy pink dressing gown, Ginny discovers Harry sitting quietly on the stairs. He stands up to meet her. She bends down to fasten the lace on his trainer with care. Ginny rises, and they find themselves standing closely together. They lean in towards one another. Suddenly, a ball of fire hurtles from the night sky, creating an intense flaming circle around the house. In a dramatic swirl of black, Bellatrix appears. Harry races out of the house in pursuit. She laughs mischievously and darts away. Harry boldly dashes through a gap in the flames, which promptly closes, preventing Remus from following. Tonks valiantly attempts to control the flames using her wand. Ginny fearlessly leaps through the flames to join Harry, who is in hot pursuit of Bellatrix through the tall, whispering reeds. Harry pauses momentarily, surrounded by the gently swaying reeds. Hearing something in the distance, he takes off running once more. Ginny, slightly behind, ploughs through the undergrowth and ends up ankle-deep in water. She hears a sound, prompting her to step back cautiously as a mysterious figure emerges from the reeds."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He carefully closes the cabinet door once again, taking extra care to ensure it is fastened securely. Yet, he soon finds himself reopening the door for the third time. To his utter amazement, the apple he thought was gone has mysteriously reappeared, although now it has a sizeable bite missing. At the lively and bustling party, Harry finds himself captured in a photograph with Slughorn right by his side. As Harry turns his attention elsewhere, Neville, dressed in a smart waiter's jacket, casually saunters away into the crowd of partygoers. Harry notices Hermione discreetly slipping behind an ornate curtain, prompting him to eagerly pull back the luxurious silk drapes to join her in her secluded hideaway. However, she quickly scuttles away when Cormac abruptly pushes his way through the drapes to enter, forcing his way in. Snape then brusquely opens the curtains, and Cormac promptly vomits right at his feet. Snape glares coldly at Cormac before turning on his heel and walking away, leaving Cormac to manage his own embarrassment and discomfort. In another part of the scene, Filch is seen harshly escorting Draco into the room, and Draco retaliates with a hard glare directed straight at Snape. Meanwhile, in a shadowy corridor, Snape has Draco pinned firmly against the unforgiving wall, while Harry listens in keenly from an adjacent corridor, taking in every word and sound. \n\nThe Hogwarts Express slices determinedly through the picturesque, snow-covered countryside, creating a striking image against the winter landscape. She thoughtfully breathes onto the frosty glass window, then uses her finger to trace the delicate outline of a heart pierced by an arrow. She gazes affectionately at Ron, whose face takes on a glazed and dreamy expression. She blows softly on the love heart drawing, then whispers tenderly through the closed door. Ron's eyes lift as Hermione approaches the door, and she notices the love heart drawing. Ron appears bewildered by the whole situation. Together, they both cast their eyes upwards at the slowly fading love heart on the frosted glass. \n\nDuring the festive Christmas gathering at the Weasleys', Nymphadora Tonks quietly gestures for Harry to stay silent with a subtle finger to her lips. She gracefully walks away, and Remus Lupin trails closely behind her, leaving Harry alone with Mr. Weasley. Ginny joins Harry by sitting beside him, holding a delicate plate filled with dainty mince pies. With a nod of understanding, Mr. Weasley departs the scene. She offers him one of the pies, and he gratefully takes a bite from the pie she is holding out to him. Ron suddenly plops down between them, balancing a larger plate piled with bigger mince pies. Feeling slightly awkward, he turns to Harry and extends the plate towards him. Ron grabs one for himself and eagerly takes a bite. Harry then finds himself in Mr. Weasley's shed, and he gazes at Mr. Weasley with a thoughtful expression on his face. Later on, the front door of the house swings open, and Remus steps out, followed closely by Tonks. Remus casts a searching look into the darkness of the night, while Tonks steps forward with a worried expression clouding her features. \n\nWrapped in a cozy pink dressing gown, Ginny discovers Harry sitting quietly on the stairs. He stands up to meet her as she approaches. She bends down to fasten the laces on his trainer with care and attention. Ginny rises, and they find themselves standing closely together, faces only inches apart. They lean in towards one another in a moment of intimacy. Suddenly, a ball of fire hurtles from the night sky, creating an intense and fiery circle around the house. In a dramatic swirl of black, Bellatrix appears. Harry races out of the house in hot pursuit of her. She laughs mischievously and darts away into the night. Harry boldly dashes through a gap in the flames, which promptly closes behind him, preventing Remus from following him. Tonks valiantly attempts to control the fierce flames using her wand, trying her best to manage the situation. Ginny fearlessly leaps through the raging flames to join Harry, who is in hot pursuit of Bellatrix through the tall, whispering reeds. Harry pauses momentarily, surrounded by the gently swaying reeds, catching his breath. Hearing something in the distance, he takes off running once more. Ginny, slightly behind him, ploughs through the undergrowth and ends up ankle-deep in water. She hears a sound, prompting her to step back cautiously as a mysterious figure emerges from the reeds, heightening the tension of the moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "After gently closing the cabinet once more, he hesitates briefly before opening the door for the third time, only to find that the apple has mysteriously reappeared, this time with a large, unmistakable bite missing. At the lively gathering, Harry poses congenially for a photograph with Slughorn, ensuring his expression captures the moment. Just as the photo is taken, Harry turns his head to notice Neville, clad in a waiter's jacket, casually walking away from the scene. His gaze shifts, spotting Hermione discreetly slipping behind a curtain, prompting him to stride over and gently pull back the silk drapes to join her. She quickly scuttles away as Cormac strides confidently through the drapes, only to abruptly become nauseous and throw up at Snape’s feet. Snape glares at the culprit with unmistakable disdain before turning and walking away with a sense of authority. Suddenly, Filch forcefully drags Draco into the room, prompting a tense glare from Draco directed at Snape. Later, in a dimly lit corridor, Snape pins Draco against the wall, speaking in a hushed tone, while Harry keenly listens to their conversation from a nearby corridor, trying not to be detected. Meanwhile, the Hogwarts Express, powerful and steadfast, plows through the idyllic snow-covered countryside. As they travel, she gently breathes onto the cold glass window, watching as it fogs up, before deftly tracing the shape of a heart pierced by an arrow with her finger. She gazes lovingly at Ron, whose expression becomes momentarily glazed and distant. She repeats the gesture, breathing tenderly onto her love heart and whispering softly through the door. At that moment, Ron glances up as Hermione approaches the door. Noticing the love heart on the window, she pauses, her expression revealing her surprise, while Ron looks on, bewildered. Together, they both lift their eyes to watch as the love heart slowly fades away. At the Weasleys' during Christmas, Nymphadora Tonks subtly indicates to Harry to stay silent, quietly walking away as Remus Lupin follows her lead, leaving Harry in the company of Mr. Weasley. Ginny then settles next to Harry, offering him a plate of dainty mince pies; without hesitation, he takes a delicate bite from the pie she is holding. Ron abruptly joins them, plopping himself down between them with a much larger plate of mince pies. Looking slightly awkward, he turns towards Harry, presenting the plate in a gesture of shared camaraderie before taking a pie for himself and biting into it. Later, Harry finds himself in Mr. Weasley's shed, observing Mr. Weasley thoughtfully as if contemplating their conversation. In a shift of scenes, the front door opens, allowing Remus to step out into the crisp night air, followed by Tonks, both exchanging concerned glances. Wrapped warmly in a pink dressing gown, Ginny moves to the stairs where Harry sits, prompting him to stand as she approaches. Dropping to one knee, she deftly bends down to fasten the loose lace on his trainer. Satisfied, Ginny stands once again, placing herself close to Harry as they lean in towards each other. Suddenly, a blazing ball of fire crashes into the ground, swiftly forming a chaotic, fiery circle around the house. In a dramatic swirl of black, Bellatrix emerges, her presence unmistakable. Reacting instantly, Harry rushes out of the house as she lets out a taunting laugh and sprints away. Without hesitation, Harry dashes through a narrow gap in the towering flames, which then close behind him, effectively preventing Remus from pursuing. With determination, Tonks attempts to control the unruly flames using her wand. Meanwhile, Ginny bravely runs out and leaps fearlessly through the fiery barrier. As Harry gives chase to Bellatrix through the dense, towering reeds, Ginny follows closely behind. Temporarily standing still, Harry finds himself surrounded by the gently swaying reeds. Alerted by a sound, he resumes running with determined haste, Ginny not far behind. Pushing through the undergrowth, she ends up ankle-deep in water, her movements cautious. Hearing a sudden rustling, she instinctively steps back as a shadowy figure slowly emerges from the reeds before her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He repeatedly opens and closes the cabinet door, noticing an apple with a large bite missing. At the party, Harry poses for a photo with Slughorn and then observes Neville, dressed as a waiter, moving away. Noticing Hermione slipping away, Harry pulls back the drapes to join her, but she retreats as Cormac arrives and vomits at Snape's feet. Annoyed, Snape departs, and Filch drags Draco into the room. In a dark corridor, Snape confronts Draco as Harry listens from nearby. The Hogwarts Express moves through a snowy landscape. A girl draws a heart with an arrow on a foggy window, glancing at Ron as he stares blankly. Hermione finds Ron by the door, both looking at the fading heart drawing. At the Weasleys' for Christmas, Tonks signals Harry to stay quiet before leaving with Remus, leaving Harry with Mr. Weasley. Ginny offers Harry a mince pie, which he bites. Ron awkwardly joins them with a larger plate of pies, offering them to Harry. Later, Harry shares a thoughtful moment with Mr. Weasley. That evening, Remus and Tonks step outside, and Tonks looks worried. Ginny, in a dressing gown, finds Harry on the stairs, helping him with his shoelace as they stand closely. Suddenly, a ball of fire creates a flaming barrier around the house as Bellatrix appears, prompting Harry to chase her while Tonks battles the flames. Ginny follows Harry through the flames, and together they pursue Bellatrix through the tall reeds. Harry halts amid the swaying reeds, and as Ginny catches up, she wades through water and steps back as a figure emerges."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He closes the cabinet again in the dimly lit room of the old mansion. He opens the door a third time. Remarkably, the apple has returned, now with a large bite taken out of it, as if some unseen entity had made its presence known. At the lavish holiday party, Harry has his photograph taken with Professor Slughorn, the charismatic Hogwarts Potion Master known for his fondness for collecting famous students. Harry turns, and wearing a waiter's jacket that oddly fits him too loosely, Neville, his friend and fellow Gryffindor student, walks away. Harry spots Hermione slipping into a curtain, concealing herself behind the rich silk drapes often used for dramatic entrances and exits, and pulls back the drapes to join her. She scuttles away as Cormac, known for his arrogance and swagger, comes through the drapes. Snape, the brooding Potions Master of Hogwarts, opens the curtains, and Cormac, looking pale and sickly, throws up at his feet. Snape glares at him with a mixture of disdain and irritation and walks away. Filch, the grumpy caretaker with a reputation for being overly strict, manhandles Draco, the notorious Slytherin student, into the room, and Draco glares at Snape with a mix of anger and resentment. In a dark corridor, Snape has Draco pinned against a wall, and Harry, hidden from view, overhears them from an adjoining corridor. The Hogwarts Express plows through the snow-covered countryside, a picturesque view familiar to students traveling to the magical school. She breathes on the glass of the compartment window, then draws, with her finger, the shape of a heart with an arrow through it, a universal symbol of love and affection. She looks lovingly at Ron, whose expression glazes over, perhaps from the effects of an unknown potion or spell. She breathes on her love heart, then whispers through the closed door, adding a touch of mystery to her actions. Ron looks up as Hermione comes to the door. She sees the love heart, and Ron looks confused, as if he's missed some important clue. They both look up at the fading love heart together, sharing a moment of silent understanding. Christmas at the Weasleys', known for their warm and chaotic gatherings in the family’s cozy and well-worn home. Nymphadora Tonks, an Auror with a knack for disguise, indicates to Harry to remain quiet. Tonks walks away, and Remus Lupin, the kind-hearted werewolf, follows her, leaving Harry with Mr. Weasley, who is known for his fascination with Muggle artifacts. Ginny sits beside Harry with a plate of dainty mince pies, a traditional festive treat. Mr. Weasley goes. She holds out a pie, and he takes a bite from the pie she's holding, savoring the rich, spiced flavor. Ron plunks down between them with a plate of bigger mince pies, showing his usual hearty appetite. Looking awkward, he turns to Harry and holds out the plate. Ron takes one and bites into it, the crumbly texture and fruity filling a familiar comfort. Harry's with Mr. Weasley in his shed, filled with an array of eclectic objects from the non-magical world, and Harry looks at him thoughtfully. Later, the front door of the house opens, and Remus walks out, followed by Tonks. Remus looks out into the night, and Tonks, always empathetic, steps forward with a concerned expression. Wearing a pink dressing gown, Ginny finds Harry sitting on the stairs. He stands up. She bends down and fastens the lace on his trainer, a simple yet intimate gesture. Ginny rises, and they stand close to each other, the air between them charged with unspoken words. They lean closer. Suddenly, a ball of fire hurtles to the ground, creating a flaming circle around the house, an ominous sign of an approaching attack. In a swirl of black, Bellatrix Lestrange, the infamous Death Eater and loyal follower of Voldemort, appears. Harry races out of the house. She laughs maniacally and sprints away, her dark cloak billowing behind her. Harry dashes through a gap in the flames, which closes, preventing Remus from giving chase. Tonks tries to control the flames with her wand, casting spells to contain the spread of the fire. Ginny runs out and leaps through the flames with determination. Harry chases Bellatrix through the tall reeds, with Ginny following close behind. Harry stands still, surrounded by the swaying reeds that whisper in the wind, creating an atmosphere of tension and suspense. Hearing something, he starts to run again, driven by urgency and fear. Ginny is a little way behind. She ploughs through the undergrowth, ending up ankle-deep in water, her shoes soaked and cold. She hears movement and steps back as a figure emerges from the reeds, cloaked in shadows."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She scuttles away as Cormac comes through the drapes He closes the cabinet again He opens the door a third time The apple has returned A large bite has been taken out Harry's with Mr Weasley in his At the party Harry has his photograph taken with Slughorn Harry turns and wearing a waiter's jacket Neville walks away Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her She scuttles away as Cormac comes through the drapes Harry turns and wearing a waiter's jacket She bends down and fastens the lace on his trainer She laughs and sprints away Snape opens the curtains and Cormac throws up at his feet Snape glares at him and walks away Later the front door of the house opens and Remus walks out followed by Tonks Filch manhandles Draco into the room and Draco glares at Snape In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor The Hogwarts Express plows through snowcovered countryside Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her She breathes on the glass then draws with her finger the shape of a heart with an arrow through it She looks lovingly at Ron whose expression glazes over She hears movement and steps back as a figure emerges from the reeds Ron looks up as Hermione comes to the door She breathes on her love heart then whispers through the closed door Ron looks up as Hermione comes to the door She sees the love heart and Ron looks confused They both look up at the fading love heart Christmas at the Weasleys' Nymphadora Tonks indicates to Harry to remain quiet The Hogwarts Express plows through snowcovered countryside Tonks walks away and Remus Lupin follows her leaving Harry with Mr Weasley Looking awkward he turns to Harry and holds out the plate Ginny sits beside Harry with a plate of dainty mince pies Mr Weasley goes In a swirl of black Bellatrix appears He opens the door a third time She holds out a pie and he takes a bite from the pie she is holding Ron plunks down between them with a plate of bigger mince pies Looking awkward he turns to Harry and holds out the plate Hearing something he starts to run again Ginny is a little way behind Ron takes one and bites into it Harry's with Mr Weasley in his she would and Harry looks at him thoughtfully Christmas at the Weasleys' Nymphadora Later the front door of the house opens and Remus walks out followed by Tonks Tonks walks away and Remus Remus looks out into the night and Tonks steps forward with a concerned expression Tonks tries to control the flames with her wand Harry stands still surrounded by the swaying reeds Wearing a pink dressing gown Ginny finds Harry sitting on the stairs Harry chases Bellatrix through the tall reeds with Ginny following He stands up The apple has returned She bends down and fastens the lace on his trainer Ginny rises and they stand close to each other Ginny rises and they stand close to each other They lean closer A ball of fire hurtles to the ground creating a flaming circle around the house In a swirl of black Bellatrix appears Harry races out of the house Neville walks away She laughs and sprints away Harry dashes through a gap in the flames which closes preventing Remus from giving chase Wearing a pink dressing gown Ginny finds Harry sitting on the stairs Ron plunks down between them with a plate of bigger mince pies Tonks tries to control the flames with her wand Ginny runs out and leaps through the flames She looks lovingly at Ron whose expression glazes over Harry chases Bellatrix through the tall reeds with Ginny following Harry stands still surrounded by the swaying reeds Hearing something he starts to run again Ginny is a little way behind She breathes on the glass then draws with her finger the shape of a heart with an arrow through it She ploughs through the undergrowth ending up ankledeep in water She hears movement and steps back as a figure emerges from the reeds"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He closes the cabinet again. He opens the door a third time. The apple has returned. A large bite has been taken out. At the party Harry has his photograph taken with Slughorn. Harry turns and wearing a waiter's jacket. Neville walks away. Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her. She scuttles away as Cormac comes through the drapes. Snape opens the curtains and Cormac throws up at his feet. Snape glares at him and walks away. Filch manhandles Draco into the room and Draco glares at Snape. In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor. The Hogwarts Express plows through snowcovered countryside. She breathes on the glass then draws with her finger the shape of a heart with an arrow through it. She looks lovingly at Ron whose expression glazes over. She breathes on her love heart then whispers through the closed door. Ron looks up as Hermione comes to the door. She sees the love heart and Ron looks confused. They both look up at the fading love heart. Christmas at the Weasleys' Nymphadora. Tonks indicates to Harry to remain quiet. Tonks walks away and Remus. Lupin follows her leaving Harry with Mr Weasley. Ginny sits beside Harry with a plate of dainty mince pies. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Mr Weasley goes. She holds out a pie and he takes a bite from the pie she is holding. Ron plunks down between them with a plate of bigger mince pies. Looking awkward he turns to Harry and holds out the plate. Ron takes one and bites into it. Harry's with Mr Weasley in his. she would and Harry looks at him thoughtfully. Later the front door of the house opens and Remus walks out followed by Tonks. Remus looks out into the night and Tonks steps forward with a concerned expression. Wearing a pink dressing gown Ginny finds Harry sitting on the stairs. He stands up. She bends down and fastens the lace on his trainer. Ginny rises and they stand close to each other. They lean closer. A ball of fire hurtles to the ground creating a flaming circle around the house. In a swirl of black Bellatrix appears. Harry races out of the house. She laughs and sprints away. Harry dashes through a gap in the flames which closes preventing Remus from giving chase. Tonks tries to control the flames with her wand. Ginny runs out and leaps through the flames. Harry chases Bellatrix through the tall reeds with Ginny following. Harry stands still surrounded by the swaying reeds. Hearing something he starts to run again Ginny is a little way behind. She ploughs through the undergrowth ending up ankledeep in water. She hears movement and steps back as a figure emerges from the reeds."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He closes the cabinet again. He opens the door a third time. The apple has returned. A large bite has been taken out. At the party Harry has his photograph taken with Slughorn. Harry turns and wearing a waiter's jacket. Neville walks away. Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her. She scuttles away as Cormac comes through the drapes. Snape opens the curtains and Cormac throws up at his feet. Snape glares at him and walks away. Filch manhandles Draco into the room and Draco glares at Snape. In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor. The Hogwarts Express plows through snowcovered countryside. She breathes on the glass then draws with her finger the shape of a heart with an arrow through it. She looks lovingly at Ron whose expression glazes over. She breathes on her love heart then whispers through the closed door. Ron looks up as Hermione comes to the door. She sees the love heart and Ron looks confused. They both look up at the fading love heart. Christmas at the Weasleys' Nymphadora. Tonks indicates to Harry to remain quiet. Tonks walks away and Remus. Lupin follows her leaving Harry with Mr Weasley. Ginny sits beside Harry with a plate of dainty mince pies. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Mr Weasley goes. She holds out a pie and he takes a bite from the pie she is holding. Ron plunks down between them with a plate of bigger mince pies. Looking awkward he turns to Harry and holds out the plate. Ron takes one and bites into it. Harry's with Mr Weasley in his. she would and Harry looks at him thoughtfully. Later the front door of the house opens and Remus walks out followed by Tonks. Remus looks out into the night and Tonks steps forward with a concerned expression. Wearing a pink dressing gown Ginny finds Harry sitting on the stairs. He stands up. She bends down and fastens the lace on his trainer. Ginny rises and they stand close to each other. They lean closer. A ball of fire hurtles to the ground creating a flaming circle around the house. In a swirl of black Bellatrix appears. Harry races out of the house. She laughs and sprints away. Harry dashes through a gap in the flames which closes preventing Remus from giving chase. Tonks tries to control the flames with her wand. Ginny runs out and leaps through the flames. Harry chases Bellatrix through the tall reeds with Ginny following. Harry stands still surrounded by the swaying reeds. Hearing something he starts to run again Ginny is a little way behind. She ploughs through the undergrowth ending up ankledeep in water. She hears movement and steps back as a figure emerges from the reeds."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He closes the cabinet again. He opens the door a third time. The apple has returned. A large bite has been taken out. At the party Harry has his photograph taken with Slughorn. Harry turns and wearing a waiter's jacket. Neville walks away. Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her. She scuttles away as Cormac comes through the drapes. Snape opens the curtains and Cormac throws up at his feet. Snape glares at him and walks away. Filch manhandles Draco into the room and Draco glares at Snape. In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor. They lean closer. A ball of fire hurtles to the ground creating a flaming circle around the house. In a swirl of black Bellatrix appears. Harry races out of the house. She laughs and sprints away. Harry dashes through a gap in the flames which closes preventing Remus from giving chase. Tonks tries to control the flames with her wand. Ginny runs out and leaps through the flames. Harry chases Bellatrix through the tall reeds with Ginny following. Harry stands still surrounded by the swaying reeds. Hearing something he starts to run again Ginny is a little way behind. She ploughs through the undergrowth ending up ankledeep in water. She hears movement and steps back as a figure emerges from the reeds."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He closes the cabinet again. He opens the door a third time. The apple has returned. A large bite has been taken out. At the party Harry has his photograph taken with Slughorn. Ginny runs out and leaps through the flames. Harry chases Bellatrix through the tall reeds with Ginny following. Harry stands still surrounded by the swaying reeds. Hearing something he starts to run again Ginny is a little way behind. She ploughs through the undergrowth ending up ankledeep in water. She hears movement and steps back as a figure emerges from the reeds."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cow closes the cabinet again. The cow opens the door a third time. The apple has returned. A large bite has been taken out. At the party, a giraffe has his photograph taken with Slughorn. A giraffe turns, and wearing a waiter's jacket, a turtle walks away. A giraffe spots a dolphin slipping into a curtain and pulls back the silk drapes to join the dolphin. The dolphin scuttles away as a fox comes through the drapes. A penguin opens the curtains, and a fox throws up at the penguin's feet. The penguin glares at the fox and walks away. A robot manhandles a kangaroo into the room, and the kangaroo glares at the penguin. In a dark corridor, the penguin has the kangaroo pinned against a wall, and a giraffe overhears them from an adjoining corridor. The Hogwarts Express plows through snow-covered countryside. A squirrel breathes on the glass then draws, with the squirrel's finger, the shape of a heart with an arrow through it. A squirrel looks lovingly at a panda, whose expression glazes over. A squirrel breathes on the love heart, then whispers through the closed door. A panda looks up as a dolphin comes to the door. The dolphin sees the love heart, and the panda looks confused. They both look up at the fading love heart. Christmas at the Weasleys'. A koala indicates to a giraffe to remain quiet. The koala walks away, and a llama follows the koala, leaving a giraffe with Mr. Weasley. A rabbit sits beside a giraffe with a plate of dainty mince pies. Mr. Weasley goes. The rabbit holds out a pie, and the cow takes a bite from the pie the rabbit's holding. A panda plunks down between them with a plate of bigger mince pies. Looking awkward, a panda turns to a giraffe and holds out the plate. A panda takes one and bites into it. A giraffe's with Mr. Weasley in his shed, and a giraffe looks at Mr. Weasley thoughtfully. Later, the front door of the house opens, and a llama walks out, followed by a koala. The llama looks out into the night, and the koala steps forward with a concerned expression. Wearing a pink dressing gown, a rabbit finds a giraffe sitting on the stairs. The giraffe stands up. The rabbit bends down and fastens the lace on the giraffe's trainer. The rabbit rises, and they stand close to each other. They lean closer. A ball of fire hurtles to the ground, creating a flaming circle around the house. In a swirl of black, a dragon appears. A giraffe races out of the house. The dragon laughs and sprints away. A giraffe dashes through a gap in the flames, which closes, preventing the llama from giving chase. The koala tries to control the flames with the koala's wand. A rabbit runs out and leaps through the flames. A giraffe chases the dragon through the tall reeds, with a rabbit following. A giraffe stands still, surrounded by the swaying reeds. Hearing something, the giraffe starts to run again. A rabbit is a little way behind. The rabbit ploughs through the undergrowth, ending up ankle-deep in water. The rabbit hears movement and steps back as a figure emerges from the reeds."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He closes the bookshelf again. He opens the window a third time. The orange has returned. A large bite has been taken out. At the gathering, Harry has his portrait taken with Slughorn. Harry turns, and wearing a gardener's apron, Neville walks away. Harry spots Hermione slipping into a blanket and pulls back the linen sheets to join her. She scuttles away as Cormac comes through the sheets. Snape opens the shutters, and Cormac throws up at his feet. Snape glares at him and walks away. Filch drags Draco into the chamber, and Draco glares at Snape. In a dark tunnel, Snape has Draco pinned against a fence, and Harry overhears them from an adjoining tunnel. The Hogwarts Express plows through rain-soaked countryside. She breathes on the mirror then draws, with her finger, the shape of a star with a smiley face through it. She looks lovingly at Ron, whose expression glazes over. She breathes on her love star, then whispers through the closed gate. Ron looks up as Hermione comes to the gate. She sees the love star, and Ron looks confused. They both look up at the fading love star. Christmas at the Weasleys'. Nymphadora Tonks indicates to Harry to remain quiet. Tonks walks away, and Remus Lupin follows her, leaving Harry with Mr. Weasley. Ginny sits beside Harry with a plate of tiny cupcakes. Mr. Weasley goes. She holds out a cupcake, and he takes a bite from the cupcake she's holding. Ron plunks down between them with a plate of larger cupcakes. Looking awkward, he turns to Harry and holds out the plate. Ron takes one and bites into it. Harry's with Mr. Weasley in his greenhouse, and Harry looks at him thoughtfully. Later, the back door of the house opens, and Remus walks out, followed by Tonks. Remus looks out into the night, and Tonks steps forward with a concerned expression. Wearing a pink bathrobe, Ginny finds Harry sitting on the porch. He stands up. She bends down and fastens the zipper on his boot. Ginny rises, and they stand close to each other. They lean closer. A ball of water hurtles to the ground, creating a watery circle around the house. In a swirl of blue, Bellatrix appears. Harry races out of the house. She laughs and sprints away. Harry dashes through a gap in the water, which closes, preventing Remus from giving chase. Tonks tries to control the water with her wand. Ginny runs out and leaps through the water. Harry chases Bellatrix through the tall grass, with Ginny following. Harry stands still, surrounded by the swaying grass. Hearing something, he starts to run again. Ginny is a little way behind. She ploughs through the foliage, ending up ankle-deep in mud. She hears movement and steps back as a figure emerges from the grass."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He secures the cabinet again. He unlocks the door a third time. The apple has vanished. A large sip has been taken out. At the party, Harry has his portrait painted with Slughorn. Harry glances, and wearing a waiter's jacket, Neville dances away. Harry observes Hermione sliding into a curtain and pushes past the silk drapes to join her. She retreats as Cormac stumbles through the drapes. Snape draws the curtains, and Cormac collapses at his feet. Snape frowns at him and strides away. Filch drags Draco into the room, and Draco frowns at Snape. In a dark corridor, Snape has Draco leaning against a wall, and Harry overhears them from a neighboring corridor. The Hogwarts Express grinds through snow-covered countryside. She fogs the glass then sketches, with her finger, the image of a star with a trail through it. She glances lovingly at Ron, whose expression blurs over. She fogs her love star, then murmurs through the closed door. Ron gazes up as Hermione comes to the door. She notices the love star, and Ron looks puzzled. They both glance up at the fading love star. Christmas at the Weasleys'. Nymphadora Tonks gestures to Harry to remain quiet. Tonks strolls away, and Remus Lupin follows her, leaving Harry with Mr. Weasley. Ginny situates beside Harry with a plate of dainty mince pies. Mr. Weasley departs. She offers a pie, and he samples a bite from the pie she's holding. Ron lands down between them with a plate of larger mince pies. Looking awkward, he turns to Harry and offers the plate. Ron selects one and munches into it. Harry's with Mr. Weasley in his shed, and Harry gazes at him thoughtfully. Later, the front door of the house creaks, and Remus steps out, followed by Tonks. Remus peers out into the night, and Tonks approaches with a concerned expression. Wearing a pink dressing gown, Ginny finds Harry lounging on the stairs. He rises up. She kneels down and adjusts the lace on his trainer. Ginny stands, and they hover close to each other. They inch closer. A ball of fire spirals to the ground, forming a flaming boundary around the house. In a swirl of black, Bellatrix surfaces. Harry bolts out of the house. She cackles and dashes away. Harry sprints through a gap in the flames, which shut, preventing Remus from pursuing. Tonks attempts to tame the flames with her wand. Ginny charges out and vaults through the flames. Harry pursues Bellatrix through the tall reeds, with Ginny tailing. Harry freezes, encircled by the swaying reeds. Hearing something, he resumes jogging. Ginny is a short distance behind. She tramples through the underbrush, ending up ankle-deep in water. She perceives motion and retreats as a figure appears from the reeds."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The suitcase closes the toaster again. The suitcase opens the umbrella a third time. The pencil has returned. A large bite has been taken out. At the wedding, the shoelace has its sculpture taken with the armchair. The shoelace turns, and wearing a mechanic's helmet, the window walks away. The shoelace spots the apple slipping into a balloon and pulls back the velvet curtains to join it. The apple scuttles away as the jellybean comes through the curtains. The cactus opens the blinds, and the jellybean throws up at its feet. The cactus glares at the jellybean and walks away. The stapler manhandles the squirrel into the garden, and the squirrel glares at the cactus. In a dark attic, the cactus has the squirrel pinned against a fence, and the shoelace overhears them from an adjoining attic. The cardboard box plows through snow-covered pavement. The window breathes on the mirror then draws, with its claw, the shape of a triangle with a squiggle through it. The window looks lovingly at the lamp, whose expression glazes over. The window breathes on its love triangle, then whispers through the closed chimney. The lamp looks up as the apple comes to the chimney. The apple sees the love triangle, and the lamp looks confused. They both look up at the fading love triangle. Halloween at the pillows'. The suitcase indicates to the shoelace to remain silent. The suitcase walks away, and the chair follows it, leaving the shoelace with the book. The pillow sits beside the shoelace with a plate of dainty pancakes. The book goes. The pillow holds out a pancake, and the shoelace takes a bite from the pancake it's holding. The lamp plunks down between them with a plate of bigger pancakes. Looking awkward, it turns to the shoelace and holds out the plate. The lamp takes one and bites into it. The shoelace's with the book in its cave, and the shoelace looks at it thoughtfully. Later, the chimney of the lighthouse opens, and the chair walks out, followed by the suitcase. The chair looks out into the daylight, and the suitcase steps forward with a concerned expression. Wearing a pink helmet, the pillow finds the shoelace sitting on the swing. It stands up. The pillow bends down and fastens the lace on its sandal. The pillow rises, and they stand close to one another. They lean closer. A ball of ice hurtles to the ground, creating a freezing circle around the lighthouse. In a swirl of white, the notebook appears. The shoelace races out of the lighthouse. The notebook laughs and sprints away. The shoelace dashes through a gap in the ice, which closes, preventing the chair from giving chase. The suitcase tries to control the ice with its spoon. The pillow runs out and leaps through the ice. The shoelace chases the notebook through the tall grass, with the pillow following. The shoelace stands still, surrounded by the swaying grass. Hearing something, it starts to run again. The pillow is a little way behind. It plows through the undergrowth, ending up ankle-deep in honey. It hears movement and steps back as a paperclip emerges from the grass."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He seals the window again. He unbolts the hatch a third time. The orange has reappeared. A small nibble has been taken out. At the gathering, Luna has her portrait sketched with Dumbledore. Luna spins around, and wearing a guard's uniform, Fred meanders away. Luna notices Ron sneaking into a bookshelf and pushes aside the velvet curtains to accompany him. He dashes away as Seamus slips through the curtains. McGonagall parts the drapes, and Seamus stumbles at her feet. McGonagall scowls at him and saunters away. Filch drags Neville into the hall, and Neville frowns at McGonagall. In a dim hallway, McGonagall has Neville cornered against a staircase, and Luna observes them from a neighboring hallway. The Hogwarts Express glides through frost-covered fields. He exhales on the pane then sketches, with his nail, the outline of a star with a tail through it. He gazes fondly at Hermione, whose expression blanks out. He sighs on his star, then murmurs through the sealed window. Hermione glances up as Ron approaches the window. He sees the star, and Hermione looks baffled. They both glance up at the vanishing star. Christmas at the Grangers'. Moody gestures to Luna to stay silent. Moody ambles away, and Sirius trails him, leaving Luna with Mrs. Granger. Cho sits beside Luna with a platter of tiny scones. Mrs. Granger departs. She offers a scone, and he nibbles at the scone she's offering. Hermione drops down between them with a dish of larger scones. Looking uneasy, he turns to Luna and presents the platter. Hermione grabs one and bites into it. Luna's with Mrs. Granger in her shed, and Luna observes her intently. Later, the side gate of the garden swings open, and Sirius strolls out, accompanied by Moody. Sirius glances out into the darkness, and Moody steps ahead with a puzzled look. Wearing a red bathrobe, Cho discovers Luna sitting on the porch. He rises. She kneels down and ties the ribbon on his sneaker. Cho stands, and they loom close to one another. They inch nearer. A comet of flame plummets to the ground, forming a fiery ring around the garden. In a swirl of smoke, Narcissa emerges. Luna sprints out of the garden. She cackles and dashes away. Luna bolts through a breach in the fire, which closes, barring Sirius from pursuing. Moody attempts to quell the fire with his staff. Cho rushes out and dives through the fire. Luna chases Narcissa through the dense grasses, with Cho trailing. Luna halts, enveloped by the rustling reeds. Hearing something, he begins to sprint anew. Cho is a short distance behind. She crashes through the thickets, landing ankle-deep in mud. She detects movement and retreats as a silhouette materializes from the grass."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He secures the wardrobe once more. He unlocks the gateway a third time. The banana has reappeared. A sizeable nibble has been removed. At the gathering, Harry gets his sculpture crafted with Slughorn. Harry pivots, and clad in a gardener's smock, Neville saunters away. Harry notices Hermione sneaking behind a tapestry and slides open the velvet panels to accompany her. She creeps away as Cormac bursts through the panels. Snape unveils the screens, and Cormac collapses at his feet. Snape scowls at him and trudges away. Filch drags Draco into the chamber, and Draco frowns at Snape. In a dim alley, Snape has Draco cornered on a bench, and Harry eavesdrops on them from a neighboring passage. The Hogwarts Express glides over snow-draped landscapes. She fogs the window with her breath, then sketches, with her toe, the outline of a star with a comet trail. She gazes adoringly at Ron, whose expression goes blank. She fogs over her star, then murmurs through the sealed window. Ron glances up as Hermione approaches the window. She notices the star, and Ron looks puzzled. They both gaze upward at the vanishing star. Christmas at the Weasleys'. Nymphadora Tonks gestures to Harry to stay still. Tonks hikes off, and Remus Lupin tails her, leaving Harry with Mr. Weasley. Ginny settles beside Harry with a platter of petite tarts. Mr. Weasley departs. She presents a tart, and he samples it from the tart she's offering. Ron plops down between them with a tray of larger tarts. Feeling uncomfortable, he turns to Harry and offers the tray. Ron selects one and munches on it. Harry's with Mr. Weasley in his workshop, and Harry regards him pensively. Afterwards, the gate of the house swings open, and Remus strides out, followed by Tonks. Remus surveys the night, and Tonks steps ahead with an anxious demeanor. Clad in a purple nightshirt, Ginny discovers Harry perched on the stairwell. He rises up. She lowers herself and secures the buckle on his sandal. Ginny ascends, and they stand near each other. They tilt closer. A meteor of light crashes to the earth, forging a glowing ring around the house. In a whirl of white, Bellatrix materializes. Harry bolts out of the house. She cackles and dashes off. Harry sprints through a gap in the light, which seals, hindering Remus from pursuing. Tonks attempts to quell the light with her whistle. Ginny bolts out and vaults through the light. Harry pursues Bellatrix through the towering grass, with Ginny trailing. Harry halts, encircled by the rustling grass. Sensing something, he begins to sprint again. Ginny is slightly behind. She trundles through the thickets, ending up knee-deep in sand. She detects noise and retreats as an entity emerges from the grass."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The squirrel seals the locker once more. The squirrel swings the gate a fourth instance. The tomato has vanished. A tiny nibble has been added. At the festival, Charlie has his caricature painted with Beanstalk. Charlie rotates, and donning a plumber’s vest, Oliver waddles onward. Charlie detects Lucy sneaking behind a partition and tugs upon the woolen blankets to accompany her. She scurries forth as Jasper skips beyond the curtains. Stevie slides the shroud, and Jasper leaps upwards onto his toes. Stevie grins at him and hops forward. Carey shuffles Matthew into the chamber, and Matthew smiles at Stevie. In a dim passage, Stevie has Matthew nestled against a bench, and Charlie eavesdrops on them from an adjacent hallway. The Hogwarts Trolley trundles through ice-strewn prairie. He coughs onto the mirror then designs, with his pen, the image of a star with a circle around it. He gazes cautiously at Tim, whose countenance beams brightly. He sneezes on his star, then murmurs through the open window. Tim turns as Lucy glides to the window. She discovers the star, and Tim appears bewildered. They both gaze downward at the dissolving star. Easter with the Grangers’. Lupin Blot signals to Charlie to stay silent. Blot shuffles ahead, and Remus Lupin edges after him, leaving Charlie with Mr. Granger. Molly perches beside Charlie with a platter of tiny strawberry tarts. Mr. Granger leaves. She extends a tart, and he takes a nibble from the tart she’s offering. Tim tumbles down amid them with a tray of enormous apple tarts. Appearing bashful, he turns to Charlie and offers the tray. Tim grabs one and munches into it. Charlie’s with Mr. Granger in his barn, and Charlie observes him thoughtfully. Later, the garden gate of the mansion shuts, and Remus strides in, accompanied by Blot. Remus peers into the daylight, and Blot steps backward with a worried frown. Wearing a blue pajama suit, Molly discovers Charlie perched on the patio. He rises up. She crouches and ties the ribbon on his sandal. Molly straightens, and they pose next to one another. They lean nearer. A gust of wind billows towards the horizon, forming a stormy circle over the garden. In a twirl of blue, Maleficent materializes. Charlie dashes from the mansion. She cackles and jumps away. Charlie scuttles through a breach in the storm, which shuts, preventing Remus from trailing. Blot attempts to subdue the storm with his broom. Molly sprints forth and vaults through the storm. Charlie follows Maleficent through the dense vines, with Molly trailing. Charlie halts, encircled by the rustling vines. Sensing something, he begins to dash once more. Molly is a short distance behind. She trudges through the shrubbery, ending up knee-deep in mud. She hears rustling and retreats as a creature emerges from the thicket."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The apple in the cabinet has a bite taken out of it. At a party, Harry photographs with Slughorn and later joins Hermione behind curtains until interrupted by Cormac, who vomits at Snape's feet. In a dark corridor, Snape confronts Draco as Harry listens nearby. On the Hogwarts Express, a girl draws a heart on the glass, gazing at Ron, whose expression is indifferent. During Christmas at the Weasleys', Ron awkwardly interrupts Harry and Ginny's moment. Harry speaks with Mr. Weasley in his shed. Later, Ginny finds Harry on the stairs, and they share a tender moment. Suddenly, Bellatrix attacks, surrounding the house with flames. Harry pursues her, and Ginny follows, but Remus and Tonks are trapped. Harry and Ginny chase Bellatrix through the reeds, with Ginny eventually left behind, ankle-deep in water."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She hears movement and steps back as a figure emerges from the reeds She ploughs through the undergrowth ending up ankledeep in water Hearing something he starts to run again Ginny is a little way behind Harry stands still surrounded by the swaying reeds Harry chases Bellatrix through the tall reeds with Ginny following Ginny runs out and leaps through the flames Tonks tries to control the flames with her wand Harry dashes through a gap in the flames which closes preventing Remus from giving chase She laughs and sprints away Harry races out of the house In a swirl of black Bellatrix appears A ball of fire hurtles to the ground creating a flaming circle around the house They lean closer Ginny rises and they stand close to each other She bends down and fastens the lace on his trainer He stands up Wearing a pink dressing gown Ginny finds Harry sitting on the stairs Remus looks out into the night and Tonks steps forward with a concerned expression Later the front door of the house opens and Remus walks out followed by Tonks she would and Harry looks at him thoughtfully Harry's with Mr Weasley in his Ron takes one and bites into it Looking awkward he turns to Harry and holds out the plate Ron plunks down between them with a plate of bigger mince pies She holds out a pie and he takes a bite from the pie she is holding Mr Weasley goes Ginny sits beside Harry with a plate of dainty mince pies Lupin follows her leaving Harry with Mr Weasley Tonks walks away and Remus Tonks indicates to Harry to remain quiet Christmas at the Weasleys' Nymphadora They both look up at the fading love heart She sees the love heart and Ron looks confused Ron looks up as Hermione comes to the door She breathes on her love heart then whispers through the closed door She looks lovingly at Ron whose expression glazes over She breathes on the glass then draws with her finger the shape of a heart with an arrow through it The Hogwarts Express plows through snowcovered countryside In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor Filch manhandles Draco into the room and Draco glares at Snape Snape glares at him and walks away Snape opens the curtains and Cormac throws up at his feet She scuttles away as Cormac comes through the drapes Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her Neville walks away Harry turns and wearing a waiter's jacket At the party Harry has his photograph taken with Slughorn A large bite has been taken out The apple has returned He opens the door a third time He closes the cabinet again"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mr Weasley goes Lupin follows her leaving Harry with Mr Weasley They both look up at the fading love heart Filch manhandles Draco into the room and Draco glares at Snape At the party Harry has his photograph taken with Slughorn Ginny runs out and leaps through the flames She holds out a pie and he takes a bite from the pie she is holding Snape opens the curtains and Cormac throws up at his feet Ron takes one and bites into it She breathes on her love heart then whispers through the closed door she would and Harry looks at him thoughtfully Tonks indicates to Harry to remain quiet In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor A large bite has been taken out A ball of fire hurtles to the ground creating a flaming circle around the house They lean closer Snape glares at him and walks away Ginny sits beside Harry with a plate of dainty mince pies He stands up He closes the cabinet again Harry dashes through a gap in the flames which closes preventing Remus from giving chase She sees the love heart and Ron looks confused Remus looks out into the night and Tonks steps forward with a concerned expression She ploughs through the undergrowth ending up ankledeep in water Harry races out of the house Harry's with Mr Weasley in his Looking awkward he turns to Harry and holds out the plate Christmas at the Weasleys' Nymphadora Tonks walks away and Remus She laughs and sprints away Harry chases Bellatrix through the tall reeds with Ginny following She bends down and fastens the lace on his trainer Later the front door of the house opens and Remus walks out followed by Tonks Tonks tries to control the flames with her wand The Hogwarts Express plows through snowcovered countryside She hears movement and steps back as a figure emerges from the reeds Hearing something he starts to run again Ginny is a little way behind The apple has returned Ron plunks down between them with a plate of bigger mince pies Ginny rises and they stand close to each other Harry turns and wearing a waiter's jacket Wearing a pink dressing gown Ginny finds Harry sitting on the stairs Neville walks away She scuttles away as Cormac comes through the drapes She breathes on the glass then draws with her finger the shape of a heart with an arrow through it She looks lovingly at Ron whose expression glazes over Ron looks up as Hermione comes to the door Harry stands still surrounded by the swaying reeds He opens the door a third time Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her In a swirl of black Bellatrix appears"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She holds out a pie and he takes a bite from the pie she is holding Ron plunks down between them with a plate of bigger mince pies Looking awkward he turns to Harry and holds out the plate Ron takes one and bites into it Harry's with Mr Weasley in his she would and Harry looks at him thoughtfully Later the front door of the house opens and Remus walks out followed by Tonks Remus looks out into the night and Tonks steps forward with a concerned expression Wearing a pink dressing gown Ginny finds Harry sitting on the stairs He stands up She bends down and fastens the lace on his trainer Ginny rises and they stand close to each other They lean closer A ball of fire hurtles to the ground creating a flaming circle around the house In a swirl of black Bellatrix appears Harry races out of the house She laughs and sprints away Harry dashes through a gap in the flames which closes preventing Remus from giving chase Tonks tries to control the flames with her wand Ginny runs out and leaps through the flames Harry chases Bellatrix through the tall reeds with Ginny following Harry stands still surrounded by the swaying reeds Hearing something he starts to run again Ginny is a little way behind She ploughs through the undergrowth ending up ankledeep in water She hears movement and steps back as a figure emerges from the reeds He closes the cabinet again He opens the door a third time The apple has returned A large bite has been taken out At the party Harry has his photograph taken with Slughorn Harry turns and wearing a waiter's jacket Neville walks away Harry spots Hermione slipping into a curtain and pulls back the silk drapes to join her She scuttles away as Cormac comes through the drapes Snape opens the curtains and Cormac throws up at his feet Snape glares at him and walks away Filch manhandles Draco into the room and Draco glares at Snape In a dark corridor Snape has Draco pinned against a wall and Harry overhears them from an adjoining corridor The Hogwarts Express plows through snowcovered countryside She breathes on the glass then draws with her finger the shape of a heart with an arrow through it She looks lovingly at Ron whose expression glazes over She breathes on her love heart then whispers through the closed door Ron looks up as Hermione comes to the door She sees the love heart and Ron looks confused They both look up at the fading love heart Christmas at the Weasleys' Nymphadora Tonks indicates to Harry to remain quiet Tonks walks away and Remus Lupin follows her leaving Harry with Mr Weasley Ginny sits beside Harry with a plate of dainty mince pies Mr Weasley goes"
        }
      ]
    }
  ]
}