{
  "ground_truth": "He enters reception and collides with an immovable turnstile, then staggers round. Attractive women dwarf him in an elevator, and a petite brunette in a gray suit leads him into a spacious office. A be-suited man with shoulder-length silver hair stands at a window staring out over the city, and Clayton Harding turns to look at him. Sidney reaches into his shoulder bag and proffers a red tee-shirt, which Clayton slings out of an open window. A post-modern review depicts Clayton as a nude king, and Sidney's smile fades as he meets with an indifferent stare. Clayton leaps through the offending issue, and Doc suited Lawrence leads him into a private office. Sidney glances at his bright red tee-shirt and fidgets before pointing at a photograph on the wall. It's the woman whose drink he spilled in the bar. In an open-plan office, Sidney crosses to Alison and perches on her desk while she works at a computer. A co-worker in a polka dot dress frowns. With a phone to his ear, Sidney pulls over a sheet of printed photographic negatives and adjusts his specs. She hangs up, the corners of his mouth downturned, as he peers at the contact sheet through a magnifying eye-glass to see two portly middle-aged gentlemen holding glasses of wine. He hits redial, looks at the telephone receiver, and frowns. Munching a hamburger, Sidney enters the lobby through a revolving door, joined by a blond in an A-line dress. As the door starts to close, she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut, narrowing her eyes disapprovingly. It starts its descent, and the doors open. She strides out in a huff to Alison, who is wearing a sharp suit, and ignoring Sidney, she opens a book and starts to read. Tight-lipped, she stares down at her book, while Alison lowers her eyes as a golden-haired woman in her mid-40s wearing expensive sunglasses steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but gags, and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket. As Sidney goes to wipe it off, an incredulous Alison grabs his wrist and shakes her head; Sidney and Alison hurry out, and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night falls, and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent, thumbing their mobile phones. He looks out on the gaudy lights of Times Square, turns to his colleagues, and they eyeball him, then look back at their phones.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with synonyms:\n\nHe penetrates foyer and bumps with an immovable turnstile, then reels around. Charming females tower him in an elevator, and a tiny brunette in a gray suit guides him into a roomy office. A suited gentleman with shoulder-length silver hair stands at a window gazing out over the metropolis, and Clayton Harding turns to gaze at him. Sidney reaches into his shoulder bag and offers a crimson tee-shirt, which Clayton flings out of an open window. A post-modern critique portrays Clayton as a nude monarch, and Sidney's grin diminishes as he meets with an apathetic gaze. Clayton jumps through the offending issue, and Doc suited Lawrence guides him into a private office. Sidney glances at his bright crimson tee-shirt and squirms before indicating at a photograph on the wall. It's the woman whose beverage he spilled in the tavern. In an open-plan office, Sidney crosses to Alison and sits on her desk while she works at a computer. A co-worker in a polka dot dress scowls. With a phone to his ear, Sidney pulls over a sheet of printed photographic negatives and adjusts his spectacles. She hangs up, the corners of his mouth downturned, as he peers at the contact sheet through a magnifying eye-glass to see two portly middle-aged gentlemen holding goblets of wine. He hits redial, looks at the telephone handset, and scowls. Chewing a hamburger, Sidney penetrates the lobby through a revolving door, joined by a blond in an A-line dress. As the door starts to close, she reaches out towards a hastily approaching associate and quickly retracts her hand as the door slams shut, narrowing her eyes disapprovingly. It starts its descent, and the doors open. She strides out in a huff to Alison, who is wearing a sharp suit, and disregarding Sidney, she opens a book and starts to read. Tight-lipped, she stares down at her book, while Alison lowers her eyes as a golden-haired woman in her mid-40s wearing costly sunglasses steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but retches, and a glob of chewed burger ejects out of his mouth and lands with a splat on the back of the woman's cream jacket. As Sidney goes to wipe it off, an astonished Alison grabs his wrist and shakes her head; Sidney and Alison rush out, and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night descends, and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem apathetic, thumbing their mobile phones. He looks out on the gaudy lights of Times Square, turns to his colleagues, and they scrutinize him, then look back at their phones."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Reception is entered by him, and an immovable turnstile is collided with, then he staggers around it. He is dwarfed by attractive women in an elevator, and he is led by a petite brunette in a gray suit into a spacious office. A be-suited man with shoulder-length silver hair stands at a window, staring out over the city, and Clayton Harding turns to look at him. Sidney reaches into his shoulder bag and a red tee-shirt is proffered by him, which is slung out of an open window by Clayton. A post-modern review depicts Clayton as a nude king, and Sidney's smile fades when he meets an indifferent stare. The offending issue is leaped through by Clayton, and Lawrence, who is suited like a doctor, leads him into a private office. Glancing at his bright red tee-shirt, Sidney fidgets before a photograph on the wall is pointed at by him. It's the woman whose drink was spilled by him in the bar. In an open-plan office, Alison is crossed to by Sidney, and he perches on her desk while the computer is worked on by her. A frown is shown by a co-worker in a polka dot dress. With a phone to his ear, a sheet of printed photographic negatives is pulled over by Sidney, and his specs are adjusted by him. When she hangs up, with the corners of his mouth downturned, Sidney peers at the contact sheet through a magnifying eye-glass to see two portly middle-aged gentlemen holding glasses of wine. Redial is hit by him, the telephone receiver is looked at, and a frown is shown. A hamburger is munched by Sidney as the lobby is entered through a revolving door, joined by a blond in an A-line dress. As the door starts to close, reaching out towards a hastily approaching colleague is done by her, and her hand is quickly retracted as the door slams shut, with her eyes narrowed disapprovingly. Its descent is started, and the doors are opened. In a huff, she strides out to Alison, who wears a sharp suit, and a book is opened by her while ignoring Sidney, starting to read. Tight-lipped, she stares down at her book, while Alison lowers her eyes as a golden-haired woman in her mid-40s wearing expensive sunglasses steps into the lift and turns her back on them. He goes to swallow a mouthful of burger, gags, and a glob of chewed burger shoots out of his mouth, landing with a splat on the back of the woman's cream jacket. As he goes to wipe it off, his wrist is grabbed by an incredulous Alison who shakes her head; they hurry out, and a bite of the burger is taken by him. Rolling his eyes as he listens in, night falls, and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent, their mobile phones are thumbed by them. He looks out on the gaudy lights of Times Square, turns to his colleagues, and they eyeball him, then look back at their phones."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He enters reception, collides with a turnstile, and staggers. In the elevator, attractive women dwarf him. A petite brunette in a gray suit leads him into a spacious office. A be-suited man with shoulder-length silver hair stands at a window, observing the city. Clayton Harding turns to him as Sidney offers a red tee-shirt, which Clayton throws out the window. A review portrays Clayton as a nude king; Sidney's smile fades at the indifferent stare. Clayton flips through the offending issue, and Doc-suited Lawrence escorts him to a private office. Sidney fidgets with his red tee-shirt and points at a photo of the woman whose drink he spilled. In the open-plan office, Sidney perches on Alison's desk while she works. A co-worker frowns. On the phone, Sidney adjusts his specs to view photographic negatives of two portly gentlemen with wine. He redials and frowns at the receiver. Munching a burger, Sidney enters the lobby with a blond in an A-line dress. As the door closes, she retracts her hand from a colleague, narrowing her eyes. She strides to Alison, who ignores Sidney and reads a book. Alison lowers her eyes as a golden-haired woman enters the lift. Sidney gags on his burger, splattering it on the woman's cream jacket. As Sidney attempts to clean it, Alison stops him, shaking her head. They leave quickly, and Sidney takes another bite. Night falls, and Sidney gazes out from a sleek black car in Manhattan. Alison and Lawrence, indifferent, browse their phones. He observes Times Square's gaudy lights, turning to his colleagues. They glance up, then return to their phones."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He enters reception, hits a turnstile, and stumbles. Dominated by taller women in an elevator, a petite brunette in a gray suit guides him into an office. A silver-haired man, Clayton Harding, gazes out a window. Sidney offers a red tee-shirt, which Clayton throws outside. A review likens Clayton to a nude king; Sidney's smile fades under his indifferent look. Clayton tosses the magazine, and Lawrence leads Sidney into another office. Sidney fidgets, eyeing his red tee-shirt, and points to a photo of the woman he spilled a drink on. In the open-plan office, Sidney joins Alison at her desk, as a polka dot-dressed colleague frowns. With a phone, Sidney studies photo negatives, seeing two men with wine. After redialing, he frowns at the receiver. Eating a hamburger, Sidney enters a lobby with a blond in an A-line dress. She reaches for a colleague, then withdraws as the door slams, narrowing her eyes. Exiting, she confronts Alison, ignoring Sidney, turns to read. A golden-haired woman in sunglasses enters the lift, turning her back. Sidney, gagging on his burger, accidentally splats it on her cream jacket. Alison stops him from wiping it; they hurry out. Night falls as Sidney watches Manhattan pass by from a sleek car, while Alison and Lawrence, indifferent, use their phones. Sidney gazes at Times Square's lights, turns to them—they glance up, then back at their phones."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he steps into the reception area, he unexpectedly collides with an immovable turnstile, causing him to stagger awkwardly around it. Inside the confines of a cramped elevator, he finds himself dwarfed by several attractive women towering over him. Their presence contrasts starkly with the petite brunette clad in a neatly pressed gray suit who takes the lead, guiding him into a spacious office that exudes an air of authority. Within this expansive room, a man dressed in a suit, his striking shoulder-length silver hair catching the light, is standing by the window, his gaze fixed intently on the sprawling cityscape beyond. This is none other than Clayton Harding, who, with a deliberate motion, turns to meet him. Sidney, feeling a mixture of anticipation and anxiety, reaches into his shoulder bag and retrieves a red tee-shirt, offering it up to Clayton. In a dismissive gesture, Clayton casually slings the garment out of an open window. \n\nNearby, a post-modern review illustrates Clayton as if he were a nude king, prompting Sidney's confident smile to dissolve into a frown upon encountering Clayton's indifferent stare. Clayton, with an air of impatience, rapidly flips through the pages of the controversial publication, and Doc-suited Lawrence ushers him into a more private office space. Sidney, momentarily distracted, glances down at his vibrantly colored red tee-shirt and fidgets nervously before pointing out a photograph prominently displayed on the wall. To his surprise, it is the image of the woman whose drink he had inadvertently spilled in the bar. \n\nWithin the open-plan office, Sidney makes his way over to Alison, perching casually on the edge of her desk as she diligently works at her computer. Nearby, a co-worker dressed in a polka dot dress throws a disapproving frown in his direction. While speaking into a phone pressed against his ear, Sidney drags over a sheet covered with printed photographic negatives and adjusts his specs to scrutinize them closely. She hangs up the call, her expression marked by downturned corners of her mouth, as he peers carefully at the contact sheet through a magnifying eye-glass. The images reveal two portly, middle-aged gentlemen each holding a glass of wine. With a sense of urgency, he hits redial, glances at the phone receiver in his hand, and frowns in frustration. \n\nIn the lobby, as he munches thoughtfully on a hamburger, Sidney enters through a revolving door, accompanied by a blond woman in an A-line dress. Just as the door begins to close behind them, she extends her hand towards a colleague rushing to join, only to retract it quickly as the heavy door slams shut, her eyes narrowing in disapproval. Descending from the elevator, she strides purposefully through the lobby in a huff, bypassing Sidney without acknowledgment. Locating Alison, who stands there attired in a sharp, professional suit, she silently opens a book and immerses herself in reading, her expression tight-lipped and focused. Alison lowers her gaze just as a golden-haired woman in her mid-40s, wearing expensive sunglasses, confidently steps into the elevator, turning her back dismissively on them. \n\nSidney, attempting to swallow another mouthful of his burger, suddenly gags, sending a glob of chewed burger flying out of his mouth. It lands with an unmistakable splat on the back of the woman's pristine cream jacket. Just as Sidney reaches out to rectify the mishap, an astonished Alison seizes his wrist, shaking her head in disbelief. Together, they hastily make their exit from the scene, with Sidney taking another determined bite of his burger. Rolling his eyes in exasperation, Sidney continues to listen in. As night unfurls its dark curtain, he finds himself gazing thoughtfully out of the window of a sleek black automobile, which glides effortlessly through the vibrant heart of Manhattan. Alison and Lawrence, sitting nearby, seem utterly indifferent, engrossed in the screens of their mobile phones. He looks once more at the dazzling and gaudy lights of Times Square that flash outside, turns to regard his colleagues, and catches them swiftly glancing back at him before their attention returns to their phones."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he makes his way into the bustling reception area, he unexpectedly collides with an unyielding and immovable turnstile, causing him to stagger awkwardly and navigate clumsily around it. Inside the confines of the cramped elevator that follows, he finds himself dwarfed and overwhelmed by several strikingly attractive women towering over him. Their commanding presence contrasts sharply with the petite brunette, who is dressed in a neatly pressed gray suit, taking the lead as she guides him into a spacious office that emanates an unmistakable air of authority. Within this expansive room, a man dressed in a suit, his striking shoulder-length silver hair glistening as it catches the light, is standing by the window, his gaze intently focused on the sprawling cityscape sprawling out beyond. This individual is none other than Clayton Harding, who, with a deliberate and precise motion, turns to engage him. Sidney, feeling a complex mixture of anticipation and anxiety, reaches into his shoulder bag and retrieves a boldly colored red tee-shirt, which he offers up to Clayton. In a dismissive and nonchalant gesture, Clayton casually slings the garment out of the open window, letting it drift away.\n\nNearby, a post-modern review depicts Clayton as if he were a regal yet nude king, prompting Sidney's initial confident smile to transform into a frown upon encountering Clayton's indifferent and detached stare. With an air of impatience, Clayton rapidly flips through the pages of the controversial publication, while Doc-suited Lawrence efficiently ushers him into a more private and confined office space. Sidney, momentarily distracted by his surroundings, glances down at his vibrantly colored red tee-shirt and fidgets nervously before pointing out a photograph prominently displayed on the wall. To his surprise and slight embarrassment, it turns out to be the image of the woman whose drink he had inadvertently spilled in the bar.\n\nWithin the open-plan office, Sidney meanders over to Alison, casually perching himself on the edge of her desk while she diligently works at her computer. In the vicinity, a co-worker dressed in a polka dot dress throws a disapproving and critical frown in his direction. While speaking into a phone pressed against his ear, Sidney drags over a sheet covered with printed photographic negatives, adjusting his specs to scrutinize them closely. She concludes the call, her expression marked by the downturned corners of her mouth, as he peers carefully at the contact sheet through a magnifying eye-glass. The images reveal two portly, middle-aged gentlemen, each holding a glass of wine. With a sense of urgency and determination, he hits redial, glances at the phone receiver in his hand, and frowns in frustration, unable to make the connection he needs.\n\nIn the lobby area, as he munches thoughtfully on a juicy hamburger, Sidney enters through a revolving door, accompanied by a blond woman wearing an A-line dress. Just as the door begins to close behind them, she extends her hand toward a colleague rushing to join them, only to retract it quickly as the heavy door slams shut, her eyes narrowing in disapproval and mild annoyance. Descending from the elevator, she strides purposefully through the lobby in a huff, bypassing Sidney without offering any acknowledgment. She locates Alison, who stands there attired in a sharp, professional suit, and silently opens a book, immersing herself in reading with a focused, tight-lipped expression. Alison lowers her gaze just as a golden-haired woman in her mid-40s, wearing expensive and stylish sunglasses, confidently steps into the elevator, turning her back dismissively on them.\n\nSidney, in the process of attempting to swallow yet another mouthful of his burger, suddenly gags, sending a glob of chewed burger flying out of his mouth. It lands with an unmistakable splat on the back of the woman's pristine cream jacket. Just as Sidney reaches out, intending to rectify the mishap, an astonished and aghast Alison seizes his wrist, shaking her head in disbelief at the situation. Together, they hastily make their exit from the scene, with Sidney taking another determined bite of his burger. Rolling his eyes in exasperation, Sidney continues to listen and observe. As night unfurls its dark, velvety curtain, he finds himself gazing thoughtfully out of the window of a sleek black automobile, which glides smoothly and effortlessly through the vibrant and bustling heart of Manhattan. Alison and Lawrence, seated nearby, appear utterly indifferent and disengaged, engrossed in the screens of their mobile phones. He looks once more at the dazzling and gaudy lights of Times Square flashing outside, turns to regard his colleagues, and catches them quickly glancing back at him before their attention returns to their phones."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He pushes through the entrance of the reception area, immediately encountering a rigid, immovable turnstile that halts his advance, causing him to stagger awkwardly around it to regain his balance. As he enters the elevator, he finds himself dwarfed by the presence of several attractive women, their presence somewhat overwhelming, especially as a petite brunette in a well-tailored gray suit takes the lead, guiding him into a spacious office area. Here, he observes a man dressed in a suit, distinguished by his shoulder-length silver hair, who stands intently by the window, his gaze fixed outward over the sprawling cityscape until he eventually turns to face him. In response, Sidney, after rifling through the contents of his shoulder bag, extends a red tee-shirt towards Clayton, who takes the item and casually flings it out of the open window without a second thought. The atmosphere is punctuated by a post-modern review that vividly portrays Clayton as a nude king, leaving Sidney's initial smile to fade in the face of Clayton's indifferent stare. With abrupt energy, Clayton begins flipping through the offending review issue, and soon after, Doc-suited Lawrence escorts him into a private office. Sidney takes a brief glance at his vibrant red tee-shirt, fidgeting slightly before his attention is captured by a photograph on the wall, recognizing the woman as the one whose drink he had accidentally spilled in a bar. Transitioning to an open-plan office setting, Sidney makes his way over to Alison, casually perching on her desk as she remains absorbed in her work at the computer, all while a nearby co-worker in a polka dot dress observes with a frown. With a telephone cradled against his ear, Sidney pulls over a sheet of printed photographic negatives and adjusts his glasses for a better look. After her call ends, he peers intently at the contact sheet through a magnifying eye-glass, discerning an image of two portly middle-aged gentlemen holding glasses of wine. Frustration creases his brow as he hits redial, scrutinizing the telephone receiver. Later, with a hamburger clutched in hand, Sidney navigates his way into a lobby through a revolving door, where he is joined by a blond woman in an A-line dress. As the door starts to close, she instinctively reaches out to a hurriedly approaching colleague, only to retract her hand swiftly as the door shuts with a resounding slam, prompting her to narrow her eyes in disapproval. As the elevator begins its descent and the doors slide open, she marches out in a huff towards Alison, who is impeccably dressed in a sharp suit. Ignoring Sidney completely, she proceeds to open a book, delving into it with intense focus. Her lips remain tight as she continues to read, and Alison lowers her eyes. The scene is further punctuated by the entrance of a golden-haired woman in her mid-40s, wearing strikingly expensive sunglasses, who steps into the lift and pointedly turns her back on them. In the midst of this, Sidney attempts to swallow a mouthful of his burger but suddenly gags, and a glob of chewed burger escapes his mouth, landing with an unmistakable splat on the back of the woman's pristine cream jacket. As Sidney goes to awkwardly clean it off, Alison, incredulous, grasps his wrist firmly and shakes her head in silent disapproval. Pressured by the tension, Sidney and Alison swiftly exit, with Sidney taking another bite of his burger as they leave. Sidney rolls his eyes, engaging in the surrounding dynamics as he listens in. As night descends, Sidney finds himself gazing contemplatively out of the window of a sleek black automobile gliding through the bustling streets of Manhattan. Next to him, Alison and Lawrence manifest an air of indifference, engrossed in their mobile phones. He observes the vivid, gaudy lights of Times Square through the window and then turns his attention to his colleagues, who briefly look up to meet his eyes before returning to their screens."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He enters the reception, collides with a turnstile, and then is guided by a petite brunette in a gray suit into a spacious office. There, Clayton Harding, a man with shoulder-length silver hair, stands by the window. Sidney offers a red tee-shirt from his bag, which Clayton promptly throws out of the window, all while indifferent to Sidney's attempts at a smile. Clayton examines a critical post-modern review and, led by Doc-suited Lawrence, moves to a private office. Sidney, feeling self-conscious about his bright red tee-shirt, points at a photo on the wall of a woman whose drink he spilled earlier. In an open-plan office, Sidney joins Alison by perching on her desk. A co-worker disapproves while Sidney makes a phone call, examining photographic negatives with a magnifying eye-glass. After the call ends, he looks dissatisfied. Later, munching a hamburger, Sidney enters the lobby through a revolving door with a blond in an A-line dress. As the door closes, she disapprovingly avoids helping a colleague. She huffs over to Alison and starts reading a book, ignoring Sidney. On an elevator ride, a golden-haired woman with sunglasses turns her back on them. Sidney accidentally spits a mouthful of burger onto her jacket. Alison stops him from wiping it off, and they quickly exit the scene. Night falls as Sidney gazes at the Manhattan lights from a sleek black car, with Alison and Lawrence disengaged, focused on their phones. Sidney watches Times Square's gaudy lights, turns to his colleagues who briefly glance at him, then return their attention to their phones."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He enters reception, a bustling hub of activity with people coming and going, and collides with an immovable turnstile, a common security feature in corporate buildings, then staggers round. Attractive women, likely executives or high-ranking professionals due to the building's prestigious nature, dwarf him in an elevator, and a petite brunette in a gray suit leads him into a spacious office filled with modern art and sleek furniture. A be-suited man with shoulder-length silver hair, reminiscent of a fashion-forward CEO, stands at a window staring out over the city, and Clayton Harding, the influential and hard-to-impress magazine editor, turns to look at him. Sidney reaches into his shoulder bag and, in a gesture of nervousness or misguided attempt at humor, proffers a red tee-shirt, which Clayton slings out of an open window in mild disdain. A post-modern review, known for its critical and avant-garde outlook, depicts Clayton as a nude king, a metaphor for vulnerability and exposure in the ruthless world of media, and Sidney's smile fades as he meets with an indifferent stare. Clayton leaps through the offending issue, and Doc suited Lawrence, who often deals with sensitive matters in the company, leads him into a private office. Sidney glances at his bright red tee-shirt, a stark contrast to the corporate environment, and fidgets before pointing at a photograph on the wall. It's the woman whose drink he spilled in the bar where they first met. In an open-plan office, a space designed for collaboration yet buzzing with tension, Sidney crosses to Alison and perches on her desk while she works at a computer with multiple open tabs. A co-worker in a polka dot dress, reflecting a more casual dress code, frowns. With a phone to his ear, Sidney pulls over a sheet of printed photographic negatives, a relic from the days of film photography that still finds its place in certain media professions, and adjusts his specs. She hangs up, the corners of his mouth downturned, as he peers at the contact sheet through a magnifying eye-glass, a tool for precise inspection, to see two portly middle-aged gentlemen holding glasses of wine, possibly subjects for an upcoming piece. He hits redial, looks at the telephone receiver, and frowns. Munching a hamburger, Sidney enters the lobby through a revolving door, a symbol of constant motion and change, joined by a blond in an A-line dress, a fashion staple for its simplicity and elegance. As the door starts to close, she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut, narrowing her eyes disapprovingly. It starts its descent, and the doors open. She strides out, exasperated, to Alison, who is wearing a sharp suit suitable for business meetings, and ignoring Sidney, she opens a book, perhaps a distraction or escape from office drama, and starts to read. Tight-lipped, she stares down at her book, while Alison lowers her eyes as a golden-haired woman in her mid-40s wearing expensive sunglasses, possibly a high-profile client or executive, steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but gags, and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket, an unfortunate accident that can have unintended consequences in a professional setting. As Sidney goes to wipe it off, an incredulous Alison grabs his wrist and shakes her head; Sidney and Alison hurry out, mindful of the mishap, and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night falls, and Sidney gazes out through the window of a sleek black automobile, a symbol of corporate success, as it glides through Manhattan, the city known for its towering skyscrapers and frenetic pace. Alison and Lawrence seem indifferent, thumbing their mobile phones with the detachment typical in a digital age. He looks out on the gaudy lights of Times Square, famous for its electronic billboards and as a focal point for tourists, turns to his colleagues, and they eyeball him, then look back at their phones."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him He enters reception and collides with an immovable turnstile then staggers round In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window He enters reception and collides with an immovable turnstile then staggers round Munching a hamburger Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall It is the woman whose drink he spilled in the bar It is the woman whose drink he spilled in the bar In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare A coworker in a polka dot dress frowns With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine Sidney enters the lobby through a revolving door joined by a blond in an Aline dress He hits redial looks at the telephone receiver and frowns Sidney rolls his eyes as he listens in Munching a hamburger Sidney enters the lobby through a revolving door joined by a blond in an Aline dress As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly It starts its descent and the doors open Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney she opens a book and starts to read Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head Alison and Lawrence seem indifferent thumbing their mobile phones Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head Sidney and Alison hurry out and he takes a bite of the burger Sidney rolls his eyes as he listens in Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan Alison and Lawrence seem indifferent thumbing their mobile phones He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He enters reception and collides with an immovable turnstile then staggers round. Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office. A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him. Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window. A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare. Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office. Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall. It is the woman whose drink he spilled in the bar. In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer. A coworker in a polka dot dress frowns. With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs. She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine. He hits redial looks at the telephone receiver and frowns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Munching a hamburger. Sidney enters the lobby through a revolving door joined by a blond in an Aline dress. As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly. It starts its descent and the doors open. She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney. she opens a book and starts to read. Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket. As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head. Sidney and Alison hurry out and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent thumbing their mobile phones. He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He enters reception and collides with an immovable turnstile then staggers round. Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office. A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him. Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window. A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare. Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office. Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall. It is the woman whose drink he spilled in the bar. In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer. A coworker in a polka dot dress frowns. With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs. She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine. He hits redial looks at the telephone receiver and frowns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Munching a hamburger. Sidney enters the lobby through a revolving door joined by a blond in an Aline dress. As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly. It starts its descent and the doors open. She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney. she opens a book and starts to read. Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket. As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head. Sidney and Alison hurry out and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent thumbing their mobile phones. He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He enters reception and collides with an immovable turnstile then staggers round. Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office. A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him. Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window. A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare. Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office. Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall. Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket. As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head. Sidney and Alison hurry out and he takes a bite of the burger. Sidney rolls his eyes as he listens in. Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent thumbing their mobile phones. He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He enters reception and collides with an immovable turnstile then staggers round. Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office. A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him. Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan. Alison and Lawrence seem indifferent thumbing their mobile phones. He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat enters reception and collides with an immovable turnstile, then staggers round. Attractive chairs dwarf the cat in an elevator, and a petite brunette in a gray suit leads the cat into a spacious office. A be-suited pineapple with shoulder-length silver hair stands at a window staring out over the city, and a rooster turns to look at the pineapple. The dog reaches into its shoulder bag and proffers a red tee-shirt, which the rooster slings out of an open window. A post-modern review depicts the rooster as a nude king, and the dog's smile fades as it meets with an indifferent stare. The rooster leaps through the offending issue, and a tree suited Lawrence leads the rooster into a private office. The dog glances at its bright red tee-shirt and fidgets before pointing at a photograph on the wall. It's the woman whose drink the dog spilled in the bar. In an open-plan office, the dog crosses to a squirrel and perches on her desk while the squirrel works at a computer. A co-worker in a polka dot dress frowns. With a phone to her ear, the dog pulls over a sheet of printed photographic negatives and adjusts its specs. A kangaroo hangs up, the corners of her mouth downturned, as the dog peers at the contact sheet through a magnifying eye-glass to see two portly middle-aged gentlemen holding glasses of wine. The dog hits redial, looks at the telephone receiver, and frowns. Munching a hamburger, the dog enters the lobby through a revolving door, joined by a bicycle in an A-line dress. As the door starts to close, a bicycle reaches out towards a hastily approaching cloud and quickly retracts her hand as the door slams shut, narrowing her eyes disapprovingly. It starts its descent, and the doors open. A bicycle strides out in a huff to a squirrel, who is wearing a sharp suit, and ignoring the dog, a bicycle opens a book and starts to read. Tight-lipped, a bicycle stares down at her book, while the squirrel lowers her eyes as a golden-haired table in her mid-40s wearing expensive sunglasses steps into the lift and turns her back on them. The dog goes to swallow a mouthful of burger but gags, and a glob of chewed burger shoots out of its mouth and lands with a splat on the back of the table's cream jacket. As the dog goes to wipe it off, an incredulous squirrel grabs its wrist and shakes her head; the dog and the squirrel hurry out, and it takes a bite of the burger. The dog rolls its eyes as it listens in. Night falls, and the dog gazes out through the window of a sleek black automobile as it glides through Manhattan. The squirrel and Lawrence seem indifferent, thumbing their mobile phones. The dog looks out on the gaudy lights of Times Square, turns to its colleagues, and they eyeball the dog, then look back at their phones."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He enters a foyer and collides with an immovable fountain, then staggers round. Attractive women overshadow him in a monorail, and a petite brunette in a yellow scarf leads him into a narrow gallery. A be-suited man with shoulder-length golden hair stands at a balcony staring out over the forest, and Clayton Harding turns to look at him. Sidney reaches into his messenger bag and proffers a blue scarf, which Clayton slings out of an open skylight. A futuristic sculpture depicts Clayton as a nude admiral, and Sidney's smile fades as he meets with an indifferent glare. Clayton flips through the offending journal, and Doc attired Lawrence leads him into a secluded gallery. Sidney glances at his bright blue scarf and fidgets before pointing at a mural on the wall. It's the woman whose book he dropped in the café. In an open-air patio, Sidney crosses to Alison and perches on her couch while she works at a tablet. A co-worker in a floral dress frowns. With a radio to his ear, Sidney pulls over a stack of printed memos and adjusts his lenses. She hangs up, the corners of his mouth downturned, as he peers at the memos through a magnifying loop to see two portly middle-aged gentlemen holding cans of soda. He hits redial, looks at the remote control, and frowns. Munching a sandwich, Sidney enters the atrium through a sliding glass door, joined by a brunette in a pencil skirt. As the door starts to close, she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut, narrowing her eyes disapprovingly. It starts its descent, and the panel opens. She strides out in a huff to Alison, who is wearing a sleek blazer, and ignoring Sidney, she opens a magazine and starts to read. Tight-lipped, she stares down at her magazine, while Alison lowers her eyes as a silver-haired woman in her mid-40s wearing expensive earrings steps into the tram and turns her back on them. Sidney goes to swallow a mouthful of sandwich but gags, and a glob of chewed sandwich shoots out of his mouth and lands with a splat on the back of the woman's silk blouse. As Sidney goes to wipe it off, an incredulous Alison grabs his wrist and shakes her head; Sidney and Alison hurry out, and he takes a bite of the sandwich. Sidney rolls his eyes as he listens in. Night falls, and Sidney gazes out through the window of a sleek black carriage as it glides through Brooklyn. Alison and Lawrence seem indifferent, thumbing their smart watches. He looks out on the vivid lights of Coney Island, turns to his colleagues, and they eyeball him, then look back at their watches."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He enters reception and encounters an immovable turnstile, then wobbles round. Attractive women overshadow him in an elevator, and a petite brunette in a gray suit escorts him into a spacious office. A be-suited man with shoulder-length silver hair stands at a window admiring the view over the city, and Clayton Harding pivots to glance at him. Sidney reaches into his shoulder bag and brandishes a red tee-shirt, which Clayton flings out of an open window. A post-modern review portrays Clayton as a nude king, and Sidney's smile falters as he receives an indifferent stare. Clayton flips through the offending issue, and Doc suited Lawrence guides him into a private office. Sidney glances at his bright red tee-shirt and shifts nervously before gesturing at a photograph on the wall. It's the woman whose drink he spilled in the bar. In an open-plan office, Sidney approaches Alison and leans on her desk while she types at a computer. A co-worker in a polka dot dress scowls. With a phone to his ear, Sidney drags over a sheet of printed photographic negatives and straightens his specs. She hangs up, the corners of his mouth tilted downward, as he examines the contact sheet through a magnifying eye-glass to see two portly middle-aged gentlemen holding glasses of wine. He taps redial, glances at the telephone receiver, and grimaces. Chewing a hamburger, Sidney enters the lobby through a revolving door, accompanied by a blond in an A-line dress. As the door starts to close, she reaches out towards a hastily approaching colleague and quickly withdraws her hand as the door slams shut, narrowing her eyes disapprovingly. It begins its descent, and the doors part. She marches out in a huff to Alison, who is wearing a sharp suit, and ignoring Sidney, she flips open a book and starts to read. Tight-lipped, she gazes down at her book, while Alison lowers her eyes as a golden-haired woman in her mid-40s wearing expensive sunglasses steps into the lift and turns her back on them. Sidney goes to swallow a mouthful of burger but chokes, and a glob of chewed burger ejects from his mouth and splatters on the back of the woman's cream jacket. As Sidney goes to wipe it off, an incredulous Alison seizes his wrist and shakes her head; Sidney and Alison dash out, and he nibbles on the burger. Sidney rolls his eyes as he eavesdrops. Night falls, and Sidney watches out through the window of a sleek black automobile as it cruises through Manhattan. Alison and Lawrence seem uninterested, scrolling on their mobile phones. He gazes at the gaudy lights of Times Square, turns to his colleagues, and they scrutinize him, then return to their phones."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She enters auditorium and crashes into a stationary lamppost, then teeters around. Handsome giraffes dwarf her in a trolley, and a towering redhead in a green coat guides her into a narrow closet. A shabbily dressed woman with waist-length purple hair stands at a mirror staring out over the ocean, and Jackson Miller turns to look at her. Nancy reaches into her handbag and offers a yellow scarf, which Jackson hurls out of an open mirror. A vintage cartoon portrays Jackson as a clothed giant, and Nancy's grin fades as she meets with a disgusted look. Jackson lunges through the offensive item, and Mr. suited Jessica guides her into a public closet. Nancy glances at her dull yellow scarf and squirms before pointing at a statue on the ceiling. It's the man whose hat she stepped on in the library. In a closed-door closet, Nancy crosses to Victor and perches on his chair while he works at a typewriter. A stranger in a striped vest grimaces. With a pen to her hand, Nancy pulls over a chunk of printed musical notes and adjusts her mask. He hangs up, the edges of her eyes downturned, as she peers at the musical score through a clarifying lens to see two lanky young ladies holding cups of coffee. She hits pause, looks at the pen cap, and grimaces. Tasting a salad, Nancy enters the hallway through a sliding gate, joined by a brunette in a B-line skirt. As the gate starts to close, he reaches out towards a rapidly nearing neighbor and quickly retracts his foot as the gate slams shut, narrowing his nose thoughtfully. He starts its ascend, and the doors close. He strides out in a haste to Victor, who is wearing a casual sweater, and ignoring Nancy, he opens a letter and starts to write. Light-hearted, he stares up at his letter, while Victor raises his feet as a brunette-haired woman in her mid-30s wearing costly earrings steps into the trolley and turns her back on them. Nancy goes to swallow a mouthful of salad but chokes, and a blob of shredded salad shoots out of his nose and lands with a splat on the back of the woman's green sweater. As Nancy goes to wipe it off, a stunned Victor grabs her ankle and nods; Nancy and Victor rush out, and he takes a sip of the salad. Nancy furrows her eyebrows as she listens in. Dawn breaks, and Nancy peeks out through the door of a rusty white bicycle as it rolls through Brooklyn. Victor and Jessica seem detached, tapping their wristwatches. She looks out on the dim streetlights of Central Park, turns to her neighbors, and they glare at her, then look back at their wristwatches."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She leaves the waiting room and bounces against a movable gate, then tiptoes away. A group of tall men overshadows her in an escalator, and a tall blond in a red dress guides her into a cramped cabin. A bearded woman with shoulder-length golden hair sits on a stool gazing up at the ceiling, and Darren Wilkins nods to greet her. Lesley reaches into her backpack and presents a blue cap, which Darren tosses into a closed closet. An ancient manual illustrates Darren as a clothed hero, and Lesley's grin vanishes as she receives an amused chuckle. Darren skips through the unrelated book, and Nurse uniformed Alex escorts her into a communal area. Lesley peers at her vibrant blue cap and fiddles before gesturing at a poster on the door. It's the woman whose purse she accidentally bumped with her elbow. In a shared workspace, Lesley wanders to Tyler and settles on his chair while he focuses on a laptop. A colleague in a striped shirt scowls. With a remote to her ear, Lesley flips through a website of colorful digital illustrations and tilts her head. He hangs up, the tips of her lips upturned, as she squints at the digital display through a magnifying screen to see two lean young ladies holding bouquets of flowers. He taps disconnect, glances at the television remote, and smiles. Sipping a smoothie, Lesley leaves the hallway through a sliding door, accompanied by a brunette in a pencil skirt. As the door fully opens, she gestures toward a leisurely retreating friend and promptly pats her hand as the door closes gently, squinting her eyes skeptically. It starts its ascent, and the doors close. She ambles out in a shrug to Tyler, who is wearing casual jeans, and dismissing Lesley, she closes a magazine and starts to sketch. Open-mouthed, she glares up at her drawing while Tyler raises his gaze as a raven-haired woman in her early-50s donning flashy earrings glides into the room and turns her side to them. Lesley attempts to sip a smoothie but chokes, and a splash of spilled smoothie splatters on the back of the woman's leather handbag. As Lesley stretches to clean it up, an astonished Tyler grips her arm and nods; Lesley and Tyler rush away, and she sips the smoothie. Lesley shakes her head as she tunes in. Daybreak comes, and Lesley stares out from the window of a rugged blue van as it cruises through Brooklyn. Tyler and Alex seem attentive, typing on their tablets. She stares out at the dim lights of the Brooklyn Bridge, faces her companions, and they nod to her, then return to their tablets."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He enters the atrium and brushes against an immovable sculpture, then spins around. Towering ladies overshadow him in an escalator, and a tiny redhead in a blue dress guides him into a narrow cubicle. A formally dressed man with shoulder-length golden hair stands at a wall peering over the park, and Clayton Harding swivels to glance at him. Sidney delves into his backpack and extends a green hoodie, which Clayton tosses into a closed drawer. A vintage critique portrays Clayton as a masked villain, and Sidney's grin wanes as he encounters an apathetic glare. Clayton jumps through the controversial article, and Doc adorned Lawrence escorts him into a shared workspace. Sidney peers at his bright orange hoodie and fiddles before gesturing at a painting on the partition. It's the woman whose purse he dropped in the café. In a cubicle area, Sidney moves to Alison and reclines on her chair while she types on a tablet. A colleague in a striped shirt scowls. With a headset on, Sidney reaches for a roll of printed blueprints and adjusts his cap. She ends the call, the edges of his mouth drooping, as he examines the schematic through a magnifying lens to see two wiry elderly men holding cans of soda. He presses redial, glances at the headset, and scowls. Nibbling an apple, Sidney enters the vestibule through an automatic door, accompanied by a brunette in a floral blouse. As the door begins to close, she extends her hand toward a rapidly approaching stranger and swiftly retracts her hand as the door bangs shut, narrowing her eyes critically. It begins its ascent, and the doors swing open. She marches out in a snit to Alison, who is wearing a casual cardigan, and ignoring Sidney, she picks up a journal and starts to flip pages. Tight-lipped, she gazes down at her journal, while Alison averts her gaze as a raven-haired woman in her mid-40s adorned with ornate earrings steps into the gondola and turns her back on them. Sidney goes to swallow a bite of apple but splutters, and a chunk of chewed apple ejects from his mouth and lands with a thud on the back of the woman's tan coat. As Sidney goes to clean it off, an astonished Alison grips his elbow and shakes her head; Sidney and Alison rush out, and he takes a bite of the apple. Sidney rolls his eyes as he watches. Dusk descends, and Sidney stares out through the window of a shiny red bicycle as it coasts through Brooklyn. Alison and Lawrence appear uninterested, tapping their tablets. He glances out at the vibrant signs of Union Square, turns to his coworkers, and they glance at him, then return to their tablets."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She exits the gymnasium and bumps into a stationary bicycle, then spins around. Tall giraffes tower over her in a helicopter, and a short redhead in a yellow dress guides her into a cramped library. A suited robot with waist-length golden cables stares at a wall gazing out over the desert, and Charlie Kingston pivots to face her. Maria dives into her backpack and offers a blue scarf, which Charlie tosses out of a closed skylight. A Victorian painting portrays Charlie as a clothed jester, and Maria's grin vanishes as she encounters a blank look. Charlie skips through the punctual letter, and Nurse suited Michael ushers her into a public library. Maria peeks at her dazzling blue scarf and squirms before gesturing toward a painting on the ceiling. It's the man whose sandwich she dropped in the restaurant. In a crowded hallway, Maria strides to Betty and lounges on her sofa while she plays with a tablet. A neighbor in a striped skirt smiles. With a hat on her head, Maria drags over a spool of colorful thread and adjusts her earrings. He hangs it up, the edges of her lips upturned, as she squints at the fabric swatch through a monocle to spot two slender young ladies waving flags. He clicks redial, glances at the light switch, and grins. Chewing a taco, Maria exits the garage through a sliding door, accompanied by a brunette in a pencil skirt. As the door begins to seal, she retracts towards a leisurely approaching teammate and swiftly extends her hand as the door clicks locked, opening her eyes approvingly. It halts its journey, and the panels close. He tiptoes out in a daze to Betty, who is sporting a casual outfit, and ignoring Maria, he closes a magazine and wants to sing. Closed-mouthed, he gazes up at his phone, while Betty raises her gaze as a red-haired man in his late-20s wearing budget glasses steps into the hallway and turns his shoulder on them. Maria attempts to chew a mouthful of taco but chokes, and a dollop of mashed taco propels out of her lips and lands with a thud on the shoulder of the man's green blazer. As Maria attempts to brush it off, a surprised Betty clasps her elbow and nods; Maria and Betty rush in, and she takes a sip of the taco. Maria blinks as she tunes in. Morning breaks, and Maria stares in through the windshield of a rusty white caravan as it stumbles through Brooklyn. Betty and Michael appear disinterested, flipping their paper maps. He glances out at the dimmed billboards of Times Square, shifts to his friends, and they scan him, then glance back at their maps."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sidney enters the reception area, colliding with a turnstile before being led by a petite brunette into a spacious office. There, Clayton Harding, a silver-haired man, dismisses Sidney's offering of a red tee-shirt by throwing it out the window. Sidney's smile fades as Clayton examines a critical review of him. Doc-suited Lawrence guides Sidney to a private office. Sidney fidgets with the red tee-shirt and notices a photograph of a woman whose drink he spilled earlier. In the open-plan office, he perches on Alison’s desk while examining negatives and making calls, ignored by co-workers. As Sidney enters the lobby with a hamburger, a blond woman in an A-line dress and disapproving colleague join him. They encounter a golden-haired woman in a lift, where Sidney accidentally spits food on her cream jacket. Alison stops him from wiping it off, and they leave quickly. Night falls as Sidney rides through Manhattan with indifferent colleagues, Alison and Lawrence, engrossed in their phones. He gazes out at the lights of Times Square, glancing at his colleagues who ignore him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones Alison and Lawrence seem indifferent thumbing their mobile phones Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan Sidney rolls his eyes as he listens in Sidney and Alison hurry out and he takes a bite of the burger As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them she opens a book and starts to read She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney It starts its descent and the doors open As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly Sidney enters the lobby through a revolving door joined by a blond in an Aline dress Munching a hamburger He hits redial looks at the telephone receiver and frowns She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs A coworker in a polka dot dress frowns In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer It is the woman whose drink he spilled in the bar Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office He enters reception and collides with an immovable turnstile then staggers round"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "It starts its descent and the doors open He hits redial looks at the telephone receiver and frowns A coworker in a polka dot dress frowns He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly Sidney and Alison hurry out and he takes a bite of the burger She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine she opens a book and starts to read Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office Sidney enters the lobby through a revolving door joined by a blond in an Aline dress Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan Munching a hamburger A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney Alison and Lawrence seem indifferent thumbing their mobile phones A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head It is the woman whose drink he spilled in the bar In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer Sidney rolls his eyes as he listens in He enters reception and collides with an immovable turnstile then staggers round Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sidney enters the lobby through a revolving door joined by a blond in an Aline dress As the door starts to close she reaches out towards a hastily approaching colleague and quickly retracts her hand as the door slams shut narrowing her eyes disapprovingly It starts its descent and the doors open She strides out in a huff to Alison who is wearing a sharp suit and ignoring Sidney she opens a book and starts to read Tightlipped she stares down at her book while Alison lowers her eyes as a goldenhaired woman in her mid40s wearing expensive sunglasses steps into the lift and turns her back on them Sidney goes to swallow a mouthful of burger but gags and a glob of chewed burger shoots out of his mouth and lands with a splat on the back of the woman's cream jacket As Sidney goes to wipe it off an incredulous Alison grabs his wrist and shakes her head Sidney and Alison hurry out and he takes a bite of the burger Sidney rolls his eyes as he listens in Night falls and Sidney gazes out through the window of a sleek black automobile as it glides through Manhattan Alison and Lawrence seem indifferent thumbing their mobile phones He looks out on the gaudy lights of Times Square turns to his colleagues and they eyeball him then look back at their phones He enters reception and collides with an immovable turnstile then staggers round Attractive women dwarf him in an elevator and a petite brunette in a gray suit leads him into a spacious office A besuited man with shoulderlength silver hair stands at a window staring out over the city and Clayton Harding turns to look at him Sidney reaches into his shoulder bag and proffers a red teeshirt which Clayton slings out of an open window A postmodern review depicts Clayton as a nude king and Sidney's smile fades as he meets with an indifferent stare Clayton leaps through the offending issue and Doc suited Lawrence leads him into a private office Sidney glances at his bright red teeshirt and fidgets before pointing at a photograph on the wall It is the woman whose drink he spilled in the bar In an openplan office Sidney crosses to Alison and perches on her desk while she works at a computer A coworker in a polka dot dress frowns With a phone to his ear Sidney pulls over a sheet of printed photographic negatives and adjusts his specs She hangs up the corners of his mouth downturned as he peers at the contact sheet through a magnifying eyeglass to see two portly middleaged gentlemen holding glasses of wine He hits redial looks at the telephone receiver and frowns Munching a hamburger"
        }
      ]
    }
  ]
}