{
  "ground_truth": "Graham halts, raises the torch, and peers into the tunnel of foliage ahead. He spins round, aiming the torch beam into the impenetrable jungle on one side but finding nothing, the light hardly passing beyond the first few rows of woody green stalks. He then lowers the flashlight to his side and begins to pick his way through the crop, one arm raised to shield his face from the leaves. Emerging in the first of the crop circles, Graham lowers his arm gently and comes to a gradual stop, viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened corn, and the leaves glow with a silvery sheen. Graham stands still, his torch shooting a slender shaft of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. He scans the circle apprehensively, then steps backwards towards the standing crop. Turning at the last moment, he cuts straight into the corn, struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize. Graham shines his torch along the path. It's clear. He then turns and points the beam the other way. Again, nothing. He stares into the crop. Whipping round, he drops the torch and the light goes out. Panting and keeping his eyes fixed intently on the maize, he crouches down warily and reaches for the torch. Locating the flashlight, he frantically slaps the lens and the beam returns, briefly illuminating his face. He shines the light down the path; a long thin bare leg slips silently into the corn. Graham scrabbles backwards, then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it, the torch light dancing over the leaves as he runs. In the farmhouse, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge. Merrill sits at a table with his back to them, reading the army pamphlet he picked up in town and lazily chewing gum. Unnoticed by the other three, Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table, his two children turning around to see their father staring at the floor. Morgan steps falteringly up to the table, leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then sits up straight and sighs. On the screen, lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Graham pauses, lifts the flashlight, and gazes into the passage of vegetation ahead. He rotates around, directing the flashlight beam into the impenetrable wilderness on one flank but discovering nothing, the glow scarcely penetrating beyond the initial few rows of woody verdant stalks. He then lowers the flashlight to his flank and begins to navigate his way through the growth, one arm lifted to shield his visage from the foliage. Emerging in the foremost of the crop circles, Graham lowers his arm softly and comes to a gradual halt, observing the vicinity with renewed apprehension. A pale gray glow fills the vast flawless circle of uniformly flattened maize, and the leaves shine with a silvery gleam. Graham stands motionless, his flashlight projecting a slender beam of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. He scans the circle anxiously, then steps backwards towards the standing growth. Turning at the final moment, he cuts directly into the maize, struggling through the unbending thicket until he stumbles out onto a pathway running between two areas of corn. Graham shines his flashlight along the path. It's clear. He then turns and points the beam the other way. Again, nothing. He gazes into the growth. Whipping around, he drops the flashlight and the light goes out. Panting and keeping his eyes fixed intently on the maize, he crouches down cautiously and reaches for the flashlight. Locating the flashlight, he frantically slaps the lens and the beam returns, briefly illuminating his visage. He shines the glow down the path; a long thin bare limb slips quietly into the maize. Graham scrabbles backward, then leaps up and sprints off in the opposite direction. He plows into the maize and charges through it, the flashlight glow dancing over the foliage as he runs. In the farmhouse, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge. Merrill sits at a table with his back to them, reading the military brochure he picked up in town and lazily chewing gum. Unnoticed by the other three, Graham pads softly into the kitchen and pauses. He lowers himself gently into a seat at the table, his two children turning around to see their father staring at the ground. Morgan steps hesitantly up to the table, leaving Bo at the sink. Merrill then gazes casually over his shoulder and notices his dejected brother. Rising, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then sits up straight and sighs. On the screen, lights hover in a night sky. Graham and Merrill sit on the couch while Morgan and Bo kneel close to the television."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Graham is halted, the torch is raised by him, and the tunnel of foliage ahead is peered into. He is spun round by himself, with the torch beam aimed into the impenetrable jungle on one side, but he finds nothing, as the light hardly passes beyond the first few rows of woody green stalks. The flashlight is then lowered to his side, and his way is picked through the crop with one arm raised by him to shield his face from the leaves. In the first of the crop circles, he emerges, and his arm is gently lowered as a gradual stop is made by him to view the area with renewed concern. A pale gray light is filled in the vast perfect circle of evenly flattened corn, and a silvery sheen is glowed by the leaves. Graham stands still, and a slender shaft of light is shot across the circle by his torch. His eyes dart about. Graham swallows and a steadying breath is taken by him. The circle is scanned apprehensively by him, and then backward steps are made towards the standing crop. At the last moment, he is turned, and the corn is cut straight into by him, struggling through the unbending forest until a pathway running between two areas of maize is stumbled out onto. The path is shined along by Graham with his torch. It's clear. He then turns and the beam is pointed the other way by him. Again, he finds nothing. The crop is stared into by him. Whipping round, the torch is dropped by him and the light goes out. Panting and keeping his eyes fixed intently on the maize, he warily crouches down and the torch is reached for. Locating the flashlight, the lens is frantically slapped by him and the beam returns, briefly illuminating his face. The light is shined down the path by him; a long thin bare leg slips silently into the corn. Graham scrabbles backward, then he leaps up and the opposite direction is sprinted off in. The corn is plowed into by him and charged through, the torchlight dancing over the leaves as he runs. In the farmhouse, the sink in the kitchen, which opens directly onto the lounge, is used by Morgan and Bo for washing up. At a table, Merrill sits with his back to them, having picked up the army pamphlet in town and lazily chewing gum. Unnoticed by the other three, Graham softly pads into the kitchen and stops. Into a seat at the table, he is gently lowered, with his two children turning around and his father is seen staring at the floor. Up to the table, Morgan steps falteringly, leaving Bo at the sink. Merrill casually peers over his shoulder and his downcast brother is noticed. Getting up, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then straight is sat up and he sighs. On the screen, lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Graham stops, raises the torch, and peers into the foliage tunnel. He spins, aiming the beam into the dense jungle but finds nothing, the light barely penetrating the first few rows of green stalks. Lowering the flashlight, he navigates through the crop, shielding his face with one arm. Emerging in the crop circle, he lowers his arm and stops, viewing the area with concern. A pale gray light fills the perfect circle of flattened corn, the leaves glowing with a silvery sheen. Graham stands still, his torch casting a slender light across the circle. He swallows, takes a breath, and scans the circle apprehensively, then steps back toward the standing crop. Turning, he cuts into the corn, struggling through until he stumbles onto a path between maize areas. Graham shines his torch along the path—it's clear. He turns the beam the other way—nothing. He stares into the crop, drops the torch, and the light goes out. Panting, he crouches, reaches for the torch, and slaps the lens, restoring the beam. He shines it down the path; a thin bare leg slips into the corn. Graham scrabbles back, leaps up, and sprints in the opposite direction, charging through the corn as the torch light dances over the leaves. In the farmhouse, Morgan and Bo wash up at the kitchen sink, which opens onto the lounge. Merrill sits at a table, reading an army pamphlet and chewing gum. Unnoticed, Graham enters the kitchen and sits at the table, his children turning to see him staring at the floor. Morgan approaches the table, leaving Bo at the sink. Merrill peers over his shoulder, notices Graham, and heads into the kitchen, stopping short of the table. Graham looks at Merrill, sits up, and sighs. On the screen, lights hover in the night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel by the TV."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Graham stops, raises his torch, and peers into the foliage tunnel. He spins, aiming the beam into the jungle but finds nothing, the light barely penetrating the green stalks. Lowering the flashlight, he navigates through the crop, shielding his face. In the crop circle, he lowers his arm, stopping to view the area with concern. A pale gray light fills the circle of flattened corn, the leaves glowing silvery. Graham stands still, his torch casting light across the circle. He swallows, breathes steadily, scans the circle, then steps back towards the crop. Turning, he cuts into the corn, struggling until he reaches a path between maize areas. He shines his torch along the path; it's clear. Turning the beam the other way, he sees nothing. He stares into the crop, drops the torch, and the light goes out. Panting, he crouches, retrieves the torch, and the beam returns, illuminating his face. He shines it down the path; a bare leg slips into the corn. Graham scrambles back, leaps up, and sprints away, charging through the corn, the torchlight dancing. In the farmhouse, Morgan and Bo wash up in the kitchen, which opens to the lounge. Merrill sits at a table, reading an army pamphlet and chewing gum. Unnoticed, Graham enters the kitchen and sits at the table, his children turning to see him staring at the floor. Morgan approaches the table, leaving Bo at the sink. Merrill notices his brother, gets up, and stops near the table. Graham looks at Merrill, sits up, and sighs. On the screen, lights hover in the night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel by the TV."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Graham comes to an abrupt halt, raising the torch high above his head as he peers intently into the dense tunnel of foliage that stretches out ahead of him. He spins around quickly, directing the beam of the torch into the seemingly impenetrable jungle on one side, but he finds nothing; the light barely penetrates beyond the first few rows of thick, woody green stalks. With a sense of determination, he lowers the flashlight to his side and begins to carefully pick his way through the crop, one arm raised protectively to shield his face from the encroaching leaves. As he emerges into the first of the crop circles, Graham gently lowers his arm and comes to a gradual stop, viewing the area with a renewed sense of concern. A pale gray light fills the vast, perfectly formed circle of evenly flattened corn, and the leaves glow with an ethereal silvery sheen. Graham stands motionless, his torch casting a slender shaft of light across the circle. His eyes dart about nervously. Graham swallows hard and takes a steadying breath. He scans the circle apprehensively, then steps backward towards the standing crop. Turning at the very last moment, he cuts straight into the corn, struggling through the unyielding forest until he stumbles out onto a pathway that runs between two areas of maize. Graham shines his torch along the path. It's clear. He then turns and points the beam in the opposite direction. Again, nothing. He stares intently into the crop. Whipping around suddenly, he drops the torch, and the light goes out. Panting heavily and keeping his eyes fixed intently on the maize, he crouches down warily and reaches for the torch. Locating the flashlight, he frantically slaps the lens, and the beam returns, briefly illuminating his face. He shines the light down the path; a long, thin, bare leg slips silently into the corn. Graham scrabbles backward, then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it, the torchlight dancing erratically over the leaves as he runs. Meanwhile, in the farmhouse, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge. Merrill sits at a table with his back to them, engrossed in reading the army pamphlet he picked up in town, lazily chewing gum. Unnoticed by the other three, Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table, his two children turning around to see their father staring intently at the floor. Morgan steps falteringly up to the table, leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then sits up straight and sighs deeply. On the screen, lights hover mysteriously in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV, captivated by the scene."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Graham comes to an abrupt halt, pausing suddenly and raising the torch high above his head. He peers with intense focus into the dense, seemingly unending tunnel of foliage that stretches out ahead of him. With a swift, almost instinctive motion, he spins around quickly, directing the bright beam of the torch into the seemingly impenetrable jungle on one side. Despite his efforts, he finds nothing of consequence; the light barely manages to penetrate beyond the first few rows of thick, woody green stalks. With a renewed sense of determination, he lowers the flashlight to his side, cautiously beginning to pick his way through the crop. One arm is raised protectively to shield his face from the encroaching and sometimes sharp leaves. As he emerges into the first of the distinctive crop circles, Graham gently lowers his arm and comes to a gradual stop, viewing the mysterious area with a renewed sense of growing concern. A pale, ghostly gray light fills the vast, perfectly formed circle of evenly flattened corn, and the surrounding leaves glow with an ethereal, silvery sheen. Graham stands motionless, his torch casting a slender, narrow shaft of light across the circle. His eyes dart about nervously, scanning for any signs of movement. Graham swallows hard and takes a steadying breath, scanning the circle apprehensively before stepping backward towards the standing crop. Turning sharply at the very last moment, he cuts straight into the corn, struggling through the unyielding forest of stalks until he stumbles out onto a narrow pathway that runs between two areas of maize. Graham shines his torch along the path, ensuring it is clear. He then turns and points the beam in the opposite direction. Once again, there is nothing. He stares intently into the crop. Suddenly whipping around, he drops the torch, and the light goes out. Panting heavily and keeping his eyes fixed intently on the maize, he crouches down warily and reaches for the torch. Locating the flashlight, he frantically slaps the lens, and the beam returns, momentarily illuminating his face. He shines the light down the path; a long, thin, bare leg slips silently into the corn. Graham scrabbles backward, then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it, the torchlight dancing erratically over the leaves as he runs. Meanwhile, in the nearby farmhouse, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge area. Merrill sits at a table with his back to them, engrossed in the army pamphlet he picked up in town earlier, lazily chewing gum. Unnoticed by the other three, Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table, his two children turning around to see their father staring intently at the floor. Morgan steps falteringly up to the table, leaving Bo behind at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then sits up straight and sighs deeply. On the television screen, lights hover mysteriously in a dark night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV, captivated by the enigmatic scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Graham comes to a complete stop, carefully raises the torch above his head, and peers intently into the tunnel of dense foliage that stretches out ahead of him. He swiftly spins around, directing the torch beam into the seemingly impenetrable jungle on one side, but finds nothing as the light barely penetrates beyond the first few rows of thick, woody green stalks. He then lowers the flashlight to his side and begins to cautiously pick his way through the crop, raising one arm to shield his face from the encroaching leaves. As he emerges into the first of the crop circles, Graham gently lowers his arm and gradually comes to a stop, surveying the area with a renewed sense of concern. A pale gray light fills the vast, perfectly formed circle of evenly flattened corn, and the leaves shimmer with a silvery sheen. Graham stands motionless, his torch casting a slender shaft of light across the circle, while his eyes dart about, scanning the surroundings. He swallows hard and takes a steadying breath, then apprehensively scans the circle once more before stepping backwards towards the standing crop. At the last moment, he turns and cuts directly into the corn, struggling through the unyielding forest of stalks until he stumbles out onto a pathway that runs between two areas of maize. Graham shines his torch along the path, confirming that it is clear, then turns and points the beam in the opposite direction, finding nothing once again. He stares intently into the crop, then suddenly whips around, dropping the torch in the process, causing the light to go out. Panting and keeping his eyes fixed intently on the maize, he crouches down warily and reaches for the torch. Upon locating the flashlight, he frantically slaps the lens until the beam returns, briefly illuminating his face. He shines the light down the path just in time to see a long, thin bare leg slip silently into the corn. Graham scrabbles backwards in alarm, then leaps up and sprints off in the opposite direction. He plows into the corn, charging through it with the torchlight dancing erratically over the leaves as he runs. Meanwhile, in the farmhouse, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge. Merrill sits at a table with his back to them, engrossed in reading the army pamphlet he picked up in town while lazily chewing gum. Unnoticed by the other three, Graham pads softly into the kitchen and comes to a stop. He lowers himself gently into a seat at the table, prompting his two children to turn around and see their father staring at the floor. Morgan steps falteringly up to the table, leaving Bo at the sink. Merrill then casually peers over his shoulder and notices his downcast brother. Rising from his seat, he heads into the kitchen, stopping just short of the table. Graham looks at Merrill, then sits up straight and lets out a sigh. On the screen, lights hover mysteriously in the night sky as Graham and Merrill sit on the sofa, while Morgan and Bo kneel close to the TV, captivated by the scene."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Graham halts and raises his torch to peer into the tunnel of foliage ahead, then spins around to scan the impenetrable jungle with the beam, finding nothing as the light barely penetrates the dense greenery. Lowering the flashlight, he navigates through the crop, shielding his face with one arm, and emerges into a crop circle. He stops, observing the pale gray light that fills the circle, casting a silvery sheen on the evenly flattened corn. Standing still, Graham's torch casts a slender light across the circle as he scans it apprehensively, then steps back toward the standing crop. Turning abruptly, he pushes through the corn until he stumbles onto a pathway between maize fields. He checks the path with his torch, finding it clear in both directions, but as he stares into the crop, he drops the torch, extinguishing the light. Panting, he crouches to retrieve it, slapping the lens until the beam returns, briefly illuminating his face. He shines the light down the path, glimpsing a long thin leg slipping into the corn, prompting him to scramble backward, leap up, and sprint away. Charging through the corn, the torchlight dances over the leaves as he runs. Meanwhile, in the farmhouse, Morgan and Bo wash up in the kitchen, which opens onto the lounge, while Merrill sits at the table, reading an army pamphlet and chewing gum. Unnoticed, Graham enters the kitchen and sits at the table, prompting Morgan to approach as Merrill turns to notice his brother's downcast demeanor. Merrill joins them, and Graham looks at him, then sits up and sighs. On the TV screen, lights hover in the night sky as Graham and Merrill sit on the sofa, with Morgan and Bo kneeling close to the TV."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Graham halts, raises the torch that flickers with every gust of wind, and peers into the tunnel of foliage ahead. He spins round, aiming the torch beam into the impenetrable jungle on one side but finding nothing, the light hardly passing beyond the first few rows of woody green stalks in the dense forest known for concealing many mysteries. He then lowers the flashlight to his side and begins to pick his way through the crop, one arm raised to shield his face from the leaves often known to cause minor cuts and abrasions. Emerging in the first of the crop circles, peculiar formations often linked to unexplained phenomena, Graham lowers his arm gently and comes to a gradual stop, viewing the area with renewed concern. A pale gray light, likely from the rising full moon that casts an eerie glow, fills the vast perfect circle of evenly flattened corn, and the leaves glow with a silvery sheen. Graham stands still, his torch shooting a slender shaft of light across the circle. His eyes dart about, scanning for any signs of life or movement. Graham swallows and takes a steadying breath. He scans the circle apprehensively, then steps backwards towards the standing crop. Turning at the last moment, he cuts straight into the corn, struggling through the unbending forest until he stumbles out onto a pathway that local farmers often use, running between two areas of maize. Graham shines his torch along the path. It's clear, devoid of any tracks that could indicate recent movement. He then turns and points the beam the other way. Again, nothing. He stares intently into the crop as if expecting something to emerge. Whipping round, he drops the torch, and the light goes out. Panting and keeping his eyes fixed intently on the maize, he crouches down warily and reaches for the torch. Locating the flashlight, he frantically slaps the lens and the beam returns, briefly illuminating his face, now filled with a mix of fear and determination. He shines the light down the path; a long thin bare leg, reminiscent of a creature from local folklore, slips silently into the corn. Graham scrabbles backwards, then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it, the torch light dancing over the leaves as he runs, each step echoing the urgent beat of his heart. In the farmhouse, a structure that has stood for generations amidst fields and farms, Morgan and Bo are washing up at the sink in the kitchen, which opens directly onto the lounge, the heart of the home where family gatherings once filled the room with laughter. Merrill sits at a table with his back to them, reading the army pamphlet he picked up in town, a recruitment drive document urging young men to join, and lazily chewing gum, perhaps as a way to calm his restless energy. Unnoticed by the other three, Graham pads softly into the kitchen and stops, his entrance barely disturbing the settled energy of the room. He lowers himself gently into a seat at the table, his two children turning around to see their father staring at the floor, a gesture that speaks volumes about the weight on his mind. Morgan steps falteringly up to the table, leaving Bo at the sink, now full of soapy water and scattered dishes. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up, he heads into the kitchen, stopping just short of the table, his concern evident in his eyes. Graham looks at Merrill, then sits up straight and sighs, a sound of exhaustion and relief mingled. On the screen, lights hover in a night sky, reminiscent of the UFO sightings reported in local newspapers. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV, their eyes wide with wonder and curiosity."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Graham halts raises the torch and peers into the tunnel of foliage ahead  He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves  Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern  A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen  Graham stands still his torch shooting a slender shaft of light across the circle  His eyes dart about  Graham swallows and takes a steadying breath  He scans the circle apprehensively then steps backwards towards the standing crop  Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize  Graham shines his torch along the path  It's clear  He then turns and points the beam the other way  Again nothing  He stares into the crop  Whipping round he drops the torch and the light goes out  Panting and keeping his eyes fixed intently on the maize  he crouches down warily and reaches for the torch  Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face  He shines the light down the path  He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing  the light hardly passing beyond the first few rows of woody green stalks  He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves  Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern  A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen  Graham stands still his torch shooting a slender shaft of light across the circle  His eyes dart about  Graham swallows and takes a steadying breath  He scans the circle apprehensively then steps backwards towards the standing crop  Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize  Graham shines his torch along the path  It's clear  He then turns and points the beam the other way  Again nothing  He stares into the crop  Whipping round he drops the torch and the light goes out  Panting and keeping his eyes fixed intently on the maize  he crouches down warily and reaches for the torch  Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face  He shines the light down the path  a long thin bare leg slips silently into the corn  Graham scrabbles backwards then leaps up and sprints off in the opposite direction  He plows into the corn and charges through it  the torch light dancing over the leaves as he runs  In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge  Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum  Unnoticed by the other three Graham pads softly into the kitchen and stops  He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor  Morgan steps falteringly up to the table leaving Bo at the sink  Merrill then peers casually over his shoulder and notices his downcast brother  Getting up he heads into the kitchen stopping just short of the table  Graham looks at Merrill then sits up straight and sighs  On the screen lights hover in a night sky  Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Graham halts raises the torch and peers into the tunnel of foliage ahead. He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing. the light hardly passing beyond the first few rows of woody green stalks. He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves. Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen. Graham stands still his torch shooting a slender shaft of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. He scans the circle apprehensively then steps backwards towards the standing crop. Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize. Graham shines his torch along the path. It is clear. He then turns and points the beam the other way. Again nothing. He stares into the crop. Whipping round he drops the torch and the light goes out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Panting and keeping his eyes fixed intently on the maize he crouches down warily and reaches for the torch. Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face. He shines the light down the path. a long thin bare leg slips silently into the corn. Graham scrabbles backwards then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it. the torch light dancing over the leaves as he runs. In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge. Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum. Unnoticed by the other three Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor. Morgan steps falteringly up to the table leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up he heads into the kitchen stopping just short of the table. Graham looks at Merrill then sits up straight and sighs. On the screen lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Graham halts raises the torch and peers into the tunnel of foliage ahead. He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing. the light hardly passing beyond the first few rows of woody green stalks. He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves. Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen. Graham stands still his torch shooting a slender shaft of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. He scans the circle apprehensively then steps backwards towards the standing crop. Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize. Graham shines his torch along the path. It is clear. He then turns and points the beam the other way. Again nothing. He stares into the crop. Whipping round he drops the torch and the light goes out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Panting and keeping his eyes fixed intently on the maize he crouches down warily and reaches for the torch. Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face. He shines the light down the path. a long thin bare leg slips silently into the corn. Graham scrabbles backwards then leaps up and sprints off in the opposite direction. He plows into the corn and charges through it. the torch light dancing over the leaves as he runs. In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge. Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum. Unnoticed by the other three Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor. Morgan steps falteringly up to the table leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up he heads into the kitchen stopping just short of the table. Graham looks at Merrill then sits up straight and sighs. On the screen lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Graham halts raises the torch and peers into the tunnel of foliage ahead. He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing. the light hardly passing beyond the first few rows of woody green stalks. He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves. Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen. Graham stands still his torch shooting a slender shaft of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. Unnoticed by the other three Graham pads softly into the kitchen and stops. He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor. Morgan steps falteringly up to the table leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up he heads into the kitchen stopping just short of the table. Graham looks at Merrill then sits up straight and sighs. On the screen lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Graham halts raises the torch and peers into the tunnel of foliage ahead. He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing. the light hardly passing beyond the first few rows of woody green stalks. He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves. Graham looks at Merrill then sits up straight and sighs. On the screen lights hover in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The owl halts, raises the torch, and peers into the tunnel of foliage ahead. It spins round, aiming the torch beam into the impenetrable jungle on one side but finding nothing, the light hardly passing beyond the first few rows of woody green stalks. The owl then lowers the flashlight to its side and begins to pick its way through the crop, one wing raised to shield its face from the leaves. Emerging in the first of the crop circles, the owl lowers its wing gently and comes to a gradual stop, viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened corn, and the leaves glow with a silvery sheen. The owl stands still, its torch shooting a slender shaft of light across the circle. Its eyes dart about. The owl swallows and takes a steadying breath. It scans the circle apprehensively, then steps backward towards the standing crop. Turning at the last moment, it cuts straight into the corn, struggling through the unbending forest until it stumbles out onto a pathway running between two areas of maize. The owl shines its torch along the path. It's clear. It then turns and points the beam the other way. Again, nothing. It stares into the crop. Whipping round, it drops the torch and the light goes out. Panting and keeping its eyes fixed intently on the maize, it crouches down warily and reaches for the torch. Locating the flashlight, it frantically slaps the lens and the beam returns, briefly illuminating its face. It shines the light down the path; a long thin bare leg slips silently into the corn. The owl scrabbles backward, then leaps up and sprints off in the opposite direction. It plows into the corn and charges through it, the torch light dancing over the leaves as it runs. In the farmhouse, the penguin and the rabbit are washing up at the sink in the kitchen, which opens directly onto the lounge. The squirrel sits at a table with its back to them, reading the army pamphlet it picked up in town and lazily chewing gum. Unnoticed by the other three, the owl pads softly into the kitchen and stops. It lowers itself gently into a seat at the table, its two children turning around to see their parent staring at the floor. The penguin steps falteringly up to the table, leaving the rabbit at the sink. The squirrel then peers casually over its shoulder and notices its downcast sibling. Getting up, it heads into the kitchen, stopping just short of the table. The owl looks at the squirrel, then sits up straight and sighs. On the screen, lights hover in a night sky. The owl and the squirrel sit on the sofa while the penguin and the rabbit kneel close to the TV."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Graham halts, raises the lantern, and peers into the corridor of seaweed ahead. He spins round, aiming the lantern beam into the impenetrable desert on one side but finding nothing, the light hardly passing beyond the first few rows of sandy green dunes. He then lowers the lantern to his side and begins to pick his way through the meadow, one arm raised to shield his face from the vines. Emerging in the first of the sand dunes, Graham lowers his arm gently and comes to a gradual stop, viewing the area with renewed concern. A pale gray light fills the vast perfect circle of evenly flattened grass, and the vines glow with a silvery sheen. Graham stands still, his lantern shooting a slender shaft of light across the circle. His eyes dart about. Graham swallows and takes a steadying breath. He scans the circle apprehensively, then steps backwards towards the standing meadow. Turning at the last moment, he cuts straight into the grass, struggling through the unbending grove until he stumbles out onto a pathway running between two areas of weeds. Graham shines his lantern along the path. It's clear. He then turns and points the beam the other way. Again, nothing. He stares into the meadow. Whipping round, he drops the lantern and the light goes out. Panting and keeping his eyes fixed intently on the weeds, he crouches down warily and reaches for the lantern. Locating the lantern, he frantically slaps the lens and the beam returns, briefly illuminating his face. He shines the light down the path; a long thin bare leg slips silently into the grass. Graham scrabbles backwards, then leaps up and sprints off in the opposite direction. He plows into the grass and charges through it, the lantern light dancing over the vines as he runs. In the workshop, Morgan and Bo are washing up at the sink in the gallery, which opens directly onto the study. Merrill sits at a desk with his back to them, reading the navy brochure he picked up in town and lazily chewing licorice. Unnoticed by the other three, Graham pads softly into the gallery and stops. He lowers himself gently into a seat at the desk, his two children turning around to see their father staring at the floor. Morgan steps falteringly up to the desk, leaving Bo at the sink. Merrill then peers casually over his shoulder and notices his downcast brother. Getting up, he heads into the gallery, stopping just short of the desk. Graham looks at Merrill, then sits up straight and sighs. On the screen, fireworks hover in a night sky. Graham and Merrill sit on the futon while Morgan and Bo kneel close to the radio."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Graham pauses, swings the torch, and glances into the tunnel of foliage ahead. He twirls around, projecting the torch beam into the impenetrable jungle on one side but uncovering nothing, the light barely brushing past the first few rows of woody green stalks. He then drops the flashlight to his side and starts to weave his way through the crop, one arm lifted to brush his face from the leaves. Emerging in the first of the crop circles, Graham drops his arm gently and comes to a gradual halt, observing the area with renewed concern. A pale gray light floods the vast perfect circle of evenly bent corn, and the leaves shimmer with a silvery sheen. Graham remains motionless, his torch casting a slender shaft of light across the circle. His eyes flicker about. Graham gulps and takes a steadying breath. He observes the circle apprehensively, then inches backwards towards the standing crop. Turning at the last moment, he veers straight into the corn, pushing through the unyielding forest until he trips out onto a pathway running between two areas of maize. Graham sweeps his torch along the path. It's clear. He then pivots and directs the beam the other way. Again, nothing. He gazes into the crop. Spinning round, he releases the torch and the light fades. Panting and keeping his eyes fixed intently on the maize, he crouches down cautiously and reaches for the torch. Finding the flashlight, he rapidly taps the lens and the beam flickers back, momentarily lighting up his face. He directs the light down the path; a long thin bare leg slips quietly into the corn. Graham scrambles backwards, then springs up and bolts off in the opposite direction. He thrusts into the corn and barrels through it, the torch light leaping over the leaves as he runs. In the farmhouse, Morgan and Bo are tidying up at the sink in the kitchen, which opens directly onto the lounge. Merrill rests at a table with his back to them, perusing the army pamphlet he picked up in town and idly gnawing gum. Unnoticed by the other three, Graham sneaks softly into the kitchen and pauses. He lowers himself gently into a seat at the table, his two children turning around to see their father gazing at the floor. Morgan approaches hesitantly up to the table, leaving Bo at the sink. Merrill then glances casually over his shoulder and observes his downcast brother. Standing up, he strolls into the kitchen, halting just short of the table. Graham gazes at Merrill, then sits up straight and exhales. On the screen, lights drift in a night sky. Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Raven halts, raises the lantern, and peers into the alley of umbrellas ahead. She spins round, aiming the lantern beam into the impenetrable library on one side but finding nothing, the light hardly passing beyond the first few rows of woody red ladders. She then lowers the lantern to her side and begins to pick her way through the orchard, one arm raised to shield her face from the feathers. Emerging in the first of the orchard circles, Raven lowers her arm gently and comes to a gradual stop, viewing the area with renewed concern. A pale gray glow fills the vast perfect circle of evenly flattened books, and the feathers glow with a silvery sheen. Raven stands still, her lantern shooting a slender shaft of light across the circle. Her eyes dart about. Raven swallows and takes a steadying breath. She scans the circle apprehensively, then steps backwards towards the standing orchard. Turning at the last moment, she cuts straight into the books, struggling through the unbending forest until she stumbles out onto a bridge running between two areas of encyclopedias. Raven shines her lantern along the bridge. It's clear. She then turns and points the beam the other way. Again, nothing. She stares into the orchard. Whipping round, she drops the lantern and the light goes out. Panting and keeping her eyes fixed intently on the encyclopedias, she crouches down warily and reaches for the lantern. Locating the lantern, she frantically slaps the lens and the beam returns, briefly illuminating her face. She shines the light down the bridge; a long thin bare arm slips silently into the books. Raven scrabbles backwards, then leaps up and sprints off in the opposite direction. She plows into the books and charges through them, the lantern light dancing over the feathers as she runs. In the apartment, Jordan and Max are washing up at the tub in the arcade, which opens directly onto the foyer. Pat sits at a desk with his back to them, reading the travel brochure he picked up in town and lazily chewing straw. Unnoticed by the other three, Raven pads softly into the arcade and stops. She lowers herself gently into a seat at the desk, her two nieces turning around to see their aunt staring at the ground. Jordan steps falteringly up to the desk, leaving Max at the tub. Pat then peers casually over his shoulder and notices his downcast cousin. Getting up, he heads into the arcade, stopping just short of the desk. Raven looks at Pat, then sits up straight and sighs. On the screen, balloons hover in a night ocean. Raven and Pat sit on the bench while Jordan and Max kneel close to the radio."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Elena pauses, hoists the broom, and gazes into the tunnel of branches ahead. She twirls around, directing the broom beam into the dense thicket on one side but uncovering nothing, the light barely penetrating beyond the first few layers of tangled green vines. She then drops the lantern to her side and begins to tiptoe through the orchard, one hand lifted to shield her head from the branches. Arriving in the first of the fruit circles, Elena lowers her hand gently and halts gradually, observing the area with renewed curiosity. A soft orange glow fills the vast perfect circle of evenly bent apples, and the branches shimmer with a golden hue. Elena stands quietly, her broom casting a narrow shaft of light across the circle. Her gaze flits around. Elena gulps and takes a calming breath. She examines the circle cautiously, then steps forward towards the standing orchard. Pivoting at the last moment, she marches straight into the apple trees, pushing through the resilient grove until she tumbles out onto a trail winding between two patches of pears. Elena beams her lantern along the trail. It's unobstructed. She then pivots and directs the beam the other way. Again, emptiness. She glares into the orchard. Twisting around, she drops the broom and the light extinguishes. Gasping and keeping her gaze fixed cautiously on the pears, she crouches down carefully and fumbles for the broom. Grabbing the lantern, she urgently taps the lens and the beam reappears, briefly brightening her face. She directs the light down the trail; a long thin bare arm slips silently into the apple trees. Elena scrambles forward, then springs up and jogs off in the opposite direction. She barrels into the apple trees and navigates through them, the lantern light skipping over the branches as she moves. In the farmhouse, Jenny and Tom are tidying up at the sink in the kitchen, which opens directly onto the den. Sam reclines at a desk with his back to them, skimming the gardening brochure he acquired in town and idly munching popcorn. Unnoticed by the other three, Elena tiptoes softly into the kitchen and halts. She eases herself gently into a chair at the desk, her two children twisting around to see their mother gazing at the floor. Jenny approaches hesitantly up to the desk, leaving Tom at the sink. Sam then glances casually over his shoulder and spots his disheartened sister. Rising, he meanders into the kitchen, pausing just short of the desk. Elena meets Sam's gaze, then straightens up and exhales. On the screen, shadows drift in a dusky sky. Elena and Sam recline on the couch while Jenny and Tom crouch close to the TV."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Graham pauses, lifts the lantern, and gazes into the corridor of branches ahead. He twirls around, directing the lantern glow into the dense forest on one side but finding nothing, the light barely reaching beyond the first few layers of thick green vines. He then drops the flashlight to his waist and begins to weave his way through the garden, one arm lifted to shield his face from the branches. Entering the first of the garden clearings, Graham gently lowers his arm and glides to a slow halt, observing the space with growing worry. A soft silver light fills the expansive symmetrical circle of evenly pressed grass, and the branches shimmer with a pearly glint. Graham remains unmoving, his lantern casting a narrow ray of light across the circle. His eyes flit around. Graham gulps and takes a calming inhale. He surveys the circle cautiously, then steps backwards towards the standing garden. Turning at the final moment, he strides directly into the grass, wrestling through the rigid wilderness until he tumbles out onto a trail running between two sections of wheat. Graham illuminates the trail with his lantern. It's empty. He then swivels and directs the glow the other way. Again, nothing. He gazes into the garden. Whirling around, he drops the lantern and the light extinguishes. Breathing heavily and keeping his gaze locked firmly on the wheat, he crouches down carefully and reaches for the lantern. Finding the flashlight, he hurriedly taps the bulb and the glow returns, momentarily lighting his face. He aims the light along the trail; a long thin bare arm glides silently into the grass. Graham scrambles backwards, then jumps up and bolts off in the opposite direction. He charges into the grass and races through it, the lantern glow skipping over the branches as he hastens. In the farmhouse, Morgan and Bo are tidying up at the basin in the lounge, which opens directly onto the dining room. Merrill sits at a counter with his back to them, glancing at the military brochure he picked up in town and idly chewing gum. Unseen by the other three, Graham tiptoes softly into the lounge and pauses. He eases himself gently onto a stool at the counter, his two children turning around to see their father gazing at the floor. Morgan steps hesitantly up to the counter, leaving Bo at the basin. Merrill then glances casually over his shoulder and notices his discouraged brother. Standing up, he walks into the lounge, halting just short of the counter. Graham looks at Merrill, then sits up straight and exhales. On the screen, lights drift in a twilight sky. Graham and Merrill perch on the couch while Morgan and Bo crouch close to the TV."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver halts, lifts the lantern, and gazes into the cavern of vines ahead. He twirls around, directing the lantern beam into the thick forest on one side but discovering nothing, the glow barely extending beyond the initial lines of spiky brown branches. He then lowers the candlestick to his hip and starts to navigate his way through the thicket, one hand lifted to shield his eyes from the twigs. Emerging in the first of the fairy rings, Oliver lowers his limb gently and comes to a slow stop, examining the clearing with growing curiosity. A dim blue glow fills the expansive flawless ring of uniformly trampled grass, and the branches shimmer with an azure gleam. Oliver stands motionless, his lantern casting a narrow ray of glow across the circle. His eyes flicker around. Oliver gulps and takes a calming sigh. He observes the ring nervously, then retreats backwards towards the standing thicket. Turning at the last moment, he cuts directly into the grass, pushing through the rigid grove until he tumbles out onto a trail running between two patches of wheat. Oliver directs his lantern along the trail. It's empty. He then turns and points the glow the other way. Again, nothing. He gazes into the thicket. Spinning around, he drops the lantern and the glow fades away. Breathing heavily and keeping his eyes fixed intently on the wheat, he crouches down cautiously and reaches for the lantern. Finding the candlestick, he frantically taps the glass and the beam reappears, momentarily lighting up his face. He directs the glow down the trail; a long thin bare branch slides silently into the grass. Oliver crawls backwards, then jumps up and bolts off in the opposite direction. He dives into the grass and rushes through it, the lantern light flickering over the branches as he dashes. In the cabin, Jamie and Pat are drying dishes at the tub in the pantry, which opens directly onto the den. Terry sits at a desk with his back to them, reading the sailor's guide he grabbed in the village and lazily munching gum. Unnoticed by the other three, Oliver tiptoes softly into the pantry and stops. He lowers himself gently into a chair at the desk, his two children turning around to see their father gazing at the floor. Jamie steps hesitantly up to the desk, leaving Pat at the tub. Terry then glances casually over his shoulder and notices his somber brother. Rising, he walks into the pantry, stopping just short of the desk. Oliver looks at Terry, then sits up straight and exhales. On the monitor, stars hover in a twilight setting. Oliver and Terry sit on the couch while Jamie and Pat kneel close to the screen."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Graham stops and peers into the tunnel of foliage with a torch, finding nothing but impenetrable jungle. He pushes through the crop, reaching a vast, illuminated circle of flattened corn with growing concern. As he examines it, he steps back into the standing crop and struggles through to a pathway. Shining the torch along the path reveals nothing, and upon spinning around, he drops the torch. When he retrieves and revives it, he glimpses a bare leg disappearing into the corn. Graham scrambles up and sprints away, the torch light flickering as he runs. At home, his children, Morgan and Bo, wash dishes in the kitchen, which connects to the lounge where Merrill reads an army pamphlet. Graham enters quietly and sinks into a chair at the table, prompting the children to notice his distress. Merrill joins them, and after Graham looks at him, he straightens up and sighs. Meanwhile, the TV shows lights hovering in the night sky, with Graham and Merrill on the sofa and the children kneeling closely."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV On the screen lights hover in a night sky  Graham looks at Merrill then sits up straight and sighs  Getting up he heads into the kitchen stopping just short of the table  Merrill then peers casually over his shoulder and notices his downcast brother  Morgan steps falteringly up to the table leaving Bo at the sink  He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor  Unnoticed by the other three Graham pads softly into the kitchen and stops  Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum  In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge  the torch light dancing over the leaves as he runs  He plows into the corn and charges through it  Graham scrabbles backwards then leaps up and sprints off in the opposite direction  a long thin bare leg slips silently into the corn  He shines the light down the path  Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face  he crouches down warily and reaches for the torch  Panting and keeping his eyes fixed intently on the maize  Whipping round he drops the torch and the light goes out  He stares into the crop  Again nothing  He then turns and points the beam the other way  It's clear  Graham shines his torch along the path  Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize  He scans the circle apprehensively then steps backwards towards the standing crop  Graham swallows and takes a steadying breath  His eyes dart about  Graham stands still his torch shooting a slender shaft of light across the circle  A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen  Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern  He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves  the light hardly passing beyond the first few rows of woody green stalks  He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing  Graham halts raises the torch and peers into the tunnel of foliage ahead "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "the torch light dancing over the leaves as he runs  he crouches down warily and reaches for the torch  Getting up he heads into the kitchen stopping just short of the table  Graham scrabbles backwards then leaps up and sprints off in the opposite direction  Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize  His eyes dart about  Graham looks at Merrill then sits up straight and sighs  In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge  Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern  Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV Graham halts raises the torch and peers into the tunnel of foliage ahead  He plows into the corn and charges through it  He stares into the crop  He shines the light down the path  Whipping round he drops the torch and the light goes out  Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum  He scans the circle apprehensively then steps backwards towards the standing crop  On the screen lights hover in a night sky  the light hardly passing beyond the first few rows of woody green stalks  Merrill then peers casually over his shoulder and notices his downcast brother  Morgan steps falteringly up to the table leaving Bo at the sink  Panting and keeping his eyes fixed intently on the maize  Again nothing  He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing  Graham swallows and takes a steadying breath  Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face  He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor  Unnoticed by the other three Graham pads softly into the kitchen and stops  Graham shines his torch along the path  He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves  It's clear  A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen  Graham stands still his torch shooting a slender shaft of light across the circle  a long thin bare leg slips silently into the corn  He then turns and points the beam the other way "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "he crouches down warily and reaches for the torch  Locating the flashlight he frantically slaps the lens and the beam returns briefly illuminating his face  He shines the light down the path  a long thin bare leg slips silently into the corn  Graham scrabbles backwards then leaps up and sprints off in the opposite direction  He plows into the corn and charges through it  the torch light dancing over the leaves as he runs  In the farmhouse Morgan and Bo are washing up at the sink in the kitchen which opens directly onto the lounge  Merrill sits at a table with his back to them reading the army pamphlet he picked up in town and lazily chewing gum  Unnoticed by the other three Graham pads softly into the kitchen and stops  He lowers himself gently into a seat at the table his two children turning around to see their father staring at the floor  Morgan steps falteringly up to the table leaving Bo at the sink  Merrill then peers casually over his shoulder and notices his downcast brother  Getting up he heads into the kitchen stopping just short of the table  Graham looks at Merrill then sits up straight and sighs  On the screen lights hover in a night sky  Graham and Merrill sit on the sofa while Morgan and Bo kneel close to the TV Graham halts raises the torch and peers into the tunnel of foliage ahead  He spins round aiming the torch beam into the impenetrable jungle on one side but finding nothing  the light hardly passing beyond the first few rows of woody green stalks  He then lowers the flashlight to his side and begins to pick his way through the crop one arm raised to shield his face from the leaves  Emerging in the first of the crop circles Graham lowers his arm gently and comes to a gradual stop viewing the area with renewed concern  A pale gray light fills the vast perfect circle of evenly flattened corn and the leaves glow with a silvery sheen  Graham stands still his torch shooting a slender shaft of light across the circle  His eyes dart about  Graham swallows and takes a steadying breath  He scans the circle apprehensively then steps backwards towards the standing crop  Turning at the last moment he cuts straight into the corn struggling through the unbending forest until he stumbles out onto a pathway running between two areas of maize  Graham shines his torch along the path  It's clear  He then turns and points the beam the other way  Again nothing  He stares into the crop  Whipping round he drops the torch and the light goes out  Panting and keeping his eyes fixed intently on the maize "
        }
      ]
    }
  ]
}