{
  "ground_truth": "Jamal gulps his drink down quickly as the inspector makes to leave the room. Outside Javed's luxurious house, Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration as the inspector leaves. Jamal looks down at the ground, exhausted. On TV, a news report shows, and Salim and Latika glance at each other and then back at the TV, where a livid scar is revealed along Latika's cheekbone. In the room with Jamal are a number of girls, thugs, and Javed, and Latika sees Jamal on the TV. Javed snatches the remote control and changes the channel, gesturing for the girls to dance. Latika leaves the room and Salim notices she's gone as scantily clad girls flood in with the thugs. A girl tries to dance with Javed while he's on the phone, but he bats her away and moves to a quieter room. Salim watches the girls cavorting with no interest, leaves, and joins Latika next door. Latika wipes tears from her face as Salim walks over and holds out a set of keys, which she takes. He shakes his head, takes out his phone, dials a number, then closes the phone and hands it to her, gently stroking her cheek near the scar. He holds the door open for her and closes it behind her as she dashes towards his car. Salim walks back to the main room where Javed is still on the phone. Latika starts the car as Srinivas throws water on a dozing Jamal. Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing. Latika slows down as she hits major traffic jams in a gridlocked road while studio lights come on as technicians assemble equipment. An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer, with people all over the country gathering in front of TVs to watch. Latika sits in her car in traffic as crowds stand outside electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV. The main room at the Excel Five Call Center is virtually empty as a manager walks in, seeing the TV room packed with staff watching Jamal appear on the screen. In the studio, as the host leads Jamal to his chair, Latika decides to dump the car and walk. Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen, as Jamal smiles, recollecting his teacher beating him with the book and sheltering from the rain as a child, saying she could be the third musketeer.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jamal swallows his beverage down swiftly as the examiner prepares to depart the chamber. Outside Javed's opulent residence, Jamal perceives through the panes that much of the decor has been taken away and strikes his head on the entryway in exasperation as the examiner exits. Jamal gazes down at the earth, fatigued. On television, a news bulletin displays, and Salim and Latika watch each other and then back at the television, where a furious mark is disclosed along Latika's cheekbone. In the chamber with Jamal are a group of females, hoodlums, and Javed, and Latika perceives Jamal on the television. Javed grabs the remote and alters the station, signaling for the females to perform. Latika exits the chamber and Salim observes she's absent as scantily attired females inundate in with the hoodlums. A female attempts to perform with Javed while he's on the telephone, but he swats her away and proceeds to a more silent chamber. Salim observes the females frolicking with no curiosity, departs, and joins Latika next door. Latika cleans tears from her visage as Salim strolls over and extends a set of keys, which she accepts. He moves his head, removes his telephone, presses a number, then closes the phone and hands it to her, softly caressing her cheek near the mark. He holds the entryway open for her and closes it behind her as she races towards his vehicle. Salim strolls back to the primary chamber where Javed is still on the telephone. Latika initiates the vehicle as Srinivas splashes liquid on a napping Jamal. Latika maneuvers at a high velocity on congested roads as throngs cheer outside the studio where Jamal arrives in a law enforcement vehicle with cameras flashing. Latika decelerates as she encounters major traffic snarls in a jammed road while studio illuminations activate as technicians set up apparatus. An elderly woman perceives Jamal in the vehicle as the throng starts to assemble and individuals commence to cheer, with individuals all over the nation assembling in front of televisions to observe. Latika sits in her vehicle in traffic as throngs stand outside electrical merchandise shops observing the program on televisions in the panes and an entire family has assembled to have a meal in front of the television. The primary chamber at the Excel Five Call Center is nearly vacant as a supervisor strolls in, observing the television room packed with personnel observing Jamal appear on the screen. In the studio, as the presenter guides Jamal to his seat, Latika resolves to abandon the vehicle and proceed on foot. Latika halts outside the electronics shop and joins the throng observing Jamal on the screen, as Jamal grins, recalling his instructor striking him with the text and taking cover from the precipitation as a youngster, stating she could be the third musketeer."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jamal's drink is gulped down quickly by him as the inspector prepares to leave the room. Outside Javed's luxurious house, much of the furniture has been seen through the windows by Jamal as removed, and his head is banged on the door in frustration as the inspector departs. Exhaustion causes Jamal to look down at the ground. On TV, a news report is shown, and Salim and Latika exchange glances and then focus back on the TV, where a livid scar along Latika's cheekbone is revealed. In the room with Jamal are a number of girls, thugs, and Javed, and Jamal is seen by Latika on the TV. The remote control is snatched by Javed, who changes the channel and gestures for the girls to dance. The room is left by Latika, and her absence is noticed by Salim as scantily clad girls flood in with the thugs. Javed is danced with by a girl while he's on the phone, but she is batted away by him, and he moves to a quieter room. The cavorting girls are watched by Salim with no interest, and he leaves to join Latika next door. The tears are wiped from her face by Latika as the set of keys is held out to her by Salim, which she takes. He shakes his head, dials a number on his phone, then closes it and hands it to her, gently stroking her cheek near the scar. The door is held open for her by him and closed behind her as she dashes towards his car. The main room is walked back to by Salim where Javed is still on the phone. The car is started by Latika as a dozing Jamal is splashed with water by Srinivas. High speed is achieved by Latika on packed roads as cheering occurs outside the studio where Jamal arrives in a police van with cameras flashing. Major traffic jams are hit by Latika as she slows down in a gridlocked road while studio lights are switched on and equipment is assembled by technicians. Jamal is seen in the van by an old woman as the crowd begins to gather and people start to cheer, with people all over the country gathering in front of TVs to watch. Latika remains in her car in traffic as crowds stand outside electrical goods shops watching the show on TVs in the windows, and an entire family is gathered to have supper in front of the TV. The main room at the Excel Five Call Center is seen virtually empty by a manager, who observes the TV room packed with staff watching Jamal appear on the screen. In the studio, as Jamal is led to his chair by the host, the decision is made by Latika to dump the car and walk. Outside the electronics shop, Latika stops and joins the crowd watching Jamal on the screen, as Jamal smiles, recalling his teacher beating him with the book and sheltering from the rain as a child, saying she could be the third musketeer."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jamal quickly finishes his drink as the inspector exits. Outside Javed's luxurious house, Jamal notices much of the furniture is gone and bangs his head on the door in frustration. Exhausted, he looks down. On TV, a news report shows, and Salim and Latika exchange glances before looking back at the screen, revealing a scar on Latika's cheek. In the room with Jamal are girls, thugs, Javed, and Latika sees Jamal on TV. Javed changes the channel, gesturing for the girls to dance. Latika leaves, and Salim notices her absence as scantily clad girls enter with the thugs. A girl tries to dance with Javed, but he moves to a quieter room. Salim, uninterested, leaves to join Latika next door. Latika wipes her tears as Salim offers her keys, which she takes. He shakes his head, dials a number, then hands her the phone, gently stroking her cheek. He opens the door for her, and she rushes to his car. Salim returns to the main room where Javed is on the phone. Latika starts the car as Srinivas throws water on Jamal. Latika speeds through packed roads as crowds cheer outside the studio where Jamal arrives in a police van. Latika slows in traffic jams while studio lights come on. An old woman sees Jamal in the van as crowds gather, cheering, with people nationwide watching on TV. Latika sits in traffic as crowds watch the show on TVs in shop windows, and families gather for supper in front of the TV. The Excel Five Call Center's main room is empty as a manager sees the TV room packed with staff watching Jamal. In the studio, as the host leads Jamal to his chair, Latika abandons the car to walk. She stops outside an electronics shop, joining the crowd watching Jamal, who smiles, recalling his teacher beating him with a book and sheltering from the rain as a child, saying she could be the third musketeer."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jamal gulps his drink as the inspector exits. Outside Javed's house, Jamal sees furniture missing and bangs his head in frustration. On TV, a news report shows, revealing a scar on Latika's cheek. In the room with Jamal are girls, thugs, Javed, and Latika sees Jamal on TV. Javed changes the channel, gesturing for dancing. Latika leaves, and Salim notices, offering her keys. He dials a number, hands her the phone, and strokes her cheek. Salim holds the door for her as she dashes to his car. Salim returns to Javed, still on the phone. Latika speeds through traffic as Jamal arrives at the studio in a van. Latika hits traffic jams while studio lights come on. Crowds gather to watch Jamal on TV. Latika abandons the car to walk, joining a crowd watching Jamal on screen. Jamal smiles, recalling childhood memories."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jamal hastily gulps down his drink, feeling the urgency as the inspector prepares to make his exit from the room. Outside the opulent and luxurious residence of Javed, Jamal peers through the windows and notices with dismay that a significant portion of the furniture has been removed. In a moment of frustration, he bangs his head against the door just as the inspector departs. Overwhelmed and weary, Jamal lowers his gaze to the ground, feeling utterly exhausted. Meanwhile, on the television, a news report is being broadcast, and Salim and Latika exchange glances before turning their attention back to the screen, where a vivid and angry scar is prominently displayed along Latika's cheekbone. \n\nIn the room with Jamal, there is a gathering of several girls, some thugs, and Javed himself, while Latika catches sight of Jamal on the television. Javed, with a swift motion, snatches the remote control and changes the channel, signaling to the girls to start dancing. Latika quietly exits the room, and Salim, noticing her absence, observes as scantily clad girls begin to flood in alongside the thugs. One of the girls attempts to dance with Javed while he is engaged in a phone call, but he dismissively bats her away and retreats to a quieter room. Salim, showing no interest in the girls' antics, leaves the scene and joins Latika in the adjacent room. \n\nLatika, wiping tears from her face, is approached by Salim, who extends a set of keys to her, which she accepts. He shakes his head slightly, retrieves his phone, dials a number, then closes the phone and hands it to her, gently caressing her cheek near the scar. He holds the door open for her, allowing her to pass through, and then closes it behind her as she makes a dash towards his car. Salim returns to the main room, where Javed remains engrossed in his phone conversation. Latika starts the car and drives at a high speed through the congested roads, while outside the studio, crowds cheer as Jamal arrives in a police van, cameras flashing all around. \n\nLatika's progress slows as she encounters major traffic jams on the gridlocked roads, while inside the studio, technicians are busy assembling equipment as the studio lights come on. An elderly woman catches sight of Jamal in the van as the crowd begins to gather, and people start to cheer, with individuals all over the country congregating in front of their televisions to watch the unfolding events. Latika sits in her car, stuck in traffic, as crowds gather outside electrical goods shops, watching the show on the TVs displayed in the windows. Meanwhile, an entire family has gathered to have supper in front of their TV. \n\nAt the Excel Five Call Center, the main room is nearly deserted as a manager walks in, only to find the TV room packed with staff, all intently watching Jamal appear on the screen. In the studio, as the host leads Jamal to his chair, Latika makes the decision to abandon the car and proceed on foot. She stops outside an electronics shop and joins the crowd gathered there, watching Jamal on the screen. Jamal, with a smile, recalls his teacher beating him with a book and taking shelter from the rain as a child, reminiscing about how she could be the third musketeer."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jamal, feeling a sense of urgency, quickly gulps down his drink as he senses that the inspector is on the verge of making his exit from the room. Outside the opulent and luxurious residence belonging to Javed, Jamal peers through the windows with growing dismay, noticing that a significant portion of the lavish furniture has been removed. Overcome with frustration, he bangs his head against the door precisely at the moment the inspector departs from the scene. Overwhelmed and weary beyond words, Jamal lowers his eyes to the ground, feeling utterly drained and exhausted. Meanwhile, on the television, a news report begins to air, and Salim and Latika exchange meaningful glances before they refocus their attention on the screen, where a prominent and angry scar appears vividly on Latika's cheekbone.\n\nIn the room with Jamal, a gathering of several girls, some menacing thugs, and Javed himself take center stage, while Latika catches sight of Jamal appearing on the television screen. With a swift and decisive motion, Javed snatches the remote control from the table and changes the channel, gesturing to the girls to start dancing. Latika quietly and discreetly exits the room, and Salim, noticing her absence, observes attentively as scantily clad girls begin to flood the area alongside the intimidating thugs. One of the girls attempts to initiate a dance with Javed while he is preoccupied with a phone call, but he dismissively bats her away, retreating to a quieter room for some solitude. Salim, showing no interest in the antics of the girls, leaves the scene and joins Latika in the adjacent room.\n\nLatika, with tears streaming down her face, is approached by Salim, who offers her a set of keys, which she gratefully accepts. He slightly shakes his head, retrieves his phone, dials a number, and then closes the phone and hands it to her, gently caressing the area near the scar on her cheek. He holds the door open for her, allowing her to pass through gracefully, and then closes it behind her as she makes a swift dash towards his car. Salim returns to the main room, where Javed remains deeply engrossed in his ongoing phone conversation. Latika starts the car and speeds through the congested roads with determination, while outside the studio, crowds erupt in cheers as Jamal arrives in a police van, cameras capturing every moment in a flurry of flashing lights.\n\nLatika's progress slows considerably as she encounters major traffic jams on the gridlocked roads, while inside the studio, technicians busily assemble equipment as the bright studio lights come on. An elderly woman catches a glimpse of Jamal in the van as the growing crowd begins to gather, and people start to cheer enthusiastically, with individuals all over the country congregating in front of their televisions to witness the unfolding events. Latika sits patiently in her car, stuck in traffic, as crowds gather outside electrical goods shops, watching the show on the TVs displayed in the windows. Meanwhile, an entire family has gathered together to have supper in front of their television.\n\nAt the Excel Five Call Center, the main room is nearly deserted, as the manager walks in, only to discover the TV room packed to capacity with staff, all intently watching Jamal appear on the screen. In the studio, as the charismatic host leads Jamal to his chair, Latika makes the bold decision to abandon the car and proceed on foot. She stops outside an electronics shop and joins the crowd gathered there, watching Jamal on the screen with great anticipation. With a warm smile, Jamal recalls his teacher beating him with a book and taking shelter from the pouring rain as a child, reminiscing about how she might be the third musketeer in their shared story."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jamal, feeling the urgency of the moment, quickly gulps down his drink as he notices the inspector preparing to leave the room. As he steps outside Javed's opulent house, Jamal peers through the windows and observes that much of the furniture has been removed, which leads him to bang his head against the door in frustration just as the inspector departs. Overwhelmed and exhausted, Jamal lowers his gaze to the ground. Meanwhile, a news report plays on the TV, capturing the attention of Salim and Latika, who exchange glances before turning their focus back to the screen, where a vivid scar is prominently displayed along Latika's cheekbone. In the room with Jamal, a mix of girls, thugs, and Javed are present, and Latika catches sight of Jamal on the TV. Javed, noticing this, quickly snatches the remote control and changes the channel, signaling for the girls to start dancing. Latika quietly exits the room, and Salim soon realizes her absence as scantily clad girls begin to fill the space alongside the thugs. One of the girls attempts to dance with Javed while he is engaged in a phone call, but he dismissively pushes her away and relocates to a quieter room. Salim, showing no interest in the revelry, leaves the scene and joins Latika in the adjacent room. There, Latika wipes tears from her face as Salim approaches and extends a set of keys to her, which she accepts. He shakes his head in a gesture of resignation, retrieves his phone, dials a number, then closes it and hands it to her, gently caressing her cheek near the scar. He then holds the door open for her, allowing her to exit, and closes it behind her as she rushes towards his car. Salim returns to the main room where Javed remains on the phone. Meanwhile, Latika starts the car and drives at a high speed through the congested roads, while outside the studio, crowds cheer as Jamal arrives in a police van amidst flashing cameras. Latika's progress is hindered as she encounters major traffic jams on the gridlocked road, while inside the studio, technicians busily assemble equipment as the studio lights come on. An old woman spots Jamal in the van as the crowd begins to gather, and people start to cheer, with viewers all over the country congregating in front of TVs to watch the unfolding events. Latika remains stuck in her car amidst the traffic, observing as crowds gather outside electrical goods shops to watch the show on TVs displayed in the windows, and an entire family assembles to have supper in front of their TV. At the Excel Five Call Center, the main room is nearly deserted as a manager enters, noticing the TV room packed with staff intently watching Jamal on the screen. In the studio, as the host guides Jamal to his chair, Latika makes the decision to abandon the car and proceed on foot. She stops outside an electronics shop and joins the crowd watching Jamal on the screen, as Jamal smiles, reminiscing about his teacher beating him with a book and taking shelter from the rain as a child, recalling her saying he could be the third musketeer."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jamal quickly finishes his drink as the inspector exits the room. Observing from outside Javed's house, Jamal notices the furniture removal and expresses frustration by banging his head on the door. Exhausted, he looks down. Meanwhile, a news report on TV reveals a scar on Latika's cheek, prompting a glance between Salim and Latika. In the room with Jamal are girls, thugs, and Javed, who changes the channel and signals the girls to dance. Latika leaves, and Salim notices her absence as more girls enter. A girl attempts to dance with Javed, but he dismisses her and moves to a quieter room. Salim, uninterested in the scene, follows Latika next door, where he offers her a set of keys and his phone, gently touching her cheek. He holds the door for her as she rushes to his car. Salim returns to the main room where Javed is on the phone. Latika speeds through crowded roads as Jamal arrives at the studio in a police van amid cheering crowds. Latika encounters traffic jams while studio preparations continue. As people gather to watch Jamal on TV, Latika abandons the car and joins the crowd outside an electronics shop, watching Jamal on screen. Jamal smiles, recalling childhood memories of his teacher and the rain, mentioning the third musketeer."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jamal, feeling the urgency of the moment, gulps his drink down quickly as the inspector, who has been questioning him about recent events, makes to leave the room. Outside Javed's luxurious house, known in the neighborhood for its expansive marble floors and ornate decorations, Jamal sees through the large bay windows that much of the furniture has been removed, likely in haste, and bangs his head on the door in frustration as the inspector leaves, taking with him the last hope of intervention. Jamal looks down at the ground, exhausted from the day's stress and the relentless heat of the bustling city. On TV, a breaking news report shows, and Salim and Latika, familiar with the grim realities it depicts, glance at each other and then back at the TV, where a livid scar is revealed along Latika's cheekbone, a reminder of past violence she endured. In the room with Jamal are a number of girls, thugs, and Javed, a notorious local crime lord, and Latika sees Jamal on the TV. Javed, always paranoid about appearances, snatches the remote control and changes the channel, gesturing for the girls to dance, an act meant to distract rather than entertain. Latika leaves the room and Salim, who has always been watchful over her, notices she's gone as scantily clad girls flood in with the thugs. A girl tries to dance with Javed while he's on the phone, discussing business that likely pertains to his criminal enterprises, but he bats her away and moves to a quieter room. Salim watches the girls cavorting with no interest, leaves the chaos, and joins Latika next door in a quiet moment of solidarity. Latika, bearing the weight of her emotions, wipes tears from her face as Salim walks over and holds out a set of keys, symbolizing a chance for freedom, which she takes. He shakes his head, takes out his phone, dials a number that remains unanswered, then closes the phone and hands it to her, gently stroking her cheek near the scar, a gesture of brotherly care. He holds the door open for her and closes it behind her as she dashes towards his car, an aging vehicle once used for their escapades. Salim walks back to the main room where Javed is still on the phone, his voice a low rumble. Latika starts the car as Srinivas, one of Javed's loyal men known for his hardened demeanor, throws water on a dozing Jamal to rouse him. Latika drives at a high speed on packed roads, weaving through traffic as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing, capturing every moment of the spectacle. Latika slows down as she hits major traffic jams in a gridlocked road, a common occurrence in the city, while studio lights come on as technicians assemble equipment for the broadcast. An old woman, reminiscing her younger days spent watching similar spectacles, sees Jamal in the van as the crowd begins to gather and people start to cheer, with people all over the country gathering in front of TVs to watch the unfolding drama. Latika sits in her car in traffic as crowds stand outside electrical goods shops watching the show on TVs in the windows, a scene reminiscent of the communal viewings during major cricket matches, and an entire family has gathered to have supper in front of the TV, turning the event into an impromptu gathering. The main room at the Excel Five Call Center, a hub of constant activity, is virtually empty as a manager walks in, seeing the TV room packed with staff watching Jamal appear on the screen, an unprecedented sight in a place usually buzzing with phone calls. In the studio, as the charismatic host leads Jamal to his chair, Latika decides to dump the car and walk, hoping to navigate the pedestrian paths more swiftly. Latika stops outside the electronics shop, joining the crowd watching Jamal on the screen in a moment of shared anticipation, as Jamal smiles, recollecting his teacher beating him with the book and sheltering from the rain as a child, a memory of when she said she could be the third musketeer, a testament to resilience and dreams amidst adversity."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jamal gulps his drink down quickly as the inspector makes to leave the room  Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration  as the inspector leaves  Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes  He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar  He holds the door open for her and closes it behind her as she dashes towards his car  Salim walks back to the main room where Javed is still on the phone  Latika starts the car as Srinivas throws water on a dozing Jamal  Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing  Latika slows down as she hits major traffic jams in a gridlocked road  while studio lights come on as technicians assemble equipment  An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch  Latika sits in her car in traffic as crowds stand outside  electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV  The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen  In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk  Jamal looks down at the ground exhausted  On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone  In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV  Javed snatches the remote control and changes the channel gesturing for the girls to dance  Latika leaves the room and Salim notices she's gone as scantily clad girls flood in with the thugs  A girl tries to dance with Javed while he's on the phone but he bats her away and moves to a quieter room  Salim watches the girls cavorting with no interest leaves and joins Latika next door  Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes  He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar  He holds the door open for her and closes it behind her as she dashes towards his car  Salim walks back to the main room where Javed is still on the phone  Latika starts the car as Srinivas throws water on a dozing Jamal  Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing  Latika slows down as she hits major traffic jams in a gridlocked road  while studio lights come on as technicians assemble equipment  An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch  Latika sits in her car in traffic as crowds stand outside  electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV  The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen  In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk  Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating  him with the book and sheltering from the rain as a child saying she could be the third musketeer"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jamal gulps his drink down quickly as the inspector makes to leave the room. Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration as the inspector leaves. Jamal looks down at the ground exhausted. On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone. In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV. Javed snatches the remote control and changes the channel gesturing for the girls to dance. Latika leaves the room and Salim notices she is gone as scantily clad girls flood in with the thugs. A girl tries to dance with Javed while he is on the phone but he bats her away and moves to a quieter room. Salim watches the girls cavorting with no interest leaves and joins Latika next door. Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes. He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He holds the door open for her and closes it behind her as she dashes towards his car. Salim walks back to the main room where Javed is still on the phone. Latika starts the car as Srinivas throws water on a dozing Jamal. Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing. Latika slows down as she hits major traffic jams in a gridlocked road while studio lights come on as technicians assemble equipment. An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch. Latika sits in her car in traffic as crowds stand outside. electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV. The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen. In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk. Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating him with the book and sheltering from the rain as a child saying she could be the third musketeer."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jamal gulps his drink down quickly as the inspector makes to leave the room. Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration as the inspector leaves. Jamal looks down at the ground exhausted. On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone. In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV. Javed snatches the remote control and changes the channel gesturing for the girls to dance. Latika leaves the room and Salim notices she is gone as scantily clad girls flood in with the thugs. A girl tries to dance with Javed while he is on the phone but he bats her away and moves to a quieter room. Salim watches the girls cavorting with no interest leaves and joins Latika next door. Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes. He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He holds the door open for her and closes it behind her as she dashes towards his car. Salim walks back to the main room where Javed is still on the phone. Latika starts the car as Srinivas throws water on a dozing Jamal. Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing. Latika slows down as she hits major traffic jams in a gridlocked road while studio lights come on as technicians assemble equipment. An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch. Latika sits in her car in traffic as crowds stand outside. electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV. The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen. In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk. Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating him with the book and sheltering from the rain as a child saying she could be the third musketeer."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jamal gulps his drink down quickly as the inspector makes to leave the room. Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration as the inspector leaves. Jamal looks down at the ground exhausted. On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone. In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV. Javed snatches the remote control and changes the channel gesturing for the girls to dance. Latika sits in her car in traffic as crowds stand outside. electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV. The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen. In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk. Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating him with the book and sheltering from the rain as a child saying she could be the third musketeer."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jamal gulps his drink down quickly as the inspector makes to leave the room. Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration as the inspector leaves. Jamal looks down at the ground exhausted. In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk. Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating him with the book and sheltering from the rain as a child saying she could be the third musketeer."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A cat gulps its drink down quickly as the postman makes to leave the room. Outside a dog's luxurious house, the cat sees through the windows that much of the furniture has been removed and bangs its head on the door in frustration as the postman leaves. The cat looks down at the ground, exhausted. On TV, a news report shows, and a monkey and a rabbit glance at each other and then back at the TV, where a livid scar is revealed along the rabbit's cheekbone. In the room with the cat are a number of chickens, elephants, and a dog, and the rabbit sees the cat on the TV. The dog snatches the remote control and changes the channel, gesturing for the chickens to dance. The rabbit leaves the room and the monkey notices she's gone as scantily clad chickens flood in with the elephants. A chicken tries to dance with the dog while he's on the phone, but he bats her away and moves to a quieter room. The monkey watches the chickens cavorting with no interest, leaves, and joins the rabbit next door. The rabbit wipes tears from her face as the monkey walks over and holds out a set of keys, which she takes. It shakes its head, takes out its phone, dials a number, then closes the phone and hands it to her, gently stroking her cheek near the scar. It holds the door open for her and closes it behind her as she dashes towards its car. The monkey walks back to the main room where the dog is still on the phone. The rabbit starts the car as a tiger throws water on a dozing cat. The rabbit drives at a high speed on packed roads as crowds cheer outside the studio where the cat arrives in a police van with cameras flashing. The rabbit slows down as she hits major traffic jams in a gridlocked road while studio lights come on as technicians assemble equipment. An old man sees the cat in the van as the crowd begins to gather and people start to cheer, with people all over the country gathering in front of TVs to watch. The rabbit sits in her car in traffic as crowds stand outside electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV. The main room at the Excel Five Call Center is virtually empty as a duck walks in, seeing the TV room packed with staff watching the cat appear on the screen. In the studio, as the host leads the cat to its chair, the rabbit decides to dump the car and walk. The rabbit stops outside the electronics shop and joins the crowd watching the cat on the screen, as the cat smiles, recollecting its teacher beating it with the book and sheltering from the rain as a child, saying she could be the third musketeer."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jamal gulps his lemonade down quickly as the inspector makes to leave the cabin. Outside Javed's rustic barn, Jamal sees through the skylights that much of the artwork has been removed and bangs his head on the gate in frustration as the inspector leaves. Jamal looks down at the sidewalk, exhausted. On the radio, a weather report plays, and Salim and Latika glance at each other and then back at the radio, where a livid bruise is revealed along Latika's arm. In the cabin with Jamal are a number of boys, vendors, and Javed, and Latika hears Jamal on the radio. Javed snatches the joystick and changes the station, gesturing for the boys to paint. Latika leaves the cabin and Salim notices she's gone as scantily clad boys flood in with the vendors. A boy tries to dance with Javed while he's on the computer, but he bats him away and moves to a darker hallway. Salim watches the boys cavorting with no interest, leaves, and joins Latika next door. Latika wipes tears from her eyes as Salim walks over and holds out a stack of letters, which she takes. He shakes his head, takes out his laptop, dials a number, then closes the laptop and hands it to her, gently stroking her hair near the bruise. He holds the window open for her and closes it behind her as she dashes towards his bicycle. Salim walks back to the main hallway where Javed is still on the computer. Latika starts the bicycle as Srinivas throws sand on a dozing Jamal. Latika pedals at a high speed on crowded paths as crowds cheer outside the cinema where Jamal arrives in a trolley with spotlights flashing. Latika slows down as she hits major pedestrian jams in a gridlocked square while studio signs come on as artisans assemble props. An old man sees Jamal in the trolley as the mob begins to gather and people start to cheer, with people all over the town gathering in front of radios to listen. Latika sits on her bicycle in traffic as crowds stand outside consignment stores listening to the show on radios in the windows and an entire group has gathered to have a picnic in front of the radio. The main hallway at the Proxima Three Logistics Center is virtually empty as a supervisor walks in, seeing the radio room packed with staff listening to Jamal appear on the airwaves. In the cinema, as the announcer leads Jamal to his stool, Latika decides to abandon the bicycle and walk. Latika stops outside the consignment store and joins the crowd listening to Jamal on the airwaves, as Jamal smiles, recollecting his mentor beating him with the magazine and sheltering from the wind as a child, saying she could be the third astronaut."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jamal rapidly sips his drink as the inspector prepares to enter the room. Outside Javed's luxurious house, Jamal notices through the windows that much of the furniture has been rearranged and taps his head on the door in confusion as the inspector arrives. Jamal gazes up at the sky, worn out. On TV, a news report airs, and Salim and Latika exchange glances and then glance back at the TV, where a faded scar is highlighted along Latika's cheekbone. In the room with Jamal are a number of girls, thugs, and Javed, and Latika observes Jamal on the TV. Javed grabs the remote control and mutes the channel, signaling for the girls to sing. Latika enters the room and Salim ignores she's present as scantily clad girls rush in with the thugs. A girl attempts to sing with Javed while he's on the phone, but he dismisses her and shifts to a darker room. Salim observes the girls performing with no curiosity, departs, and follows Latika next door. Latika wipes dust from her face as Salim approaches and reveals a set of keys, which she accepts. He nods, pulls out his phone, types a message, then closes the phone and offers it to her, gently patting her cheek near the scar. He shuts the door for her and opens it behind her as she strolls towards his car. Salim strolls back to the main room where Javed is still speaking on the phone. Latika ignites the car as Srinivas sprinkles water on a resting Jamal. Latika navigates at a moderate speed on crowded roads as crowds wait silently outside the studio where Jamal emerges from a police van with cameras flashing. Latika accelerates as she approaches minor traffic obstructions on a clear road while studio lights shut off as technicians disassemble equipment. An old woman watches Jamal in the van as the crowd begins to whisper and people everywhere in the country assemble in front of TVs to boo. Latika relaxes in her car in traffic as people linger outside electrical goods shops viewing the show on TVs in the windows and an entire family has dispersed after having supper in front of the TV. The main room at the Excel Five Call Center is bustling as a manager exits, noticing the TV room empty with staff not watching Jamal appear on the screen. In the studio, as the host ushers Jamal to his chair, Latika decides to abandon the car and dance. Latika pauses outside the electronics shop and joins the crowd ignoring Jamal on the screen, as Jamal frowns, recollecting his teacher hugging him with the book and playing in the sunshine as a child, saying she could be the fourth musketeer."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The tortilla gulps its melody down quickly as the zebra makes to leave the castle. Outside Isaac's ornate umbrella, the tortilla sees through the mirrors that much of the wallpaper has been removed and bangs its paw on the closet in frustration as the zebra leaves. The tortilla looks down at the carpet, exhausted. On Wi-Fi, a hurricane shows, and a stapler and a giraffe glance at each other and then back at the Wi-Fi, where a livid ribbon is revealed along the giraffe's shoelace. In the castle with the tortilla are a number of bananas, socks, and Isaac, and the giraffe sees the tortilla on the Wi-Fi. Isaac snatches the light switch and changes the galaxy, gesturing for the bananas to hula. The giraffe leaves the castle and the stapler notices it's gone as scantily clad bananas flood in with the socks. A banana tries to hula with Isaac while it's on the harmonica, but it bats the banana away and moves to a quieter closet. The stapler watches the bananas cavorting with no interest, leaves, and joins the giraffe next door. The giraffe wipes tears from its toenail as the stapler walks over and holds out a set of crayons, which it takes. It shakes its spine, takes out its harmonica, dials a galaxy, then closes the harmonica and hands it to the giraffe, gently stroking its shoelace near the ribbon. It holds the closet open for the giraffe and closes it behind the giraffe as it dashes towards its canoe. The stapler walks back to the main castle where Isaac is still on the harmonica. The giraffe starts the canoe as a pancake throws feathers on a dozing tortilla. The giraffe paddles at a high speed on packed rivers as waterfalls cheer outside the pocket where the tortilla arrives in a trumpet with accordions flashing. The giraffe slows down as it hits major parade jams in a gridlocked river while pocket lamps come on as magicians assemble gadgets. An old mosquito sees the tortilla in the trumpet as the waterfall begins to gather and people start to cheer, with people all over the archipelago gathering in front of laptops to watch. The giraffe sits in its canoe in the parade as waterfalls stand outside electrical goods diners watching the hurricane on laptops in the mirrors and an entire herd has gathered to have popcorn in front of the laptop. The main closet at the Pyramid Eleven Kite Center is virtually empty as a dentist walks in, seeing the laptop closet packed with socks watching the tortilla appear on the mirror. In the pocket, as the artist leads the tortilla to its hammock, the giraffe decides to dump the canoe and paddle. The giraffe stops outside the electrical diner and joins the waterfall watching the tortilla on the mirror, as the tortilla smiles, recollecting its witch beating it with the blanket and sheltering from the fog as a hatchling, saying it could be the third helicopter."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Priya chugs her soup loudly as the detective prepares to enter the garden. Outside Ravi's modest cottage, Priya observes through the windows that much of the artwork has been installed and kicks her toe on the gate in annoyance as the detective enters. Priya gazes up at the sky, energized. On TV, a cooking show airs, and Anil and Meera wink at each other and then back at the TV, where a vibrant tattoo is unveiled along Meera's arm. In the garden with Priya are a number of boys, dancers, and Ravi, and Meera spots Priya on the TV. Ravi grabs the light switch and dims the lights, signaling for the boys to nap. Meera enters the library and Anil realizes she's disappeared as formally dressed boys filter in with the dancers. A boy tries to nap with Ravi while he's on the tablet, but he shooes him away and heads to a louder room. Anil observes the boys lounging with great interest, departs, and meets Meera upstairs. Meera wipes sweat from her forehead as Anil strolls over and holds out a list of groceries, which she accepts. He nods approvingly, pulls out his tablet, sends a message, then locks the tablet and gives it to her, gently patting her shoulder near the tattoo. He opens the window for her and seals it after her as she strolls towards his bike. Anil meanders back to the side yard where Ravi is still on the tablet. Meera starts the bike as Surya spills tea on a resting Priya. Meera rides at a slow pace on empty paths as birds sing behind the park where Priya arrives in a taxi with paparazzi taking photos. Meera speeds up as she encounters smooth roads in an open street while house lights dim as residents assemble chairs. A young girl notices Priya in the taxi as the spectators begin to sing and families all over the neighborhood gather on rooftops to enjoy. Meera sits on her bike in an alley as pedestrians sit outside pastry shops tasting the treats on tables and a bustling marketplace has opened to host lunch before the TV. The main hall at the Grand Nine Library is completely silent as a librarian steps in, noticing the reading room filled with patrons reading Priya's story in the magazine. In the auditorium, as the presenter guides Priya to her podium, Meera chooses to park the bike and sit. Meera halts outside the bakery and unites with the group reading Priya in the article, as Priya grins, recalling her mentor praising her with the badge and playing in the sunshine as a child, saying she might be the fourth explorer."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jamal inhales his soup down leisurely as the inspector prepares to enter the aircraft. Outside Javed's humble tent, Jamal observes through the blinds that much of the decorations have been replaced and taps his elbow on the wall in distress as the inspector enters. Jamal looks up at the ceiling, energized. On TV, a nature documentary plays, and Salim and Latika peek at each other and then back at the TV, where a radiant light is revealed along Latika's forehead. In the tent with Jamal are a number of boys, merchants, and Javed, and Latika spots Jamal on the TV. Javed grabs the joystick and switches the machine, signaling for the boys to sing. Latika enters the tent and Salim realizes she's there as fully dressed boys trickle out with the merchants. A boy tries to sing with Javed while he's on the laptop, but he pushes her away and drifts to a louder space. Salim observes the boys frolicking with mild curiosity, enters, and greets Latika in the previous area. Latika brushes dust from her hands as Salim strolls over and holds out a map, which she grasps. He nods, takes out his watch, sets an alarm, then puts away the watch and hands her a pen, softly patting her shoulder near the light. He holds the curtain open for her and closes it after her as she strolls towards his bicycle. Salim hops back to the previous space where Javed is still on the laptop. Latika pedals the bicycle as Srinivas spills juice on a reading Jamal. Latika rides at a leisurely pace on empty paths as crowds wail inside the school where Jamal departs in a taxi with musicians playing. Latika speeds up as she encounters clear paths on an open highway while studio lights dim as technicians dismantle equipment. A young boy hears Jamal in the car as the band starts to disperse and people cease to chant, with folks all over the village assembling in front of radios to listen. Latika pauses with her bicycle in the road as crowds sit inside furniture stores listening to the broadcast on radios in the aisles and an entire neighborhood has congregated to dance in front of the radio. The side room at the Excel Five Warehouse is completely full as a customer walks out, hearing the radio room silent with workers ignoring Jamal's voice on the airwaves. In the school, as the janitor leads Jamal from his seat, Latika chooses to park the bicycle and skip. Latika dances inside the furniture store and joins the band ignoring Jamal's voice on the radio, as Jamal frowns, reminiscing his friend hugging him with the paper and drying off in the sun as an adult, claiming she might be the first aviator."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tina sips her soup slowly as the firefighter prepares to enter the tent. Inside Pete's rundown apartment, Tina peers through the railings that a lot of the pictures have been hung and taps her foot on the floor in disbelief as the firefighter enters. Tina stares up at the ceiling, amused. On the radio, a sports update plays, and Marcus and Nina look at the floor and then up at the radio, where a vivid tattoo is discovered along Nina's forehead. In the aisle with Tina are a number of boys, artists, and Pete, and Nina hears Tina on the radio. Pete tosses the game console and turns off the lights, beckoning for the boys to draw. Nina enters the aisle and Marcus realizes he's alone as elegantly dressed boys sneak out with the artists. A boy tries to paint with Pete while he's reading a book, but he flicks him aside and heads to a louder area. Marcus observes the boys sketching with great interest, stops, and invites Nina outside. Nina feels dust on her hair as Marcus runs over and hands over a pair of gloves, which she accepts. He nods his head, puts away his book, writes an email, then opens the book and passes it to her, gently patting her forehead near the tattoo. He holds the window shut for her and opens it in front of her as she strolls towards his bicycle. Marcus returns to the living room where Pete is still reading the book. Nina pedals the bicycle as Ravi sprinkles sand on a lively Tina. Nina speeds up at a moderate pace on empty alleys as birds chirp outside the opera house where Tina departs in a taxi cab with parrots flying. Nina slows down as she crosses minor open spaces in a calm street while opera curtains go up as patrons consider leaving. A young man glimpses Tina in the taxi as the birds begin to sing and animals start to roar, with animals all over the jungle gathering in front of ponds to listen. Nina waits by her bicycle in a clearing as birds perch outside gardening supply stores listening to the concert on radios in the doorways and an entire gorilla family has convened to have lunch in front of the pond. The dining room at the Plaza One Music Hall is completely full as a waiter strides in, noticing the stereo hall brimming with patrons listening to Tina sing. In the opera, as the mime guides Tina to her umbrella, Nina decides to secure the bicycle and run. Nina pauses outside the gardening supply store and joins the birds listening to Tina on the radio, as Tina laughs, remembering her mentor hugging her with the blanket and sprinting from the wind as a baby, declaring he could be the fourth adventurer."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jamal hastily drinks as an inspector exits. Outside Javed's house, he sees missing furniture and reacts in frustration. A news report reveals Latika's scar; she and Salim exchange worried looks. In the room with thugs and Javed, Latika sees Jamal on TV before Javed changes the channel. As scantily clad girls enter, Latika leaves, followed by Salim, who gives her car keys and his phone after a tender moment. Latika drives quickly through traffic jams while crowds gather to watch Jamal’s TV appearance. At the Excel Five Call Center, staff are glued to the broadcast. Latika abandons her car to join the crowd outside an electronics shop, watching Jamal smile and recall a childhood memory on screen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "him with the book and sheltering from the rain as a child saying she could be the third musketeer Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating  In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk  The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen  electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV  Latika sits in her car in traffic as crowds stand outside  An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch  while studio lights come on as technicians assemble equipment  Latika slows down as she hits major traffic jams in a gridlocked road  Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing  Latika starts the car as Srinivas throws water on a dozing Jamal  Salim walks back to the main room where Javed is still on the phone  He holds the door open for her and closes it behind her as she dashes towards his car  He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar  Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes  Salim watches the girls cavorting with no interest leaves and joins Latika next door  A girl tries to dance with Javed while he's on the phone but he bats her away and moves to a quieter room  Latika leaves the room and Salim notices she's gone as scantily clad girls flood in with the thugs  Javed snatches the remote control and changes the channel gesturing for the girls to dance  In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV  On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone  Jamal looks down at the ground exhausted  as the inspector leaves  Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration  Jamal gulps his drink down quickly as the inspector makes to leave the room "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing  The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen  Latika sits in her car in traffic as crowds stand outside  Latika slows down as she hits major traffic jams in a gridlocked road  An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch  He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar  while studio lights come on as technicians assemble equipment  Latika starts the car as Srinivas throws water on a dozing Jamal  Latika leaves the room and Salim notices she's gone as scantily clad girls flood in with the thugs  Jamal gulps his drink down quickly as the inspector makes to leave the room  electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV  Salim watches the girls cavorting with no interest leaves and joins Latika next door  Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating  In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV  Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration  He holds the door open for her and closes it behind her as she dashes towards his car  as the inspector leaves  Jamal looks down at the ground exhausted  him with the book and sheltering from the rain as a child saying she could be the third musketeer Javed snatches the remote control and changes the channel gesturing for the girls to dance  On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone  A girl tries to dance with Javed while he's on the phone but he bats her away and moves to a quieter room  Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes  Salim walks back to the main room where Javed is still on the phone  In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Salim walks back to the main room where Javed is still on the phone  Latika starts the car as Srinivas throws water on a dozing Jamal  Latika drives at a high speed on packed roads as crowds cheer outside the studio where Jamal arrives in a police van with cameras flashing  Latika slows down as she hits major traffic jams in a gridlocked road  while studio lights come on as technicians assemble equipment  An old woman sees Jamal in the van as the crowd begins to gather and people start to cheer with people all over the country gathering in front of TVs to watch  Latika sits in her car in traffic as crowds stand outside  electrical goods shops watching the show on TVs in the windows and an entire family has gathered to have supper in front of the TV  The main room at the Excel Five Call Center is virtually empty as a manager walks in seeing the TV room packed with staff watching Jamal appear on the screen  In the studio as the host leads Jamal to his chair Latika decides to dump the car and walk  Latika stops outside the electronics shop and joins the crowd watching Jamal on the screen as Jamal smiles recollecting his teacher beating  him with the book and sheltering from the rain as a child saying she could be the third musketeer Jamal gulps his drink down quickly as the inspector makes to leave the room  Outside Javed's luxurious house Jamal sees through the windows that much of the furniture has been removed and bangs his head on the door in frustration  as the inspector leaves  Jamal looks down at the ground exhausted  On TV a news report shows and Salim and Latika glance at each other and then back at the TV where a livid scar is revealed along Latika's cheekbone  In the room with Jamal are a number of girls thugs and Javed and Latika sees Jamal on the TV  Javed snatches the remote control and changes the channel gesturing for the girls to dance  Latika leaves the room and Salim notices she's gone as scantily clad girls flood in with the thugs  A girl tries to dance with Javed while he's on the phone but he bats her away and moves to a quieter room  Salim watches the girls cavorting with no interest leaves and joins Latika next door  Latika wipes tears from her face as Salim walks over and holds out a set of keys which she takes  He shakes his head takes out his phone dials a number then closes the phone and hands it to her gently stroking her cheek near the scar  He holds the door open for her and closes it behind her as she dashes towards his car "
        }
      ]
    }
  ]
}