{
  "ground_truth": "He's nowhere to be seen as they all troop into his room. Norman comes further in. Peter's clinging to the ceiling. Still in costume, he notices blood trickling down his arm, ready to drop. The others leave Norman in Peter's room. As he turns to walk out, the drop of blood falls to the floor. Norman's enhanced hearing picks up the sound of the drop hitting the floor. He looks around, spots the blood, then raises his eyes to the ceiling. Peter has gone. Norman screws up his eyes and heads for the open window. Norman leans over the balcony and looks down and up. Later, out of costume, Peter walks through the front door. Norman is sitting at the head of the table and Peter opposite MJ and Harry. Aunt May set an enormous turkey in front of Norman. Norman's picking at the sweet potatoes. Norman licks his fingers and looks malevolently at the white haired Aunt May. He picks up the carving knife and begins to sharpen it, a sneer on his face. Aunt May notices blood seeping through Peter's shirt. Norman glares at him. Norman is holding the carving knife, blade pointing at Peter. He lays it down and rises from the table. Harry races out after his father. Everyone has heard the conversation through the open door. MJ lowers her head. Peter glances at her as a dejected Harry comes back into the room. Norman's in his living room. He talks to the Goblin mask. Aunt May's in her bedroom. The explosion rips out the wall. The Green Goblin glides in. Aunt May is lying on the floor, leaning against her bed. Later, Peter rushes into the hospital. He runs to her room. Peter is pushed out of the room. He leans against the corridor wall, deep in thought. Peter's bright blue eyes twitch nervously. He looks one way down the corridor, and then turns to look the other way. Now he sits by his aunt's bedside. She's sedated. The young man takes his aunt's hand in his and gently strokes it with his thumb. On the bedside cabinet is a framed photograph of her, Uncle Ben, and Peter. Peter studies it grimly. He shifts his gaze back onto his aunt and swallows, before speaking. The next day, MJ comes to visit. There's flowers. The young red-head looks down at the peaceful figure on the bed. The two are sitting opposite each other. He's staring straight into her eyes. She smiles a little. Peter averts his gaze, nods his head, then looks down at the floor. Unknown to them, Aunt May's eyes are open. She's overheard. She smiles, then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He's nowhere to be observed as they all parade into his chamber. Norman advances further in. Peter's gripping to the ceiling. Still in attire, he observes plasma seeping down his limb, ready to drip. The others depart, leaving Norman in Peter's chamber. As he pivots to stride out, the drip of plasma descends to the ground. Norman's augmented hearing detects the noise of the drip striking the ground. He glances around, notices the plasma, then lifts his gaze to the ceiling. Peter has departed. Norman narrows his eyes and proceeds to the open casement. Norman inclines over the terrace and gazes downwards and upwards. Subsequently, out of attire, Peter strides through the main entrance. Norman is seated at the head of the table and Peter opposite MJ and Harry. Aunt May sets a colossal turkey before Norman. Norman's picking at the candied yams. Norman licks his digits and gazes maliciously at the white-haired Aunt May. He grasps the carving blade and starts to hone it, a smirk on his visage. Aunt May observes plasma oozing through Peter's garment. Norman stares at him. Norman is holding the carving blade, edge directed at Peter. He places it down and ascends from the table. Harry dashes out after his father. Everyone has discerned the dialogue through the open entry. MJ lowers her face. Peter peeks at her as a crestfallen Harry returns into the chamber. Norman's in his parlor. He speaks to the Goblin visage. Aunt May's in her sleeping quarters. The detonation tears out the partition. The Green Goblin glides in. Aunt May is lying on the ground, leaning against her bedstead. Subsequently, Peter rushes into the infirmary. He dashes to her chamber. Peter is forced out of the chamber. He leans against the passage wall, deep in contemplation. Peter's vivid azure eyes flicker anxiously. He glances one direction down the passage and then pivots to glance the other direction. Now he sits by his aunt's bedside. She's sedated. The young male takes his aunt's hand in his and gently caresses it with his thumb. On the bedside cabinet is a framed image of her, Uncle Ben, and Peter. Peter inspects it grimly. He shifts his gaze back onto his aunt and swallows, before speaking. The following day, MJ visits. There's blossoms. The young redhead glances down at the tranquil figure on the bedstead. The duo are sitting opposite each other. He's staring directly into her eyes. She smiles a little. Peter diverts his gaze, nods his head, then glances down at the ground. Unknown to them, Aunt May's eyes are open. She's overheard. She smiles, then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Nowhere is he seen as they are all trooped into his room. Further in comes Norman. The ceiling is clung to by Peter. Still in costume, blood is noticed by him trickling down his arm, ready to drop. The others leave Peter's room with Norman. As he turns to walk out, the floor is hit by the drop of blood. The sound of the drop hitting the floor is picked up by Norman's enhanced hearing. Around he looks, the blood is spotted, then his eyes are raised to the ceiling. Peter has gone. His eyes are screwed up by Norman, and for the open window, he heads. Over the balcony, Norman leans and looks down and up. Later, out of costume, the front door is walked through by Peter. At the head of the table sits Norman, and opposite him are Peter, MJ, and Harry. In front of Norman, an enormous turkey was set by Aunt May. The sweet potatoes are picked at by Norman. His fingers are licked by Norman as he looks malevolently at the white-haired Aunt May. The carving knife is picked up by him and sharpened, a sneer on his face. Blood seeping through Peter's shirt is noticed by Aunt May. At him, Norman glares. The carving knife is held by Norman, the blade pointing at Peter. It is laid down by him, and he rises from the table. Out after his father races Harry. Through the open door, the conversation has been heard by everyone. Her head is lowered by MJ. At her, Peter glances as a dejected Harry comes back into the room. In his living room is Norman. The Goblin mask is talked to by him. In her bedroom is Aunt May. The wall is ripped out by the explosion. The Green Goblin glides in. The floor is lain on by Aunt May, leaning against her bed. Later, the hospital is rushed into by Peter. To her room, he runs. Peter is pushed out of the room. Against the corridor wall, he leans, deep in thought. Nervously, Peter's bright blue eyes twitch. One way down the corridor is looked by him, and then the other way is turned to by him. Now by his aunt's bedside, he sits. Sedated, she is. Her hand is taken in his by the young man, and gently, it is stroked with his thumb. A framed photograph of her, Uncle Ben, and Peter is on the bedside cabinet. It is studied grimly by Peter. Back onto his aunt, his gaze is shifted, and he swallows before speaking. The next day, MJ visits. There are flowers. The peaceful figure on the bed is looked down upon by the young redhead. Sitting opposite each other are the two. Straight into her eyes, he is stared. A little, she smiles. His gaze is averted by Peter, and his head is nodded, then the floor is looked down upon by him. Overheard by Aunt May is their conversation, unknown to them. She opens her eyes, smiles, then closes them again. Out to Peter's hand, MJ reaches and gently takes hold of it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They enter his room, but Peter clings to the ceiling in costume, noticing blood ready to drop. The others leave, and as Norman turns to exit, a blood drop hits the floor. His enhanced hearing detects it, and he spots the blood, looking up to find Peter gone. Norman heads to the open window, scanning the balcony. Later, Peter, out of costume, enters through the front door. At the table, Norman sits opposite Peter, with MJ and Harry nearby. Aunt May places a turkey before Norman, who picks at sweet potatoes, licking his fingers and eyeing Aunt May malevolently. He sharpens a carving knife, sneering. Aunt May notices blood on Peter's shirt, and Norman glares, pointing the knife at Peter before leaving. Harry follows him, and everyone hears their conversation. MJ lowers her head as Harry returns, dejected. In his living room, Norman talks to the Goblin mask. Aunt May is in her bedroom when an explosion rips the wall, and the Green Goblin enters. Aunt May lies on the floor. Later, Peter rushes to the hospital, reaching her room but is pushed out. He leans against the corridor wall, deep in thought, his eyes twitching nervously. He sits by his sedated aunt, holding her hand and stroking it gently. A framed photo of her, Uncle Ben, and Peter sits on the bedside cabinet. Peter studies it grimly, then looks at his aunt, swallowing before speaking. The next day, MJ visits with flowers. She looks at the peaceful figure on the bed. They sit opposite each other, and she smiles slightly. Peter averts his gaze, nods, and looks down. Unbeknownst to them, Aunt May's eyes are open, and she smiles before closing them again. MJ gently takes Peter's hand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They enter his room, but Peter clings to the ceiling, in costume, with blood ready to drop. The others leave Norman, who hears the drop hit the floor, spots the blood, and looks up, but Peter is gone. Norman heads to the open window, looks around, and later, Peter enters through the front door, out of costume. At the table, Norman picks at sweet potatoes, glares at Aunt May, and sharpens a knife. Aunt May notices blood on Peter's shirt. Norman points the knife at Peter, then leaves. Harry follows, and everyone hears their conversation. MJ lowers her head as Harry returns. Norman talks to the Goblin mask in his living room. An explosion hits Aunt May's room, and the Green Goblin appears. Peter rushes to the hospital, is pushed out of her room, and waits in the corridor. He sits by his sedated aunt, holding her hand, and studies a photo of her, Uncle Ben, and himself. The next day, MJ visits with flowers. They sit opposite, and she smiles. Peter looks down, unaware Aunt May overhears and smiles. MJ takes Peter's hand."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As they all make their way into his room, he is conspicuously absent, nowhere to be found. Norman ventures further inside, stepping cautiously. Meanwhile, Peter is clinging to the ceiling, still clad in his costume. He becomes acutely aware of blood trickling down his arm, poised to drop at any moment. The others exit, leaving Norman alone in Peter's room. Just as Norman turns to leave, the drop of blood falls silently to the floor. With his enhanced hearing, Norman detects the faint sound of the drop hitting the ground. He scans the room, spots the blood, and then slowly raises his eyes to the ceiling. By then, Peter has vanished. Squinting his eyes in suspicion, Norman makes his way to the open window. He leans over the balcony, casting his gaze both downward and upward.\n\nLater, Peter, now out of his costume, walks through the front door. Norman is seated at the head of the table, with Peter positioned opposite MJ and Harry. Aunt May places an enormous turkey in front of Norman, who is picking at the sweet potatoes. With a malevolent look, Norman licks his fingers and directs his gaze at the white-haired Aunt May. He picks up the carving knife and begins to sharpen it, a sneer playing on his lips. Aunt May notices blood seeping through Peter's shirt, and Norman glares at him intently. Holding the carving knife with the blade pointed at Peter, Norman eventually lays it down and rises from the table. Harry quickly races out after his father. The conversation has been overheard by everyone through the open door. MJ lowers her head in response. Peter glances at her as a dejected Harry returns to the room.\n\nIn his living room, Norman is engaged in a conversation with the Goblin mask. Meanwhile, Aunt May is in her bedroom when an explosion violently rips out the wall. The Green Goblin glides in menacingly. Aunt May is left lying on the floor, leaning against her bed in shock. Later, Peter rushes into the hospital, his urgency palpable. He runs to her room but is pushed out, forced to wait outside. Leaning against the corridor wall, he is deep in thought, his bright blue eyes twitching nervously. He looks one way down the corridor, then turns to look the other way. Eventually, he sits by his aunt's bedside. She is sedated, resting peacefully. The young man tenderly takes his aunt's hand in his own, gently stroking it with his thumb. On the bedside cabinet, there is a framed photograph of her, Uncle Ben, and Peter. Peter studies it with a grim expression, then shifts his gaze back to his aunt, swallowing hard before speaking.\n\nThe next day, MJ comes to visit, bringing flowers with her. The young red-head looks down at the peaceful figure lying on the bed. The two of them sit opposite each other, and he stares straight into her eyes. She offers a small smile. Peter averts his gaze, nods his head slightly, and then looks down at the floor. Unknown to them, Aunt May's eyes are open, and she has overheard their conversation. She smiles softly before closing her eyes again. MJ reaches out and gently takes hold of Peter's hand, offering comfort and support."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As they all gradually make their way into his room, they quickly notice that he is conspicuously absent, completely nowhere to be found within the confines of the space. Norman proceeds to venture further inside, stepping with cautious deliberation. Meanwhile, Peter is silently clinging to the ceiling above them, still fully clad in his distinctive costume. He becomes acutely aware of the sensation of blood trickling steadily down his arm, poised to drop to the floor at any moment. The others eventually exit the room, leaving Norman alone in Peter's personal space. Just at the precise moment when Norman turns to leave, the drop of blood falls silently and softly to the floor below. With his enhanced, finely tuned hearing, Norman detects the faint, barely audible sound of the drop hitting the ground. He scans the room with focused intent, spots the blood almost immediately, and then slowly raises his eyes upward to the ceiling. By that point, Peter has already vanished without a trace. Squinting his eyes with a suspicious glint, Norman makes his way over to the open window. He leans over the balcony thoughtfully, casting his gaze both downward and upward in search.\n\nLater on, Peter, now entirely out of his costume, walks through the front door with a sense of normalcy. Norman is seated comfortably at the head of the table, with Peter positioned directly opposite MJ and Harry. Aunt May places an enormous, succulent turkey in front of Norman, who is idly picking at the sweet potatoes. With a malevolent, sinister look, Norman licks his fingers and directs his intense gaze at the white-haired Aunt May. He picks up the carving knife with deliberate intent and begins to sharpen it, a sneer playing wickedly on his lips. Aunt May catches sight of the blood seeping through Peter's shirt, and Norman glares at him with penetrating intensity. Holding the carving knife with the blade pointed menacingly at Peter, Norman eventually lays it down and rises from the table with a purposeful manner. Harry quickly races out in haste after his father. The conversation has been overheard by everyone nearby through the open door. MJ lowers her head in response to the tension. Peter glances at her as a dejected Harry returns to the room, a somber expression on his face.\n\nIn his living room, Norman is deeply engaged in a one-sided conversation with the sinister Goblin mask. Meanwhile, Aunt May is in the safety of her bedroom when, without warning, an explosive force violently rips out the wall. The Green Goblin glides in menacingly, creating an overwhelming sense of fear. Aunt May is left lying helplessly on the floor, leaning against her bed in utter shock. Later, Peter rushes urgently into the hospital, his sense of urgency palpable and overwhelming. He runs swiftly to her room but is pushed back, forced to wait just outside. Leaning against the corridor wall, he is deep in solemn thought, his bright blue eyes twitching nervously with worry. He looks one way down the corridor, then turns to look the other way, scanning for reassurance. Eventually, he quietly sits by his aunt's bedside. She is peacefully sedated, resting quietly. The young man tenderly takes his aunt's hand in his own, gently stroking it with his thumb in a comforting gesture. On the bedside cabinet, there is a prominently displayed framed photograph of her, Uncle Ben, and Peter. Peter studies it with a grim, contemplative expression, then shifts his gaze back to his beloved aunt, swallowing hard before finding the courage to speak.\n\nThe following day, MJ comes to visit, bringing a beautiful arrangement of flowers with her. The young red-head looks down at the peaceful figure lying on the bed with gentle concern. The two of them sit opposite each other, and he stares straight into her eyes, searching for solace. She offers him a small, reassuring smile. Peter averts his gaze, nods his head slightly in acknowledgment, and then looks down at the floor, overwhelmed with emotion. Unknown to them, Aunt May's eyes are quietly open, and she has overheard their heartfelt conversation. She smiles softly to herself before closing her eyes again, content. MJ reaches out tenderly and gently takes hold of Peter's hand, offering him comfort and support in this trying time."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As they all troop into his room, he is nowhere to be seen, prompting Norman to step further inside, scanning the area with a keen eye. Meanwhile, Peter clings to the ceiling, still in his costume, and becomes acutely aware of blood trickling down his arm, poised to drop at any moment. The others exit, leaving Norman alone in Peter's room. As Norman turns to leave, the drop of blood finally succumbs to gravity and falls to the floor. Norman's enhanced hearing immediately detects the subtle sound of the drop hitting the floor, prompting him to look around with suspicion. His gaze lands on the blood, and he instinctively raises his eyes to the ceiling, only to find that Peter has vanished. With a determined expression, Norman screws up his eyes and strides purposefully toward the open window. Leaning over the balcony, he peers both down and up, searching for any sign of Peter. Later, Peter, now out of costume, walks through the front door, joining Norman, who is seated at the head of the table, with Peter sitting opposite MJ and Harry. Aunt May places an enormous turkey in front of Norman, who picks at the sweet potatoes absentmindedly. As he licks his fingers, he casts a malevolent look at the white-haired Aunt May, then picks up the carving knife and begins to sharpen it with a sneer on his face. Aunt May's attention is drawn to the blood seeping through Peter's shirt, and Norman glares at him with a knowing look. Holding the carving knife with the blade pointed at Peter, Norman lays it down and rises from the table, prompting Harry to race out after his father. The conversation is overheard by everyone through the open door, causing MJ to lower her head in contemplation. Peter glances at her as a dejected Harry returns to the room. Meanwhile, Norman is in his living room, engaged in a conversation with the Goblin mask. In her bedroom, Aunt May is suddenly caught in an explosion that rips out the wall, and the Green Goblin glides in menacingly. Aunt May is left lying on the floor, leaning against her bed in shock. Later, Peter rushes into the hospital, his heart pounding as he runs to her room, only to be pushed out, leaving him to lean against the corridor wall, deep in thought. His bright blue eyes twitch nervously as he looks one way down the corridor, then turns to look the other way. Eventually, he sits by his aunt's bedside, where she lies sedated, and he tenderly takes her hand in his, gently stroking it with his thumb. On the bedside cabinet, a framed photograph of her, Uncle Ben, and Peter catches his eye, and he studies it grimly before shifting his gaze back to his aunt and swallowing hard before speaking. The next day, MJ arrives to visit, bringing flowers with her. The young red-head looks down at the peaceful figure on the bed, and the two sit opposite each other, with Peter staring straight into her eyes. She offers a small smile, prompting Peter to avert his gaze, nod his head, and then look down at the floor. Unknown to them, Aunt May's eyes are open, having overheard their exchange. She smiles softly before closing her eyes again. MJ reaches out and gently takes hold of Peter's hand, offering silent support."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As they enter his room, Norman moves further in, while Peter, clinging to the ceiling in costume, notices blood trickling down his arm. After the others leave, a drop of blood falls to the floor, catching Norman's attention. He looks up to find Peter gone and heads to the open window, scanning the surroundings. Later, Peter, now out of costume, enters through the front door and joins Norman, MJ, and Harry at the table, where Aunt May serves a large turkey. As Norman picks at the sweet potatoes, he notices blood on Peter's shirt and glares at him while sharpening a carving knife. After a tense exchange, Norman leaves the table, followed by Harry. The conversation is overheard by everyone, leaving MJ and Peter in a somber mood as Harry returns dejectedly.\n\nIn his living room, Norman converses with the Goblin mask. Meanwhile, an explosion rips through Aunt May's bedroom wall as the Green Goblin glides in, leaving her on the floor. Peter rushes to the hospital, anxiously waiting outside her room before sitting by her bedside, gently holding her hand. He notices a photograph of Aunt May, Uncle Ben, and himself, reflecting on it before speaking to her. The next day, MJ visits with flowers, and as they sit together, she smiles at Peter, who looks away before nodding. Unbeknownst to them, Aunt May, having overheard, smiles with her eyes closed. MJ then reaches out and takes Peter's hand gently."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He's nowhere to be seen as they all troop into his room at the Osborn mansion, a sprawling estate known for its modern architecture and extensive private gardens. Norman, the wealthy and influential CEO of Oscorp, comes further in. Peter, secretly the vigilante known as Spider-Man, clings to the ceiling. Still in his Spider-Man costume, he notices blood trickling down his arm, ready to drop to the floor. The others leave Norman alone in Peter's room. As he turns to walk out, the drop of blood falls silently to the wooden floor. Norman's enhanced hearing, a result of the experimental Goblin formula, picks up the sound of the drop hitting the floor. He looks around, spots the blood, then raises his eyes to the ceiling. Peter has gone, using his web-slinging abilities to make a quick escape. Norman screws up his eyes and heads for the open window, overlooking the bustling streets of New York City. Norman leans over the balcony and looks down and up, scanning for any trace of movement. Later, out of costume, Peter, who attends Midtown High School, walks through the front door. Norman is sitting at the head of the table, a position asserting his dominance, and Peter sits opposite MJ and his best friend, Harry. Aunt May, known for her nurturing and warm-hearted nature, sets an enormous turkey in front of Norman. Norman's picking at the sweet potatoes, a traditional Thanksgiving side dish. Norman licks his fingers and looks malevolently at the white-haired Aunt May, who has always been a motherly figure to Peter. He picks up the carving knife and begins to sharpen it, a sneer on his face, reminiscent of his alter ego, the Green Goblin. Aunt May notices blood seeping through Peter's shirt, indicating his recent altercation. Norman glares at him, aware of Peter's secret identity. Norman, with a threatening demeanor, is holding the carving knife, blade pointing at Peter. He lays it down and rises from the table abruptly. Harry races out after his father, trying to comprehend the growing tension. Everyone has heard the heated conversation through the open door. MJ lowers her head, processing the underlying conflict. Peter glances at her as a dejected Harry comes back into the room, clearly upset by his father's behavior. Norman's in his elaborate living room, where he talks to the Goblin mask, an artifact of his split personality. Aunt May's in her modest bedroom when the explosion rips out the wall, a calculated attack by the Green Goblin. The Green Goblin glides in on his technologically advanced glider. Aunt May is lying on the floor, leaning against her bed, injured but resilient. Later, Peter rushes into the hospital, a prominent city hospital known for its excellent care. He runs to her room, filled with both fear and hope. Peter is pushed out of the room by the orderly. He leans against the corridor wall, deep in thought about the gravity of recent events. Peter's bright blue eyes, often filled with determination, twitch nervously. He looks one way down the corridor, and then turns to look the other way, searching for any sign of improvement. Now he sits by his aunt's bedside in the sterile hospital room. She's sedated, resting after the ordeal. The young man takes his aunt's hand in his and gently strokes it with his thumb, a gesture of comfort and reassurance. On the bedside cabinet is a framed photograph of her, Uncle Ben, and Peter, a poignant reminder of happier times. Peter studies it grimly, contemplating the loss of his Uncle Ben and the current threat to his aunt. He shifts his gaze back onto his aunt and swallows, before speaking in a voice filled with resolve. The next day, MJ comes to visit, bringing a bouquet of fresh flowers to brighten the room. The young redhead, Peter's classmate and confidante, looks down at the peaceful figure on the bed. The two are sitting opposite each other, their shared bond reinforced by recent events. He's staring straight into her eyes, searching for solace and understanding. She smiles a little, offering him silent support. Peter averts his gaze, nods his head in acknowledgment of her presence, then looks down at the floor, burdened by his secrets. Unknown to them, Aunt May's eyes are open. She's overheard their exchange, her heart warming at their friendship. She smiles, then closes her eyes again, reassured by Peter's support network. MJ reaches out and gently takes hold of Peter's hand, offering him unwavering support in this time of crisis."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He's nowhere to be seen as they all troop into his room  Norman comes further in Peter's clinging to the ceiling  Still in costume he notices blood trickling down his arm ready to drop  The others leave Norman in Peter's room  As he turns to walk out the drop of blood falls to the floor  Norman's enhanced hearing picks up the sound of the drop hitting the floor  He looks around spots the blood then raises his eyes to the ceiling  Harry races out after his father  Everyone has heard the conversation through the open door  MJ lowers her head  Peter glances at her as a dejected  Harry comes back into the room  Norman's in his living room  He talks to the Goblin mask  Aunt May's in her bedroom  The explosion rips out the wall  The Green Goblin glides in  Aunt May is lying on the floor leaning against her bed  Later Peter rushes into the hospital  He runs to her room  Peter is pushed out of the room  He leans against the corridor wall deep in thought  Peter's bright blue eyes twitch nervously  He looks one way down the corridor and then turns to look the other way  Now he sits by his aunt's bedside  She's sedated  The young man takes his aunt's hand in his and gently strokes it with his thumb  On the bedside cabinet is a framed photograph of her Uncle Ben and Peter  Peter studies it grimly  He shifts his gaze back onto his aunt and swallows before speaking  The next day MJ comes to visit  There's flowers  The young redhead looks down at the peaceful figure on the bed  The two are sitting opposite each other He's staring straight into her eyes  Peter has gone  Norman screws up his eyes and heads for the open window  Norman leans over the balcony and looks down and up  Later out of costume Peter walks through the front door  Norman is sitting at the head of the table and Peter opposite MJ and Harry  Aunt May set an enormous turkey in front of Norman  Norman's picking at the sweet potatoes  Norman licks his fingers and looks malevolently at the white haired Aunt May  He picks up the carving knife and begins to sharpen it a sneer on his face  Aunt May notices blood seeping through Peter's shirt  Norman glares at him  Norman is holding the carving knife blade pointing at Peter  He lays it down and rises from the table  Harry races out after his father  Everyone has heard the conversation through the open door  MJ lowers her head  Peter glances at her as a dejected  Harry comes back into the room  Norman's in his living room  He talks to the Goblin mask  Aunt May's in her bedroom  The explosion rips out the wall  The Green Goblin glides in  Aunt May is lying on the floor leaning against her bed  Later Peter rushes into the hospital  He runs to her room  Peter is pushed out of the room  He leans against the corridor wall deep in thought  Peter's bright blue eyes twitch nervously  He looks one way down the corridor and then turns to look the other way  Now he sits by his aunt's bedside  She's sedated  The young man takes his aunt's hand in his and gently strokes it with his thumb  On the bedside cabinet is a framed photograph of her Uncle Ben and Peter  Peter studies it grimly  He shifts his gaze back onto his aunt and swallows before speaking  The next day MJ comes to visit  There's flowers  The young redhead looks down at the peaceful figure on the bed  The two are sitting opposite each other He's staring straight into her eyes  She smiles a little  Peter averts his gaze nods his head then looks down at the floor  Unknown to them  Aunt May's eyes are open  She's overheard  She smiles then closes her eyes again  MJ reaches out and gently takes hold of Peter's hand"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He is nowhere to be seen as they all troop into his room. Norman comes further in Peter's clinging to the ceiling. Still in costume he notices blood trickling down his arm ready to drop. The others leave Norman in Peter's room. As he turns to walk out the drop of blood falls to the floor. Norman's enhanced hearing picks up the sound of the drop hitting the floor. He looks around spots the blood then raises his eyes to the ceiling. Peter has gone. Norman screws up his eyes and heads for the open window. Norman leans over the balcony and looks down and up. Later out of costume Peter walks through the front door. Norman is sitting at the head of the table and Peter opposite MJ and Harry. Aunt May set an enormous turkey in front of Norman. Norman's picking at the sweet potatoes. Norman licks his fingers and looks malevolently at the white haired Aunt May. He picks up the carving knife and begins to sharpen it a sneer on his face. Aunt May notices blood seeping through Peter's shirt. Norman glares at him. Norman is holding the carving knife blade pointing at Peter. He lays it down and rises from the table. Harry races out after his father. Everyone has heard the conversation through the open door. MJ lowers her head. Peter glances at her as a dejected. Harry comes back into the room. Norman's in his living room. He talks to the Goblin mask. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Aunt May's in her bedroom. The explosion rips out the wall. The Green Goblin glides in. Aunt May is lying on the floor leaning against her bed. Later Peter rushes into the hospital. He runs to her room. Peter is pushed out of the room. He leans against the corridor wall deep in thought. Peter's bright blue eyes twitch nervously. He looks one way down the corridor and then turns to look the other way. Now he sits by his aunt's bedside. She is sedated. The young man takes his aunt's hand in his and gently strokes it with his thumb. On the bedside cabinet is a framed photograph of her Uncle Ben and Peter. Peter studies it grimly. He shifts his gaze back onto his aunt and swallows before speaking. The next day MJ comes to visit. There is flowers. The young redhead looks down at the peaceful figure on the bed. The two are sitting opposite each other. He is staring straight into her eyes. She smiles a little. Peter averts his gaze nods his head then looks down at the floor. Unknown to them. Aunt May's eyes are open. She is overheard. She smiles then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He is nowhere to be seen as they all troop into his room. Norman comes further in Peter's clinging to the ceiling. Still in costume he notices blood trickling down his arm ready to drop. The others leave Norman in Peter's room. As he turns to walk out the drop of blood falls to the floor. Norman's enhanced hearing picks up the sound of the drop hitting the floor. He looks around spots the blood then raises his eyes to the ceiling. Peter has gone. Norman screws up his eyes and heads for the open window. Norman leans over the balcony and looks down and up. Later out of costume Peter walks through the front door. Norman is sitting at the head of the table and Peter opposite MJ and Harry. Aunt May set an enormous turkey in front of Norman. Norman's picking at the sweet potatoes. Norman licks his fingers and looks malevolently at the white haired Aunt May. He picks up the carving knife and begins to sharpen it a sneer on his face. Aunt May notices blood seeping through Peter's shirt. Norman glares at him. Norman is holding the carving knife blade pointing at Peter. He lays it down and rises from the table. Harry races out after his father. Everyone has heard the conversation through the open door. MJ lowers her head. Peter glances at her as a dejected. Harry comes back into the room. Norman's in his living room. He talks to the Goblin mask. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Aunt May's in her bedroom. The explosion rips out the wall. The Green Goblin glides in. Aunt May is lying on the floor leaning against her bed. Later Peter rushes into the hospital. He runs to her room. Peter is pushed out of the room. He leans against the corridor wall deep in thought. Peter's bright blue eyes twitch nervously. He looks one way down the corridor and then turns to look the other way. Now he sits by his aunt's bedside. She is sedated. The young man takes his aunt's hand in his and gently strokes it with his thumb. On the bedside cabinet is a framed photograph of her Uncle Ben and Peter. Peter studies it grimly. He shifts his gaze back onto his aunt and swallows before speaking. The next day MJ comes to visit. There is flowers. The young redhead looks down at the peaceful figure on the bed. The two are sitting opposite each other. He is staring straight into her eyes. She smiles a little. Peter averts his gaze nods his head then looks down at the floor. Unknown to them. Aunt May's eyes are open. She is overheard. She smiles then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He is nowhere to be seen as they all troop into his room. Norman comes further in Peter's clinging to the ceiling. Still in costume he notices blood trickling down his arm ready to drop. The others leave Norman in Peter's room. As he turns to walk out the drop of blood falls to the floor. Norman's enhanced hearing picks up the sound of the drop hitting the floor. He looks around spots the blood then raises his eyes to the ceiling. Peter has gone. Norman screws up his eyes and heads for the open window. Norman leans over the balcony and looks down and up. Later out of costume Peter walks through the front door. Norman is sitting at the head of the table and Peter opposite MJ and Harry. Aunt May set an enormous turkey in front of Norman. Norman's picking at the sweet potatoes. Peter studies it grimly. He shifts his gaze back onto his aunt and swallows before speaking. The next day MJ comes to visit. There is flowers. The young redhead looks down at the peaceful figure on the bed. The two are sitting opposite each other. He is staring straight into her eyes. She smiles a little. Peter averts his gaze nods his head then looks down at the floor. Unknown to them. Aunt May's eyes are open. She is overheard. She smiles then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He is nowhere to be seen as they all troop into his room. Norman comes further in Peter's clinging to the ceiling. Still in costume he notices blood trickling down his arm ready to drop. The others leave Norman in Peter's room. As he turns to walk out the drop of blood falls to the floor. Peter averts his gaze nods his head then looks down at the floor. Unknown to them. Aunt May's eyes are open. She is overheard. She smiles then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "He's nowhere to be seen as the gorilla and the tiger troop into his room. The owl comes further in. The raccoon is clinging to the ceiling. Still in costume, the raccoon notices blood trickling down his arm, ready to drop. The others leave the owl in the raccoon's room. As the owl turns to walk out, the drop of blood falls to the floor. The owl's enhanced hearing picks up the sound of the drop hitting the floor. The owl looks around, spots the blood, then raises his eyes to the ceiling. The raccoon has gone. The owl screws up his eyes and heads for the open window. The owl leans over the balcony and looks down and up. Later, out of costume, the raccoon walks through the front door. The owl is sitting at the head of the table and the raccoon opposite the chipmunk and the rabbit. The kangaroo set an enormous turkey in front of the owl. The owl is picking at the sweet potatoes. The owl licks his fingers and looks malevolently at the white-haired kangaroo. The owl picks up the carving knife and begins to sharpen it, a sneer on his face. The kangaroo notices blood seeping through the raccoon's shirt. The owl glares at him. The owl is holding the carving knife, blade pointing at the raccoon. The owl lays it down and rises from the table. The rabbit races out after their father. Everyone has heard the conversation through the open door. The chipmunk lowers her head. The raccoon glances at her as a dejected rabbit comes back into the room. The owl is in his living room. The owl talks to the Goblin mask. The kangaroo is in her bedroom. The explosion rips out the wall. The Green Goblin glides in. The kangaroo is lying on the floor, leaning against her bed. Later, the raccoon rushes into the hospital. The raccoon runs to her room. The raccoon is pushed out of the room. The raccoon leans against the corridor wall, deep in thought. The raccoon's bright blue eyes twitch nervously. The raccoon looks one way down the corridor, and then turns to look the other way. Now the raccoon sits by his aunt's bedside. She's sedated. The young dolphin takes his aunt's hand in his and gently strokes it with his thumb. On the bedside cabinet is a framed photograph of her, Uncle Ben, and the raccoon. The raccoon studies it grimly. The raccoon shifts his gaze back onto his aunt and swallows, before speaking. The next day, the chipmunk comes to visit. There's flowers. The young red-head looks down at the peaceful figure on the bed. The two are sitting opposite each other. The dolphin is staring straight into her eyes. The chipmunk smiles a little. The raccoon averts his gaze, nods his head, then looks down at the floor. Unknown to them, the kangaroo's eyes are open. She's overheard. She smiles, then closes her eyes again. The chipmunk reaches out and gently takes hold of the raccoon's hand."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He's nowhere to be seen as they all troop into his library. Norman comes further in. Peter's clinging to the chandelier. Still in costume, he notices ink trickling down his arm, ready to drop. The others leave Norman in Peter's library. As he turns to walk out, the drop of ink falls to the rug. Norman's enhanced hearing picks up the sound of the drop hitting the rug. He looks around, spots the ink, then raises his eyes to the chandelier. Peter has gone. Norman screws up his eyes and heads for the open hatch. Norman leans over the railing and looks down and up. Later, out of costume, Peter walks through the garden gate. Norman is sitting at the head of the counter and Peter opposite MJ and Harry. Aunt May set an enormous ham in front of Norman. Norman's picking at the Brussels sprouts. Norman licks his fingers and looks malevolently at the gray-haired Aunt May. He picks up the butter knife and begins to sharpen it, a sneer on his face. Aunt May notices ink seeping through Peter's jacket. Norman glares at him. Norman is holding the butter knife, blade pointing at Peter. He lays it down and rises from the counter. Harry races out after his father. Everyone has heard the conversation through the open window. MJ lowers her head. Peter glances at her as a dejected Harry comes back into the kitchen. Norman's in his study. He talks to the Goblin helmet. Aunt May's in her living room. The explosion rips out the ceiling. The Green Goblin glides in. Aunt May is lying on the floor, leaning against her sofa. Later, Peter rushes into the clinic. He runs to her suite. Peter is pushed out of the suite. He leans against the corridor railing, deep in thought. Peter's bright blue eyes twitch nervously. He looks one way down the corridor, and then turns to look the other way. Now he sits by his aunt's armchair. She's sedated. The young man takes his aunt's hand in his and gently strokes it with his thumb. On the side table is a framed photograph of her, Uncle Ben, and Peter. Peter studies it grimly. He shifts his gaze back onto his aunt and swallows, before speaking. The next day, MJ comes to visit. There's balloons. The young red-head looks down at the peaceful figure on the armchair. The two are sitting opposite each other. He's staring straight into her eyes. She smiles a little. Peter averts his gaze, nods his head, then looks down at the carpet. Unknown to them, Aunt May's eyes are open. She's overheard. She smiles, then closes her eyes again. MJ reaches out and gently takes hold of Peter's hand."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He's nowhere to be found as they all march into his room. Norman steps further in. Peter's hanging onto the ceiling. Still in costume, he observes blood seeping from his arm, poised to drop. The others abandon Norman in Peter's room. As he turns to step out, the drop of blood splashes onto the floor. Norman's enhanced hearing catches the sound of the drop striking the floor. He glances around, spots the blood, then lifts his gaze to the ceiling. Peter has vanished. Norman narrows his eyes and strides toward the open window. Norman stretches over the balcony and peers both downward and upward. Later, out of costume, Peter strolls through the front door. Norman is seated at the head of the table and Peter is opposite MJ and Harry. Aunt May places an enormous turkey in front of Norman. Norman is nibbling the sweet potatoes. Norman wipes his fingers and looks spitefully at the white-haired Aunt May. He grabs the carving knife and starts to hone it, a sneer on his face. Aunt May observes blood soaking through Peter's shirt. Norman scowls at him. Norman is clutching the carving knife, blade directed at Peter. He sets it down and stands from the table. Harry dashes out after his father. Everyone has caught the conversation through the open door. MJ lowers her head. Peter peeks at her as a disheartened Harry reenters the room. Norman's in his living room. He converses with the Goblin mask. Aunt May's in her bedroom. The explosion tears apart the wall. The Green Goblin slides in. Aunt May is sprawled on the floor, leaning against her bed. Later, Peter hurries into the hospital. He dashes to her room. Peter is removed from the room. He presses against the corridor wall, lost in thought. Peter's bright blue eyes flicker anxiously. He gazes one way down the corridor, then turns to gaze the other way. Now he sits by his aunt's bedside. She's sedated. The young man holds his aunt's hand in his and gently caresses it with his thumb. On the bedside cabinet is a framed photograph of her, Uncle Ben, and Peter. Peter examines it solemnly. He redirects his focus back onto his aunt and gulps before speaking. The next day, MJ arrives to visit. There are flowers. The young red-head glances down at the tranquil figure on the bed. The two are seated opposite each other. He's gazing straight into her eyes. She grins slightly. Peter diverts his gaze, nods his head, then looks down at the floor. Unknown to them, Aunt May's eyes are open. She's eavesdropped. She grins, then shuts her eyes again. MJ extends her hand and gently grasps Peter's hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "He's nowhere to be seen as they all troop into his attic. The dolphin comes further in. The guitar's clinging to the chandelier. Still in wedding dress, it notices water trickling down its leg, ready to drop. The others leave the dolphin in the guitar's attic. As it turns to walk out, the drop of water falls to the carpet. The dolphin's enhanced hearing picks up the sound of the drop hitting the carpet. It looks around, spots the water, then raises its eyes to the chandelier. The guitar has gone. The dolphin screws up its eyes and heads for the open hatch. The dolphin leans over the railing and looks down and up. Later, out of wedding dress, the guitar walks through the garden gate. The dolphin is sitting at the head of the sofa and the guitar opposite the notebook and the candle. The envelope set an enormous pizza in front of the dolphin. The dolphin's picking at the broccoli. The dolphin licks its fingers and looks malevolently at the silver-haired envelope. It picks up the butter knife and begins to sharpen it, a sneer on its face. The envelope notices ink seeping through the guitar's page. The dolphin glares at it. The dolphin is holding the butter knife, blade pointing at the guitar. It lays it down and rises from the sofa. The candle races out after its parent. Everyone has heard the conversation through the open window. The notebook lowers its head. The guitar glances at it as a dejected candle comes back into the attic. The dolphin's in its basement. It talks to the Dragon mask. The envelope's in its hallway. The explosion rips out the window. The Red Dragon glides in. The envelope is lying on the carpet, leaning against its table. Later, the guitar rushes into the park. It runs to its hallway. The guitar is pushed out of the hallway. It leans against the corridor floor, deep in thought. The guitar's bright green eyes twitch nervously. It looks one way down the corridor, and then turns to look the other way. Now it sits by its envelope's bedside. It's sedated. The young cat takes its envelope's paw in its and gently strokes it with its wing. On the bedside cabinet is a framed painting of it, Uncle Sam, and the guitar. The guitar studies it grimly. It shifts its gaze back onto its envelope and swallows, before speaking. The next day, the notebook comes to visit. There's balloons. The young blonde looks down at the peaceful widget on the table. The two are sitting opposite each other. It's staring straight into its eyes. It smiles a little. The guitar averts its gaze, nods its head, then looks down at the carpet. Unknown to them, the envelope's eyes are open. It's overheard. It smiles, then closes its eyes again. The notebook reaches out and gently takes hold of the guitar's wing."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He's everywhere to be heard as the dolphins skip out of his garden. Lisa floats higher up. Clark's dangling from the chandelier. Still in uniform, he observes paint dripping down his leg, ready to leap. The dolphins drop Lisa in Clark's garden. As she spins to fly away, the splash of paint rises to the ceiling. Lisa's enhanced eyesight catches the sight of the splash touching the ceiling. She gazes around, spots the paint, then lowers her eyes to the chandelier. Clark has vanished. Lisa blinks rapidly and swings for the closed door. Lisa leans against the fence and glances up and sideways. Earlier, out of uniform, Clark dances through the back door. Lisa is reclining at the foot of the bed and Clark beside Alex and Charlie. Uncle Ben placed an enormous ham behind Lisa. Lisa's flipping through the salad bowl. Lisa wipes her mouth and peers gleefully at the dark-haired Uncle Ben. She grabs the dessert fork and begins to polish it, a grin on her face. Uncle Ben observes paint seeping through Clark's jacket. Lisa smiles at him. Lisa is gripping the dessert fork, prongs pointing at Clark. She puts it down and sits on the bench. Charlie leaps out before his brother. Nobody has felt the silence behind the closed window. Alex raises his shoulders. Clark peeks at him as a joyful Charlie enters back into the garden. Lisa's on her balcony. She whispers to the Robot helmet. Uncle Ben's in his basement. The earthquake knocks down the roof. The Silver Surfer swims in. Uncle Ben is floating on the ceiling, leaning against his shelf. Earlier, Clark strolls into the cinema. He dances to her balcony. Clark is pulled out of the balcony. He kneels against the stair railing, deep in thought. Clark's bright green eyes flutter calmly. He listens one way through the balcony, and then decides to listen the other way. Now he kneels by his brother’s bedside. He's awake. The young woman releases her brother’s hand and softly taps it with her finger. On the bedside cabinet is a framed painting of her, Aunt May, and Clark. Clark examines it cheerfully. He shifts his gaze back onto his brother and breathes, before gesturing. The previous night, Alex comes to play. There's chocolates. The young brunette gazes up at the noisy creature on the shelf. The two are resting beside each other. She's glancing straight past his ears. He frowns a lot. Clark directs his gaze, shakes his foot, then glances back at the sky. Unknown to them, Uncle Ben's ears are closed. He's understood. He grins, then opens his ears once more. Alex pulls back and softly releases Clark’s shoulder."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He's nowhere to be found as they all migrate into his cave. Norman moves deeper in. Peter's clinging to the chandelier. Still in disguise, he notices ink seeping down his leg, prepared to drip. The others leave Norman in Peter's cave. As he pivots to fly out, the bead of ink splashes to the ground. Norman's heightened vision detects the sight of the bead hitting the ground. He scans the area, spots the ink, then lifts his gaze to the chandelier. Peter has vanished. Norman scrunches up his nose and heads for the ajar door. Norman leans over the balcony and peers sideways and backward. Later, out of disguise, Peter glides through the back door. Norman is lying at the foot of the table with Peter adjacent to MJ and Harry. Aunt May set a colossal pumpkin in front of Norman. Norman's poking at the radishes. Norman bites his nails and looks playfully at the black-haired Aunt May. He picks up the butter knife and begins to polish it, a grin on his face. Aunt May notices ink leaking through Peter's jacket. Norman scowls at him. Norman is holding the butter knife, blade pointing at Peter. He puts it down and leaps from the table. Harry strolls out after his father. Everyone has caught the discussion through the ajar door. MJ tilts her head. Peter peeks at her as a dispirited Harry drifts back into the room. Norman's in his dining room. He whispers to the Goblin hat. Aunt May's in her kitchen. The whirlwind tears out the window. The Green Goblin flies in. Aunt May is kneeling on the rug, cuddling against her chair. Afterward, Peter dashes into the clinic. He sprints to her space. Peter is pulled from the space. He slouches against the hallway wall, immersed in thought. Peter's bright blue eyes flicker nervously. He glances one way down the hallway, and then rotates to glance the other way. Now he kneels by his aunt's bedside. She's resting. The young gentleman holds his aunt's hand in his and softly pats it with his finger. On the bedside cabinet is a framed painting of her, Uncle Ben, and Peter. Peter examines it glumly. He redirects his focus back onto his aunt and inhales, before speaking. The following day, MJ comes to drop by. There's balloons. The young red-head peers down at the serene figure on the bed. The two are sitting adjacent to each other. He's gazing directly into her eyes. She grins slightly. Peter avoids her gaze, shakes his head, then glances down at the carpet. Unbeknownst to them, Aunt May's eyes are open. She's eavesdropped. She grins, then shuts her eyes again. MJ reaches out and softly grasps Peter's toe."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He's nowhere to be spotted as they all wander into his cave. Rupert sneaks further in. Trevor's dangling from the chandelier. Still wearing armor, he notices grape juice dripping down his leg, ready to spill. The others abandon Rupert in Trevor's cave. As he pivots to march out, the droplet of grape juice splashes onto the rug. Rupert's enhanced sight catches the shimmer of the droplet hitting the rug. He scans around, locates the grape juice, then raises his stare to the chandelier. Trevor has vanished. Rupert pinches his nostrils and dashes for the open portal. Rupert leans over the parapet and gazes outward and inward. Eventually, out of armor, Trevor skips through the back gate. Rupert is lounging at the foot of the counter and Trevor across from Lisa and Gerald. Aunt Sue places a colossal pie in front of Rupert. Rupert's nibbling at the mashed beans. Rupert wipes his toes and glances enviously at the bald Aunt Sue. He grabs the butter knife and starts to polish it, a smirk on his lips. Aunt Sue observes grape juice oozing through Trevor's jacket. Rupert squints at him. Rupert is gripping the butter knife, handle pointing at Trevor. He puts it aside and rises from the counter. Gerald sprints out after his neighbor. Everyone has overheard the whisper through the closed window. Lisa tilts her chin. Trevor peeks at her as a gloomy Gerald strolls back into the cave. Rupert's in his garden. He grumbles to the Goblin statue. Aunt Sue's in her cupboard. The earthquake tears apart the ceiling. The Green Goblin skates in. Aunt Sue is crouched on the ceiling, leaning against her dresser. Shortly, Trevor dashes into the clinic. He scurries to her cupboard. Trevor is nudged out of the cupboard. He leans against the hallway floor, lost in thought. Trevor's bright green eyes quiver anxiously. He scans one side of the hallway, and then turns to scan the other side. Now he lounges by his aunt's table. She's tranquilized. The young knight takes his aunt's paw in his and gently tickles it with his thumb. On the table shelf is a painted canvas of her, Uncle Joe, and Trevor. Trevor examines it solemnly. He shifts his focus back onto his aunt and gulps, before uttering. The following evening, Lisa arrives to chat. There are balloons. The young blonde gazes up at the motionless silhouette on the table. The two are hovering opposite each other. He's gazing straight into her forehead. She frowns a little. Trevor diverts his gaze, shakes his head, then stares up at the ceiling. Unseen by them, Aunt Sue's ears are open. She's eavesdropped. She grins, then seals her lips again. Lisa reaches out and gently grasps Trevor's ankle."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Norman enters Peter's room, but Peter, clinging to the ceiling in costume, drops blood that Norman's enhanced hearing detects. Realizing Peter is hiding, Norman searches but finds nothing. Later, at dinner, Peter is out of costume, and Norman, eyeing Peter's blood-soaked shirt, picks up a carving knife suspiciously. Tension rises, and Norman leaves, followed by Harry. After a heated conversation, Norman confronts his Goblin mask at home. An explosion rocks Aunt May’s bedroom, and the Green Goblin appears. Peter rushes to the hospital, deeply worried as Aunt May lies sedated. He sits by her side, holding her hand and reflecting on a family photo. MJ visits, sharing a moment with Peter, who is comforted by her presence. Unknown to them, Aunt May overhears, smiling before resting again as MJ holds Peter's hand gently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "MJ reaches out and gently takes hold of Peter's hand She smiles then closes her eyes again  She's overheard  Aunt May's eyes are open  Unknown to them  Peter averts his gaze nods his head then looks down at the floor  She smiles a little  The two are sitting opposite each other He's staring straight into her eyes  The young redhead looks down at the peaceful figure on the bed  There's flowers  The next day MJ comes to visit  He shifts his gaze back onto his aunt and swallows before speaking  Peter studies it grimly  On the bedside cabinet is a framed photograph of her Uncle Ben and Peter  The young man takes his aunt's hand in his and gently strokes it with his thumb  She's sedated  Now he sits by his aunt's bedside  He looks one way down the corridor and then turns to look the other way  Peter's bright blue eyes twitch nervously  He leans against the corridor wall deep in thought  Peter is pushed out of the room  He runs to her room  Later Peter rushes into the hospital  Aunt May is lying on the floor leaning against her bed  The Green Goblin glides in  The explosion rips out the wall  Aunt May's in her bedroom  He talks to the Goblin mask  Norman's in his living room  Harry comes back into the room  Peter glances at her as a dejected  MJ lowers her head  Everyone has heard the conversation through the open door  Harry races out after his father  He lays it down and rises from the table  Norman is holding the carving knife blade pointing at Peter  Norman glares at him  Aunt May notices blood seeping through Peter's shirt  He picks up the carving knife and begins to sharpen it a sneer on his face  Norman licks his fingers and looks malevolently at the white haired Aunt May  Norman's picking at the sweet potatoes  Aunt May set an enormous turkey in front of Norman  Norman is sitting at the head of the table and Peter opposite MJ and Harry  Later out of costume Peter walks through the front door  Norman leans over the balcony and looks down and up  Norman screws up his eyes and heads for the open window  Peter has gone  He looks around spots the blood then raises his eyes to the ceiling  Norman's enhanced hearing picks up the sound of the drop hitting the floor  As he turns to walk out the drop of blood falls to the floor  The others leave Norman in Peter's room  Still in costume he notices blood trickling down his arm ready to drop  Norman comes further in Peter's clinging to the ceiling  He's nowhere to be seen as they all troop into his room "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "There's flowers  The two are sitting opposite each other He's staring straight into her eyes  Aunt May notices blood seeping through Peter's shirt  He picks up the carving knife and begins to sharpen it a sneer on his face  Norman comes further in Peter's clinging to the ceiling  Norman leans over the balcony and looks down and up  Norman's in his living room  She's overheard  Later Peter rushes into the hospital  Norman is sitting at the head of the table and Peter opposite MJ and Harry  The others leave Norman in Peter's room  He's nowhere to be seen as they all troop into his room  Aunt May's in her bedroom  She's sedated  He leans against the corridor wall deep in thought  Peter is pushed out of the room  Unknown to them  Peter averts his gaze nods his head then looks down at the floor  She smiles then closes her eyes again  The explosion rips out the wall  Peter has gone  Now he sits by his aunt's bedside  Peter studies it grimly  He talks to the Goblin mask  He lays it down and rises from the table  She smiles a little  Harry races out after his father  Aunt May is lying on the floor leaning against her bed  He runs to her room  Norman screws up his eyes and heads for the open window  Everyone has heard the conversation through the open door  Norman's picking at the sweet potatoes  MJ lowers her head  Peter's bright blue eyes twitch nervously  Later out of costume Peter walks through the front door  Aunt May's eyes are open  The Green Goblin glides in  Norman glares at him  Harry comes back into the room  He looks around spots the blood then raises his eyes to the ceiling  The next day MJ comes to visit  Norman's enhanced hearing picks up the sound of the drop hitting the floor  MJ reaches out and gently takes hold of Peter's hand Norman licks his fingers and looks malevolently at the white haired Aunt May  He shifts his gaze back onto his aunt and swallows before speaking  Still in costume he notices blood trickling down his arm ready to drop  As he turns to walk out the drop of blood falls to the floor  The young redhead looks down at the peaceful figure on the bed  Aunt May set an enormous turkey in front of Norman  He looks one way down the corridor and then turns to look the other way  Peter glances at her as a dejected  The young man takes his aunt's hand in his and gently strokes it with his thumb  On the bedside cabinet is a framed photograph of her Uncle Ben and Peter  Norman is holding the carving knife blade pointing at Peter "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Aunt May's in her bedroom  The explosion rips out the wall  The Green Goblin glides in  Aunt May is lying on the floor leaning against her bed  Later Peter rushes into the hospital  He runs to her room  Peter is pushed out of the room  He leans against the corridor wall deep in thought  Peter's bright blue eyes twitch nervously  He looks one way down the corridor and then turns to look the other way  Now he sits by his aunt's bedside  She's sedated  The young man takes his aunt's hand in his and gently strokes it with his thumb  On the bedside cabinet is a framed photograph of her Uncle Ben and Peter  Peter studies it grimly  He shifts his gaze back onto his aunt and swallows before speaking  The next day MJ comes to visit  There's flowers  The young redhead looks down at the peaceful figure on the bed  The two are sitting opposite each other He's staring straight into her eyes  She smiles a little  Peter averts his gaze nods his head then looks down at the floor  Unknown to them  Aunt May's eyes are open  She's overheard  She smiles then closes her eyes again  MJ reaches out and gently takes hold of Peter's hand He's nowhere to be seen as they all troop into his room  Norman comes further in Peter's clinging to the ceiling  Still in costume he notices blood trickling down his arm ready to drop  The others leave Norman in Peter's room  As he turns to walk out the drop of blood falls to the floor  Norman's enhanced hearing picks up the sound of the drop hitting the floor  He looks around spots the blood then raises his eyes to the ceiling  Peter has gone  Norman screws up his eyes and heads for the open window  Norman leans over the balcony and looks down and up  Later out of costume Peter walks through the front door  Norman is sitting at the head of the table and Peter opposite MJ and Harry  Aunt May set an enormous turkey in front of Norman  Norman's picking at the sweet potatoes  Norman licks his fingers and looks malevolently at the white haired Aunt May  He picks up the carving knife and begins to sharpen it a sneer on his face  Aunt May notices blood seeping through Peter's shirt  Norman glares at him  Norman is holding the carving knife blade pointing at Peter  He lays it down and rises from the table  Harry races out after his father  Everyone has heard the conversation through the open door  MJ lowers her head  Peter glances at her as a dejected  Harry comes back into the room  Norman's in his living room  He talks to the Goblin mask "
        }
      ]
    }
  ]
}