{
  "ground_truth": "Next morning, using a can of Dr. Pepper as a target, Peter is busy fine-tuning his wrist webbing. He pulls it and then catches it, but he's not so lucky with the bed lamp. Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall. Meanwhile, Norman Osborn is reading the Daily Bugle; the devils in his mind cause him to close his eyes tightly, and he shakes his head wearily. Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door. Downtown, the four-door automobile pulls up at the curb, and Peter looks away as a look of pain creases Uncle Ben's face. Uncle Ben nods slightly, and a somber Peter again looks away from his uncle. Uncle Ben, with a grim face, gets ready to move off, and Peter clambers out of the car, standing in the middle of the road with a brown paper bag in his hand. He starts to cross the road and watches as his uncle makes a left turn out of sight; then he walks off away from the library. Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw McGraw, the master of disaster, slams an opponent on the floor and then jumps on him, leading with an arm to his throat. The large, long-haired, muscle man takes the plaudits, as fans rub big toy saws over their arms, being massaged by four leather-clad beauties. Peter joins the queue, and Bone Saw hauls his opponent out of the ring and grabs the mic. Peter bolts, then slips through the ropes. The crowd chants hostility as the cage is set up above the wrestling ring, and Peter, wearing the spider and web emblazoned on his sweatshirt, looks up as the cage is slowly lowered around the ring, trapping him in. Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage. Bone Saw jumps up, and Peter somersaults out of his way, then uses his web to leap out of reach. Bone Saw is handed a folding chair, crashing it twice over Peter's head, and then thuds it across Peter's back. Grabbing Peter by a leg, Bone Saw crashes the youth into the cage bars, and then Bone Saw's handed a golf club. As the big wrestler charges, Peter, on his back on the floor, lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again, and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor, and Peter's eyes sparkle through the eye-holes of his balaclava as he listens to the crowd.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Next dawn, employing a container of Dr. Pepper as a mark, Peter is occupied fine-tuning his wrist webbing. He tugs it and then seizes it, but he's not so fortunate with the bed lamp. Peter shuts the partially ajar entryway and spins around to find his chamber with spider's filament dangling from partition to partition. Meanwhile, Norman Osborn is perusing the Daily Bugle; the demons in his mind prompt him to shut his eyes tightly, and he shakes his head wearily. Uncle Ben gives an OK gesture to Aunt May as Peter strides out of the doorway. Downtown, the four-door vehicle stops at the curb, and Peter averts his gaze as a look of anguish furrows Uncle Ben's countenance. Uncle Ben nods slightly, and a somber Peter again averts his gaze from his uncle. Uncle Ben, with a grim expression, prepares to depart, and Peter clambers out of the car, standing in the middle of the roadway with a brown paper sack in his hand. He begins to traverse the road and observes as his uncle makes a left turn out of view; then he strolls off away from the library. Peter makes his way up a stairway at the wrestling arena and from the balcony observes as Bone Saw McGraw, the master of calamity, slams an adversary on the ground and then leaps on him, leading with an arm to his throat. The large, long-haired, muscle man accepts the plaudits, as fans rub big toy saws over their arms, being massaged by four leather-clad beauties. Peter joins the queue, and Bone Saw hauls his adversary out of the ring and seizes the mic. Peter bolts, then slips through the ropes. The crowd chants hostility as the cage is set up above the wrestling ring, and Peter, wearing the spider and web emblazoned on his sweatshirt, gazes up as the cage is slowly lowered around the ring, trapping him inside. Bone Saw charges as Peter vaults in the air and Bone Saw crashes into the cage. Bone Saw jumps up, and Peter somersaults out of his path, then utilizes his web to leap out of reach. Bone Saw is handed a folding chair, smashing it twice over Peter's head, and then thuds it across Peter's back. Grabbing Peter by a limb, Bone Saw crashes the youth into the cage bars, and then Bone Saw is handed a golf club. As the big grappler charges, Peter, on his back on the floor, lashes out with his right foot into Bone Saw's body and visage. Bone Saw comes again, and Peter uses both feet to propel the big man beneath the ropes. Bone Saw collapses to the floor, and Peter's eyes gleam through the eye-holes of his balaclava as he listens to the crowd."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Next morning, a can of Dr. Pepper is used as a target by Peter, who is busy fine-tuning his wrist webbing. It is pulled and then caught by him, but the bed lamp isn't so lucky. The partly open door is closed by Peter, and he turns around to discover his room with spider's web dangling from wall to wall. Meanwhile, the Daily Bugle is being read by Norman Osborn; his eyes are closed tightly because of the devils in his mind, and his head is shaken wearily by him. Aunt May is given an OK sign by Uncle Ben as Peter walks out of the door. Downtown, the four-door automobile stops at the curb, and a look of pain creases Uncle Ben's face, so Peter looks away. Uncle Ben nods slightly, and a somber Peter again avoids looking at his uncle. With a grim face, Uncle Ben gets ready to move off, while Peter clambers out of the car, standing in the middle of the road holding a brown paper bag in his hand. The road is started to be crossed by him, and he watches as his uncle makes a left turn out of sight; then, away from the library, he walks off. Up a stairway at the wrestling arena, Peter makes his way and from the balcony watches as Bone Saw McGraw, the master of disaster, slams an opponent on the floor and then jumps on him, leading with an arm to his throat. The plaudits are taken by the large, long-haired, muscle man, as big toy saws are rubbed over fans' arms, being massaged by four leather-clad beauties. The queue is joined by Peter, and his opponent is hauled out of the ring by Bone Saw, who grabs the mic. Peter bolts, then the ropes are slipped through by him. Hostility is chanted by the crowd as the cage is set up above the wrestling ring, and Peter, wearing the spider and web emblazoned on his sweatshirt, looks up as the cage is slowly lowered around the ring, trapping him in. Bone Saw charges as Peter leaps in the air, and the cage is crashed into by Bone Saw. Bone Saw jumps up, and Peter somersaults out of his way, then the web is used by him to leap out of reach. A folding chair is handed to Bone Saw, who crashes it twice over Peter's head, and then it is thudded across Peter's back by him. Grabbing Peter by a leg, the youth is crashed into the cage bars by Bone Saw, and then a golf club is handed to Bone Saw. As the big wrestler charges, Peter, on his back on the floor, lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again, and both feet are used by Peter to propel the big man under the ropes. The floor is collapsed to by Bone Saw, and through the eye-holes of his balaclava, Peter's eyes sparkle as the crowd is listened to by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The next morning, Peter uses a can of Dr. Pepper as a target to fine-tune his wrist webbing. He catches it but hits the bed lamp. He closes the door and finds his room filled with spider webs. Meanwhile, Norman Osborn reads the Daily Bugle, fighting inner demons. Uncle Ben signals Aunt May as Peter leaves. Downtown, Peter exits a car with a pained Uncle Ben, who drives off. Peter heads to a wrestling arena, watching Bone Saw McGraw slam an opponent as fans cheer. Peter joins the line, and Bone Saw grabs a mic after winning. Peter enters the ring, and the crowd boos as the cage lowers, trapping him. Bone Saw charges, but Peter leaps away. Bone Saw hits Peter with a chair and smashes him into the cage. As Bone Saw attacks with a golf club, Peter kicks him and sends the wrestler under the ropes. Bone Saw collapses, and Peter's eyes reveal triumph as he hears the crowd."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The next morning, Peter uses a Dr. Pepper can for wrist webbing practice, successfully catching it but accidentally hitting the bed lamp. His room is full of spider webs. Norman Osborn reads the Daily Bugle, battling inner demons. Uncle Ben signals Aunt May as Peter leaves. Downtown, Peter exits the car with a brown bag, avoiding Uncle Ben's pained expression. After Uncle Ben departs, Peter heads to the wrestling arena, watching Bone Saw McGraw crush an opponent. Fans cheer with toy saws. Peter enters the ring as a cage lowers around him. Bone Saw charges, but Peter evades with acrobatics and webbing. Hit by a chair and slammed into the cage, Peter kicks Bone Saw, who receives a club but is kicked out of the ring. Peter's eyes shine through his mask as he hears the crowd."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Early the following morning, Peter finds himself occupied with the task of meticulously fine-tuning his wrist webbing system. As a target, he employs a can of Dr. Pepper, demonstrating his focus and determination. He expertly pulls the webbing towards him and successfully catches the can, although he is not so fortunate with the nearby bed lamp. After closing the partially ajar door, he turns to face his room, which now resembles a spider’s lair, with webs intricately draped from one wall to another. During this time, Norman Osborn is absorbed in reading the Daily Bugle. However, the inner devils tormenting his mind cause him to shut his eyes tightly and shake his head in weary frustration. \n\nOn the other side, Uncle Ben discreetly gives a reassuring OK sign to Aunt May as Peter makes his way out through the door. In the downtown area, a four-door automobile pulls up at the curb. With a look of pain etched upon his face, Uncle Ben glances at Peter, who then looks away, visibly moved by the moment's emotion. Uncle Ben gives a slight nod, acknowledging the situation, while Peter, in a somber state, averts his eyes from his uncle’s gaze. With a grim expression, Uncle Ben prepares to drive away, while Peter clambers out of the car, finding himself standing in the middle of the road with a brown paper bag in hand. He begins to cross the street, watching his uncle make a left turn until he disappears from sight. Peter then heads off in the opposite direction, walking away from the library.\n\nArriving at the wrestling arena, Peter ascends a stairway, seeking a vantage point from the balcony. There, he observes Bone Saw McGraw, known as the master of disaster, as he fiercely slams an opponent to the floor. The spectacle continues with Bone Saw leaping on his adversary, leading with a powerful arm to the throat. The large, long-haired, muscular wrestler receives applause and cheers from the fans, who enthusiastically rub oversized toy saws over their arms as a form of tribute, while being attended to by four leather-clad beauties. Peter proceeds to join the queue, as Bone Saw hauls his defeated opponent out of the ring and grabs the microphone to address the crowd. \n\nPeter suddenly sprints forward and quickly slips through the ropes, stepping into the ring. The crowd erupts in hostility, chanting loudly, as the cage is meticulously set up above the wrestling ring. Peter, clad in a sweatshirt emblazoned with a spider and web motif, watches intently as the cage is slowly lowered around the ring, effectively trapping him inside. Bone Saw charges towards him, but Peter skillfully leaps into the air, causing Bone Saw to crash into the cage itself. As Bone Saw springs back up, Peter deftly somersaults out of his path and uses his webbing to leap safely out of reach. \n\nBone Saw is handed a folding chair, which he crashes over Peter's head twice, producing a loud, resounding impact. He then proceeds to thud the chair across Peter's back. Seizing Peter by one leg, Bone Saw hurls the young man into the bars of the cage. Subsequently, Bone Saw is given a golf club as a weapon. Charging with force, Peter, now lying on his back on the floor, lashes out with a powerful right foot, striking Bone Saw’s body and face with precision. As Bone Saw charges again, Peter uses both feet to propel the large man under the ropes, causing Bone Saw to collapse to the floor. Through the eye-holes of his balaclava, Peter’s eyes sparkle triumphantly as he listens to the roaring crowd."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Early in the morning of the following day, Peter finds himself deeply engaged in the meticulous task of fine-tuning and refining his wrist webbing system. As a target for his practice, he uses a can of Dr. Pepper, which serves as a testament to his focus and unwavering determination. With expert precision, he pulls the webbing towards himself and successfully catches the can, though his attempt is less fortunate with the nearby bed lamp. After quietly closing the partially ajar door, he turns to survey his room, which has now transformed into a spider’s lair, with webs artfully and intricately draped from one wall to the other. During this time, elsewhere, Norman Osborn is absorbed in reading the Daily Bugle. However, the inner devils that plague his mind relentlessly cause him to press his eyes shut tightly and shake his head in weary frustration, as if trying to dispel the torment within. \n\nOn the other side, Uncle Ben discreetly and reassuringly gives an OK sign to Aunt May as Peter makes his way out through the door. In the bustling downtown area, a four-door automobile comes to a stop at the curb. With a pained expression etched across his face, Uncle Ben glances meaningfully at Peter, who then looks away, clearly moved by the emotional weight of the moment. With a slight nod, Uncle Ben acknowledges the situation, while Peter, in a somber state, averts his eyes from his uncle’s gaze. With a grim expression on his face, Uncle Ben prepares to drive away, while Peter exits the car, finding himself standing in the middle of the road with a brown paper bag in his hand. He begins to cross the street, watching his uncle make a left turn until he disappears completely from sight. Peter then resolutely heads off in the opposite direction, walking away from the library.\n\nUpon arriving at the wrestling arena, Peter ascends a stairway, searching for a vantage point from which to observe the action below from the balcony. From there, he sees Bone Saw McGraw, famously known as the master of disaster, as he fiercely and powerfully slams an opponent to the floor. The spectacle continues with Bone Saw leaping onto his adversary, leading with a powerful arm to the throat in a display of sheer force. The large, long-haired, and muscular wrestler receives a torrent of applause and cheers from the enthusiastic fans, who energetically rub oversized toy saws over their arms as a form of tribute, all the while being attended to by four leather-clad beauties. Peter proceeds to join the queue, as Bone Saw hauls his defeated opponent out of the ring and grabs the microphone to address the eager and raucous crowd.\n\nSuddenly, Peter sprints forward and swiftly slips through the ropes, boldly stepping into the ring. The crowd erupts in hostility, chanting loudly and fervently, as the cage is carefully and meticulously set up above the wrestling ring. Clad in a sweatshirt emblazoned with a spider and web motif, Peter watches with intense focus as the cage is slowly lowered around the ring, effectively trapping him inside this arena of combat. Bone Saw charges towards him with ferocious intent, but Peter skillfully leaps into the air, causing Bone Saw to crash into the cage itself. As Bone Saw springs back up, Peter deftly somersaults out of his path and uses his webbing to leap safely out of reach of the large wrestler.\n\nBone Saw is handed a folding chair, which he uses to crash over Peter's head twice, producing a loud, resounding impact that echoes throughout the arena. He then proceeds to thud the chair across Peter's back with tremendous force. Seizing Peter by one leg, Bone Saw hurls the young man into the bars of the enclosing cage. Subsequently, Bone Saw is handed a golf club as yet another weapon. Charging with full force, Peter, now lying prone on his back on the floor, lashes out with a powerful right foot, striking Bone Saw’s body and face with pinpoint precision. As Bone Saw charges yet again, Peter uses both feet to propel the large man under the ropes, causing Bone Saw to collapse heavily to the floor. Through the eye-holes of his balaclava, Peter’s eyes sparkle triumphantly as he listens to the roaring, exuberant crowd."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The next morning dawns, and Peter finds himself deeply immersed in the meticulous process of fine-tuning his wrist webbing, using a can of Dr. Pepper as his target. With focused determination, he carefully aims and releases a web strand, watching as it sails through the air before catching it deftly in his hand. However, his attempt is less precise with the bed lamp, resulting in an unintended mishap. Resolutely, Peter moves to close the partly open door to his room, turning around to discover an intricate spider's web suspended from wall to wall, demonstrating the spontaneity of his newfound abilities. Meanwhile, in a different setting, Norman Osborn sits with the Daily Bugle in hand, his eyes scanning the pages until the devils in his mind provoke him to shut his eyes tightly, a gesture accompanied by a weary shake of his head. In a different part of town, Uncle Ben communicates silently with Aunt May, offering her an OK sign just as Peter steps out the door, leaving home. As Peter finds himself downtown, the family car pulls up to the curb where he and Uncle Ben share a poignant moment marked by silent understanding; Peter’s face turns away, pained by the separation, while a pained expression etches itself upon Uncle Ben's face. Uncle Ben gives a subtle nod, and Peter reciprocates by averting his eyes once more, burdened by the gravity of the moment. Uncle Ben, his demeanor grim, prepares to drive away, prompting Peter to clamber out of the car, stepping into the middle of the road with a brown paper bag clutched in his hand. As he begins to cross the street, Peter pauses to watch his uncle's car make a left turn, disappearing from view before he resolutely walks away from the library. Determined, Peter ventures up a stairway leading to the wrestling arena where, from a vantage point on the balcony, he becomes a spectator to Bone Saw McGraw's intense match. With awe, Peter witnesses the master of disaster hoisting an opponent and slamming him onto the floor, followed by a powerful leap that culminates in an arm to the opponent’s throat. The crowd responds with enthusiasm as Bone Saw, a large, long-haired, muscular figure, receives their admiration; fans animatedly rub oversized toy saws over their arms, enjoying the show alongside four leather-clad beauties. Peter joins the queue, observing as Bone Saw unceremoniously hauls his defeated opponent out of the ring before seizing the microphone. Sensing his moment, Peter bolts with determination, slipping through the ropes into the ring. The atmosphere turns hostile as the crowd jeers while a cage is methodically lowered over the wrestling ring, entrapping Peter inside. As he stands in the ring, his sweatshirt emblazoned with a spider and web, Peter looks up, acknowledging the enclosure. Bone Saw charges aggressively, prompting Peter to leap into the air, resulting in Bone Saw colliding forcefully with the cage. Undeterred, Bone Saw quickly regains his composure, prompting Peter to nimbly somersault out of his way and deploy his web to spring out of reach. Undaunted, Bone Saw is handed a folding chair, which he crashes twice over Peter’s head, the sound echoing with each strike, before delivering a thudding blow to Peter’s back. As the battle wages on, Bone Saw seizes Peter by the leg, hurling him against the cage bars with resounding force before being handed a golf club, readying for another charge. Positioned on his back, Peter reacts swiftly, lashing out with his right foot, a well-timed move that connects with Bone Saw’s body and face, repelling the advance. As Bone Saw mounts another assault, Peter utilizes both feet to catapult the formidable man under the ropes, sending Bone Saw sprawling to the floor. In a moment of triumph, Peter's eyes glisten with a spark of victory through the eye-holes of his balaclava as the cheering crowd exalts in the spectacle."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The next morning, Peter fine-tunes his wrist webbing using a can of Dr. Pepper as a target. He successfully catches it, but accidentally hits the bed lamp and notices spider webs covering his room. Meanwhile, Norman Osborn, affected by his inner demons, wearily reads the Daily Bugle. As Peter leaves the house, Uncle Ben silently communicates approval to Aunt May and drives away, exchanging a somber nod with Peter. Peter then heads to the wrestling arena, watching from a balcony as Bone Saw McGraw dominates his opponent. Peter joins the queue and soon finds himself in the ring, wearing a sweatshirt emblazoned with a spider. The crowd's hostility grows as a cage is lowered, trapping Peter inside. Bone Saw charges, but Peter agilely evades him, using his webbing to maneuver. Bone Saw tries to overpower Peter with a chair and repeatedly crashes him into the cage bars. When handed a golf club, Bone Saw charges again, but Peter strikes back with precise kicks, sending Bone Saw tumbling under the ropes. Victorious, Peter listens to the crowd through the eye-holes of his balaclava, his eyes sparkling with determination."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Next morning, using a can of Dr. Pepper, a popular soft drink originating from the late 19th century known for its unique blend of 23 flavors, as a target, Peter is busy fine-tuning his wrist webbing. He pulls it and then catches it, but he's not so lucky with the bed lamp, a vintage Tiffany-style piece that his aunt had given him last Christmas. Peter closes the partly open door of his small, cluttered bedroom and turns around to find his room with spider's web dangling from wall to wall, a testament to his growing but still unrefined abilities. Meanwhile, Norman Osborn, the ambitious CEO of Oscorp, is reading the Daily Bugle, a New York City tabloid notorious for its sensational headlines; the devils in his mind cause him to close his eyes tightly, and he shakes his head wearily, consumed by the weight of his secret experiments. Uncle Ben, a retired electrician known for his words of wisdom, gives an OK sign to Aunt May as Peter walks out of the door. Downtown, the classic four-door automobile, a 1963 Chevy Impala that Uncle Ben has kept in pristine condition, pulls up at the curb, and Peter looks away as a look of pain creases Uncle Ben's face. Uncle Ben nods slightly, and a somber Peter again looks away from his uncle. Uncle Ben, with a grim face, gets ready to move off, and Peter clambers out of the car, standing in the middle of the road with a brown paper bag in his hand. He starts to cross the road and watches as his uncle makes a left turn out of sight; then he walks off away from the library, a stately building that houses the city's largest collection of historical texts. Peter makes his way up a stairway at the wrestling arena, a venue notorious for its rowdy events, and from the balcony watches as Bone Saw McGraw, the master of disaster, slams an opponent on the floor and then jumps on him, leading with an arm to his throat. The large, long-haired, muscle man takes the plaudits, as fans rub big toy saws over their arms, being massaged by four leather-clad beauties, who are a signature part of the wrestling spectacle. Peter joins the queue, and Bone Saw hauls his opponent out of the ring and grabs the mic, taunting the crowd with his bravado. Peter bolts, then slips through the ropes. The crowd chants hostility as the cage, a notorious gimmick designed to intensify the drama of the match, is set up above the wrestling ring, and Peter, wearing the spider and web emblazoned on his sweatshirt, a homemade design reflecting his burgeoning identity, looks up as the cage is slowly lowered around the ring, trapping him in. Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage. Bone Saw jumps up, and Peter somersaults out of his way, then uses his web, a manifestation of the abilities granted by his spider bite, to leap out of reach. Bone Saw is handed a folding chair, a classic wrestling weapon notorious for its dramatic impact, crashing it twice over Peter's head, and then thuds it across Peter's back. Grabbing Peter by a leg, Bone Saw crashes the youth into the cage bars, and then Bone Saw's handed a golf club, escalating the chaos of the match. As the big wrestler charges, Peter, on his back on the floor, lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again, and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor, and Peter's eyes sparkle through the eye-holes of his balaclava, which conceals his identity, as he listens to the crowd's unexpected cheers."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing Peter again looks away from his uncle He pulls it and then catches it but he is not so lucky with the bed lamp then uses his web to leap out of reach Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall Meanwhile Norman Osborn is reading the Daily Bugle the devils in his mind because him to close his eyes tightly and he shakes his head wearily Meanwhile Norman Osborn is reading the Daily Bugle Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face Uncle Ben nods slightly and a somber Uncle Ben nods slightly and a somber Peter again looks away from his uncle the devils in his mind because him to close his eyes tightly and he shakes his head wearily Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand He starts to cross the road and watches as his uncle makes a left turn out of sight The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in then he walks off away from the library The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic Peter bolts then slips through the ropes As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage Bone Saw jumps up and Peter somersaults out of his way Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back Bone Saw comes again and Peter uses both feet to propel the big man under the ropes then uses his web to leap out of reach Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back Grabbing Peter by a leg Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face Bone Saw comes again and Peter uses both feet to propel the big man under the ropes Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing. He pulls it and then catches it but he is not so lucky with the bed lamp. Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall. Meanwhile Norman Osborn is reading the Daily Bugle. the devils in his mind because him to close his eyes tightly and he shakes his head wearily. Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door. Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face. Uncle Ben nods slightly and a somber. Peter again looks away from his uncle. Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand. He starts to cross the road and watches as his uncle makes a left turn out of sight. then he walks off away from the library. Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat. The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties. Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic. Peter bolts then slips through the ropes. The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in. Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage. Bone Saw jumps up and Peter somersaults out of his way. then uses his web to leap out of reach. Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back. Grabbing Peter by a leg. Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club. As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing. He pulls it and then catches it but he is not so lucky with the bed lamp. Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall. Meanwhile Norman Osborn is reading the Daily Bugle. the devils in his mind because him to close his eyes tightly and he shakes his head wearily. Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door. Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face. Uncle Ben nods slightly and a somber. Peter again looks away from his uncle. Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand. He starts to cross the road and watches as his uncle makes a left turn out of sight. then he walks off away from the library. Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat. The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties. Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic. Peter bolts then slips through the ropes. The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in. Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage. Bone Saw jumps up and Peter somersaults out of his way. then uses his web to leap out of reach. Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back. Grabbing Peter by a leg. Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club. As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing. He pulls it and then catches it but he is not so lucky with the bed lamp. Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall. Meanwhile Norman Osborn is reading the Daily Bugle. the devils in his mind because him to close his eyes tightly and he shakes his head wearily. Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door. Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face. then uses his web to leap out of reach. Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back. Grabbing Peter by a leg. Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club. As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing. He pulls it and then catches it but he is not so lucky with the bed lamp. Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall. As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face. Bone Saw comes again and Peter uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Next morning, using a can of Dr. Pepper as a target, the giraffe is busy fine-tuning its wrist webbing. The giraffe pulls it and then catches it, but it's not so lucky with the bed lamp. The giraffe closes the partly open door and turns around to find its room with spider's web dangling from wall to wall. Meanwhile, the squirrel is reading the Daily Bugle; the devils in its mind cause it to close its eyes tightly, and it shakes its head wearily. The robot gives an OK sign to the penguin as the giraffe walks out of the door. Downtown, the four-door automobile pulls up at the curb, and the giraffe looks away as a look of pain creases the robot's face. The robot nods slightly, and a somber giraffe again looks away from the robot. The robot, with a grim face, gets ready to move off, and the giraffe clambers out of the car, standing in the middle of the road with a brown paper bag in its hand. It starts to cross the road and watches as the robot makes a left turn out of sight; then it walks off away from the library. The giraffe makes its way up a stairway at the wrestling arena and from the balcony watches as Bone Saw McGraw, the master of disaster, slams an opponent on the floor and then jumps on him, leading with an arm to his throat. The large, long-haired, muscle man takes the plaudits, as fans rub big toy saws over their arms, being massaged by four leather-clad beauties. The giraffe joins the queue, and Bone Saw hauls his opponent out of the ring and grabs the mic. The giraffe bolts, then slips through the ropes. The crowd chants hostility as the cage is set up above the wrestling ring, and the giraffe, wearing the spider and web emblazoned on its sweatshirt, looks up as the cage is slowly lowered around the ring, trapping it in. Bone Saw charges as the giraffe leaps in the air and Bone Saw crashes into the cage. Bone Saw jumps up, and the giraffe somersaults out of his way, then uses its web to leap out of reach. Bone Saw is handed a folding chair, crashing it twice over the giraffe's head, and then thuds it across the giraffe's back. Grabbing the giraffe by a leg, Bone Saw crashes the animal into the cage bars, and then Bone Saw's handed a golf club. As the big wrestler charges, the giraffe, on its back on the floor, lashes out with its right foot into Bone Saw's body and face. Bone Saw comes again, and the giraffe uses both feet to propel the big man under the ropes. Bone Saw collapses to the floor, and the giraffe's eyes sparkle through the eye-holes of its balaclava as it listens to the crowd."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Next morning, using a bottle of root beer as a target, Peter is busy fine-tuning his wrist gadgets. He pulls it and then catches it, but he's not so lucky with the ceiling fan. Peter closes the partly open window and turns around to find his room with ribbons dangling from wall to wall. Meanwhile, Norman Osborn is reading the New York Times; the critters in his mind cause him to close his eyes tightly, and he shakes his head wearily. Uncle Ben gives a thumbs-up sign to Aunt May as Peter walks out of the window. Downtown, the two-door bicycle pulls up at the sidewalk, and Peter looks away as a look of pain creases Uncle Ben's face. Uncle Ben nods slightly, and a somber Peter again looks away from his uncle. Uncle Ben, with a grim face, gets ready to move off, and Peter clambers out of the wagon, standing in the middle of the road with a plastic shopping bag in his hand. He starts to cross the road and watches as his uncle makes a right turn out of sight; then he walks off away from the museum. Peter makes his way up a stairway at the boxing arena and from the balcony watches as Bone Saw McGraw, the master of disaster, slams an opponent on the mat and then jumps on him, leading with a leg to his chest. The large, long-haired, muscle man takes the plaudits, as fans rub oversized foam fingers over their arms, being massaged by four silk-clad beauties. Peter joins the queue, and Bone Saw hauls his opponent out of the ring and grabs the megaphone. Peter bolts, then slips through the ropes. The crowd chants hostility as the net is set up above the boxing ring, and Peter, wearing the spider and web emblazoned on his hoodie, looks up as the net is slowly lowered around the ring, trapping him in. Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the net. Bone Saw jumps up, and Peter somersaults out of his way, then uses his web to leap out of reach. Bone Saw is handed a broomstick, crashing it twice over Peter's head, and then thuds it across Peter's back. Grabbing Peter by an arm, Bone Saw crashes the youth into the netting, and then Bone Saw's handed a cricket bat. As the big wrestler charges, Peter, on his back on the floor, lashes out with his right arm into Bone Saw's body and face. Bone Saw comes again, and Peter uses both arms to propel the big man under the ropes. Bone Saw collapses to the floor, and Peter's eyes sparkle through the eye-holes of his crash helmet as he listens to the crowd."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Next morning, using a can of Dr. Pepper as a target, Peter is busy painting his wrist webbing. He flicks it and then pushes it, but he's not so lucky with the bed lamp. Peter opens the partly open door and spins around to find his room with spider's web shimmering from wall to wall. Meanwhile, Norman Osborn is drawing on the Daily Bugle; the devils in his mind cause him to rub his eyes tightly, and he taps his forehead wearily. Uncle Ben gives a high-five to Aunt May as Peter dances out of the door. Downtown, the four-door automobile zooms past the curb, and Peter turns toward a look of pain creasing Uncle Ben's face. Uncle Ben waves slightly, and a somber Peter again turns toward his uncle. Uncle Ben, with a grim face, gets ready to vanish, and Peter flips out of the car, standing in the middle of the road with a brown paper bag in his hand. He hops to cross the road and observes as his uncle spins out of sight; then he jogs off away from the library. Peter skips his way up a stairway at the wrestling arena and from the balcony listens as Bone Saw McGraw, the master of disaster, twirls his opponent on the floor and then pirouettes on him, leading with a dance to his throat. The large, long-haired, muscle man accepts the plaudits, as fans juggle big toy saws over their arms, being serenaded by four leather-clad beauties. Peter ignores the queue, and Bone Saw lifts his opponent out of the ring and sings into the mic. Peter chats, then crawls through the ropes. The crowd whispers hostility as the cage is suspended above the wrestling ring, and Peter, wearing the spider and web emblazoned on his sweatshirt, looks up as the cage is slowly elevated around the ring, releasing him in. Bone Saw stumbles as Peter kneels in the air and Bone Saw falls into the cage. Bone Saw crawls up, and Peter flips out of his way, then uses his web to hover out of reach. Bone Saw is handed a folding chair, tossing it twice over Peter's head, and then flutters it across Peter's back. Grabbing Peter by a leg, Bone Saw swings the youth into the cage bars, and then Bone Saw's handed a golf club. As the big wrestler dances, Peter, on his back on the floor, swings out with his right foot into Bone Saw's body and face. Bone Saw comes again, and Peter uses both feet to vault the big man under the ropes. Bone Saw cartwheels to the floor, and Peter's eyes twinkle through the eye-holes of his balaclava as he waves to the crowd."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Next morning, using a carton of orange juice as a target, Lisa is busy fine-tuning her elbow paint. She flicks it and then catches it, but she's not so lucky with the bookshelf. Lisa closes the partly open window and turns around to find her garage with cat's cradle dangling from chair to bookshelf. Meanwhile, Samantha Thompson is reading the Morning Herald; the fairies in her mind cause her to close her eyes tightly, and she shakes her head wearily. Aunt Sarah gives an OK sign to Cousin Jane as Lisa walks out of the window. Downtown, the tricycle pulls up at the stop sign, and Lisa looks away as a look of pain creases Aunt Sarah's face. Aunt Sarah nods slightly, and a somber Lisa again looks away from her aunt. Aunt Sarah, with a grim face, gets ready to move off, and Lisa clambers out of the bus, standing in the middle of the sidewalk with a red backpack in her hand. She starts to cross the sidewalk and watches as her aunt makes a right turn out of sight; then she walks off away from the school. Lisa makes her way up a ladder at the circus tent and from the balcony watches as Thunder Roar, the warrior of mayhem, slams a contestant on the ground and then jumps on him, leading with an elbow to his neck. The gigantic, short-haired, juggler takes the plaudits, as spectators rub gigantic clown noses over their elbows, being massaged by four velvet-clad mermaids. Lisa joins the line, and Thunder Roar hauls his contestant out of the ring and grabs the mic. Lisa bolts, then slips through the ropes. The crowd chants hostility as the net is set up above the circus ring, and Lisa, wearing the lightning bolt and paint emblazoned on her sweater, looks up as the net is slowly lowered around the ring, trapping her in. Thunder Roar charges as Lisa jumps in the air and Thunder Roar crashes into the net. Thunder Roar jumps up, and Lisa somersaults out of his way, then uses her cape to leap out of reach. Thunder Roar is handed a frying pan, crashing it twice over Lisa's helmet, and then thuds it across Lisa's arm. Grabbing Lisa by an arm, Thunder Roar crashes the youth into the net bars, and then Thunder Roar's handed a baseball bat. As the big juggler charges, Lisa, on her back on the ground, lashes out with her right hand into Thunder Roar's chest and nose. Thunder Roar comes again, and Lisa uses both hands to propel the giant under the ropes. Thunder Roar collapses to the carpet, and Lisa's eyes sparkle through the eye-holes of her ski mask as she listens to the audience."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Next morning, using a can of Dr. Pepper as a target, Maria is busy sketching her wrist painting. She scribbles it and then wipes it, but she's not so lucky with the bed lamp. Maria opens the partly closed window and turns around to find her room with spider's web dangling from wall to wall. Meanwhile, Helena Blake is examining the Daily Bugle; the angels in her mind cause her to rub her eyes gently, and she sighs wearily. Aunt June gives an OK sign to Uncle Sam as Maria tiptoes out of the door. Downtown, the bicycle rolls up at the curb, and Maria glances away as a look of mirth creases Aunt June's face. Aunt June grins slightly, and a cheerful Maria again glances away from her aunt. Aunt June, with a gleeful face, gets ready to pedal off, and Maria tiptoes out of the bicycle, standing in the middle of the road with a brown paper bag in her hand. She starts to skip across the road and watches as her aunt makes a right turn out of sight; then she skips off away from the library. Maria makes her way down a stairway at the theatre and from the balcony watches as Rocky Balboa, the king of charisma, hugs an opponent on the floor and then leans on him, leading with an arm to his shoulder. The large, long-haired, muscle man takes the plaudits, as fans rub big toy gloves over their arms, being massaged by four sequin-clad performers. Maria joins the queue, and Rocky hauls his opponent out of the ring and tosses the mic. Maria gallops, then slides through the ropes. The crowd chants anticipation as the curtain is set up above the wrestling ring, and Maria, wearing the spider and web emblazoned on her hat, looks up as the curtain is slowly lowered around the ring, trapping her in. Rocky charges as Maria skips in the air and Rocky stumbles into the curtain. Rocky jumps up, and Maria cartwheels out of his way, then uses her web to glide out of reach. Rocky is handed a drumstick, tapping it twice over Maria's head, and then thuds it across Maria's shoulder. Grabbing Maria by an arm, Rocky hurls the youth into the curtain bars, and then Rocky's handed a frisbee. As the big wrestler charges, Maria, on her back on the floor, kicks out with her left foot into Rocky's body and face. Rocky comes again, and Maria uses both feet to propel the big man under the ropes. Rocky collapses to the floor, and Maria's eyes glimmer through the eye-holes of her hat as she listens to the crowd."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Next morning, using a jar of honey as a target, Peter is busy adjusting his wristbands. He stretches it and then catches it, but he's not so lucky with the desk clock. Peter shuts the partially open window and spins around to find his room with yarn hanging from corner to corner. Meanwhile, Norman Osborn is reading the New York Times; the angels in his mind cause him to open his eyes wide, and he nods his head enthusiastically. Uncle Ben gives a thumbs-up to Aunt May as Peter steps out of the window. Downtown, the bicycle stops at the driveway, and Peter glances away as a look of joy creases Uncle Ben's face. Uncle Ben waves slightly, and a cheerful Peter again turns back to his uncle. Uncle Ben, with a bright smile, prepares to pedal away, and Peter crawls out of the cart, standing in the middle of the alley with a blue balloon in his hand. He starts to cross the sidewalk and watches as his uncle makes a right turn out of view; then he strolls off away from the bookstore. Peter makes his way up a ladder at the concert hall and from the balcony observes as Bone Saw McGraw, the king of chaos, flips an opponent into the air and then stomps on him, leading with a fist to his stomach. The large, flowing-haired, slim man takes the accolades, as fans press large foam swords over their legs, being cheered by four velvet-draped musicians. Peter joins the line, and Bone Saw shoves his opponent out of the stage and grabs the spotlight. Peter dashes, then slides under the barricades. The crowd murmurs anticipation as the net is set up above the stage, and Peter, bearing the cat and whiskers emblazoned on his jacket, glances up as the net is steadily lowered around the stage, confining him in. Bone Saw storms as Peter springs into the air and Bone Saw bounces into the net. Bone Saw hops up, and Peter cartwheels out of his path, then uses his slingshot to jump out of reach. Bone Saw is handed a tennis racket, swinging it twice over Peter's shoulder, and then clunks it across Peter's knees. Grabbing Peter by an arm, Bone Saw flings the youth into the netting, and then Bone Saw's handed a baseball bat. As the towering performer charges, Peter, on his back on the ground, kicks out with his left heel into Bone Saw's chest and chin. Bone Saw approaches again, and Peter uses both hands to fling the giant under the ropes. Bone Saw tumbles to the ground, and Peter’s eyes gleam through the slits of his mask as he listens to the crowd."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The following afternoon, using a carton of orange juice as a bullseye, Lisa is preoccupied with adjusting her elbow glitter. She flings it and then nabs it, but she's not so fortunate with the kitchen chair. Lisa closes the fully open window and pivots to find her closet with ribbons hanging from ceiling to floor. Meanwhile, Victor Silversmith is sketching the Town Gazette; the angels in his dreams urge him to open his eyes widely, and he nods his head slowly. Grandma Sue gives a thumbs up to Grandpa Joe as Lisa rushes out of the window. Uptown, the two-door pickup truck stops at the traffic light, and Lisa gazes away as a look of joy creases Grandpa Joe's forehead. Grandpa Joe shakes his head subtly, and a cheerful Lisa again glances away from her grandpa. Grandpa Joe, with a sunny face, prepares to zoom off, and Lisa descends from the bicycle, standing on the sidewalk with a plastic shopping bag in her hand. She begins to navigate the sidewalk and observes as her grandpa makes a right turn out of sight; then she skips away from the post office. Lisa ascends a ladder at the circus tent and from the rooftop observes as Thunder Thump Thompson, the villain of calamity, tosses an adversary into the sky and then stomps on him, leading with a knee to his ribcage. The huge, short-haired, skinny woman accepts the boos, as spectators rub tiny toy hammers over their heads, being tickled by two cotton-clad jesters. Lisa enters the line, and Thunder Thump drags her nemesis from the stage and seizes the horn. Lisa flees, then squirms through the curtains. The audience shouts cheers as the net is drawn up above the circus platform, and Lisa, wearing the snake and flower emblazoned on her vest, gazes up as the net is rapidly raised around the platform, enclosing her within. Thunder Thump dashes as Lisa hops in the air and Thunder Thump slams into the net. Thunder Thump stands up, and Lisa flips out of her way, then uses her glitter to swing out of distance. Thunder Thump is given a plastic stool, smacking it thrice over Lisa's shoulder, and then slams it across Lisa's legs. Seizing Lisa by an arm, Thunder Thump slams the girl into the net wires, and then Thunder Thump's handed a tennis racket. As the slender acrobat charges, Lisa, on her knees on the ground, kicks out with her left hand into Thunder Thump's chest and ear. Thunder Thump charges again, and Lisa uses both arms to push the slender woman over the ribbons. Thunder Thump tumbles to the ground, and Lisa's eyes glow through the slits of her scarf as she delights in the audience."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The next morning, Peter practices his wrist webbing with a can of Dr. Pepper, accidentally filling his room with webs. Meanwhile, Norman Osborn struggles with his inner demons while reading the Daily Bugle. As Peter leaves, Uncle Ben shows signs of concern but proceeds to drive away, leaving Peter contemplative. At a wrestling arena, Peter watches Bone Saw McGraw dominate his opponent. Peter, wearing a sweatshirt with a spider design, enters the ring. Amidst the hostile crowd, a cage lowers, trapping him with Bone Saw. Despite the wrestler's brutal attacks with a chair and a golf club, Peter uses his agility and webs to outmaneuver him. Ultimately, Peter propels Bone Saw out of the ring, winning the crowd's approval through the eye-holes of his balaclava."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd Bone Saw comes again and Peter uses both feet to propel the big man under the ropes As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club Grabbing Peter by a leg Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back then uses his web to leap out of reach Bone Saw jumps up and Peter somersaults out of his way Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in Peter bolts then slips through the ropes Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw then he walks off away from the library He starts to cross the road and watches as his uncle makes a left turn out of sight Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand Peter again looks away from his uncle Uncle Ben nods slightly and a somber Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door the devils in his mind because him to close his eyes tightly and he shakes his head wearily Meanwhile Norman Osborn is reading the Daily Bugle Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall He pulls it and then catches it but he is not so lucky with the bed lamp Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Peter bolts then slips through the ropes Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd Bone Saw jumps up and Peter somersaults out of his way Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door He starts to cross the road and watches as his uncle makes a left turn out of sight Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic Grabbing Peter by a leg then he walks off away from the library Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage He pulls it and then catches it but he is not so lucky with the bed lamp The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in Bone Saw comes again and Peter uses both feet to propel the big man under the ropes the devils in his mind because him to close his eyes tightly and he shakes his head wearily Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back Uncle Ben nods slightly and a somber Peter again looks away from his uncle Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing Meanwhile Norman Osborn is reading the Daily Bugle then uses his web to leap out of reach"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The large longhaired muscle man takes the plaudits as fans rub big toy saws over their arms being massaged by four leatherclad beauties Peter joins the queue and Bone Saw hauls his opponent out of the ring and grabs the mic Peter bolts then slips through the ropes The crowd chants hostility as the cage is set up above the wrestling ring and Peter wearing the spider and web emblazoned on his sweatshirt looks up as the cage is slowly lowered around the ring trapping him in Bone Saw charges as Peter leaps in the air and Bone Saw crashes into the cage Bone Saw jumps up and Peter somersaults out of his way then uses his web to leap out of reach Bone Saw is handed a folding chair crashing it twice over Peter's head and then thuds it across Peter's back Grabbing Peter by a leg Bone Saw crashes the youth into the cage bars and then Bone Saw's handed a golf club As the big wrestler charges Peter on his back on the floor lashes out with his right foot into Bone Saw's body and face Bone Saw comes again and Peter uses both feet to propel the big man under the ropes Bone Saw collapses to the floor and Peter's eyes sparkle through the eyeholes of his balaclava as he listens to the crowd Next morning using a can of Dr Pepper as a target Peter is busy finetuning his wrist webbing He pulls it and then catches it but he is not so lucky with the bed lamp Peter closes the partly open door and turns around to find his room with spider's web dangling from wall to wall Meanwhile Norman Osborn is reading the Daily Bugle the devils in his mind because him to close his eyes tightly and he shakes his head wearily Uncle Ben gives an OK sign to Aunt May as Peter walks out of the door Downtown the fourdoor automobile pulls up at the curb and Peter looks away as a look of pain creases Uncle Ben's face Uncle Ben nods slightly and a somber Peter again looks away from his uncle Uncle Ben with a grim face gets ready to move off and Peter clambers out of the car standing in the middle of the road with a brown paper bag in his hand He starts to cross the road and watches as his uncle makes a left turn out of sight then he walks off away from the library Peter makes his way up a stairway at the wrestling arena and from the balcony watches as Bone Saw McGraw the master of disaster slams an opponent on the floor and then jumps on him leading with an arm to his throat"
        }
      ]
    }
  ]
}