{
  "ground_truth": "Set against a moody blue sky with towering white and gold clouds, a woman in Grecian-style robes holds aloft a shining torch as pages of comic magazines appear, followed by a spider's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed, showing Peter Parker and his new muscular body, then as the prototype Spider-Man and the wrestling green cage. Peter fails to stop a thief and is seen kneeling by his dying uncle, leading to the beginnings of the Spider-Man costume, followed by more titles. Spider-Man stands over Norman Osborn as Harry walks into the room, and Peter Parker is at his Uncle Ben's graveside. Peter walks away from MJ in the graveyard, later gazing at a poster of MJ, the face of the parfumerie Emma Rose, while working as a pizza boy. Peter gazes blankly amid traffic at a standstill and, on his moped, weaves his way through cars and yellow cabs as a taxi pulls out in front of him. Stacked on the back of his moped are pizzas. A taxi stops in front of him, and he swings around it, seeing the lights change as a bus passes in front. He looks up at the clock, and another minute ticks by. Now on foot, Peter runs into an alley, ripping off his crash helmet as a guy watches the alley entrance. Out swings Spider-Man with the pizza, soaring through the skyscrapers high above land. He spots two kids running onto the street with a huge truck coming their way, tosses the pizzas, and swings down to pluck the kids away from the truck, setting them gently on the ground. A man steps onto a balcony and turns to see the pizzas on the balustrade, teasing out a slice as Spider-Man swishes past, grabbing the pizzas. Spider-Man then lands on a nearby building. The man goes to eat the pizza slice, but it’s whipped from his hand by a web. Inside the building Spider-Man landed on, a receptionist sits at a desk in a hallway with black-and-white checkered flooring and looks around upon hearing a noise, seeing a cupboard door opening. From it emerges Peter, carrying the pizzas, as brooms fall out behind him. Chewing her gum intently, the receptionist watches as he struggles to push the mops and brushes back inside, and with one final thrust, Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it's some spider's web. The receptionist eyes him curiously as he pulls the stretchy, silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Set against a somber azure heaven with towering alabaster and gilded cumulus, a female in Grecian-style garments holds aloft a gleaming beacon as sheets of graphic periodicals manifest, followed by a spider's lattice behind characters that disassemble and disappear from the display. Depictions of the principal performers are exhibited, showing Peter Parker and his new brawny form, then as the archetype Spider-Man and the grappling verdant cage. Peter fails to halt a burglar and is observed crouching by his dying uncle, leading to the origins of the Spider-Man attire, followed by additional titles. Spider-Man stands over Norman Osborn as Harry enters the chamber, and Peter Parker is at his Uncle Ben's graveside. Peter departs from MJ in the cemetery, later gazing at an advertisement of MJ, the visage of the parfumerie Emma Rose, while employed as a pizza delivery boy. Peter stares vacantly amid vehicles at a deadlock and, on his scooter, weaves his path through automobiles and yellow taxis as a cab pulls out ahead of him. Stacked on the rear of his scooter are pizzas. A cab halts ahead of him, and he swerves around it, observing the lights change as a bus goes by in front. He glances up at the chronometer, and another moment ticks by. Now on foot, Peter dashes into an alley, removing his crash helmet as a guy observes the alley entry. Out swings Spider-Man with the pizza, soaring through the skyscrapers high above terrain. He notices two youngsters sprinting onto the avenue with a massive lorry coming their direction, tosses the pizzas, and swings down to snatch the youngsters from the vehicle, setting them softly on the surface. A gentleman steps onto a veranda and turns to see the pizzas on the balustrade, teasing out a slice as Spider-Man swishes past, grabbing the pizzas. Spider-Man then lands on a nearby edifice. The gentleman goes to consume the pizza slice, but it’s seized from his grasp by a web. Inside the edifice Spider-Man landed on, a receptionist sits at a workstation in a corridor with monochrome checkered flooring and looks around upon hearing a disturbance, seeing a cupboard door opening. From it emerges Peter, carrying the pizzas, as brooms topple out afterward. Chewing her gum intently, the receptionist watches as he struggles to push the mops and brushes back inside, and with one final shove, Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it’s some spider's web. The receptionist eyes him inquisitively as he pulls the stretchy, silky material off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Set against a moody blue sky with towering white and gold clouds, a shining torch is held aloft by a woman in Grecian-style robes as pages of comic magazines appear, followed by letters that break up and vanish from the screen behind a spider's web. The principal actors display images, showing Peter Parker and his new muscular body, then the prototype Spider-Man and the wrestling green cage. Peter fails to stop a thief and kneels by his dying uncle, which leads to the beginnings of the Spider-Man costume, followed by more titles. Norman Osborn is stood over by Spider-Man as the room is walked into by Harry, and at his Uncle Ben's graveside stands Peter Parker. From MJ in the graveyard, Peter walks away, later gazing at a poster of MJ, the face of the parfumerie Emma Rose, while he works as a pizza boy. Amid traffic at a standstill, Peter gazes blankly and, on his moped, his way is weaved through cars and yellow cabs as a taxi pulls out in front of him. On the back of his moped, pizzas are stacked. In front of him, a taxi is stopped, and around it, he swings, seeing the lights change as a bus passes in front. He looks up at the clock as another minute ticks by. Now on foot, into an alley runs Peter, ripping off his crash helmet as the alley entrance is watched by a guy. Spider-Man, with the pizza, swings out, soaring through the skyscrapers high above land. Two kids running onto the street with a huge truck coming their way are spotted by him; the pizzas are tossed, and down he swings to pluck the kids away from the truck, setting them on the ground gently. Onto a balcony steps a man and turns to see the pizzas on the balustrade, teasing out a slice as Spider-Man swishes past and grabs the pizzas. On a nearby building, Spider-Man lands. The pizza slice is gone from the man's hand, whipped by a web. Inside the building Spider-Man landed on, a receptionist sits at a desk in a hallway with black-and-white checkered flooring and looks around upon hearing a noise, seeing a cupboard door open. From it, Peter emerges, carrying the pizzas, as brooms fall out behind him. Chewing her gum intently, the receptionist watches as back inside he struggles to push the mops and brushes, and with one final thrust, back the brooms are pushed and the door is slammed by Peter. The pizza boxes are picked up by him, and he notices something stuck to the top—it’s some spider’s web. The receptionist eyes him curiously as off he pulls the stretchy, silky substance and stuffs it in the back pocket of his jeans. Up to the desk, he then strides, and on it, he lays the pizzas."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Under a moody blue sky with towering white and gold clouds, a woman in Grecian robes holds a torch as comic magazine pages appear, followed by a spider's web behind disappearing letters. Images show Peter Parker's new muscular body, his prototype Spider-Man look, and the wrestling green cage. Peter fails to stop a thief and kneels by his dying uncle, leading to the Spider-Man costume. Spider-Man stands over Norman Osborn as Harry enters, and Peter is at his Uncle Ben's grave. Peter walks away from MJ in the graveyard and later gazes at an MJ poster while working as a pizza boy. Amid traffic, he weaves through cars on his moped as pizzas stack on the back. A taxi stops in front, and he swings around, watching the lights change. On foot, Peter runs into an alley, removing his helmet as a man observes. Spider-Man swings out with the pizza, spotting two kids in the street with a truck approaching. He tosses the pizzas, saves the kids, and lands them safely. A man on a balcony finds pizzas, but Spider-Man retrieves them with a web. Inside, a receptionist hears a noise and sees Peter emerge with pizzas. As brooms fall, Peter struggles to replace them, noticing a spider's web on the pizza boxes. The receptionist watches as he removes the web and places the pizzas on the desk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Against a moody sky, a woman in Grecian robes holds a torch as comic pages appear, followed by a spider's web that vanishes. Images show Peter Parker's transformation into Spider-Man and his wrestling debut. Peter fails to stop a thief and kneels by his dying uncle, leading to Spider-Man's beginnings. Spider-Man confronts Norman Osborn, with Harry present, and Peter mourns at Uncle Ben's grave. Walking away from MJ, Peter later sees MJ's perfume ad while delivering pizzas. Amid traffic, he maneuvers his moped, dodging vehicles, and checks the time. On foot, he enters an alley, discarding his helmet. Spider-Man emerges, swinging through skyscrapers, saving two kids from a truck. A man on a balcony finds the pizzas, and Spider-Man retrieves them. He lands on a building, webs the man's slice away. Inside, a receptionist sees Peter emerge from a cupboard with pizzas, struggling with fallen brooms. He removes a spider's web from a pizza box, then places it on the desk."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Set against the backdrop of a moody blue sky adorned with towering, cumulus clouds that shimmer in white and gold hues, a woman draped in Grecian-style robes gracefully holds aloft a brilliantly shining torch. In this cinematic opening, pages of comic magazines gradually appear, followed by the intricate pattern of a spider's web which forms behind letters that dramatically break up and then vanish from the screen. As the scene unfolds, images of the principal actors are displayed, prominently featuring Peter Parker and showcasing his newly acquired muscular physique. This is followed by images of him as the prototype Spider-Man grappling within the confines of a wrestling green cage. Peter's moment of failure, where he doesn't manage to stop a thief, is poignantly captured as he is depicted kneeling by his dying uncle, setting the stage for the nascent creation of the Spider-Man costume, followed by additional titles.\n\nIn the unfolding narrative, Spider-Man stands tall over Norman Osborn as Harry enters the room, adding a layer of tension, and then Peter Parker is poignantly depicted standing at the graveside of his Uncle Ben. In a somber moment, Peter walks away from MJ in the graveyard, and later, he is seen gazing wistfully at a poster of MJ, the prominent face of the parfumerie Emma Rose, while simultaneously juggling his job as a pizza delivery boy. Amidst a cityscape where traffic is at a standstill, Peter gazes blankly into the distance. Perched on his moped, he purposefully weaves his way through a sea of cars and iconic yellow cabs, skillfully maneuvering as a taxi pulls out unexpectedly in front of him. On the back of his trusty moped, a stack of pizzas threatens to topple over. A taxi grinds to a halt in front of him, forcing him to swing around it. He watches as the traffic lights change and a city bus barrels past him. As he looks up at the clock, another minute slips by inexorably.\n\nTransitioning from moped to foot, Peter dashes into an alleyway, ripping off his crash helmet in haste while a bystander curiously observes from the alley entrance. In a breathtaking display, Spider-Man swings out dramatically with the pizzas in hand, soaring through the vast expanse of skyscrapers high above the urban landscape. His keen senses spot two children darting onto the street with a massive truck barreling toward them. In a heroic act, he tosses the pizzas aside and swings down, deftly plucking the kids away from danger and setting them gently on the ground to safety. Meanwhile, a man casually steps out onto a balcony and turns just in time to see the pizzas neatly perched on the railing. Playfully, he teases out a slice just as Spider-Man swoops past, swiftly reclaiming the pizzas. In another smooth motion, Spider-Man lands expertly on a nearby building.\n\nThe curious man on the balcony attempts to bite into his pizza slice, only for it to be snatched away by a web, leaving him bemused. Inside the building where Spider-Man has taken refuge, a receptionist is seated at her desk in a hallway characterized by black-and-white checkered flooring. She peers around curiously upon hearing an unfamiliar noise, observing a cupboard door creak open. Emerging from the cupboard is Peter, dutifully carrying the pizzas, while brooms and mops tumble out behind him. The receptionist, chewing her gum with measured intent, watches as Peter struggles to return the cleaning tools to their rightful place. With a final determined thrust, he nudges the brooms back inside and slams the door shut with satisfaction. He picks up the pizza boxes once more, noticing a sticky, silky spider's web clinging to the top. Intrigued yet slightly suspicious, the receptionist eyes him as he pulls off the stretchy web and stuffs it discreetly into the back pocket of his jeans. Finally, with a confident stride, he approaches the desk and places the pizzas upon it, concluding his eventful delivery."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Set against the awe-inspiring backdrop of a moody blue sky, which is artfully adorned with towering cumulus clouds that shimmer with ethereal white and gold hues, a woman elegantly draped in majestic Grecian-style robes is depicted gracefully holding aloft a brilliantly radiant torch. In this cinematic opening scene, the pages of comic magazines begin to gradually appear, seamlessly followed by the intricate pattern of a spider's web. This web forms behind letters that seem to dramatically fracture and then evaporate from the screen. As this scene unfolds, images of the principal actors are displayed, prominently featuring the iconic figure of Peter Parker and showcasing his newly acquired muscular physique. This sequence continues with images of him in his role as the prototype Spider-Man, grappling within the confines of a wrestling green cage. Peter's critical moment of failure, where he is unable to stop a thief, is poignantly captured as he is shown kneeling by his dying uncle, setting the emotional stage for the nascent creation of the Spider-Man costume, followed by additional titles.\n\nIn the advancing narrative, Spider-Man stands tall and imposing over Norman Osborn as Harry enters the room, adding a palpable layer of tension. Subsequently, Peter Parker is poignantly depicted standing at the graveside of his beloved Uncle Ben. In a somber and reflective moment, Peter walks away from MJ in the graveyard, and later, he is seen gazing wistfully at a poster of MJ, who is now the prominent face of the parfumerie Emma Rose, while simultaneously juggling his job as a pizza delivery boy. Amidst a sprawling urban cityscape where traffic is at a relentless standstill, Peter gazes blankly into the distance. Perched on his trusty moped, he purposefully weaves his way through a sea of cars and iconic yellow cabs, skillfully maneuvering as a taxi pulls out unexpectedly in front of him. Balanced on the back of his moped, a precarious stack of pizzas threatens to topple over with every motion. A taxi grinds to a sudden halt in front of him, forcing him to deftly swing around it. He observes intently as the traffic lights change and a city bus barrels past him with formidable speed. As he glances up at the clock, another precious minute slips by inexorably.\n\nMaking a swift transition from moped to foot, Peter dashes energetically into an alleyway, ripping off his crash helmet in a hurry, while a curious bystander observes from the entrance of the alley. In a breathtaking display of agility, Spider-Man swings out dramatically with the pizzas in hand, soaring through the vast expanse of soaring skyscrapers high above the bustling urban landscape. His keen senses alert him to the sight of two children darting onto the street with a massive truck barreling toward them. In a heroic and quick-thinking act, he tosses the pizzas aside and swings down, deftly plucking the kids away from the impending danger and gently setting them safely on the ground. Meanwhile, a man casually steps out onto a balcony and turns just in time to see the pizzas neatly perched on the railing. Playfully, he teases out a slice just as Spider-Man swoops past, swiftly reclaiming the pizzas in a deft motion. In another fluid maneuver, Spider-Man lands expertly on a nearby building.\n\nThe curious man on the balcony attempts to bite into his pizza slice, only for it to be snatched away unexpectedly by a web, leaving him bemused. Inside the building where Spider-Man has taken refuge, a receptionist is seated at her desk in a hallway characterized by black-and-white checkered flooring. She peers around curiously upon hearing an unfamiliar noise, observing a cupboard door slowly creak open. Emerging from the cupboard is Peter, dutifully carrying the pizzas, while brooms and mops tumble out in a chaotic fashion behind him. The receptionist, chewing her gum with measured intent, watches as Peter struggles to return the cleaning tools to their rightful place. With a final determined thrust, he nudges the stubborn brooms back inside and slams the door shut with satisfaction. He picks up the pizza boxes once more, noticing a sticky, silky spider's web clinging tenaciously to the top. Intrigued yet slightly suspicious, the receptionist eyes him intently as he pulls off the stretchy web and stuffs it discreetly into the back pocket of his jeans. Finally, with a confident stride, he approaches the desk and places the pizzas upon it, concluding his eventful and adventurous delivery."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Set against a moody blue sky filled with towering white and gold clouds, a woman clad in Grecian-style robes stands with grace and authority, holding a shining torch high above her head. The camera focuses on the torch as pages from comic magazines begin to materialize one by one, spinning into view before a spider's web creeps into focus, and letters gradually appear, only to fracture and dissolve into nothingness from the screen. Next, a sequence of images showcases the principal characters: first, we see Peter Parker, his once-lean frame now transformed into a muscular physique, providing a glimpse of his evolution into the prototype Spider-Man as he grapples with the green cage used in wrestling. In a haunting scene, Peter is seen faltering in his efforts to stop a thief, which leads to a poignant moment where he kneels beside his dying uncle, pain etched across his face. This moment catalyzes the inception of the Spider-Man costume, followed seamlessly by the appearance of further titles across the screen. The narrative shifts to Spider-Man standing dominantly over Norman Osborn, while in the background, Harry enters the room unassumingly. Smoothly transitioning, the scene places Peter Parker solemnly at his Uncle Ben's graveside, where he later distances himself from MJ in the graveyard with palpable sadness. As time moves forward, Peter contemplates a poster of MJ, who now graces the campaign for the parfumerie Emma Rose, while he dutifully carries out his job as a pizza delivery boy. In the midst of traffic at a standstill, Peter gazes blankly, lost in thought, until he maneuvers skillfully through the congested street on his moped, evading yellow cabs deftly. As a taxi abruptly halts before him, Peter nimbly swings around it, his eyes catching the traffic lights changing just as a bus lumbers across his path. Glancing up at the clock, he registers another minute ticking away. Abruptly on foot, he dashes into a shadowy alley, ripping off his crash helmet in haste as a bystander casts a curious glance towards the alley's entrance. Suddenly, Spider-Man swings out with pizzas still in hand, propelling himself through the air, soaring above the cityscape with astonishing agility. Spotting two children in peril as they dash onto the street, unaware of an oncoming truck, he swiftly tosses the pizzas mid-air and swoops down, deftly lifting the children to safety and setting them securely on solid ground. A man stepping onto a nearby balcony turns to a peculiar sight—pizzas now perch on the balustrade, enticing him to tease out a slice, just as Spider-Man swooshes past, snatching the pizzas back. With acrobatic finesse, Spider-Man lands on a building not far away. The man on the balcony, baffled, attempts to take a bite of the slice of pizza in his hand, only for it to be spirited away with a quick flick of a web. Inside the building that Spider-Man alighted upon, a receptionist sits at her desk against a hallway lined with black-and-white checkered flooring; she looks up, startled by a sudden noise, just in time to see a cupboard door creak open. Emerging from the cupboard is Peter, pizzas in hand, as an avalanche of brooms tumbles out after him. The receptionist, chewing her gum with intense focus, watches as Peter juggles to push the mops and brushes back inside the cramped space, finally managing with a decisive slam of the door. As he gathers the pizza boxes, he notices a sticky remnant clinging to the top—some strands of a spider’s web. The receptionist’s eyes follow him with curiosity as he deftly peels away the stretchy, silky substance, tucking it discreetly into the back pocket of his jeans. With a composed stride, he approaches the desk and sets the pizzas down, signaling his task's completion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Set against a moody blue sky with towering white and gold clouds, a woman in Grecian-style robes raises a shining torch as comic magazine pages and a spider's web appear, culminating in letters that break up and vanish. The principal actors' images display Peter Parker's transformation into Spider-Man, with scenes depicting the wrestling ring, his failure to stop a thief, and his grief at his dying uncle's side. This series of images leads into the emergence of the Spider-Man costume, followed by more titles. Spider-Man stands over Norman Osborn as Harry Osborn enters the room, transitioning to Peter at Uncle Ben's graveside. Peter then walks away from MJ in the graveyard and later gazes at her poster while working as a pizza delivery boy. Amidst standstill traffic, Peter maneuvers his moped through cars until a taxi pulls out in front of him. Dodging it with a stack of pizzas on the back of his moped, Peter notices the changing lights and checks the time as a bus passes by. Dismounting, he runs into an alley, removes his helmet, and transitions into Spider-Man. Swinging with the pizzas through the skyscrapers, he saves two children from an oncoming truck by setting them safely on the ground. A man on a nearby balcony teases a slice of pizza from the balustrade, but Spider-Man, soaring past, retrieves the pizzas. Landing on a nearby building, Spider-Man reclaims the slice with a web. Inside, a receptionist in a checkered-floored hall hears a noise and watches Peter emerge from a cupboard with the pizzas, awkwardly managing falling brooms before securing them back inside. With a curious glance at the spider's web on the pizza boxes, Peter stuffs the silky material into his pocket and approaches the desk, placing the pizzas down."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Set against a moody blue sky with towering white and gold clouds, reminiscent of a cinematic backdrop that evokes grandeur and drama, a woman in Grecian-style robes holds aloft a shining torch, an image widely recognized as the logo of Columbia Pictures, as pages of comic magazines, a nod to the comics published by Marvel Comics since the 1960s, appear. This is followed by a spider's web behind letters that break up and vanish from the screen, symbolizing Spider-Man's world. Images of the principal actors are displayed, showing Peter Parker, the everyman hero created by Stan Lee and Steve Ditko, and his new muscular body gained after a radioactive spider bite, then appears as the prototype Spider-Man in his early homemade costume in the wrestling green cage, a nod to his first public appearance in comics. Peter fails to stop a thief and is seen kneeling by his dying uncle, a pivotal moment reflecting his failure and Uncle Ben's famous lesson, \"With great power comes great responsibility,\" leading to the beginnings of the Spider-Man costume, followed by more titles. Spider-Man stands over Norman Osborn, a complex character who becomes the Green Goblin, as Harry walks into the room. Peter Parker later is at his Uncle Ben's graveside, a heart-wrenching scene of loss and consequence. Peter walks away from MJ, Mary Jane Watson, his love interest, in the graveyard, later gazing at a poster of MJ, the face of the parfumerie Emma Rose, a fictional brand, while working as a pizza boy to make ends meet in busy New York City. Peter gazes blankly amid traffic at a standstill and, on his moped, weaves his way through cars and yellow cabs, iconic to New York's bustling streets, as a taxi pulls out in front of him. Stacked on the back of his moped are pizzas, part of his job at Joe's Pizza, a fictional pizzeria. A taxi stops in front of him, and he swings around it, seeing the lights change as a bus passes in front. He looks up at the clock, recognizing the urgency of time, and another minute ticks by. Now on foot, Peter runs into an alley, ripping off his crash helmet as a guy, a street vendor selling hot dogs, watches the alley entrance. Out swings Spider-Man with the pizza, soaring through the skyscrapers high above the cityscape, a testament to his agility and speed. He spots two kids running onto the street with a huge truck coming their way, tosses the pizzas skillfully, and swings down to pluck the kids away from the truck, setting them gently on the ground, ensuring their safety. A man steps onto a balcony with an espresso in hand, typical of city dwellers, and turns to see the pizzas on the balustrade, teasing out a slice as Spider-Man swishes past, grabbing the pizzas. Spider-Man then lands on a nearby building, showcasing his sticky fingers and quick reflexes. The man goes to eat the pizza slice, but it’s whipped from his hand by a web, in a playful act by Spider-Man. Inside the building Spider-Man landed on, a receptionist, employed at a law firm famous for its high-profile cases in the Marvel universe, sits at a desk in a hallway with black-and-white checkered flooring and looks around upon hearing a noise, seeing a cupboard door opening. From it emerges Peter, carrying the pizzas, as brooms fall out behind him in a comedic moment. Chewing her gum intently, the receptionist watches as he struggles to push the mops and brushes back inside, and with one final thrust, Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it's some spider's web, a hint of his alter-ego. The receptionist eyes him curiously as he pulls the stretchy, silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it, maintaining his double life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "From it emerges Peter carrying the pizzas as brooms fall out behind him Out swings SpiderMan with the pizza soaring through the skyscrapers high above land Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy The man goes to eat the pizza slice but it is whipped from his hand by a web Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him Stacked on the back of his moped are pizzas A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front He looks up at the clock and another minute ticks by Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance Out swings SpiderMan with the pizza soaring through the skyscrapers high above land He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground He looks up at the clock and another minute ticks by A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas SpiderMan then lands on a nearby building The man goes to eat the pizza slice but it is whipped from his hand by a web Inside the building SpiderMan landed on a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans From it emerges Peter carrying the pizzas as brooms fall out behind him Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door He picks up the pizza boxes and notices something stuck to the top—it is some spider's web The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans He then strides up to the desk and lays the pizzas on it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage. Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles. SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside. Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy. Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him. Stacked on the back of his moped are pizzas. A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front. He looks up at the clock and another minute ticks by. Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance. Out swings SpiderMan with the pizza soaring through the skyscrapers high above land. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground. A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas. SpiderMan then lands on a nearby building. The man goes to eat the pizza slice but it is whipped from his hand by a web. Inside the building SpiderMan landed on. a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening. From it emerges Peter carrying the pizzas as brooms fall out behind him. Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it is some spider's web. The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage. Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles. SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside. Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy. Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him. Stacked on the back of his moped are pizzas. A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front. He looks up at the clock and another minute ticks by. Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance. Out swings SpiderMan with the pizza soaring through the skyscrapers high above land. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground. A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas. SpiderMan then lands on a nearby building. The man goes to eat the pizza slice but it is whipped from his hand by a web. Inside the building SpiderMan landed on. a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening. From it emerges Peter carrying the pizzas as brooms fall out behind him. Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it is some spider's web. The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage. Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles. SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside. Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy. Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him. From it emerges Peter carrying the pizzas as brooms fall out behind him. Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door. He picks up the pizza boxes and notices something stuck to the top—it is some spider's web. The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage. Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles. The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the pizzas on it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Set against a moody blue sky with towering white and gold clouds, a cat in Grecian-style robes holds aloft a shining torch as pages of comic magazines appear, followed by a rabbit's web behind letters that break up and vanish from the screen. Images of the principal actors are displayed, showing a squirrel and its new muscular body, then as the prototype Spider-Goat and the wrestling green cage. A squirrel fails to stop a thief and is seen kneeling by its dying uncle, leading to the beginnings of the Spider-Goat costume, followed by more titles. Spider-Goat stands over a turtle as a horse walks into the room, and a squirrel is at its Uncle Ben's graveside. A squirrel walks away from a penguin in the graveyard, later gazing at a poster of a penguin, the face of the parfumerie Emma Rose, while working as a pizza boy. A squirrel gazes blankly amid traffic at a standstill and, on its moped, weaves its way through cars and yellow cabs as a taxi pulls out in front of it. Stacked on the back of its moped are pizzas. A taxi stops in front of it, and it swings around it, seeing the lights change as a bus passes in front. It looks up at the clock, and another minute ticks by. Now on foot, a squirrel runs into an alley, ripping off its crash helmet as a dog watches the alley entrance. Out swings Spider-Goat with the pizza, soaring through the skyscrapers high above land. It spots two parrots running onto the street with a huge truck coming their way, tosses the pizzas, and swings down to pluck the parrots away from the truck, setting them gently on the ground. A lion steps onto a balcony and turns to see the pizzas on the balustrade, teasing out a slice as Spider-Goat swishes past, grabbing the pizzas. Spider-Goat then lands on a nearby building. The lion goes to eat the pizza slice, but it’s whipped from its hand by a web. Inside the building Spider-Goat landed on, a hedgehog sits at a desk in a hallway with black-and-white checkered flooring and looks around upon hearing a noise, seeing a cupboard door opening. From it emerges a squirrel, carrying the pizzas, as brooms fall out behind it. Chewing its gum intently, the hedgehog watches as it struggles to push the mops and brushes back inside, and with one final thrust, a squirrel pushes back the brooms and slams the door. It picks up the pizza boxes and notices something stuck to the top—it's some rabbit's web. The hedgehog eyes it curiously as it pulls the stretchy, silky substance off and stuffs it in the back pocket of its jeans. It then strides up to the desk and lays the pizzas on it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Set against a moody green sea with towering silver and bronze mountains, a woman in Victorian-style dresses holds aloft a glowing lantern as pages of fairy tales appear, followed by a honeycomb behind letters that dissolve and disappear from the screen. Images of the principal actors are displayed, showing Peter Parker and his new sleek motorcycle, then as the prototype Spider-Man and the fighting red ring. Peter fails to stop a pickpocket and is seen kneeling by his injured uncle, leading to the beginnings of the Spider-Man uniform, followed by more credits. Spider-Man stands over Norman Osborn as Harry walks into the space, and Peter Parker is at his Uncle Ben's tombstone. Peter walks away from MJ in the cemetery, later gazing at a mural of MJ, the face of the boutique Emma Rose, while working as an ice cream vendor. Peter gazes blankly amid traffic at a crawl and, on his bicycle, weaves his way through trucks and blue scooters as a limousine pulls out in front of him. Stacked on the back of his bicycle are ice cream cones. A limousine stops in front of him, and he swerves around it, seeing the lights change as a tram passes in front. He looks up at the thermometer, and another degree ticks by. Now on foot, Peter runs into an arcade, ripping off his baseball cap as a guy watches the arcade entrance. Out swings Spider-Man with the ice creams, soaring through the skyscrapers high above fields. He spots two kids running onto the plaza with a massive bulldozer coming their way, tosses the ice creams, and swings down to lift the kids away from the bulldozer, setting them gently on the steps. A man steps onto a terrace and turns to see the ice creams on the banister, teasing out a scoop as Spider-Man swishes past, grabbing the ice creams. Spider-Man then lands on a nearby tower. The man goes to eat the ice cream scoop, but it’s whipped from his hand by a web. Inside the tower Spider-Man landed on, a receptionist sits at a desk in a foyer with red-and-white striped wallpaper and looks around upon hearing a noise, seeing a curtain rod opening. From it emerges Peter, carrying the ice creams, as brooms fall out behind him. Chewing her gum intently, the receptionist watches as he struggles to push the mops and brushes back inside, and with one final thrust, Peter pushes back the brooms and slams the rod. He picks up the ice cream cones and notices something stuck to the top—it's some candy floss. The receptionist eyes him curiously as he pulls the stretchy, silky substance off and stuffs it in the back pocket of his jeans. He then strides up to the desk and lays the ice creams on it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Set against a moody blue sky with towering white and gold clouds, a woman in Grecian-style robes waves a shining torch as pages of comic magazines vanish, followed by a spider's web that explodes and reforms on the screen. Images of the principal actors are revealed, showing Peter Parker and his new muscular body, then as the prototype Spider-Man and the wrestling green cage. Peter succeeds in encouraging a thief and is seen dancing by his joyful uncle, leading to the dismantling of the Spider-Man costume, followed by more titles. Spider-Man crouches over Norman Osborn as Harry skips into the room, and Peter Parker is at his Uncle Ben's petting zoo. Peter sprints away from MJ in the aquarium, later singing to a poster of MJ, the face of the parfumerie Emma Rose, while relaxing as a pizza boy. Peter smiles blankly amid traffic at a standstill and, on his moped, rolls his way through cars and yellow cabs as a taxi bounces out in front of him. Stacked on the back of his moped are pizzas. A taxi reverses in front of him, and he floats around it, seeing the lights blink as a bus dances in front. He glances up at the clock, and another minute flutters by. Now on foot, Peter stumbles into an alley, tossing off his crash helmet as a guy surveys the alley entrance. Out dives Spider-Man with the pizza, bouncing through the skyscrapers high above land. He spots two kids skipping onto the street with a huge truck rolling their way, catapults the pizzas, and tumbles down to twirl the kids away from the truck, setting them gently on the ground. A man steps onto a balcony and spins to see the pizzas on the balustrade, whisking out a slice as Spider-Man flutters past, tossing the pizzas. Spider-Man then glides onto a nearby building. The man goes to nibble the pizza slice, but it’s scooped from his hand by a web. Inside the building Spider-Man landed on, a receptionist stands at a desk in a hallway with black-and-white checkered flooring and nods around upon hearing a noise, spotting a cupboard door swinging. From it emerges Peter, juggling the pizzas, as brooms rattle out behind him. Chewing her gum intently, the receptionist observes as he tumbles to push the mops and brushes back inside, and with one final slam, Peter shoves back the brooms and closes the door. He lifts the pizza boxes and discovers something clinging to the top—it's some spider's web. The receptionist peers at him curiously as he tears the stretchy, silky substance off and flicks it in the back pocket of his jeans. He then skips up to the desk and places the pizzas on it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Set against a moody orange ocean with towering bronze and silver mountains, a tiger in Roman-style armor holds aloft a gleaming mirror as leaves of mystery novels appear, followed by a butterfly's wings behind numbers that crumble and vanish from the screen. Images of the supporting musicians are displayed, showing Lucy Granger and her new athletic shadow, then as the prototype Hawk-Woman and the dancing purple pond. Lucy fails to stop a frog and is seen kneeling by her fading cousin, leading to the beginnings of the Hawk-Woman outfit, followed by more banners. Hawk-Woman stands over Olivia Johnson as Gerald strolls into the forest, and Lucy Granger is at her Aunt Sue's riverside. Lucy strolls away from Amy in the orchard, later staring at a billboard of Amy, the smile of the boutique Lily Meadow, while working as a mail carrier. Lucy stares blankly amid a parade at a frozen state and, on her scooter, navigates her path through floats and red rickshaws as a bicycle emerges in front of her. Stacked on the back of her scooter are cupcakes. A bicycle halts in front of her, and she loops around it, noticing the signs change as a train rolls ahead. She glances up at the sundial, and another second ticks past. Now on foot, Lucy dashes into a garage, tearing off her sunhat as a bird observes the garage entrance. Out swings Hawk-Woman with the cupcakes, soaring through the canyons high above ground. She notices two puppies scampering onto the sidewalk with an enormous wagon coming their way, tosses the cupcakes, and swings down to scoop the puppies away from the wagon, placing them softly on the meadow. A woman steps onto a terrace and turns to see the cupcakes on the railing, teasing out a muffin as Hawk-Woman swoops past, snatching the cupcakes. Hawk-Woman then lands on a nearby hilltop. The woman goes to take a bite of the muffin, but it’s snatched from her grasp by a rope. Inside the structure Hawk-Woman landed on, a librarian sits at a counter in a corridor with red-and-white tiled ceiling and looks about upon hearing a sound, seeing a closet lid creaking. From it emerges Lucy, clutching the cupcakes, as umbrellas tumble out behind her. Popping her bubble intently, the librarian observes as she wrestles to shove the hats and scarves back inside, and with one final push, Lucy shoves back the umbrellas and slams the lid. She grabs the cupcake containers and perceives something adhered to the lid—it's some butterfly's wings. The librarian watches her curiously as she peels the stretchy, smooth material off and tucks it in the back pocket of her overalls. She then strides up to the counter and places the cupcakes on it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Set against a moody blue sky with towering white and gold clouds, a cat in Victorian-style attire waves a glowing scepter as pages of fashion catalogs appear, followed by a butterfly's trail behind symbols that scatter and dissolve from the screen. Images of the main performers are displayed, revealing James Morrison and his new powerful physique, then as the prototype Eagle-Man and the climbing pink cage. James fails to catch a bird and is seen crouching by his injured rabbit, leading to the beginnings of the Eagle-Man outfit, followed by more credits. Eagle-Man hovers over Maxwell Greene as Carl skips into the room, and James Morrison is at his Aunt May's graveside. James skips away from Liz in the graveyard, later admiring a photograph of Liz, the face of the bistro Bella Flora, while working as a courier. James stares blankly amid traffic at a standstill and, on his unicycle, zigzags his way through vans and blue sedans as a motorcycle cuts in front of him. Stacked on the back of his unicycle are sandwiches. A motorcycle halts in front of him, and he glides around it, noticing the lights shift as a tram passes in front. He looks up at the clock, and another minute slips by. Now on foot, James dashes into an alley, peeling off his backpack as a woman watches the alley entrance. Out swings Eagle-Man with the sandwiches, gliding through the skyscrapers high above ground. He spots two cats darting onto the avenue with a massive car heading their way, flings the sandwiches, and swoops down to snatch the cats away from the car, setting them lightly on the grass. A lady steps onto a veranda and turns to spot the sandwiches on the railing, plucking out a wrap as Eagle-Man zips past, snatching the sandwiches. Eagle-Man then perches on a nearby rooftop. The lady goes to nibble the wrap, but it’s snatched from her hand by a breeze. Inside the building Eagle-Man landed on, a guard sits at a console in a hallway with black-and-white checkered flooring and glances around upon hearing a sound, seeing a drawer opening. From it pops James, clutching the sandwiches, as umbrellas tumble out behind him. Fiddling with her earring intently, the guard watches as he fumbles to shove the umbrellas and coats back inside, and with one final push, James shoves back the umbrellas and seals the drawer. He grabs the sandwich bags and notices something clinging to the top—it's some butterfly's trail. The guard sizes him up curiously as he peels the stretchy, silky material off and tucks it in the back pocket of his trousers. He then walks up to the console and places the sandwiches on it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Set against a somber purple horizon with towering silver and crimson clouds, a woman in Roman-style garments raises a gleaming lantern as covers of travel brochures materialize, followed by an ant's nest behind symbols that disassemble and dissolve from the screen. Visuals of the main actors are displayed, showing Peter Parker and his newly athletic physique, then as the model Bat-Man and the juggling blue tent. Peter fails to catch a burglar and is observed crouching by his ailing aunt, leading to the origins of the Bat-Man outfit, followed by additional credits. Bat-Man stands over Norman Osborn as Harry strides into the chamber, and Peter Parker is at his Aunt May's gravesite. Peter drifts away from MJ in the cemetery, subsequently staring at a billboard of MJ, the image of the boutique Diana Silk, while working as an ice cream vendor. Peter stares blankly amid bicycles at a standstill and, on his scooter, zigzags his way through motorbikes and blue vans as a bus pulls out in front of him. Piled on the back of his scooter are ice creams. A bus halts in front of him, and he spins around it, seeing the signals change as a trolley glides in front. He glances up at the sundial, and another moment drifts by. Now on foot, Peter dashes into a corridor, tearing off his sun hat as a guy observes the corridor entrance. Out leaps Bat-Man with the ice creams, floating through the apartment blocks high above ground. He notices two dogs dashing onto the road with a giant van approaching their way, tosses the ice creams, and flies down to scoop the dogs away from the van, placing them gently on the grass. A man steps onto a veranda and turns to see the ice creams on the railing, drawing out a cone as Bat-Man glides past, snatching the ice creams. Bat-Man then touches down on a neighboring tower. The man goes to nibble the ice cream cone, but it’s yanked from his grip by a cable. Inside the building Bat-Man perched on, a secretary sits at a counter in a hallway with black-and-white striped carpeting and glances around upon hearing a clatter, spotting a cabinet door creaking open. From it emerges Peter, juggling the ice creams, as umbrellas tumble out behind him. Chewing her pen thoughtfully, the secretary watches as he struggles to shove the canes and parasols back inside, and with one final thrust, Peter shoves back the umbrellas and slams the door. He lifts the ice cream cones and notices something stuck to the top—it's some ant's nest. The secretary observes him suspiciously as he plucks the flexible, fibrous material off and tucks it in the back pocket of his shorts. He then marches up to the counter and places the ice creams on it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Set against a vibrant green sea with towering red and silver mountains, a gardener in Roman-style armor lifts high a gleaming lantern as sheets of mystery novels vanish, followed by a butterfly's cocoon in front of numbers that scatter and reappear on the canvas. Paintings of the secondary dancers are exhibited, showing Oliver Twist and his new miniature bicycle, then as the model Inventor-Man and the painting yellow gate. Oliver succeeds in catching a lion and is seen standing by his laughing aunt, leading to the completion of the Inventor-Man gadget, followed by more numbers. Inventor-Man kneels beside Jonathan Swift as Lizzie dives into the lake, and Oliver Twist is at his Aunt May's waterside. Oliver runs toward KL in the meadow, later peering at an advertisement of KL, the symbol of the ceramics factory Lily White, while working as a courier cat. Oliver stares blankly amid shoppers at a fairground and, on his skateboard, glides his way past dragons and green tractors as a chariot pulls up beside him. Balanced on the rear of his skateboard are cakes. A chariot stops beside him, and he floats around it, noticing the shadows shift as a train rushes beneath. He glances down at the watch, and another hour passes silently. Now climbing, Oliver jogs into a tunnel, removing his straw hat as a lady observes the tunnel exit. Out swings Inventor-Man with a cake, gliding past the clouds high above water. He notices two rabbits hopping onto the trail with a small ship approaching their path, tosses the cakes, and glides down to whisk the rabbits from the ship, setting them softly on the shore. A child steps onto a terrace and spins to see the cakes on the railing, tossing out a doughnut as Inventor-Man drifts past, snatching the cakes. Inventor-Man then lands on a distant mountain. The child attempts to eat the doughnut, but it’s yanked from his grasp by a net. Outside the structure Inventor-Man rested on, a librarian stands at a counter in a corridor with green-and-gray tiled flooring and glances up upon sensing a commotion, perceiving a closet shutter moving. From it surfaces Oliver, bearing the cakes, as mops tumble behind him. Blowing her bubble noisily, the librarian observes as he battles to shove the brooms and rakes back inside, and with one decisive heave, Oliver shoves back the mops and slams the shutter. He gathers the cake boxes and notices something hanging from the side—it’s some butterfly’s cocoon. The librarian eyes him inquisitively as he peels the elastic, fibrous strand off and tucks it into the corner of his backpack. He then marches up to the counter and sets the cakes atop it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Set against a moody sky, a woman in Grecian robes raises a torch, followed by comic magazine pages and a spider's web. Images show Peter Parker's transformation into Spider-Man, highlighting key moments: failing to stop a thief and kneeling by his dying uncle, leading to his costume's beginnings. Spider-Man stands over Norman Osborn with Harry entering, and Peter mourns at Uncle Ben's grave. Peter leaves MJ at the graveside and later, while working as a pizza boy, spots her poster. Navigating traffic on his moped with pizzas, Peter watches a clock tick by. In an alley, he transforms into Spider-Man, swings through skyscrapers, saves kids from a truck, and retrieves pizzas left on a balcony. A man almost eats a slice, but Spider-Man snatches it back with his web. Inside, Peter emerges from a cupboard with pizzas, fixes falling brooms, and removes webbing from a box. The receptionist watches curiously as he places the pizzas on her desk."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He then strides up to the desk and lays the pizzas on it The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans He picks up the pizza boxes and notices something stuck to the top—it is some spider's web Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door From it emerges Peter carrying the pizzas as brooms fall out behind him a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening Inside the building SpiderMan landed on The man goes to eat the pizza slice but it is whipped from his hand by a web SpiderMan then lands on a nearby building A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground Out swings SpiderMan with the pizza soaring through the skyscrapers high above land Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance He looks up at the clock and another minute ticks by A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front Stacked on the back of his moped are pizzas Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He then strides up to the desk and lays the pizzas on it Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles Inside the building SpiderMan landed on Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening He picks up the pizza boxes and notices something stuck to the top—it is some spider's web Stacked on the back of his moped are pizzas SpiderMan then lands on a nearby building Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door The man goes to eat the pizza slice but it is whipped from his hand by a web Out swings SpiderMan with the pizza soaring through the skyscrapers high above land Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy From it emerges Peter carrying the pizzas as brooms fall out behind him A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front He looks up at the clock and another minute ticks by Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He spots two kids running onto the street with a huge truck coming their way tosses the pizzas and swings down to pluck the kids away from the truck setting them gently on the ground A man steps onto a balcony and turns to see the pizzas on the balustrade teasing out a slice as SpiderMan swishes past grabbing the pizzas SpiderMan then lands on a nearby building The man goes to eat the pizza slice but it is whipped from his hand by a web Inside the building SpiderMan landed on a receptionist sits at a desk in a hallway with blackandwhite checkered flooring and looks around upon hearing a noise seeing a cupboard door opening From it emerges Peter carrying the pizzas as brooms fall out behind him Chewing her gum intently the receptionist watches as he struggles to push the mops and brushes back inside and with one final thrust Peter pushes back the brooms and slams the door He picks up the pizza boxes and notices something stuck to the top—it is some spider's web The receptionist eyes him curiously as he pulls the stretchy silky substance off and stuffs it in the back pocket of his jeans He then strides up to the desk and lays the pizzas on it Set against a moody blue sky with towering white and gold clouds a woman in Grecianstyle robes holds aloft a shining torch as pages of comic magazines appear followed by a spider's web behind letters that break up and vanish from the screen Images of the principal actors are displayed showing Peter Parker and his new muscular body then as the prototype SpiderMan and the wrestling green cage Peter fails to stop a thief and is seen kneeling by his dying uncle leading to the beginnings of the SpiderMan costume followed by more titles SpiderMan stands over Norman Osborn as Harry walks into the room and Peter Parker is at his Uncle Ben's graveside Peter walks away from MJ in the graveyard later gazing at a poster of MJ the face of the parfumerie Emma Rose while working as a pizza boy Peter gazes blankly amid traffic at a standstill and on his moped weaves his way through cars and yellow cabs as a taxi pulls out in front of him Stacked on the back of his moped are pizzas A taxi stops in front of him and he swings around it seeing the lights change as a bus passes in front He looks up at the clock and another minute ticks by Now on foot Peter runs into an alley ripping off his crash helmet as a guy watches the alley entrance Out swings SpiderMan with the pizza soaring through the skyscrapers high above land"
        }
      ]
    }
  ]
}