{
  "ground_truth": "Looking scared, Harry hauls back a hinged portrait, dials a combination, and opens the safe behind it. Inside is a huge orb. A limb bundles Harry out of the way. Octavius strides up to the safe, removes his dark specs, and stares at the tritium. Harry fixes his eyes on Spider-Man. He spins round. Octavius has taken the tritium sphere and leaves via the balcony. Harry, a dark and brooding look on his face, picks up a heavy ornamental dagger from the desk beside him. He holds the dagger to his chest and moves towards the unconscious Spider-Man, lying on his back on the couch, his arms and hands bound in front of him. He raises the dagger as Spider-Man stares. He hauls off the mask, then recoils and drops the dagger. Peter flexes and breaks the bonds. He gets to his feet and approaches Harry. Harry shakes his head. There are tears in the seated Harry's eyes as he stares up at Peter. In the reconstructed lab, down by the pier, Octavius stands in the fusion chamber, studying the tritium. MJ, in chains, is tied to a pillar. Octavius lowers his dark glasses and taps on a keyboard. In the fusion chamber, beams of light appear. The tritium glows brightly, illuminating the way for Spider-Man to creep across a beam. Sensing something, Octavius grins. Spider-Man stops above MJ. MJ looks up, smiles, and her smile fades when she turns to face Octavius. A limb punches into the pillar. Spider-Man climbs away. Spider-Man jumps over Octavius and his limbs, but they catch him and fling him up through the ceiling and out into the night sky. Spider-Man shoots a web onto the building and swings back in through a huge oil window, landing on Octavius. They crash through the floorboards into the water below and trade blows. The tritium sphere begins to attract metals to it, including MJ's chains. She hangs in the air, the chains on her leg drawn to the sphere. The pillar to which she's tied buckles and the ropes become free. MJ is pulled towards the sphere. Spider-Man attaches a web to the rope and struggles to pull MJ back from the glowing tritium. The chains on her legs break free and she catapults back to Spider-Man. Octavius is back on the rampage. He tosses Spider-Man against a metal beam. He crashes to the floor, and MJ watches as rubble falls on top of him. Octavius strides over, and one of the limbs lifts Spider-Man and suspends him in mid-air. MJ picks up a piece of timber, sneaks up on Octavius, and is about to hit him when she's punched away. One pincer flicks out a blade.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gazing frightened, Harry pulls back a pivoted picture, rotates a sequence, and unlocks the vault behind it. Within is a massive globe. An arm shoves Harry aside. Octavius marches up to the vault, takes off his dark sunglasses, and gazes at the tritium. Harry fixes his gaze on Spider-Man. He spins around. Octavius has taken the tritium sphere and exits via the terrace. Harry, a dark and brooding expression on his visage, picks up a hefty decorative dagger from the table beside him. He holds the dagger to his torso and approaches the insensible Spider-Man, lying on his spine on the divan, his limbs and hands secured in front of him. He elevates the dagger as Spider-Man gazes. He removes the mask, then recoils and drops the dagger. Peter flexes and snaps the restraints. He rises to his feet and nears Harry. Harry shakes his cranium. There are tears in the seated Harry's eyes as he gazes up at Peter. In the rebuilt laboratory, down by the wharf, Octavius stands in the fusion chamber, examining the tritium. MJ, in shackles, is tied to a column. Octavius lowers his dark spectacles and taps on a keypad. In the fusion chamber, rays of light emerge. The tritium glows brightly, lighting the path for Spider-Man to slink across a beam. Perceiving something, Octavius smirks. Spider-Man halts above MJ. MJ looks up, beams, and her beam diminishes when she turns to face Octavius. An arm punches into the column. Spider-Man ascends away. Spider-Man leaps over Octavius and his arms, but they snatch him and hurl him up through the ceiling and out into the night sky. Spider-Man shoots a filament onto the structure and swings back in through a huge oil casement, landing on Octavius. They crash through the floorboards into the water beneath and exchange blows. The tritium sphere begins to attract alloys to it, including MJ's shackles. She dangles in the air, the shackles on her leg drawn to the sphere. The column to which she's tied bends and the ropes become loose. MJ is pulled towards the sphere. Spider-Man attaches a filament to the cord and struggles to pull MJ back from the luminous tritium. The shackles on her legs sever and she catapults back to Spider-Man. Octavius is back on the rampage. He hurls Spider-Man against a metallic beam. He crashes to the ground, and MJ observes as debris falls on top of him. Octavius marches over, and one of the arms lifts Spider-Man and suspends him in mid-air. MJ picks up a piece of wood, sneaks up on Octavius, and is about to strike him when she's punched away. One claw flicks out a blade."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Looking scared, a hinged portrait is hauled back by Harry, a combination is dialed, and the safe behind it is opened by him. Inside is a huge orb. Harry is bundled out of the way by a limb. Octavius strides up to the safe, removes his dark specs, and the tritium is stared at by him. Spider-Man is fixedly watched by Harry. He is spun round. The tritium sphere has been taken by Octavius, and the balcony is exited by him. With a dark and brooding look on his face, a heavy ornamental dagger beside him on the desk is picked up by Harry. The dagger is held to his chest by him, and he moves towards Spider-Man, who is lying unconsciously on his back on the couch, his arms and hands bound in front of him. The dagger is raised by Harry as Spider-Man stares. The mask is hauled off, then Harry recoils and the dagger is dropped. Peter flexes and the bonds are broken by him. He gets to his feet and Harry is approached. His head is shaken by Harry. There are tears in the eyes of the seated Harry as Peter is stared up at by him. In the reconstructed lab, down by the pier, Octavius stands in the fusion chamber, studying the tritium. MJ, in chains, is tied to a pillar. His dark glasses are lowered by Octavius and a keyboard is tapped on by him. In the fusion chamber, beams of light appear. The tritium glows brightly, and the way for Spider-Man to creep across a beam is illuminated. Sensing something, Octavius grins. Spider-Man stops above MJ. MJ looks up, smiles, and the smile fades when Octavius is turned to face by her. The pillar is punched into by a limb. Spider-Man climbs away. Over Octavius and his limbs, Spider-Man jumps, but he is caught and flung up through the ceiling and out into the night sky by them. A web is shot onto the building by Spider-Man and he swings back in through a huge oil window, landing on Octavius. They are crashed through the floorboards into the water below and blows are traded. The tritium sphere begins to attract metals to it, including the chains on MJ. She is hung in the air, the chains on her leg drawn to the sphere. The pillar to which she's tied buckles and the ropes become free. MJ is pulled towards the sphere. A web is attached to the rope by Spider-Man and he struggles to pull MJ back from the glowing tritium. The chains on her legs are broken free and she catapults back to him. The rampage is resumed by Octavius. Spider-Man is tossed against a metal beam by him. The floor is crashed to by him, and as rubble falls on top of him, MJ watches. Octavius strides over, and Spider-Man is lifted by one of the limbs and suspended in mid-air. A piece of timber is picked up by MJ, Octavius is sneaked up on by her, and she is about to hit him when a punch is delivered to her. A blade is flicked out by one pincer."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Looking frightened, Harry pulls back a hinged portrait, dials a combination, and opens the safe behind it, revealing a huge orb. A limb pushes Harry aside as Octavius approaches, removes his dark glasses, and stares at the tritium. Harry focuses on Spider-Man, then turns to see Octavius taking the tritium sphere and leaving via the balcony. With a dark, brooding expression, Harry picks up a heavy ornamental dagger from the desk and moves toward the unconscious, bound Spider-Man on the couch. He raises the dagger, but upon removing Spider-Man's mask, he recoils and drops it. Peter breaks free, stands, and approaches Harry, who shakes his head with tears in his eyes. In the reconstructed lab by the pier, Octavius studies the tritium in the fusion chamber. MJ, chained to a pillar, watches as Octavius taps on a keyboard, causing beams of light to appear. The tritium glows, allowing Spider-Man to stealthily cross a beam. Sensing him, Octavius grins. Spider-Man stops above MJ, who smiles, but her expression fades when she sees Octavius. A limb strikes the pillar, and Spider-Man climbs away. He leaps over Octavius, but is caught and flung through the ceiling into the night sky. Spider-Man shoots a web onto the building, swings back through a large window, and lands on Octavius. They crash into the water below, exchanging blows. The tritium sphere attracts metals, including MJ's chains, pulling her into the air. The pillar buckles, freeing the ropes, and MJ is drawn toward the sphere. Spider-Man attaches a web to the rope, struggling to pull MJ back. Her chains break, and she catapults back to Spider-Man. Octavius resumes his attack, throwing Spider-Man against a metal beam. MJ watches as rubble falls on him. Octavius lifts Spider-Man with a limb, suspending him mid-air. MJ grabs a piece of timber, sneaks up on Octavius, and is about to strike when she's punched away. A pincer flicks out a blade."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry, looking scared, opens a safe behind a portrait to reveal a huge orb. Octavius pushes him aside, removes his glasses, and takes the tritium sphere, leaving via the balcony. Harry, brooding, picks up a dagger and approaches the unconscious, bound Spider-Man. He raises the dagger, removes Spider-Man's mask, then recoils and drops it. Peter breaks free and confronts Harry, who is tearful. At the pier, Octavius studies the tritium in the fusion chamber, where MJ is chained to a pillar. He activates the chamber, and Spider-Man sneaks in. Octavius senses him, and Spider-Man stops above MJ. She smiles, but it fades when she sees Octavius. Spider-Man is flung outside but swings back in, landing on Octavius. They crash into the water and fight. The tritium attracts metals, pulling MJ's chains. Spider-Man pulls her back, and her chains break. Octavius throws Spider-Man against a beam, and rubble falls on him. Octavius lifts Spider-Man with a limb. MJ tries to hit Octavius with timber but is punched away. A pincer flicks out a blade."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a look of fear etched across his face, Harry cautiously pulls back a hinged portrait, revealing a hidden safe. He carefully dials a combination and opens the safe to reveal a massive orb inside. Suddenly, a mechanical limb shoves Harry aside. Octavius strides confidently up to the safe, removes his dark sunglasses, and fixes his intense gaze on the tritium. Meanwhile, Harry's eyes are locked on Spider-Man. He spins around just in time to see Octavius taking the tritium sphere and making his exit via the balcony. With a dark and brooding expression, Harry picks up a heavy, ornate dagger from the desk beside him. Holding the dagger close to his chest, he moves toward the unconscious Spider-Man, who is lying on his back on the couch, his arms and hands securely bound in front of him. As Spider-Man stares, Harry raises the dagger. He then pulls off the mask, only to recoil in shock and drop the dagger. Peter flexes his muscles, breaking the bonds that hold him. Rising to his feet, he approaches Harry. Harry shakes his head in disbelief, tears welling up in his eyes as he looks up at Peter from his seated position.\n\nIn the reconstructed laboratory down by the pier, Octavius stands within the fusion chamber, intently studying the tritium. MJ, bound in chains, is tied to a pillar. Octavius lowers his dark glasses and begins tapping on a keyboard. Within the fusion chamber, beams of light start to appear, and the tritium glows brightly, casting an illuminating path for Spider-Man to stealthily creep across a beam. Sensing something amiss, Octavius grins. Spider-Man halts directly above MJ. She looks up and smiles, but her smile fades as she turns to face Octavius. A mechanical limb punches into the pillar, prompting Spider-Man to climb away. He leaps over Octavius and his mechanical limbs, but they catch him and fling him up through the ceiling, sending him out into the night sky. Spider-Man quickly shoots a web onto the building and swings back in through a large oil window, landing forcefully on Octavius. Together, they crash through the floorboards into the water below, where they begin trading blows. The tritium sphere starts to attract metals, including MJ's chains. She is lifted into the air, the chains on her legs drawn toward the sphere. The pillar to which she is tied buckles, and the ropes become loose. MJ is pulled toward the sphere, but Spider-Man attaches a web to the rope and struggles to pull her back from the glowing tritium. The chains on her legs break free, and she catapults back toward Spider-Man. Octavius, back on the offensive, tosses Spider-Man against a metal beam. He crashes to the floor, and MJ watches in horror as rubble falls on top of him. Octavius strides over, and one of his mechanical limbs lifts Spider-Man, suspending him in mid-air. MJ, seizing the opportunity, picks up a piece of timber and sneaks up on Octavius, ready to strike him. However, she is punched away before she can land a blow. One of Octavius's pincers flicks out a menacing blade."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With an expression of fear vividly etched across his face, Harry nervously and with great caution pulls back a hinged portrait, unveiling a cleverly concealed safe behind it. He then carefully manipulates the dial, carefully inputting the combination, and proceeds to open the secure safe, which contains a massive orb inside. Suddenly, without warning, a mechanical limb forcefully shoves Harry aside. Octavius strides forward with a confident demeanor up to the safe, casually removing his dark sunglasses to reveal his intense gaze upon the tritium. At the same time, Harry's eyes remain locked on Spider-Man. He spins around in the nick of time to witness Octavius taking possession of the tritium sphere and making his exit in a determined manner via the nearby balcony. With a dark, brooding expression on his face, Harry picks up a heavy, ornate dagger from the desk beside him. Holding the dagger close against his chest, he moves purposefully toward the unconscious Spider-Man, who is lying prone on his back on the couch, his arms and hands securely bound together in front of him. As Spider-Man stares, Harry raises the dagger ominously. He then pulls off the mask, only to reel back in shock and drop the dagger. Peter flexes his muscles, rapidly breaking the bonds that restrain him. Rising to his full height, he approaches Harry. With disbelief, Harry shakes his head, tears welling up in his eyes as he looks up at Peter from his seated position.\n\nIn the meticulously reconstructed laboratory located down by the pier, Octavius stands confidently within the fusion chamber, intently studying the tritium. Nearby, MJ, bound and restrained in chains, is securely tied to a pillar. Octavius lowers his dark glasses and begins tapping on a complex keyboard. Within the fusion chamber, beams of light suddenly begin to appear, and the tritium glows brilliantly, casting an illuminating path for Spider-Man to stealthily creep across a beam. Sensing that something is amiss, Octavius grins knowingly. Spider-Man comes to a halt directly above MJ. She looks up and manages to smile, but her smile quickly fades as she turns to face Octavius. A mechanical limb slams into the pillar, prompting Spider-Man to climb away swiftly. He leaps elegantly over Octavius and his mechanical limbs, but they catch him in mid-air and fling him violently up through the ceiling, sending him soaring out into the night sky. Spider-Man swiftly shoots a web onto the building and skillfully swings back in through a large oil window, landing forcefully upon Octavius. Together, they crash through the floorboards and into the water below, where they begin exchanging powerful blows. The tritium sphere starts to attract metals, including the chains binding MJ. She is lifted dramatically into the air, the chains on her legs being drawn aggressively toward the sphere. The pillar to which she is tied buckles under the pressure, and the ropes become loose. MJ is drawn inexorably toward the sphere, but Spider-Man deftly attaches a web to the rope and struggles valiantly to pull her back from the dangerously glowing tritium. The chains on her legs snap free, and she catapults back safely toward Spider-Man. Octavius, quickly recovering, goes back on the offensive and throws Spider-Man against a sturdy metal beam. Spider-Man crashes to the floor with a thud, and MJ watches in horror as debris and rubble fall on top of him. Octavius strides confidently over, and one of his mechanical limbs lifts Spider-Man, suspending him ominously in mid-air. Sensing an opportunity, MJ seizes a piece of timber and stealthily sneaks up on Octavius, ready to strike him. However, she is punched away before she can successfully land a blow. One of Octavius's terrifying pincers flicks out a menacingly sharp blade."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "With a look of fear etched across his face, Harry cautiously pulls back a hinged portrait, revealing a hidden safe behind it. He carefully dials in the combination, listening intently for the clicks, and then opens the safe to reveal a massive orb inside. Suddenly, a mechanical limb swiftly pushes Harry aside, clearing the way for Octavius, who strides confidently up to the safe. He removes his dark spectacles, his eyes fixated on the tritium within. Meanwhile, Harry's gaze shifts to Spider-Man, who lies unconscious. Harry spins around to find that Octavius has already taken the tritium sphere and is making his exit via the balcony. With a dark and brooding expression, Harry picks up a heavy ornamental dagger from the desk beside him. He clutches the dagger to his chest, his steps deliberate as he approaches the unconscious Spider-Man, who is lying on his back on the couch with his arms and hands bound in front of him. Harry raises the dagger, his eyes locked with Spider-Man's, who is now awake and staring back. In a sudden motion, Harry pulls off Spider-Man's mask, only to recoil in shock and drop the dagger upon recognizing Peter. Peter seizes the moment to flex his muscles, breaking the bonds that restrain him. He rises to his feet and approaches Harry, who shakes his head in disbelief. Tears well up in Harry's eyes as he looks up at Peter from his seated position. Meanwhile, in the reconstructed lab down by the pier, Octavius stands within the fusion chamber, intently studying the tritium. MJ, bound in chains, is tied to a pillar nearby. Octavius lowers his dark glasses and begins tapping on a keyboard. As he does so, beams of light emerge in the fusion chamber, causing the tritium to glow brightly. This illumination provides Spider-Man with the cover he needs to stealthily creep across a beam. Sensing something amiss, Octavius grins, his suspicions aroused. Spider-Man halts directly above MJ, who looks up and smiles at him, but her smile quickly fades as she turns to face Octavius. A mechanical limb suddenly punches into the pillar, prompting Spider-Man to climb away swiftly. He leaps over Octavius and his mechanical limbs, but they ensnare him, flinging him up through the ceiling and out into the night sky. Undeterred, Spider-Man shoots a web onto the building and swings back in through a large oil window, landing forcefully on Octavius. Together, they crash through the floorboards into the water below, where they begin trading blows. Meanwhile, the tritium sphere starts to exert a magnetic pull, attracting metals towards it, including the chains binding MJ. She is lifted into the air, the chains on her leg drawn inexorably towards the sphere. The pillar to which she's tied begins to buckle, causing the ropes to loosen and MJ to be pulled towards the sphere. Spider-Man quickly attaches a web to the rope, straining to pull MJ back from the glowing tritium. The chains on her legs snap free, and she is catapulted back towards Spider-Man. Octavius, undeterred, resumes his rampage, hurling Spider-Man against a metal beam. Spider-Man crashes to the floor, and MJ watches in horror as rubble cascades down upon him. Octavius strides over, and one of his mechanical limbs lifts Spider-Man, suspending him in mid-air. Seizing an opportunity, MJ picks up a piece of timber and stealthily approaches Octavius, intending to strike him. However, she is abruptly punched away by one of his limbs, and a pincer flicks out a menacing blade."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Looking scared, Harry opens a safe hidden behind a hinged portrait to reveal a huge orb. Octavius pushes Harry aside, removes his dark specs, and examines the tritium. As Octavius takes the tritium sphere and exits via the balcony, Harry, with a dark and brooding expression, picks up a heavy ornamental dagger and approaches the unconscious, bound Spider-Man on the couch. He raises the dagger but, upon removing Spider-Man's mask, recoils and drops it. Peter breaks free of his bonds, stands, and approaches Harry, who, with tears in his eyes, looks up at him.\n\nIn the reconstructed lab by the pier, Octavius stands in the fusion chamber, studying the tritium while MJ, in chains, is tied to a pillar. Octavius activates the chamber, causing beams of light to appear and the tritium to glow, allowing Spider-Man to stealthily approach across a beam. Octavius senses him and grins. Spider-Man stops above MJ, who smiles up at him before her expression fades as she turns to face Octavius. A limb strikes the pillar, prompting Spider-Man to climb away. He leaps over Octavius and his limbs, but they catch him and fling him through the ceiling into the night sky. Spider-Man swings back through a window, landing on Octavius, and they crash through the floorboards into the water below, exchanging blows.\n\nThe tritium sphere begins attracting metals, including MJ's chains, pulling her into the air. The pillar she's tied to buckles, freeing the ropes, and she is drawn toward the sphere. Spider-Man attaches a web to the rope, struggling to pull MJ back from the glowing tritium. Her chains break free, and she catapults back to Spider-Man. Octavius resumes his attack, throwing Spider-Man against a metal beam. As Spider-Man crashes to the floor, MJ watches rubble fall on him. Octavius approaches, lifting Spider-Man with a limb and suspending him mid-air. MJ picks up a piece of timber, sneaks up on Octavius, and is about to strike when she's punched away. A pincer flicks out a blade."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Looking scared, Harry hauls back a hinged portrait reminiscent of classical European art styles, dials a combination, and opens the safe behind it. Inside is a huge orb made of tritium, a rare and radioactive isotope used in nuclear fusion experiments. A limb, part of Octavius' mechanical appendages, bundles Harry out of the way. Octavius, whose artificial intelligence-driven limbs grant him enhanced strength and dexterity, strides up to the safe, removes his dark specs, and stares with intent focus at the tritium. Harry fixes his eyes on Spider-Man, the iconic superhero known for his agility and spider-like abilities. He spins round. Octavius has taken the tritium sphere, the pivotal element for his dangerous experiments, and leaves via the balcony in dramatic fashion. Harry, a dark and brooding look on his face, picks up a heavy ornamental dagger from the desk beside him. The dagger is an heirloom with intricate carvings from a bygone era. He holds the dagger to his chest and moves towards the unconscious Spider-Man, lying on his back on the couch, his arms and hands bound in front of him. He raises the dagger as Spider-Man stares. He hauls off the mask, revealing Peter Parker's identity, then recoils and drops the dagger. Peter flexes and breaks the bonds with a surge of his superhuman strength. He gets to his feet and approaches Harry, who is torn by betrayal and confusion. Harry shakes his head. There are tears in the seated Harry's eyes as he stares up at Peter. In the reconstructed lab, down by the pier once bustling with maritime activity, Octavius stands in the fusion chamber, studying the tritium. MJ, held captive, is in chains tied to a pillar. Octavius lowers his dark glasses, which help him shield his eyes from the intense light of his experiments, and taps on a keyboard. In the fusion chamber, beams of light appear, simulating the conditions necessary for a fusion reaction. The tritium glows brightly, illuminating the way for Spider-Man to creep across a beam. Sensing something, Octavius grins with a knowing confidence. Spider-Man stops above MJ. MJ, whose full name is Mary Jane Watson, Peter's childhood friend and love interest, looks up, smiles, and her smile fades when she turns to face Octavius, realizing the danger they are in. A limb punches into the pillar. Spider-Man climbs away. Spider-Man jumps over Octavius and his limbs, but they catch him and fling him up through the ceiling and out into the night sky. Spider-Man shoots a web onto the building with precision akin to an acrobat’s rope and swings back in through a huge oil window, reminiscent of industrial gothic architecture, landing on Octavius. They crash through the floorboards into the water below and trade blows. The tritium sphere begins to attract metals to it, including MJ's chains. She hangs in the air, the chains on her leg drawn with magnetic force to the sphere. The pillar to which she's tied buckles and the ropes become free. MJ is pulled towards the sphere, which glows with an ominous energy. Spider-Man attaches a web to the rope, using his quick reflexes, and struggles to pull MJ back from the glowing tritium. The chains on her legs break free and she catapults back to Spider-Man, her rescuer. Octavius is back on the rampage, relentless in his pursuit of power. He tosses Spider-Man against a metal beam. He crashes to the floor, and MJ watches anxiously as rubble falls on top of him. Octavius strides over, and one of the limbs lifts Spider-Man and suspends him in mid-air, showcasing their incredible strength. MJ picks up a piece of timber, a makeshift weapon, sneaks up on Octavius, and is about to hit him when she's punched away. One pincer flicks out a blade, a lethal feature of Octavius' mechanical suit."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Looking scared Harry hauls back  a hinged portrait dials a combination and opens the safe behind it  Inside is a huge orb  A limb bundles Harry out of the way  Octavius strides up to the safe removes his dark specs and stares at the tritium  Harry fixes his eyes on SpiderMan  He spins round  The tritium glows brightly illuminating the way for SpiderMan to creep across a beam  Sensing something Octavius grins  SpiderMan stops above MJ  MJ looks up smiles and her smile fades when she turns to face Octavius  A limb punches into the pillar  SpiderMan climbs away  SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky  SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius  They crash through the floorboards into the water below and trade blows  The tritium sphere begins to attract metals to it including MJ's chains  She hangs in the air the chains on her leg drawn to the sphere  The pillar to which she's tied buckles and the ropes become free  MJ is pulled towards the sphere  SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium  The chains on her legs break free and she catapults back to SpiderMan  Octavius is back on the rampage  He tosses SpiderMan against a metal beam  He crashes to the floor and MJ watches as rubble falls on top of him  Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair  MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she's punched away  One pincer flicks out a blade Octavius has taken the tritium sphere and leaves via the balcony  Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him  He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him  He raises the dagger as SpiderMan stares  He hauls off the mask then recoils and drops the dagger  Peter flexes and breaks the bonds  He gets to his feet and approaches Harry  Harry shakes his head  There are tears in the seated Harry's eyes as he stares up at Peter  In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium  MJ in chains is tied to a pillar  Octavius lowers his dark glasses and taps on a keyboard  In the fusion chamber beams of light appear  The tritium glows brightly illuminating the way for SpiderMan to creep across a beam  Sensing something Octavius grins  SpiderMan stops above MJ  MJ looks up smiles and her smile fades when she turns to face Octavius  A limb punches into the pillar  SpiderMan climbs away  SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky  SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius  They crash through the floorboards into the water below and trade blows  The tritium sphere begins to attract metals to it including MJ's chains  She hangs in the air the chains on her leg drawn to the sphere  The pillar to which she's tied buckles and the ropes become free  MJ is pulled towards the sphere  SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium  The chains on her legs break free and she catapults back to SpiderMan  Octavius is back on the rampage  He tosses SpiderMan against a metal beam  He crashes to the floor and MJ watches as rubble falls on top of him  Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair  MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she's punched away  One pincer flicks out a blade"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Looking scared Harry hauls back. a hinged portrait dials a combination and opens the safe behind it. Inside is a huge orb. A limb bundles Harry out of the way. Octavius strides up to the safe removes his dark specs and stares at the tritium. Harry fixes his eyes on SpiderMan. He spins round. Octavius has taken the tritium sphere and leaves via the balcony. Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him. He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him. He raises the dagger as SpiderMan stares. He hauls off the mask then recoils and drops the dagger. Peter flexes and breaks the bonds. He gets to his feet and approaches Harry. Harry shakes his head. There are tears in the seated Harry's eyes as he stares up at Peter. In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium. MJ in chains is tied to a pillar. Octavius lowers his dark glasses and taps on a keyboard. In the fusion chamber beams of light appear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The tritium glows brightly illuminating the way for SpiderMan to creep across a beam. Sensing something Octavius grins. SpiderMan stops above MJ. MJ looks up smiles and her smile fades when she turns to face Octavius. A limb punches into the pillar. SpiderMan climbs away. SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky. SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius. They crash through the floorboards into the water below and trade blows. The tritium sphere begins to attract metals to it including MJ's chains. She hangs in the air the chains on her leg drawn to the sphere. The pillar to which she is tied buckles and the ropes become free. MJ is pulled towards the sphere. SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium. The chains on her legs break free and she catapults back to SpiderMan. Octavius is back on the rampage. He tosses SpiderMan against a metal beam. He crashes to the floor and MJ watches as rubble falls on top of him. Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair. MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she is punched away. One pincer flicks out a blade."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Looking scared Harry hauls back. a hinged portrait dials a combination and opens the safe behind it. Inside is a huge orb. A limb bundles Harry out of the way. Octavius strides up to the safe removes his dark specs and stares at the tritium. Harry fixes his eyes on SpiderMan. He spins round. Octavius has taken the tritium sphere and leaves via the balcony. Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him. He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him. He raises the dagger as SpiderMan stares. He hauls off the mask then recoils and drops the dagger. Peter flexes and breaks the bonds. He gets to his feet and approaches Harry. Harry shakes his head. There are tears in the seated Harry's eyes as he stares up at Peter. In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium. MJ in chains is tied to a pillar. Octavius lowers his dark glasses and taps on a keyboard. In the fusion chamber beams of light appear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. The tritium glows brightly illuminating the way for SpiderMan to creep across a beam. Sensing something Octavius grins. SpiderMan stops above MJ. MJ looks up smiles and her smile fades when she turns to face Octavius. A limb punches into the pillar. SpiderMan climbs away. SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky. SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius. They crash through the floorboards into the water below and trade blows. The tritium sphere begins to attract metals to it including MJ's chains. She hangs in the air the chains on her leg drawn to the sphere. The pillar to which she is tied buckles and the ropes become free. MJ is pulled towards the sphere. SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium. The chains on her legs break free and she catapults back to SpiderMan. Octavius is back on the rampage. He tosses SpiderMan against a metal beam. He crashes to the floor and MJ watches as rubble falls on top of him. Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair. MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she is punched away. One pincer flicks out a blade."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Looking scared Harry hauls back. a hinged portrait dials a combination and opens the safe behind it. Inside is a huge orb. A limb bundles Harry out of the way. Octavius strides up to the safe removes his dark specs and stares at the tritium. Harry fixes his eyes on SpiderMan. He spins round. Octavius has taken the tritium sphere and leaves via the balcony. Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him. He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him. She hangs in the air the chains on her leg drawn to the sphere. The pillar to which she is tied buckles and the ropes become free. MJ is pulled towards the sphere. SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium. The chains on her legs break free and she catapults back to SpiderMan. Octavius is back on the rampage. He tosses SpiderMan against a metal beam. He crashes to the floor and MJ watches as rubble falls on top of him. Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair. MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she is punched away. One pincer flicks out a blade."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Looking scared Harry hauls back. a hinged portrait dials a combination and opens the safe behind it. Inside is a huge orb. A limb bundles Harry out of the way. He tosses SpiderMan against a metal beam. He crashes to the floor and MJ watches as rubble falls on top of him. Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair. MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she is punched away. One pincer flicks out a blade."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Looking scared, a penguin hauls back a hinged portrait, dials a combination, and opens the safe behind it. Inside is a huge orb. A tree bundles the penguin out of the way. A squirrel strides up to the safe, removes its dark specs, and stares at the tritium. The penguin fixes its eyes on a raccoon. It spins round. The squirrel has taken the tritium sphere and leaves via the balcony. The penguin, a dark and brooding look on its face, picks up a heavy ornamental dagger from the desk beside it. It holds the dagger to its chest and moves towards the unconscious raccoon, lying on its back on the couch, its arms and hands bound in front of it. It raises the dagger as the raccoon stares. It hauls off the mask, then recoils and drops the dagger. A rabbit flexes and breaks the bonds. It gets to its feet and approaches the penguin. The penguin shakes its head. There are tears in the seated penguin's eyes as it stares up at the rabbit. In the reconstructed lab, down by the pier, the squirrel stands in the fusion chamber, studying the tritium. A fox, in chains, is tied to a pillar. The squirrel lowers its dark glasses and taps on a keyboard. In the fusion chamber, beams of light appear. The tritium glows brightly, illuminating the way for the raccoon to creep across a beam. Sensing something, the squirrel grins. The raccoon stops above the fox. The fox looks up, smiles, and its smile fades when it turns to face the squirrel. A tree punches into the pillar. The raccoon climbs away. The raccoon jumps over the squirrel and its tree branches, but they catch it and fling it up through the ceiling and out into the night sky. The raccoon shoots a web onto the building and swings back in through a huge oil window, landing on the squirrel. They crash through the floorboards into the water below and trade blows. The tritium sphere begins to attract metals to it, including the fox's chains. It hangs in the air, the chains on its leg drawn to the sphere. The pillar to which it's tied buckles, and the ropes become free. The fox is pulled towards the sphere. The raccoon attaches a web to the rope and struggles to pull the fox back from the glowing tritium. The chains on its legs break free and it catapults back to the raccoon. The squirrel is back on the rampage. It tosses the raccoon against a metal beam. It crashes to the floor, and the fox watches as rubble falls on top of it. The squirrel strides over, and one of the trees lifts the raccoon and suspends it in mid-air. The fox picks up a piece of timber, sneaks up on the squirrel, and is about to hit it when it's punched away. One pincer flicks out a blade."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Looking scared, Harry hauls back a sliding curtain, dials a combination, and opens the cabinet behind it. Inside is a huge globe. A vine bundles Harry out of the way. Octavius strides up to the cabinet, removes his dark goggles, and stares at the crystal. Harry fixes his eyes on Spider-Man. He spins round. Octavius has taken the crystal orb and leaves via the garden. Harry, a dark and brooding look on his face, picks up a heavy ornamental vase from the shelf beside him. He holds the vase to his chest and moves towards the unconscious Spider-Man, lying on his back on the armchair, his arms and hands bound in front of him. He raises the vase as Spider-Man stares. He hauls off the mask, then recoils and drops the vase. Peter flexes and breaks the cords. He gets to his feet and approaches Harry. Harry shakes his head. There are tears in the seated Harry's eyes as he stares up at Peter. In the reconstructed studio, down by the marina, Octavius stands in the reactor chamber, studying the crystal. MJ, in manacles, is tied to a column. Octavius lowers his dark goggles and taps on a calculator. In the reactor chamber, beams of light appear. The crystal glows brightly, illuminating the way for Spider-Man to creep across a scaffold. Sensing something, Octavius grins. Spider-Man stops above MJ. MJ looks up, smiles, and her smile fades when she turns to face Octavius. A vine punches into the column. Spider-Man climbs away. Spider-Man jumps over Octavius and his vines, but they catch him and fling him up through the dome and out into the night sky. Spider-Man shoots a web onto the structure and swings back in through a huge stained-glass skylight, landing on Octavius. They crash through the panels into the pond below and trade blows. The crystal orb begins to attract metals to it, including MJ's manacles. She hangs in the air, the manacles on her leg drawn to the orb. The column to which she's tied buckles and the ropes become free. MJ is pulled towards the orb. Spider-Man attaches a web to the rope and struggles to pull MJ back from the glowing crystal. The manacles on her legs break free and she catapults back to Spider-Man. Octavius is back on the rampage. He tosses Spider-Man against a metal scaffold. He crashes to the floor, and MJ watches as debris falls on top of him. Octavius strides over, and one of the vines lifts Spider-Man and suspends him in mid-air. MJ picks up a piece of cardboard, sneaks up on Octavius, and is about to hit him when she's punched away. One tendril flicks out a shard."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Looking scared, Harry lifts a hinged portrait, dials a combination, and inspects the safe behind it. Inside is a huge orb. A limb nudges Harry out of the way. Octavius jumps up to the safe, removes his dark specs, and glances at the tritium. Harry fixes his eyes on Spider-Man. He twirls round. Octavius has grabbed the tritium sphere and departs via the balcony. Harry, a dark and brooding look on his face, grabs a heavy ornamental dagger from the desk beside him. He presses the dagger to his chest and ambles towards the unconscious Spider-Man, lying on his back on the couch, his arms and hands bound in front of him. He brandishes the dagger as Spider-Man glares. He pulls off the mask, then jolts and flings the dagger. Peter twists and snaps the bonds. He rises to his feet and moves towards Harry. Harry nods his head. There are tears in the seated Harry's eyes as he gazes up at Peter. In the reconstructed lab, down by the pier, Octavius lounges in the fusion chamber, observing the tritium. MJ, in chains, is fastened to a pillar. Octavius adjusts his dark glasses and types on a keyboard. In the fusion chamber, beams of light emerge. The tritium glows brightly, lighting up the way for Spider-Man to slide across a beam. Detecting something, Octavius smirks. Spider-Man pauses above MJ. MJ looks up, grins, and her grin fades when she turns to confront Octavius. A limb smashes into the pillar. Spider-Man crawls away. Spider-Man leaps over Octavius and his limbs, but they seize him and hurl him up through the ceiling and out into the night sky. Spider-Man casts a web onto the building and swings back in through a huge oil window, landing on Octavius. They tumble through the floorboards into the water below and exchange blows. The tritium sphere starts to draw metals to it, including MJ's chains. She dangles in the air, the chains on her leg pulled to the sphere. The pillar to which she's tied twists and the ropes become loose. MJ is dragged towards the sphere. Spider-Man attaches a web to the rope and fights to pull MJ back from the glowing tritium. The chains on her legs snap free and she flies back to Spider-Man. Octavius is back on the attack. He thrusts Spider-Man against a metal beam. He drops to the floor, and MJ watches as rubble falls on top of him. Octavius marches over, and one of the limbs hoists Spider-Man and dangles him in mid-air. MJ snatches up a piece of timber, tiptoes up on Octavius, and is about to strike him when she's pushed away. One pincer snaps out a blade."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Looking scared, a notebook hauls back a floating sculpture, dials a combination, and opens the closet behind it. Inside is a huge pancake. A branch bundles the notebook out of the way. A cactus strides up to the closet, removes its striped gloves, and stares at the glitter. The notebook fixes its eyes on a dragonfly. It spins round. The cactus has taken the glitter sphere and leaves via the bookshelf. The notebook, a dark and brooding look on its face, picks up a heavy ornamental spoon from the shelf beside it. It holds the spoon to its stem and moves towards the unconscious dragonfly, lying on its back on the mattress, its wings and antennae bound in front of it. It raises the spoon as the dragonfly stares. It hauls off the scarf, then recoils and drops the spoon. A squirrel flexes and breaks the vines. It gets to its feet and approaches the notebook. The notebook shakes its head. There are tears in the seated notebook's pages as it stares up at the squirrel. In the reconstructed garden, down by the river, the cactus stands in the fusion house, studying the glitter. A seashell, in vines, is tied to a gate. The cactus lowers its striped gloves and taps on a typewriter. In the fusion house, beams of light appear. The glitter glows brightly, illuminating the way for the dragonfly to creep across a beam. Sensing something, the cactus grins. The dragonfly stops above the seashell. The seashell looks up, smiles, and its smile fades when it turns to face the cactus. A branch punches into the gate. The dragonfly climbs away. The dragonfly jumps over the cactus and its branches, but they catch it and fling it up through the ceiling and out into the night sky. The dragonfly shoots a web onto the tower and swings back in through a huge oil painting, landing on the cactus. They crash through the floorboards into the water below and trade blows. The glitter sphere begins to attract metals to it, including the seashell's vines. It hangs in the air, the vines on its shell drawn to the sphere. The gate to which it's tied buckles and the ropes become free. The seashell is pulled towards the sphere. The dragonfly attaches a web to the rope and struggles to pull the seashell back from the glowing glitter. The vines on its shell break free and it catapults back to the dragonfly. The cactus is back on the rampage. It tosses the dragonfly against a metal pole. It crashes to the floor, and the seashell watches as rubble falls on top of it. The cactus strides over, and one of the branches lifts the dragonfly and suspends it in mid-air. The seashell picks up a piece of bark, sneaks up on the cactus, and is about to hit it when it's punched away. One thorn flicks out a needle."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Looking intimidated, Draco pushes aside a swivel chair, selects a frequency, and reveals the vault behind it. Inside is a massive crystal. A tentacle nudges Draco aside. Helena saunters up to the vault, removes her bright hat, and observes the gemstone. Draco locks his gaze on the superhero. He twirls around. Helena has taken the crystal sphere and departs via the terrace. Draco, with a stern and moody expression, grabs a hefty ceremonial sword from the table beside him. He presses the sword to his chest and advances towards the unconscious superhero, lying supine on the couch, his limbs bound in front of him. He lifts the sword as the superhero gapes. He rips off the mask, then jolts back and drops the sword. Clark stretches and snaps the restraints. He rises to his feet and confronts Draco. Draco shakes his head. Tears glisten in the seated Draco's eyes as he gazes up at Clark. In the refurbished workshop, down by the dock, Helena stands in the reaction chamber, examining the crystal. Gwen, in shackles, is lashed to a column. Helena lowers her bright lenses and types on a keypad. In the reaction chamber, streams of energy surface. The crystal radiates intensely, lighting the path for the superhero to tiptoe across a beam. Noticing something, Helena smirks. The superhero halts above Gwen. Gwen glances up, grins, and her grin fades when she turns to see Helena. A tentacle jabs into the column. The superhero ascends away. The superhero leaps over Helena and her tentacles, but they seize him and hurl him up through the roof and out into the night air. The superhero shoots a line onto the structure and swings back in through a giant glass window, landing on Helena. They burst through the planks into the water below and exchange punches. The crystal sphere starts attracting metals to it, including Gwen's shackles. She dangles in the air, the shackles on her foot pulled towards the sphere. The column she's tied to buckles, and the cords come loose. Gwen is drawn towards the sphere. The superhero attaches a line to the cord and struggles to pull Gwen back from the luminous crystal. The shackles on her legs snap free, and she catapults back to the superhero. Helena resumes her rampage. She flings the superhero against a metal bar. He crashes to the ground, and Gwen observes as debris collapses on top of him. Helena strides over, and one of the tentacles lifts the superhero and suspends him in mid-air. Gwen picks up a plank, sneaks up on Helena, and is about to strike her when she's knocked away. A claw flicks out a blade."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Looking scared, Harry drags back a sliding door, taps a rhythm, and closes the locker behind it. Inside is a large balloon. A branch nudges Harry out of the way. Octavius marches up to the locker, removes his bright monocle, and gazes at the helium. Harry fixes his eyes on Spider-Man. He twirls around. Octavius has seized the helium orb and exits via the staircase. Harry, a dark and brooding look on his face, picks up a heavy ornamental vase from the table beside him. He holds the vase to his chest and drifts toward the oblivious Spider-Man, lying on his side on the chair, his arms and feet wrapped in front of him. He lifts the vase as Spider-Man watches. He peels off the hood, then jumps back and drops the vase. Peter stretches and snaps the ties. He gets to his feet and advances toward Harry. Harry shakes his head. There are tears in the seated Harry's eyes as he gazes up at Peter. In the rearranged workshop, down by the dock, Octavius stands in the reaction chamber, examining the helium. MJ, in shackles, is fastened to a pole. Octavius raises his bright goggles and taps on a typewriter. In the reaction chamber, streams of mist manifest. The helium glows vividly, lighting the way for Spider-Man to sneak across a bridge. Sensing something, Octavius smirks. Spider-Man pauses above MJ. MJ looks up, grins, and her grin fades when she turns to glance at Octavius. A branch jabs into the pole. Spider-Man scurries away. Spider-Man leaps over Octavius and his branches, but they grab him and toss him up through the ceiling and out into the night sky. Spider-Man launches a rope onto the structure and swings back in through a giant stained-glass window, landing on Octavius. They plunge through the ceiling panels into the water below and exchange punches. The helium orb starts to attract ceramics to it, including MJ's shackles. She hangs in the air, the shackles on her ankle pulled to the orb. The pole to which she's fastened twists and the ribbons become loose. MJ is drawn towards the orb. Spider-Man shoots a rope to the ribbons and struggles to pull MJ back from the glowing helium. The shackles on her ankles snap free and she propels back to Spider-Man. Octavius resumes the offensive. He hurls Spider-Man against a wooden beam. He lands on the floor, and MJ observes as debris falls on top of him. Octavius strides over, and one branch lifts Spider-Man and suspends him in mid-air. MJ grabs a piece of metal, creeps up on Octavius, and is about to strike him when she's shoved aside. One pincer flicks out a spoon."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Appearing nervous, Lucy pushes aside a swinging curtain, twists a key ring, and reveals the cabinet behind it. Inside is a large cube. A branch shifts Lucy aside. Barnabas marches up to the cabinet, removes his blue hat, and gazes at the uranium. Lucy locks her gaze on Bat-Person. She twirls around. Barnabas has grabbed the uranium cube and exits through the porch. Lucy, a shadowy and intense expression on her face, picks up a large decorative spoon from the table beside her. She holds the spoon to her ear and glides towards the unconscious Bat-Person, lying on her side on the hammock, her feet and toes bound together. She lifts the spoon as Bat-Person watches. She tugs off the helmet, then flinches and drops the spoon. Bridget stretches and snags the ropes. She rises and confronts Lucy. Lucy nods slowly. There is moisture in the reclined Lucy’s eyes as she gazes up at Bridget. In the renovated attic, near the dock, Barnabas stands in the reactor room, observing the uranium. Sam, in shackles, is fastened to a ladder. Barnabas tilts his blue hat and presses on a controller. In the reactor room, strands of energy manifest. The uranium glows intensely, lighting the path for Bat-Person to slink along a rafter. Detecting something, Barnabas sneers. Bat-Person halts above Sam. Sam gazes up, grins, and her grin vanishes when she turns to face Barnabas. A branch swats into the ladder. Bat-Person scrambles away. Bat-Person leaps over Barnabas and his branches, but they catch her and propel her through the roof and out into the evening air. Bat-Person launches a vine onto the skyscraper and glides back in through a vast quartz portal, landing on Barnabas. They plunge through the parquet into the water beneath and exchange kicks. The uranium cube begins to summon minerals to it, including Sam's shackles. She floats in the air, the shackles on her arm drawn to the cube. The ladder to which she's attached bends and the cords come loose. Sam is tugged towards the cube. Bat-Person fastens a vine to the cord and wrestles to pull Sam away from the glimmering uranium. The shackles on her arms snap free and she rockets back to Bat-Person. Barnabas is back on the offensive. He hurls Bat-Person against a wooden rafter. She collapses to the ground, and Sam observes as debris descends on top of her. Barnabas marches over, and one of the branches raises Bat-Person and dangles her in midair. Sam grabs a piece of driftwood, sneaks up on Barnabas, and is about to strike him when she's swatted away. One vine extends to reveal a saw."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Looking scared, Harry reveals a safe with a huge orb inside. Octavius, removing his specs, takes the tritium, leaving Harry with a dagger aimed at unconscious Spider-Man. Recoiling, Harry drops the dagger as Peter breaks free and approaches him. In his lab, Octavius studies the tritium while MJ, in chains, is tied to a pillar. As Spider-Man sneaks in, Octavius senses him, and after a quick confrontation, flings Spider-Man outside. Spider-Man swings back, colliding with Octavius and trading blows as MJ's chains are drawn to the tritium. Spider-Man uses a web to pull her back. Octavius tosses Spider-Man against a beam, leaving MJ to watch rubble fall on him. Octavius suspends Spider-Man in mid-air, and MJ attempts to attack but is knocked away as Octavius's pincer reveals a blade."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "One pincer flicks out a blade MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she's punched away  Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair  He crashes to the floor and MJ watches as rubble falls on top of him  He tosses SpiderMan against a metal beam  Octavius is back on the rampage  The chains on her legs break free and she catapults back to SpiderMan  SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium  MJ is pulled towards the sphere  The pillar to which she's tied buckles and the ropes become free  She hangs in the air the chains on her leg drawn to the sphere  The tritium sphere begins to attract metals to it including MJ's chains  They crash through the floorboards into the water below and trade blows  SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius  SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky  SpiderMan climbs away  A limb punches into the pillar  MJ looks up smiles and her smile fades when she turns to face Octavius  SpiderMan stops above MJ  Sensing something Octavius grins  The tritium glows brightly illuminating the way for SpiderMan to creep across a beam  In the fusion chamber beams of light appear  Octavius lowers his dark glasses and taps on a keyboard  MJ in chains is tied to a pillar  In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium  There are tears in the seated Harry's eyes as he stares up at Peter  Harry shakes his head  He gets to his feet and approaches Harry  Peter flexes and breaks the bonds  He hauls off the mask then recoils and drops the dagger  He raises the dagger as SpiderMan stares  He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him  Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him  Octavius has taken the tritium sphere and leaves via the balcony  He spins round  Harry fixes his eyes on SpiderMan  Octavius strides up to the safe removes his dark specs and stares at the tritium  A limb bundles Harry out of the way  Inside is a huge orb  a hinged portrait dials a combination and opens the safe behind it  Looking scared Harry hauls back "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry shakes his head  There are tears in the seated Harry's eyes as he stares up at Peter  He gets to his feet and approaches Harry  Looking scared Harry hauls back  MJ is pulled towards the sphere  Peter flexes and breaks the bonds  SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius  Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him  SpiderMan climbs away  She hangs in the air the chains on her leg drawn to the sphere  The pillar to which she's tied buckles and the ropes become free  He raises the dagger as SpiderMan stares  He crashes to the floor and MJ watches as rubble falls on top of him  Octavius strides up to the safe removes his dark specs and stares at the tritium  MJ looks up smiles and her smile fades when she turns to face Octavius  A limb bundles Harry out of the way  They crash through the floorboards into the water below and trade blows  Sensing something Octavius grins  Octavius is back on the rampage  SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium  a hinged portrait dials a combination and opens the safe behind it  He tosses SpiderMan against a metal beam  MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she's punched away  He spins round  Octavius lowers his dark glasses and taps on a keyboard  He hauls off the mask then recoils and drops the dagger  In the fusion chamber beams of light appear  The tritium glows brightly illuminating the way for SpiderMan to creep across a beam  SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky  He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him  MJ in chains is tied to a pillar  Harry fixes his eyes on SpiderMan  A limb punches into the pillar  Octavius has taken the tritium sphere and leaves via the balcony  The chains on her legs break free and she catapults back to SpiderMan  The tritium sphere begins to attract metals to it including MJ's chains  Inside is a huge orb  In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium  Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair  One pincer flicks out a blade SpiderMan stops above MJ "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sensing something Octavius grins  SpiderMan stops above MJ  MJ looks up smiles and her smile fades when she turns to face Octavius  A limb punches into the pillar  SpiderMan climbs away  SpiderMan jumps over Octavius and his limbs but they catch him and fling him up through the ceiling and out into the night sky  SpiderMan shoots a web onto the building and swings back in through a huge oil window landing on Octavius  They crash through the floorboards into the water below and trade blows  The tritium sphere begins to attract metals to it including MJ's chains  She hangs in the air the chains on her leg drawn to the sphere  The pillar to which she's tied buckles and the ropes become free  MJ is pulled towards the sphere  SpiderMan attaches a web to the rope and struggles to pull MJ back from the glowing tritium  The chains on her legs break free and she catapults back to SpiderMan  Octavius is back on the rampage  He tosses SpiderMan against a metal beam  He crashes to the floor and MJ watches as rubble falls on top of him  Octavius strides over and one of the limbs lifts SpiderMan and suspends him in midair  MJ picks up a piece of timber sneaks up on Octavius and is about to hit him when she's punched away  One pincer flicks out a blade Looking scared Harry hauls back  a hinged portrait dials a combination and opens the safe behind it  Inside is a huge orb  A limb bundles Harry out of the way  Octavius strides up to the safe removes his dark specs and stares at the tritium  Harry fixes his eyes on SpiderMan  He spins round  Octavius has taken the tritium sphere and leaves via the balcony  Harry a dark and brooding look on his face picks up a heavy ornamental dagger from the desk beside him  He holds the dagger to his chest and moves towards the unconscious SpiderMan lying on his back on the couch his arms and hands bound in front of him  He raises the dagger as SpiderMan stares  He hauls off the mask then recoils and drops the dagger  Peter flexes and breaks the bonds  He gets to his feet and approaches Harry  Harry shakes his head  There are tears in the seated Harry's eyes as he stares up at Peter  In the reconstructed lab down by the pier Octavius stands in the fusion chamber studying the tritium  MJ in chains is tied to a pillar  Octavius lowers his dark glasses and taps on a keyboard  In the fusion chamber beams of light appear  The tritium glows brightly illuminating the way for SpiderMan to creep across a beam "
        }
      ]
    }
  ]
}