{
  "ground_truth": "He leaps over the edge of the building and peers down at the street below. He tries to fire a web, but again nothing happens. He looks down at the street way below and waddles slightly. He pouts and frowns. Later, a man with a dog is waiting for an elevator. The doors open and the man is about to enter when he pauses, seeing a fully suited Spider-Man standing casually inside. Looking Spidey up and down, the man steps into the elevator and presses a floor button. Spider-Man looks down a little self-consciously. The man nods understandingly. The man puts his card back in his pocket. Spider-Man looks away from the man, then bows his head and stares at the wall. The man looks up at the floor display as it changes from 10 to nine. Spider-Man leans forward and presses a button. Later, Peter traipses down a deserted sidewalk. He passes a wall which has been plastered with MJ's perfume ads, showing her soft, pretty face. He looks at the images briefly, then carries on going, a preoccupied look on his face. He's dragging his broken moped along behind him. Peter sits doodling in Doctor Connors' class. He's drawn his face, half Peter Parker and half Spider-Man. On a pay phone outside, MJ comes home. MJ looks peeved. MJ gazes hopefully at the phone. She turns away. Peter slaps the phone, then shakes his head incredulously. Talking into the receiver, he looks up and shakes his head. He hangs up. Guests have gathered in Doctor Octavius' lab. Peter and Harry are amongst them. Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs. He peels off his gray lab coat. He steps onto a platform, then taps keys on a freestanding control panel. The metal harness snaps into position around his waist. A mechanical spine curls up onto his back. A blue computer chip at the top of the synthetic spine glows, then a series of pins slide into his skin. He grimaces. His audience gasps. Octavius concentrates hard and stares up at the ceiling. The four metal limbs begin to move, rising up like snakes. On the end of each arm is a pointed pincer which opens out. Octavius reaches out his own arms. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved pillars rise. Octavius controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere, which floats in the air between the four pillars of the machine.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He vaults over the brink of the structure and gazes down at the avenue beneath. He endeavors to shoot a web, but once more nothing occurs. He glances down at the road far beneath and waddles slightly. He sulks and scowls. Later, a gentleman with a canine is waiting for a lift. The panels open and the gentleman is about to enter when he hesitates, noticing a fully suited Spider-Man standing nonchalantly inside. Observing Spidey up and down, the gentleman steps into the lift and pushes a level button. Spider-Man peers down a bit self-consciously. The gentleman nods knowingly. The gentleman places his card back in his pocket. Spider-Man looks away from the gentleman, then inclines his head and gazes at the barrier. The gentleman looks up at the level exhibit as it changes from 10 to nine. Spider-Man inclines forward and pushes a button. Later, Peter strides down a deserted pavement. He passes a barrier which has been coated with MJ's fragrance posters, presenting her soft, pretty visage. He looks at the depictions briefly, then continues on moving, a preoccupied expression on his face. He's dragging his broken scooter along behind him. Peter sits sketching in Doctor Connors' class. He's depicted his face, half Peter Parker and half Spider-Man. On a pay phone outside, MJ returns home. MJ looks annoyed. MJ gazes expectantly at the phone. She turns away. Peter slaps the phone, then shakes his head incredulously. Speaking into the receiver, he looks up and shakes his head. He hangs up. Attendees have gathered in Doctor Octavius' laboratory. Peter and Harry are among them. Octavius pulls off a dust covering to disclose a contraption with four long robotic appendages. He removes his gray lab coat. He steps onto a dais, then taps keys on a freestanding control panel. The metal harness secures into place around his waist. A robotic spine coils up onto his back. A blue computer chip at the top of the artificial spine illuminates, then a sequence of pins inserts into his skin. He winces. His audience gasps. Octavius focuses hard and gazes up at the ceiling. The four metal appendages begin to move, ascending up like serpents. On the end of each arm is a pointed claw which opens out. Octavius extends his own arms. The four robotic appendages hover above his head. Peter's eyes are wide. Apparatus units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved columns rise. Octavius controls one of the robotic arms. The claw retracts. A much smaller claw opens. A tube rises from a panel. The small claw extracts a tiny sphere from inside it. The small claw releases the sphere, which floats in the air between the four columns of the machine."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He leaps over the edge of the building and peers down at the street below. A web is tried to be fired by him, but again nothing happens. The street way below is looked at by him and he waddles slightly. He pouts and frowns. Later, an elevator is waited for by a man with a dog. The doors open and the man is about to enter when a fully suited Spider-Man is seen standing casually inside. Looking Spidey up and down, he steps into the elevator and presses a floor button. Spider-Man looks down a little self-consciously. An understanding nod is given by the man. The card is put back in his pocket by the man. Spider-Man looks away from him, then his head is bowed and the wall is stared at. The floor display is looked up at by the man as it changes from 10 to nine. A button is pressed by Spider-Man after he leans forward. Later, a deserted sidewalk is traipsed down by Peter. He passes a wall which has been plastered with MJ's perfume ads, showing her soft, pretty face. The images are looked at briefly by him, then he carries on going, a preoccupied look on his face. A broken moped is dragged along behind him. Doctor Connors' class sees Peter sitting doodling. His face, half Peter Parker and half Spider-Man, has been drawn by him. On a pay phone outside, MJ comes home. MJ appears peeved. The phone is gazed at hopefully by MJ. She turns away. The phone is slapped by Peter, then he shakes his head incredulously. Talking into the receiver, he looks up and shakes his head. The phone is hung up by him. Guests have gathered in Doctor Octavius' lab. Peter and Harry are among them. A dust sheet is pulled off by Octavius to reveal a device with four long mechanical limbs. His gray lab coat is peeled off. He steps onto a platform, then keys are tapped on a freestanding control panel by him. The metal harness is snapped into position around his waist. A mechanical spine curls up onto his back. At the top of the synthetic spine, a blue computer chip glows, then his skin is penetrated by a series of pins. He grimaces. His audience gasps. Octavius concentrates hard and stares up at the ceiling. The four metal limbs begin to move, rising up like snakes. On the end of each arm, a pointed pincer opens out. His own arms are reached out by Octavius. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are wheeled aside. The lights are turned off. Across the room stands a machine with a base from which four curved pillars rise. One of the mechanical arms is controlled by Octavius. The pincer retracts. A smaller pincer is opened. A tube rises from a panel. A tiny sphere is plucked from inside it by the small pincer. The small pincer releases the sphere, which floats in the air between the four pillars of the machine."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He leaps over the building edge and peers at the street below, attempting to fire a web, but fails. He pouts, frowning. Later, a man with a dog waits for the elevator. As the doors open, he sees a fully suited Spider-Man inside. The man enters, presses a floor button, and nods at Spidey, who looks down self-consciously. As the floor display changes, Spider-Man presses a button. Later, Peter walks down a quiet sidewalk, passing MJ's perfume ads, looking preoccupied while dragging his broken moped. In Doctor Connors' class, Peter doodles a half Peter, half Spider-Man face. At a pay phone, MJ appears peeved, gazing hopefully before turning away. Peter speaks into the receiver, then hangs up incredulously. Guests gather in Doctor Octavius' lab, including Peter and Harry. Octavius unveils a device with four mechanical limbs, shedding his lab coat as a metal harness snaps around his waist. A glowing chip inserts pins into his skin, and the audience gasps. The limbs rise like snakes, pincers opening. Peter watches with wide eyes. Equipment is moved, and the lights dim. A machine with four pillars stands across the room. Octavius controls a limb, which picks and releases a tiny sphere that floats between the machine's pillars."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He jumps over the building's edge, attempts to fire a web, but fails, pouts, and frowns. Later, a man and a dog await an elevator. The man hesitates upon seeing Spider-Man inside but then enters, aware. Spider-Man looks self-conscious. The man nods, puts his card away, and watches the display change from 10 to 9 as Spider-Man presses a button. Peter later walks down a deserted sidewalk, passing MJ's perfume ads while dragging his broken moped with a preoccupied look. In Doctor Connors' class, Peter doodles a half-Spider-Man and half-Peter face. Outside, MJ returns home, looks hopeful, then peeved, and turns away. Peter hangs up a pay phone after speaking into the receiver. Guests, including Peter and Harry, gather in Doctor Octavius' lab. Octavius unveils a device with four metal limbs, steps onto a platform, and activates it. The mechanical spine attaches to him painfully as his audience gasps. The limbs rise, controlled by Octavius, ending in pincers. Peter watches wide-eyed. The lights dim, and a machine with four pillars stands. Octavius manipulates a mechanical arm, retrieves a sphere, and releases it to float between the pillars."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a quick, athletic motion, he leaps over the edge of the building's roof, peering intently down at the bustling street far below. Attempting to fire a web to catch himself, he finds, yet again, that nothing happens, leaving him stranded. As he gazes down at the distant street below, he sways slightly and pouts, a frown forming on his face. \n\nLater, a man accompanied by his dog stands waiting for an elevator. The elevator doors slide open smoothly, and just as the man is about to step inside, he hesitates, noticing a fully suited Spider-Man standing there, looking quite casual in the confined space. As the man takes in Spider-Man's appearance from head to toe, he then steps inside, pressing a button for his floor. Spider-Man, feeling a bit self-conscious under the man's scrutiny, lowers his gaze. Recognizing the situation, the man nods in an understanding manner before returning his card to his pocket. Spider-Man averts his eyes from the man's gaze, bowing his head and staring at the elevator wall instead. The man shifts his focus to the floor display, watching attentively as the numbers change from ten to nine. Meanwhile, Spider-Man leans forward to press a button on the panel.\n\nLater still, Peter Parker makes his way down a deserted sidewalk, his steps echoing slightly. As he passes by a wall, his eyes catch sight of MJ's perfume ads plastered all over, featuring her soft, pretty face. He lingers on the images for a moment, then continues on his way with a distracted, preoccupied look on his face. Trailing behind him is his broken moped, which he drags along with visible effort. \n\nPeter finds himself sitting in Doctor Connors' class, doodling absentmindedly. He sketches a face, intriguingly split between his own visage and that of Spider-Man. Meanwhile, outside, MJ returns home, appearing rather peeved. She stands by a payphone, gazing at it with a hopeful look. Yet, she turns away, her expression falling. In response, Peter slaps the phone, shaking his head in disbelief. Speaking into the receiver, he looks up, shaking his head again before hanging up the phone.\n\nIn Doctor Octavius' lab, a group of guests has gathered, including both Peter and his friend Harry. Octavius, ready to unveil his latest creation, pulls off a dust-covered sheet to reveal a device equipped with four long, mechanical limbs. Shedding his gray lab coat, he steps onto a platform, expertly tapping keys on a freestanding control panel. The metal harness quickly snaps into place around his waist, and a synthetic spine curls up onto his back. A blue computer chip located at the top of the spine begins to glow, activating a series of pins that slide into his skin with a slight grimace. The audience gasps in unison as Octavius focuses intensely, staring upwards at the ceiling. The four metallic limbs begin to animate, rising sinuously like serpents. At the end of each arm is a pointed pincer, which slowly opens out. Octavius extends his own arms, mirroring the movement, as the four mechanical limbs hover above his head.\n\nPeter watches with wide, astonished eyes as equipment units are wheeled aside, and the room falls into darkness. Across the room stands a machine with a solid base from which four gracefully curved pillars ascend. Octavius deftly maneuvers one of the mechanical arms, retracting the pincer to reveal a much smaller one. A tube emerges from a panel, and the small pincer deftly plucks a tiny sphere from within it. The miniature pincer releases the sphere, allowing it to float gracefully in the air, suspended between the four imposing pillars of the machine."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a swift and athletic motion that spoke to his agility, he leaps over the very edge of the building's roof, his gaze fixed intently on the bustling street that stretched far below. Attempting to fire a web in the hope of catching himself mid-fall, he discovers, yet again, that nothing happens, leaving him stranded and in a precarious position. As he gazes down at the distant, busy street below, he sways slightly, and a pout forms on his lips, a frown etching its way across his face, deepening his expression of frustration.\n\nLater, a man is seen standing with his loyal dog by his side, waiting patiently for an elevator to arrive. As the elevator doors slide open smoothly, revealing the interior, just as the man is about to step inside, he hesitates for a moment, noticing that a fully suited Spider-Man is already there, looking surprisingly casual within the confined space. As the man takes in Spider-Man's appearance from head to toe, he then proceeds to step inside, pressing a button to select his floor. Spider-Man, suddenly feeling a bit self-conscious under the man's scrutinizing gaze, lowers his eyes, averting his gaze to the floor. Recognizing the situation, the man nods with an understanding smile, returning his card to his pocket. Spider-Man avoids making eye contact with the man, bowing his head and staring at the elevator wall in contemplation. The man shifts his focus to the floor display, watching intently as the numbers change from ten to nine, indicating their descent. Meanwhile, Spider-Man leans forward slightly to press a button on the control panel.\n\nLater on, Peter Parker makes his way down a deserted sidewalk, his steps echoing audibly in the silence. As he passes by a wall, his eyes catch sight of MJ’s perfume ads plastered all over it, featuring her soft and pretty face that captivates his attention. He lingers on the images for a brief moment, then continues on his way, a distracted and preoccupied look on his face. Trailing behind him with visible effort is his broken moped, which he drags along, each step a testament to his determination.\n\nPeter finds himself sitting in Doctor Connors’ class, his mind elsewhere as he doodles absentmindedly on his paper. He sketches a face, intriguingly split between his own visage and that of Spider-Man, a reflection of his dual identity. Meanwhile, outside, MJ returns home, appearing visibly peeved. She stands by a payphone, staring at it with a hopeful look, though she eventually turns away, her expression falling in disappointment. In response, Peter slaps the phone, shaking his head in disbelief. Speaking into the receiver, he looks up, shaking his head once more before finally hanging up the phone.\n\nIn Doctor Octavius’ lab, a group of intrigued guests has gathered, including both Peter and his friend Harry. Octavius, poised and ready to unveil his latest creation, pulls off a dust-covered sheet to reveal a remarkable device equipped with four long mechanical limbs. Discarding his gray lab coat, he steps onto a platform with confidence, expertly tapping keys on a freestanding control panel. The metal harness clicks into place around his waist, and a synthetic spine extends up onto his back, a blue computer chip located at the top begins to glow. The activation of a series of pins that slide into his skin causes him to grimace slightly. The audience lets out a collective gasp as Octavius focuses with intense concentration, staring upward at the ceiling. The four metallic limbs start to animate, rising sinuously like serpents. At the end of each arm is a pointed pincer, which slowly and deliberately opens out. Octavius extends his own arms, mirroring the movement, as the four mechanical limbs hover above his head in a display of coordination.\n\nPeter watches with wide, astonished eyes as equipment units are expertly wheeled aside, and the room gradually falls into darkness. Across the room stands a machine with a solid base from which four gracefully curved pillars ascend, reaching toward the ceiling. Octavius deftly maneuvers one of the mechanical arms, its movements precise, retracting the larger pincer to reveal a much smaller and more delicate one. A tube emerges from a panel, and the small pincer deftly plucks a tiny sphere from within it. The miniature pincer releases the sphere, allowing it to float gracefully in the air, suspended perfectly between the four imposing pillars of the machine, a spectacle that captures everyone's attention."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He leaps energetically over the edge of the building, his feet leaving the solid ground as he propels himself forward, heart pounding with the thrill of the descent. As he peers intensely down at the street below, his eyes quickly scan the distance and the bustling scene far beneath him, his mind racing with the possibilities. With determination, he attempts to fire a web from his wrist, focusing on the familiar motion, but nothing materializes, leaving him momentarily puzzled. He glances down once more at the faraway street, the height intimidating yet strangely exhilarating, and finds himself wobbling slightly, struggling to maintain his balance on the precarious perch. A pout forms on his lips, a frown following as disappointment settles in, creasing his brow. Later on, a man stands beside a dog, patiently waiting for the elevator to arrive. The mechanical hum signals the approach, and as the doors glide open, the man steps forward, ready to enter, but halts abruptly upon noticing a fully suited Spider-Man standing nonchalantly inside the elevator. His eyes travel up and down the superhero's figure, taking in every detail of the iconic costume. Hesitant but intrigued, he steps into the elevator, his hand reaching out to press a floor button. Spider-Man, feeling a flicker of self-consciousness under the man's gaze, looks down, avoiding eye contact. With a knowing nod, the man silently acknowledges the situation, tucking a card back into his pocket, a gesture of understanding passing between them. Spider-Man's gaze shifts away from the man, his head bowing slightly as he directs his attention to the wall in front of him, deep in thought. The man’s eyes drift upwards to the floor display, observing the numbers change, a transition from 10 to nine catching his attention. Spider-Man leans forward, extending his arm to press a button, breaking the silence with a soft click. Time passes, and Peter finds himself traipsing along a deserted sidewalk, the empty stretch of pavement echoing his solitary footsteps. As he moves forward, he passes by a wall adorned with the vibrant, alluring ads of MJ's perfume, her soft, pretty face staring back at him from each poster. His eyes linger momentarily on the familiar images before resuming his walk, his expression clouded with a preoccupied look as thoughts swirl in his mind. His hand grips the handle of his broken moped, dragging it laboriously behind him, its weight a persistent reminder of his troubles. In Doctor Connors' class, Peter sits at his desk, mindlessly doodling in his notebook. His pen traces lines that form his face, an intricate blend of Peter Parker and Spider-Man, a dual identity captured on paper. Outside, MJ stands at a pay phone, having just arrived home, her expression a mix of irritation and hope. She gazes at the phone with a sense of longing, her eyes flickering with a glimmer of expectation, but soon, her hopes falter, and she turns away, disappointment etched into her features. Meanwhile, Peter slaps the phone in frustration, his hand hitting the device with a sharp smack, followed by a shake of his head in disbelief at the situation. As he speaks into the receiver, he glances upwards, shaking his head again, before hanging up the phone, ending the call with a resigned sigh. Meanwhile, in Doctor Octavius' lab, the atmosphere is charged with anticipation as guests gather around, Peter and Harry among them, eager to witness the unveiling of Octavius' latest creation. With a dramatic flourish, Octavius pulls off a dust sheet to reveal a complex device adorned with four long mechanical limbs, the intricate design capturing the attention of the crowd. He removes his gray lab coat, tossing it aside, and confidently steps onto a platform, his fingers tapping rapidly on a freestanding control panel. A metal harness clicks into place around his waist, securing him firmly, while a mechanical spine extends upwards, curling onto his back with a precise movement. At the top of this synthetic spine, a blue computer chip emits a soft glow, the electrical components coming to life as a series of pins slide into his skin, causing him to grimace in discomfort. The audience collectively gasps, their eyes fixed on the unfolding spectacle. Concentrating intently, Octavius fixes his gaze on the ceiling, willing the four metal limbs to animate, and they begin to move, rising with a serpentine grace. Each arm ends in a pointed pincer, which unfurls, revealing its intricate mechanism. With deliberate focus, Octavius reaches out his own arms, mirroring the movement of the mechanical limbs that hover above his head, their presence both awe-inspiring and intimidating. Peter watches, his eyes wide with a mix of astonishment and intrigue. Around him, equipment units are quietly wheeled aside, clearing the space as the lights dim, casting a dramatic ambiance over the scene. Across the room, a machine stands tall, its base supporting four curved pillars that arch upwards. Octavius, now in control of one of the mechanical arms, skillfully retracts the main pincer, unveiling a much smaller and more precise pincer within. From a nearby panel, a tube rises, presenting a tiny sphere, which the small pincer deftly plucks, handling the delicate object with care. As the small pincer releases the sphere, it floats serenely in the air, suspended between the four pillars of the machine, a testament to the ingenuity and ambition of Octavius' groundbreaking work."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He leaps over the edge of the building, peers down, and unsuccessfully attempts to fire a web, leaving him frustrated and slightly unsteady. Later, a man with a dog hesitates before entering an elevator upon noticing Spider-Man inside. After a brief, understanding exchange, Spider-Man averts his gaze as the elevator descends. He then presses a button as the man pockets his card. Later, Peter walks down a deserted sidewalk, glancing briefly at MJ's perfume ads with a distracted look while dragging his broken moped. In Doctor Connors' class, he doodles an image of himself, half Peter Parker, half Spider-Man. Outside by a payphone, MJ appears hopeful but disappointed, turning away as Peter expresses frustration on the phone and hangs up. In Doctor Octavius' lab, guests including Peter and Harry watch Octavius unveil a device with four mechanical limbs. As he mounts the platform, a harness secures around him, and a glowing chip activates, connecting the limbs, causing him to grimace. The audience gasps as the limbs rise and open their pincers. He manipulates the arms, retracting a pincer to reveal a smaller one, which retrieves a tiny sphere and releases it to float between four pillars of a machine."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He leaps over the edge of the building, an action reminiscent of Spider-Man's acrobatic feats known from comic books, and peers down at the bustling New York City street below, alive with the sounds of traffic and pedestrians. He tries to fire a web from his web-shooters, the iconic devices invented by Peter Parker to aid in his wall-crawling abilities, but again nothing happens. He looks down at the street way below and waddles slightly, his balance faltering as his confidence wanes. He pouts and frowns, feeling the weight of failure. Later, a man with a golden retriever, a breed known for its friendly nature, is waiting for an elevator in a high-rise apartment building. The doors open and the man is about to enter when he pauses, seeing a fully suited Spider-Man, the superhero alter ego of Peter Parker, standing casually inside. Looking Spidey up and down with a mix of curiosity and awe, the man steps into the elevator and presses a floor button, perhaps to his office or home. Spider-Man looks down a little self-consciously, aware of his relatable humanity behind the mask. The man nods understandingly, recognizing the symbol of heroism but also the vulnerability beneath it. The man puts his access card, used for security clearance, back in his pocket. Spider-Man looks away from the man, then bows his head and stares at the wall, lost in his own thoughts. The man looks up at the floor display as it changes from 10 to nine, indicating their descent. Spider-Man leans forward and presses a button, perhaps out of habit or a desire to feel in control. Later, Peter traipses down a deserted New York sidewalk, a city known for its unending hustle and bustle even at odd hours. He passes a wall which has been plastered with MJ's perfume ads, showing her soft, pretty face, evidence of her rising career as a model and actress. He looks at the images briefly, then carries on going, a preoccupied look on his face as he contemplates his double life. He's dragging his broken moped, a once reliable mode of transport for the young college student, along behind him. Peter sits doodling in Doctor Connors' class, a lecture on advanced biology by one of his mentors at Empire State University. He's drawn his face, half Peter Parker and half Spider-Man, symbolizing his internal conflict. On a pay phone outside, an anachronism in the age of cell phones, MJ comes home, perhaps from a long day of auditions or photo shoots. MJ looks peeved, her expression suggesting frustration or disappointment. MJ gazes hopefully at the phone, perhaps expecting a call from Peter himself. She turns away, her hopes dashed. Peter slaps the phone, then shakes his head incredulously, expressing disbelief at a missed opportunity. Talking into the receiver, he looks up and shakes his head, realizing the futility of his actions. He hangs up, feeling a pang of regret. Guests have gathered in Doctor Octavius' lab, a high-tech environment filled with scientific equipment. Peter and Harry, longtime friends and rivals, are amongst them. Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs, his bold invention designed for groundbreaking scientific experiments. He peels off his gray lab coat, ready for a demonstration. He steps onto a platform, then taps keys on a freestanding control panel, a custom interface for operating his device. The metal harness snaps into position around his waist, securing him in place. A mechanical spine curls up onto his back, merging man and machine. A blue computer chip at the top of the synthetic spine glows, indicating its activation, then a series of pins slide into his skin, interfacing with his nervous system. He grimaces, enduring the discomfort for the sake of science. His audience gasps, witnessing the merging of human and technology. Octavius concentrates hard and stares up at the ceiling, directing his focus. The four metal limbs begin to move, rising up like snakes, displaying their agility and strength. On the end of each arm is a pointed pincer which opens out, engineered for precision handling. Octavius reaches out his own arms, mirroring the motion. The four mechanical limbs hover above his head, poised for action. Peter's eyes are wide, reflecting a mix of awe and concern. Equipment units are wheeled aside, making room for the ambitious experiment. The lights go out, heightening the drama of the moment. Across the room stands a machine with a base from which four curved pillars rise, part of a fusion experiment aimed at harnessing renewable energy. Octavius controls one of the mechanical arms with a thought, demonstrating the seamless integration of human command. The pincer retracts with smooth fluidity. A much smaller pincer opens, designed for delicate tasks. A tube rises from a panel, containing a sample for the experiment. The small pincer plucks a tiny sphere from inside it, a model of sustainable energy. The small pincer releases the sphere, which floats in the air between the four pillars of the machine, as the guests watch in rapt attention."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Later Peter traipses down a deserted sidewalk He leaps over the edge of the building and peers down at the street below He tries to fire a web but again nothing happens He looks down at the street way below and waddles slightly He pouts and frowns half Peter Parker and half SpiderMan Later a man with a dog is waiting for an elevator The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside Looking Spidey up and down the man steps into the elevator and presses a floor button SpiderMan looks down a little selfconsciously Peter's eyes are wide SpiderMan leans forward and presses a button He steps onto a platform then taps keys on a freestanding control panel The man nods understandingly A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin The man puts his card back in his pocket Octavius reaches out his own arms SpiderMan looks away from the man then bows his head and stares at the wall The man looks up at the floor display as it changes from 10 to nine SpiderMan leans forward and presses a button On the end of each arm is a pointed pincer which opens out Later Peter traipses down a deserted sidewalk He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face He hangs up Octavius controls one of the mechanical arms He looks at the images briefly then carries on going a preoccupied look on his face He is dragging his broken moped along behind him Peter sits doodling in Doctor Connors' class He is drawn his face half Peter Parker and half SpiderMan On a pay phone outside MJ comes home He looks down at the street way below and waddles slightly MJ looks peeved MJ gazes hopefully at the phone MJ looks peeved She turns away Peter slaps the phone then shakes his head incredulously Talking into the receiver he looks up and shakes his head the man steps into the elevator and presses a floor button He hangs up Guests have gathered in Doctor Octavius' lab Peter and Harry are amongst them His audience gasps Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs He peels off his gray lab coat He steps onto a platform then taps keys on a freestanding control panel The man looks up at the floor display as it changes from 10 to nine The metal harness snaps into position around his waist The small pincer releases the sphere which floats in the air between the four pillars of the machine A mechanical spine curls up onto his back A tube rises from a panel He tries to fire a web but again nothing happens A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin Across the room stands a machine with a base from which four curved pillars rise He grimaces The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside His audience gasps Octavius concentrates hard and stares up at the ceiling Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs The four metal limbs begin to move rising up like snakes On the end of each arm is a pointed pincer which opens out Octavius reaches out his own arms The four mechanical limbs hover above his head SpiderMan looks down a little selfconsciously Peter's eyes are wide Equipment units are wheeled aside Looking Spidey up and down The lights go out The pincer retracts A mechanical spine curls up onto his back Across the room stands a machine with a base from which four curved pillars rise He is dragging his broken moped along behind him Octavius controls one of the mechanical arms The pincer retracts A much smaller pincer opens He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face A tube rises from a panel The small pincer plucks a tiny sphere from inside it The small pincer releases the sphere which floats in the air between the four pillars of the machine"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He leaps over the edge of the building and peers down at the street below. He tries to fire a web but again nothing happens. He looks down at the street way below and waddles slightly. He pouts and frowns. Later a man with a dog is waiting for an elevator. The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside. Looking Spidey up and down. the man steps into the elevator and presses a floor button. SpiderMan looks down a little selfconsciously. The man nods understandingly. The man puts his card back in his pocket. SpiderMan looks away from the man then bows his head and stares at the wall. The man looks up at the floor display as it changes from 10 to nine. SpiderMan leans forward and presses a button. Later Peter traipses down a deserted sidewalk. He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face. He looks at the images briefly then carries on going a preoccupied look on his face. He is dragging his broken moped along behind him. Peter sits doodling in Doctor Connors' class. He is drawn his face. half Peter Parker and half SpiderMan. On a pay phone outside MJ comes home. MJ looks peeved. MJ gazes hopefully at the phone. She turns away. Peter slaps the phone then shakes his head incredulously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Talking into the receiver he looks up and shakes his head. He hangs up. Guests have gathered in Doctor Octavius' lab. Peter and Harry are amongst them. Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs. He peels off his gray lab coat. He steps onto a platform then taps keys on a freestanding control panel. The metal harness snaps into position around his waist. A mechanical spine curls up onto his back. A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin. He grimaces. His audience gasps. Octavius concentrates hard and stares up at the ceiling. The four metal limbs begin to move rising up like snakes. On the end of each arm is a pointed pincer which opens out. Octavius reaches out his own arms. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved pillars rise. Octavius controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere which floats in the air between the four pillars of the machine."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He leaps over the edge of the building and peers down at the street below. He tries to fire a web but again nothing happens. He looks down at the street way below and waddles slightly. He pouts and frowns. Later a man with a dog is waiting for an elevator. The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside. Looking Spidey up and down. the man steps into the elevator and presses a floor button. SpiderMan looks down a little selfconsciously. The man nods understandingly. The man puts his card back in his pocket. SpiderMan looks away from the man then bows his head and stares at the wall. The man looks up at the floor display as it changes from 10 to nine. SpiderMan leans forward and presses a button. Later Peter traipses down a deserted sidewalk. He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face. He looks at the images briefly then carries on going a preoccupied look on his face. He is dragging his broken moped along behind him. Peter sits doodling in Doctor Connors' class. He is drawn his face. half Peter Parker and half SpiderMan. On a pay phone outside MJ comes home. MJ looks peeved. MJ gazes hopefully at the phone. She turns away. Peter slaps the phone then shakes his head incredulously. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Talking into the receiver he looks up and shakes his head. He hangs up. Guests have gathered in Doctor Octavius' lab. Peter and Harry are amongst them. Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs. He peels off his gray lab coat. He steps onto a platform then taps keys on a freestanding control panel. The metal harness snaps into position around his waist. A mechanical spine curls up onto his back. A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin. He grimaces. His audience gasps. Octavius concentrates hard and stares up at the ceiling. The four metal limbs begin to move rising up like snakes. On the end of each arm is a pointed pincer which opens out. Octavius reaches out his own arms. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved pillars rise. Octavius controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere which floats in the air between the four pillars of the machine."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He leaps over the edge of the building and peers down at the street below. He tries to fire a web but again nothing happens. He looks down at the street way below and waddles slightly. He pouts and frowns. Later a man with a dog is waiting for an elevator. The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside. Looking Spidey up and down. the man steps into the elevator and presses a floor button. SpiderMan looks down a little selfconsciously. The man nods understandingly. The man puts his card back in his pocket. SpiderMan looks away from the man then bows his head and stares at the wall. The man looks up at the floor display as it changes from 10 to nine. The four metal limbs begin to move rising up like snakes. On the end of each arm is a pointed pincer which opens out. Octavius reaches out his own arms. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved pillars rise. Octavius controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere which floats in the air between the four pillars of the machine."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He leaps over the edge of the building and peers down at the street below. He tries to fire a web but again nothing happens. He looks down at the street way below and waddles slightly. He pouts and frowns. Later a man with a dog is waiting for an elevator. Octavius controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere which floats in the air between the four pillars of the machine."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog leaps over the edge of the building and peers down at the street below. The dog tries to fire a web, but again nothing happens. The dog looks down at the street way below and waddles slightly. The dog pouts and frowns. Later, a cat with a bird is waiting for an elevator. The doors open and the cat is about to enter when the cat pauses, seeing a fully suited Batman standing casually inside. Looking Batman up and down, the cat steps into the elevator and presses a floor button. Batman looks down a little self-consciously. The cat nods understandingly. The cat puts the card back in its pocket. Batman looks away from the cat, then bows his head and stares at the wall. The cat looks up at the floor display as it changes from 10 to nine. Batman leans forward and presses a button. Later, an elephant traipses down a deserted sidewalk. The elephant passes a wall which has been plastered with MJ's perfume ads, showing her soft, pretty face. The elephant looks at the images briefly, then carries on going, a preoccupied look on its face. It's dragging a broken skateboard along behind it. The elephant sits doodling in Doctor Seuss' class. It's drawn its face, half Dumbo and half Batman. On a pay phone outside, Superman comes home. Superman looks peeved. Superman gazes hopefully at the phone. Superman turns away. The elephant slaps the phone, then shakes its head incredulously. Talking into the receiver, the elephant looks up and shakes its head. It hangs up. Dinosaurs have gathered in Shrek's lab. The elephant and a rabbit are amongst them. Shrek pulls off a dust sheet to reveal a device with four long mechanical limbs. Shrek peels off its gray lab coat. Shrek steps onto a platform, then taps keys on a freestanding control panel. The metal harness snaps into position around Shrek's waist. A mechanical spine curls up onto Shrek's back. A blue computer chip at the top of the synthetic spine glows, then a series of pins slide into Shrek's skin. Shrek grimaces. Its audience gasps. Shrek concentrates hard and stares up at the ceiling. The four metal limbs begin to move, rising up like snakes. On the end of each arm is a pointed pincer which opens out. Shrek reaches out its own arms. The four mechanical limbs hover above Shrek's head. The elephant's eyes are wide. Equipment units are wheeled aside. The lights go out. Across the room stands a machine with a base from which four curved pillars rise. Shrek controls one of the mechanical arms. The pincer retracts. A much smaller pincer opens. A tube rises from a panel. The small pincer plucks a tiny sphere from inside it. The small pincer releases the sphere, which floats in the air between the four pillars of the machine."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He leaps over the edge of the skyscraper and peers down at the river below. He tries to fire a dart, but again nothing happens. He looks down at the river way below and sways slightly. He pouts and frowns. Later, a woman with a parrot is waiting for a tram. The doors open and the woman is about to enter when she pauses, seeing a fully suited Spider-Man standing casually inside. Looking Spidey up and down, the woman steps into the tram and presses a bell button. Spider-Man looks down a little self-consciously. The woman nods understandingly. The woman puts her ticket back in her bag. Spider-Man looks away from the woman, then bows his head and stares at the window. The woman looks up at the stop display as it changes from Park Street to Elm Street. Spider-Man leans forward and presses a button. Later, Peter traipses down a deserted boardwalk. He passes a fence which has been plastered with MJ's concert posters, showing her soft, pretty face. He looks at the images briefly, then carries on going, a preoccupied look on his face. He's dragging his broken skateboard along behind him. Peter sits doodling in Doctor Connors' lab. He's drawn his face, half Peter Parker and half Spider-Man. On a vending machine outside, MJ comes home. MJ looks peeved. MJ gazes hopefully at the button. She turns away. Peter slaps the vending machine, then shakes his head incredulously. Talking into the speaker, he looks up and shakes his head. He hangs up. Guests have gathered in Doctor Octavius' workshop. Peter and Harry are amongst them. Octavius pulls off a tarp to reveal a contraption with four long mechanical digits. He peels off his blue blazer. He steps onto a podium, then taps keys on a handheld control unit. The metal girdle snaps into position around his waist. A mechanical tail curls up onto his back. A green computer chip at the top of the artificial tail glows, then a series of needles slide into his skin. He grimaces. His audience gasps. Octavius concentrates hard and stares up at the rafters. The four metal digits begin to move, rising up like vines. On the end of each digit is a pointed claw which opens out. Octavius reaches out his own arms. The four mechanical digits hover above his head. Peter's eyes are wide. Storage boxes are wheeled aside. The lights go out. Across the room stands a generator with a base from which four angled posts rise. Octavius controls one of the mechanical digits. The claw retracts. A much smaller claw opens. A pipe rises from a console. The small claw plucks a tiny crystal from inside it. The small claw releases the crystal, which floats in the air between the four posts of the generator."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He bounces over the edge of the building and squints down at the street below. He attempts to whistle a tune, but again nothing happens. He glances down at the street way below and shuffles slightly. He sulks and grimaces. Later, a man with a dog is waiting for an elevator. The doors slide open and the man is about to enter when he hesitates, seeing a fully suited Spider-Man standing casually inside. Surveying Spidey up and down, the man steps into the elevator and taps a floor button. Spider-Man glances down a little self-consciously. The man smiles understandingly. The man slips his card back into his pocket. Spider-Man averts his gaze from the man, then lowers his head and examines the wall. The man peeks up at the floor display as it changes from 10 to nine. Spider-Man shifts forward and nudges a button. Later, Peter ambles down a deserted sidewalk. He strolls past a wall which has been adorned with MJ's perfume ads, showing her soft, pretty face. He glances at the images briefly, then continues on, a distracted look on his face. He's dragging his broken moped along beside him. Peter sits sketching in Doctor Connors' class. He's drawn his face, half Peter Parker and half Spider-Man. On a pay phone outside, MJ arrives home. MJ appears annoyed. MJ peeks hopefully at the phone. She turns away. Peter smacks the phone, then shrugs his shoulders incredulously. Speaking into the receiver, he glances up and shrugs his shoulders. He hangs up. Guests have gathered in Doctor Octavius' lab. Peter and Harry are amongst them. Octavius unveils a dust sheet to reveal a device with four long mechanical limbs. He removes his gray lab coat. He climbs onto a platform, then adjusts keys on a freestanding control panel. The metal harness clicks into position around his waist. A mechanical spine unfurls onto his back. A blue computer chip at the top of the synthetic spine illuminates, then a series of pins embed into his skin. He winces. His audience murmurs. Octavius focuses intently and glances up at the ceiling. The four metal limbs begin to sway, rising up like snakes. On the end of each arm is a pointed pincer which fans out. Octavius extends his own arms. The four mechanical limbs hover above his head. Peter's eyes are wide. Equipment units are pushed aside. The lights dim. Across the room stands a machine with a base from which four curved pillars extend. Octavius maneuvers one of the mechanical arms. The pincer withdraws. A much smaller pincer unfolds. A tube elevates from a panel. The small pincer picks a tiny sphere from inside it. The small pincer releases the sphere, which hovers in the air between the four pillars of the machine."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf vaults over the rim of the suitcase and gazes down at the river below. The bookshelf tries to launch a feather, but again nothing occurs. It glances down at the river way below and shuffles slightly. It sulks and grimaces. Later, a giraffe with a skateboard is waiting for a carousel. The gates open and the giraffe is about to enter when it hesitates, noticing a fully suited astronaut lounging casually inside. Observing the astronaut up and down, the giraffe steps into the carousel and taps a direction button. The astronaut glances down a little awkwardly. The giraffe nods knowingly. The giraffe tucks its map back in its pouch. The astronaut averts its gaze from the giraffe, then lowers its head and fixes its eyes on the tapestry. The giraffe looks up at the number display as it changes from purple to green. The astronaut leans forward and clicks a switch. Later, the cactus meanders down a vacant boardwalk. It passes a billboard which has been covered with a penguin's cologne ads, depicting its soft, delicate beak. It glances at the pictures briefly, then continues on its way, a distracted expression on its face. It's towing its shattered skateboard behind it. The cactus sits sketching in Chef Olivieri's kitchen. It's drawn its face, half cactus and half astronaut. On a soda machine outside, the raccoon comes home. The raccoon looks miffed. It gazes expectantly at the machine. It turns away. The cactus slaps the machine, then shakes its head in disbelief. Speaking into the nozzle, it glances up and shakes its head. It hangs up. Visitors have assembled in Doctor Bluejay's safari. The cactus and the chipmunk are among them. Bluejay removes a tablecloth to unveil a contraption with four long mechanical tentacles. It peels off its purple apron. It steps onto a diving board, then taps buttons on a floating control tablet. The metal armor snaps into place around its hips. A mechanical tail curls up onto its back. A green computer diode at the top of the synthetic tail glimmers, then a sequence of pins slides into its feathers. It winces. Its audience exhales sharply. Bluejay focuses intensely and gazes at the stars. The four metal tentacles begin to move, rising up like vines. On the end of each tentacle is a sharp hook which opens out. Bluejay extends its own wings. The four mechanical tentacles hover above its head. The cactus's eyes are wide. Furniture pieces are slid aside. The lamps go out. Across the chamber stands an apparatus with a foundation from which four twisted branches rise. Bluejay maneuvers one of the mechanical tentacles. The hook retracts. A much smaller hook unfolds. A cylinder rises from a drawer. The small hook plucks a minuscule pebble from within it. The small hook releases the pebble, which levitates in the air between the four branches of the apparatus."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He somersaults over the edge of the building and squints at the street below. He attempts to juggle a frisbee, but again nothing occurs. He glances down at the street way below and tiptoes slightly. He sulks and grimaces. Later, a gorilla with a cat is lounging by an elevator. The doors open and the gorilla is about to step in when he hesitates, spotting a fully suited Batman standing casually inside. Glancing Batman up and down, the gorilla ambles into the elevator and taps a floor button. Batman glances down a little bashfully. The gorilla smiles knowingly. The gorilla places his pencil back in his pocket. Batman gazes away from the gorilla, then lowers his head and inspects the wall. The gorilla glances up at the floor display as it shifts from 10 to nine. Batman shifts forward and rotates a lever. Later, Clark wanders down a deserted boardwalk. He strolls past a wall which has been decorated with Lois's fragrance ads, displaying her soft, pretty face. He observes the images briefly, then continues on going, a contemplative look on his face. He's dragging his battered scooter along behind him. Clark sits scribbling in Doctor Smith's class. He's drawn his face, half Clark Kent and half Superman. On a pay phone outside, Lois arrives home. Lois looks annoyed. Lois glances wistfully at the phone. She turns away. Clark taps the phone, then shakes his head skeptically. Whispering into the receiver, he gazes up and shakes his head. He hangs up. Spectators have assembled in Doctor Einstein's lab. Clark and Bruce are amongst them. Einstein pulls off a tarp to reveal a device with four lengthy robotic arms. He sheds his blue lab coat. He climbs onto a platform, then swipes keys on a freestanding control console. The metal framework secures into position around his waist. A robotic spine spirals up onto his back. A red circuit board at the top of the artificial spine illuminates, then a series of bolts slide into his skin. He winces. His audience murmurs. Einstein focuses intently and glances up at the ceiling. The four robotic limbs start to move, lifting like serpents. On the end of each arm is a sharp grasper which extends out. Einstein stretches out his own arms. The four robotic limbs hover above his head. Clark's eyes are wide. Machinery units are rolled aside. The lights dim. Across the room stands a contraption with a base from which four arching towers ascend. Einstein manipulates one of the robotic arms. The grasper retreats. A much smaller grasper deploys. A cable elevates from a console. The small grasper picks a miniature cube from inside it. The small grasper releases the cube, which hovers in the air between the four towers of the contraption."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He tumbles over the edge of the treehouse and gazes down at the river below. He attempts to launch a kite, but once more nothing occurs. He glances down at the river far below and shuffles slightly. He sighs and grimaces. Later, a man with a rabbit is waiting for a train. The doors open and the man is about to board when he hesitates, seeing a fully dressed Captain America lounging casually inside. Scanning Captain America up and down, the man steps into the train and taps a window. Captain America glances down a bit sheepishly. The man gestures knowingly. The man places his notebook back in his backpack. Captain America gazes away from the man, then lowers his head and gazes at the ceiling. The man watches the window display as it changes from six to five. Captain America tilts forward and taps a lever. Later, Peter shuffles down a crowded boardwalk. He passes a fence which has been covered with MJ's music posters, displaying her elegant, charming face. He glances at the pictures briefly, then keeps moving, a thoughtful look on his face. He's towing his damaged skateboard along behind him. Peter sits sketching in Doctor Connors' lecture. He's drawn his face, half Peter Parker and half Captain America. On a vending machine outside, MJ arrives home. MJ looks irritated. MJ stares expectantly at the vending machine. She turns away. Peter smacks the vending machine, then nods his head in disbelief. Speaking into the vending machine, he looks up and shakes his head. He walks away. Visitors have assembled in Doctor Octavius' workshop. Peter and Harry are among them. Octavius pulls off a tarp to unveil a device with four long mechanical tentacles. He removes his blue apron. He steps onto a stage, then presses buttons on a handheld remote. The metal belt clamps into place around his torso. A mechanical tail curls up onto his back. A green microchip at the top of the artificial tail lights up, then a series of needles sink into his skin. He winces. His audience gasps. Octavius focuses intently and looks up at the roof. The four metal tentacles start to move, rising up like vines. On the end of each tentacle is a sharp claw which opens up. Octavius stretches out his own arms. The four mechanical tentacles hover above his head. Peter's eyes are wide. Storage racks are rolled aside. The lights dim. Across the room stands a contraption with a base from which four twisted columns rise. Octavius maneuvers one of the mechanical tentacles. The claw retracts. A much smaller claw extends. A pipe emerges from a console. The small claw grabs a minuscule cube from within it. The small claw releases the cube, which floats in the air between the four columns of the contraption."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat vaults over the rim of the canyon and squints up at the moon above. The cat attempts to ignite a light, but again nothing ignites. The cat gazes up at the moon way above and twitches slightly. The cat sulks and grimaces. Later, a clown with a parrot is buying an escalator. The curtains part and the clown is about to exit when he hesitates, spotting a fully cloaked Batman lounging placidly outside. Scanning Batman up and down, the clown exits the escalator and flips a switch. Batman gazes up a little awkwardly. The clown gestures agreeably. The clown tucks his ticket back in his hat. Batman glances away from the clown, then nods his head and glances at the ceiling. The clown glances down at the door indicator as it shifts from 5 to four. Batman tilts sideways and flips a switch. Later, Tony wanders down a bustling highway. He tumbles past a fence which has been scribbled with Tony's vitamin ads, showing his bright, glitzy logo. He glances at the logos quickly, then hurries on moving, an absentminded look on his face. He's carrying his beaten skateboard along beside him. Tony hums sketching in Professor Allen's workshop. He's etched his logo, half Tony Stark and half Batman. At a soda machine outside, Tony rings. Tony looks beaming. Tony blinks suspiciously at the machine. He glances away. Tony kicks the machine, then nods his head happily. Chatting into the headset, he gazes down and nods his head. He walks down. Athletes have gathered in Professor Venus' gallery. Tony and Steve are amongst them. Venus pulls on a velvet cover to expose an artifact with four short mechanical tentacles. He tugs on his black raincoat. He steps off a podium, then kicks tiles on a hanging keypad. The plastic vest clamps into alignment around his shoulder. A mechanical whisker spirals down onto his front. A red electronic sticker at the base of the synthetic whisker shines, then a bundle of bolts glide onto his shoes. He chuckles. His audience gapes. Venus smiles broadly and glances down at the floor. The four plastic tentacles start to bend, curling down like vines. On the tip of each tentacle is a rounded cup which closes in. Venus picks up his own feet. The four mechanical tentacles flutter below his feet. Tony's mouth is narrow. Camera tripods are shuffled beneath. The lamps blink up. Across the chamber stands a robot with a summit from which four flat branches descend. Venus pats one of the mechanical tentacles. The cup extends. A much larger cup closes. A hose lowers from a cupboard. The large cup grabs a massive pebble from behind it. The large cup secures the pebble, which drops in the ocean under the four branches of the robot."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Standing on a building's edge, Spider-Man, unable to shoot web, looks down dejectedly. A man with a dog encounters Spider-Man in an elevator and nods understandingly when Spidey looks self-conscious. Then, Peter, dragging a broken moped, walks past MJ's perfume ads, looking preoccupied. In Doctor Connors' class, Peter doodles a half-Peter, half-Spider-Man face. Outside, MJ looks at a phone hopefully before turning away; Peter hangs up frustratedly. At Doctor Octavius' lab, Peter and Harry watch Octavius reveal a device with four mechanical limbs. Octavius, donning the device, grimaces as it connects to him, drawing gasps from the audience. He controls the limbs, which move like snakes, and uses them to manipulate a tiny sphere that floats in mid-air."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The small pincer releases the sphere which floats in the air between the four pillars of the machine The small pincer plucks a tiny sphere from inside it A tube rises from a panel A much smaller pincer opens The pincer retracts Octavius controls one of the mechanical arms Across the room stands a machine with a base from which four curved pillars rise The lights go out Equipment units are wheeled aside Peter's eyes are wide The four mechanical limbs hover above his head Octavius reaches out his own arms On the end of each arm is a pointed pincer which opens out The four metal limbs begin to move rising up like snakes Octavius concentrates hard and stares up at the ceiling His audience gasps He grimaces A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin A mechanical spine curls up onto his back The metal harness snaps into position around his waist He steps onto a platform then taps keys on a freestanding control panel He peels off his gray lab coat Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs Peter and Harry are amongst them Guests have gathered in Doctor Octavius' lab He hangs up Talking into the receiver he looks up and shakes his head Peter slaps the phone then shakes his head incredulously She turns away MJ gazes hopefully at the phone MJ looks peeved On a pay phone outside MJ comes home half Peter Parker and half SpiderMan He is drawn his face Peter sits doodling in Doctor Connors' class He is dragging his broken moped along behind him He looks at the images briefly then carries on going a preoccupied look on his face He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face Later Peter traipses down a deserted sidewalk SpiderMan leans forward and presses a button The man looks up at the floor display as it changes from 10 to nine SpiderMan looks away from the man then bows his head and stares at the wall The man puts his card back in his pocket The man nods understandingly SpiderMan looks down a little selfconsciously the man steps into the elevator and presses a floor button Looking Spidey up and down The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside Later a man with a dog is waiting for an elevator He pouts and frowns He looks down at the street way below and waddles slightly He tries to fire a web but again nothing happens He leaps over the edge of the building and peers down at the street below"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The man nods understandingly MJ gazes hopefully at the phone Peter slaps the phone then shakes his head incredulously He pouts and frowns On a pay phone outside MJ comes home Octavius concentrates hard and stares up at the ceiling He looks at the images briefly then carries on going a preoccupied look on his face The four metal limbs begin to move rising up like snakes He is drawn his face SpiderMan looks away from the man then bows his head and stares at the wall A much smaller pincer opens She turns away The metal harness snaps into position around his waist Peter and Harry are amongst them He peels off his gray lab coat Equipment units are wheeled aside Later a man with a dog is waiting for an elevator Guests have gathered in Doctor Octavius' lab The man puts his card back in his pocket Talking into the receiver he looks up and shakes his head He grimaces He leaps over the edge of the building and peers down at the street below The lights go out Peter sits doodling in Doctor Connors' class The four mechanical limbs hover above his head The small pincer plucks a tiny sphere from inside it A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin The pincer retracts Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs half Peter Parker and half SpiderMan MJ looks peeved The man looks up at the floor display as it changes from 10 to nine The small pincer releases the sphere which floats in the air between the four pillars of the machine He steps onto a platform then taps keys on a freestanding control panel Across the room stands a machine with a base from which four curved pillars rise SpiderMan leans forward and presses a button Octavius reaches out his own arms A tube rises from a panel He looks down at the street way below and waddles slightly He hangs up His audience gasps The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside A mechanical spine curls up onto his back Peter's eyes are wide Looking Spidey up and down SpiderMan looks down a little selfconsciously Later Peter traipses down a deserted sidewalk He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face He is dragging his broken moped along behind him Octavius controls one of the mechanical arms He tries to fire a web but again nothing happens the man steps into the elevator and presses a floor button On the end of each arm is a pointed pincer which opens out"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He hangs up Guests have gathered in Doctor Octavius' lab Peter and Harry are amongst them Octavius pulls off a dust sheet to reveal a device with four long mechanical limbs He peels off his gray lab coat He steps onto a platform then taps keys on a freestanding control panel The metal harness snaps into position around his waist A mechanical spine curls up onto his back A blue computer chip at the top of the synthetic spine glows then a series of pins slide into his skin He grimaces His audience gasps Octavius concentrates hard and stares up at the ceiling The four metal limbs begin to move rising up like snakes On the end of each arm is a pointed pincer which opens out Octavius reaches out his own arms The four mechanical limbs hover above his head Peter's eyes are wide Equipment units are wheeled aside The lights go out Across the room stands a machine with a base from which four curved pillars rise Octavius controls one of the mechanical arms The pincer retracts A much smaller pincer opens A tube rises from a panel The small pincer plucks a tiny sphere from inside it The small pincer releases the sphere which floats in the air between the four pillars of the machine He leaps over the edge of the building and peers down at the street below He tries to fire a web but again nothing happens He looks down at the street way below and waddles slightly He pouts and frowns Later a man with a dog is waiting for an elevator The doors open and the man is about to enter when he pauses seeing a fully suited SpiderMan standing casually inside Looking Spidey up and down the man steps into the elevator and presses a floor button SpiderMan looks down a little selfconsciously The man nods understandingly The man puts his card back in his pocket SpiderMan looks away from the man then bows his head and stares at the wall The man looks up at the floor display as it changes from 10 to nine SpiderMan leans forward and presses a button Later Peter traipses down a deserted sidewalk He passes a wall which has been plastered with MJ's perfume ads showing her soft pretty face He looks at the images briefly then carries on going a preoccupied look on his face He is dragging his broken moped along behind him Peter sits doodling in Doctor Connors' class He is drawn his face half Peter Parker and half SpiderMan On a pay phone outside MJ comes home MJ looks peeved MJ gazes hopefully at the phone She turns away Peter slaps the phone then shakes his head incredulously Talking into the receiver he looks up and shakes his head"
        }
      ]
    }
  ]
}