{
  "ground_truth": "Air pressure blows water out of compartments, and the ocean roils around the ship as it sinks deeper. Dozens of passengers still dangle from poles or lie against railings and staircases. Jack keeps one arm wrapped around Rose as they descend toward the water. One man slips off a pole and spins as he bounces off a railing. Some people behind the ship try to swim as the massive propellers sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling water covers the tail rudder and surges up the whole deck. Waves swell around the name Titanic and across the ship. With deep gulps of air, the tail end of the ship sinks beneath the surface. Underwater, Jack and Rose hold hands as they tumble in the jostling current, and the ship sinks and vanishes. Jack grabs onto Rose's life vest but is swept away by the turbulence. Rose kicks to the surface and emerges amid other flailing survivors. For at least a quarter mile, the ocean churns with panicked swimmers. Out of their grasps, one man grabs onto Rose and shoves her underwater as he tries to climb on top of her. Jack punches the hysterical man in the face until he releases Rose. Jack pulls Rose by her life vest, and they swim out of the mass of survivors. Jack leads her to a flat piece of wood floating on the surface. Rose pulls herself onto the elaborately carved panel, and Jack tries to pull himself onto the panel as well, but it tips under their combined weight. Jack holds onto the panel as he floats in the water beside her, looks down, then blinks and nods to himself. Lying on her stomach on the panel, Rose moves toward Jack and leans her forehead against his face. Their breath is visible in the cold air. He takes her hand. Clinging to a nearby piece of debris, a crewman blows into a whistle. Rose's blue lips tremble as she smiles weakly. Sitting in a lifeboat beside Molly, Ruth closes her eyes. Furrowing her brow, Molly looks around at the other people in the boat who avert their gaze. A young woman sobs. Molly glares at the crewman then sits. Beside her, Ruth presses her hands over her own ears. Elsewhere, survivors in four lifeboats work to lash the vessels together. A dark-haired crewman supervising the operation glances back toward the site of the wreck. Still clinging to wreckage, the crewman with the whistle in his mouth floats motionless with his eyes closed. Swimming a few yards away, Jack stares at the man, then turns toward Rose. Rose's lips tremble as she stares at Jack.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Atmospheric pressure forces liquid out of chambers, and the sea churns around the vessel as it descends further. Scores of travelers still hang from rods or recline against guardrails and staircases. Jack keeps one limb coiled around Rose as they move downward toward the liquid. One gentleman slips off a rod and twirls as he ricochets off a guardrail. Several individuals behind the vessel attempt to swim as the enormous propellers submerge below the exterior. Jack and Rose clasp hands as they kneel beside one another. Rose nods as the frothy liquid covers the tail fin and rushes up the entire deck. Waves rise around the designation Titanic and across the vessel. With profound breaths of air, the tail end of the vessel descends beneath the exterior. Submerged, Jack and Rose clasp hands as they tumble in the agitating current, and the vessel descends and disappears. Jack seizes onto Rose's life jacket but is carried away by the turbulence. Rose kicks to the exterior and emerges amid other flailing survivors. For at least a quarter mile, the sea agitates with frantic swimmers. Out of their grasps, one gentleman seizes onto Rose and thrusts her underwater as he attempts to climb on top of her. Jack strikes the frantic gentleman in the visage until he releases Rose. Jack pulls Rose by her life jacket, and they swim out of the crowd of survivors. Jack guides her to a flat piece of timber floating on the exterior. Rose pulls herself onto the intricately carved slab, and Jack attempts to pull himself onto the slab as well, but it tilts under their combined mass. Jack holds onto the slab as he floats in the liquid beside her, looks down, then blinks and nods to himself. Lying on her abdomen on the slab, Rose moves toward Jack and leans her forehead against his visage. Their breath is visible in the frigid air. He takes her hand. Clinging to a nearby piece of wreckage, a sailor blows into a whistle. Rose's azure lips quiver as she smiles faintly. Sitting in a lifeboat beside Molly, Ruth closes her eyes. Furrowing her brow, Molly looks around at the other individuals in the boat who avert their gaze. A young woman weeps. Molly glowers at the sailor then sits. Beside her, Ruth presses her hands over her own ears. Elsewhere, survivors in four lifeboats work to tie the vessels together. A dark-haired sailor overseeing the operation glances back toward the site of the ruin. Still clinging to debris, the sailor with the whistle in his mouth floats immobile with his eyes closed. Swimming a few yards away, Jack gazes at the gentleman, then turns toward Rose. Rose's lips quiver as she gazes at Jack."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Water is blown out of compartments by air pressure, and the ship is roiled around by the ocean as it sinks deeper. Dozens of passengers are still dangling from poles or lying against railings and staircases. One arm is kept wrapped around Rose by Jack as they are descended toward the water. A pole is slipped off by one man and he spins as a railing bounces him off. Behind the ship, some people are trying to swim as the surface is sunk below by the massive propellers. Hands are held by Jack and Rose as they are knelt beside one another. The tail rudder is covered by the bubbling water as it is nodded by Rose, and the whole deck is surged up. Around the name Titanic and across the ship, waves are swelled. With deep gulps of air, the surface is sunk beneath by the tail end of the ship. Underwater, hands are held by Jack and Rose as they are tumbled in the jostling current, and the ship is sunk and vanishes. Rose's life vest is grabbed onto by Jack but the turbulence sweeps him away. The surface is kicked to by Rose and she emerges amid other flailing survivors. The ocean is churned with panicked swimmers for at least a quarter mile. Grabbing onto Rose out of their grasps, a man shoves her underwater as he tries to climb on top of her. The hysterical man is punched by Jack in the face until Rose is released by him. Rose is pulled by her life vest by Jack, and they swim out of the mass of survivors. Her is led by Jack to a flat piece of wood floating on the surface. Onto the elaborately carved panel, Rose pulls herself, and the panel is tried to be pulled onto by Jack as well, but under their combined weight, it tips. The panel is held onto by Jack as he floats in the water beside her, looks down, then blinks and nods to himself. Lying on her stomach on the panel, Jack is moved toward by Rose and her forehead is leaned against his face. Their breath is taken by him in the cold air. Her hand is taken by him. Blowing into a whistle, a crewman clings to a nearby piece of debris. Rose's blue lips are trembled as she smiles weakly. Closing her eyes, Ruth sits in a lifeboat beside Molly. Molly furrows her brow, looking around at the other people in the boat who avert their gaze. A young woman is sobbed by her. The crewman is glared at by Molly then sits. Beside her, her hands are pressed over her own ears by Ruth. Elsewhere, survivors work in four lifeboats to lash the vessels together. The site of the wreck is glanced back toward by a dark-haired crewman supervising the operation. Motionless and with his eyes closed, the crewman with the whistle in his mouth clings to wreckage. A few yards away, the man is stared at by Jack as he swims, then he turns toward Rose. Jack is stared at by Rose as her lips tremble."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Air pressure expels water from compartments, causing the ocean to churn as the ship sinks. Passengers dangle from poles or lie against railings. Jack holds Rose as they descend. A man slips off a pole, hitting a railing. Behind the ship, people swim as propellers sink. Jack and Rose kneel together as water covers the rudder and fills the deck. Waves engulf the Titanic's name. The ship sinks, leaving Jack and Rose tumbling underwater. Jack clutches Rose's life vest but is swept away. Rose surfaces among panicked swimmers. A man grabs Rose and pushes her underwater, but Jack punches him away. Jack pulls Rose, and they swim to a floating wood panel. Rose climbs on, but it tips under both. Jack holds the panel, floating beside her, nods, and takes her hand. Nearby, a crewman whistles, and Rose weakly smiles. In a lifeboat, Molly sits with Ruth, who covers her ears. Molly notices others averting their gaze. A woman sobs, and Molly glares at a crewman. Survivors in four lifeboats lash the vessels together. A dark-haired crewman supervises and glances at the wreck site. The whistling crewman floats motionless. Jack watches him, then turns to Rose, whose lips tremble as she looks at him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Air pressure forces water out of compartments as the ocean churns around the sinking ship. Passengers hang from poles or against railings. Jack holds Rose while descending. A man slips off a pole, hits a railing, and spins. As the propellers submerge, people try to swim away. Jack and Rose kneel, holding hands. The water covers the rudder, swells over Titanic, and the ship sinks. Underwater, Jack and Rose hold hands but are separated by the current. Rose surfaces among panicked swimmers. A man grabs her, trying to climb; Jack punches him until he releases her. Jack leads Rose away, finding a floating wood panel. Rose climbs onto it, but it tips when Jack tries. Jack stays in the water, holding the panel, while Rose leans on him. Nearby, a crewman blows a whistle. Rose smiles weakly. In a lifeboat, Ruth sits with Molly, who is frustrated with the crewman. Survivors in lifeboats lash vessels together. A crewman with a whistle floats motionless. Jack, swimming away, looks at the man and then at Rose, whose lips tremble as she gazes at him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Air pressure, forcefully exerting its influence, blows water out of the numerous compartments, while the roiling ocean swirls and churns around the ship as it gradually sinks deeper and deeper into the depths. Dozens of distressed passengers still precariously dangle from poles or lie sprawled against the railings and staircases. Jack, with steadfast determination, keeps one protective arm tightly wrapped around Rose as they cautiously descend toward the ominous water. One unfortunate man loses his grip on a pole and spins uncontrollably as he bounces off a railing. Meanwhile, some desperate individuals behind the massive ship attempt to swim frantically as the colossal propellers disappear below the surface. Jack and Rose hold hands firmly as they kneel closely beside one another. Understanding their predicament, Rose nods as the frothy, bubbling water envelops the tail rudder and surges relentlessly up the entire deck. The formidable waves swell around the inscribed name Titanic and cascade across the entirety of the ship. With a series of deep, gasping breaths for air, the tail end of the ship finally succumbs and sinks beneath the surface. Submerged underwater, Jack and Rose maintain their grip on each other's hands as they tumble and spin in the jostling, chaotic current, while the ship continues to sink until it vanishes entirely. Jack, reaching out, grabs onto Rose's life vest but finds himself swept away by the turbulent waters. Rose, with determination, kicks her way to the surface and emerges amidst other flailing, struggling survivors. For a considerable distance of at least a quarter mile, the ocean churns with panicked, frenzied swimmers. Out of their grasps, one desperate man seizes Rose and shoves her underwater in his frantic attempt to climb on top of her. Jack intervenes, punching the hysterical man in the face until he releases his grip on Rose. Jack then pulls Rose by her life vest, and together they swim away from the chaotic mass of survivors. Jack guides her to a flat piece of wood floating on the surface. Rose manages to pull herself onto the elaborately carved panel, and Jack attempts to pull himself up onto the panel as well, but it tips precariously under their combined weight. Jack decides to hold onto the panel while floating beside her in the cold water. He looks downward, then blinks and nods to himself in acceptance. Lying on her stomach atop the panel, Rose moves toward Jack and leans her forehead gently against his face. In the frigid air, their breath is visible. He takes her hand, their fingers intertwined. Nearby, a crewman, clinging to another piece of debris, blows into a whistle with all his remaining strength. Rose's blue lips tremble as she musters a weak, fragile smile. Sitting in a lifeboat next to Molly, Ruth closes her eyes in despair. Furrowing her brow, Molly looks around at the other people in the boat, who avoid her gaze. A young woman sobs quietly. Molly, with fiery eyes, glares at the crewman and then sits back down. Beside her, Ruth presses her hands over her own ears in an attempt to block out the noise. Elsewhere, survivors in four lifeboats work cooperatively to lash the vessels together securely. A dark-haired crewman who is supervising the operation glances back toward the tragic site of the wreck. Still clinging to wreckage, the crewman with the whistle in his mouth floats motionless, his eyes closed in silent resignation. Swimming just a few yards away, Jack stares intently at the man, then turns his attention back to Rose. Rose's lips tremble as she continues to stare at Jack, her eyes filled with emotion."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Air pressure, with an overwhelming and forceful presence, exerts its influence as it dramatically blows water out of the numerous compartments. Meanwhile, the ocean, filled with turbulence, swirls and churns vigorously around the ship, which is gradually sinking deeper and deeper into the vast depths below. In this dire situation, dozens of distressed passengers still precariously cling to poles or find themselves sprawled against the railings and staircases. Jack, exhibiting steadfast determination and resolve, keeps one protective arm tightly wrapped around Rose, as they cautiously make their way downward toward the ominous, threatening water. Unfortunately, one unlucky man loses his grip on a pole and spins uncontrollably in the chaos, bouncing off a nearby railing. Simultaneously, some desperate individuals, positioned behind the massive ship, attempt to swim frantically as the colossal propellers vanish beneath the surface of the water. \n\nAmidst this turmoil, Jack and Rose hold hands with a firm grip as they kneel closely beside one another. Understanding the gravity of their predicament, Rose acknowledges it with a nod, just as the frothy, bubbling water envelops the tail rudder and surges relentlessly over the entire deck. The formidable waves rise around the inscribed name Titanic, cascading across every part of the ship. With a series of deep, gasping breaths for air, the tail end of the ship finally succumbs, sinking beneath the surface entirely. Submerged underwater, Jack and Rose maintain their grip on each other's hands, tumbling and spinning in the jostling, chaotic current, while the ship continues its descent until vanishing completely. Jack reaches out in an attempt to grab onto Rose's life vest but finds himself swept away by the turbulent waters. \n\nWith a determined mindset, Rose kicks her way to the surface, emerging amidst other flailing and struggling survivors. For a considerable distance, stretching at least a quarter mile, the ocean churns with panicked and frenzied swimmers. Among them, one desperate man seizes Rose and forcibly shoves her underwater in his frantic attempt to climb on top of her. Jack intervenes heroically, delivering a punch to the hysterical man's face until he releases his grip on Rose. Jack then pulls Rose by her life vest, and together, they swim away from the chaotic mass of survivors. \n\nGuiding her to a flat piece of wood floating on the surface, Rose manages to pull herself onto the elaborately carved panel. Jack attempts to pull himself up as well, but the panel tips precariously under their combined weight. He decides, with a resigned acceptance, to hold onto the panel while floating beside her in the cold, frigid water. Looking downward, he blinks and nods to himself in acceptance of their situation. Lying on her stomach atop the panel, Rose moves closer to Jack and tenderly leans her forehead against his face. In the icy air, their breath becomes visible, intertwining with the cold atmosphere. He takes her hand, intertwining their fingers in a gesture of solidarity and comfort. Nearby, a crewman, clinging desperately to another piece of debris, musters all his remaining strength to blow into a whistle. \n\nRose's blue, trembling lips form a weak, fragile smile. Sitting in a lifeboat next to Molly, Ruth closes her eyes in deep despair. Furrowing her brow, Molly looks around at the other people in the boat, noticing how they avoid her gaze. A young woman in the boat sobs quietly. Molly, with fiery eyes full of frustration, glares at the crewman before sitting back down beside her. Ruth, seated next to her, presses her hands over her ears in an attempt to block out the noise and chaos. Elsewhere, survivors in four lifeboats work cooperatively, lashing the vessels together securely. A dark-haired crewman, tasked with supervising the operation, glances back toward the tragic site of the wreck that has become a haunting memory. Still clinging to wreckage, the crewman with the whistle in his mouth floats motionless, his eyes closed in silent resignation. \n\nSwimming just a few yards away, Jack stares intently at the man and then shifts his focus back to Rose. Rose's lips tremble as she continues to gaze at Jack, her eyes welling with emotion, capturing all her hopes and fears in the vulnerable moments they share."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Air pressure forces water to burst out of the ship's compartments with great force, and the ocean becomes turbulent around the ship as it sinks deeper into the sea. Amidst this chaos, dozens of passengers are precariously hanging from poles or are sprawled against railings and staircases, trying desperately to keep their grip. Jack, with one arm securely wrapped around Rose, helps her as they make their way down toward the cold, enveloping water. As the ship tilts, a man loses his grip on a pole and, unable to regain his balance, spins uncontrollably, colliding with a railing as he falls. In the water behind the ship, some people attempt to swim, fighting against the immense drag and suction as the colossal propellers slowly disappear beneath the waves. Jack and Rose, still clutching each other's hands for support and comfort, kneel beside one another on the deck. As the water bubbles and froths, surging up across the deck, engulfing the tail rudder, Rose gives a solemn nod of acknowledgment to Jack. Waves swell mightily around the name Titanic and wash over the ship's surface. The ship's stern takes one final, deep gulp of air before it disappears beneath the surface entirely. Submerged underwater, the current jostles Jack and Rose, yet they cling tightly to each other's hands as the ship sinks from view, vanishing into the depths. Jack holds onto Rose's life vest but soon finds himself swept away by the violent turbulence. Determined, Rose kicks forcefully toward the surface, breaking through into the open air where she finds herself surrounded by other panicked survivors flailing desperately in the water. In the melee, a frantic man reaches out and grabs onto Rose, aggressively pushing her underwater as he tries to save himself by climbing on top of her. Acting quickly, Jack fights off the hysterical man with a punch to the face until he releases Rose. Jack then pulls Rose by her life vest, determined to escape the frantic throng. Together, they swim away from the mass of desperate survivors. Jack spots a flat piece of wood floating nearby and leads Rose to it. With effort, Rose pulls herself onto the intricately carved panel, securing a precarious perch. Jack attempts to climb onto the panel as well, but their combined weight causes it to tip dangerously into the water. Understanding their predicament, Jack chooses to remain in the water, clinging to the panel beside Rose. He gazes down into the icy depths with acceptance, before blinking to refocus and nodding to himself in resignation. Lying on her stomach, Rose inches toward Jack, reaching out to him and leaning her forehead gently against his face, their breaths visible in the frigid night air. Jack takes Rose's hand tenderly, providing a small measure of warmth and reassurance amidst the cold. Nearby, a crewman, clinging to his own piece of floating debris, manages to bring a whistle to his lips and blows into it, the sound piercing the night. Rose's lips, turning blue from the cold, tremble as she musters a weak smile. Meanwhile, sitting in a lifeboat next to Molly, Ruth closes her eyes, perhaps in a silent prayer or a moment of reflection. Molly furrows her brow and looks around at the other lifeboat occupants who avoid her gaze, perhaps wracked with guilt or overwhelmed by the tragedy. A young woman in the boat sobs quietly, and Molly glares at the crewman, then resumes her seat. Beside her, Ruth covers her ears, attempting to block out the overwhelming noise and emotion. Elsewhere on the water, survivors work together in four lifeboats, lashing the vessels to each other in a makeshift flotilla for safety. A dark-haired crewman overseeing the operation turns his gaze solemnly back toward the site of the wreck, watching as the remnants of the Titanic disappear. Meanwhile, the crewman with the whistle remains motionless, adrift in the water, with his eyes closed, perhaps clinging to a thin hope. Jack, swimming just a few yards away, studies the man briefly before turning his attention back to Rose, reflecting the dire situation. Rose's lips tremble again as she holds Jack's gaze, a silent communication passing between them in the cold, unforgiving night."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As air pressure expels water from compartments, the ocean churns around the sinking ship. Passengers cling to poles or collapse against railings and staircases. Jack secures Rose with one arm as they descend toward the water. A man slips, spinning off a railing, while others try to swim away as the massive propellers submerge. Holding hands, Jack and Rose kneel beside each other as the bubbling water envelops the ship's stern. With deep breaths, the tail end of the Titanic sinks. Underwater, they hold hands through the currents until the ship vanishes. Jack grabs Rose's life vest but is pulled away by turbulence. Rose surfaces amid struggling survivors. In panic, a man pulls her underwater, and Jack intervenes, punching him until he releases her. Jack guides Rose out of the crowd to a floating wooden panel. Rose climbs onto the panel, but it tips under their combined weight, so Jack remains in the water beside her. Lying on the panel, Rose leans her forehead against his face, their breath visible in the cold air. A nearby crewman blows a whistle, while Rose smiles weakly with trembling lips. Molly, alongside Ruth in a lifeboat, observes the somber scene. Elsewhere, survivors in lifeboats work to lash the vessels together as a crewman glances back at the wreck site. The crewman with the whistle floats motionless, and Jack, swimming a few yards away, glances at him before turning to Rose, who gazes back at him with trembling lips."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Air pressure, created by escaping air trapped in the ship's compartments, blows water out of compartments, and the ocean roils around the ship as it sinks deeper into the frigid North Atlantic during the infamous Titanic disaster of 1912. Dozens of passengers, wearing early 20th-century attire, still dangle from poles or lie against railings and staircases. Jack, a passenger from the lower decks aspiring for a fresh start, keeps one arm wrapped around Rose, a first-class passenger fleeing an unhappy engagement, as they descend toward the water. One man slips off a pole and spins as he bounces off a railing, reminiscent of the chaotic and desperate scenes recorded by survivors. Some people behind the ship try to swim as the massive propellers, which were hailed as engineering marvels of their time, sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling water covers the tail rudder and surges up the whole deck of the \"unsinkable\" ship that met its tragic fate. Waves swell around the name Titanic, emblazoned with pride by its creators, and across the ship. With deep gulps of air, the tail end of the ship, which once symbolized luxury and human ingenuity, sinks beneath the surface. Underwater, Jack and Rose hold hands as they tumble in the jostling current, and the ship sinks and vanishes from sight in the dark depths. Jack grabs onto Rose's life vest, one of the sparse life-saving apparatuses available, but is swept away by the turbulence. Rose kicks to the surface and emerges amid other flailing survivors desperate in the icy waters. For at least a quarter mile, the ocean, historically documented in the aftermath, churns with panicked swimmers. Out of their grasps, one man, driven by survival instincts, grabs onto Rose and shoves her underwater as he tries to climb on top of her. Jack punches the hysterical man in the face until he releases Rose, showcasing the dire struggle for survival. Jack pulls Rose by her life vest, and they swim out of the mass of survivors toward safety. Jack leads her to a flat piece of wood floating on the surface, which is actually an ornate door panel from the ship's luxurious interior. Rose pulls herself onto the elaborately carved panel, and Jack tries to pull himself onto the panel as well, but it tips under their combined weight, illustrating the delicate balance needed to survive. Jack holds onto the panel as he floats in the water beside her, looks down, then blinks and nods to himself, a decision that echoes throughout historical narratives of sacrifice. Lying on her stomach on the panel, Rose moves toward Jack and leans her forehead against his face, sharing a moment of profound connection amid tragedy. Their breath is visible in the cold air, a testament to the freezing temperatures that night. He takes her hand. Clinging to a nearby piece of debris, a crewman, part of the skeleton crew left behind, blows into a whistle to attract attention. Rose's blue lips tremble as she smiles weakly, showing her determination to survive despite the freezing conditions. Sitting in a lifeboat beside Molly, the indefatigable Molly Brown, known for her leadership during the disaster, Ruth closes her eyes. Furrowing her brow, Molly looks around at the other people in the boat who avert their gaze, highlighting the survivor's guilt many felt. A young woman sobs, mourning the vast loss of life. Molly glares at the crewman then sits, determined to hold the group together. Beside her, Ruth presses her hands over her own ears, overwhelmed by the cries and chaos. Elsewhere, survivors in four lifeboats, part of the limited evacuation capacity, work to lash the vessels together for stability. A dark-haired crewman supervising the operation glances back toward the site of the wreck, unable to forget the scene behind. Still clinging to wreckage, the crewman with the whistle in his mouth floats motionless with his eyes closed, succumbing to hypothermia. Swimming a few yards away, Jack stares at the man, then turns toward Rose, both bearing the heavy reality of the catastrophe. Rose's lips tremble as she stares at Jack, a haunting reminder of the loss witnessed that historic night."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper Jack leads her to a flat piece of wood floating on the surface Dozens of passengers still dangle from poles or lie against railings and staircases Jack keeps one arm wrapped around Rose as they descend toward the water One man slips off a pole and spins as he bounces off a railing Some people behind the ship try to swim as the massive propellers sink below the surface Jack and Rose hold hands as they kneel beside one another Rose nods as the bubbling water covers the tail rudder and surges up the whole deck Waves swell around the name Titanic and across the ship Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper With deep gulps of air the tail end of the ship sinks beneath the surface Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes Jack grabs onto Rose's life vest but is swept away by the turbulence one man grabs onto Rose and shoves her underwater as he tries to climb on top of her Rose kicks to the surface and emerges amid other flailing survivors Their breath is visible in the cold air For at least a quarter mile the ocean churns with panicked swimmers Out of their grasps Jack keeps one arm wrapped around Rose as they descend toward the water one man grabs onto Rose and shoves her underwater as he tries to climb on top of her Rose's lips tremble as she stares at Jack Jack punches the hysterical man in the face until he releases Rose Jack pulls Rose by her life vest and they swim out of the mass of survivors Jack leads her to a flat piece of wood floating on the surface Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face Rose nods as the bubbling water covers the tail rudder and surges up the whole deck Their breath is visible in the cold air He takes her hand Clinging to a nearby piece of debris One man slips off a pole and spins as he bounces off a railing Molly glares at the crewman then sits Beside her a crewman blows into a whistle Rose's blue lips tremble as she smiles weakly Sitting in a lifeboat beside Molly Ruth closes her eyes Furrowing her brow Molly looks around at the other people in the boat who avert their gaze A young woman sobs Molly glares at the crewman then sits Beside her Ruth presses her hands over her own ears Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed Clinging to a nearby piece of debris Waves swell around the name Titanic and across the ship Elsewhere survivors in four lifeboats work to lash the vessels together Rose's blue lips tremble as she smiles weakly Jack punches the hysterical man in the face until he releases Rose A darkhaired crewman supervising the operation glances back toward the site of the wreck Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed Swimming a few yards away Jack stares at the man then turns toward Rose Rose's lips tremble as she stares at Jack Out of their grasps With deep gulps of air the tail end of the ship sinks beneath the surface Dozens of passengers still dangle from poles or lie against railings and staircases Swimming a few yards away Jack stares at the man then turns toward Rose"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper. Dozens of passengers still dangle from poles or lie against railings and staircases. Jack keeps one arm wrapped around Rose as they descend toward the water. One man slips off a pole and spins as he bounces off a railing. Some people behind the ship try to swim as the massive propellers sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling water covers the tail rudder and surges up the whole deck. Waves swell around the name Titanic and across the ship. With deep gulps of air the tail end of the ship sinks beneath the surface. Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes. Jack grabs onto Rose's life vest but is swept away by the turbulence. Rose kicks to the surface and emerges amid other flailing survivors. For at least a quarter mile the ocean churns with panicked swimmers. Out of their grasps. one man grabs onto Rose and shoves her underwater as he tries to climb on top of her. Jack punches the hysterical man in the face until he releases Rose. Jack pulls Rose by her life vest and they swim out of the mass of survivors. Jack leads her to a flat piece of wood floating on the surface. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight. Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself. Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face. Their breath is visible in the cold air. He takes her hand. Clinging to a nearby piece of debris. a crewman blows into a whistle. Rose's blue lips tremble as she smiles weakly. Sitting in a lifeboat beside Molly. Ruth closes her eyes Furrowing her brow. Molly looks around at the other people in the boat who avert their gaze. A young woman sobs. Molly glares at the crewman then sits Beside her. Ruth presses her hands over her own ears. Elsewhere survivors in four lifeboats work to lash the vessels together. A darkhaired crewman supervising the operation glances back toward the site of the wreck. Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed. Swimming a few yards away Jack stares at the man then turns toward Rose. Rose's lips tremble as she stares at Jack."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper. Dozens of passengers still dangle from poles or lie against railings and staircases. Jack keeps one arm wrapped around Rose as they descend toward the water. One man slips off a pole and spins as he bounces off a railing. Some people behind the ship try to swim as the massive propellers sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling water covers the tail rudder and surges up the whole deck. Waves swell around the name Titanic and across the ship. With deep gulps of air the tail end of the ship sinks beneath the surface. Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes. Jack grabs onto Rose's life vest but is swept away by the turbulence. Rose kicks to the surface and emerges amid other flailing survivors. For at least a quarter mile the ocean churns with panicked swimmers. Out of their grasps. one man grabs onto Rose and shoves her underwater as he tries to climb on top of her. Jack punches the hysterical man in the face until he releases Rose. Jack pulls Rose by her life vest and they swim out of the mass of survivors. Jack leads her to a flat piece of wood floating on the surface. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight. Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself. Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face. Their breath is visible in the cold air. He takes her hand. Clinging to a nearby piece of debris. a crewman blows into a whistle. Rose's blue lips tremble as she smiles weakly. Sitting in a lifeboat beside Molly. Ruth closes her eyes Furrowing her brow. Molly looks around at the other people in the boat who avert their gaze. A young woman sobs. Molly glares at the crewman then sits Beside her. Ruth presses her hands over her own ears. Elsewhere survivors in four lifeboats work to lash the vessels together. A darkhaired crewman supervising the operation glances back toward the site of the wreck. Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed. Swimming a few yards away Jack stares at the man then turns toward Rose. Rose's lips tremble as she stares at Jack."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper. Dozens of passengers still dangle from poles or lie against railings and staircases. Jack keeps one arm wrapped around Rose as they descend toward the water. One man slips off a pole and spins as he bounces off a railing. Some people behind the ship try to swim as the massive propellers sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling water covers the tail rudder and surges up the whole deck. Waves swell around the name Titanic and across the ship. With deep gulps of air the tail end of the ship sinks beneath the surface. Ruth closes her eyes Furrowing her brow. Molly looks around at the other people in the boat who avert their gaze. A young woman sobs. Molly glares at the crewman then sits Beside her. Ruth presses her hands over her own ears. Elsewhere survivors in four lifeboats work to lash the vessels together. A darkhaired crewman supervising the operation glances back toward the site of the wreck. Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed. Swimming a few yards away Jack stares at the man then turns toward Rose. Rose's lips tremble as she stares at Jack."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper. Dozens of passengers still dangle from poles or lie against railings and staircases. Jack keeps one arm wrapped around Rose as they descend toward the water. One man slips off a pole and spins as he bounces off a railing. A darkhaired crewman supervising the operation glances back toward the site of the wreck. Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed. Swimming a few yards away Jack stares at the man then turns toward Rose. Rose's lips tremble as she stares at Jack."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Air pressure blows water out of compartments, and the ocean roils around the castle as it sinks deeper. Dozens of dancers still dangle from poles or lie against railings and staircases. The dragon keeps one arm wrapped around the unicorn as they descend toward the water. One squirrel slips off a pole and spins as it bounces off a railing. Some owls behind the castle try to swim as the massive propellers sink below the surface. The dragon and the unicorn hold hands as they kneel beside one another. The unicorn nods as the bubbling water covers the tail rudder and surges up the whole deck. Waves swell around the name Titanic and across the castle. With deep gulps of air, the tail end of the castle sinks beneath the surface. Underwater, the dragon and the unicorn hold hands as they tumble in the jostling current, and the castle sinks and vanishes. The dragon grabs onto the unicorn's life vest but is swept away by the turbulence. The unicorn kicks to the surface and emerges amid other flailing survivors. For at least a quarter mile, the ocean churns with panicked swimmers. Out of their grasps, one penguin grabs onto the unicorn and shoves the unicorn underwater as it tries to climb on top of the unicorn. The dragon punches the hysterical penguin in the face until it releases the unicorn. The dragon pulls the unicorn by the life vest, and they swim out of the mass of survivors. The dragon leads the unicorn to a flat piece of wood floating on the surface. The unicorn pulls itself onto the elaborately carved panel, and the dragon tries to pull itself onto the panel as well, but it tips under their combined weight. The dragon holds onto the panel as it floats in the water beside the unicorn, looks down, then blinks and nods to itself. Lying on its stomach on the panel, the unicorn moves toward the dragon and leans its forehead against the dragon's face. Their breath is visible in the cold air. It takes the unicorn's hand. Clinging to a nearby piece of debris, a wizard blows into a whistle. The unicorn's blue lips tremble as it smiles weakly. Sitting in a lifeboat beside the mermaid, the fairy closes its eyes. Furrowing its brow, the mermaid looks around at the other creatures in the boat who avert their gaze. A young elf sobs. The mermaid glares at the wizard then sits. Beside it, the fairy presses its hands over its own ears. Elsewhere, survivors in four lifeboats work to lash the vessels together. A dark-haired pirate supervising the operation glances back toward the site of the wreck. Still clinging to wreckage, the wizard with the whistle in its mouth floats motionless with its eyes closed. Swimming a few yards away, the dragon stares at the wizard, then turns toward the unicorn. The unicorn's lips tremble as it stares at the dragon."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Air pressure blows jelly out of cabinets, and the lake churns around the aircraft as it descends deeper. Dozens of passengers still dangle from ropes or lie against fences and escalators. Jack keeps one arm wrapped around Rose as they descend toward the jelly. One man slips off a rope and spins as he bounces off a fence. Some people behind the aircraft try to swim as the massive wheels sink below the surface. Jack and Rose hold hands as they kneel beside one another. Rose nods as the bubbling jelly covers the tail fin and surges up the whole runway. Waves swell around the name Titan and across the aircraft. With deep gulps of air, the tail end of the aircraft sinks beneath the surface. Underwater, Jack and Rose hold hands as they tumble in the jostling current, and the aircraft sinks and vanishes. Jack grabs onto Rose's life jacket but is swept away by the turbulence. Rose kicks to the surface and emerges amid other flailing survivors. For at least a quarter mile, the lake churns with panicked swimmers. Out of their grasps, one man grabs onto Rose and shoves her underwater as he tries to climb on top of her. Jack punches the hysterical man in the face until he releases Rose. Jack pulls Rose by her life jacket, and they swim out of the mass of survivors. Jack leads her to a flat piece of metal floating on the surface. Rose pulls herself onto the elaborately carved plank, and Jack tries to pull himself onto the plank as well, but it tips under their combined weight. Jack holds onto the plank as he floats in the jelly beside her, looks down, then blinks and nods to himself. Lying on her stomach on the plank, Rose moves toward Jack and leans her forehead against his face. Their breath is visible in the cold air. He takes her hand. Clinging to a nearby piece of luggage, a crewman blows into a harmonica. Rose's blue lips tremble as she smiles weakly. Sitting in a carriage beside Molly, Ruth closes her eyes. Furrowing her brow, Molly looks around at the other people in the carriage who avert their gaze. A young woman sobs. Molly glares at the crewman then sits. Beside her, Ruth presses her hands over her own ears. Elsewhere, survivors in four carriages work to lash the vehicles together. A dark-haired crewman supervising the operation glances back toward the site of the wreck. Still clinging to luggage, the crewman with the harmonica in his mouth floats motionless with his eyes closed. Swimming a few yards away, Jack stares at the man, then turns toward Rose. Rose's lips tremble as she stares at Jack."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Air pressure fills water into compartments, and the ocean dances around the ship as it floats higher. Dozens of passengers still sit on poles or stand against railings and staircases. Jack keeps one arm extended toward Rose as they ascend away from the water. One man climbs onto a pole and slides as he swings onto a railing. Some people in front of the ship try to float as the massive propellers rise above the surface. Jack and Rose release hands as they stand beside one another. Rose shakes her head as the bubbling water uncovers the tail rudder and recedes down the whole deck. Waves calm around the name Titanic and beneath the ship. With shallow breaths of air, the tail end of the ship rises above the surface. Underwater, Jack and Rose let go of hands as they drift in the gentle current, and the ship floats and appears. Jack pushes against Rose's life vest but is pulled away by the serenity. Rose floats to the surface and surfaces among other calm survivors. For at least a quarter mile, the ocean rests with relaxed swimmers. Out of their grasps, one man reaches for Rose and gently lifts her from underwater as he tries to lie beside her. Jack pats the calm man on the shoulder until he frees Rose. Jack guides Rose by her life vest, and they float into the mass of survivors. Jack follows her to a flat piece of wood floating on the surface. Rose steadies herself onto the elaborately carved panel, and Jack waits to steady himself onto the panel as well, but it remains stable under their combined weight. Jack leans against the panel as he floats in the water beside her, looks up, then grins and nods to himself. Standing on her knees on the panel, Rose moves away from Jack and rests her forehead against his face. Their breath fades in the warm air. He releases her hand. Holding a nearby piece of debris, a crewman whispers into a whistle. Rose's blue lips still as she frowns softly. Sitting in a lifeboat beside Molly, Ruth opens her eyes. Relaxing her brow, Molly glances around at the other people in the boat who look her way. A young woman giggles. Molly smiles at the crewman then stands. Beside her, Ruth lowers her hands from her own ears. Elsewhere, survivors in four lifeboats rest separately. A dark-haired crewman watching the operation turns away from the site of the wreck. Still holding onto wreckage, the crewman with the whistle in his mouth floats animatedly with his eyes open. Resting a few yards away, Jack looks away from the man, then turns toward Rose. Rose's lips remain still as she looks away from Jack."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Air density expels juice out of lockers, and the desert churns around the balloon as it glides higher. Dozens of pilots still hang from wires or rest against fences and escalators. Matt keeps one leg wrapped around Lily as they ascend toward the shore. One child slips off a string and twirls as it bounces off a fence. Some animals behind the balloon try to leap as the enormous wheels glide above the landscape. Matt and Lily clasp hands as they crouch beside one another. Lily shakes her head as the bubbling juice covers the rudder and surges across the entire basket. Waves rise around the name Voyager and across the balloon. With deep gulps of air, the basket of the balloon glides under the landscape. Underwater, Matt and Lily grasp hands as they roll in the jostling stream, and the balloon glides and vanishes. Matt holds onto Lily's backpack but is swept away by the current. Lily paddles to the shore and surfaces amid other flailing wanderers. For at least a quarter mile, the desert froths with frantic runners. Out of their grips, one boy holds onto Lily and pushes her underwater as he tries to climb on top of her. Matt slaps the frantic boy in the head until he releases Lily. Matt pulls Lily by her backpack, and they paddle out of the crowd of runners. Matt guides her to a flat leaf floating on the shore. Lily pulls herself onto the intricately painted tablet, and Matt tries to pull himself onto the tablet as well, but it tips under their combined weight. Matt holds onto the tablet as he drifts in the juice beside her, looks down, then closes his eyes and nods to himself. Lying on her side on the tablet, Lily moves toward Matt and presses her elbow against his cheek. Their breath is visible in the chilly breeze. He takes her foot. Clinging to a nearby fragment of rubble, a guide blows into a trumpet. Lily's pale fingers shiver as she smiles weakly. Sitting in a kayak beside Betty, Carol closes her eyes. Furrowing her eyebrows, Betty looks around at the other people in the kayak who avert their faces. A young girl weeps. Betty stares at the guide then sits. Beside her, Carol places her fingers over her own eyes. Elsewhere, wanderers in four kayaks work to tie the vessels together. A blond guide directing the operation glances back toward the location of the glide. Still clinging to remnants, the guide with the trumpet in his lips floats motionless with his ears closed. Swimming a few feet away, Matt observes the boy, then turns toward Lily. Lily's fingers shiver as she gazes at Matt."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Wind gusts pushes sand out of caverns, and the desert swirls around the camel as it wanders further. Scores of tourists still perch from ledges or rest against boulders and dunes. Tom keeps one hand draped over Mary as they climb toward the summit. One woman tumbles off a ledge and flips as she collides with a boulder. Some travelers behind the camel attempt to hike as the large cactus sinks below the horizon. Tom and Mary interlock fingers as they crouch beside each other. Mary winks as the shifting sand covers the distant mountain and drifts over the whole dune. Dust storms rage around the sign Sahara and across the landscape. With long strides of wind, the tail end of the dune slides beneath the surface. Under the sand, Tom and Mary clasp hands as they roll in the shifting landscape, and the camel wanders and disappears. Tom clutches Mary's backpack but is swept away by the gusts. Mary climbs to the summit and appears amid other scrambling explorers. For at least half a mile, the desert spins with frantic hikers. Out of their sight, one woman reaches onto Mary and pulls her into the cavern as she attempts to leap over her. Tom elbows the frantic woman in the arm until she frees Mary. Tom tugs Mary by her backpack, and they trek out of the throng of wanderers. Tom directs her to a flat piece of sandstone perched on the surface. Mary hoists herself onto the meticulously etched slab, and Tom tries to lift himself onto the slab as well, but it tilts under their combined heft. Tom clutches the slab as he suspends in the sand beside her, glances down, then squints and nods silently. Lying on her side on the slab, Mary inches toward Tom and rests her cheek against his shoulder. Their sigh is visible in the hot breeze. He grasps her arm. Holding onto a nearby piece of cactus, a guide shouts into a megaphone. Mary's cracked lips quiver as she grins faintly. Reclining in a hut beside Jane, Susan shuts her eyes. Scrunching her nose, Jane peers around at the other people in the hut who avert their gaze. An elderly man weeps. Jane frowns at the guide then rests. Beside her, Susan places her fingers over her own eyes. Elsewhere, travelers in four caravans work to link the vehicles together. A red-haired guide overseeing the task glances back toward the site of the camp. Still gripping cactus, the guide with the megaphone floats motionless with his head bowed. Hiking a few yards away, Tom observes the woman, then turns toward Mary. Mary's lips quiver as she watches Tom."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Air currents lift sand from chambers, and the desert swirls around the caravan as it drifts further in. Dozens of travelers still swing from branches or lean against fences and ladders. Jack keeps one arm draped around Rose as they glide toward the sand. One man slides off a branch and twirls as he ricochets off a fence. Some people behind the caravan attempt to crawl as the enormous wheels disappear below the dunes. Jack and Rose hold hands as they crouch beside one another. Rose shakes her head as the swirling sand envelops the rear axle and spreads across the entire path. Dust storms rise around the emblem Nomadic and throughout the caravan. With enormous inhalations, the rear section of the caravan drifts under the grains. Belowground, Jack and Rose hold hands as they roll in the shifting sands, and the caravan drifts and vanishes. Jack clutches Rose's scarf but is carried away by the wind. Rose kicks to the surface and surfaces among other struggling wanderers. For at least a quarter mile, the desert spins with frantic crawlers. Out of their reaches, one man clutches Rose and pushes her below the sand as he tries to climb over her. Jack punches the panicked man in the shoulder until he releases Rose. Jack drags Rose by her scarf, and they wade out of the throng of wanderers. Jack guides her to a flat sheet of metal floating on the sand. Rose hauls herself onto the intricately welded slab, and Jack tries to hoist himself onto the slab as well, but it tips under their combined mass. Jack clings to the slab as he drifts in the sand beside her, looks up, then blinks and nods to himself. Lying on her back on the slab, Rose moves toward Jack and rests her cheek against his arm. Their breath is visible in the frigid air. He holds her hand. Holding onto a nearby piece of wreckage, a guide blows into a horn. Rose's chapped lips quiver as she smiles faintly. Sitting in a sled beside Molly, Ruth closes her eyes. Frowning, Molly scans the other people in the sled who avert their gaze. A young woman weeps. Molly glares at the guide then seats herself. Beside her, Ruth presses her hands against her own ears. Elsewhere, wanderers in four sleds work to tie the vehicles together. A dark-haired guide overseeing the task glances back toward the site of the drift. Still gripping debris, the guide with the horn in his mouth floats unmoving with his eyes closed. Crawling a few yards away, Jack gazes at the man, then turns toward Rose. Rose's lips shiver as she gazes at Jack."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Wind gusts whisk sand from caverns, and the desert quakes around the camel as it gallops upward. Scores of explorers still cling to branches or recline against boulders and hillsides. Alex keeps one leg wrapped around Sam as they climb toward the dunes. One person tumbles off a branch and twirls as they collide with a boulder. Various animals in front of the camel try to leap as the enormous caravans rise above the ground. Alex and Sam clutch palms as they crouch beside one another. Sam winks as the swirling sand engulfs the rear fender and rushes over the entire plateau. Breezes rise around the word Sahara and along the camel. With shallow gasps of wind, the rear section of the camel gallops above the ground. In the air, Alex and Sam clutch palms as they float in the shifting breeze, and the camel rises and vanishes. Alex latches onto Sam's backpack but is carried away by the windstorm. Sam kicks to the surface and appears among other grappling allies. For at least a quarter mile, the desert churns with frantic jumpers. Out of their reach, one explorer latches onto Sam and drags them underground as they attempt to perch atop them. Alex slaps the frantic explorer in the arm until they release Sam. Alex drags Sam by their backpack, and they float away from the throng of allies. Alex guides them to a broad piece of bark hovering in the air. Sam hoists themselves onto the intricately designed board, and Alex attempts to hoist themselves onto the board as well, but it stumbles under their combined presence. Alex clings to the board as he hovers in the air beside them, gazes up, then squints and nods to himself. Resting on their back on the board, Sam shifts toward Alex and rests their cheek against his shoulder. Their sighs are visible in the chilly breeze. He clutches their arm. Grasping a nearby piece of foliage, a guide blows into a horn. Sam's red cheeks quiver as they grin softly. Sitting in a wagon beside Jenny, Ann shuts her eyes. Pursing her lips, Jenny gazes around at the other friends in the wagon who turn their attention. A young man weeps. Jenny frowns at the guide then reclines. Near her, Ann places her hands over her own eyes. Farther away, allies in four wagons strive to bind the carts together. A light-haired guide overseeing the task glances ahead toward the site of the uplift. Still clasping debris, the guide with the horn in his grip hovers unmoving with his eyes open. Riding a few paces away, Alex gazes at the guide, then turns toward Sam. Sam's cheeks quiver as they gaze at Alex."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As the ocean churns around the sinking ship, Jack and Rose descend toward the water, tightly holding onto each other. They manage to stay together amidst panic and chaos as the Titanic submerges. Jack and Rose surface among panicked swimmers; Jack defends Rose from a man trying to climb onto her. Together, they reach a floating panel, but only Rose can safely lie on it, while Jack remains in the water, clinging to its side. Despite the freezing air, they share a tender moment. Nearby, a crewman blows a whistle, and Rose weakly smiles. In a lifeboat, Molly observes the somber scene as survivors begin lashing lifeboats together. Meanwhile, a crewman floats silently with a whistle in his mouth, and Jack gazes at him before turning back to Rose, whose lips tremble as she watches Jack."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rose's lips tremble as she stares at Jack Swimming a few yards away Jack stares at the man then turns toward Rose Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed A darkhaired crewman supervising the operation glances back toward the site of the wreck Elsewhere survivors in four lifeboats work to lash the vessels together Ruth presses her hands over her own ears Molly glares at the crewman then sits Beside her A young woman sobs Molly looks around at the other people in the boat who avert their gaze Ruth closes her eyes Furrowing her brow Sitting in a lifeboat beside Molly Rose's blue lips tremble as she smiles weakly a crewman blows into a whistle Clinging to a nearby piece of debris He takes her hand Their breath is visible in the cold air Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight Jack leads her to a flat piece of wood floating on the surface Jack pulls Rose by her life vest and they swim out of the mass of survivors Jack punches the hysterical man in the face until he releases Rose one man grabs onto Rose and shoves her underwater as he tries to climb on top of her Out of their grasps For at least a quarter mile the ocean churns with panicked swimmers Rose kicks to the surface and emerges amid other flailing survivors Jack grabs onto Rose's life vest but is swept away by the turbulence Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes With deep gulps of air the tail end of the ship sinks beneath the surface Waves swell around the name Titanic and across the ship Rose nods as the bubbling water covers the tail rudder and surges up the whole deck Jack and Rose hold hands as they kneel beside one another Some people behind the ship try to swim as the massive propellers sink below the surface One man slips off a pole and spins as he bounces off a railing Jack keeps one arm wrapped around Rose as they descend toward the water Dozens of passengers still dangle from poles or lie against railings and staircases Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Jack and Rose hold hands as they kneel beside one another Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face For at least a quarter mile the ocean churns with panicked swimmers Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes He takes her hand Sitting in a lifeboat beside Molly Ruth closes her eyes Furrowing her brow Some people behind the ship try to swim as the massive propellers sink below the surface a crewman blows into a whistle A young woman sobs A darkhaired crewman supervising the operation glances back toward the site of the wreck Ruth presses her hands over her own ears Elsewhere survivors in four lifeboats work to lash the vessels together Jack grabs onto Rose's life vest but is swept away by the turbulence Rose kicks to the surface and emerges amid other flailing survivors Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself Molly looks around at the other people in the boat who avert their gaze Jack pulls Rose by her life vest and they swim out of the mass of survivors Rose's lips tremble as she stares at Jack Rose nods as the bubbling water covers the tail rudder and surges up the whole deck Rose's blue lips tremble as she smiles weakly Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper Swimming a few yards away Jack stares at the man then turns toward Rose Out of their grasps Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight Jack keeps one arm wrapped around Rose as they descend toward the water Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed Molly glares at the crewman then sits Beside her Their breath is visible in the cold air One man slips off a pole and spins as he bounces off a railing Clinging to a nearby piece of debris With deep gulps of air the tail end of the ship sinks beneath the surface one man grabs onto Rose and shoves her underwater as he tries to climb on top of her Jack punches the hysterical man in the face until he releases Rose Jack leads her to a flat piece of wood floating on the surface Dozens of passengers still dangle from poles or lie against railings and staircases Waves swell around the name Titanic and across the ship"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jack holds onto the panel as he floats in the water beside her looks down then blinks and nods to himself Lying on her stomach on the panel Rose moves toward Jack and leans her forehead against his face Their breath is visible in the cold air He takes her hand Clinging to a nearby piece of debris a crewman blows into a whistle Rose's blue lips tremble as she smiles weakly Sitting in a lifeboat beside Molly Ruth closes her eyes Furrowing her brow Molly looks around at the other people in the boat who avert their gaze A young woman sobs Molly glares at the crewman then sits Beside her Ruth presses her hands over her own ears Elsewhere survivors in four lifeboats work to lash the vessels together A darkhaired crewman supervising the operation glances back toward the site of the wreck Still clinging to wreckage the crewman with the whistle in his mouth floats motionless with his eyes closed Swimming a few yards away Jack stares at the man then turns toward Rose Rose's lips tremble as she stares at Jack Air pressure blows water out of compartments and the ocean roils around the ship as it sinks deeper Dozens of passengers still dangle from poles or lie against railings and staircases Jack keeps one arm wrapped around Rose as they descend toward the water One man slips off a pole and spins as he bounces off a railing Some people behind the ship try to swim as the massive propellers sink below the surface Jack and Rose hold hands as they kneel beside one another Rose nods as the bubbling water covers the tail rudder and surges up the whole deck Waves swell around the name Titanic and across the ship With deep gulps of air the tail end of the ship sinks beneath the surface Underwater Jack and Rose hold hands as they tumble in the jostling current and the ship sinks and vanishes Jack grabs onto Rose's life vest but is swept away by the turbulence Rose kicks to the surface and emerges amid other flailing survivors For at least a quarter mile the ocean churns with panicked swimmers Out of their grasps one man grabs onto Rose and shoves her underwater as he tries to climb on top of her Jack punches the hysterical man in the face until he releases Rose Jack pulls Rose by her life vest and they swim out of the mass of survivors Jack leads her to a flat piece of wood floating on the surface Rose pulls herself onto the elaborately carved panel and Jack tries to pull himself onto the panel as well but it tips under their combined weight"
        }
      ]
    }
  ]
}