{
  "ground_truth": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles, then closes his eyes and winces, while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck, the dark-haired crewman shines his flashlight over the debris-strewn water, where frozen bodies float amid pieces of furniture, barrels, and other wreckage. Using an oar, the crewman prods several stiff corpses, and leaning over the front of the boat, a sailor pushes bodies out of their path as they row forward slowly. The crewman's flashlight beam illuminates a dead woman and infant floating in the water. Elsewhere in the debris field, Rose lies on her back atop a floating wooden panel, while Jack floats in the sea beside her, his head and arms propped above water. Rose sings to herself as she gazes up at the starry night sky, her hair and eyebrows caked with ice, turning her head as a distant light illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand, smiling and rubbing his arm, and sits up. Jack floats motionless with his eyes closed, and Rose shakes him harder, then gazes toward the lifeboat. Between them, the dead crewman floats with the whistle still in his mouth. Rose's smile fades as she stares at Jack and shakes him again; a tear trickles down her nose. Furrowing her brow, Rose chokes back tears as she strokes Jack's hand, while the lifeboat rows further away. Rose trembles as she watches it recede, then lays down her head and closes her eyes. The light of the rescuers' flashlight grows dimmer as they move on, and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand, then releases him as Jack sinks in the icy water and vanishes in the gloom. Rose slides on her stomach to the edge of the platform, then rolls into the water, her breath steaming out in clouds, and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle as the rescuers shine their lights on her. On the research ship, the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the ocean, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man takes a drink from a flask, then passes it to Cal. Elsewhere, Ruth huddles against Molly, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up and is dazed in green light.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ice shards glitter in Jack's hair as he takes her hand and kisses the back of her hand. Jack grins, then shuts his eyes and winces, while Rose shuts her eyes and leans her head against their intertwined hands. As one lifeboat returns to the site of the wreck, the dark-haired seaman shines his torch over the debris-strewn water, where frozen bodies float amid fragments of furnishings, barrels, and other wreckage. Using an oar, the seaman pokes several stiff corpses, and leaning over the front of the boat, a mariner pushes bodies out of their path as they row forward slowly. The seaman's torch beam lights up a dead woman and infant floating in the water. Elsewhere in the debris field, Rose lies on her back atop a floating wooden panel, while Jack floats in the sea beside her, his head and arms supported above water. Rose hums to herself as she gazes up at the starry night sky, her hair and eyebrows encrusted with ice, turning her head as a distant light illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand, smiling and rubbing his arm, and sits up. Jack floats motionless with his eyes closed, and Rose shakes him harder, then gazes toward the lifeboat. Between them, the dead seaman floats with the whistle still in his mouth. Rose's grin fades as she stares at Jack and shakes him again; a tear dribbles down her nose. Furrowing her brow, Rose chokes back tears as she caresses Jack's hand, while the lifeboat rows further away. Rose shivers as she watches it withdraw, then lays down her head and shuts her eyes. The light of the rescuers' torch grows dimmer as they move on, and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand, then releases him as Jack sinks in the freezing water and vanishes in the murk. Rose slides on her stomach to the edge of the platform, then rolls into the water, her breath steaming out in clouds, and swims to the frozen seaman to pull the whistle from his lips. Rose continues to blow into the whistle as the rescuers shine their lights on her. On the research vessel, the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the ocean, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man takes a drink from a flask, then passes it to Cal. Elsewhere, Ruth huddles against Molly, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up and is dazed in green light."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ice crystals sparkle in Jack's hair as her hand is taken and the back of her hand is kissed by him. A smile is shown by Jack, then his eyes are closed and a wince escapes him, while her eyes are closed by Rose and her head is leaned against their entwined hands. As the site of the wreck is returned to by one lifeboat, a flashlight is shone by the dark-haired crewman over the debris-strewn water, where floating frozen bodies are amid pieces of furniture, barrels, and other wreckage. Several stiff corpses are prodded by the crewman using an oar, and bodies are pushed out of their path by a sailor leaning over the front of the boat as they row forward slowly. A dead woman and infant floating in the water are illuminated by the crewman's flashlight beam. Elsewhere in the debris field, her back is laid on by Rose atop a floating wooden panel, while Jack is floated beside her in the sea, his head and arms propped above water. A song is sung by Rose to herself as the starry night sky is gazed up at by her, her hair and eyebrows caked with ice, her head turned by her as a distant light illuminates the side of her face. The lifeboat is passed several yards away from by her as Jack's hand is shaken, his arm rubbed, and a smile shown by her, and she sits up. Jack's motionless body is floated with his eyes closed, and he is shaken harder by Rose, then the lifeboat is gazed toward by her. Between them, the dead crewman is floated with the whistle still in his mouth. Rose's smile fades as Jack is stared at by her and shaken again; a tear trickles down her nose. Her brow is furrowed by Rose, and tears are choked back as Jack's hand is stroked by her, while further away the lifeboat rows. Rose trembles as it recedes, then her head is laid down and her eyes closed. The rescuers' flashlight grows dimmer as movement is made onward, and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. His hand is kissed by her, then he is released as Jack sinks in the icy water and vanishes in the gloom. Her stomach is slid on by Rose to the edge of the platform, then she rolls into the water, her breath steaming out in clouds, and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle as lights are shone on her by the rescuers. On the research ship, her eyes are opened by the now older Rose as tears stream down Lizzy's face. As dawn breaks over the ocean, silent sitting is done by Ismay in a lifeboat with other survivors, while in another boat, a drink is taken by a man from a flask, then he passes it to Cal. Elsewhere, Ruth is huddled against Molly, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up, and she is dazed in green light."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ice crystals glisten in Jack's hair as he kisses the back of Rose's hand. Jack smiles, then winces, while Rose leans her head against their entwined hands. A lifeboat returns to the wreck site, and a crewman shines his flashlight over debris-strewn water, where frozen bodies float among wreckage. Using an oar, the crewman prods corpses, while a sailor pushes bodies aside as they row. The flashlight reveals a dead woman and infant. Elsewhere, Rose lies on a floating wooden panel, with Jack beside her, his head and arms above water. Rose sings, gazing at the starry sky, her hair and eyebrows iced, turning as a distant light illuminates her face. The lifeboat passes nearby as she shakes Jack's hand, smiling and rubbing his arm. Jack floats motionless, and Rose shakes him harder, then looks toward the lifeboat. Between them, a dead crewman floats with a whistle in his mouth. Rose's smile fades as she stares at Jack, a tear trickling down her nose. She chokes back tears, stroking Jack's hand, as the lifeboat rows away. Rose trembles, lays down, and closes her eyes. The rescuers' flashlight dims as they move on, and Rose's eyes open as she sits up, prying her hand from Jack's grip. She kisses his hand, then releases him as Jack sinks into the icy water. Rose slides to the platform's edge, rolls into the water, and swims to the frozen crewman to take the whistle. She blows into it as rescuers shine their lights on her. On the research ship, an older Rose opens her eyes as tears stream down Lizzy's face. At dawn, Ismay sits silently in a lifeboat with survivors, while in another boat, a man drinks from a flask, passing it to Cal. Elsewhere, Ruth huddles against Molly, who stares blankly out to sea, wrapped in a blanket, her face pale in green light."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ice crystals sparkle in Jack's hair as he kisses her hand. Jack smiles, winces, and closes his eyes, while Rose leans her head against their hands. A lifeboat returns to the wreck site, and a crewman shines a flashlight over debris-strewn water with frozen bodies. Using an oar, he prods corpses, and a sailor pushes bodies aside as they row. The flashlight reveals a dead woman and infant. Rose lies on a wooden panel, Jack floating beside her. She sings, gazing at the starry sky, her hair iced, turning as a light illuminates her face. The lifeboat passes, and she shakes Jack's hand, smiling, but he floats motionless. Rose shakes him harder, then looks at the lifeboat. A dead crewman floats with a whistle in his mouth. Her smile fades as she shakes Jack again, a tear falling. She strokes Jack's hand, watching the lifeboat recede, then lays down and closes her eyes. The rescuers' light dims, and Rose sits up, prying her hand from Jack's grip. She kisses his hand, releasing him as he sinks. Rose slides into the water, swims to the crewman, and takes the whistle. She blows it as rescuers shine lights on her. On a research ship, older Rose opens her eyes as Lizzy cries. At dawn, Ismay sits silently in a lifeboat, a man drinks from a flask, passing it to Cal. Ruth huddles against Molly, who stares blankly at the sea, wrapped in a blanket, dazed in green light."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ice crystals glisten and shimmer in Jack's hair as he gently takes her hand in his own and tenderly kisses the back of it. Jack offers a warm smile, then closes his eyes and winces slightly, while Rose closes her eyes as well and leans her head gently against their entwined hands. Meanwhile, as one of the lifeboats makes its way back to the site of the tragic wreck, the dark-haired crewman aboard shines his flashlight over the water, which is strewn with debris. Here, frozen bodies float amid scattered pieces of furniture, barrels, and other remnants of the ship. Using an oar, the crewman prods several stiff corpses, and leaning over the front of the boat, a sailor carefully pushes bodies out of their path as they row forward at a slow pace. The beam of the crewman's flashlight illuminates the haunting sight of a dead woman and infant floating in the icy water. Elsewhere in this field of debris, Rose lies on her back atop a floating wooden panel, while Jack remains in the sea beside her, his head and arms propped above the water's surface. Rose softly sings to herself as she gazes up at the vast, starry night sky, her hair and eyebrows crusted with ice. She turns her head as a distant light briefly illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand, smiling and gently rubbing his arm, then sits up. Jack floats motionless with his eyes closed, and Rose shakes him more vigorously, then looks toward the lifeboat. Between them, the dead crewman floats with a whistle still in his mouth. Rose's smile fades as she stares intently at Jack and shakes him again; a single tear trickles down her nose. Furrowing her brow, Rose chokes back her tears as she tenderly strokes Jack's hand, while the lifeboat rows further away into the distance. Rose trembles as she watches it recede, then lays down her head and closes her eyes. The light from the rescuers' flashlight grows dimmer as they move on, and Rose's eyes suddenly pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand one last time, then releases him as Jack sinks slowly into the icy water and vanishes into the gloom. Rose slides on her stomach to the edge of the platform, then rolls into the water, her breath steaming out in visible clouds, and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle with all her might as the rescuers shine their lights on her. On the research ship, the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the vast ocean, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man takes a drink from a flask, then passes it to Cal. Elsewhere, Ruth huddles closely against Molly, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up and is dazed in the eerie green light."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ice crystals shimmer and glisten brightly in Jack's hair as he gently takes her hand in his own, then tenderly leans forward to kiss the back of it. With a warm smile, Jack offers her a reassuring look, then closes his eyes and winces slightly. At the same moment, Rose closes her eyes too and gently leans her head against their hands, which are entwined together. Meanwhile, as one of the lifeboats slowly makes its way back to the site of the tragic wreck, the crewman aboard, who has dark hair, shines his flashlight over the vast expanse of water, which is scattered with debris. Here, frozen bodies float amid various scattered pieces of furniture, barrels, and other remnants of the ship's wreckage. Using an oar, the crewman prods several stiff corpses, and leaning over the front of the boat, another sailor carefully pushes bodies out of their path as they row forward at a slow and cautious pace. The beam of the crewman's flashlight illuminates the haunting sight of a deceased woman and her infant floating in the icy, unforgiving water. Elsewhere within this field of wreckage, Rose lies on her back atop a floating wooden panel, while Jack remains submerged in the sea beside her, his head and arms propped above the water's surface. Rose softly sings to herself as she gazes up at the vast, starry night sky, her hair and eyebrows crusted with ice. She turns her head just as a distant light briefly illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand, smiling and gently rubbing his arm, then sits up. Jack floats motionless with his eyes closed, and Rose shakes him more vigorously, then looks toward the lifeboat. Between them, a dead crewman floats with a whistle still in his mouth. Rose's smile fades gradually as she stares intently at Jack, shaking him again; a single tear trickles down her nose. Furrowing her brow, Rose chokes back her tears as she tenderly strokes Jack's hand, while the lifeboat rows further away into the distance. Rose trembles as she watches it recede, then lays down her head and closes her eyes. The light from the rescuers' flashlight grows dimmer as they move on, and Rose's eyes suddenly pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand one last time before releasing him to sink slowly into the icy depths and vanish into the gloom. Rose then slides on her stomach to the edge of the platform, rolls into the water, her breath steaming out in visible clouds, and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle with all her might as the rescuers shine their lights on her. On the research ship, the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the vast ocean, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man takes a drink from a flask, then passes it over to Cal. Elsewhere, Ruth huddles closely against Molly, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up, dazed in the eerie green light."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ice crystals glisten in Jack's hair as he gently takes her hand, bringing it to his lips to place a tender kiss on the back of her hand. Jack's face lights up with a smile, but then he closes his eyes tightly and winces, while Rose, feeling the moment's weight, closes her eyes and leans her head against their intertwined hands, seeking comfort. Meanwhile, a lifeboat makes its way back to the site of the wreck, and a dark-haired crewman methodically shines his flashlight over the water, which is littered with debris, including pieces of furniture, barrels, and other wreckage, where frozen bodies float. With a steady hand, the crewman uses an oar to prod several stiff corpses, and as he leans over the front of the boat, a sailor carefully pushes bodies out of their path, allowing them to row forward slowly. The beam of the crewman's flashlight falls upon a tragic sight—a dead woman and infant floating in the water. Elsewhere in the debris field, Rose lies on her back atop a floating wooden panel, while Jack remains in the sea beside her, his head and arms propped above the water. Rose softly sings to herself, her gaze fixed on the starry night sky, her hair and eyebrows encrusted with ice. She turns her head slightly as a distant light casts a glow on the side of her face. The lifeboat passes several yards away from her, prompting Rose to shake Jack's hand gently, smiling as she rubs his arm and sits up. Jack, however, floats motionless with his eyes closed, leading Rose to shake him more vigorously before turning her gaze toward the lifeboat. Between them, the dead crewman floats with a whistle still in his mouth. Rose's smile fades as she stares intently at Jack, shaking him again with increasing urgency; a tear escapes, trickling down her nose. With her brow furrowed, Rose struggles to hold back her tears as she tenderly strokes Jack's hand, all the while watching the lifeboat row further away. Trembling, Rose watches it recede into the distance, then lays her head down and closes her eyes in despair. The light from the rescuers' flashlight grows dimmer as they move on, prompting Rose's eyes to snap open. She sits up abruptly and carefully pries her hand out of Jack's grip. She kisses his hand one last time before releasing him, watching as Jack sinks into the icy water and disappears into the gloom. Determined, Rose slides onto her stomach to the edge of the platform, then rolls into the water, her breath forming clouds in the frigid air, and swims to the frozen crewman to retrieve the whistle from his lips. Rose blows into the whistle with all her might as the rescuers' lights finally shine on her. On the research ship, the now older Rose opens her eyes, tears streaming down Lizzy's face as she watches. As dawn breaks over the ocean, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man takes a swig from a flask before passing it to Cal. Elsewhere, Ruth huddles against Molly, who stares blankly out to sea, her expression vacant. Wrapped in a blanket, Ruth's face is pale as she looks up, dazed in the eerie green light."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ice crystals sparkle in Jack's hair as he kisses the back of Rose's hand. They share a tender moment, eyes closed, as a lifeboat returns to the wreck site. A crewman shines a flashlight over the debris-strewn water, prodding frozen bodies with an oar and pushing them aside as the boat rows forward. The flashlight reveals a dead woman and infant among the wreckage. Nearby, Rose lies on a floating wooden panel, singing softly to herself while Jack floats beside her, his head and arms above water. As a distant light illuminates her face, Rose shakes Jack's hand, smiles, and rubs his arm, but he remains motionless. She shakes him harder, then looks toward the lifeboat, noticing a dead crewman with a whistle in his mouth. Her smile fades, and a tear falls as she strokes Jack's hand, watching the lifeboat row away. Determined, Rose sits up, pries her hand from Jack's grip, kisses his hand, and releases him as he sinks into the icy water. She slides into the water, swims to the crewman, and retrieves the whistle, blowing it as rescuers shine their lights on her. On the research ship, the older Rose opens her eyes, tears streaming down Lizzy's face. As dawn breaks, Ismay sits silently in a lifeboat with other survivors, while in another boat, a man shares a flask with Cal. Elsewhere, Ruth huddles against Molly, who stares blankly out to sea, wrapped in a blanket and dazed in the green light."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles, then closes his eyes and winces, while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck of the RMS Titanic, a passenger liner that struck an iceberg and sank in 1912, the dark-haired crewman shines his flashlight, an essential tool for night rescues, over the debris-strewn water, where frozen bodies float amid pieces of furniture, barrels, and other wreckage. Using an oar, the crewman prods several stiff corpses, and leaning over the front of the boat, a sailor pushes bodies out of their path as they row forward slowly. The crewman's flashlight beam illuminates a dead woman and infant floating in the water, a grim reminder of the tragedy. Elsewhere in the debris field, Rose lies on her back atop a floating wooden panel, which likely came from the ship's interior, while Jack floats in the sea beside her, his head and arms propped above water. Rose sings to herself as she gazes up at the starry night sky, her hair and eyebrows caked with ice, turning her head as a distant light, perhaps from another searching lifeboat, illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand, smiling and rubbing his arm, and sits up. Jack floats motionless with his eyes closed, and Rose shakes him harder, then gazes toward the lifeboat. Between them, the dead crewman floats with the whistle still in his mouth, an important device used to signal rescuers. Rose's smile fades as she stares at Jack and shakes him again; a tear trickles down her nose. Furrowing her brow, Rose chokes back tears as she strokes Jack's hand, while the lifeboat rows further away, leaving her in growing despair. Rose trembles as she watches it recede, then lays down her head and closes her eyes. The light of the rescuers' flashlight grows dimmer as they move on, and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand, then releases him as Jack sinks in the icy water, typical of the North Atlantic Ocean, and vanishes in the gloom. Rose slides on her stomach to the edge of the platform, then rolls into the water, her breath steaming out in clouds due to the frigid temperature, and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle as the rescuers shine their lights on her. On the research ship, the now older Rose opens her eyes as tears stream down Lizzy's face, a poignant moment linking past and present. As dawn breaks over the ocean, Ismay, managing director of the White Star Line which owned Titanic, sits silently in a lifeboat with other survivors, while in another boat, a man takes a drink from a flask to ward off the cold, then passes it to Cal. Elsewhere, Ruth huddles against Molly, known as the \"Unsinkable Molly Brown\" for her bravery during the disaster, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up and is dazed in green light, a surreal hue as the sun rises over the icy waters."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand  Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands  As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage  Between them the dead crewman floats with the whistle still in his mouth  Rose's smile fades as she stares at Jack and shakes him again  a tear trickles down her nose  Furrowing her brow  Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away  Rose trembles as she watches it recede then lays down her head and closes her eyes  The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip  She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom  Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips  Rose continues to blow into the whistle as the rescuers shine their lights on her  On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face  As dawn breaks over the ocean  Ismay sits silently in a lifeboat with other survivors  Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly  The crewman's flashlight beam illuminates a dead woman and infant floating in the water  Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water  Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice  turning her head as a distant light illuminates the side of her face  The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up  Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat  Between them the dead crewman floats with the whistle still in his mouth  Rose's smile fades as she stares at Jack and shakes him again  a tear trickles down her nose  Furrowing her brow  Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away  Rose trembles as she watches it recede then lays down her head and closes her eyes  The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip  She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom  Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips  Rose continues to blow into the whistle as the rescuers shine their lights on her  On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face  As dawn breaks over the ocean  Ismay sits silently in a lifeboat with other survivors  while in another boat a man takes a drink from a flask then passes it to Cal  Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression  Wrapped in a blanket her face pales as she looks up and is dazed in green light"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage. Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly. The crewman's flashlight beam illuminates a dead woman and infant floating in the water. Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water. Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice. turning her head as a distant light illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up. Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat. Between them the dead crewman floats with the whistle still in his mouth. Rose's smile fades as she stares at Jack and shakes him again. a tear trickles down her nose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Furrowing her brow. Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away. Rose trembles as she watches it recede then lays down her head and closes her eyes. The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom. Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle as the rescuers shine their lights on her. On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the ocean. Ismay sits silently in a lifeboat with other survivors. while in another boat a man takes a drink from a flask then passes it to Cal. Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression. Wrapped in a blanket her face pales as she looks up and is dazed in green light."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage. Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly. The crewman's flashlight beam illuminates a dead woman and infant floating in the water. Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water. Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice. turning her head as a distant light illuminates the side of her face. The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up. Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat. Between them the dead crewman floats with the whistle still in his mouth. Rose's smile fades as she stares at Jack and shakes him again. a tear trickles down her nose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Furrowing her brow. Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away. Rose trembles as she watches it recede then lays down her head and closes her eyes. The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom. Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips. Rose continues to blow into the whistle as the rescuers shine their lights on her. On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the ocean. Ismay sits silently in a lifeboat with other survivors. while in another boat a man takes a drink from a flask then passes it to Cal. Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression. Wrapped in a blanket her face pales as she looks up and is dazed in green light."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage. Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly. The crewman's flashlight beam illuminates a dead woman and infant floating in the water. Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water. Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice. On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face. As dawn breaks over the ocean. Ismay sits silently in a lifeboat with other survivors. while in another boat a man takes a drink from a flask then passes it to Cal. Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression. Wrapped in a blanket her face pales as she looks up and is dazed in green light."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage. while in another boat a man takes a drink from a flask then passes it to Cal. Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression. Wrapped in a blanket her face pales as she looks up and is dazed in green light."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Ice crystals sparkle in the squirrel's hair as it takes her hand and kisses the back of her hand. The squirrel smiles, then closes its eyes and winces, while the rabbit closes her eyes and leans her head against their entwined hands. As one lifeboat returns to the site of the wreck, the dark-haired dog shines its flashlight over the debris-strewn water, where frozen bodies float amid pieces of furniture, barrels, and other wreckage. Using an oar, the dog prods several stiff corpses, and leaning over the front of the boat, a penguin pushes bodies out of their path as they row forward slowly. The dog's flashlight beam illuminates a dead woman and infant floating in the water. Elsewhere in the debris field, the rabbit lies on her back atop a floating wooden panel, while the squirrel floats in the sea beside her, its head and arms propped above water. The rabbit sings to herself as she gazes up at the starry night sky, her hair and eyebrows caked with ice, turning her head as a distant light illuminates the side of her face. The lifeboat passes several yards away from her as she shakes the squirrel's hand, smiling and rubbing its arm, and sits up. The squirrel floats motionless with its eyes closed, and the rabbit shakes it harder, then gazes toward the lifeboat. Between them, the dead dog floats with the whistle still in its mouth. The rabbit's smile fades as she stares at the squirrel and shakes it again; a tear trickles down her nose. Furrowing her brow, the rabbit chokes back tears as she strokes the squirrel's hand, while the lifeboat rows further away. The rabbit trembles as she watches it recede, then lays down her head and closes her eyes. The light of the rescuers' flashlight grows dimmer as they move on, and the rabbit's eyes pop open as she sits up and pries her hand out of the squirrel's grip. She kisses its hand, then releases it as the squirrel sinks in the icy water and vanishes in the gloom. The rabbit slides on her stomach to the edge of the platform, then rolls into the water, her breath steaming out in clouds, and swims to the frozen dog to pull the whistle from its lips. The rabbit continues to blow into the whistle as the rescuers shine their lights on her. On the research ship, the now older rabbit opens her eyes as tears stream down the owl's face. As dawn breaks over the ocean, the bear sits silently in a lifeboat with other survivors, while in another boat, a fox takes a drink from a flask, then passes it to the raccoon. Elsewhere, the swan huddles against the crow, who stares out to sea with a blank expression. Wrapped in a blanket, her face pales as she looks up and is dazed in green light."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Frost glitter sparkles in Jack's hair as he takes her hand and kisses the back of her hand. Jack smiles, then closes his eyes and winces, while Rose closes her eyes and leans her head against their entwined hands. As one canoe returns to the site of the crash, the dark-haired pilot shines his lantern over the debris-filled meadow, where frozen bodies float amid pieces of sculptures, crates, and other wreckage. Using a pole, the pilot prods several stiff mannequins, and leaning over the front of the canoe, a sailor pushes forms out of their path as they paddle forward slowly. The pilot's lantern beam illuminates a dead woman and infant floating in the meadow. Elsewhere in the debris field, Rose lies on her back atop a floating metal door, while Jack floats in the pond beside her, his head and arms propped above water. Rose hums to herself as she gazes up at the cloudy night sky, her hair and eyebrows caked with frost, turning her head as a distant beacon illuminates the side of her face. The canoe passes several yards away from her as she shakes Jack's hand, smiling and rubbing his arm, and sits up. Jack floats motionless with his eyes closed, and Rose shakes him harder, then gazes toward the canoe. Between them, the dead operator floats with the bell still in his mouth. Rose's smile fades as she stares at Jack and shakes him again; a tear trickles down her cheek. Furrowing her brow, Rose chokes back tears as she strokes Jack's hand, while the canoe paddles further away. Rose trembles as she watches it recede, then lays down her head and closes her eyes. The light of the rescuers' lantern grows dimmer as they move on, and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip. She kisses his hand, then releases him as Jack sinks in the chilly pond and vanishes in the gloom. Rose slides on her stomach to the edge of the sheet, then rolls into the pond, her breath steaming out in clouds, and swims to the frozen operator to pull the bell from his lips. Rose continues to blow into the bell as the rescuers shine their lights on her. On the expedition vessel, the now older Rose opens her eyes as tears stream down Lizzy's face. As morning breaks over the meadow, Ismay sits silently in a canoe with other survivors, while in another canoe, a man takes a drink from a thermos, then passes it to Cal. Elsewhere, Ruth huddles against Molly, who stares out to the meadow with a blank expression. Wrapped in a shawl, her face pales as she looks up and is dazed in yellow light."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ice crystals shimmer in Jack's hair as he takes her hand and waves the back of her hand. Jack grins, then opens his eyes and chuckles, while Rose opens her eyes and tilts her head against their entwined hands. As one lifeboat drifts to the site of the wreck, the dark-haired crewman tosses his flashlight over the debris-strewn water, where frozen bodies drift amid pieces of furniture, barrels, and other wreckage. Using an oar, the crewman nudges several stiff corpses, and leaning over the front of the boat, a sailor pulls bodies into their path as they drift onward slowly. The crewman's flashlight beam reveals a dead woman and infant floating in the water. Elsewhere in the debris field, Rose sits up on her back atop a floating wooden panel, while Jack bobs in the sea beside her, his head and arms suspended above water. Rose hums to herself as she peers up at the starry night sky, her hair and eyebrows dusted with ice, turning her head as a distant light touches the side of her face. The lifeboat sails several yards away from her as she clasps Jack's hand, laughing and patting his arm, and stands up. Jack bobs motionless with his eyes open, and Rose clasps him harder, then peers toward the lifeboat. Between them, the dead crewman drifts with the whistle still in his mouth. Rose's grin fades as she gazes at Jack and clasps him again; a tear rolls down her nose. Furrowing her brow, Rose gulps back tears as she taps Jack's hand, while the lifeboat sails further away. Rose shivers as she observes it vanish, then lifts her head and opens her eyes. The light of the rescuers' flashlight grows fainter as they shift on, and Rose's eyes close as she stands up and pulls her hand out of Jack's grip. She pats his hand, then releases him as Jack floats in the icy water and vanishes in the gloom. Rose lies on her stomach to the edge of the platform, then tumbles into the water, her breath forming clouds, and glides to the frozen crewman to pull the whistle from his lips. Rose continues to whisper into the whistle as the rescuers cast their lights on her. On the research ship, the now older Rose closes her eyes as tears fall down Lizzy's face. As dawn colors the ocean, Ismay rests silently in a lifeboat with other survivors, while in another boat, a man shares a joke, then whispers it to Cal. Elsewhere, Ruth cuddles against Molly, who glances out to sea with a blank expression. Wrapped in a blanket, her face brightens as she looks up and is dazed in warm light."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Snowflakes twinkle in the cat's fur as it grabs the pillow and nibbles the edge of the pillow. The cat grins, then shuts its eyes and flinches, while the sunflower shuts its eyes and rests its leaf against their tangled pillows. As one bicycle returns to the scene of the breakup, the blonde horseman flashes his lantern over the cluttered snow, where sleepy books float amid pieces of bread, vases, and other misplacements. Using a broom, the horseman nudges several rigid papers, and leaning over the front of the bicycle, a dancer moves papers from their direction as they pedal forward slowly. The horseman’s lantern beam highlights a cold fish and flower drifting in the snow. Somewhere in the cluttered area, the sunflower rests on its side atop a drifting cardboard box, while the cat floats in the mist beside it, its face and paws elevated above the snow. The sunflower hums to itself as it looks up at the cloudy night sky, its petals and stem dusted with frost, turning its leaf as a distant lantern lights up the tip of its petal. The bicycle passes several rocks away from it as it shakes the cat's paw, grinning and patting its ear, and sits up. The cat stays still with its eyes shut, and the sunflower shakes it harder, then looks toward the bicycle. Between them, the sleeping horseman floats with the whistle still in its paw. The sunflower's grin fades as it stares at the cat and shakes it again; a tear drips down its petal. Knitting its brows, the sunflower stifles its cries as it caresses the cat's paw, while the bicycle pedals further away. The sunflower shakes as it watches it fade, then rests its leaf and shuts its eyes. The glow of the travelers' lantern fades as they continue on, and the sunflower's eyes pop open as it sits up and frees its paw from the cat's hold. It kisses its paw, then lets it go as the cat sinks in the frosty mist and disappears in the darkness. The sunflower slides on its side to the brink of the carton, then tumbles into the mist, its breath puffing out in clouds, and swims to the sleepy horseman to pull the whistle from its paws. The sunflower keeps blowing into the whistle as the travelers shine their lanterns on it. On the exploration train, the now ancient sunflower opens its eyes as tears stream down the moon's face. As daylight breaks over the desert, the owl sits silently in a carriage with other travelers, while in another carriage, a tree takes a sip from a bottle, then hands it to the mouse. Elsewhere, the rock leans against the hedgehog, who peers out to sea with a blank gaze. Draped in a shawl, its eyes turn pale as it glances up and is bathed in yellow light."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Ice crystals sparkle in Laura's hair as she swings his hand and pats the back of his hand. Laura grins, then opens her eyes and sighs, while Tom opens his eyes and rests his head against their entwined hands. As one canoe returns to the site of the collapse, the blond pilot twirls his flashlight over the debris-strewn water, where frozen animals float amid pieces of furniture, barrels, and other wreckage. Using an oar, the pilot nudges several stiff creatures, and leaning over the front of the boat, a rower lifts objects out of their path as they row forward slowly. The pilot's flashlight beam highlights a dead woman and infant floating in the water. Elsewhere in the debris field, Tom spins on his back atop a floating wooden panel, while Laura floats in the sea beside him, his head and arms propped above water. Tom hums to himself as he stares up at the starry night sky, his hair and eyebrows caked with ice, turning his head as a distant light illuminates the side of his face. The canoe passes several yards away from him as he nudges Laura's hand, smiling and tapping his chin, and rises up. Laura floats silently with his eyes closed, and Tom nudges him harder, then peers toward the canoe. Between them, the silent pilot floats with the whistle still in his mouth. Tom's grin fades as he stares at Laura and nudges him again; a tear rolls down his cheek. Wrinkling his brow, Tom chokes back emotions as he caresses Laura's hand, while the canoe rows further away. Tom trembles as he watches it retreat, then lays down his head and opens his eyes. The light of the observers' flashlight becomes dimmer as they depart, and Tom's eyes flash open as he rises up and disentangles his hand from Laura's grip. He pats his hand, then lets him go as Laura descends in the icy water and fades in the gloom. Tom slides on his stomach to the edge of the panel, then slips into the water, his breath puffing out in wisps, and swims to the frozen pilot to retrieve the whistle from his lips. Tom proceeds to blow into the whistle as the observers shine their lights on him. On the research ship, the now older Tom opens his eyes as tears stream down Sarah's face. As dawn breaks over the ocean, Edward sits quietly in a canoe with other observers, while in another boat, a woman takes a sip from a flask, then offers it to Eve. Elsewhere, Lucy leans against Grace, who gazes out to sea with a vacant expression. Wrapped in a coat, her face pales as she looks up and is bathed in green light."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Frosted sugar sparkles in Jack's hair as he lifts her foot and waves at the back of her foot. Jack smirks, then blinks hard and smiles, while Rose blinks softly and tips her head against their clasped feet. As one parachute returns to the site of the carnival, the dark-haired drummer twirls his lantern over the confetti-strewn grass, where colorful balloons float amid stacks of books, bicycles, and other carnival paraphernalia. Using a broom, the drummer nudges several saggy tents, and leaning over the side of the stage, a clown shoves props out of their path as they march backward slowly. The drummer's lantern glow reveals a sleeping dog and kitten floating in the air. Elsewhere in the carnival field, Rose sits on her back atop a bouncing rubber ball, while Jack bobs in the air beside her, his feet and hands dangling above ground. Rose hums quietly as she glances up at the cloudy afternoon sky, her hair and eyebrows dusted with flour, tilting her head as a nearby rocket casts light on the side of her chin. The parachute drifts several inches away from her as she pinches Jack's ear, giggling and shaking his leg, and stands up. Jack bobs quietly with his eyes closed, and Rose pinches him harder, then looks toward the parachute. Between them, the sleeping trumpet player drifts with the horn still in his hand. Rose's giggle fades as she gazes at Jack and pinches him again; a raindrop glides down her cheek. Squinting her eyes, Rose holds back laughter as she pats Jack's ear, while the parachute drifts further away. Rose shivers as she watches it float, then places her chin down and blinks her eyes. The shine of the drummer's lantern grows dimmer as they glide on, and Rose's eyes pop open as she stands up and nudges her foot out of Jack's clasp. She waves at his foot, then lets him go as Jack drifts in the fluffy clouds and vanishes in the mist. Rose wobbles on her stomach to the edge of the rubber ball, then tumbles into the air, her breath puffing out in rings, and flies to the sleeping drummer to snatch the horn from his hands. Rose continues to toot on the horn as the drummers twist their lights on her. On the research submarine, the now older Rose blinks her eyes as teardrops twinkle down Lizzy's cheeks. As dusk settles over the desert, Ismay lounges quietly in a van with other tourists, while in another van, a woman sips from a cup, then offers it to Cal. Nearby, Ruth cuddles against Molly, who peeks out to the mountains with a puzzled expression. Wrapped in a shawl, her face sighs as she looks down and is quieted in blue shadows."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Fog droplets glint in Samantha's scarf as she grabs his shoulder and taps the side of his elbow. Samantha laughs, then opens her mouth and yawns, while Oliver opens his mouth and tilts his cap against their clasped shoulders. As one wagon gallops to the edge of the battlefield, the blonde farmer illuminates his lantern over the rubble-covered land, where frozen soldiers hover amid clusters of baskets, canisters, and other remnants. Using a rake, the farmer nudges several rigid statues, and leaning over the back of the wagon, a ranger shoves statues out of their path as they gallop backward slowly. The farmer's lantern beam highlights a silent youth and toddler hovering on the ground. Elsewhere in the rubble field, Oliver reclines on his stomach atop a floating metal sheet, while Samantha hovers in the river beside him, her hat and legs lifted above ground. Oliver whistles to himself as he stares up at the cloudy morning mist, his scarf and shoulders covered with dew, turning his cap as a nearby spark brightens the top of her hair. The wagon gallops several feet away from him as he pats Samantha's shoulder, grinning and scratching his nose, and stands up. Samantha hovers silent with her mouth open, and Oliver pats him softer, then peers toward the wagon. Near them, the silent farmer hovers with the buzzer still in his hand. Oliver's grin fades as he glances at Samantha and pats him once more; a chuckle slips down his cheek. Furrowing his cheeks, Oliver laughs out loud as he pats Samantha's shoulder, while the wagon gallops closer. Oliver shakes as she observes it approach, then lifts up his nose and opens his mouth. The spark of the heroes' lantern fades brighter as they drift on, and Oliver's mouth slams shut as she stands up and nudges his shoulder out of Samantha's clasp. He taps her elbow, then clasps her as Samantha climbs in the warm water and appears in the haze. Oliver crawls on his legs to the top of the raft, then spins into the air, his voice fading away in dreams, and jumps to the molten farmer to push the buzzer from her hands. Oliver starts to whistle into the buzzer as the heroes dim their sparks on him. On the space shuttle, the now greener Oliver shuts his mouth as laughter rolls down Benny's hands. As dusk falls over the desert, Nathan stands loudly on a cart with other travelers, while on another cart, a woman lets a sip from a goblet, then hands it to Tony. Nearby, Janet laughs against Emily, who stares into land with a vibrant face. Wrapped in a scarf, her hands glow as she turns down and is lively in blue sparks."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack kisses Rose's hand as ice crystals form in his hair. Nearby, a lifeboat returns to the wreck site, illuminating frozen bodies and debris. Rose, on a wooden panel, sings and notices the lifeboat's distant light. She shakes Jack, who remains motionless, realizing he's gone as the boat rows away. Rose, emotional, kisses Jack's hand before he sinks. Determined, she swims to a frozen crewman, retrieves his whistle, and signals the rescuers. On a research ship, an older Rose remembers the event, with Lizzy crying beside her. As dawn breaks, survivors in lifeboats, including Ismay, Cal, Ruth, and Molly, face the aftermath silently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Wrapped in a blanket her face pales as she looks up and is dazed in green light Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression  while in another boat a man takes a drink from a flask then passes it to Cal  Ismay sits silently in a lifeboat with other survivors  As dawn breaks over the ocean  On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face  Rose continues to blow into the whistle as the rescuers shine their lights on her  Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips  She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom  The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip  Rose trembles as she watches it recede then lays down her head and closes her eyes  Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away  Furrowing her brow  a tear trickles down her nose  Rose's smile fades as she stares at Jack and shakes him again  Between them the dead crewman floats with the whistle still in his mouth  Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat  The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up  turning her head as a distant light illuminates the side of her face  Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice  Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water  The crewman's flashlight beam illuminates a dead woman and infant floating in the water  Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly  As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage  Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands  Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip  Wrapped in a blanket her face pales as she looks up and is dazed in green light On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face  She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom  Rose continues to blow into the whistle as the rescuers shine their lights on her  Rose's smile fades as she stares at Jack and shakes him again  Rose trembles as she watches it recede then lays down her head and closes her eyes  Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands  turning her head as a distant light illuminates the side of her face  Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand  As dawn breaks over the ocean  Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat  Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away  Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression  Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water  Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips  a tear trickles down her nose  As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage  Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly  while in another boat a man takes a drink from a flask then passes it to Cal  Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice  The crewman's flashlight beam illuminates a dead woman and infant floating in the water  The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up  Between them the dead crewman floats with the whistle still in his mouth  Furrowing her brow  Ismay sits silently in a lifeboat with other survivors "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Furrowing her brow  Rose chokes back tears as she strokes Jack's hand while the lifeboat rows further away  Rose trembles as she watches it recede then lays down her head and closes her eyes  The light of the rescuers' flashlight grows dimmer as they move on and Rose's eyes pop open as she sits up and pries her hand out of Jack's grip  She kisses his hand then releases him as Jack sinks in the icy water and vanishes in the gloom  Rose slides on her stomach to the edge of the platform then rolls into the water her breath steaming out in clouds and swims to the frozen crewman to pull the whistle from his lips  Rose continues to blow into the whistle as the rescuers shine their lights on her  On the research ship the now older Rose opens her eyes as tears stream down Lizzy's face  As dawn breaks over the ocean  Ismay sits silently in a lifeboat with other survivors  while in another boat a man takes a drink from a flask then passes it to Cal  Elsewhere Ruth huddles against Molly who stares out to sea with a blank expression  Wrapped in a blanket her face pales as she looks up and is dazed in green light Ice crystals sparkle in Jack's hair as he takes her hand and kisses the back of her hand  Jack smiles then closes his eyes and winces while Rose closes her eyes and leans her head against their entwined hands  As one lifeboat returns to the site of the wreck the darkhaired crewman shines his flashlight over the debrisstrewn water where frozen bodies float amid pieces of furniture barrels and other wreckage  Using an oar the crewman prods several stiff corpses and leaning over the front of the boat a sailor pushes bodies out of their path as they row forward slowly  The crewman's flashlight beam illuminates a dead woman and infant floating in the water  Elsewhere in the debris field Rose lies on her back atop a floating wooden panel while Jack floats in the sea beside her his head and arms propped above water  Rose sings to herself as she gazes up at the starry night sky her hair and eyebrows caked with ice  turning her head as a distant light illuminates the side of her face  The lifeboat passes several yards away from her as she shakes Jack's hand smiling and rubbing his arm and sits up  Jack floats motionless with his eyes closed and Rose shakes him harder then gazes toward the lifeboat  Between them the dead crewman floats with the whistle still in his mouth  Rose's smile fades as she stares at Jack and shakes him again  a tear trickles down her nose "
        }
      ]
    }
  ]
}