{
  "ground_truth": "Grabbing onto a cable, Jack stands on the railing of the ship's prow and raises his arms over his head. With his arms spread, he tilts his head back and closes his eyes as the enormous ship surges across the ocean. Meanwhile, Ruth, Rose, and Cal lunch with several guests, including Molly Brown and a brown-haired man with a mustache. Ruth stiffens as Rose lights a cigarette in a holder, inhales, and then blows the smoke in her mother's direction. Cal snatches the cigarette and stubs it out, while Rose smiles at him and then stands and leaves the table. Elsewhere, a brunette girl stands on a railing as her father grips her from behind, and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes. The brown-haired Irishman extends his hand to Jack, who gazes across the ship. Rose steps to a railing on an upper deck behind Tommy, who turns and glances at her then grins at Jack. Jack stares up at Rose as she glances in his direction, looks away, and then peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face, and Cal steps up behind Rose and grabs her arm. They exchange words, and Rose strides off with Cal rolling his eyes and trailing after her. Wearing a ruby-colored evening gown, Rose shoves past other passengers as she runs down a deck, opens a gate, and dashes down the lower deck leading to the rear of the ship. Meanwhile, Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past. With tears streaming down her face, Rose runs onto the poop deck at the rear of the ship, glances over her shoulder, and gazes down at the churning water. She places her hands on the railing, climbs onto its first wrung, and, holding onto a flag pole, swings her feet over the railing one at a time, lowering herself onto the gun wheel. Gripping the railing for support, Rose turns to face the water as the wind whips her curly, auburn hair around her face. She leans forward over the ocean, while Jack creeps up behind her, takes a last puff on his cigarette, and tosses it off the ship. Placing his hands into his pockets, he turns to Rose, removes his coat, unlaces his boots and pulls them off, and as Rose stares down at the water, she studies him. He takes off his vest, reaches out his hand, and Rose grabs it, turning around on a narrow ledge and staring into Jack's eyes. He smiles, and Rose steps on the hem of her dress and slips.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Clutching onto a wire, Jack stands on the balustrade of the vessel's bow and elevates his arms over his head. With his arms extended, he inclines his head back and shuts his eyes as the gigantic vessel thrusts across the sea. Meanwhile, Ruth, Rose, and Cal dine with several visitors, including Molly Brown and a brunette man with a mustache. Ruth tenses as Rose ignites a cigarette in a holder, inhales, and then blows the smoke in her mother's direction. Cal seizes the cigarette and extinguishes it, while Rose grins at him and then stands and departs the table. Elsewhere, a dark-haired girl stands on a railing as her father grasps her from behind, and Jack sits a few feet away drawing them with a stick of charcoal while crewmen walk canines on leashes. The brunette Irishman extends his hand to Jack, who gazes across the vessel. Rose steps to a railing on an upper deck behind Tommy, who turns and glances at her then beams at Jack. Jack stares up at Rose as she glances in his direction, looks away, and then peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face, and Cal steps up behind Rose and seizes her arm. They exchange words, and Rose strides off with Cal rolling his eyes and trailing after her. Wearing a ruby-colored evening gown, Rose shoves past other travelers as she runs down a deck, opens a gate, and races down the lower deck leading to the back of the vessel. Meanwhile, Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past. With tears streaming down her face, Rose runs onto the poop deck at the back of the vessel, glances over her shoulder, and gazes down at the swirling water. She places her hands on the railing, climbs onto its first rung, and, holding onto a flag pole, swings her feet over the railing one at a time, lowering herself onto the gun wheel. Gripping the railing for support, Rose turns to face the water as the wind lashes her curly, auburn hair around her face. She leans forward over the sea, while Jack sneaks up behind her, takes a final puff on his cigarette, and tosses it off the vessel. Placing his hands into his pockets, he turns to Rose, removes his coat, unlaces his boots and pulls them off, and as Rose stares down at the water, she observes him. He takes off his vest, reaches out his hand, and Rose grabs it, turning around on a narrow ledge and staring into Jack's eyes. He grins, and Rose steps on the hem of her dress and slips."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Onto a cable was grabbed by Jack as he stood on the railing of the ship's prow and his arms were raised over his head by him. With his arms spread, his head is tilted back and his eyes are closed by him as the enormous ship is surged across the ocean. Meanwhile, Ruth, Rose, and Cal are lunched with by several guests, including Molly Brown and a brown-haired man with a mustache. As Rose lights a cigarette in a holder, inhales, and then blows the smoke in her mother's direction, Ruth stiffens. The cigarette is snatched and stubbed out by Cal, while at him Rose smiles and then the table is left by her as she stands. Elsewhere, a railing is stood on by a brunette girl as her father grips her from behind, and a few feet away, Jack sketches them with a stick of charcoal while dogs are walked on leashes by crewmen. His hand is extended to Jack by the brown-haired Irishman, who gazes across the ship. To a railing on an upper deck, Rose steps behind Tommy, who turns, glances at her, and then Jack is grinned at by him. Rose is stared up at by Jack as she gazes in his direction, looks away, and then towards him, she peeks from the corner of her eyes. His hand is waved in front of Jack's face by Fabrizio, and up behind Rose, Cal steps and her arm is grabbed by him. Words are exchanged by them, and with Cal rolling his eyes and trailing after her, Rose strides off. Wearing a ruby-colored evening gown, other passengers are shoved past by Rose as she runs down a deck, a gate is opened by her, and down the lower deck leading to the rear of the ship, she dashes. Meanwhile, on a bench, a cigarette is smoked by Jack who gazes up at the starry sky until as Rose runs past, he sits up. With tears streaming down her face, onto the poop deck at the rear of the ship Rose runs, over her shoulder she glances, and at the churning water, she gazes down. Her hands are placed on the railing by her, its first rung is climbed onto by her, and, onto a flag pole holding, over the railing her feet are swung one at a time, the gun wheel is lowered onto by her. The railing is gripped by Rose for support, the water is faced by her as the wind whips her curly, auburn hair around her face. The ocean is leaned forward over by her, while up behind her Jack creeps, a last puff on his cigarette is taken, and it is tossed off the ship by him. Placing his hands into his pockets, Rose is turned to by him, his coat is removed, his boots are unlaced and pulled off, and as she stares down at the water, he is studied by her. His vest is taken off by him, his hand is reached out, and her hand is grabbed by Rose, turning around on a narrow ledge and Jack's eyes are stared into by her. At her, he smiles, and on the hem of her dress Rose steps and slips."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Grasping a cable, Jack stands on the ship's prow railing, arms raised, head back, eyes closed as the ship surges forward. Meanwhile, Ruth, Rose, and Cal lunch with guests, including Molly Brown and a mustached man. Ruth stiffens when Rose lights a cigarette, inhales, and blows smoke toward her. Cal snatches and extinguishes it, prompting Rose to smile and leave. Elsewhere, a brunette girl stands on a railing, her father holding her, while Jack sketches them with charcoal as crewmen walk dogs. The Irishman extends his hand to Jack, who looks across the ship. Rose approaches a railing behind Tommy, who grins at Jack. Jack watches Rose as she glances at him, then looks away. Fabrizio waves at Jack, and Cal approaches Rose, grabbing her arm. They exchange words, and Rose walks off with Cal following. In a ruby gown, Rose pushes past passengers, runs down a deck, opens a gate, and heads to the ship's rear. Jack lies on a bench, smoking and gazing at the stars, then sits up as Rose runs by. Crying, Rose reaches the poop deck, looks back, and gazes at the water. She climbs the railing, holding a flag pole, and lowers herself onto the gun wheel. Facing the water, wind whipping her hair, she leans forward. Jack approaches, takes a last puff, and discards his cigarette. He removes his coat and boots, and as Rose stares at the water, she studies him. He offers his hand, and Rose takes it, turning on the ledge and meeting Jack's eyes. He smiles, and Rose steps on her dress hem and slips."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jack stands on the ship's prow railing, arms raised, eyes closed, as the ship surges forward. Meanwhile, Ruth, Rose, and Cal lunch with guests, including Molly Brown and a mustached man. Ruth stiffens when Rose smokes, and Cal extinguishes the cigarette. Rose smiles, leaves the table, and Jack sketches a girl on a railing. A brown-haired Irishman greets Jack, who looks across the ship. Rose approaches a railing, and Tommy grins at Jack. Jack watches Rose, who glances at him. Fabrizio waves at Jack, and Cal grabs Rose's arm. They exchange words, and Rose leaves with Cal following. In a ruby gown, Rose runs down a deck, opens a gate, and heads to the ship's rear. Jack, smoking on a bench, sees her run past. Crying, Rose reaches the poop deck, looks back, and gazes at the water. She climbs the railing, holding a flag pole, and lowers herself onto the gun wheel. Wind whips her hair as she leans over the ocean. Jack approaches, discards his cigarette, removes his coat and boots, and reaches out. Rose grabs his hand, turns on the ledge, and looks into his eyes. He smiles, and she slips on her dress hem."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Grasping firmly onto a sturdy cable, Jack confidently stands on the ship's prow railing, raising his arms high above his head in a gesture of exhilaration. With his arms spread wide like wings, he tilts his head back, closing his eyes to fully embrace the sensation as the massive ship powers forward, cutting through the vast ocean. Meanwhile, in another part of the ship, Ruth, Rose, and Cal are enjoying lunch with several other guests, including the lively Molly Brown and a brown-haired gentleman sporting a mustache. Ruth becomes visibly tense as Rose, with a touch of defiance, lights a cigarette in a holder, takes a deep inhale, and then deliberately blows the smoke in her mother's direction. Cal, with a swift motion, snatches the cigarette from her and extinguishes it, while Rose, unfazed, smiles at him before gracefully standing up and leaving the table. In a different area, a young brunette girl stands precariously on a railing, her father holding her securely from behind, while Jack sits a few feet away, intently sketching the scene with a stick of charcoal. Nearby, crewmen are seen walking dogs on leashes. The brown-haired Irishman extends a friendly hand to Jack, who is momentarily lost in thought, gazing across the ship. Rose, meanwhile, steps up to a railing on an upper deck, standing behind Tommy, who turns to glance at her and then grins knowingly at Jack. Jack's eyes follow Rose as she glances in his direction, looks away, and then slyly peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face to get his attention, and at that moment, Cal approaches Rose from behind, grabbing her arm. They exchange a few words, and Rose strides off, with Cal rolling his eyes and trailing after her. Dressed in a striking ruby-colored evening gown, Rose pushes past other passengers as she runs down a deck, opens a gate, and dashes down the lower deck leading to the ship's rear. Meanwhile, Jack is lying on a bench, leisurely smoking a cigarette and gazing up at the starry sky until he sits up as Rose rushes past him. With tears streaming down her face, Rose runs onto the poop deck at the ship's rear, glances over her shoulder, and looks down at the churning water below. She places her hands on the railing, climbs onto its first rung, and, holding onto a flagpole for balance, swings her feet over the railing one at a time, lowering herself onto the gun wheel. Gripping the railing tightly for support, Rose turns to face the water as the wind whips her curly, auburn hair around her face. She leans forward over the ocean, while Jack quietly approaches her from behind, taking a final puff on his cigarette before tossing it off the ship. Placing his hands into his pockets, he turns his attention to Rose, removes his coat, unlaces his boots, and pulls them off. As Rose stares down at the water, she studies him intently. He takes off his vest, reaches out his hand, and Rose, accepting it, turns around on the narrow ledge, locking eyes with Jack. He smiles warmly, and Rose, caught in the moment, steps on the hem of her dress and slips."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Grasping tightly onto a strong, sturdy cable, Jack stands confidently on the prow railing of the ship, lifting his arms high above his head in a thrilling gesture of pure exhilaration. With his outstretched arms resembling wide-spread wings, he tilts his head back, closing his eyes to completely immerse himself in the sensation as the massive ship surges forward, slicing through the vast, open ocean. Meanwhile, in another part of the grand ship, Ruth, Rose, and Cal are leisurely enjoying lunch alongside several other guests. Among them is the lively and energetic Molly Brown, as well as a brown-haired gentleman who sports a distinguished mustache. Ruth becomes notably tense when Rose, with a subtle touch of defiance, lights a cigarette in a holder, takes a deep and deliberate inhale, and pointedly blows the smoke in her mother's direction. With a swift and decisive motion, Cal snatches the cigarette from her hand and extinguishes it with force. However, Rose remains unfazed, smiling at Cal before gracefully standing up and departing the table. \n\nIn a separate area, a young brunette girl stands precariously on the railing, while her father holds her securely from behind to ensure her safety. Nearby, Jack sits a few feet away, intently sketching the scene before him using a stick of charcoal. Nearby, crewmen can be seen walking dogs on leashes, adding to the bustling atmosphere. The brown-haired Irishman extends a friendly and welcoming hand to Jack, who, at that very moment, is momentarily lost deep in thought, his gaze fixed on the expanse of the ship. Meanwhile, Rose steps up to a railing on an upper deck, positioning herself behind Tommy, who turns to look at her, then grins knowingly at Jack. Jack's eyes follow Rose as she glances in his direction before coyly looking away, only to slyly peek towards him from the corner of her eyes. Fabrizio, waving his hand in front of Jack’s face, attempts to capture his attention. Just then, Cal approaches Rose from behind, firmly grabbing her arm. They exchange a few brief words, and Rose strides off confidently, while Cal rolls his eyes and follows after her. \n\nDressed in a striking, ruby-colored evening gown that catches the eye, Rose pushes past other passengers as she runs swiftly down a deck. She opens a gate and dashes down the lower deck, leading her to the rear of the ship. Meanwhile, Jack is leisurely lying on a bench, smoking a cigarette and gazing up at the starry sky until he sits up as Rose rushes past him. With tears streaming down her face, Rose runs onto the poop deck at the ship’s rear, glancing over her shoulder, and then looks down at the churning water below. She places her hands on the railing, climbs onto its first rung, and, holding onto a flagpole for balance, carefully swings her feet over the railing one at a time, lowering herself onto the gun wheel. Gripping the railing tightly to maintain her balance, Rose turns to face the water as the wind whips her curly, auburn hair around her face. She then leans forward over the ocean, while Jack quietly approaches her from behind, taking a final puff on his cigarette before tossing it off the ship. Placing his hands into his pockets, he shifts his focus to Rose, removing his coat, unlaces his boots, and pulls them off one by one. As Rose stares solemnly down at the water, she studies him intently. He takes off his vest, reaches out his hand, and Rose, accepting it, turns around on the narrow ledge, meeting Jack’s gaze with locked eyes. He offers her a warm, reassuring smile, and as Rose, caught up in the moment, steps backward, she accidentally steps on the hem of her dress and slips."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gripping tightly onto a cable for balance, Jack carefully positions himself on the railing at the ship's prow, feeling the cool metal beneath his feet. He slowly raises his arms high above his head, allowing the wind to rush past him, and spreads them wide open, embracing the sensation of freedom. Tilting his head back, he closes his eyes, immersing himself in the moment as the enormous ship surges powerfully across the vast ocean. Meanwhile, in a different part of the ship, Ruth, Rose, and Cal are seated at a table, enjoying lunch with several guests, including the lively Molly Brown and a brown-haired man sporting a mustache. Ruth's posture becomes rigid as she watches Rose light a cigarette in a holder, bringing it to her lips to inhale deeply before exhaling a stream of smoke deliberately in her mother's direction. Cal, with a swift motion, reaches over to snatch the cigarette from Rose's hand and promptly stubs it out, extinguishing it. Rose responds with a smile directed at him, then gracefully rises from her seat and leaves the table. Elsewhere on the ship, a young brunette girl stands precariously on a railing, her father securely holding her from behind to ensure her safety, while Jack sits a few feet away, intently sketching the scene with a stick of charcoal. Around them, crewmen casually walk dogs on leashes, adding to the lively atmosphere. The brown-haired Irishman approaches Jack, extending his hand in a friendly gesture, while Jack momentarily shifts his gaze across the ship. On an upper deck, Rose steps up to a railing behind Tommy, who turns to glance at her and then flashes a grin in Jack's direction. Jack's eyes are drawn upward to Rose as she briefly glances his way, then looks away, only to sneak a peek at him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face to capture his attention, while Cal approaches Rose from behind, firmly grabbing her arm. They exchange a few words, and Rose strides away with determination, leaving Cal to roll his eyes and follow after her. Clad in a striking ruby-colored evening gown, Rose pushes past other passengers with urgency, running down a deck, opening a gate, and dashing down the lower deck that leads to the ship's rear. Meanwhile, Jack lies on a bench, leisurely smoking a cigarette and gazing up at the starry sky, lost in thought, until he sits up as Rose rushes past him. Tears streaming down her face, Rose makes her way onto the poop deck at the ship's rear, casting a glance over her shoulder before focusing on the churning water below. She places her hands firmly on the railing, climbs onto its first rung, and, holding onto a flag pole for support, swings her feet over the railing one at a time, carefully lowering herself onto the gun wheel. With the wind whipping her curly, auburn hair around her face, Rose grips the railing for support and turns to face the water, leaning forward over the ocean. Jack quietly approaches from behind, taking a final puff on his cigarette before tossing it off the ship. He places his hands into his pockets, turns his attention to Rose, and begins to remove his coat. He then unlaces his boots, pulls them off, and as Rose continues to stare down at the water, she takes a moment to study him. Jack removes his vest, reaches out his hand to her, and Rose, accepting his offer, grabs it, turning around on the narrow ledge to meet Jack's gaze. He smiles warmly at her, and as Rose steps back, she inadvertently catches the hem of her dress, causing her to slip."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jack stands on the ship's prow, arms raised and eyes closed, embracing the ocean's surge. Meanwhile, Ruth, Rose, and Cal lunch with guests, including Molly Brown. Tension arises as Rose defiantly smokes, prompting Cal to extinguish her cigarette. Rose departs the table, leaving behind a tense atmosphere. Nearby, Jack sketches a father and daughter on the railing while crewmen walk dogs. An Irishman greets Jack, who notices Rose on an upper deck. She exchanges glances with Jack, drawing his attention. Fabrizio distracts Jack as Cal approaches Rose, leading to a brief exchange before she leaves with Cal following. Later, in a ruby gown, Rose pushes through passengers, racing down to the ship's rear. Jack, lying on a bench, notices her passing. Tearful, Rose reaches the poop deck, contemplates the water, and climbs onto the railing. As the wind whips her hair, Jack approaches, discarding his cigarette and removing his coat and boots. He offers his hand to Rose, who turns to face him. Their eyes meet, and as Jack smiles, Rose slips on her dress hem."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Grabbing onto a cable, Jack stands on the railing of the ship's prow and raises his arms over his head in a pose reminiscent of a figurehead on a grand ocean liner from the early 20th century. With his arms spread, he tilts his head back and closes his eyes as the enormous ship, RMS Titanic, surges across the Atlantic Ocean on its fateful maiden voyage in April 1912. Meanwhile, Ruth, Rose, and Cal lunch with several guests, including Molly Brown, known for her survival during the Titanic disaster and efforts to aid lifeboat passengers, and a brown-haired man with a mustache, possibly representing one of the ship's prominent first-class passengers. Ruth stiffens as Rose lights a cigarette in a holder, a fashionable accessory among women of high society at the time, inhales, and then blows the smoke in her mother's direction. Cal snatches the cigarette and stubs it out, while Rose smiles at him, a cheeky defiance of the strict propriety expected in their social circles, and then stands and leaves the table. Elsewhere, a brunette girl stands on a railing as her father grips her from behind, an action reflecting the excitement and wonder of passengers aboard the 'unsinkable' ship, and Jack sits a few feet away sketching them with a stick of charcoal, a nod to the artistic talents many aboard possessed, while crewmen, who often doubled as caretakers, walk dogs on leashes. The brown-haired Irishman, Tommy Ryan, extends his hand to Jack, who gazes across the ship as if capturing every detail of this historical journey. Rose steps to a railing on an upper deck behind Tommy, who turns and glances at her then grins at Jack, perhaps recognizing the budding connection between the two. Jack stares up at Rose as she glances in his direction, looks away, and then peeks towards him from the corner of her eyes, signaling the beginning of a romance amidst this luxury and tragedy. Fabrizio, a fellow third-class passenger and Jack's confidant, waves his hand in front of Jack's face, and Cal steps up behind Rose and grabs her arm, asserting his controlling nature. They exchange words, and Rose strides off with Cal rolling his eyes and trailing after her, highlighting their troubled relationship. Wearing a ruby-colored evening gown, Rose shoves past other passengers as she runs down a deck, opens a gate, and dashes down the lower deck leading to the rear of the ship, an area that offered solitude and reflection beneath the open sky. Meanwhile, Jack lies on a bench smoking a cigarette and gazes up at the starry sky, a rare clear view on the North Atlantic, until he sits up as Rose runs past. With tears streaming down her face, reflecting her inner turmoil, Rose runs onto the poop deck at the rear of the ship, glances over her shoulder, and gazes down at the churning water, perhaps contemplating the ship's tragic route through iceberg-laden waters. She places her hands on the railing, climbs onto its first wrung, and, holding onto a flag pole reminiscent of the ship's grandeur, swings her feet over the railing one at a time, lowering herself onto the gun wheel, a risky position signifying her desperation. Gripping the railing for support, Rose turns to face the water as the wind whips her curly, auburn hair around her face. She leans forward over the ocean, while Jack creeps up behind her, takes a last puff on his cigarette, and tosses it off the ship, an act of letting go before stepping in to help. Placing his hands into his pockets, he turns to Rose, removes his coat, unlaces his boots and pulls them off, preparing to rescue her, and as Rose stares down at the water, she studies him, finding a lifeline in his presence. He takes off his vest, reaches out his hand, and Rose grabs it, turning around on a narrow ledge and staring into Jack's eyes, feeling the depth of his sincerity. He smiles, and Rose steps on the hem of her dress and slips, a precarious moment on the brink of life and the abyss below."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head  With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean  Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache  They exchange words and Rose strides off with Cal rolling his eyes and trailing after her  Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship  Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past  With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water  She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel  Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face  She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship  Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him  He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes  He smiles and Rose steps on the hem of her dress and slips Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction  Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table  Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes  The brownhaired Irishman extends his hand to Jack who gazes across the ship  Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack  Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes  Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm  They exchange words and Rose strides off with Cal rolling his eyes and trailing after her  Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship  Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past  With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water  She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel  Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face  She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship  Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him  He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes  He smiles and Rose steps on the hem of her dress and slips"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head. With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean. Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache. Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction. Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table. Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes. The brownhaired Irishman extends his hand to Jack who gazes across the ship. Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack. Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They exchange words and Rose strides off with Cal rolling his eyes and trailing after her. Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship. Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past. With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water. She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel. Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face. She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship. Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him. He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes. He smiles and Rose steps on the hem of her dress and slips."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head. With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean. Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache. Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction. Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table. Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes. The brownhaired Irishman extends his hand to Jack who gazes across the ship. Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack. Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. They exchange words and Rose strides off with Cal rolling his eyes and trailing after her. Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship. Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past. With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water. She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel. Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face. She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship. Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him. He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes. He smiles and Rose steps on the hem of her dress and slips."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head. With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean. Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache. Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction. Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table. Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face. She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship. Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him. He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes. He smiles and Rose steps on the hem of her dress and slips."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head. With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean. He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes. He smiles and Rose steps on the hem of her dress and slips."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Grabbing onto a cable, the elephant stands on the railing of the ship's prow and raises its arms over its head. With its arms spread, it tilts its head back and closes its eyes as the enormous ship surges across the ocean. Meanwhile, a penguin, a giraffe, and a meerkat lunch with several guests, including a kangaroo and a brown-haired man with a mustache. The penguin stiffens as the giraffe lights a cigarette in a holder, inhales, and then blows the smoke in its direction. The meerkat snatches the cigarette and stubs it out, while the giraffe smiles at it and then stands and leaves the table. Elsewhere, a brunette owl stands on a railing as its sibling grips it from behind, and the elephant sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes. The brown-haired dolphin extends its hand to the elephant, who gazes across the ship. The giraffe steps to a railing on an upper deck behind a raccoon, who turns and glances at it then grins at the elephant. The elephant stares up at the giraffe as it glances in its direction, looks away, and then peeks towards it from the corner of its eyes. A zebra waves its hand in front of the elephant's face, and the meerkat steps up behind the giraffe and grabs its arm. They exchange words, and the giraffe strides off with the meerkat rolling its eyes and trailing after it. Wearing a ruby-colored evening gown, the giraffe shoves past other passengers as it runs down a deck, opens a gate, and dashes down the lower deck leading to the rear of the ship. Meanwhile, the elephant lies on a bench smoking a cigarette and gazes up at the starry sky until it sits up as the giraffe runs past. With tears streaming down its face, the giraffe runs onto the poop deck at the rear of the ship, glances over its shoulder, and gazes down at the churning water. It places its hands on the railing, climbs onto its first wrung, and, holding onto a flag pole, swings its feet over the railing one at a time, lowering itself onto the gun wheel. Gripping the railing for support, the giraffe turns to face the water as the wind whips its curly, auburn hair around its face. It leans forward over the ocean, while the elephant creeps up behind it, takes a last puff on its cigarette, and tosses it off the ship. Placing its hands into its pockets, it turns to the giraffe, removes its coat, unlaces its boots and pulls them off, and as the giraffe stares down at the water, it studies the elephant. It takes off its vest, reaches out its hand, and the giraffe grabs it, turning around on a narrow ledge and staring into the elephant's eyes. It smiles, and the giraffe steps on the hem of its dress and slips."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Grabbing onto a vine, Jack stands on the edge of the cliff's summit and raises his arms over his head. With his arms spread, he tilts his head back and closes his eyes as the enormous airship soars across the desert. Meanwhile, Ruth, Rose, and Cal lunch with several guests, including Molly Brown and a brown-haired man with a mustache. Ruth stiffens as Rose lights a candle in a holder, inhales, and then blows the smoke in her mother's direction. Cal snatches the candle and stubs it out, while Rose smiles at him and then stands and leaves the table. Elsewhere, a brunette girl stands on a balcony as her father grips her from behind, and Jack sits a few feet away sketching them with a piece of chalk while crewmen walk parrots on leashes. The brown-haired Irishman extends his hand to Jack, who gazes across the airship. Rose steps to a railing on an upper deck behind Tommy, who turns and glances at her then grins at Jack. Jack stares up at Rose as she glances in his direction, looks away, and then peeks towards him from the corner of her eyes. Fabrizio waves his hand in front of Jack's face, and Cal steps up behind Rose and grabs her arm. They exchange words, and Rose strides off with Cal rolling his eyes and trailing after her. Wearing a sapphire-colored evening gown, Rose shoves past other passengers as she runs down a passage, opens a curtain, and dashes down the lower level leading to the rear of the airship. Meanwhile, Jack lies on a hammock smoking a pipe and gazes up at the cloudy sky until he sits up as Rose runs past. With tears streaming down her face, Rose runs onto the observation deck at the rear of the airship, glances over her shoulder, and gazes down at the swirling sand. She places her hands on the barrier, climbs onto its first rung, and, holding onto a lantern post, swings her feet over the barrier one at a time, lowering herself onto the arrow wheel. Gripping the barrier for support, Rose turns to face the sand as the wind whips her curly, auburn hair around her face. She leans forward over the desert, while Jack creeps up behind her, takes a last puff on his pipe, and tosses it off the airship. Placing his hands into his pockets, he turns to Rose, removes his jacket, unlaces his shoes and pulls them off, and as Rose stares down at the sand, she studies him. He takes off his sweater, reaches out his hand, and Rose grabs it, turning around on a narrow ledge and staring into Jack's eyes. He smiles, and Rose steps on the hem of her dress and slips."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Grabbing onto a cable, Jack perches on the railing of the ship's prow and flaps his arms like wings. With his arms spread, he nods his head forward and squints his eyes as the enormous ship glides across the ocean. Meanwhile, Ruth, Rose, and Cal paint with several guests, including Molly Brown and a brown-haired man with a mustache. Ruth frowns as Rose drops a cigarette in a holder, inhales, and then wafts the smoke in her mother's direction. Cal retrieves the cigarette and flicks it away, while Rose winks at him and then twirls and leaves the table. Elsewhere, a brunette girl balances on a railing as her father holds her from behind, and Jack reclines a few feet away observing them with a stick of charcoal while crewmen juggle dogs on leashes. The brown-haired Irishman tosses his hand to Jack, who peers across the ship. Rose leans against a railing on an upper deck behind Tommy, who spins and nods at her then smirks at Jack. Jack peers up at Rose as she glances in his direction, turns away, and then sneaks a look towards him from the corner of her eyes. Fabrizio claps his hand in front of Jack's face, and Cal sneaks up behind Rose and pats her arm. They share words, and Rose skips off with Cal shaking his head and wandering after her. Wearing a ruby-colored evening gown, Rose elbows past other passengers as she bounces down a deck, closes a gate, and dashes down the lower deck leading to the rear of the ship. Meanwhile, Jack dozes on a bench fiddling with a cigarette and peers up at the starry sky until he stretches as Rose strolls past. With tears streaming down her face, Rose strolls onto the poop deck at the rear of the ship, peers over her shoulder, and gazes down at the churning water. She places her hands on the railing, hops onto its first rung, and, holding onto a flag pole, lifts her feet over the railing one at a time, lowering herself onto the gun wheel. Clutching the railing for support, Rose turns to face the water as the wind tosses her curly, auburn hair around her face. She tilts forward over the ocean, while Jack tiptoes up behind her, takes a last drag on his cigarette, and flips it off the ship. Placing his hands into his pockets, he nods to Rose, slips off his coat, unties his boots and kicks them off, and as Rose peers down at the water, she examines him. He removes his vest, waves out his hand, and Rose takes it, pivoting around on a narrow ledge and staring into Jack's eyes. He winks, and Rose steps on the hem of her dress and stumbles."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Grabbing onto a tree branch, Henry stands on the edge of the cliff and raises his arms over his head. With his arms spread, he tilts his head back and closes his eyes as the enormous aircraft glides across the sky. Meanwhile, Lucy, Lily, and Sam lunch with several travelers, including Emily Green and a red-haired woman with glasses. Lucy stiffens as Lily lights a lantern in a holder, inhales, and then blows the flame in her sister's direction. Sam snatches the lantern and snuffs it out, while Lily smiles at him and then stands and leaves the gathering. Elsewhere, a blonde boy stands on a fence as his uncle grips him from behind, and Henry sits a few feet away sketching them with a piece of chalk while vendors walk cats on leashes. The red-haired Brazilian extends his hand to Henry, who gazes across the aircraft. Lily steps to a fence on a higher platform behind Johnny, who turns and glances at her then grins at Henry. Henry stares up at Lily as she glances in his direction, looks away, and then peeks towards him from the corner of her eyes. Antonio waves his hand in front of Henry's face, and Sam steps up behind Lily and grabs her elbow. They exchange words, and Lily strides off with Sam rolling his eyes and trailing after her. Wearing a sapphire-colored evening robe, Lily shoves past other travelers as she runs down a path, opens a door, and dashes down the lower path leading to the back of the aircraft. Meanwhile, Henry lies on a couch eating an apple and gazes up at the cloudy sky until he sits up as Lily runs past. With tears streaming down her face, Lily runs onto the sun deck at the back of the aircraft, glances over her shoulder, and gazes down at the swirling mist. She places her hands on the fence, climbs onto its first rung, and, holding onto a weather vane, swings her feet over the fence one at a time, lowering herself onto the steering wheel. Gripping the fence for support, Lily turns to face the mist as the breeze whips her straight, blonde hair around her face. She leans forward over the ground, while Henry creeps up behind her, takes a last bite of his apple, and tosses it off the aircraft. Placing his hands into his pockets, he turns to Lily, removes his sweater, unlaces his sneakers and pulls them off, and as Lily stares down at the mist, she studies him. He takes off his cap, reaches out his hand, and Lily grabs it, turning around on a narrow platform and staring into Henry's eyes. He smiles, and Lily steps on the hem of her robe and slips."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Clinging onto a rope, Sam perches on the edge of the cliff and flaps his hands above his head. With his fingers extended, he arches his neck back and squints as the massive airplane glides over the valley. Meanwhile, Lila, Mary, and Dan dine with several colleagues, including Emma Green and a blond-haired woman with glasses. Mary freezes as Lila sips iced tea from a goblet, inhales, and then directs a smile toward her sister. Dan grabs the tea and spills it out, while Lila winks at him and then rises and exits the porch. Nearby, a redheaded boy balances on a fence while his uncle tugs on his sleeve, and Sam kneels a short distance away painting them with a brush while staff members lead sheep with bells. The blond-haired Englishwoman reaches her hand to Sam, who peers over the valley. Lila approaches a fence on a higher plateau behind Harry, who pivots and nods at her then winks at Sam. Sam glances up at Lila as she peers his way, turns away, and then sneaks a look at him from the edge of her vision. Marco waves his hand in front of Sam's eyes, and Dan steps up behind Lila and taps her shoulder. They share a conversation, and Lila marches off with Dan rolling his eyes and following her. Clad in a sapphire-colored cocktail dress, Lila pushes through other travelers as she sprints along a path, unlatches a door, and races down the lower boardwalk leading to the end of the beach. Meanwhile, Sam lounges on a stool sipping a drink and gazes at the blinking lighthouse until he stands as Lila rushes past. With tears trickling down her face, Lila races onto the pier at the end of the beach, peers back over her shoulder, and looks down at the swirling surf. She places her palms on the railing, clambers onto its first bar, and, clutching onto a life preserver, swings her legs over the railing one at a time, lowering herself onto the dock. Clutching the railing for stability, Lila turns to face the sea as the breeze swirls her wavy, chestnut hair around her cheeks. She leans forward over the water, while Sam sneaks up behind her, takes a final gulp of his drink, and flips it off the dock. Shoving his hands into his bag, he turns to Lila, removes his sweater, unties his sneakers and kicks them off, and as Lila stares down at the waves, she observes him. He slips off his scarf, extends his hand, and Lila grabs it, pivoting on the narrow platform and locking eyes with Sam. He grins, and Lila steps on the edge of her skirt and stumbles."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Grabbing onto a vine, Jack balances on the branch of the airplane's wing and waves his arms above his head. With his arms wide, he turns his head upward and shuts his eyes as the enormous airplane floats across the sky. Meanwhile, Ruth, Rose, and Cal dine with several friends, including Molly Brown and a blond-haired man with a hat. Ruth tenses as Rose unwraps a lollipop, takes a lick, and then points the candy in her mother's direction. Cal grabs the lollipop and snaps it in half, while Rose grins at him and then stands and exits the room. Elsewhere, a redheaded girl balances on a branch as her father holds her from behind, and Jack sits a few feet away carving them with a stick of chalk while crewmen guide cats on strings. The blond-haired Irishman offers his hand to Jack, who scans across the airplane. Rose steps to a branch on an upper wing behind Tommy, who turns and winks at her then smirks at Jack. Jack glances up at Rose as she peeks in his direction, looks away, and then sneaks another look towards him from the corner of her eyes. Fabrizio flaps his hand in front of Jack's face, and Cal approaches behind Rose and tugs her sleeve. They exchange words, and Rose strides off with Cal shaking his head and drifting after her. Wearing an emerald-colored evening gown, Rose pushes past other travelers as she races down a hallway, unlatches a door, and darts down the lower hallway leading to the back of the airplane. Meanwhile, Jack rests on a sofa puffing a cigar and gazes up at the cloudy sky until he sits up as Rose rushes by. With tears rolling down her cheeks, Rose sprints onto the rear platform at the back of the airplane, glances over her shoulder, and peers down at the swirling clouds. She places her hands on the branch, climbs onto its first rung, and, holding onto a wind turbine, swings her feet over the branch one at a time, lowering herself onto the rudder. Gripping the branch for balance, Rose turns to face the sky as the breeze tosses her straight, golden hair around her face. She leans forward over the clouds, while Jack sneaks up behind her, takes a final drag on his cigar, and flicks it off the airplane. Placing his hands into his trousers, he turns to Rose, removes his scarf, unties his shoes and kicks them off, and as Rose stares down at the clouds, she observes him. He takes off his sweater, reaches out his hand, and Rose takes it, turning around on a slim ledge and gazing into Jack's eyes. He grins, and Rose steps on the edge of her skirt and trips."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Clutching a vine, Ethan perches on the edge of the eagle's beak and waves his feet above his head. With his feet splayed, he arches his shoulders back and squints his ears as the giant eagle glides over the desert. Meanwhile, Lily, Lily-Anne, and Max feast with several artists, including Nancy Green and a red-haired woman with glasses. Lily tenses as Lily-Anne ignites a match in a lantern, exhales, and then wafts the warmth towards her aunt. Max grabs the match and snuffs it out, while Lily-Anne giggles at him and then hops and hops away from the chair. Somewhere else, a blonde boy climbs on a hedge as his uncle hugs him from below, and Ethan lounges a few inches away whittling them with a piece of chalk while dancers guide cats on ribbons. The red-haired Scotsman raises his hat to Ethan, who screams across the eagle. Lily-Anne tiptoes to a fence on a lower field beside Patrick, who spins and winks at her then nods at Ethan. Ethan peers sideways at Lily-Anne as she flickers in his gaze, glances upward, and then peeks towards him from the fringe of her scarf. Mario flaps his foot in front of Ethan's knees, and Max struts up beside Lily-Anne and nudges her elbow. They swap stories, and Lily-Anne prances away with Max rubbing his knees and following before her. Donning an emerald-hued morning suit, Lily-Anne shuffles through other tourists as she skips down a track, shuts a fence, and sprints up the upper field trailing to the front of the eagle. Simultaneously, Ethan lounges on a log puffing on a pipe and gazes down at the cloudy horizon until he stands up as Lily-Anne hurries by. With snow falling on her face, Lily-Anne sprints onto the peak at the front of the eagle, watches over her ankle, and peers up at the whistling sky. She places her fingers on the hedge, climbs onto its third rung, and, clutching a weather vane, dangles her nose over the hedge one by one, raising herself onto the rudder. Grasping the hedge for balance, Lily-Anne spins to face the sky as the breeze fluffs her straight, golden mane around her hat. She leans backward over the desert, while Ethan sneaks up beside her, takes a final sip of his pipe, and flips it over the eagle. Shoving his fingers into his mittens, he turns to Lily-Anne, removes his scarf, unties his sneakers and tugs them off, and as Lily-Anne stares up at the sky, she examines him. He takes off his scarf, extends his arm, and Lily-Anne seizes it, spinning around on a wide shelf and gazing into Ethan's mouth. He chuckles, and Lily-Anne steps on the sleeve of her shirt and trips."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack stands on the ship's prow, arms lifted as it sails across the ocean, while Rose, Ruth, Cal, and guests lunch nearby. Tension arises when Rose smokes, defying her mother and Cal. Meanwhile, Jack sketches passengers, and Rose catches his eye. Cal confronts Rose, who storms off, followed by Cal. Wearing a ruby gown, Rose rushes through the ship's decks, eventually reaching the poop deck in tears. As she climbs over the railing, contemplating the water below, Jack approaches, calmly removing his coat and boots. He extends his hand to Rose, who takes it and turns to face him, but she slips on her dress hem."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He smiles and Rose steps on the hem of her dress and slips He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes  Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him  She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship  Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face  She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel  With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water  Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past  Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship  They exchange words and Rose strides off with Cal rolling his eyes and trailing after her  Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm  Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes  Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack  The brownhaired Irishman extends his hand to Jack who gazes across the ship  Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes  Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table  Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction  Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache  With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean  Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel  Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes  Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction  Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship  They exchange words and Rose strides off with Cal rolling his eyes and trailing after her  She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship  With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean  Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past  Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes  He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes  Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache  He smiles and Rose steps on the hem of her dress and slips Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table  Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm  Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face  Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack  With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water  The brownhaired Irishman extends his hand to Jack who gazes across the ship  Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him  Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They exchange words and Rose strides off with Cal rolling his eyes and trailing after her  Wearing a rubycolored evening gown Rose shoves past other passengers as she runs down a deck opens a gate and dashes down the lower deck leading to the rear of the ship  Meanwhile Jack lies on a bench smoking a cigarette and gazes up at the starry sky until he sits up as Rose runs past  With tears streaming down her face Rose runs onto the poop deck at the rear of the ship glances over her shoulder and gazes down at the churning water  She places her hands on the railing climbs onto its first wrung and holding onto a flag pole swings her feet over the railing one at a time lowering herself onto the gun wheel  Gripping the railing for support Rose turns to face the water as the wind whips her curly auburn hair around her face  She leans forward over the ocean while Jack creeps up behind her takes a last puff on his cigarette and tosses it off the ship  Placing his hands into his pockets he turns to Rose removes his coat unlaces his boots and pulls them off and as Rose stares down at the water she studies him  He takes off his vest reaches out his hand and Rose grabs it turning around on a narrow ledge and staring into Jack's eyes  He smiles and Rose steps on the hem of her dress and slips Grabbing onto a cable Jack stands on the railing of the ship's prow and raises his arms over his head  With his arms spread he tilts his head back and closes his eyes as the enormous ship surges across the ocean  Meanwhile Ruth Rose and Cal lunch with several guests including Molly Brown and a brownhaired man with a mustache  Ruth stiffens as Rose lights a cigarette in a holder inhales and then blows the smoke in her mother's direction  Cal snatches the cigarette and stubs it out while Rose smiles at him and then stands and leaves the table  Elsewhere a brunette girl stands on a railing as her father grips her from behind and Jack sits a few feet away sketching them with a stick of charcoal while crewmen walk dogs on leashes  The brownhaired Irishman extends his hand to Jack who gazes across the ship  Rose steps to a railing on an upper deck behind Tommy who turns and glances at her then grins at Jack  Jack stares up at Rose as she glances in his direction looks away and then peeks towards him from the corner of her eyes  Fabrizio waves his hand in front of Jack's face and Cal steps up behind Rose and grabs her arm "
        }
      ]
    }
  ]
}