{
  "ground_truth": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up, Rose taps Jack's arm, prompting him to turn around and swallow. Rose steps towards her mother, then glances at Jack, and Molly, smiling at Jack, points to her own chin. Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off. Jack lifts his hands and shrugs. Elsewhere, Molly helps Jack into a black tuxedo jacket, and they gaze into a full-length mirror. At dusk, the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun. Later, a steward opens a door for Jack, who is wearing a white tie and shirt, and he smiles at the steward as he steps inside. He pauses, then walks toward an ornate railing and columns beneath the dome skylight. Jack steps to the railing and gazes down at a couple descending the ship's grand staircase, then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing. Jack descends past a winged statue, observing couples in formal evening wear strolling or chatting. He leans against a column, then notices a bearded man standing erect with his left arm behind his back. Jack stands up straight and places his own arm behind his back, nodding to the man as he and a woman stroll past. Jack watches the couple, then gazes up the staircase as Cal and Ruth descend toward him, with Cal eyeing Jack as they step past him. From the staircase's landing, Rose gazes down at Jack, who pretends to shake somebody's hand, practicing to be a gentleman. Jack turns and looks up at Rose, who is wearing a floor-length black lace dress. She smiles and descends the stairs toward him. Rose stops a few steps above Jack, who takes her white gloved hand and kisses it, then holds out his bent right arm for Rose, who takes it. She smiles as he tilts back his chin, nose in the air, and arm-in-arm, they stroll up to Cal. Cal and Ruth step arm-in-arm toward the reception room, with Rose smiling at Jack as they follow. Later, Rose and Jack descend another wide, curving staircase, passing a dark-haired woman speaking with a white-haired man, who gaze toward a group of people. Molly takes Jack's other arm as Rose, Jack, and Molly step into the large dining room. Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap, and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Rose inclines forward and expectorates while her mother and her companions amble nearby. As Ruth advances, Rose taps Jack's limb, prompting him to pivot and ingest. Rose proceeds toward her mother, then glances at Jack, and Molly, grinning at Jack, indicates her own chin. Jack swiftly wipes drool off his own chin and waves as Rose and her mother stroll off. Jack raises his hands and shrugs. Elsewhere, Molly aids Jack into a black dinner jacket, and they gaze into a full-length mirror. At dusk, the Titanic emits black smoke from its four funnels as it cruises toward the setting sun. Later, a steward opens a door for Jack, who is wearing a white tie and shirt, and he grins at the steward as he steps inside. He pauses, then walks toward an ornate balustrade and columns beneath the dome skylight. Jack steps to the railing and gazes down at a pair descending the ship's grand staircase, then glances up at the skylight and walks down the staircase to the landing where he examines a wall clock with an elaborately carved wooden casing. Jack descends past a winged statue, observing pairs in formal evening attire strolling or chatting. He leans against a column, then notices a bearded gentleman standing erect with his left limb behind his back. Jack stands up straight and places his own limb behind his back, nodding to the gentleman as he and a woman stroll past. Jack observes the pair, then gazes up the staircase as Cal and Ruth descend toward him, with Cal scrutinizing Jack as they step past him. From the staircase's landing, Rose gazes down at Jack, who pretends to shake someone's hand, practicing to be a gentleman. Jack turns and looks up at Rose, who is wearing a floor-length black lace dress. She smiles and descends the stairs toward him. Rose halts a few steps above Jack, who takes her white gloved hand and kisses it, then extends his bent right limb for Rose, who takes it. She smiles as he tilts back his chin, nose in the air, and arm-in-arm, they amble up to Cal. Cal and Ruth step arm-in-arm toward the reception chamber, with Rose smiling at Jack as they follow. Later, Rose and Jack descend another wide, curving staircase, passing a dark-haired woman conversing with a white-haired gentleman, who gaze toward a group of individuals. Molly takes Jack's other limb as Rose, Jack, and Molly step into the large dining hall. Mustached Astor returns as Jack and Rose stroll through the dining chamber and halt at their table. Jack waves his hand while Rose gestures across the table at him to place his napkin in his lap, and Jack gazes down at an array of cutlery placed on both sides of the charger holding his plate."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up, Jack's arm is tapped by Rose, prompting him to turn around and swallow. Rose steps towards her mother, then glances at Jack, and Jack is smiled at by Molly, who points to her own chin. Saliva is quickly wiped off by Jack from his own chin, and he waves as Rose and her mother walk off. His hands are lifted by Jack, and he shrugs. Elsewhere, Jack is helped by Molly into a black tuxedo jacket, and a full-length mirror is gazed into by them. At dusk, black smoke is trailed by the Titanic from its four smoke stacks as it sails toward the setting sun. Later, Jack opens the door by a steward, who is wearing a white tie and shirt, and the steward is smiled at by him as he steps inside. He pauses, then an ornate railing and columns beneath the dome skylight are walked toward by him. The railing is stepped to by Jack, and a couple descending the ship's grand staircase is gazed down at by him, then the skylight is glanced up at by him and he walks down the staircase to the landing where a wall clock with an elaborately carved wooden casing is studied by him. Jack descends past a winged statue, observing couples in formal evening wear strolling or chatting. A column is leaned against by him, then a bearded man standing erect with his left arm behind his back is noticed by him. Jack stands up straight and places his own arm behind his back, nodding to the man as the man and a woman stroll past. The couple is watched by Jack, then the staircase is gazed up at by him as Cal and Ruth descend toward him, with Jack being eyed by Cal as they step past him. From the staircase's landing, Jack is gazed down at by Rose, who pretends to shake somebody's hand, practicing to be a gentleman. Jack turns and Rose is looked up at by him, who is wearing a floor-length black lace dress. She smiles and descends the stairs toward him. A few steps above Jack are stopped by Rose, who takes her white gloved hand and a kiss is given to it by him, then his bent right arm is held out by him for Rose, who takes it. She smiles as his chin is tilted back by him, nose in the air, and arm-in-arm, Cal is strolled up to by them. Cal and Ruth step arm-in-arm toward the reception room, with Jack being smiled at by Rose as they follow. Later, another wide, curving staircase is descended by Rose and Jack, passing a dark-haired woman speaking with a white-haired man, who gaze toward a group of people. Jack's other arm is taken by Molly as the large dining room is stepped into by Rose, Jack, and Molly. Mustached Astor returns as the dining room is strolled through by Jack and Rose, and their table is stopped at. Jack waves his hand while a gesture is made across the table by Rose at him to put his napkin in his lap, and an array of silverware placed on both sides of the charter holding his plate is gazed down at by Jack."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rose leans forward and spits while her mother and friends stroll nearby. Ruth steps up, prompting Rose to tap Jack's arm, making him turn and swallow. Glancing at Jack, Molly points to her chin, and Jack wipes his chin before waving as Rose and her mother walk off. Shrugging, he lifts his hands. Molly helps him into a black tuxedo jacket, and they gaze into a mirror. At dusk, the Titanic emits black smoke as it sails toward the sunset. A steward opens a door for Jack, dressed in a white tie and shirt, and he smiles as he enters. He pauses at an ornate railing beneath a dome skylight, gazing at a couple on the grand staircase, then the skylight. He descends to a landing, observing a wall clock with an elaborately carved casing. Passing a winged statue, Jack notices a bearded man with his arm behind his back and mimics him, nodding as the man and a woman pass. Jack watches them, then sees Cal and Ruth descending, with Cal eyeing him. From the landing, Rose watches Jack pretend to shake a hand. Jack looks up at Rose in a black lace dress. She smiles, descends the stairs, and stops above him. Jack kisses her gloved hand and offers his arm. She takes it, smiling as he tilts his chin, and they stroll to Cal. Cal and Ruth head toward the reception room, with Rose smiling at Jack as they follow. Rose and Jack later descend another staircase, passing a dark-haired woman and a white-haired man. Molly takes Jack's other arm as they enter the large dining room. Astor returns as Jack and Rose stop at their table. Jack waves, and Rose gestures for him to place a napkin on his lap, while he gazes at silverware beside his plate."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rose spits as her mother and friends walk nearby. Ruth approaches, and Rose taps Jack, prompting him to swallow. Molly smiles, gestures to Jack's chin, and he quickly wipes it off, waving as Rose and her mother leave. Molly helps Jack into a tuxedo, and they admire their reflections. The Titanic trails smoke towards the setting sun. A steward opens a door for Jack, dressed in a white tie and shirt. Jack smiles at him, then moves to an ornate railing beneath a dome skylight. He watches a couple descend the grand staircase, glances at the skylight, and studies a clock. Observing couples in formal wear, Jack leans against a column, then mimics a bearded man. Jack nods to him as he and a woman pass. Jack watches the couple, then sees Cal and Ruth descending the staircase. From above, Rose watches Jack pretending to shake hands. He looks up at Rose in a black lace dress. She smiles, descends, and Jack kisses her gloved hand, offering his arm. She takes it, and they stroll to Cal. Arm-in-arm, Cal and Ruth head to the reception room as Rose smiles at Jack. Later, Rose, Jack, and Molly descend a staircase, passing a talking couple and entering the dining room. Astor returns as Jack and Rose stop at their table. Jack waves, and Rose gestures to him to put his napkin in his lap as Jack examines the silverware."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Rose leans forward in a rather animated manner and spits, while her mother, accompanied by her group of friends, casually strolls nearby. As Ruth approaches, Rose gently taps Jack on the arm, prompting him to turn around abruptly and swallow. Rose takes a step toward her mother, then glances back at Jack, while Molly, smiling warmly at Jack, playfully points to her own chin. Jack, realizing the gesture, quickly wipes the saliva off his own chin and waves as Rose and her mother gracefully walk away. He lifts his hands in a shrug of nonchalance. Elsewhere, Molly assists Jack into a sleek black tuxedo jacket, and together they gaze approvingly into a full-length mirror. As dusk falls, the magnificent Titanic trails a plume of black smoke from its four soaring smokestacks, elegantly sailing toward the vibrant setting sun. Later, a courteous steward opens a door for Jack, who is now dressed in a crisp white tie and shirt, and Jack offers a friendly smile to the steward as he steps confidently inside. He pauses for a moment, then makes his way toward an ornate railing and columns beneath the stunning dome skylight. Jack steps closer to the railing, gazing down at a couple making their descent on the ship's grand staircase, then diverts his glance to admire the skylight before he walks down the staircase to the landing, where he attentively studies a wall clock encased in elaborately carved wood. As Jack descends past a winged statue, he observes couples dressed in formal evening wear, either strolling gracefully or engaged in lively conversation. He leans casually against a column, then takes notice of a bearded man standing with an air of dignity, left arm positioned behind his back. Inspired, Jack stands up straight, mimicking the pose by placing his own arm behind his back, nodding courteously to the man as he and a woman stroll by. Jack watches the couple intently, then turns his gaze to the staircase as Cal and Ruth make their descent toward him, with Cal eyeing Jack as they step elegantly past. From her vantage point on the staircase's landing, Rose gazes down at Jack, who feigns a handshake, practicing to embody the mannerisms of a gentleman. Jack turns, catching sight of Rose, who is adorned in a floor-length black lace dress. She smiles warmly and begins her descent toward him. Rose pauses a few steps above Jack, who takes her white-gloved hand with a gentlemanly grace and kisses it, then extends his bent right arm for Rose, who takes it with poise. She smiles as he playfully tilts back his chin, nose in the air, and together, arm-in-arm, they stroll toward Cal. Cal and Ruth, also arm-in-arm, proceed toward the reception room, with Rose casting a smile at Jack as they follow suit. Later, Rose and Jack descend yet another wide, curving staircase, passing a dark-haired woman engaged in conversation with a white-haired man, both of whom gaze toward a gathering of people. Molly takes Jack's other arm as Rose, Jack, and Molly make their entrance into the expansive dining room. Mustached Astor makes a return as Jack and Rose gracefully stroll through the dining area, stopping at their table. Jack waves his hand in a gesture of politeness while Rose gestures across the table at him, instructing him to place his napkin in his lap, and Jack gazes down at the neatly arranged array of silverware placed on both sides of the charger holding his plate."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Rose leans forward in a noticeably animated manner and spits, while her mother, accompanied by her group of close friends, casually strolls by nearby. As Ruth approaches, Rose gently taps Jack on the arm, which prompts him to turn around abruptly and quickly swallow. Rose takes a deliberate step toward her mother, then glances back over her shoulder at Jack, while Molly, smiling warmly at Jack, playfully points to her own chin in a friendly gesture. Jack, realizing the meaning behind the gesture, quickly wipes the saliva off his own chin and waves as Rose and her mother walk gracefully away. He lifts both hands in a shrug that conveys nonchalance. Elsewhere, Molly assists Jack into a sleek black tuxedo jacket, and together they gaze with approval into a full-length mirror. As the dusk begins to fall, the magnificent Titanic trails a plume of thick black smoke from its four soaring smokestacks, elegantly sailing toward the vibrant, fiery setting sun. Later on, a courteous steward opens a door for Jack, who is now dressed in a crisp white tie and shirt, and Jack offers a friendly smile to the steward as he steps confidently inside. He pauses for a moment, then makes his way toward an ornate railing and columns beneath a stunning dome skylight. Jack steps closer to the railing, gazing down intently at a couple making their descent on the ship's grand staircase. He then diverts his glance to admire the elaborately designed skylight, before he begins to walk down the staircase to the landing, where he attentively studies a wall clock encased in elaborately carved wood. As Jack descends past a winged statue, he observes couples dressed in formal evening wear, either strolling gracefully around or engaged in lively conversation. He leans casually against a column, then takes notice of a bearded man standing with an air of dignity, left arm positioned confidently behind his back. Inspired, Jack stands up straight, mimicking the pose by placing his own arm behind his back, and nods courteously to the man as he and a woman stroll by. Jack watches the couple intently as they pass, then turns his gaze toward the staircase as Cal and Ruth make their descent toward him, with Cal eyeing Jack as they step elegantly past. From her high vantage point on the staircase's landing, Rose gazes down at Jack, who feigns a handshake, practicing to embody the mannerisms of a true gentleman. Jack turns, catching sight of Rose, who is adorned in a floor-length black lace dress. She smiles warmly and begins her descent toward him. Rose pauses a few steps above Jack, who takes her white-gloved hand with gentlemanly grace and kisses it, then extends his bent right arm for Rose, who takes it with poise. She smiles as he playfully tilts back his chin, nose in the air, and together, arm-in-arm, they stroll toward Cal. Cal and Ruth, also arm-in-arm, proceed toward the reception room, with Rose casting a smile at Jack as they follow suit. Later on, Rose and Jack descend yet another wide, curving staircase, passing a dark-haired woman engaged in conversation with a white-haired man, both of whom gaze toward a gathering of people. Molly takes Jack's other arm as Rose, Jack, and Molly make their entrance into the expansive dining room. Mustached Astor makes a return appearance as Jack and Rose gracefully stroll through the elegant dining area, stopping at their assigned table. Jack waves his hand in a gesture of politeness, while Rose makes a gesture across the table at him, instructing him to place his folded napkin in his lap, and Jack gazes down at the neatly arranged array of polished silverware placed on both sides of the charger holding his plate."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Rose leans forward, she spits discreetly while her mother and her friends stroll nearby, engaged in conversation. Observing this, Ruth approaches, prompting Rose to gently tap Jack's arm, causing him to turn around and, somewhat flustered, swallow his momentary surprise. Rose then steps toward her mother, casting a quick glance back at Jack, who catches Molly’s eye as she smiles warmly and gestures to her own chin. Realizing her cue, Jack quickly wipes the saliva off his chin, waves casually at Rose and her mother as they walk away, then lifts his hands in an expressive shrug, embracing the moment's awkwardness. Meanwhile, in another setting, Molly aids Jack in slipping into a sharp black tuxedo jacket. They both stand back and admire his reflection in the full-length mirror, taking a moment to ensure every detail of his appearance is in place. As dusk falls, the titanic scene shifts to the grand ship itself, majestically slicing through the ocean while trailing dark plumes of smoke from its four towering smoke stacks, progressing steadily toward the vibrant hues of the setting sun. Later on, a steward politely opens a lavish door for Jack, who, now dressed in an elegant white tie and shirt, acknowledges the steward with a friendly smile as he steps over the threshold. Upon entering, Jack pauses momentarily, absorbing the grandeur before proceeding toward an ornate railing framed by intricately designed columns under a magnificent dome skylight. Positioning himself at the railing, Jack gazes thoughtfully down at a couple gracefully descending the ship's grand staircase. He lifts his gaze toward the skylight, contemplating its beauty, then makes his way down the staircase to a landing where his attention is captured by a wall clock encased in elaborately carved wood. As Jack continues his descent, he passes a striking winged statue, subtly observing the elegantly dressed couples engaged in strolling and conversation. He pauses to lean against a column but soon notices a dignified bearded man standing with an air of confidence, left arm placed behind his back. Inspired, Jack straightens his posture, mimicking the man's stance by positioning his own arm behind his back, and nods respectfully as the man and his companion stroll by him. Jack's gaze follows the couple before he turns his attention upward, where he observes Cal and Ruth making their descent, Cal's eyes fixed on Jack as they pass. From a vantage point on the staircase landing, Rose gazes down at Jack, who playfully pretends to shake an invisible hand, practicing his gentlemanly demeanor. Their eyes meet, and Jack looks up to see Rose, elegantly attired in a floor-length black lace dress. As she smiles warmly, she descends toward him, stopping just a few steps above. Jack, embracing the moment, gently takes her white-gloved hand, bestowing a courteous kiss upon it, then offers his bent right arm. Rose intertwines her arm with his, smiling as Jack adopts a posh posture, nose tilted upward, and together, arm-in-arm, they proceed toward Cal. Cal and Ruth stroll arm-in-arm in the direction of the reception room, while Rose, maintaining her affectionate gaze on Jack, follows suit. Later, Rose and Jack descend another wide, gracefully curving staircase, passing a dark-haired woman engaged in conversation with a white-haired man, both of whom are looking toward a gathering of people. Molly enters the scene, taking Jack's other arm, and the trio—Rose, Jack, and Molly—make their entrance into the expansive dining room. Amidst the gathered company, mustached Astor appears once again as Jack and Rose stroll through the room, finally arriving at their designated table. Jack waves his hand in a friendly gesture, while Rose, with a gentle nod, indicates for him to place his napkin properly in his lap. As Jack obliges, he lets his gaze fall to the carefully arranged array of silverware, neatly positioned on both sides of the charger holding his plate."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rose leans forward and spits while her mother and friends stroll nearby. As Ruth approaches, Rose taps Jack's arm, prompting him to turn and swallow. She steps toward her mother, glancing at Jack, while Molly alerts him to saliva on his chin. Jack quickly wipes it off and waves as Rose and her mother leave. He lifts his hands and shrugs. Elsewhere, Molly helps Jack into a tuxedo, and they admire their reflection in a mirror. At dusk, the Titanic sails into the sunset, trailing black smoke. Later, a steward opens a door for Jack in formal attire, and Jack smiles as he enters, moving toward an ornate railing beneath the dome skylight. He observes a couple on the grand staircase, glances at the skylight, and descends to a landing, studying an elaborate wall clock. Jack observes couples in evening wear as he descends further, noting a bearded man with a poised stance. Mimicking him, Jack nods as the man strolls past with a woman. Watching them, Jack shifts his gaze to Cal and Ruth descending the staircase toward him, with Cal eyeing him. On the landing, Rose gazes at Jack, who practices shaking hands, pretending to be a gentleman. Jack looks up at Rose, smiling in a black lace dress, and she descends to him. He kisses her gloved hand and offers his arm, which Rose takes. She smiles as they walk to Cal with Jack adopting a mock aristocratic posture. Cal and Ruth head to the reception room, with Rose smiling at Jack as they follow. Later, Rose and Jack descend another staircase, passing a couple engaged in conversation. Molly joins them as they enter the dining room. Astor observes as Jack and Rose reach their table. Rose gestures for Jack to place his napkin in his lap, and he surveys the assortment of silverware around his plate."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby, their leisurely pace reflecting the opulence of their journey on the Titanic, the famed luxury liner that tragically sank in 1912 during its maiden voyage. As Ruth steps up, Rose taps Jack's arm, prompting him to turn around and swallow. Rose steps toward her mother, then glances at Jack, who is part of the ship's artful blend of passengers from various social standings, and Molly, smiling at Jack, points to her own chin. Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off, the transient connections formed aboard echoing the ship's brief but eventful life. Jack lifts his hands and shrugs. Elsewhere, Molly helps Jack into a black tuxedo jacket, attire signaling his attempt to fit into the first-class setting, and they gaze into a full-length mirror, its reflection a testament to the grandeur of the Titanic's interiors. At dusk, the Titanic trails black smoke from its four smokestacks as it sails toward the setting sun, a sight often remembered in historical accounts of the liner's fateful journey. Later, a steward opens a door for Jack, who is wearing a white tie and shirt, traditional formal wear of the early 20th century, and he smiles at the steward as he steps inside. He pauses, then walks toward an ornate railing and columns beneath the dome skylight, a marvel of Edwardian architectural design. Jack steps to the railing and gazes down at a couple descending the ship's grand staircase, then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing, indicative of the Titanic's attention to detailed craftsmanship. Jack descends past a winged statue, observing couples in formal evening wear strolling or chatting, their fashion a vivid reflection of the opulent lifestyle aboard. He leans against a column, then notices a bearded man standing erect with his left arm behind his back, a posture of gentlemanly etiquette. Jack stands up straight and places his own arm behind his back, nodding to the man as he and a woman, embodying high society manners, stroll past. Jack watches the couple, then gazes up the staircase as Cal and Ruth descend toward him, with Cal, whose wealth has afforded him the privileges of first-class, eyeing Jack as they step past him. From the staircase's landing, Rose gazes down at Jack, who pretends to shake somebody's hand, practicing to be a gentleman, a challenge for many crossing class boundaries. Jack turns and looks up at Rose, who is wearing a floor-length black lace dress, a style popular amongst the elite during this era. She smiles and descends the stairs toward him. Rose stops a few steps above Jack, who takes her white-gloved hand and kisses it, then holds out his bent right arm for Rose, who takes it. She smiles as he tilts back his chin, nose in the air, a playful mimicry of aristocratic airs, and arm-in-arm, they stroll up to Cal. Cal and Ruth step arm-in-arm toward the reception room, with Rose smiling at Jack as they follow, moving gracefully through the ship's grand hallways. Later, Rose and Jack descend another wide, curving staircase, passing a dark-haired woman speaking with a white-haired man, who gaze toward a group of people engrossed in conversation, typical of social gatherings on the world-renowned Titanic. Molly takes Jack's other arm as Rose, Jack, and Molly step into the large dining room, its grandeur a hallmark of the ship's luxury experience. Mustached Astor, a nod to John Jacob Astor IV, one of the wealthiest passengers aboard, returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap, and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate, a customary setting that reflects the formal dining etiquette of the time."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jack and Molly step into the large dining room Rose leans forward and spits while her mother and her friends stroll nearby Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off Jack lifts his hands and shrugs Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off Rose leans forward and spits while her mother and her friends stroll nearby From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside Jack lifts his hands and shrugs He pauses then walks toward an ornate railing and columns beneath the dome skylight Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing Jack descends past a winged statue observing couples in formal evening wear strolling or chatting Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him He leans against a column then notices a bearded man standing erect with his left arm behind his back Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past He pauses then walks toward an ornate railing and columns beneath the dome skylight Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside Jack turns and looks up at Rose who is wearing a floorlength black lace dress She smiles and descends the stairs toward him Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it She smiles as he tilts back his chin nose in the air and arminarm Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin they stroll up to Cal Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people Molly takes Jack's other arm as Rose Jack and Molly step into the large dining room Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow. Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin. Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off. Jack lifts his hands and shrugs. Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror. At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun. Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside. He pauses then walks toward an ornate railing and columns beneath the dome skylight. Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing. Jack descends past a winged statue observing couples in formal evening wear strolling or chatting. He leans against a column then notices a bearded man standing erect with his left arm behind his back. Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him. From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman. Jack turns and looks up at Rose who is wearing a floorlength black lace dress. She smiles and descends the stairs toward him. Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it. She smiles as he tilts back his chin nose in the air and arminarm. they stroll up to Cal. Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow. Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people. Molly takes Jack's other arm as Rose. Jack and Molly step into the large dining room. Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow. Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin. Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off. Jack lifts his hands and shrugs. Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror. At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun. Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside. He pauses then walks toward an ornate railing and columns beneath the dome skylight. Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing. Jack descends past a winged statue observing couples in formal evening wear strolling or chatting. He leans against a column then notices a bearded man standing erect with his left arm behind his back. Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him. From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman. Jack turns and looks up at Rose who is wearing a floorlength black lace dress. She smiles and descends the stairs toward him. Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it. She smiles as he tilts back his chin nose in the air and arminarm. they stroll up to Cal. Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow. Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people. Molly takes Jack's other arm as Rose. Jack and Molly step into the large dining room. Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow. Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin. Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off. Jack lifts his hands and shrugs. Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror. At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun. Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow. Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people. Molly takes Jack's other arm as Rose. Jack and Molly step into the large dining room. Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Rose leans forward and spits while her mother and her friends stroll nearby. As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow. Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin. Jack and Molly step into the large dining room. Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table. Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dolphin leans forward and spits while the kangaroo and the giraffes stroll nearby. As the parrot steps up, the dolphin taps the rabbit's arm, prompting the rabbit to turn around and swallow. The dolphin steps towards the kangaroo, then glances at the rabbit, and the seagull, smiling at the rabbit, points to its own chin. The rabbit quickly wipes saliva off its own chin and waves as the dolphin and the kangaroo walk off. The rabbit lifts its hands and shrugs. Elsewhere, the seagull helps the rabbit into a black tuxedo jacket, and they gaze into a full-length mirror. At dusk, the canoe trails black smoke from its four smoke stacks as it sails toward the setting sun. Later, a goldfish opens a door for the rabbit, who is wearing a white tie and shirt, and the rabbit smiles at the goldfish as it steps inside. The rabbit pauses, then walks toward an ornate railing and columns beneath the dome skylight. The rabbit steps to the railing and gazes down at a couple descending the ship's grand staircase, then glances up at the skylight and walks down the staircase to the landing where it studies a wall clock with an elaborately carved wooden casing. The rabbit descends past a winged statue, observing couples in formal evening wear strolling or chatting. It leans against a column, then notices an owl standing erect with its left arm behind its back. The rabbit stands up straight and places its own arm behind its back, nodding to the owl as it and a squirrel stroll past. The rabbit watches the couple, then gazes up the staircase as the lion and the fox descend toward it, with the lion eyeing the rabbit as they step past it. From the staircase's landing, the dolphin gazes down at the rabbit, who pretends to shake somebody's hand, practicing to be a gentleman. The rabbit turns and looks up at the dolphin, who is wearing a floor-length black lace dress. It smiles and descends the stairs toward the rabbit. The dolphin stops a few steps above the rabbit, who takes its white gloved hand and kisses it, then holds out its bent right arm for the dolphin, who takes it. The dolphin smiles as the rabbit tilts back its chin, nose in the air, and arm-in-arm, they stroll up to the lion. The lion and the fox step arm-in-arm toward the reception room, with the dolphin smiling at the rabbit as they follow. Later, the dolphin and the rabbit descend another wide, curving staircase, passing a dark-haired owl speaking with a white-haired squirrel, who gaze toward a group of people. The seagull takes the rabbit's other arm as the dolphin, the rabbit, and the seagull step into the large dining room. Mustached eagle returns as the rabbit and the dolphin stroll through the dining room and stop at their table. The rabbit waves its hand while the dolphin gestures across the table at it to put its napkin in its lap, and the rabbit gazes down at an array of silverware placed on both sides of the charter holding its plate."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Rose leans forward and sneezes while her mother and her friends stroll nearby. As Ruth steps up, Rose taps Jack's shoulder, prompting him to turn around and cough. Rose steps towards her mother, then glances at Jack, and Molly, smiling at Jack, points to her own cheek. Jack quickly wipes a tear off his own cheek and waves as Rose and her mother walk off. Jack lifts his feet and shrugs. Elsewhere, Molly helps Jack into a red trench coat, and they gaze into a wall mirror. At dusk, the Zeppelin trails white vapor from its four propellers as it flies toward the glowing horizon. Later, a valet opens a window for Jack, who is wearing a black vest and scarf, and he smiles at the valet as he steps inside. He pauses, then walks toward a plain fence and barrels beneath the glass canopy. Jack steps to the fence and gazes down at a couple descending the airship's spiral staircase, then glances up at the canopy and walks down the staircase to the landing where he studies a sundial with an intricately painted stone base. Jack descends past a winged bird sculpture, observing couples in traditional attire strolling or chatting. He leans against a pillar, then notices a bearded woman standing erect with her right arm behind her back. Jack stands up straight and places his own arm behind his back, nodding to the woman as she and a man stroll past. Jack watches the couple, then gazes up the staircase as Cal and Ruth descend toward him, with Cal eyeing Jack as they step past him. From the staircase's landing, Rose gazes down at Jack, who pretends to shine somebody's shoe, practicing to be a gentleman. Jack turns and looks up at Rose, who is wearing a knee-length red velvet coat. She smiles and descends the stairs toward him. Rose stops a few steps above Jack, who takes her silk-scarved hand and kisses it, then holds out his bent left arm for Rose, who takes it. She smiles as he tilts back his forehead, eyebrows in the air, and arm-in-arm, they stroll up to Cal. Cal and Ruth step arm-in-arm toward the lounge area, with Rose smiling at Jack as they follow. Later, Rose and Jack descend another narrow, spiral staircase, passing a blonde man speaking with a bald woman, who gaze toward a circle of people. Molly takes Jack's other arm as Rose, Jack, and Molly step into the vast ballroom. Bearded Astor returns as Jack and Rose stroll through the ballroom and stop at their booth. Jack waves his napkin while Rose gestures across the booth at him to put his handkerchief in his pocket, and Jack gazes down at an array of glasses placed on both sides of the menu holding his bread."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Rose leans forward and whistles while her mother and her friends dance nearby. As Ruth arrives, Rose nudges Jack's arm, prompting him to spin around and chuckle. Rose dances towards her mother, then peers at Jack, and Molly, grinning at Jack, pokes at her own chin. Jack quickly pats his own chin and nods as Rose and her mother skip off. Jack raises his hands and yawns. Elsewhere, Molly dresses Jack in a black tuxedo jacket, and they peek into a full-length mirror. At dusk, the Titanic releases black smoke from its four smoke stacks as it drifts toward the setting sun. Later, a steward shuts a door for Jack, who is wearing a white tie and shirt, and he waves at the steward as he sits inside. He pauses, then strolls toward an ornate railing and columns beneath the dome skylight. Jack leans on the railing and peers down at a couple ascending the ship's grand staircase, then glances up at the skylight and dances down the staircase to the landing where he observes a wall clock with an elaborately carved wooden casing. Jack skips past a winged statue, watching couples in formal evening wear laughing or dining. He rests against a column, then notices a bearded man standing motionless with his left arm raised. Jack stands up straight and mimics his own arm, nodding to the man as he and a woman skip past. Jack follows the couple, then looks up the staircase as Cal and Ruth glide toward him, with Cal glaring at Jack as they hop past him. From the staircase's landing, Rose peers down at Jack, who pretends to wave to somebody, practicing to be sociable. Jack turns and gazes up at Rose, who is wearing a floor-length black lace dress. She giggles and glides down the stairs toward him. Rose pauses a few steps above Jack, who shakes her white gloved hand and pats it, then offers his bent right arm for Rose, who grabs it. She laughs as he tilts back his head, nose in the air, and arm-in-arm, they dance up to Cal. Cal and Ruth stroll arm-in-arm toward the reception room, with Rose laughing at Jack as they trail. Later, Rose and Jack skip down another wide, curving staircase, passing a dark-haired woman chatting with a white-haired man, who peek toward a group of people. Molly grabs Jack's other arm as Rose, Jack, and Molly wander into the large dining room. Mustached Astor reappears as Jack and Rose wander through the dining room and halt at their table. Jack claps his hand while Rose points across the table at him to put his napkin in his lap, and Jack glances down at an array of silverware scattered on both sides of the charter holding his plate."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tulip leans forward and sneezes while her father and her siblings hop nearby. As Lila steps up, Tulip taps Max's shoulder, prompting him to turn around and whistle. Tulip steps towards her father, then glances at Max, and Lucy, beaming at Max, points to her own elbow. Max quickly wipes sweat off his own elbow and nods as Tulip and her father hop off. Max lifts his feet and shrugs. Elsewhere, Lucy nudges Max into a red tuxedo jacket, and they peer into a tall mirror. At dawn, the Ocean Queen trails white mist from its three funnels as it glides toward the rising moon. Later, a butler opens a window for Max, who is wearing a red sweater and pants, and he grins at the butler as he steps inside. He hesitates, then strides toward a simple fence and poles beneath the roof hatch. Max steps to the fence and peers down at a trio ascending the boat's narrow escalator, then glances up at the hatch and strides down the escalator to the platform where he examines a wall lamp with an elegantly painted metal frame. Max descends past a feathered sculpture, observing trios in casual morning attire hopping or napping. He leans against a pole, then notices a bald woman standing hunched with her right leg behind her head. Max stands up straight and places his own leg behind his head, smiling at the woman as she and a man hop past. Max watches the trio, then peers up the escalator as Ken and Lila ascend toward him, with Ken observing Max as they hop past him. From the escalator's platform, Tulip peers down at Max, who pretends to clap somebody's shoulder, practicing to be an entertainer. Max turns and looks up at Tulip, who is wearing a knee-length white satin skirt. She grins and ascends the escalator toward him. Tulip stops a few steps below Max, who takes her black booted toe and pats it, then holds out his bent left elbow for Tulip, who takes it. She smiles as he tilts forward his forehead, eyes to the ground, and elbow-in-elbow, they hop up to Ken. Ken and Lila hop elbow-in-elbow toward the tea room, with Tulip smiling at Max as they follow. Later, Tulip and Max ascend another narrow, straight escalator, passing a fair-haired man whispering with a bald woman, who peer toward a herd of animals. Lucy takes Max's other elbow as Tulip, Max, and Lucy hop into the tiny living room. Bearded Baxter returns as Max and Tulip hop through the living room and stop at their couch. Max nods his foot while Tulip waves across the couch at him to rest his foot in his lap, and Max peers down at a bunch of cutlery scattered on both sides of the envelope holding his bowl."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lily reclines backward and whistles while her sister and her neighbors jog nearby. As Sarah bends down, Lily nudges Ben's leg, prompting him to glance around and chuckle. Lily skips towards her sister, then winks at Ben, and Emma, laughing at Ben, gestures to her own forehead. Ben quickly brushes glitter off his own forehead and salutes as Lily and her sister dance off. Ben claps his hands and grins. Nearby, Emma dresses Ben in a silver blazer, and they peer into a half-open wardrobe. At dawn, the Leviathan releases white steam from its four chimneys as it drifts away from the rising moon. Later, a butler slides a curtain for Ben, who is wearing a red scarf and vest, and he winks at the butler as he slides inside. He hesitates, then skips toward a plain fence and gates above the concrete overhang. Ben leaps to the fence and peers up at a band rising the ship's towering scaffolding, then squints at the overhang and skips up the scaffolding to the platform where he examines a ceiling lamp with a simply molded metal casing. Ben ascends below a singing bird, witnessing bands in casual daywear jumping or humming. He reclines on a bench, then notices a bald woman sitting slouched with her right leg across her lap. Ben sits up straight and places his own leg across his lap, waving to the woman as he and a man pace past. Ben surveys the band, then gazes down the scaffolding as Jake and Sarah ascend away from him, with Jake glancing at Ben as they pace past him. From the scaffolding's platform, Lily peers up at Ben, who pretends to hold someone's umbrella, rehearsing to be a scholar. Ben turns and looks down at Lily, who is wearing a knee-length white cotton dress. She frowns and ascends the stairs away from him. Lily stops a few steps below Ben, who takes her blue scarfed shoulder and nods at it, then holds out his stretched left leg for Lily, who snatches it. She frowns as he tilts forward his forehead, eyes on the ground, and leg-in-leg, they march down to Jake. Jake and Sarah sprint leg-in-leg away from the ballroom, with Lily frowning at Ben as they wander. Later, Lily and Ben rise another narrow, winding ladder, witnessing a light-haired man singing with a bald woman, who listen toward a line of animals. Emma takes Ben's both legs as Lily, Ben, and Emma tiptoe into the small ballroom. Bearded Lee vanishes as Ben and Lily hop around the ballroom and sprint from their chair. Ben raises his elbow while Lily shouts across the chair at him to toss his scarf in his lap, and Ben squints up at a pair of gloves placed under both edges of the bowl holding his spoon."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Rose tilts backward and whistles while her mother and her friends jog nearby. As Ruth kneels down, Rose flicks Jack's wrist, prompting him to spin around and cheer. Rose hops toward her mother, then peers at Jack, and Molly, waving at Jack, gestures to her own shoulder. Jack quickly pats dust off his own shoulder and nods as Rose and her mother saunter away. Jack raises his hands and nods. Elsewhere, Molly hoists Jack into a red velvet cloak, and they glance into a framed portrait. At dawn, the Titanic puffs white steam from its four chimneys as it drifts toward the rising moon. Later, a steward removes a curtain for Jack, who is wearing a green vest and scarf, and he winks at the steward as he glides inside. He hesitates, then skips toward a wooden fence and sculptures beneath the dome skylight. Jack steps to the fence and squints down at a dog ascending the ship's grand staircase, then peers up at the skylight and floats down the staircase to the landing where he examines a wristwatch with an intricately carved leather strap. Jack floats past a winged gargoyle, noticing turtles in formal evening wear jogging or conversing. He leans against a pillar, then recognizes a bald woman standing slouched with her right arm in front of her chest. Jack stands up straight and swings his own arm in front of his chest, bowing to the woman as she and a man jog past. Jack observes the turtles, then squints up the staircase as Cal and Ruth float toward him, with Cal grinning at Jack as they drift past him. From the staircase's landing, Rose peeks down at Jack, who pretends to juggle oranges, rehearsing to be an entertainer. Jack turns and gazes up at Rose, who is wearing a knee-length blue silk skirt. She frowns and glides down the stairs toward him. Rose stops a few steps above Jack, who taps her red-gloved hand and bows, then holds out his straight left leg for Rose, who steps on it. She frowns as he tips forward his head, face to the ground, and leg-in-leg, they skip up to Cal. Cal and Ruth glide leg-in-leg toward the garden room, with Rose frowning at Jack as they progress. Later, Rose and Jack float down another narrow, zigzagging passage, passing a long-haired boy whispering with a bald girl, who peep toward a line of animals. Molly clutches Jack's third leg as Rose, Jack, and Molly skip into the tiny kitchen. Bearded Baker dances as Jack and Rose float through the kitchen and pause at their counter. Jack claps his hands while Rose signals across the counter at him to drop his napkin under his foot, and Jack squints down at a stack of teacups placed on both ends of the candlestick holding his saucer."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Daisy reclines backward and hiccups while her father and his parrots jog nearby. As Lucy skips down, Daisy nudges Max's shoulder, provoking him to spin around and sneeze. Daisy skips toward her father, then winks at Max, and Polly, grinning at Max, gestures to her own elbow. Max hurriedly dabs soup off his own elbow and nods as Daisy and her father jog away. Max raises his feet and yawns. Elsewhere, Polly guides Max into a red leather vest, and they peer into a half-length painting. At dawn, the locomotive releases white steam from its three chimneys as it chugs toward the rising moon. Later, a chef pushes a window for Max, who is wearing a red hat and vest, and he grins at the chef as he climbs outside. He pauses, then skips toward a spiraled tower and beams beneath the dome lantern. Max hops to the tower and peers up at a dog ascending the train's narrow ladder, then blinks up at the lantern and dances up the ladder to the rooftop where he studies a sundial with an elegantly etched stone base. Max ascends past a feathered sculpture, watching donkeys in casual day wear dancing or whispering. He slumps against a tree, then spots a clean-shaven dog lounging sideways with its right leg behind its ear. Max lounges upright and places his own leg behind his ear, waving to the dog as it and a cat skip past. Max observes the pair, then peers up the ladder as Ned and Lucy ascend past him, with Ned glaring at Max as they march past him. From the ladder's rooftop, Daisy peers up at Max, who pretends to shake a llama's foot, practicing to be a gentlewoman. Max twirls and peers up at Daisy, who is wearing a knee-length red wool sweater. She chuckles and hops down to him. Daisy pauses a few hops above Max, who grabs her blue gloved foot and pats it, then extends his clenched left foot for Daisy, who grabs it. She chuckles as he tilts forward his nose, knees to the dirt, and foot-in-hand, they march down to Ned. Ned and Lucy skip foot-in-foot toward the ballroom, with Daisy chuckling at Max as they trail. Later, Daisy and Max ascend another narrow, twisting ladder, passing a bald-eared cat chatting with a blue-feathered bird, who blink toward a crowd of fish. Polly grabs Max's left foot as Daisy, Max, and Polly hop into the giant theater. Bearded Carson returns as Max and Daisy dance through the theater and pause at their podium. Max pats his foot while Daisy points across the podium at him to place his scarf in his hand, and Max blinks up at an array of trumpets positioned on both sides of the parchment holding his goblet."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rose, her mother, and friends stroll while Rose taps Jack, prompting him to wipe his chin and wave as they walk away. Molly helps Jack into a tuxedo, and they admire their reflection. The Titanic sails at dusk, trailing smoke. A steward opens a door for Jack, who walks inside, observing the grand staircase and couples in formal wear. Mimicking a poised man, Jack nods as Ruth and Cal descend toward him. Jack practices being a gentleman, and Rose, in a black lace dress, smiles and descends the stairs to him. Jack kisses her hand, offers his arm, and they stroll to Cal. Arm-in-arm, they proceed to the reception room, and later, Rose, Jack, and Molly enter the dining room. Jack and Rose stop at their table, where Jack is prompted to place his napkin in his lap, and he looks at the silverware arrangement."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table Jack and Molly step into the large dining room Molly takes Jack's other arm as Rose Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow they stroll up to Cal She smiles as he tilts back his chin nose in the air and arminarm Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it She smiles and descends the stairs toward him Jack turns and looks up at Rose who is wearing a floorlength black lace dress From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past He leans against a column then notices a bearded man standing erect with his left arm behind his back Jack descends past a winged statue observing couples in formal evening wear strolling or chatting Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing He pauses then walks toward an ornate railing and columns beneath the dome skylight Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror Jack lifts his hands and shrugs Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow Rose leans forward and spits while her mother and her friends stroll nearby"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She smiles and descends the stairs toward him Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate they stroll up to Cal At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror Jack descends past a winged statue observing couples in formal evening wear strolling or chatting Jack turns and looks up at Rose who is wearing a floorlength black lace dress Molly takes Jack's other arm as Rose He leans against a column then notices a bearded man standing erect with his left arm behind his back She smiles as he tilts back his chin nose in the air and arminarm As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman Jack and Molly step into the large dining room Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table Jack lifts his hands and shrugs Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside He pauses then walks toward an ornate railing and columns beneath the dome skylight Rose leans forward and spits while her mother and her friends stroll nearby Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jack watches the couple then gazes up the staircase as Cal and Ruth descend toward him with Cal eyeing Jack as they step past him From the staircase's landing Rose gazes down at Jack who pretends to shake somebody is hand practicing to be a gentleman Jack turns and looks up at Rose who is wearing a floorlength black lace dress She smiles and descends the stairs toward him Rose stops a few steps above Jack who takes her white gloved hand and kisses it then holds out his bent right arm for Rose who takes it She smiles as he tilts back his chin nose in the air and arminarm they stroll up to Cal Cal and Ruth step arminarm toward the reception room with Rose smiling at Jack as they follow Later Rose and Jack descend another wide curving staircase passing a darkhaired woman speaking with a whitehaired man who gaze toward a group of people Molly takes Jack's other arm as Rose Jack and Molly step into the large dining room Mustached Astor returns as Jack and Rose stroll through the dining room and stop at their table Jack waves his hand while Rose gestures across the table at him to put his napkin in his lap and Jack gazes down at an array of silverware placed on both sides of the charter holding his plate Rose leans forward and spits while her mother and her friends stroll nearby As Ruth steps up Rose taps Jack's arm prompting him to turn around and swallow Rose steps towards her mother then glances at Jack and Molly smiling at Jack points to her own chin Jack quickly wipes saliva off his own chin and waves as Rose and her mother walk off Jack lifts his hands and shrugs Elsewhere Molly helps Jack into a black tuxedo jacket and they gaze into a fulllength mirror At dusk the Titanic trails black smoke from its four smoke stacks as it sails toward the setting sun Later a steward opens a door for Jack who is wearing a white tie and shirt and he smiles at the steward as he steps inside He pauses then walks toward an ornate railing and columns beneath the dome skylight Jack steps to the railing and gazes down at a couple descending the ship's grand staircase then glances up at the skylight and walks down the staircase to the landing where he studies a wall clock with an elaborately carved wooden casing Jack descends past a winged statue observing couples in formal evening wear strolling or chatting He leans against a column then notices a bearded man standing erect with his left arm behind his back Jack stands up straight and places his own arm behind his back nodding to the man as he and a woman stroll past"
        }
      ]
    }
  ]
}