{
  "ground_truth": "She moves away from the door with a slow, unhurried pace and bursts through the bathroom door, finding Celia sitting in a pool of blood. Hastily picking up the fallen towel rack, Minnie calmly takes in the situation, pulls the counterpane over Celia who is laying down in her bed, and presses a wet cloth to Celia's neck. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace. Outside in her garden, Celia has dug a hole in the lawn, places a small square cardboard box into the hole, and starts to fill it with earth. Just in front of her, there are two rose bushes, each in its own brick-lined flower bed, and with the hole almost filled, she reaches for a third rose bush and places it into the hole. Out on the street, the yellow and green bus doors open and a stream of maids stepped down, with the last to emerge being Yule Mae and Aibileen. A police officer handcuffs Yule Mae, and Aibileen is pushed back against the side of the bus as Yule Mae is strung armed away, her face pushed down onto the bonnet of a police car, one of the men cautions her. Aibileen witnesses white mothers and their children turned away with studded indifference, and Hilly sits in her car with her son, her face impassive. Skeeter is at the counter in the diner as Hilly comes in, parks her son in one of the booths, and Henry, behind the counter, leans into Skeeter with his wise dark eyes peering at her through his owl-like glasses. She rushes over to Aibileen, finding the living room full of maids who all turn to look at her with their somber smooth-skinned faces as Aibileen beckons to her. Her eyes brimming with tears, she steps into the center of the room as a white-haired woman tells her story. Miss Tine, having lunch with two male colleagues in a swanky restaurant, is on the phone to Skeeter. An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table. Celia, wearing a low-cut fitted plum top over a tight pink skirt, sachets up the garden path carrying a pie. Elizabeth glances towards the door and Hilly's jaw drops, but Hilly takes control and ducks out of sight. At the front of the house, Celia sees a gap in the curtains and gives a cheery smile, which Hilly sees, causing Celia's friendly smile to fade. She retreats, taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car, Celia fights back her tears, and back at home, Minnie looks at her like a mother talking to a small child who's just been bullied.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She shifts away from the portal with a gradual, leisurely gait and erupts through the lavatory portal, discovering Celia seated in a puddle of gore. Hurriedly collecting the dropped towel bar, Minnie serenely absorbs the scenario, pulls the coverlet over Celia who is reclining in her cot, and presses a damp cloth to Celia's throat. Minnie's hopeful look fades as Celia's visage collapses in a weepy grimace. Outdoors in her yard, Celia has excavated a cavity in the turf, places a petite square cardboard container into the cavity, and begins to fill it with soil. Just ahead of her, there are two rose shrubs, each in its own brick-edged flower bed, and with the cavity almost filled, she reaches for a third rose shrub and places it into the cavity. Out on the road, the yellow and green coach portals open and a stream of domestics descended down, with the last to appear being Yule Mae and Aibileen. A constable manacles Yule Mae, and Aibileen is shoved back against the flank of the coach as Yule Mae is led handcuffed away, her face pushed down onto the hood of a patrol automobile, one of the men warns her. Aibileen observes white matriarchs and their offspring turned away with adorned apathy, and Hilly perches in her car with her boy, her face emotionless. Skeeter is at the counter in the café as Hilly arrives, parks her boy in one of the booths, and Henry, behind the counter, leans into Skeeter with his perceptive dark eyes gazing at her through his avian-like spectacles. She dashes over to Aibileen, finding the drawing room full of domestics who all turn to gaze at her with their grave smooth-skinned visages as Aibileen gestures to her. Her eyes overflowing with tears, she steps into the center of the room as a silver-haired lady shares her narrative. Miss Tine, dining with two male associates in an upscale bistro, is on the telephone to Skeeter. A tangerine cruiser pulls into Elizabeth drive where the bridge initiates in full swing as Mary Beth takes Skeeter's spot at Hilly's table. Celia, wearing a low-cut tailored plum blouse over a snug pink skirt, glides up the yard path carrying a pastry. Elizabeth glances toward the portal and Hilly's jaw drops, but Hilly regains composure and ducks out of view. At the front of the dwelling, Celia notices a slit in the drapes and gives a cheerful grin, which Hilly sees, causing Celia's amiable grin to fade. She withdraws, taking her pastry with her as Aibileen observes her embarrassment from the threshold to the kitchen. On the way to her automobile, Celia suppresses her tears, and back at home, Minnie regards her like a mother speaking to a small child who's just been bullied."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is moved away from the door with a slow, unhurried pace and the bathroom door is burst through by her, finding Celia sitting in a pool of blood. The fallen towel rack is hastily picked up by Minnie, who calmly takes in the situation. The counterpane is pulled over Celia, who is laying down in her bed, and a wet cloth is pressed to Celia's neck by Minnie. As Celia's face crumples in a tearful grimace, Minnie's encouraging expression is faded. Outside in her garden, a hole is dug in the lawn by Celia. She places a small square cardboard box into the hole and starts filling it with earth. Just in front of her, she sees two rose bushes, each in its own brick-lined flower bed, and with the hole almost filled, she reaches for a third rose bush and places it into the hole. Out on the street, the yellow and green bus doors are opened and a stream of maids steps down, with Yule Mae and Aibileen being the last to emerge. Yule Mae is handcuffed by a police officer, and Aibileen pushes back against the side of the bus as Yule Mae is strung armed away, her face is pushed down onto the bonnet of a police car, and one of the men cautions her. Aibileen witnesses white mothers and their children turning away with studded indifference, and Hilly sits in her car with her son, her face remains impassive. Skeeter is found at the counter in the diner when Hilly comes in, parks her son in one of the booths, and Henry, behind the counter, leans into Skeeter with his wise dark eyes peering at her through his owl-like glasses. She is rushed over to by Aibileen, who finds the living room full of maids, all turn to look at her with their somber smooth-skinned faces as Aibileen beckons to her. Her eyes are brimmed with tears as she steps into the center of the room, while a white-haired woman tells her story. Miss Tine is having lunch with two male colleagues in a swanky restaurant and is on the phone to Skeeter. An orange cruiser is pulled into Elizabeth Drive where the bridge is launched in full swing as Skeeter’s place at Hilly's table is taken by Mary Beth. Celia is seen wearing a low-cut fitted plum top over a tight pink skirt, sashay up the garden path carrying a pie. Elizabeth's glance is directed towards the door and Hilly's jaw is dropped, but control is taken by Hilly, who ducks out of sight. At the front of the house, a gap in the curtains is seen by Celia, who gives a cheery smile, which is seen by Hilly, causing Celia's friendly smile to be faded. She retreats, taking her pie with her, and Celia's humiliation is watched from the doorway to the kitchen by Aibileen. On the way to her car, her tears are fought back by Celia, and back at home, Minnie looks at her like a mother talking to a small child who's just been bullied."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She moves slowly from the door and bursts into the bathroom, finding Celia in a pool of blood. Minnie picks up the fallen towel rack, covers Celia with a counterpane, and presses a wet cloth to her neck. Minnie's encouraging look fades as Celia grimaces tearfully. In her garden, Celia digs a hole, places a small cardboard box inside, and fills it with earth. Two rose bushes are in front of her, each in a brick-lined bed. She plants a third rose bush in the hole. On the street, a yellow and green bus opens its doors, and maids step down, with Yule Mae and Aibileen last. A police officer handcuffs Yule Mae, pushing Aibileen against the bus as Yule Mae is taken away, her face pressed onto a police car bonnet. Aibileen sees white mothers and children turned away indifferently, while Hilly sits in her car with her son, impassive. Skeeter is at a diner counter when Hilly enters, parks her son in a booth, and Henry peers at Skeeter through owl-like glasses. Skeeter rushes to Aibileen, finding a room full of somber-faced maids as Aibileen beckons her. Tearful, she steps into the room as a white-haired woman shares her story. Miss Tine, lunching with colleagues, calls Skeeter from a swanky restaurant. An orange cruiser arrives at Elizabeth Drive, where Mary Beth takes Skeeter's place at Hilly's table. Celia, in a fitted plum top and pink skirt, walks up the garden path with a pie. Elizabeth glances at the door, and Hilly ducks out of sight. Celia sees a gap in the curtains and smiles, but Hilly's reaction makes her smile fade. Celia retreats with her pie as Aibileen watches from the kitchen doorway. On her way to the car, Celia fights tears, and at home, Minnie looks at her like a mother to a bullied child."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Minnie moves slowly from the door, bursts into the bathroom, and finds Celia in a pool of blood. She picks up the towel rack, covers Celia with a counterpane, and presses a wet cloth to her neck. Celia grimaces tearfully. In her garden, Celia buries a box, fills the hole, and plants a rose bush. On the street, a bus unloads maids, including Yule Mae and Aibileen. A police officer handcuffs Yule Mae, pushing her onto a police car, while Aibileen watches. White mothers and children are ignored, and Hilly sits impassively in her car. Skeeter is at a diner counter when Hilly arrives with her son. Henry, behind the counter, observes Skeeter. Skeeter rushes to Aibileen, finding a room of somber maids. A white-haired woman shares her story. Miss Tine, dining with colleagues, calls Skeeter. An orange cruiser arrives at Elizabeth Drive, and Mary Beth takes Skeeter's place at Hilly's table. Celia, in a plum top and pink skirt, carries a pie up the garden path. Elizabeth glances at the door, and Hilly hides. Celia smiles at a gap in the curtains, but Hilly's reaction makes her smile fade. Celia retreats with her pie, and Aibileen watches from the kitchen. Celia fights tears on her way to the car, and at home, Minnie comforts her like a mother."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a slow and unhurried pace, she moves away from the door and bursts through the bathroom door, where she finds Celia sitting in a distressing pool of blood. Hastily, she picks up the fallen towel rack, and with a calm demeanor, Minnie assesses the situation. She then pulls the counterpane over Celia, who is laying down in her bed, and gently presses a wet cloth to Celia's neck. Minnie's encouraging expression gradually fades as Celia's face crumples into a tearful grimace. Meanwhile, outside in her garden, Celia has dug a hole in the lawn. She carefully places a small square cardboard box into the hole and begins to fill it with earth. Just in front of her, there are two rose bushes, each nestled in its own brick-lined flower bed. With the hole almost filled, she reaches for a third rose bush and places it into the hole with care. Out on the street, the yellow and green bus doors swing open, and a stream of maids steps down, with the last to emerge being Yule Mae and Aibileen. A police officer steps forward to handcuff Yule Mae, and Aibileen is pushed back against the side of the bus as Yule Mae is forcibly taken away, her face pressed down onto the bonnet of a police car, while one of the men cautions her. Aibileen witnesses white mothers and their children being turned away with a cold, studded indifference, and Hilly sits in her car with her son, her face remaining impassive. Inside the diner, Skeeter is at the counter when Hilly comes in, parks her son in one of the booths, and Henry, who is behind the counter, leans into Skeeter with his wise, dark eyes peering at her through his owl-like glasses. She rushes over to Aibileen, finding the living room filled with maids who all turn to look at her with their somber, smooth-skinned faces as Aibileen beckons to her. Her eyes brimming with tears, she steps into the center of the room as a white-haired woman begins to tell her story. Miss Tine, having lunch with two male colleagues in a swanky restaurant, is on the phone with Skeeter. An orange cruiser pulls into Elizabeth Drive, where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table. Celia, wearing a low-cut, fitted plum top over a tight pink skirt, sashays up the garden path carrying a pie. Elizabeth glances towards the door, and Hilly's jaw drops, but Hilly quickly takes control and ducks out of sight. At the front of the house, Celia notices a gap in the curtains and gives a cheery smile, which Hilly sees, causing Celia's friendly smile to fade. She retreats, taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car, Celia fights back her tears, and back at home, Minnie looks at her with the tenderness of a mother talking to a small child who has just been bullied."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Moving at an intentionally slow and unhurried pace, she gently shifts away from the door before forcefully bursting through the bathroom entrance. There, she discovers Celia sitting amidst a distressing and alarming pool of blood. With a sense of urgency, she quickly retrieves the fallen towel rack. Maintaining an outwardly calm and composed demeanor, Minnie carefully evaluates and assesses the situation at hand. She then pulls the counterpane securely over Celia, who is lying down in her bed, ensuring that she is covered, and gently presses a soothing, damp cloth to Celia's neck. As Minnie's initially encouraging expression gradually fades away, Celia's face contorts into a tearful and sorrowful grimace. Meanwhile, outside in her well-tended garden, Celia has meticulously dug a hole in the neatly manicured lawn. She thoughtfully and carefully places a small square-shaped cardboard box into the hole and begins to fill it with the rich earth. Positioned just in front of her are two vibrant rose bushes, each lovingly nestled in its own brick-lined flower bed. With the hole nearly filled to the brim, she reaches for a third rose bush and places it into the hole with tender care. Out on the bustling street, the doors of a yellow and green bus swing open, and a stream of maids descends, with the last to emerge being Yule Mae and Aibileen. A police officer sternly steps forward to handcuff Yule Mae, while Aibileen is pushed back against the side of the bus, feeling the cold metal pressing against her as Yule Mae is forcibly taken away, her face thrust down onto the bonnet of a police car, while one of the officers warns her. Aibileen stands as a witness to white mothers and their children being coldly and indifferently turned away, while Hilly sits silently in her car with her son, her face remaining impassive and unmoved. Within the confines of the bustling diner, Skeeter stands at the counter when Hilly confidently enters, parks her son in one of the booths, and Henry, who is diligently working behind the counter, leans in closer to Skeeter, his wise, dark eyes observing her through his owl-like glasses. She hurriedly rushes over to Aibileen, finding the living room filled with maids who all turn to gaze at her with their somber, smooth-skinned faces as Aibileen beckons to her urgently. Her eyes brimming with an overwhelming flood of tears, she steps into the center of the room as a white-haired woman begins to recount and share her story. Miss Tine, enjoying a leisurely lunch with two male colleagues in a swanky and upscale restaurant, is engaged in a phone call with Skeeter. An orange cruiser cruises into Elizabeth Drive, where the bridge launches into full swing as Mary Beth seamlessly takes Skeeter's place at Hilly's table. Celia, dressed in a low-cut, fitted plum top elegantly paired with a tight pink skirt, confidently sashays up the garden path, carrying a homemade pie. Elizabeth glances anxiously towards the door, and Hilly's jaw drops in surprise, but she swiftly takes control and discreetly ducks out of sight. At the front of the house, Celia notices a gap in the curtains, offering a cheery smile, which Hilly apprehensively sees, causing Celia's friendly smile to fade into disappointment. She retreats from the scene, taking her lovingly made pie with her as Aibileen watches her humiliation unfold from the doorway to the kitchen. On the way to her car, Celia struggles to fight back her tears, and back at home, Minnie looks at her with the tenderness and compassion of a mother speaking to a small child who has just experienced the cruelty of being bullied."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She begins by moving away from the door with a slow, unhurried pace, each step deliberate and measured, before suddenly bursting through the bathroom door with urgency, where she finds Celia sitting in a pool of blood. Quickly assessing the situation, Minnie hastily picks up the fallen towel rack, her movements swift yet controlled, and then calmly takes in the scene before her. She gently pulls the counterpane over Celia, who is laying down in her bed, ensuring she is covered, and then presses a wet cloth to Celia's neck with a steady hand. Minnie's face, initially filled with encouragement, gradually loses its expression as she observes Celia's face crumple into a tearful grimace. Meanwhile, outside in her garden, Celia has meticulously dug a hole in the lawn, her hands working methodically as she places a small square cardboard box into the hole. She begins to fill it with earth, her movements rhythmic and purposeful. Just in front of her, two rose bushes stand proudly, each nestled in its own brick-lined flower bed. With the hole almost filled, she reaches for a third rose bush, carefully placing it into the hole, completing her task with a sense of quiet determination. Out on the street, the yellow and green bus doors swing open, releasing a stream of maids who step down one by one, with Yule Mae and Aibileen being the last to emerge. A police officer approaches Yule Mae, handcuffing her with a firm grip, while Aibileen is pushed back against the side of the bus, watching helplessly as Yule Mae is forcibly led away, her face pressed down onto the bonnet of a police car. One of the men cautions her, his voice stern and unyielding. Aibileen stands witness to the scene, observing white mothers and their children being turned away with a cold, studded indifference, while Hilly sits in her car with her son, her face remaining impassive and unreadable. Inside a diner, Skeeter stands at the counter as Hilly enters, parking her son in one of the booths. Henry, who is behind the counter, leans in towards Skeeter, his wise dark eyes peering at her through his owl-like glasses, conveying a silent understanding. Skeeter then rushes over to Aibileen, finding the living room filled with maids who all turn to look at her, their somber, smooth-skinned faces reflecting a shared solemnity as Aibileen beckons her forward. With her eyes brimming with tears, she steps into the center of the room, listening intently as a white-haired woman begins to tell her story. Meanwhile, Miss Tine is having lunch with two male colleagues in a swanky restaurant, her attention divided as she speaks on the phone to Skeeter. An orange cruiser pulls into Elizabeth Drive, where the bridge launches in full swing, and Mary Beth takes Skeeter's place at Hilly's table. Celia, dressed in a low-cut fitted plum top over a tight pink skirt, confidently sashays up the garden path, carrying a pie with a sense of purpose. Elizabeth glances towards the door, and Hilly's jaw drops in surprise, but she quickly regains control and ducks out of sight. At the front of the house, Celia notices a gap in the curtains and offers a cheery smile, which Hilly sees, causing Celia's friendly smile to fade into disappointment. She retreats, taking her pie with her, as Aibileen watches her humiliation unfold from the doorway to the kitchen. On her way to the car, Celia fights back her tears, her emotions barely contained, and back at home, Minnie looks at her with a maternal gaze, as if speaking to a small child who has just been bullied, offering silent comfort and understanding."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Minnie moves away from the door and bursts into the bathroom, finding Celia in a pool of blood. She quickly assesses the situation, covers Celia with a counterpane, and presses a wet cloth to her neck. Outside, Celia digs a hole in her garden, places a small cardboard box inside, and fills it with earth before planting a third rose bush alongside two others. On the street, a bus unloads maids, with Yule Mae and Aibileen being the last to emerge. A police officer handcuffs Yule Mae, pushing Aibileen back as Yule Mae is taken away and cautioned. Aibileen observes indifferent white mothers and children, while Hilly sits impassively in her car with her son. In a diner, Skeeter is at the counter when Hilly arrives, parks her son, and Henry, behind the counter, exchanges a knowing glance with Skeeter. Skeeter rushes to Aibileen, finding a room full of somber maids as Aibileen beckons her, and a white-haired woman begins to tell her story. Meanwhile, Miss Tine, dining with colleagues, speaks to Skeeter on the phone. An orange cruiser arrives at Elizabeth Drive, where Mary Beth takes Skeeter's place at Hilly's table during a bridge game. Celia, dressed in a fitted plum top and pink skirt, walks up the garden path with a pie. Elizabeth notices her, and Hilly ducks out of sight. Celia sees a gap in the curtains, smiles cheerfully, but her smile fades when Hilly sees her. She retreats with her pie, humiliated, as Aibileen watches from the kitchen doorway. On her way to the car, Celia fights back tears, and at home, Minnie comforts her like a mother to a bullied child."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She moves away from the door with a slow, unhurried pace and bursts through the bathroom door, finding Celia sitting in a pool of blood, a sight reminiscent of some of the intense narratives found in Southern Gothic literature. Hastily picking up the fallen towel rack, Minnie, who had worked in the house for many years and knew its every corner like her own, calmly takes in the situation, pulls the counterpane over Celia who is laying down in her bed, likely chosen for its comforting thickness, and presses a wet cloth to Celia's neck, a first aid technique often used to slow bleeding or soothe swelling. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace, a reaction that echoes the emotional turbulence faced by characters in 1960s Mississippi, an era of great social upheaval. Outside in her garden, Celia has dug a hole in the lawn, places a small square cardboard box, a biodegradable choice often used for gentle burials, into the hole, and starts to fill it with earth. Just in front of her, there are two rose bushes, each in its own brick-lined flower bed, a traditional English gardening method, and with the hole almost filled, she reaches for a third rose bush and places it into the hole, symbolizing growth and renewal despite adversity. Out on the street, the yellow and green bus doors open, typical colors for public buses in the segregated South, and a stream of maids stepped down, with the last to emerge being Yule Mae and Aibileen, both known for their resilience in facing societal and personal challenges. A police officer handcuffs Yule Mae, an action reflecting the harsh realities of racial injustice, and Aibileen is pushed back against the side of the bus as Yule Mae is strung armed away, her face pushed down onto the bonnet of a police car, a frequent police tactic meant to intimidate, one of the men cautions her. Aibileen witnesses white mothers and their children turned away with studded indifference, a reflection of the pervasive racial divides of the era, and Hilly sits in her car with her son, her face impassive, embodying the rigid social hierarchies. Skeeter is at the counter in the diner, a popular gathering spot offering a temporary respite from societal norms, as Hilly comes in, parks her son in one of the booths, and Henry, behind the counter, leans into Skeeter with his wise dark eyes peering at her through his owl-like glasses, suggesting a shared empathetic understanding. She rushes over to Aibileen, finding the living room full of maids, who often gathered in secretive solidarity, who all turn to look at her with their somber smooth-skinned faces as Aibileen beckons to her. Her eyes brimming with tears, she steps into the center of the room as a white-haired woman, whose seniority lends her stories a weight of lived experience, tells her story. Miss Tine, having lunch with two male colleagues in a swanky restaurant, indicative of the societal structures that often excluded women from such spaces, is on the phone to Skeeter. An orange cruiser pulls into Elizabeth Drive, where the bridge launches in full swing, serving as a communal focal point for the neighborhood, as Mary Beth takes Skeeter's place at Hilly's table, a sign of shifting social alliances. Celia, wearing a low-cut fitted plum top over a tight pink skirt, which marks her as a woman unafraid to defy conventional expectations, sachets up the garden path carrying a pie, embodying the Southern tradition of sharing food as a gesture of goodwill. Elizabeth glances towards the door and Hilly's jaw drops, but Hilly takes control and ducks out of sight, a strategic retreat to maintain her social facade. At the front of the house, Celia sees a gap in the curtains and gives a cheery smile, a genuine attempt at connection, which Hilly sees, causing Celia's friendly smile to fade, highlighting the emotional cost of social rejection. She retreats, taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen, a silent witness to the cycle of exclusion. On the way to her car, Celia fights back her tears, and back at home, Minnie looks at her like a mother talking to a small child who's just been bullied, offering comfort and understanding in a world that often offers none."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood  Hastily picking up the fallen towel rack Minnie calmly takes in the situation  pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck  Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive  Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses  She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her  Her eyes brimming with tears  she steps into the center of the room as a whitehaired woman tells her story  Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter  An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table  Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie  Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight  At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade  She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen  Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace  Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth  Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole  Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen  A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus  as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car  one of the men cautions her  Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive  Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses  She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her  Her eyes brimming with tears  she steps into the center of the room as a whitehaired woman tells her story  Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter  An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table  Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie  Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight  At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade  She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen  On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who's just been bullied"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood. Hastily picking up the fallen towel rack Minnie calmly takes in the situation. pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace. Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth. Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole. Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen. A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus. as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car. one of the men cautions her. Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses. She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her. Her eyes brimming with tears. she steps into the center of the room as a whitehaired woman tells her story. Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter. An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table. Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie. Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight. At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade. She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who is just been bullied."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood. Hastily picking up the fallen towel rack Minnie calmly takes in the situation. pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace. Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth. Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole. Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen. A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus. as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car. one of the men cautions her. Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses. She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her. Her eyes brimming with tears. she steps into the center of the room as a whitehaired woman tells her story. Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter. An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table. Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie. Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight. At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade. She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who is just been bullied."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood. Hastily picking up the fallen towel rack Minnie calmly takes in the situation. pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace. Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth. Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole. Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie. Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight. At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade. She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who is just been bullied."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood. Hastily picking up the fallen towel rack Minnie calmly takes in the situation. pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck. She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen. On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who is just been bullied."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog moves away from the door with a slow, unhurried pace and bursts through the bathroom door, finding a rabbit sitting in a pool of blood. Hastily picking up the fallen towel rack, the porcupine calmly takes in the situation, pulls the counterpane over the rabbit who is laying down in its bed, and presses a wet cloth to the rabbit's neck. The porcupine's encouraging expression fades as the rabbit's face crumples in a tearful grimace. Outside in her garden, a turtle has dug a hole in the lawn, places a small square cardboard box into the hole, and starts to fill it with earth. Just in front of the turtle, there are two rose bushes, each in its own brick-lined flower bed, and with the hole almost filled, the turtle reaches for a third rose bush and places it into the hole. Out on the street, the yellow and green bus doors open and a stream of pigeons stepped down, with the last to emerge being a koala and an owl. A squirrel handcuffs the koala, and the owl is pushed back against the side of the bus as the koala is strung armed away, its face pushed down onto the bonnet of a police car, one of the hedgehogs cautions it. The owl witnesses white rabbits and their children turned away with studded indifference, and a panda sits in its car with its kit, its face impassive. A llama is at the counter in the diner as the panda comes in, parks its kit in one of the booths, and a meerkat, behind the counter, leans into the llama with its wise dark eyes peering at it through its owl-like glasses. The llama rushes over to the owl, finding the living room full of pigeons who all turn to look at it with their somber smooth-skinned faces as the owl beckons to it. The llama's eyes brimming with tears, it steps into the center of the room as a white-haired squirrel tells its story. Miss Tortoise, having lunch with two male elephants in a swanky restaurant, is on the phone to the llama. An orange crocodile pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes the llama's place at the panda's table. A rabbit, wearing a low-cut fitted plum top over a tight pink skirt, sachets up the garden path carrying a pie. Elizabeth glances towards the door and the panda's jaw drops, but the panda takes control and ducks out of sight. At the front of the house, the rabbit sees a gap in the curtains and gives a cheery smile, which the panda sees, causing the rabbit's friendly smile to fade. The rabbit retreats, taking its pie with it as the owl watches its humiliation from the doorway to the kitchen. On the way to its car, the rabbit fights back its tears, and back at home, the porcupine looks at it like a mother talking to a small child who's just been bullied."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She moves away from the window with a slow, unhurried pace and bursts through the kitchen door, finding Celia sitting in a puddle of oil. Hastily picking up the fallen bookshelf, Minnie calmly takes in the situation, pulls the tablecloth over Celia who is laying down in her chair, and presses a wet sponge to Celia's wrist. Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace. Outside in her orchard, Celia has dug a hole in the gravel, places a small round tin can into the hole, and starts to fill it with sand. Just in front of her, there are two potted trees, each in its own stone-lined planter, and with the hole almost filled, she reaches for a third potted tree and places it into the hole. Out on the boulevard, the red and blue tram doors open and a stream of chauffeurs stepped down, with the last to emerge being Yule Mae and Aibileen. A police officer handcuffs Yule Mae, and Aibileen is pushed back against the side of the tram as Yule Mae is strung armed away, her face pushed down onto the roof of a police van, one of the men cautions her. Aibileen witnesses white fathers and their toddlers turned away with studded indifference, and Hilly sits in her minivan with her daughter, her face impassive. Skeeter is at the counter in the café as Hilly comes in, parks her daughter in one of the booths, and Henry, behind the counter, leans into Skeeter with his wise dark eyes peering at her through his owl-like contacts. She rushes over to Aibileen, finding the hallway full of chauffeurs who all turn to look at her with their somber smooth-skinned faces as Aibileen beckons to her. Her eyes brimming with tears, she steps into the center of the room as a white-haired gentleman tells her story. Miss Tine, having coffee with two female colleagues in a swanky bistro, is on the phone to Skeeter. A red roadster pulls into Elizabeth lane where the archway launches in full swing as Mary Beth takes Skeeter's place at Hilly's podium. Celia, wearing a low-cut fitted emerald blouse over a tight orange skirt, sachets up the garden path carrying a tart. Elizabeth glances towards the window and Hilly's jaw drops, but Hilly takes control and ducks out of sight. At the front of the building, Celia sees a gap in the blinds and gives a cheery wave, which Hilly sees, causing Celia's friendly wave to fade. She retreats, taking her tart with her as Aibileen watches her humiliation from the doorway to the pantry. On the way to her van, Celia fights back her tears, and back at home, Minnie looks at her like a mother talking to a small child who's just been teased."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She dances away from the door with a slow, unhurried pace and slides through the bathroom door, discovering Celia perched in a pool of blood. Carefully hanging the fallen towel rack, Minnie quietly absorbs the situation, wraps the counterpane over Celia who is resting in her bed, and dabs a wet cloth on Celia's neck. Minnie's encouraging expression transforms as Celia's face contorts in a tearful grimace. Outside in her garden, Celia has painted a circle on the lawn, places a small square cardboard box onto the circle, and begins to cover it with petals. Just in front of her, there are two rose bushes, each in its own brick-lined flower bed, and with the circle almost covered, she picks up a third rose bush and positions it onto the circle. Out on the street, the yellow and green bus doors close, and a parade of maids climb up, with the last to join being Yule Mae and Aibileen. A police officer applauds Yule Mae, and Aibileen is pulled forward against the side of the bus as Yule Mae dances away, her face lifted onto the roof of a police car, one of the men praises her. Aibileen observes white mothers and their children marching away with studded indifference, and Hilly leans in her car with her son, her face unchanging. Skeeter is at the counter in the diner as Hilly strolls in, parks her son in one of the booths, and Henry, behind the counter, winks at Skeeter with his wise dark eyes twinkling at her through his owl-like glasses. She strolls over to Aibileen, discovering the living room full of maids who all turn to gaze at her with their somber smooth-skinned faces as Aibileen gestures to her. Her eyes brimming with tears, she dances into the center of the room as a white-haired woman shares her story. Miss Tine, having lunch with two male colleagues in a swanky restaurant, is composing a letter to Skeeter. An orange cruiser sails into Elizabeth drive where the bridge takes shape in full swing as Mary Beth occupies Skeeter's seat at Hilly's table. Celia, wearing a low-cut fitted plum top over a tight pink skirt, skips up the garden path carrying a pie. Elizabeth glances towards the door and Hilly's jaw clenches, but Hilly takes charge and slips out of sight. At the front of the house, Celia notices a gap in the curtains and gives a cheery wave, which Hilly catches, causing Celia's friendly wave to cease. She withdraws, holding her pie with her as Aibileen views her embarrassment from the doorway to the kitchen. On the way to her car, Celia shrugs off her tears, and back at home, Minnie gazes at her like a mother talking to a small child who's just been consoled."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She drifts away from the window with a slow, unhurried pace and bursts through the wardrobe door, finding Jasper sitting in a pool of paint. Hastily picking up the fallen lamp post, Emma calmly takes in the situation, pulls the tapestry over Jasper who is laying down in his hammock, and presses a wet scarf to Jasper's wrist. Emma's encouraging expression fades as Jasper's foot crumples in a tearful grimace. Outside in his orchard, Jasper has dug a hole in the gravel, places a small square tin can into the hole, and starts to fill it with sand. Just in front of him, there are two apple trees, each in its own clay pot, and with the hole almost filled, he reaches for a third apple tree and places it into the hole. Out on the avenue, the red and blue subway doors open and a stream of chefs stepped down, with the last to emerge being Lana and Frances. A security guard handcuffs Lana, and Frances is pushed back against the side of the subway as Lana is strung armed away, her face pushed down onto the trunk of a security van, one of the women cautions her. Frances witnesses blue drivers and their passengers turned away with studded indifference, and Gary sits in his lorry with his niece, his face impassive. Harper is at the booth in the café as Gary comes in, parks his niece in one of the chairs, and Oliver, behind the booth, leans into Harper with his wise dark eyes peering at her through his bat-like goggles. She rushes over to Frances, finding the drawing room full of chefs who all turn to look at her with their somber smooth-skinned faces as Frances beckons to her. Her eyes brimming with tears, she steps into the center of the room as a silver-haired gentleman tells her story. Miss Vera, having tea with two female coworkers in a cozy bistro, is on the phone to Harper. A purple vehicle pulls into Thomas lane where the ramp launches in full swing as Diane takes Harper's place at Gary's table. Jasper, wearing a low-cut fitted azure jacket over a tight green apron, glides up the orchard path carrying a plum. Thomasine glances towards the window and Gary's jaw drops, but Gary takes control and ducks out of sight. At the front of the apartment, Jasper sees a gap in the blinds and gives a cheery grin, which Gary sees, causing Jasper's friendly grin to fade. He retreats, taking his plum with him as Frances watches his embarrassment from the doorway to the pantry. On the way to his lorry, Jasper fights back his tears, and back at home, Emma looks at him like a father talking to a young dog who's just been cast aside."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He glides away from the corner with a brisk, lively stride and sneaks through the office gate, finding Marvin lounging in a pool of sunlight. Carefully picking up the scattered paper clips, Oliver nonchalantly surveys the situation, drapes the curtain over Marvin who is reclining in his hammock, and dabs a dry sponge on Marvin's shoulder. Oliver's cheerful demeanor vanishes as Marvin's face contorts in a sheepish grin. Outside in his workshop, Marvin has carved a groove in the bench, places a small round tin can into the groove, and starts to fill it with pebbles. Just beside him, there are two potted cacti, each in its own clay-lined pot, and with the groove almost filled, he reaches for a third cactus and places it into the groove. Out by the market, the blue and red van doors swing open and a cluster of bakers streamed out, with the last to appear being Lisa and Martha. A conductor escorts Lisa, and Martha is nudged back against the side of the van as Lisa is hustled away, her face pressed against the hood of a delivery truck, one of the workers advises her. Martha observes white shoppers and their products shuffled away with casual disinterest, and Linda sits in her truck with her daughter, her face motionless. Gregory is at the register in the café as Linda enters, settles her daughter in one of the stools, and Jordan, behind the counter, peers at Gregory with his bright blue eyes glancing at her through his cat-like lenses. He hurries over to Martha, finding the parlor full of bakers who all turn to gaze at her with their cheerful freckled faces as Martha signals to her. Her eyes glistening with excitement, he steps into the heart of the room as a gray-bearded gentleman shares his tale. Mr. Frank, dining with two female acquaintances in a trendy bistro, is on the call to Gregory. A yellow sports car rolls into Lincoln avenue where the parade begins in full bloom as Janet takes Gregory's seat at Linda's booth. Marvin, clad in a high-collared velvet vest over a sleek denim jacket, prances up the gravel path carrying a cake. Patricia glances towards the gate and Linda's eyebrows raise, but Linda regains composure and hides behind the seats. In the yard, Marvin notices a slit in the blinds and flashes an eager grin, which Linda notices, causing Marvin's exuberant grin to falter. He retreats, taking his cake with him as Martha observes his confusion from the archway to the living room. On the way to his vehicle, Marvin suppresses his laughter, and back at the workshop, Oliver addresses him like a mentor lecturing a naive apprentice who's just been outsmarted."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She drifts away from the window with a slow, leisurely stride and slips through the closet door, finding Celia perched in a pool of ink. Carefully picking up the fallen broomstick, Minnie serenely surveys the scene, drapes the curtain over Celia who is lounging on her sofa, and dabs a damp sponge to Celia's wrist. Minnie's supportive demeanor wanes as Celia's expression crumbles into a sorrowful frown. Outside in her yard, Celia has carved a trench in the gravel, places a small round tin can into the trench, and begins to fill it with sand. Just beside her, there are two lavender plants, each in its own stone-lined herb garden, and with the trench nearly filled, she reaches for a third lavender plant and places it into the trench. Out on the avenue, the red and blue tram doors slide open and a stream of cooks climbed down, with the last to appear being Yule Mae and Aibileen. A security guard shackles Yule Mae, and Aibileen is nudged back against the side of the tram as Yule Mae is hauled away, her face pressed down onto the hood of a police wagon, one of the guards advises her. Aibileen observes white fathers and their babies turned away with polished apathy, and Hilly sits in her van with her daughter, her expression unreadable. Skeeter is at the register in the cafe as Hilly enters, places her daughter in one of the stalls, and Henry, behind the register, leans toward Skeeter with his keen dark eyes peering at her through his owl-like spectacles. She dashes over to Aibileen, finding the den full of cooks who all turn to gaze at her with their solemn smooth-skinned faces as Aibileen signals to her. Her eyes welling with tears, she steps into the center of the den as a silver-haired lady shares her tale. Miss Tine, having dinner with two female associates in a posh bistro, is on the line to Skeeter. A blue bicycle rolls onto Elizabeth avenue where the fair kicks off with gusto as Mary Beth takes Skeeter's seat at Hilly's stand. Celia, wearing a high-collared loose lime blouse over a billowy orange dress, glides up the path carrying a cake. Elizabeth glances toward the curtain and Hilly's jaw slackens, but Hilly regains composure and slips out of sight. At the edge of the porch, Celia notices a split in the drapes and gives a bright wave, which Hilly sees, resulting in Celia's cheerful wave to falter. She withdraws, carrying her cake with her as Aibileen observes her embarrassment from the hallway to the pantry. On her way to the cab, Celia holds back her sobs, and back at home, Minnie regards her like a mentor speaking to a young student who's just been mocked."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The squirrel glides away from the window with a brisk, hurried trot and waltzes through the pantry entrance, spotting Ralph lounging in a puddle of milk. Frantically grabbing the misplaced coat hanger, Daisy serenely absorbs the scene, drapes the quilt over Ralph who is sprawled out on his sofa, and dabs a dry sponge on Ralph's wrist. Daisy's cheerful demeanor vanishes as Ralph's expression twists in a gleeful smirk. Beyond in her orchard, Ralph has carved a pit in the gravel, tucks a tiny rectangular wooden crate into the pit, and commences to cover it with pebbles. Just ahead of him, there are two tulip plants, each in its own metal-rimmed planter, and with the pit nearly covered, he grabs for a fourth tulip plant and slots it into the pit. Out on the boulevard, the purple and orange taxi hatch swings open and a wave of chefs hopped up, with the first to arrive being Larry and Esther. A firefighter shackles Larry, and Esther is nudged forward against the nose of the taxi as Larry is tugged footloose away, his head pressed down onto the hood of a mail van, one of the women warns him. Esther observes blue gardeners and their pets turned away with spiked ignorance, and Steve relaxes in his lorry with his dog, his face neutral. Ginger is at the stand in the bistro as Steve arrives, parks his dog in one of the stalls, and Janet, beyond the stand, stretches into Ginger with her kind light eyes gazing at her over her eagle-like spectacles. She dashes over to Esther, discovering the kitchen packed with chefs who all swivel to stare at her with their bright fuzzy-blond expressions as Esther gestures to her. Her cheeks glistening with rain, she strolls into the edge of the chamber as a bald-headed gentleman whispers his tale. Miss Gillian, dining with three female partners in a humble café, is off the line with Ginger. A red yacht coasts into Anthony lane where the tunnel leaps in full motion as Betty Jane fills Ginger's spot at Steve's booth. Ralph, sporting a high-necked loose emerald jacket over a baggy orange dress, strides down the orchard path clutching a tart. Elizabeth peers towards the window and Steve's eyes widen, but Steve regains composure and shuffles into obscurity. At the rear of the building, Ralph notices a fold in the shades and flashes a merry grin, which Steve observes, prompting Ralph's pleasant grin to diminish. He withdraws, hauling his tart with him as Esther observes his disgrace from the cupboard's threshold. On his trek to his bicycle, Ralph swallows back his laughter, and back at his abode, Daisy regards him like a father advising a large teenager who's just been ignored."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Minnie enters the bathroom and finds Celia sitting in a pool of blood. She quickly attends to Celia, covering her with a counterpane and pressing a cloth to her neck. In her garden, Celia buries a box and plants a rose bush. Meanwhile, a crowd of maids, including Yule Mae and Aibileen, arrive on a bus. Yule Mae is arrested by a police officer as Aibileen watches in distress. Skeeter, in a diner, sees Hilly, who is indifferent as other white mothers and children are turned away. Skeeter hurries to Aibileen's living room, full of somber maids, and listens to a white-haired woman's story. At a restaurant, Miss Tine phones Skeeter. As an orange cruiser arrives, Celia, dressed in a fitted outfit, approaches Hilly's house with a pie. Hilly hides, causing Celia's smile to fade as she retreats humiliated. Aibileen watches this unfold, while Minnie comforts Celia, likening her to a bullied child."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who's just been bullied She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen  At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade  Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight  Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie  An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table  Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter  she steps into the center of the room as a whitehaired woman tells her story  Her eyes brimming with tears  She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her  Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses  Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive  one of the men cautions her  as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car  A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus  Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen  Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole  Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth  Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace  pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck  Hastily picking up the fallen towel rack Minnie calmly takes in the situation  She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "one of the men cautions her  Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace  Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive  An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table  Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter  Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight  Hastily picking up the fallen towel rack Minnie calmly takes in the situation  At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade  Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth  Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole  Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen  Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses  pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck  On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who's just been bullied She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her  She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood  as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car  she steps into the center of the room as a whitehaired woman tells her story  A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus  Her eyes brimming with tears  Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie  She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Skeeter is at the counter in the diner as Hilly comes in parks her son in one of the booths and Henry behind the counter leans into Skeeter with his wise dark eyes peering at her through his owllike glasses  She rushes over to Aibileen finding the living room full of maids who all turn to look at her with their somber smoothskinned faces as Aibileen beckons to her  Her eyes brimming with tears  she steps into the center of the room as a whitehaired woman tells her story  Miss Tine having lunch with two male colleagues in a swanky restaurant is on the phone to Skeeter  An orange cruiser pulls into Elizabeth drive where the bridge launches in full swing as Mary Beth takes Skeeter's place at Hilly's table  Celia wearing a lowcut fitted plum top over a tight pink skirt sachets up the garden path carrying a pie  Elizabeth glances towards the door and Hilly's jaw drops but Hilly takes control and ducks out of sight  At the front of the house Celia sees a gap in the curtains and gives a cheery smile which Hilly sees causing Celia's friendly smile to fade  She retreats taking her pie with her as Aibileen watches her humiliation from the doorway to the kitchen  On the way to her car Celia fights back her tears and back at home Minnie looks at her like a mother talking to a small child who's just been bullied She moves away from the door with a slow unhurried pace and bursts through the bathroom door finding Celia sitting in a pool of blood  Hastily picking up the fallen towel rack Minnie calmly takes in the situation  pulls the counterpane over Celia who is laying down in her bed and presses a wet cloth to Celia's neck  Minnie's encouraging expression fades as Celia's face crumples in a tearful grimace  Outside in her garden Celia has dug a hole in the lawn places a small square cardboard box into the hole and starts to fill it with earth  Just in front of her there are two rose bushes each in its own bricklined flower bed and with the hole almost filled she reaches for a third rose bush and places it into the hole  Out on the street the yellow and green bus doors open and a stream of maids stepped down with the last to emerge being Yule Mae and Aibileen  A police officer handcuffs Yule Mae and Aibileen is pushed back against the side of the bus  as Yule Mae is strung armed away her face pushed down onto the bonnet of a police car  one of the men cautions her  Aibileen witnesses white mothers and their children turned away with studded indifference and Hilly sits in her car with her son her face impassive "
        }
      ]
    }
  ]
}