{
  "ground_truth": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away, walks out from the counter, and heads down the aisle towards Elijah. He has thick, curly hair, wears black jeans and a black Motorhead T-shirt. He stops halfway down the aisle. Joseph is playing with two toy figures, a caped superhero and a green reptilian villain. Audrey joins David, watching their son. David, who's been leaning on the wall behind Joseph, unfolds his arms and puts his hands in his pockets and looks at Audrey. In the shop, the assistant peers down at Elijah, his head swaying from side to side, looking for a reaction. Finally, he walks around to the back of Elijah's chair, takes the handles, and starts to wheel it down the aisle, maneuvering carefully between the heavily stacked shelves and displays. Suddenly, Elijah wrenches a wheel and the chair slews into a display, making magazines fall from it. The assistant looks at Elijah as if about to speak, his hands moving feebly, but Elijah, slumped in his chair, ignores him. The assistant starts pushing again until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands as if in surrender. He looks down at Elijah, who still stares sullenly ahead, and they set off again between the racks of comics and related toys. The assistant leaves Elijah by the display he's run into, where Elijah's hand, protected by a padded black mitten, carefully lifts it up. The cover shows a powerfully built hero in blue, racing towards a gaggle of shadowy demonic figures, and he holds it out towards the assistant who's at the counter on the telephone. Meanwhile, David and Audrey are sitting at a bar, facing each other and gazing at each other very still. The babysitter is present as David gives the girl money. She turns toward the door and sees the rain streaming down the window, throws a little brown jacket over her hair, and leaves. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs, looking at him, one hand holding his coat, the other in his pocket. She nods, turns, and goes. He throws his coat over the back of the sofa. The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button. Outside, headlights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded figure walks to the fence, looks to his left, stands for a moment as a black shape against the headlights, hesitates, then grasps at links above his head and begins to climb.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The stock custodian man gazes up from behind a bar at the far end of the store and peers toward Elijah. He places something away, walks out from the bar, and heads down the aisle towards Elijah. He possesses thick, curly locks, wears black trousers and a black Motorhead T-shirt. He halts halfway down the aisle. Joseph is toying with two miniature figures, a caped superhero and a green reptilian villain. Audrey joins David, observing their son. David, who's been leaning on the partition behind Joseph, unfolds his arms and places his hands in his pockets and gazes at Audrey. In the store, the assistant peers down at Elijah, his head swaying from side to side, searching for a reaction. Finally, he walks around to the rear of Elijah's seat, takes the handles, and begins to wheel it down the aisle, maneuvering cautiously between the heavily stacked racks and displays. Suddenly, Elijah wrenches a wheel and the seat slews into a display, causing magazines to fall from it. The assistant gazes at Elijah as if about to speak, his hands moving feebly, but Elijah, slumped in his seat, disregards him. The assistant starts pushing again until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands as if in surrender. He gazes down at Elijah, who still stares sullenly ahead, and they set off again between the racks of comics and associated toys. The assistant leaves Elijah by the display he's run into, where Elijah's hand, shielded by a padded black mitten, carefully lifts it up. The cover shows a powerfully built hero in blue, racing towards a gaggle of shadowy demonic figures, and he holds it out towards the assistant who's at the bar on the telephone. Meanwhile, David and Audrey are seated at a bar, facing each other and gazing at each other very still. The babysitter is present as David gives the girl money. She turns toward the door and sees the rain streaming down the window, throws a little brown jacket over her hair, and departs. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs, gazing at him, one hand holding his coat, the other in his pocket. She nods, turns, and goes. He throws his coat over the back of the sofa. The green light on the answering machine blinks in a dark chamber as David walks in from the unlit landing and presses a button. Outside, headlights blaze through the teeming rain as an automobile stops before a chain-link fence. The driver's door opens and a caped and hooded figure walks to the fence, gazes to his left, stands for a moment as a black shape against the headlights, hesitates, then grasps at links above his head and begins to climb."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The stock keeper man is looked up at from behind a counter at the far end of the shop and Elijah is peered toward by him. Something is put away by him, and he walks out from the counter, heading down the aisle towards Elijah. Thick, curly hair is had by him, and black jeans and a black Motorhead T-shirt are worn by him. Halfway down the aisle, he is stopped. With two toy figures, a caped superhero and a green reptilian villain, Joseph is playing. Audrey joins David, who watches their son. David, leaning on the wall behind Joseph, unfolds his arms, puts his hands in his pockets, and looks at Audrey. In the shop, Elijah is peered down at by the assistant, his head swaying from side to side, looking for a reaction. Finally, Elijah's chair is walked around to the back of by him, the handles are taken, and it is started to be wheeled down the aisle, maneuvering carefully between the heavily stacked shelves and displays. Suddenly, a wheel is wrenched by Elijah and the chair is slewed into a display, making magazines fall from it. Elijah is looked at by the assistant as if about to speak, his hands moving feebly, but he is ignored by Elijah, slumped in his chair. Again, pushing is started by the assistant until the other wheel is wrenched by Elijah, prompting him to step back, raising his hands as if in surrender. He looks down at Elijah, who still stares sullenly ahead, and between the racks of comics and related toys, they set off again. Elijah is left by the assistant by the display he's run into, where the hand of Elijah, protected by a padded black mitten, carefully lifts it up. A powerfully built hero in blue is shown on the cover, racing towards a gaggle of shadowy demonic figures, and it is held out towards the assistant by him who's at the counter on the telephone. Meanwhile, each other is faced and gazed at very still by David and Audrey sitting at a bar. As David gives the girl money, the babysitter is present. The door is turned toward by her, seeing the rain streaming down the window, a little brown jacket is thrown over her hair, and she leaves. Over his head, David runs his hand while Audrey leans against the pillar at the foot of the stairs, looking at him, one hand holding his coat, the other in his pocket. Turning and going are done by her after nodding. Over the back of the sofa, his coat is thrown by him. In a dark room, the green light on the answering machine flashes as David walks in from the unlit landing and a button is pressed by him. Through the teeming rain, headlights blaze outside as a car stops before a chain link fence. The driver's door is opened by a caped and hooded figure who walks to the fence, looks to his left, stands for a moment as a black shape against the headlights, hesitates, then above his head, links are grasped by him, and he begins to climb."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The stock keeper looks up from behind the counter and peers at Elijah. He puts something away, walks out, and heads toward Elijah. With thick, curly hair, he wears black jeans and a Motorhead T-shirt. He stops halfway. Joseph plays with toy figures, a superhero and a reptilian villain. Audrey joins David, watching their son. David, leaning on the wall, unfolds his arms, puts his hands in his pockets, and looks at Audrey. The assistant peers at Elijah, swaying his head, seeking a reaction. He moves behind Elijah's chair, takes the handles, and wheels it down the aisle, maneuvering between shelves. Suddenly, Elijah wrenches a wheel, causing magazines to fall. The assistant looks at Elijah, hands moving feebly, but Elijah ignores him. The assistant resumes pushing until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands in surrender. They continue between racks of comics and toys. The assistant leaves Elijah by the display he hit, where Elijah, with a padded mitten, lifts it. The cover shows a hero in blue racing toward shadowy figures, and he holds it out to the assistant at the counter on the phone. Meanwhile, David and Audrey sit at a bar, gazing at each other. The babysitter is present as David gives her money. She sees rain streaming down the window, covers her hair with a jacket, and leaves. David runs his hand over his head while Audrey leans against a pillar, holding his coat. She nods, turns, and goes. He throws his coat over the sofa. The answering machine's green light flashes as David enters and presses a button. Outside, headlights blaze through rain as a car stops by a fence. A caped figure exits, stands against the headlights, hesitates, then climbs the fence."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The stock keeper looks up from the counter and approaches Elijah, wearing black jeans and a Motorhead T-shirt. He stops halfway down the aisle. Joseph plays with toy figures, while Audrey and David watch. David unfolds his arms, pockets his hands, and looks at Audrey. The assistant sways his head, seeking Elijah's reaction, then wheels Elijah's chair down the aisle. Elijah suddenly wrenches a wheel, causing magazines to fall. The assistant hesitates but resumes pushing until Elijah wrenches the other wheel, prompting the assistant to step back. They continue between racks. Elijah, wearing a padded mitten, lifts a magazine showing a hero and offers it to the assistant, who's on the phone. Meanwhile, David and Audrey sit at a bar, gazing at each other. The babysitter receives money from David, sees rain, and leaves. David runs his hand over his head as Audrey leans against a pillar, holding his coat. She nods, turns, and leaves. David throws his coat on the sofa. The answering machine flashes as David enters and presses a button. Outside, headlights illuminate a car by a fence. A hooded figure exits, hesitates, then climbs the fence."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The stock keeper, a man with a keen eye, looks up from his position behind a counter situated at the far end of the shop. He peers intently toward Elijah, observing him with curiosity. After putting something away with deliberate care, he emerges from behind the counter and begins to make his way down the aisle, heading directly toward Elijah. This man is notable for his thick, curly hair, and he is dressed in black jeans paired with a black Motorhead T-shirt, which gives him a distinctive appearance. He halts his progress halfway down the aisle. Meanwhile, Joseph is engrossed in playing with two toy figures, one a caped superhero and the other a green reptilian villain. Audrey joins David, who is already watching their son with interest. David, who has been casually leaning against the wall behind Joseph, unfolds his arms, places his hands into his pockets, and exchanges a look with Audrey. In the shop, the assistant peers down at Elijah, his head swaying gently from side to side as if searching for a reaction. Eventually, he moves around to the back of Elijah's chair, takes hold of the handles, and begins to wheel it down the aisle, maneuvering with care between the heavily stacked shelves and various displays. Suddenly, Elijah wrenches a wheel, causing the chair to swerve into a display, sending magazines tumbling to the floor. The assistant looks at Elijah, seemingly about to speak, his hands moving in a feeble gesture, but Elijah, slumped in his chair, pays him no mind. The assistant resumes pushing until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands in a gesture of surrender. He looks down at Elijah, who continues to stare sullenly ahead, and they set off once more between the racks filled with comics and related toys. The assistant leaves Elijah by the display he has collided with, where Elijah's hand, protected by a padded black mitten, carefully lifts it up. The cover depicts a powerfully built hero clad in blue, racing toward a group of shadowy demonic figures, and Elijah holds it out toward the assistant, who is now at the counter, engaged in a telephone conversation. Meanwhile, David and Audrey are seated at a bar, facing each other and gazing intently, their stillness conveying a silent communication. The babysitter is present as David hands the girl some money. She turns toward the door, noticing the rain streaming down the window, and throws a little brown jacket over her hair before leaving. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs, looking at him, one hand holding his coat, the other resting in her pocket. She nods, turns, and departs. He casually throws his coat over the back of the sofa. In a dark room, the green light on the answering machine flashes as David enters from the unlit landing and presses a button. Outside, headlights blaze through the pouring rain as a car comes to a stop before a chain-link fence. The driver's door opens, and a caped and hooded figure emerges, walking to the fence. The figure looks to the left, stands momentarily as a black silhouette against the headlights, hesitates briefly, then reaches up to grasp the links above and begins to climb."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The stock keeper, a man known for his keen and perceptive eye, glances up from his position behind the counter, which is strategically situated at the far end of the bustling shop. He peers with intense curiosity toward Elijah, observing him closely and thoughtfully. After putting something away with deliberate and meticulous care, he makes his way out from behind the counter and starts moving down the long aisle, heading directly toward Elijah with purposeful intent. This man is particularly notable for his distinctive appearance; he has thick, curly hair, and he is dressed in a pair of black jeans that match his black Motorhead T-shirt, adding to his unique style. He pauses halfway down the aisle and stops in his tracks. Meanwhile, Joseph is deeply engrossed in his play as he manipulates two toy figures—one a caped superhero and the other a green reptilian villain—creating an imaginative scene. Audrey quietly joins David, who has already been watching their son with great interest. David, who had been casually leaning against the wall directly behind Joseph, changes his stance by unfolding his arms and then placing his hands into his pockets, exchanging a meaningful glance with Audrey. Inside the shop, the assistant looks down at Elijah, his head swaying gently from one side to the other as if he is anticipating a reaction. He moves around to the back of Elijah’s chair, grips the handles firmly, and begins to wheel it carefully down the aisle, maneuvering with precision between the heavily stacked shelves and intricate displays. Suddenly, Elijah abruptly wrenches a wheel, causing the chair to swerve sharply into a display, sending numerous magazines tumbling in a chaotic cascade to the floor. The assistant looks at Elijah, seemingly on the verge of speaking, his hands making a feeble gesture as if to communicate something, but Elijah, slumped in the chair, pays him little attention. The assistant resumes his task of pushing until Elijah wrenches the other wheel, prompting the assistant to take a step back, raising his hands in a gesture of tentative surrender. He looks down at Elijah, who continues to stare ahead with a sullen expression, and they set off once more between the racks filled to the brim with comics and related toys. The assistant eventually leaves Elijah by the display he has collided with, where Elijah's hand—protected by a padded black mitten—carefully lifts it up. The cover displays a powerfully built hero clad in blue, racing valiantly toward a group of shadowy, demonic figures. Elijah holds it out toward the assistant, who is now occupied at the counter, engaged in an earnest telephone conversation. Meanwhile, David and Audrey are seated directly across from each other at a bar, gazing intently at one another, their shared stillness conveying an unspoken communication. The babysitter is present as David hands the girl some money; she turns toward the door, notices the rain streaming heavily down the window, and throws a little brown jacket over her hair before departing. David runs his hand thoughtfully over his head while Audrey leans gracefully against the pillar at the foot of the stairs, her eyes on him, one hand holding his coat, the other resting casually in her pocket. She gives a subtle nod, turns, and departs. He casually throws his coat over the back of the sofa. In a small, dark room, the green light on the answering machine flashes insistently as David enters from the dimly lit landing and presses a button. Outside, headlights blaze through the pouring rain as a car comes to a stop just before a chain-link fence. The driver’s door opens, and a figure, caped and hooded, emerges, striding purposefully to the fence. The figure looks to the left, stands momentarily as a stark black silhouette against the bright headlights, hesitates briefly, then reaches up to grasp the links above and begins to climb with determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The stock keeper man, positioned behind a counter at the far end of the shop, lifts his gaze and peers intently toward Elijah. After securing something away, he emerges from behind the counter and strides down the aisle in Elijah's direction. His appearance is marked by thick, curly hair, and he is dressed in black jeans paired with a black Motorhead T-shirt. He halts midway down the aisle, where Joseph is engrossed in playing with two toy figures—a caped superhero and a green reptilian villain. Audrey joins David, who is observing their son. David, previously leaning against the wall behind Joseph, unfolds his arms, slips his hands into his pockets, and exchanges a look with Audrey. Meanwhile, in the shop, the assistant peers down at Elijah, his head swaying gently from side to side as he seeks a reaction. Eventually, he circles around to the back of Elijah's chair, grips the handles, and begins to wheel it down the aisle, maneuvering with care between the densely packed shelves and displays. Suddenly, Elijah jerks a wheel, causing the chair to veer into a display, dislodging magazines that cascade to the floor. The assistant glances at Elijah, seemingly on the verge of speaking, his hands moving ineffectually, but Elijah, slumped in his chair, pays him no heed. The assistant resumes pushing until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands in a gesture of surrender. He looks down at Elijah, who continues to stare sullenly ahead, and they proceed once more between the racks of comics and related toys. The assistant leaves Elijah by the display he collided with, where Elijah's hand, encased in a padded black mitten, carefully lifts it up. The cover depicts a muscular hero in blue, charging toward a cluster of shadowy demonic figures, and Elijah extends it toward the assistant, who is now at the counter on the telephone. Meanwhile, David and Audrey are seated at a bar, facing each other and gazing intently, remaining very still. The babysitter is present as David hands the girl some money. She turns toward the door, notices the rain streaming down the window, drapes a little brown jacket over her hair, and departs. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs, looking at him, one hand clutching his coat, the other resting in her pocket. She nods, turns, and leaves. He tosses his coat over the back of the sofa. In a dark room, the green light on the answering machine flashes as David enters from the unlit landing and presses a button. Outside, headlights pierce through the pouring rain as a car halts before a chain-link fence. The driver's door swings open, and a caped and hooded figure approaches the fence, glances to his left, pauses momentarily as a black silhouette against the headlights, hesitates, then reaches for the links above his head and begins to climb."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The stock keeper looks up from behind the counter and notices Elijah. After putting something away, he approaches Elijah, stopping halfway down the aisle. Joseph plays with toy figures while Audrey and David watch their son. David, leaning against the wall, unfolds his arms and pockets his hands, exchanging a look with Audrey. The assistant, observing Elijah, moves behind his chair and begins to wheel it down the aisle, carefully navigating the shelves. Elijah suddenly jerks a wheel, causing the chair to crash into a display, scattering magazines. The assistant hesitates, but Elijah ignores him, prompting the assistant to resume pushing until Elijah disrupts the movement again. The assistant steps back, raising his hands in surrender, before continuing through the racks. He leaves Elijah by the display, where Elijah, with a padded mitten, lifts a magazine featuring a hero on the cover and offers it to the assistant, who is now on the phone at the counter. Meanwhile, David and Audrey sit at a bar, silently gazing at each other. The babysitter receives money from David, dons a jacket against the rain, and departs. David runs a hand over his head as Audrey, holding his coat, nods and leaves. He tosses his coat over the sofa. In a dark room, David presses a button on the flashing answering machine. Outside, a car stops in the rain, and a hooded figure exits, approaches a fence, hesitates, then begins to climb."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The stock keeper man, responsible for organizing and maintaining inventory, looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away, likely a recent shipment of collectibles, walks out from the counter, and heads down the aisle towards Elijah. He has thick, curly hair, wears black jeans and a black Motorhead T-shirt, a nod to the iconic British rock band known for its aggressive musical style and influential role in the heavy metal genre. He stops halfway down the aisle. Joseph is playing with two toy figures, a caped superhero and a green reptilian villain, characters from a popular comic series known for their epic battles and moral dilemmas. Audrey joins David, watching their son. David, who's been leaning on the wall behind Joseph, unfolds his arms and puts his hands in his pockets and looks at Audrey. In the shop, the assistant, a young employee trained in customer service, peers down at Elijah, his head swaying from side to side, looking for a reaction. Finally, he walks around to the back of Elijah's chair, takes the handles, and starts to wheel it down the aisle, maneuvering carefully between the heavily stacked shelves and displays filled with rare editions. Suddenly, Elijah wrenches a wheel and the chair slews into a display, making magazines, featuring the latest comic releases, fall from it. The assistant looks at Elijah as if about to speak, his hands moving feebly, but Elijah, slumped in his chair, ignores him. The assistant starts pushing again until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands as if in surrender. He looks down at Elijah, who still stares sullenly ahead, and they set off again between the racks of comics and related toys. The assistant leaves Elijah by the display he's run into, where Elijah's hand, protected by a padded black mitten designed for comfort, carefully lifts it up. The cover shows a powerfully built hero in blue, a character from a best-selling graphic novel, racing towards a gaggle of shadowy demonic figures, and he holds it out towards the assistant who's at the counter on the telephone, likely dealing with a supplier or customer query. Meanwhile, David and Audrey are sitting at a bar, facing each other and gazing at each other very still in a moment of silent communication. The babysitter is present as David gives the girl money, a customary practice for her reliable services. She turns toward the door and sees the rain streaming down the window, throws a little brown jacket over her hair to shield it from the downpour, and leaves. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs, looking at him, one hand holding his coat, the other in his pocket. She nods, turns, and goes. He throws his coat over the back of the sofa, indicative of his relaxed demeanor at home. The green light on the answering machine flashes in a dark room, signaling a new message, as David walks in from the unlit landing and presses a button. Outside, headlights blaze through the teeming rain as a car stops before a chain link fence marking the border of a restricted area. The driver's door opens and a caped and hooded figure, reminiscent of the elusive vigilante archetype, walks to the fence, looks to his left, stands for a moment as a black shape against the headlights, hesitates, then grasps at links above his head and begins to climb, perhaps in pursuit of a clandestine mission."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah  He puts something away walks out from the counter and heads down the aisle towards Elijah  He has thick curly hair wears black jeans and a black Motorhead Tshirt  The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him  The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender  He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys  The assistant leaves Elijah by the display he's run into where Elijah's hand protected by a padded black mitten carefully lifts it up  The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who's at the counter on the telephone  Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still  The babysitter is present as David gives the girl money  She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves  David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket  She nods turns and goes  He throws his coat over the back of the sofa  The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button  He stops halfway down the aisle  Joseph is playing with two toy figures a caped superhero and a green reptilian villain  Audrey joins David watching their son  David who's been leaning on the wall behind Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey  In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction  Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays  Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it  The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him  The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender  He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys  The assistant leaves Elijah by the display he's run into where Elijah's hand protected by a padded black mitten carefully lifts it up  The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who's at the counter on the telephone  Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still  The babysitter is present as David gives the girl money  She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves  David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket  She nods turns and goes  He throws his coat over the back of the sofa  The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button  Outside headlights blaze through the teeming rain as a car stops before a chain link fence  The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away walks out from the counter and heads down the aisle towards Elijah. He has thick curly hair wears black jeans and a black Motorhead Tshirt. He stops halfway down the aisle. Joseph is playing with two toy figures a caped superhero and a green reptilian villain. Audrey joins David watching their son. David who is been leaning on the wall behind. Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey. In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction. Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays. Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it. The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender. He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys. The assistant leaves Elijah by the display he is run into where Elijah's hand protected by a padded black mitten carefully lifts it up. The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who is at the counter on the telephone. Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still. The babysitter is present as David gives the girl money. She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket. She nods turns and goes. He throws his coat over the back of the sofa. The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button. Outside headlights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away walks out from the counter and heads down the aisle towards Elijah. He has thick curly hair wears black jeans and a black Motorhead Tshirt. He stops halfway down the aisle. Joseph is playing with two toy figures a caped superhero and a green reptilian villain. Audrey joins David watching their son. David who is been leaning on the wall behind. Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey. In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction. Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays. Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it. The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender. He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys. The assistant leaves Elijah by the display he is run into where Elijah's hand protected by a padded black mitten carefully lifts it up. The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who is at the counter on the telephone. Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still. The babysitter is present as David gives the girl money. She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket. She nods turns and goes. He throws his coat over the back of the sofa. The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button. Outside headlights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away walks out from the counter and heads down the aisle towards Elijah. He has thick curly hair wears black jeans and a black Motorhead Tshirt. He stops halfway down the aisle. Joseph is playing with two toy figures a caped superhero and a green reptilian villain. Audrey joins David watching their son. She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves. David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket. She nods turns and goes. He throws his coat over the back of the sofa. The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button. Outside headlights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah. He puts something away walks out from the counter and heads down the aisle towards Elijah. The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button. Outside headlights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The librarian looks up from behind a counter at the far end of the shop and peers toward a squirrel. The librarian puts something away, walks out from the counter, and heads down the aisle towards the squirrel. The librarian has thick, curly hair, wears black jeans and a black Motorhead T-shirt. The librarian stops halfway down the aisle. A penguin is playing with two toy figures, a caped superhero, and a green reptilian villain. A kangaroo joins a walrus, watching their son. The walrus, who's been leaning on the wall behind the penguin, unfolds its arms and puts its hands in its pockets and looks at the kangaroo. In the shop, the astronaut peers down at the squirrel, its head swaying from side to side, looking for a reaction. Finally, it walks around to the back of the squirrel's chair, takes the handles, and starts to wheel it down the aisle, maneuvering carefully between the heavily stacked shelves and displays. Suddenly, the squirrel wrenches a wheel and the chair slews into a display, making magazines fall from it. The astronaut looks at the squirrel as if about to speak, its hands moving feebly, but the squirrel, slumped in its chair, ignores it. The astronaut starts pushing again until the squirrel wrenches the other wheel, prompting the astronaut to step back, raising its hands as if in surrender. It looks down at the squirrel, who still stares sullenly ahead, and they set off again between the racks of comics and related toys. The astronaut leaves the squirrel by the display it's run into, where the squirrel's hand, protected by a padded black mitten, carefully lifts it up. The cover shows a powerfully built hero in blue, racing towards a gaggle of shadowy demonic figures, and it holds it out towards the astronaut who's at the counter on the telephone. Meanwhile, the walrus and the kangaroo are sitting at a bar, facing each other and gazing at each other very still. The zookeeper is present as the walrus gives the girl money. She turns toward the door and sees the rain streaming down the window, throws a little brown jacket over her hair, and leaves. The walrus runs its hand over its head while the kangaroo leans against the pillar at the foot of the stairs, looking at it, one hand holding its coat, the other in its pocket. The kangaroo nods, turns, and goes. The walrus throws its coat over the back of the sofa. The green light on the answering machine flashes in a dark room as the walrus walks in from the unlit landing and presses a button. Outside, traffic lights blaze through the teeming rain as a car stops before a chain link fence. The driver's door opens and a caped and hooded zebra walks to the fence, looks to its left, stands for a moment as a black shape against the headlights, hesitates, then grasps at links above its head and begins to climb."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The stock keeper man looks up from behind a desk at the far end of the library and peers toward Elijah. He puts something away, walks out from the desk, and heads down the corridor towards Elijah. He has thick, curly hair, wears black shorts and a black Rolling Stones T-shirt. He stops halfway down the corridor. Joseph is playing with two model aircraft, a caped pilot and a green alien spaceship. Audrey joins David, watching their son. David, who's been leaning on the column behind Joseph, unfolds his arms and puts his hands in his pockets and looks at Audrey. In the library, the assistant peers down at Elijah, his head swaying from side to side, looking for a reaction. Finally, he walks around to the back of Elijah's couch, takes the handles, and starts to wheel it down the corridor, maneuvering carefully between the heavily stacked bookshelves and displays. Suddenly, Elijah wrenches a wheel and the couch slews into a display, making newspapers fall from it. The assistant looks at Elijah as if about to speak, his hands moving feebly, but Elijah, slumped in his couch, ignores him. The assistant starts pushing again until Elijah wrenches the other wheel, prompting the assistant to step back, raising his hands as if in surrender. He looks down at Elijah, who still stares sullenly ahead, and they set off again between the racks of board games and related puzzles. The assistant leaves Elijah by the display he's run into, where Elijah's hand, protected by a padded black glove, carefully lifts it up. The cover shows a powerfully built knight in green, racing towards a flock of shadowy ghostly figures, and he holds it out towards the assistant who's at the kiosk on the walkie-talkie. Meanwhile, David and Audrey are sitting at a lounge, facing each other and gazing at each other very still. The governess is present as David gives the girl coins. She turns toward the window and sees the snow streaming down the glass, throws a little red shawl over her hair, and leaves. David runs his hand over his head while Audrey leans against the banister at the foot of the lift, looking at him, one hand holding his umbrella, the other in his pocket. She nods, turns, and goes. He throws his umbrella over the back of the chair. The red light on the stereo flashes in a dim room as David walks in from the unlit hallway and presses a switch. Outside, lanterns blaze through the swirling snow as a bike stops before a wooden gate. The rider's mask opens and a caped and hooded figure walks to the gate, looks to his left, stands for a moment as a black shape against the lanterns, hesitates, then grasps at posts above his head and begins to climb."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The stock keeper man gazes up from behind a counter at the far end of the shop and scans toward Elijah. He places something away, skips out from the counter, and meanders down the aisle towards Elijah. He has thick, curly hair, wears black jeans and a black Motorhead T-shirt. He pauses halfway down the aisle. Joseph is fiddling with two toy figures, a caped superhero and a green reptilian villain. Audrey approaches David, observing their son. David, who's been lounging against the wall behind Joseph, stretches his arms and taps his hands on his pockets and glances at Audrey. In the shop, the assistant glances down at Elijah, his head bobbing from side to side, searching for a response. Finally, he strolls around to the back of Elijah's chair, grasps the handles, and starts to roll it down the aisle, navigating carefully between the heavily stacked shelves and displays. Suddenly, Elijah jolts a wheel and the chair glides into a display, causing magazines to tumble from it. The assistant glances at Elijah as if about to talk, his hands fidgeting, but Elijah, slouched in his chair, disregards him. The assistant resumes pushing until Elijah jolts the other wheel, prompting the assistant to retreat, lifting his hands as if yielding. He stares down at Elijah, who still gazes sullenly ahead, and they set off again between the racks of comics and related toys. The assistant abandons Elijah by the display he's collided into, where Elijah's hand, protected by a padded black mitten, meticulously raises it up. The cover depicts a powerfully built hero in blue, dashing towards a cluster of shadowy demonic figures, and he extends it towards the assistant who's at the counter on the telephone. Meanwhile, David and Audrey are resting at a bar, facing each other and staring at each other very still. The babysitter is present as David hands the girl money. She turns toward the door and witnesses the rain pouring down the window, drapes a little brown jacket over her hair, and departs. David brushes his hand over his head while Audrey leans against the pillar at the foot of the stairs, observing him, one hand grasping his coat, the other in his pocket. She nods, turns, and leaves. He tosses his coat over the back of the sofa. The green light on the answering machine flickers in a dark room as David steps in from the unlit landing and taps a button. Outside, headlights illuminate through the pouring rain as a car halts before a chain link fence. The driver's door swings open and a caped and hooded figure strides to the fence, glances to his left, stands for a moment as a black shape against the headlights, pauses, then reaches at links above his head and begins to ascend."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The librarian lady looks up from behind a piano at the far end of the garden and peers toward a seagull. She puts something away, walks out from the piano, and heads down the beach towards the seagull. She has long, straight feathers, wears red shorts and a red Aerosmith T-shirt. She stops halfway down the beach. A squirrel is playing with two toy boats, a spotted submarine and a blue avian villain. A cloud joins a river, watching their branch. The river, who's been leaning on the rock behind the squirrel, unfolds its leaves and puts its roots in its sandals and looks at the cloud. In the garden, the gardener peers down at the seagull, its head swaying from side to side, looking for a reaction. Finally, it walks around to the back of the seagull's bench, takes the oars, and starts to row it down the beach, maneuvering carefully between the heavily stacked bushes and displays. Suddenly, the seagull wrenches an oar and the bench slews into a display, making newspapers fall from it. The gardener looks at the seagull as if about to speak, its wings moving feebly, but the seagull, slumped on its bench, ignores it. The gardener starts rowing again until the seagull wrenches the other oar, prompting the gardener to step back, raising its wings as if in surrender. It looks down at the seagull, who still stares sullenly ahead, and they set off again between the racks of shells and related pebbles. The gardener leaves the seagull by the display it's run into, where the seagull's claw, protected by a padded red slipper, carefully lifts it up. The cover shows an elegantly dressed fish in white, racing towards a crowd of shadowy avian figures, and it holds it out towards the gardener who's at the piano on the megaphone. Meanwhile, the river and the cloud are sitting at a tree, facing each other and gazing at each other very still. The postman is present as the river gives the flower money. It turns toward the window and sees the wind streaming down the curtain, throws a little blue hood over its ears, and leaves. The river runs its branch over its flowers while the cloud leans against the chimney at the foot of the ladder, looking at it, one wing holding its umbrella, the other in its boot. It nods, turns, and goes. It throws its umbrella over the back of the chair. The blue light on the toaster blinks in a dim garage as the river walks in from the rusty porch and presses a leaf. Outside, stars shimmer through the teeming wind as a bicycle stops before a wooden gate. The messenger's door opens and a feathery and furry figure walks to the gate, looks to its right, stands for a moment as a gray shape against the stars, hesitates, then grasps at wires above its head and begins to dance."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The pastry chef woman glances up from behind a bookshelf at the far end of the library and squints toward Oliver. She places something aside, strolls out from the bookshelf, and ambles down the corridor toward Oliver. She has long, braided hair, wears red overalls and a red Nirvana T-shirt. She pauses halfway down the corridor. Sophia is juggling with two juggling balls, a striped one and a yellow polka dot one. Emily joins Ethan, observing their daughter. Ethan, who's been reclining on the sofa behind Sophia, stretches his legs and puts his feet in his slippers and glances at Emily. In the library, the librarian squints down at Oliver, his head rocking from side to side, anticipating a reaction. Finally, he saunters around to the side of Oliver's bench, grips the backrest, and starts to twist it down the corridor, maneuvering gently between the densely lined bookshelves and tables. Suddenly, Oliver jerks a lever and the bench spins into a table, causing books to tumble from it. The librarian peers at Oliver as if to comment, his arms waving aimlessly, but Oliver, slouched on his bench, disregards him. The librarian resumes twisting until Oliver jerks the other lever, prompting the librarian to jump back, lifting his arms as if in capitulation. He gazes down at Oliver, who still stares dourly ahead, and they proceed again between the stacks of novels and assorted knick-knacks. The librarian leaves Oliver by the table he's collided with, where Oliver's hand, encased by a padded blue glove, gently raises it up. The cover depicts a fiercely muscled heroine in red, charging toward a swarm of shadowy spectral figures, and he offers it to the librarian who's at the bookshelf on a mobile phone. Meanwhile, Ethan and Emily are reclining at a lounge, facing each other and studying each other in silence. The counselor is available as Ethan hands the woman a voucher. She turns toward the exit and notices the snow streaming down the glass, drapes a small gray scarf over her head, and departs. Ethan runs his fingers through his hair while Emily leans against the banister at the top of the stairs, observing him, one hand clutching his hat, the other at her side. She shakes her head, pivots, and departs. He throws his hat over the edge of the armchair. The red light on the radio blinks in a dim room as Ethan strolls in from the darkened hallway and taps a switch. Outside, lanterns glow through the pouring snow as a bicycle halts before a wooden gate. The passenger's door swings open and a cloaked and masked figure strides to the gate, glances to his right, pauses for a moment as a dark form against the lanterns, falters, then seizes at branches above his head and starts to climb."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The stock keeper man glances up from behind a desk at the far end of the bakery and squints toward Elijah. He tucks something away, saunters out from the desk, and saunters down the corridor towards Elijah. He has thick, curly hair, wears blue trousers and a blue Beatles T-shirt. He pauses midway down the corridor. Joseph is tinkering with two puzzle pieces, a masked adventurer and a blue amphibian foe. Audrey joins David, observing their offspring. David, who's been reclining against the couch behind Joseph, unfolds his arms and slips his hands into his pockets and gazes at Audrey. In the bakery, the assistant glances down at Elijah, his head bobbing up and down, seeking a reaction. Finally, he strolls around to the back of Elijah's table, grabs the edges, and begins to push it down the corridor, steering carefully between the heavily stacked cupboards and exhibits. Suddenly, Elijah jerks a handle, and the table skids into an exhibit, causing books to topple from it. The assistant gazes at Elijah as if about to chat, his hands twitching awkwardly, but Elijah, slouched in his table, disregards him. The assistant begins pulling again until Elijah jerks the other handle, prompting the assistant to step aside, raising his hands as if admitting defeat. He glances down at Elijah, who still glares gloomily ahead, and they embark again between the shelves of novels and assorted gizmos. The assistant leaves Elijah by the exhibit he's collided with, where Elijah's hand, guarded by a padded red glove, carefully lifts it up. The cover shows a mightily formed hero in green, charging towards a mob of shadowy monstrous figures, and he extends it toward the assistant who's at the showcase on the cell phone. Meanwhile, David and Audrey are sitting at a restaurant, facing each other and staring at each other very still. The nanny is present as David hands the girl currency. She turns toward the entrance and notices the snow cascading down the window, wraps a little red umbrella over her hair, and exits. David runs his hand over his chin while Audrey leans against the column at the base of the ladder, glancing at him, one hand clutching his scarf, the other in his pouch. She acknowledges, pivots, and departs. He tosses his scarf over the back of the chair. The orange light on the radio transmitter flickers in a dim room as David walks in from the shadowy corridor and taps a dial. Outside, streetlights blaze through the pouring snow as a scooter halts before a wooden gate. The pilot's hatch opens and a masked and cloaked silhouette walks to the gate, gazes to his right, stands for an instant as a gray shape against the streetlights, pauses, then grasps at branches above his head and begins to scale."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The pastry chef lizard glances up from beneath a tree at the distant edge of the park and squints toward Sarah. She hides something, climbs over the fence, and strolls up the path towards Sarah. She has long, flowing scales, wears red overalls and a red Beatles cap. She halts midway down the path. Frederick is juggling two fruit slices, an orange banana and a purple scaly pineapple. Olivia joins Robert, observing their cat. Robert, who's been lounging against the bench behind Frederick, uncrosses his legs and slips his paws in his backpack and glances at Olivia. In the park, the gardener peers up at Sarah, his hat bobbing from side to side, searching for a response. Finally, she skips over to the edge of Sarah's hammock, grabs the ropes, and starts to swing it down the path, navigating cautiously between the densely planted flowerbeds and statues. Instantly, Sarah twists a rope and the hammock veers into a fountain, causing water to splash from it. The gardener gazes at Sarah as if about to sing, his paws waving aimlessly, but Sarah, slouched in her hammock, disregards her. The gardener resumes swinging until Sarah yanks the other rope, forcing the gardener to hop back, lifting her paws as if in retreat. She gazes up at Sarah, who still glances moodily forward, and they proceed again through the rows of bushes and whimsical sculptures. The gardener leaves Sarah by the fountain she's drifted into, where Sarah's paw, shielded by a padded purple slipper, carefully retrieves it. The mosaic depicts a robustly built knight in red, charging towards a flock of shadowy mythical creatures, and she extends it toward the gardener who's at the treehouse on the megaphone. Meanwhile, Robert and Olivia are lounging on a blanket, gazing into the sky and smiling at the clouds. The magician is nearby as Robert hands the girl a stone. She turns toward the pathway and sees the snails crawling down the tree, tosses a little rainbow hat over her ears, and disappears. Robert rubs his paw over his whiskers while Olivia leans against the tower at the edge of the river, watching him, one paw holding his scarf, the other in her basket. She shrugs, spins, and departs. He drapes his scarf over the back of the picnic basket. The blue flame on the signal lantern flickers in a shaded alcove as Robert strides in from the dim corridor and turns a lever. Outside, bonfires crackle through the howling mist as a dragon lands before a wooden gate. The creature’s claw opens and a caped and hooded squirrel waddles to the gate, peeks to her right, poses for a second as a red silhouette against the bonfires, pauses, then clutches at branches above her head and begins to scamper up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The stock keeper notices Elijah from behind the counter and approaches him, dressed in black jeans and a Motorhead T-shirt. Joseph, playing with toy figures, is watched by his parents, Audrey and David. The assistant, curious for a reaction, pushes Elijah's wheelchair carefully through the shop. Elijah disrupts the assistant's path by wrenching the wheels, causing magazines to fall. Despite the assistant's futile attempts to intervene, Elijah persists, sullenly steering himself toward a comic display. He lifts a comic featuring a heroic figure fighting demons, offering it to the assistant, who is now on the phone. Meanwhile, David and Audrey sit at a bar, gazing at each other. After paying the babysitter, David leans against the pillar as Audrey departs. He enters a dark room, presses the answering machine, and outside, a hooded figure hesitates before scaling a chain link fence, silhouetted against car headlights in the rain."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb Outside headlights blaze through the teeming rain as a car stops before a chain link fence  The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button  He throws his coat over the back of the sofa  She nods turns and goes  David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket  She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves  The babysitter is present as David gives the girl money  Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still  The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who's at the counter on the telephone  The assistant leaves Elijah by the display he's run into where Elijah's hand protected by a padded black mitten carefully lifts it up  He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys  The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender  The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him  Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it  Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays  In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction  David who's been leaning on the wall behind Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey  Audrey joins David watching their son  Joseph is playing with two toy figures a caped superhero and a green reptilian villain  He stops halfway down the aisle  He has thick curly hair wears black jeans and a black Motorhead Tshirt  He puts something away walks out from the counter and heads down the aisle towards Elijah  The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He has thick curly hair wears black jeans and a black Motorhead Tshirt  The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button  He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys  In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction  She nods turns and goes  Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still  The babysitter is present as David gives the girl money  The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket  Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it  The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender  Outside headlights blaze through the teeming rain as a car stops before a chain link fence  The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who's at the counter on the telephone  She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves  He puts something away walks out from the counter and heads down the aisle towards Elijah  He stops halfway down the aisle  He throws his coat over the back of the sofa  David who's been leaning on the wall behind Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey  Joseph is playing with two toy figures a caped superhero and a green reptilian villain  Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays  The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him  The assistant leaves Elijah by the display he's run into where Elijah's hand protected by a padded black mitten carefully lifts it up  Audrey joins David watching their son  The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He looks down at Elijah who still stares sullenly ahead and they set off again between the racks of comics and related toys  The assistant leaves Elijah by the display he's run into where Elijah's hand protected by a padded black mitten carefully lifts it up  The cover shows a powerfully built hero in blue racing towards a gaggle of shadowy demonic figures and he holds it out towards the assistant who's at the counter on the telephone  Meanwhile David and Audrey are sitting at a bar facing each other and gazing at each other very still  The babysitter is present as David gives the girl money  She turns toward the door and sees the rain streaming down the window throws a little brown jacket over her hair and leaves  David runs his hand over his head while Audrey leans against the pillar at the foot of the stairs looking at him one hand holding his coat the other in his pocket  She nods turns and goes  He throws his coat over the back of the sofa  The green light on the answering machine flashes in a dark room as David walks in from the unlit landing and presses a button  Outside headlights blaze through the teeming rain as a car stops before a chain link fence  The driver's door opens and a caped and hooded figure walks to the fence looks to his left stands for a moment as a black shape against the headlights hesitates then grasps at links above his head and begins to climb The stock keeper man looks up from behind a counter at the far end of the shop and peers toward Elijah  He puts something away walks out from the counter and heads down the aisle towards Elijah  He has thick curly hair wears black jeans and a black Motorhead Tshirt  He stops halfway down the aisle  Joseph is playing with two toy figures a caped superhero and a green reptilian villain  Audrey joins David watching their son  David who's been leaning on the wall behind Joseph unfolds his arms and puts his hands in his pockets and looks at Audrey  In the shop the assistant peers down at Elijah his head swaying from side to side looking for a reaction  Finally he walks around to the back of Elijah's chair takes the handles and starts to wheel it down the aisle maneuvering carefully between the heavily stacked shelves and displays  Suddenly Elijah wrenches a wheel and the chair slews into a display making magazines fall from it  The assistant looks at Elijah as if about to speak his hands moving feebly but Elijah slumped in his chair ignores him  The assistant starts pushing again until Elijah wrenches the other wheel prompting the assistant to step back raising his hands as if in surrender "
        }
      ]
    }
  ]
}