{
  "ground_truth": "The sequence begins with a scene where a figure scans around, followed by the Chancellor overlooking the loading bay. Yuri leads a fast-moving crowd across the wide boarding platform. As Tenzen and the others board the ship, Grandpa slips, prompting Jackson to quickly react and grab his arm. Tenzen acknowledges Jackson with a nod. The crowd on the boarding platform reaches a deep pit surrounding the ark, and when a man falls into the pit, the crowd halts in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside move into position. Jackson and the others are seen walking toward the hedge. A view from a height reveals the struggling crowd and the boarding platform below, where Yuri is heard saying something. From atop the hull, Tamara spots Caesar on the ground. Inside the hatch, Jackson holds a torch as Tenzen unwinds a sealed shaft. Caesar reaches Tamara just as the outer hatch closes, while Yuri looks on angrily, and Tamara gestures rudely at him before the hatch slams shut. Inside, Jackson, Gordon, and others shine torches as Tenzen uses a pneumatic drill. Nema looks up with hope as Tenzen opens a round hatch. On the control bridge, Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit. Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark. Anheuser shakes his head at Adriane, who looks down with relief, while Anheuser hangs his head. Michaels picks up the phone on the control desk in a darkened corridor. Tamara uses her torch to light up various caged animals. As the gates open, a hydraulic ceiling lowers, knocking Gordon and Tenzen off a ladder. Jackson struggles to help the injured Tenzen and Gordon, who cling on just above grinding gears, with Gordon being dragged between the wheels. Uri tries to pull himself back onto the boarding platform from a lower ledge. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling, as Jackson finds himself trapped between a wire fence and the ceiling. Tenzen's drill becomes entangled in the gears, causing sparks to fly. Jackson reaches out desperately as the hydraulic wall advances toward the gate, but the gears grind to a halt, and the wall stops. In the following chaos, hundreds of people leap onto the gate and board the Ark. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile, in a mountaintop monastery, flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor, scanning around. In the distance, a gigantic wall of water crashes between the peaks of the snow-covered mountains, and Lama rings the monastery bell as the water rapidly approaches.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The progression commences with a tableau where a silhouette scrutinizes around, succeeded by the Chancellor overseeing the loading bay. Yuri guides a swift-moving throng across the broad boarding platform. As Tenzen and the others board the vessel, Grandpa slips, prompting Jackson to promptly respond and seize his limb. Tenzen recognizes Jackson with an inclination. The throng on the boarding platform reaches a profound chasm encircling the ark, and when a gentleman tumbles into the abyss, the crowd freezes in their steps. The tableau transitions to the ark bridge where the gigantic rear life supports outside maneuver into placement. Jackson and the others are observed strolling toward the hedge. A panorama from an elevation unveils the striving throng and the boarding platform beneath, where Yuri is discerned articulating something. From atop the hull, Tamara notices Caesar on the terrain. Within the hatch, Jackson clutches a torch as Tenzen uncoils a sealed shaft. Caesar attains Tamara just as the exterior hatch seals, while Yuri observes furiously, and Tamara signals rudely at him before the hatch slams closed. Inside, Jackson, Gordon, and others illuminate torches as Tenzen employs a pneumatic drill. Nema gazes up with optimism as Tenzen unveils a circular hatch. On the control bridge, Adriane and Laura observe in terror as individuals outside plummet off the boarding platform into the chasm. Adriane traverses the bridge with a profound scowl as Macarenka examines a screen on his ark. Anheuser shakes his head at Adriane, who gazes downward with solace, while Anheuser lowers his head. Michaels lifts the phone on the control desk in a dim corridor. Tamara uses her torch to illuminate various caged creatures. As the gates open, a hydraulic ceiling descends, knocking Gordon and Tenzen off a ladder. Jackson struggles to assist the wounded Tenzen and Gordon, who cling on just above grinding gears, with Gordon being pulled between the wheels. Uri attempts to pull himself back onto the boarding platform from a lower ledge. Tenzen becomes stuck between the gears and the swiftly descending hydraulic ceiling, as Jackson finds himself ensnared between a wire barrier and the ceiling. Tenzen's drill becomes ensnared in the gears, causing sparks to erupt. Jackson reaches out frantically as the hydraulic barrier advances toward the gate, but the gears grind to a standstill, and the wall halts. In the ensuing disorder, hundreds of individuals leap onto the gate and board the Ark. Anheuser observes the disorder with apprehension and takes in his surroundings using a digital camera. Meanwhile, in a mountaintop sanctuary, flower petals are blown by the breeze from a bowl as a Lama gazes up from his seat on the floor, scrutinizing around. In the distance, a titanic wall of water crashes between the summits of the snow-covered mountains, and Lama rings the sanctuary bell as the water swiftly approaches."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The sequence is begun with a scene where a scan is made by a figure around the area, followed by the loading bay being overlooked by the Chancellor. A fast-moving crowd is led by Yuri across the wide boarding platform. As the ship is boarded by Tenzen and the others, a slip is experienced by Grandpa, prompting Jackson to quickly react and grab his arm. Jackson is acknowledged by Tenzen with a nod. The deep pit surrounding the ark is reached by the crowd on the boarding platform, and when a man falls into the pit, their tracks are halted. The scene shifts to the ark bridge where movements into position are made by the enormous rear life supports outside. Jackson and the others walk toward the hedge. A view from a height reveals the struggling crowd and the boarding platform below, where something is said by Yuri. From atop the hull, Caesar is spotted on the ground by Tamara. Inside the hatch, a torch is held by Jackson as a sealed shaft is unwound by Tenzen. Caesar reaches Tamara just as the outer hatch is closed, while an angry look is directed by Yuri, and Tamara rudely gestures at him before the hatch slams shut. Inside, torches are shone by Jackson, Gordon, and others as a pneumatic drill is used by Tenzen. Hope is shown by Nema as a round hatch is opened by Tenzen. On the control bridge, Adriane and Laura watch in horror as people fall off the boarding platform into the pit outside. The bridge is crossed by Adriane with a deep frown as a screen on his ark is surveyed by Macarenka. His head is shaken by Anheuser at Adriane, who looks down with relief, while a lowered head is maintained by Anheuser. The phone on the control desk in a darkened corridor is picked up by Michaels. Various caged animals are lit up by Tamara using her torch. As the gates open, a hydraulic ceiling is lowered, knocking Gordon and Tenzen off a ladder. Aid is struggled to be provided by Jackson to the injured Tenzen and Gordon, who cling on just above grinding gears, with Gordon being dragged between the wheels. Uri tries to pull himself back onto the boarding platform from a lower ledge. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling, as Jackson finds himself trapped between a wire fence and the ceiling. The drill of Tenzen becomes entangled in the gears, causing sparks to fly. Desperation is felt by Jackson as a reach is made toward the advancing hydraulic wall at the gate, but a halt is experienced by the gears, and the wall stops. In the following chaos, hundreds of people leap onto the gate and board the Ark. The chaos is watched with anxiety by Anheuser, who takes in his surroundings using a digital camera. Meanwhile, in a mountaintop monastery, a bowl of flower petals is blown by the wind as a Lama looks up from his seat on the floor, performing a scan around. In the distance, a gigantic wall of water crashes between the peaks of the snow-covered mountains, and the monastery bell is rung by Lama as the water rapidly approaches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The sequence starts with a figure scanning around, followed by the Chancellor at the loading bay. Yuri leads a fast-moving crowd across the wide boarding platform. As Tenzen and others board the ship, Grandpa slips, and Jackson swiftly grabs his arm. Tenzen nods to Jackson. The crowd reaches a pit surrounding the ark; when a man falls in, the crowd stops. The scene shifts to the ark's bridge where rear life supports move into position. Jackson and others walk toward the hedge. A high view shows the struggling crowd below, with Yuri speaking. Tamara, atop the hull, spots Caesar on the ground. Inside the hatch, Jackson holds a torch as Tenzen unwinds a shaft. Caesar arrives as the hatch closes, Yuri watches angrily, and Tamara makes a rude gesture before the hatch shuts. Inside, Jackson, Gordon, and others use torches as Tenzen operates a pneumatic drill. Nema looks hopeful as Tenzen opens a round hatch. On the control bridge, Adriane and Laura watch in horror as people fall into the pit. Adriane crosses with a frown as Macarenka surveys his ark's screen. Anheuser shakes his head at Adriane, who looks down with relief. Michaels picks up the phone on the control desk. Tamara uses her torch to illuminate caged animals. As gates open, a hydraulic ceiling descends, knocking Gordon and Tenzen off a ladder. Jackson helps the injured duo who cling above grinding gears, with Gordon dragged between wheels. Uri struggles to pull himself up onto the platform. Tenzen gets trapped between gears and the descending ceiling as Jackson finds himself stuck between a fence and the ceiling. Tenzen's drill entangles in gears, sparking. Jackson reaches out as the wall advances, but the gears halt and the wall stops. Amid the chaos, hundreds leap onto the gate and board the Ark. Anheuser watches with anxiety, taking in the scene with a digital camera. In a mountaintop monastery, a Lama sees flower petals blown by the wind as he looks up. A massive water wall crashes between mountains, and the Lama rings the bell as the water approaches."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The scene starts with a figure scanning around, then the Chancellor overlooks the loading bay. Yuri leads a fast-moving crowd across the platform. As Tenzen boards the ship, Grandpa slips, and Jackson grabs his arm. Tenzen nods at Jackson. The crowd halts as a man falls into the pit surrounding the ark. On the ark bridge, life supports move into position. Jackson and others head toward the hedge. From a height, the struggling crowd and platform are visible. Yuri speaks, and Tamara spots Caesar from atop the hull. Inside, Jackson holds a torch as Tenzen unwinds a shaft. Caesar reaches Tamara as the outer hatch closes, with Tamara rudely gesturing at Yuri. Jackson, Gordon, and others use torches while Tenzen operates a pneumatic drill. Nema looks hopeful as he opens a hatch. On the bridge, Adriane and Laura watch in horror as people fall into the pit. Adriane frowns and crosses the bridge, Macarenka checks a screen, while Anheuser shakes his head. Michaels picks up a phone. Tamara lights caged animals with her torch. The gates open, a ceiling descends, knocking Gordon and Tenzen off a ladder. Jackson helps the injured as Gordon is dragged between wheels. Uri pulls himself onto the platform. Tenzen is stuck as Jackson is trapped. Sparks fly when Tenzen's drill entangles in gears. Jackson reaches out as the wall advances, but gears stop, and the wall halts. Chaos ensues as people board the Ark. Anheuser records with a camera. In a monastery, a Lama watches a massive wave approach and rings the bell."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The sequence begins with an opening scene where a solitary figure takes a moment to carefully scan the surroundings, followed by an intense vision of the Chancellor gazing over the bustling activity taking place in the loading bay. Yuri, with determination, leads a briskly moving crowd across the wide expanse of the boarding platform. As Tenzen and his group make their way onto the ship, Grandpa unexpectedly loses his footing, which prompts Jackson to spring into action, swiftly reaching out to grab his arm just in time. Tenzen, appreciating the help, acknowledges Jackson's quick response with a nod of gratitude. The assembled crowd on the boarding platform reaches the edge of a profound, deep pit encircling the ark, and when a man tragically tumbles into the abyss, the crowd comes to an abrupt halt in their tracks. The scene then transitions to focus on the ark bridge, where the enormous rear life supports situated outside can be seen moving into their designated positions. Jackson and the others are depicted walking toward the hedge. From a vantage point situated high above, a view reveals the struggling crowd and the boarding platform far below, while in the meantime, Yuri's voice is faintly heard saying something. Perched atop the hull, Tamara catches sight of Caesar down on the ground. Inside the hatch, Jackson is seen holding a torch as Tenzen diligently unwinds a sealed shaft. Caesar reaches Tamara just in time as the outer hatch closes, while Yuri watches the scene with an air of anger, and Tamara makes a rude gesture at him just before the hatch slams shut. Once inside, Jackson, Gordon, and others shine their torches as Tenzen makes adept use of a pneumatic drill. Nema looks upwards, filled with hope, as Tenzen finally opens a round hatch. On the control bridge, Adriane and Laura watch in horror-stricken disbelief as people outside fall from the boarding platform into the pit. Adriane crosses the bridge, a deep frown etched on her face, while Macarenka closely surveys a screen on his ark. Anheuser shakes his head at Adriane, who lowers her gaze with a sense of relief, whereas Anheuser hangs his head in resignation. Michaels picks up the phone, his hand reaching for it on the control desk situated in a dimly lit corridor. Tamara uses her torch to illuminate various caged animals around her. As the gates open, a hydraulic ceiling descends rapidly, knocking Gordon and Tenzen off a ladder. Jackson fights desperately to assist the injured Tenzen and Gordon, who are clinging on just above the dangerously grinding gears, with Gordon being dangerously dragged in between the wheels. Uri struggles to pull himself back onto the boarding platform from a precarious lower ledge. Tenzen finds himself trapped between the unforgiving gears and the swiftly descending hydraulic ceiling, while Jackson is cornered between a wire fence and the descending ceiling. Tenzen's drill gets caught in the gears, leading to a cascade of flying sparks. In a desperate reach, Jackson stretches out as the hydraulic wall advances toward the gate, but the gears unexpectedly grind to a halt, causing the wall to stop in its tracks. Amid the ensuing chaos, hundreds leap onto the gate and succeed in boarding the Ark. Anheuser watches the unfolding chaos with anxiety, capturing his surroundings using a digital camera for posterity. Meanwhile, far away in a secluded mountaintop monastery, delicate flower petals are carried away by the wind from a bowl as a Lama, seated on the floor, looks up and scans the surrounding environment. In the distance, a massive wall of water is seen crashing powerfully between the peaks of the snow-laden mountains, prompting the Lama to ring the monastery bell as the torrent rapidly approaches."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The unfolding sequence begins with an introductory scene in which a solitary figure is observed pausing momentarily to thoroughly and meticulously survey the surroundings. This is followed by a vivid and intense image of the Chancellor, fixated on the frenetic and bustling activity occurring within the confines of the loading bay. With a sense of determination and resolve, Yuri takes the lead, guiding a swiftly moving crowd across the expansive width of the boarding platform. As Tenzen, accompanied by his group, proceeds to board the ship, an unexpected incident occurs when Grandpa loses his balance, prompting a quick-stepping Jackson to react promptly. He hurriedly reaches out, successfully grabbing Grandpa’s arm just in the nick of time. In recognition of Jackson's quick thinking and swift response, Tenzen nods with appreciation, expressing his gratitude. The gathering crowd on the boarding platform progresses to the brink of a profound and deep pit that completely encircles the ark. At that precise moment, when an unfortunate individual tragically plunges into the abyss, the entire crowd comes to an abrupt and sudden halt. The scene then transitions its focus to the ark bridge, highlighting the immense rear life supports that are prominently located outside and gradually maneuver into their designated positions. Jackson and his companions are subsequently depicted making their way toward the hedge. From a vantage point positioned high above, a view surfaces, showcasing the struggling masses and the boarding platform far beneath, while in the interim, Yuri's voice can be faintly heard uttering something indistinct. Perched atop the hull, Tamara observes Caesar down on the ground below. Within the confines of the hatch, Jackson is seen firmly holding a torch while Tenzen diligently unwinds a securely sealed shaft. In a timely manner, Caesar reaches Tamara just as the outer hatch closes, with Yuri watching the proceedings with a look of anger, and Tamara expressing her disdain with a rude gesture directed at him just before the hatch slams shut with finality. Once inside, Jackson, along with Gordon and others, illuminate the area with their torches as Tenzen skillfully employs a pneumatic drill. Filled with hope and anticipation, Nema looks upward as Tenzen ultimately manages to open a round hatch. On the control bridge, Adriane and Laura stand aghast, watching in sheer horror and disbelief as individuals outside plummet from the boarding platform into the pit below. Adriane traverses the bridge with a profound frown etched on her face while Macarenka keeps a close eye on a screen situated on his ark. Anheuser shakes his head at Adriane, who, in contrast, lowers her gaze, exuding a sense of relief, whereas Anheuser succumbs to an air of resignation, his head hanging low. Michaels reaches out, picking up the phone placed conveniently on the control desk located within the dimly lit corridor. Tamara utilizes her torch to shed light on a variety of caged animals surrounding her. As the gates open, a hydraulic ceiling descends rapidly, striking with force and knocking both Gordon and Tenzen from a ladder. With desperation, Jackson fights to aid the injured Tenzen and Gordon, who are precariously clinging just above the grinding gears, with Gordon being dangerously dragged in between the wheels. Uri struggles with all his might to pull himself back onto the boarding platform from a treacherous lower ledge. Tenzen finds himself trapped between the unyielding gears and the swiftly descending hydraulic ceiling, while Jackson is cornered between a wire fence and the rapidly descending ceiling. In a dramatic turn of events, Tenzen's drill becomes ensnared in the gears, causing a dramatic cascade of flying sparks. In a desperate attempt, Jackson reaches out as the hydraulic wall advances steadily toward the gate, only for the gears to unexpectedly grind to a halt, causing the wall to come to an abrupt standstill. Amidst the ensuing chaos, hundreds leap onto the gate, ultimately achieving success in boarding the ark. With anxiety, Anheuser watches the pandemonium unfold, capturing the chaos around him through the lens of a digital camera for future posterity. Meanwhile, in a far-flung, secluded mountaintop monastery, delicate flower petals are carried away by the wind from a bowl as a Lama, serenely seated on the floor, raises his gaze to scan the environment. In the distance, a massive and formidable wall of water is witnessed crashing powerfully and forcefully between the towering peaks of the snow-covered mountains, prompting the Lama to somberly ring the monastery bell as the relentless torrent approaches rapidly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene opens with a figure meticulously scanning the surroundings, taking careful note of every detail in the vicinity. Meanwhile, the Chancellor stands with a commanding presence, overlooking the activity in the loading bay below. Yuri asserts his leadership by guiding a swiftly moving crowd across the expansive boarding platform, each step purposeful as they navigate the busy space. As Tenzen and his group make their way up and onto the ship, an unexpected slip by Grandpa causes a sudden commotion, prompting Jackson to instinctively spring into action. He extends his arm with urgency, grasping Grandpa's arm to prevent his fall, their eyes meeting in a silent exchange. Tenzen observes the interaction and offers a subtle acknowledgment to Jackson in the form of a nod. The boarding platform is a sea of movement as the crowd arrives at the edge of a daunting deep pit surrounding the ark, only to abruptly halt when a man inadvertently plummets into the abyss, causing a collective gasp and a brief standstill. The narrative transitions to the ark bridge, where the colossal rear life supports outside are seen shifting seamlessly into their designated positions. Within this orchestrated chaos, Jackson and his companions proceed with determination toward the hedge, each step calculated as they navigate the scene. A bird's eye view captures the struggling crowd below, with the boarding platform laid out like a map, while Yuri’s voice resonates through the air, its content indistinct. Perched atop the hull, Tamara's keen eyes spot Caesar below, grounding her observations. Inside the hatch, Jackson wields a torch, its beam slicing through the darkness as Tenzen methodically unseals a shaft. Simultaneously, Caesar reaches Tamara just as the outer hatch ominously seals, creating a barrier between them, while Yuri's anger is palpable, his emotions betrayed by his fiery gaze, which is met with Tamara's defiant, rude gesture as the hatch slams shut, echoing with finality. Within, Jackson, Gordon, and their companions illuminate their path with torches, casting flickering shadows as Tenzen expertly operates a pneumatic drill. In a moment of anticipation, Nema's gaze lifts, her eyes reflecting hope as Tenzen successfully opens a round hatch, signaling a pivotal moment. The control bridge paints a grim picture as Adriane and Laura watch in helpless horror, their expressions mirroring the tragedy unfolding as individuals outside lose their footing and tumble from the safety of the boarding platform into the pit below. With a deep frown etched on her face, Adriane traverses the bridge, conveying her dismay, while Macarenka closely monitors a screen displaying the status of his ark. Anheuser, with a knowing shake of his head, exchanges a loaded glance with Adriane, who momentarily finds relief, her eyes lowering. Meanwhile, Anheuser is left to contemplate as he hangs his head, absorbed in his thoughts. In contrast, Michaels occupies a dimly lit corridor, his hand reaching for the phone resting on the control desk, the weight of the situation heavy in the atmosphere. As the gates creak open, Tamara utilizes her torch to reveal various caged animals, casting beams of light that dance across their forms. The scene escalates when a massive hydraulic ceiling descends with unstoppable force, colliding with the ladder and sending Gordon and Tenzen tumbling. Jackson finds himself grappling with the situation, trying to aid the injured Tenzen and Gordon, who cling desperately just above the merciless grinding gears. Gordon's precarious position sees him being dragged between the wheels, adding to the urgency. Meanwhile, Yuri makes a desperate attempt to hoist himself back onto the safety of the boarding platform from a precarious lower ledge. Tenzen, now stuck between the relentless gears and the descending hydraulic ceiling, adds to the tension as Jackson struggles, confined between a wire fence and the imposing ceiling. Sparks fly in a dramatic display as Tenzen's drill becomes ensnared within the gears, exacerbating the danger. Jackson's movements grow frantic as he reaches out, his actions driven by desperation as the hydraulic wall advances inexorably toward the gate. But just as all seems lost, the gears grind to an unexpected halt, and the wall ceases its advance, marking a moment of reprieve. In the ensuing pandemonium, hundreds seizing the opportunity, surge onto the gate and spill into the Ark, turning chaos into a frenzied boarding. Anheuser, witnessing this tumult, captures the moment using a digital camera, his anxiety evident as he takes in his surroundings. Meanwhile, far removed in a mountaintop monastery, delicate flower petals flutter in the wind, lifted gracefully from a bowl as a Lama seated on the floor raises his gaze, scanning the horizon. In the distance, an immense wall of water surges, crashing with formidable force between the peaks of snow-laden mountains. In a solemn act of warning, the Lama rings the monastery bell, its sound resonating as the surging water rapidly closes in, signaling an inevitable convergence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The sequence opens with a figure scanning the area, leading to the Chancellor overseeing the loading bay. Yuri directs a fast-moving crowd across the wide boarding platform, and as Tenzen and the others board the ship, Grandpa slips, prompting Jackson to grab his arm, acknowledged by a nod from Tenzen. The crowd reaches a pit surrounding the ark and halts when a man falls in. Meanwhile, on the ark bridge, rear life supports shift into position, and Jackson's group walks toward the hedge. Viewing from above, the struggling crowd on the platform is seen, with Yuri's voice heard. Tamara, atop the hull, spots Caesar on the ground. Inside, Jackson uses a torch while Tenzen unwinds a sealed shaft. Caesar reaches Tamara just as the hatch closes, with Yuri's angry gaze and Tamara's rude gesture preceding the slamming hatch. Inside, as Jackson, Gordon, and others shine torches, Tenzen employs a pneumatic drill, opening a hatch, giving Nema hope. On the control bridge, Adriane and Laura watch people falling into the pit with horror. Adriane moves across the bridge with a frown as Macarenka checks his screen. Anheuser shakes his head at Adriane, who feels relieved, while Anheuser bows his head. Michaels answers a call in a dark corridor. Tamara illuminates caged animals with her torch. As the gates open, a hydraulic ceiling descends, knocking Gordon and Tenzen from a ladder. Jackson assists the injured duo above grinding gears, Gordon being dragged between wheels. Uri pulls himself onto the platform from a ledge. Tenzen is trapped between gears and the ceiling as Jackson is caught between a fence and ceiling. Tenzen's drill creates sparks in the gears, stopping them and the wall. Amid the chaos, hundreds leap onto the gate and board the Ark. Anheuser watches and documents the scene with a digital camera. Meanwhile, in a mountaintop monastery, a Lama notices flower petals blowing from a bowl and the approaching wall of water crashing through snow-covered peaks, prompting him to ring the monastery bell."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The sequence begins with a scene in a bustling evacuation center where a figure scans around anxiously, followed by the Chancellor overlooking the loading bay of an advanced spacecraft designed for planetary evacuation. Yuri, an experienced evacuation leader, leads a fast-moving crowd across the wide boarding platform at a spaceport designed for mass departures. As Tenzen and the others board the ship, which is one of the last to leave, Grandpa slips, prompting Jackson to quickly react and grab his arm, demonstrating his quick reflexes honed from years of outdoor adventures. Tenzen acknowledges Jackson with a nod of gratitude. The crowd on the boarding platform reaches a deep pit specially constructed to contain energy emissions surrounding the ark, and when a man falls into the pit, the crowd halts in their tracks, shocked at the sudden accident. The scene shifts to the ark bridge where the enormous rear life supports, crucial for sustaining life during long space journeys, move into position. Jackson and the others are seen walking toward the hedge, a makeshift barrier used for crowd control. A view from a height reveals the struggling crowd and the boarding platform below, where Yuri is heard saying something motivational to calm the masses. From atop the hull of the massive spacecraft, Tamara spots Caesar, a fellow crew member, on the ground. Inside the hatch of the ark, Jackson holds a torch, often used for emergency navigation, as Tenzen unwinds a sealed shaft that regulates the ship’s oxygen flow. Caesar reaches Tamara just as the outer hatch closes, while Yuri looks on angrily, and Tamara gestures rudely at him before the hatch slams shut, their long-standing rivalry apparent. Inside, Jackson, Gordon, and other crew members shine torches as Tenzen uses a pneumatic drill to access critical ship components. Nema looks up with hope as Tenzen opens a round hatch that leads to the central command system. On the control bridge, Adriane and Laura watch in horror as people outside fall off the slippery boarding platform into the pit. Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark, displaying vital statistics of the evacuation. Anheuser shakes his head at Adriane, who looks down with relief, realizing they are still on schedule, while Anheuser hangs his head, feeling the weight of leadership. Michaels picks up the phone on the control desk in a darkened corridor, ready to issue further commands. Tamara uses her torch to light up various caged animals, part of the ark's biodiversity preservation mission. As the gates open, a hydraulic ceiling lowers, knocking Gordon and Tenzen off a ladder in a dangerous setback. Jackson struggles to help the injured Tenzen and Gordon, who cling on just above grinding gears that power essential ship systems, with Gordon being dragged between the wheels. Uri attempts to pull himself back onto the boarding platform from a lower ledge, a feat requiring immense upper-body strength. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling, a perilous position, as Jackson finds himself trapped between a wire fence and the ceiling during the emergency. Tenzen's drill becomes entangled in the gears, causing sparks to fly and adding to the chaos. Jackson reaches out desperately as the hydraulic wall advances toward the gate, but the gears grind to a halt, and the wall stops, an automatic safety mechanism activating just in time. In the following chaos, hundreds of people leap onto the gate and board the Ark, their last hope for survival. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera, documenting the historic moment. Meanwhile, in a mountaintop monastery, flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor, scanning around. In the distance, a gigantic wall of water crashes between the peaks of the snow-covered mountains, a cataclysmic event, and Lama rings the monastery bell as the water rapidly approaches, a somber warning to those still in the path of danger."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Tamara uses her torch to light up various caged animals The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops Yuri leads a fastmoving crowd across the wide boarding platform Uri tries to pull himself back onto the boarding platform from a lower ledge As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm Tenzen acknowledges Jackson with a nod The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks Tenzen acknowledges Jackson with a nod The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm The scene shifts to the ark bridge where the enormous rear life supports outside move into position Jackson and the others are seen walking toward the hedge A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something From atop the hull Tamara spots Caesar on the ground From atop the hull Tamara spots Caesar on the ground Tenzen's drill becomes entangled in the gears causing sparks to fly Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill Yuri leads a fastmoving crowd across the wide boarding platform Nema looks up with hope as Tenzen opens a round hatch On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head Michaels picks up the phone on the control desk in a darkened corridor Tamara uses her torch to light up various caged animals On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels Uri tries to pull himself back onto the boarding platform from a lower ledge A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling Tenzen's drill becomes entangled in the gears causing sparks to fly Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops In the following chaos hundreds of people leap onto the gate and board the Ark Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay. Yuri leads a fastmoving crowd across the wide boarding platform. As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm. Tenzen acknowledges Jackson with a nod. The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside move into position. Jackson and the others are seen walking toward the hedge. A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something. From atop the hull Tamara spots Caesar on the ground. Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft. Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut. Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill. Nema looks up with hope as Tenzen opens a round hatch. On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark. Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head. Michaels picks up the phone on the control desk in a darkened corridor. Tamara uses her torch to light up various caged animals. As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder. Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels. Uri tries to pull himself back onto the boarding platform from a lower ledge. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling. Tenzen's drill becomes entangled in the gears causing sparks to fly. Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops. In the following chaos hundreds of people leap onto the gate and board the Ark. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around. In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay. Yuri leads a fastmoving crowd across the wide boarding platform. As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm. Tenzen acknowledges Jackson with a nod. The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside move into position. Jackson and the others are seen walking toward the hedge. A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something. From atop the hull Tamara spots Caesar on the ground. Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft. Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut. Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill. Nema looks up with hope as Tenzen opens a round hatch. On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark. Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head. Michaels picks up the phone on the control desk in a darkened corridor. Tamara uses her torch to light up various caged animals. As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder. Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels. Uri tries to pull himself back onto the boarding platform from a lower ledge. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling. Tenzen's drill becomes entangled in the gears causing sparks to fly. Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops. In the following chaos hundreds of people leap onto the gate and board the Ark. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around. In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay. Yuri leads a fastmoving crowd across the wide boarding platform. As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm. Tenzen acknowledges Jackson with a nod. The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside move into position. Jackson and the others are seen walking toward the hedge. Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling. Tenzen's drill becomes entangled in the gears causing sparks to fly. Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops. In the following chaos hundreds of people leap onto the gate and board the Ark. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around. In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay. Yuri leads a fastmoving crowd across the wide boarding platform. As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around. In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The sequence begins with a scene where a squirrel scans around, followed by the Chef overlooking the loading bay. A turtle leads a fast-moving crowd across the wide boarding platform. As a dolphin and the others board the ship, a kangaroo slips, prompting a robot to quickly react and grab its arm. The dolphin acknowledges the robot with a nod. The crowd on the boarding platform reaches a deep pit surrounding the ark, and when a penguin falls into the pit, the crowd halts in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside move into position. The robot and the others are seen walking toward the hedge. A view from a height reveals the struggling crowd and the boarding platform below, where a turtle is heard saying something. From atop the hull, an eagle spots a lizard on the ground. Inside the hatch, the robot holds a torch as the dolphin unwinds a sealed shaft. The lizard reaches the eagle just as the outer hatch closes, while the turtle looks on angrily, and the eagle gestures rudely at it before the hatch slams shut. Inside, the robot, a bear, and others shine torches as the dolphin uses a pneumatic drill. A giraffe looks up with hope as the dolphin opens a round hatch. On the control bridge, a tiger and a rabbit watch in horror as people outside fall off the boarding platform into the pit. The tiger crosses the bridge with a deep frown as a zebra surveys a screen on its ark. An owl shakes its head at the tiger, who looks down with relief, while the owl hangs its head. A fox picks up the phone on the control desk in a darkened corridor. The eagle uses its torch to light up various caged animals. As the gates open, a hydraulic ceiling lowers, knocking the bear and the dolphin off a ladder. The robot struggles to help the injured dolphin and bear, who cling on just above grinding gears, with the bear being dragged between the wheels. An antelope tries to pull itself back onto the boarding platform from a lower ledge. The dolphin gets stuck between the gears and the swiftly descending hydraulic ceiling, as the robot finds itself trapped between a wire fence and the ceiling. The dolphin's drill becomes entangled in the gears, causing sparks to fly. The robot reaches out desperately as the hydraulic wall advances toward the gate, but the gears grind to a halt, and the wall stops. In the following chaos, hundreds of people leap onto the gate and board the Ark. An owl watches the chaos with anxiety and takes in its surroundings using a digital camera. Meanwhile, in a mountaintop monastery, flower petals are blown by the wind from a bowl as a panda looks up from its seat on the floor, scanning around. In the distance, a gigantic wall of water crashes between the peaks of the snow-covered mountains, and the panda rings the monastery bell as the water rapidly approaches."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The sequence begins with a scene where a figure scans around, followed by the Chancellor overlooking the library. Yuri leads a fast-moving crowd across the wide dining table. As Tenzen and the others board the carriage, Grandpa slips, prompting Jackson to quickly react and grab his arm. Tenzen acknowledges Jackson with a nod. The crowd on the dining table reaches a deep hole surrounding the balloon, and when a man falls into the hole, the crowd halts in their tracks. The scene shifts to the balloon basket where the enormous rear fans outside move into position. Jackson and the others are seen walking toward the hedge maze. A view from a height reveals the struggling crowd and the dining table below, where Yuri is heard saying something. From atop the hull, Tamara spots Caesar on the cobblestones. Inside the hatch, Jackson holds a lantern as Tenzen unwinds a sealed trunk. Caesar reaches Tamara just as the outer hatch closes, while Yuri looks on angrily, and Tamara gestures rudely at him before the hatch slams shut. Inside, Jackson, Gordon, and others shine lanterns as Tenzen uses a crowbar. Nema looks up with hope as Tenzen opens a round hatch. On the control bridge, Adriane and Laura watch in horror as people outside fall off the dining table into the hole. Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his balloon. Anheuser shakes his head at Adriane, who looks down with relief, while Anheuser hangs his head. Michaels picks up the phone on the control desk in a darkened corridor. Tamara uses her lantern to light up various caged plants. As the gates open, a hydraulic floor lowers, knocking Gordon and Tenzen off a ladder. Jackson struggles to help the injured Tenzen and Gordon, who cling on just above spinning cogs, with Gordon being dragged between the pulleys. Uri tries to pull himself back onto the dining table from a lower ledge. Tenzen gets stuck between the cogs and the swiftly descending hydraulic floor, as Jackson finds himself trapped between a wire fence and the floor. Tenzen's crowbar becomes entangled in the cogs, causing sparks to fly. Jackson reaches out desperately as the hydraulic wall advances toward the gate, but the cogs grind to a halt, and the wall stops. In the following chaos, hundreds of people leap onto the gate and board the Balloon. Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera. Meanwhile, in a mountaintop cabin, feathers are blown by the wind from a pot as a Monk looks up from his seat on the floor, scanning around. In the distance, a gigantic wall of sand crashes between the peaks of the snow-covered mountains, and Monk rings the cabin bell as the sand rapidly approaches."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The sequence begins with a scene where a figure peers around, followed by the Chancellor examining the loading bay. Yuri directs a quick-moving crowd across the wide boarding platform. As Tenzen and the others enter the ship, Grandpa stumbles, prompting Jackson to swiftly respond and hold his arm. Tenzen acknowledges Jackson with a wave. The crowd on the boarding platform approaches a deep pit surrounding the ark, and when a man trips into the pit, the crowd pauses in their tracks. The scene shifts to the ark bridge where the enormous rear life supports outside glide into position. Jackson and the others are seen strolling toward the hedge. A view from a height shows the bustling crowd and the boarding platform below, where Yuri is heard murmuring something. From atop the hull, Tamara identifies Caesar on the ground. Inside the hatch, Jackson carries a torch as Tenzen unseals a closed shaft. Caesar catches up with Tamara just as the outer hatch seals, while Yuri observes angrily, and Tamara signals rudely at him before the hatch closes shut. Inside, Jackson, Gordon, and others illuminate with torches as Tenzen operates a pneumatic drill. Nema gazes up with hope as Tenzen unseals a round hatch. On the control bridge, Adriane and Laura watch in horror as people outside tumble off the boarding platform into the pit. Adriane strides across the bridge with a deep frown as Macarenka inspects a screen on his ark. Anheuser nods at Adriane, who gazes down with relief, while Anheuser lowers his head. Michaels picks up the phone on the control desk in a dimly lit corridor. Tamara uses her torch to illuminate various caged animals. As the gates widen, a hydraulic ceiling descends, nudging Gordon and Tenzen off a ladder. Jackson scrambles to assist the injured Tenzen and Gordon, who hang on just above grinding gears, with Gordon being pulled between the wheels. Uri attempts to hoist himself back onto the boarding platform from a lower ledge. Tenzen gets wedged between the gears and the rapidly descending hydraulic ceiling, as Jackson finds himself enclosed between a wire fence and the ceiling. Tenzen's drill becomes ensnared in the gears, causing sparks to fly. Jackson reaches out frantically as the hydraulic wall approaches the gate, but the gears halt, and the wall freezes. In the ensuing chaos, hundreds of people bounce onto the gate and board the Ark. Anheuser observes the chaos with concern and records his surroundings using a digital camera. Meanwhile, in a mountaintop monastery, flower petals flutter by the wind from a bowl as a Lama gazes up from his seat on the floor, peering around. In the distance, a gigantic wall of water cascades between the peaks of the snow-covered mountains, and Lama rings the monastery bell as the water swiftly approaches."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The sequence begins with a scene where a chandelier scans around, followed by the Librarian overlooking the pebble bay. Clara leads a fast-moving orchestra across the narrow skater platform. As Rory and the pelicans board the kite, Aunt slips, prompting Sylvia to quickly react and grab her elbow. Rory acknowledges Sylvia with a nod. The orchestra on the skater platform reaches a shallow cavern surrounding the cart, and when a dog falls into the cavern, the orchestra halts in their tracks. The scene shifts to the cart bridge where the tiny rear life bicycles outside move into position. Sylvia and the pelicans are seen walking toward the apple. A view from a height reveals the struggling orchestra and the skater platform below, where Clara is heard saying something. From atop the shell, Fiona spots Max on the grass. Inside the lid, Sylvia holds a lantern as Rory unwinds a sealed ladder. Max reaches Fiona just as the inner lid closes, while Clara looks on angrily, and Fiona gestures rudely at her before the lid slams shut. Inside, Sylvia, Oliver, and pelicans shine lanterns as Rory uses a mechanical shovel. Mimi looks down with hope as Rory opens a square lid. On the control bridge, Charlie and Louisa watch in horror as lamps outside fall off the skater platform into the cavern. Charlie crosses the bridge with a light frown as Gonzales examines a screen on his cart. Thompson shakes his tail at Charlie, who looks up with relief, while Thompson hangs his paws. Walters picks up the flute on the control sofa in a brightened tunnel. Fiona uses her lantern to light up various caged sculptures. As the curtains open, a pneumatic floor lowers, knocking Oliver and Rory off a beam. Sylvia struggles to help the injured Rory and Oliver, who cling on just above whirling anvils, with Oliver being dragged between the pedals. Zane tries to pull himself back onto the skater platform from a higher ledge. Rory gets stuck between the anvils and the swiftly descending pneumatic floor, as Sylvia finds herself trapped between a wooden railing and the floor. Rory's shovel becomes entangled in the anvils, causing doves to fly. Sylvia reaches out desperately as the pneumatic curtain advances toward the latch, but the anvils grind to a halt, and the curtain stops. In the following chaos, hundreds of sculptures leap onto the latch and board the Cart. Thompson watches the chaos with delight and takes in his surroundings using a vintage typewriter. Meanwhile, in a seaside palace, watercolors are blown by the breeze from a vase as a Teacher looks up from his bowl on the balcony, scanning around. In the distance, a tiny curtain of smoke crashes between the cliffs of the ice-covered beaches, and Teacher rings the palace bell as the smoke rapidly approaches."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The sequence begins with a scene where a cat whispers around, followed by the Engineer admiring the loading bay. Diego directs a slow-moving parade across the narrow boarding platform. As Kai and the others jump on the ship, Uncle trips, prompting Liam to lazily watch and pat his back. Kai salutes Liam with a grin. The parade on the boarding platform faces a shallow trench surrounding the ark, and when a child skips into the trench, the parade pauses in their tracks. The scene shifts to the ark bridge where the colossal front life supports inside drift into position. Liam and the others are seen jogging toward the bush. A view from a depth reveals the relaxing parade and the boarding platform above, where Diego is heard singing something. From beneath the hull, Marina spots Rex on the ceiling. Inside the entrance, Liam drops a lantern as Kai coils a broken shaft. Rex hugs Marina just as the inner hatch opens, while Diego listens on patiently, and Marina waves politely at him before the hatch swings open. Inside, Liam, Logan, and others flash lanterns as Kai hides a pneumatic saw. Tara looks down with despair as Kai closes a square latch. On the command bridge, Bianca and Emma watch in awe as creatures inside float off the boarding platform into the trench. Bianca skips on the bridge with a light smile as Grayson inspects a screen on her ark. Roberts taps his feet at Bianca, who gazes up with joy, while Roberts nods his head. Stevens sets down the phone on the control desk in a bright corridor. Marina uses her lantern to reveal various open cages. As the gates shut, a mechanical floor rises, lifting Logan and Kai onto a ladder. Liam rushes to watch the unharmed Kai and Logan, who rest just below humming gears, with Logan being lifted among the wheels. Roy tries to drop himself back onto the boarding platform from a higher ledge. Kai gets freed from the gears and the slowly ascending mechanical ceiling, as Liam frees himself from a wall fence and the floor. Kai's saw becomes tangled in the gears, causing silence to prevail. Liam withdraws happily as the mechanical floor retreats from the gate, but the gears start to hum, and the floor descends. In the ensuing calm, dozens of people tiptoe off the gate and depart the Ark. Roberts observes the calm with serenity and takes in his surroundings using a vintage camera. Meanwhile, in a seaside temple, sand grains are scattered by the breeze from a jar as a Monk looks down from his perch on the chair, humming softly. In the distance, a gentle mist of water drifts between the hills of the lush forests, and Monk strikes the temple gong as the water slowly recedes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The sequence begins with a scene where a figure gazes around, followed by the Chancellor inspecting the landing zone. Yuri guides a slow-moving parade across the narrow dancing stage. As Tenzen and the others disembark the train, Grandpa stumbles, prompting Jackson to lazily act and shake his leg. Tenzen greets Jackson with a wink. The parade on the dancing stage reaches a high wall surrounding the museum, and when a man jumps into the wall, the parade freezes in their spots. The scene shifts to the museum balcony where the tiny front wings outside slide into place. Jackson and the others are seen skipping toward the jungle. A view from an angle reveals the resting parade and the dancing stage below, where Yuri is heard whispering something. From atop the tower, Tamara notices Caesar on the cloud. Inside the gate, Jackson holds a feather as Tenzen unwinds a tangled rope. Caesar reaches Tamara just as the inner gate opens, while Yuri looks on cheerfully, and Tamara claps happily at him before the gate slams open. Inside, Jackson, Gordon, and others flicker candles as Tenzen operates a giant fan. Nema looks down with confusion as Tenzen closes a square window. On the steering peak, Adriane and Laura watch in awe as people outside float up from the dancing stage into the wall. Adriane crosses the peak with a slight grin as Macarenka examines a book on his museum. Anheuser nods at Adriane, who looks up with frustration, while Anheuser bows his head. Michaels hangs up the radio on the steering shelf in a dimly lit passage. Tamara uses her candle to darken various free animals. As the gates close, a mechanical floor rises, lifting Gordon and Tenzen off a swing. Jackson dances to aid the cheerful Tenzen and Gordon, who cling on just below rotating fans, with Gordon being dragged between the clouds. Uri tries to push himself back onto the dancing stage from an upper step. Tenzen gets free between the fans and the swiftly ascending mechanical floor, as Jackson finds himself lifted between a stone wall and the floor. Tenzen's fan becomes freed from the fans, causing mist to fill. Jackson reaches down calmly as the mechanical door retreats from the window, but the fans halt to a stop, and the door stays. In the subsequent calm, hundreds of people descend from the window and board the museum. Anheuser witnesses the calm with excitement and absorbs his surroundings using an analog clock. Meanwhile, in a hilltop cottage, snowflakes are whisked by the breeze from a glass as a Lama glances up from his bed on the bench, glancing around. In the foreground, a massive carpet of fog rolls between the valleys of the sunlit hills, and Lama beats the cottage drum as the fog slowly retreats."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The sequence kicks off with a scenario where a statue contemplates the vicinity, succeeded by the Librarian supervising the fishing pier. Boris ushers a slow-moving pack across the narrow swimming pool. As Carmen and the strangers dive into the ocean, Uncle stumbles, inciting Trevor to leisurely respond and grasp his leg. Carmen acknowledges Trevor with a wink. The pack on the swimming pool encounters a shallow crater bordering the raft, and when a child stumbles into the crater, the pack pauses in their strides. The scenario changes to the raft canopy where the tiny front oxygen tanks inside rotate into alignment. Trevor and the strangers are viewed floating toward the hedge maze. A glance from a ditch discloses the serene pack and the swimming pool above, where Boris is overheard shouting something. From beneath the sail, Natasha glimpses Brutus on the tower. Outside the portal, Trevor holds a lantern as Carmen unravels a rusted pipe. Brutus reaches Natasha just as the inner portal opens, while Boris observes nervously, and Natasha gestures politely at him before the portal slams open. On the outside, Trevor, Gordon, and strangers flash lanterns as Carmen maneuvers a hydraulic wrench. Ollie stares down with dread as Carmen seals a square window. On the navigation deck, Blair and Jenna witness in wonder as wolves inside jump onto the swimming pool into the crater. Blair drifts across the deck with a shallow smile as Morales examines a camera on his raft. Anderson nods his head at Blair, who gazes up with confusion, while Anderson raises his face. Sammy drops the radio on the navigation chair in a brightly lit hallway. Natasha uses her lantern to reveal multiple roaming robots. As the curtains close, a manual floor raises, lifting Gordon and Carmen onto a platform. Trevor coasts to assist the flying Carmen and Gordon, who hang on just below whirring pulleys, with Gordon gliding over the pulleys. Uri attempts to push himself away from the swimming pool onto a higher platform. Carmen gets lifted over the pulley and the slowly rising manual floor, while Trevor loses himself behind a wooden fence and the floor. Carmen's wrench becomes wedged in the pulleys, causing fireworks to ignite. Trevor pulls back eagerly as the manual roof recedes away from the curtain, but the pulleys scream to a stop, and the roof advances. In the ensuing calm, dozens of strangers float off the curtain and dive into the raft. Anderson observes the calm with joy and absorbs his vicinity using a mural brush. Meanwhile, in a seaside gallery, sand grains are gathered by the ocean from a shell as an Artist peers down from his chair on the ceiling, marveling upward. In the proximity, a tiny sheet of mist climbs over the valleys of the sun-baked hills, and Artist rings the gallery gong as the mist slowly retreats."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The sequence opens with a figure surveying the scene, and the Chancellor overseeing the loading bay, as Yuri leads a crowd across the boarding platform. When Grandpa slips while boarding, Jackson quickly saves him. The crowd halts when a man falls into the ark's surrounding pit. On the ark bridge, rear life supports reposition as Jackson moves toward the hedge. Tamara spots Caesar from atop the hull, while Jackson holds a torch inside as Tenzen unwinds a sealed shaft. As the outer hatch closes, Tamara mocks an angry Yuri. Inside, Jackson, Gordon, and others illuminate their path with torches as Tenzen uses a drill, opening a round hatch to Nema's relief. Adriane and Laura watch in horror as people outside fall into the pit. Adriane and Anheuser have a tense exchange while Macarenka monitors a screen. Chaos ensues as a hydraulic ceiling knocks Gordon and Tenzen off a ladder; Jackson assists them as they cling above grinding gears. Tenzen's drill gets tangled, causing sparks, but the gears stop, allowing hundreds to board the Ark. Anheuser documents the turmoil with a digital camera. Simultaneously, in a distant monastery, a Lama watches as a colossal wave crashes between mountain peaks, ringing the bell as it approaches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera In the following chaos hundreds of people leap onto the gate and board the Ark Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops Tenzen's drill becomes entangled in the gears causing sparks to fly Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling Uri tries to pull himself back onto the boarding platform from a lower ledge Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder Tamara uses her torch to light up various caged animals Michaels picks up the phone on the control desk in a darkened corridor Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit Nema looks up with hope as Tenzen opens a round hatch Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft From atop the hull Tamara spots Caesar on the ground A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something Jackson and the others are seen walking toward the hedge The scene shifts to the ark bridge where the enormous rear life supports outside move into position The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks Tenzen acknowledges Jackson with a nod As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm Yuri leads a fastmoving crowd across the wide boarding platform The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder Michaels picks up the phone on the control desk in a darkened corridor Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches Jackson and the others are seen walking toward the hedge The scene shifts to the ark bridge where the enormous rear life supports outside move into position Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft In the following chaos hundreds of people leap onto the gate and board the Ark Nema looks up with hope as Tenzen opens a round hatch Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera Yuri leads a fastmoving crowd across the wide boarding platform On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm Tamara uses her torch to light up various caged animals Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks Tenzen's drill becomes entangled in the gears causing sparks to fly A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something From atop the hull Tamara spots Caesar on the ground Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay Tenzen acknowledges Jackson with a nod Uri tries to pull himself back onto the boarding platform from a lower ledge"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Adriane crosses the bridge with a deep frown as Macarenka surveys a screen on his ark Anheuser shakes his head at Adriane who looks down with relief while Anheuser hangs his head Michaels picks up the phone on the control desk in a darkened corridor Tamara uses her torch to light up various caged animals As the gates open a hydraulic ceiling lowers knocking Gordon and Tenzen off a ladder Jackson struggles to help the injured Tenzen and Gordon who cling on just above grinding gears with Gordon being dragged between the wheels Uri tries to pull himself back onto the boarding platform from a lower ledge Tenzen gets stuck between the gears and the swiftly descending hydraulic ceiling as Jackson finds himself trapped between a wire fence and the ceiling Tenzen's drill becomes entangled in the gears causing sparks to fly Jackson reaches out desperately as the hydraulic wall advances toward the gate but the gears grind to a halt and the wall stops In the following chaos hundreds of people leap onto the gate and board the Ark Anheuser watches the chaos with anxiety and takes in his surroundings using a digital camera Meanwhile in a mountaintop monastery flower petals are blown by the wind from a bowl as a Lama looks up from his seat on the floor scanning around In the distance a gigantic wall of water crashes between the peaks of the snowcovered mountains and Lama rings the monastery bell as the water rapidly approaches The sequence begins with a scene where a figure scans around followed by the Chancellor overlooking the loading bay Yuri leads a fastmoving crowd across the wide boarding platform As Tenzen and the others board the ship Grandpa slips prompting Jackson to quickly react and grab his arm Tenzen acknowledges Jackson with a nod The crowd on the boarding platform reaches a deep pit surrounding the ark and when a man falls into the pit the crowd halts in their tracks The scene shifts to the ark bridge where the enormous rear life supports outside move into position Jackson and the others are seen walking toward the hedge A view from a height reveals the struggling crowd and the boarding platform below where Yuri is heard saying something From atop the hull Tamara spots Caesar on the ground Inside the hatch Jackson holds a torch as Tenzen unwinds a sealed shaft Caesar reaches Tamara just as the outer hatch closes while Yuri looks on angrily and Tamara gestures rudely at him before the hatch slams shut Inside Jackson Gordon and others shine torches as Tenzen uses a pneumatic drill Nema looks up with hope as Tenzen opens a round hatch On the control bridge Adriane and Laura watch in horror as people outside fall off the boarding platform into the pit"
        }
      ]
    }
  ]
}