{
  "ground_truth": "Outside, the crowd panics as the amazing edifice of Saint Peter's, with its huge dome, keels forward and crashes into the square. On Air Force One, Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. Adrian's father Harry plays the piano and drinks. Kearney watches TV with others in the galley as Harry enters. Tony, dazed, gets to his feet and wanders aimlessly towards him. The trolley with the television on it and other filled trolleys start to roll as the ship vibrates. Harry moves towards a door and hangs onto a handle while Tony clings to a table. As the ship lists, the table is torn and personnel slide down the slope. Tony loses his grasp and slithers along the floor away from Harry, who still clings to the hammock. Harry pulls himself onto the deck as the ship lists, facing the black night sky. The ship keels over to the starboard side and completes a hundred and eighty-degree turn as waves wash off. In Washington, a white sheet flutters in the breeze, with a wheel turning and not much movement elsewhere. President Wilson looks up, hearing the noise of water as it swells up the tarmac from Chesapeake Bay, thundering towards the city. A wave brings a large aircraft carrier that buries the White House. On the Antinov, Jackson fiddles with a radio in the loading bay as Kate, in a parka, joins him. She opens the passenger door, settles beside him, and they exchange glances. She gazes out of the windscreen, takes her hand to her cheek while Jackson inclines his head and stares at the radio. On Air Force One, Anheuser walks over to the screen, they turn to Professor West. In the Antinov cockpit, Jackson and Yuri climb down the steps, leaving Gordon with Sasha. In the cargo hold, Jackson hands Yuri life jackets, leans on the steps, and looks at his sleeping family. Jackson wearily removes a life jacket as his son Noah wakes and looks over at him. Surprised, Jackson stares at Noah, lowers his gaze, nods, and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Outside, the throng panics as the astonishing structure of Saint Peter's, with its enormous dome, tilts forward and collapses into the plaza. On Air Force One, Scotty examines a display as the projected tsunami is dispersed across the seas of the globe. The vessel is still upright on the tempestuous sea. Adrian's father Harry performs on the piano and imbibes. Kearney watches television with others in the galley as Harry enters. Tony, bewildered, rises to his feet and roams aimlessly towards him. The cart with the television on it and other loaded carts begin to roll as the ship vibrates. Harry moves towards a portal and grips a handle while Tony clings to a table. As the ship lists, the table is ripped away and personnel slide down the slope. Tony loses his grip and slides along the floor away from Harry, who still clings to the hammock. Harry pulls himself onto the deck as the ship lists, facing the black nocturnal sky. The ship capsizes to the starboard side and completes a hundred and eighty-degree turn as waves wash off. In Washington, a white sheet flutters in the breeze, with a wheel turning and not much motion elsewhere. President Wilson looks up, hearing the clamor of water as it surges up the tarmac from Chesapeake Bay, thundering towards the metropolis. A wave brings a large warship that buries the White House. On the Antinov, Jackson fiddles with a radio in the loading bay as Kate, in a parka, joins him. She opens the passenger door, settles beside him, and they exchange looks. She gazes out of the windscreen, takes her hand to her cheek while Jackson inclines his head and stares at the radio. On Air Force One, Anheuser strides over to the screen, they turn to Professor West. In the Antinov cockpit, Jackson and Yuri descend the steps, leaving Gordon with Sasha. In the cargo hold, Jackson hands Yuri life vests, leans on the steps, and looks at his slumbering family. Jackson wearily removes a life vest as his son Noah awakens and looks over at him. Astonished, Jackson stares at Noah, lowers his gaze, nods, and they embrace. Kate awakens as the Karpovs put on life vests and the plane descends rapidly. The Curtis children also have their life vests on."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Outside, panic is felt by the crowd as the amazing edifice of Saint Peter's, with its huge dome, is keeled forward and crashed into the square. On Air Force One, a screen is studied by Scotty as the projective tsunami spreads across the oceans of the world. The turbulent ocean keeps the boat upright. The piano is played and drinks are consumed by Adrian's father Harry. The TV is watched by Kearney with others in the galley as Harry enters. Tony, dazed, gets to his feet and wanders aimlessly towards him. The trolley with the television on it and other filled trolleys start to roll as the ship vibrates. A door is approached by Harry, and a handle is hung onto by him while Tony clings to a table. As the ship lists, the table is torn, and personnel slide down the slope. Tony loses his grasp and slithers along the floor away from Harry, who still clings to the hammock. The deck is pulled onto by Harry as the ship lists, facing the black night sky. The starboard side sees the ship keel over and complete a hundred and eighty-degree turn as waves wash off. In Washington, a white sheet is fluttered in the breeze, a wheel turns, and not much movement is seen elsewhere. The noise of water is heard by President Wilson, swelling up the tarmac from Chesapeake Bay, thundering towards the city. A large aircraft carrier is brought by a wave and the White House is buried. On the Antinov, a radio is fiddled with by Jackson in the loading bay as Kate, in a parka, joins him. The passenger door is opened by her, she settles beside him, and they exchange glances. She gazes out of the windscreen, takes her hand to her cheek while Jackson inclines his head and stares at the radio. On Air Force One, the screen is approached by Anheuser, and they turn to Professor West. In the Antinov cockpit, down the steps climb Jackson and Yuri, leaving Gordon with Sasha. In the cargo hold, Yuri is handed life jackets by Jackson, who leans on the steps and looks at his sleeping family. A life jacket is wearily removed by Jackson as his son Noah wakes and looks over at him. Surprised, Jackson stares at Noah, lowers his gaze, nods, and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children already have their life jackets on."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Outside, the panicked crowd watches as Saint Peter's, with its massive dome, collapses into the square. On Air Force One, Scotty observes a screen showing a projected tsunami across global oceans. The boat remains upright on turbulent seas. Adrian's father, Harry, plays the piano and drinks while Kearney and others watch TV in the galley. Tony, dazed, stands and wanders toward him. Vibrations make trolleys roll, and as the ship lists, tables are torn away, causing personnel to slide. Tony slips away from Harry, who clings to a handle. Harry pulls himself onto the deck, facing the night sky. The ship keels starboard, completing a 180-degree turn amid waves. In Washington, President Wilson notices water swelling up the tarmac from Chesapeake Bay, thundering toward the city as a wave crashes into the White House. On the Antinov, Jackson fiddles with a radio, joined by Kate. She settles beside him, gazing out the windscreen, while Jackson focuses on the radio. On Air Force One, Anheuser turns to Professor West. In the Antinov cockpit, Jackson and Yuri descend the steps, leaving Gordon with Sasha. Jackson hands Yuri life jackets and looks at his sleeping family. Upon waking, his son Noah surprises Jackson, and they hug. Kate wakes as the Karpovs and Curtis children put on life jackets, with the plane rapidly descending."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Outside, the crowd panics as Saint Peter's dome crashes into the square. On Air Force One, Scotty watches a projected tsunami spread worldwide. The boat remains upright on the turbulent ocean. Adrian's father Harry drinks and plays piano, while Kearney and others watch TV. Dazed, Tony stands and approaches Harry as trolleys roll with the ship's vibration. Harry clings to a handle; Tony to a table. As the ship lists, personnel slide down the slope. Tony loses his grip, sliding away from Harry, who clings to the hammock. Harry reaches the deck as the ship keels over, completing a 180-degree turn in waves. In Washington, President Wilson hears water flooding from Chesapeake Bay, a wave burying the White House. On the Antinov, Jackson and Kate exchange glances. Jackson fiddles with a radio; Kate sits beside him. On Air Force One, Anheuser turns to Professor West. In the Antinov, Jackson gives Yuri life jackets, looks at his sleeping family. Noah wakes, they hug. Kate wakes as the plane descends rapidly. The Curtis children wear life jackets."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Outside, the chaotic crowd is overtaken by panic as the magnificent and awe-inspiring edifice of Saint Peter's, with its enormous and iconic dome, ominously keels forward and dramatically crashes into the bustling square below. Meanwhile, aboard Air Force One, Scotty intently studies a screen displaying the expansive path of the approaching tsunami, which is projected to spread relentlessly across the vast oceans of the world. Amidst the chaos, the boat remains precariously upright on the violently turbulent ocean waters. Adrian's father, Harry, sits calmly playing the piano, sipping his drink, adding an air of incongruous tranquility to the scene. In another part of the vessel, Kearney is watching TV in the company of others gathered in the galley as Harry makes his entrance. Tony, appearing dazed and disoriented, slowly rises to his feet and begins to wander aimlessly in Harry's direction. A trolley, precariously balanced with the television on it, alongside other trolleys filled to the brim, starts to roll as the entire ship vibrates with increasing intensity. Harry moves with determination towards a nearby door, gripping a handle for stability, while Tony desperately clings to a table for support. As the ship dramatically lists, the sturdy table is ripped from its position, causing personnel to slide helplessly down the steeply angled slope. Tony loses his grip and slides uncontrollably across the floor, moving away from Harry, who manages to maintain his grip on the hammock despite the chaos. With effort, Harry pulls himself onto the deck, facing the ominous, pitch-black night sky. The ship keels over dramatically to the starboard side, completing a full one-hundred-and-eighty-degree turn as massive waves wash over it. Back in Washington, a crisp, white sheet flutters in the breeze, with a wheel turning while very little else seems to move. President Wilson lifts his gaze as he hears the roaring noise of water swelling up the tarmac from the Chesapeake Bay, thundering ominously towards the city. A massive wave carries a large aircraft carrier that collides with and effectively buries the White House. Aboard the Antinov, Jackson is occupied with fiddling with a radio in the somewhat cramped loading bay when Kate, dressed warmly in a parka, joins him. She opens the passenger door, settles in right beside him, and they exchange knowing glances. She gazes pensively out through the windscreen, bringing her hand thoughtfully to her cheek, while Jackson inclines his head slightly and concentrates on the radio. Back on Air Force One, Anheuser strides purposefully over to the screen, and they collectively turn their attention to Professor West. In the cockpit of the Antinov, Jackson and Yuri descend the steps, leaving Gordon behind with Sasha. In the cargo hold, Jackson hands Yuri life jackets, then leans wearily on the steps, casting a glance toward his peacefully sleeping family. Jackson, looking exhausted, removes a life jacket just as his son Noah awakes and looks over at him. Surprised, Jackson meets Noah's gaze, lowers his eyes, nods, and they share an emotional embrace. Kate wakes as the Karpovs hurriedly put on their life jackets, and the plane descends with alarming rapidity. The Curtis children are also prepared, with their life jackets securely on."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Outside, the chaotic and tumultuous crowd is completely overtaken by unbridled panic as the magnificent and awe-inspiring architectural wonder of Saint Peter's, with its enormous, colossal, and iconic dome, ominously keels forward and dramatically crashes with a thunderous roar into the bustling square located just below it. Meanwhile, aboard the sophisticated Air Force One, Scotty is intently studying a screen that displays the expansive and daunting path of the approaching tsunami, which is projected to spread relentlessly and inexorably across the vast, endless oceans of the world. Amidst all the chaos and turmoil, the boat somehow remains precariously upright on the violently turbulent and churning ocean waters. Adrian's father, Harry, sits calmly and composed, playing the piano and sipping his drink, adding an air of incongruous tranquility and serenity to the scene. In another part of the same vessel, Kearney is watching TV, surrounded by others gathered together in the galley as Harry eventually makes his entrance. Tony, appearing dazed, confused, and disoriented, slowly rises unsteadily to his feet and begins to wander aimlessly and without purpose in Harry's direction. A trolley, precariously balanced with a television set on it, alongside other trolleys that are filled to the brim, starts to roll as the entire ship begins to vibrate with increasing intensity. Harry moves with determination and intent towards a nearby door, gripping a handle firmly for stability, while Tony desperately clings to a table for support. As the ship dramatically lists, the sturdy table is ripped abruptly from its position, causing personnel to slide helplessly down the steeply angled slope. Tony loses his grip and slides uncontrollably across the floor, moving further away from Harry, who, despite the chaos, manages to maintain his grip on the hammock. With great effort, Harry pulls himself up onto the deck, where he faces the ominous, pitch-black night sky. The ship then keels over dramatically to the starboard side, completing a full one-hundred-and-eighty-degree turn as massive waves wash over it. Back in Washington, a crisp, white sheet flutters lightly in the breeze, with a wheel turning while very little else seems to move. President Wilson lifts his gaze as he hears the roaring, tumultuous noise of water swelling up the tarmac from the Chesapeake Bay, thundering ominously towards the city. A massive wave carries a large aircraft carrier that collides with and effectively buries the White House. Aboard the Antinov, Jackson is deeply occupied with fiddling with a radio in the somewhat cramped loading bay when Kate, dressed warmly in a parka, joins him. She opens the passenger door, settles in comfortably right beside him, and they exchange knowing glances. She gazes pensively and thoughtfully out through the windscreen, bringing her hand thoughtfully to her cheek, while Jackson inclines his head slightly and concentrates intently on the radio. Back on Air Force One, Anheuser strides purposefully and confidently over to the screen, and they collectively turn their attention to Professor West. In the cockpit of the Antinov, Jackson and Yuri descend the steps, leaving Gordon behind with Sasha. In the cargo hold, Jackson hands Yuri life jackets, then leans wearily on the steps, casting a glance toward his peacefully sleeping family. Jackson, looking exhausted and spent, removes a life jacket just as his son Noah awakes and looks over at him. Surprised, Jackson meets Noah's gaze, lowers his eyes thoughtfully, nods, and they share an emotional embrace. Kate wakes as the Karpovs hurriedly put on their life jackets, and the plane descends with alarming rapidity. The Curtis children are also prepared, with their life jackets securely on."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Outside, as the crowd finds themselves engulfed in panic, their eyes widen in horror when the magnificent structure of Saint Peter's, dominated by its towering dome, teeters forward precariously before plummeting into the square with an earth-shaking crash. Meanwhile, on Air Force One, Scotty is intensely focused, his eyes carefully scanning a digital screen that vividly displays the potential spread of a massive tsunami across the world's oceans. Amid the chaos, a boat, struggling to maintain its balance, remains upright as it navigates the turbulent waters. Inside, Adrian's father, Harry, sits at a piano, his fingers deftly playing the keys while intermittently raising a drink to his lips. In the galley, Kearney, along with several others, is engrossed in watching television when Harry makes his entrance. Tony, appearing dazed and disoriented, manages to stand and begins to wander aimlessly in Harry's direction. As the ship continues to vibrate, trolleys including one with a television perched on top begin to roll precariously. Seizing a moment of clarity, Harry moves towards a door, gripping a handle tightly for stability, while Tony attempts to steady himself by clinging to a nearby table. The ship then begins to list; the angle is sharp, causing the table to tear away and sending personnel sliding helplessly down the incline. Tony loses his grip and slides along the floor, distancing himself from Harry, who remains clinging to the hammock with steadfast determination. As the ship lists further, Harry pulls himself onto the deck, confronted by the expanse of the black night sky. The vessel dramatically keels over on its starboard side, completing a full hundred and eighty-degree turn as relentless waves cascade over it. Concurrently, in Washington, a lone white sheet flutters gently in the breeze while a wheel turns slowly; the scene is eerily still with minimal activity. President Wilson, attending to the urgent matters at hand, suddenly looks up, his attention drawn to the ominous sound of water as it surges over the tarmac from Chesapeake Bay, barrelling towards the city with unstoppable force. In its wake, a colossal wave propels an aircraft carrier into the heart of the city, where it comes to rest, engulfing the White House. In another part of the world, aboard the Antinov, Jackson fiddles with a radio in the loading bay, absorbed in the task, when Kate, donned in a warm parka, joins him. She opens the passenger door, slides into the seat beside Jackson, and they share a meaningful glance. She diverts her gaze, looking out through the windscreen and raising her hand to her cheek in contemplation while Jackson tilts his head, his eyes fixed intently on the radio. Back on Air Force One, Anheuser approaches the screen, and both he and Scotty turn their attention to Professor West. Meanwhile, in the Antinov's cockpit, Jackson and Yuri descend the steps and leave Gordon with Sasha in the cockpit. In the cargo hold, Jackson hands life jackets to Yuri, leans casually against the steps, and casts a tender glance at his sleeping family. As Jackson prepares to remove a life jacket, his son Noah stirs, waking up to find his father gazing at him with a look of surprise. They share a moment of connection as Jackson lowers his gaze, gives a nod of understanding, and they embrace warmly. As the plane descends rapidly, Kate awakens to see the Karpovs donning life jackets, and meanwhile, the Curtis children are also securely clad in their life jackets, ready to face whatever comes next."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Outside, as the Saint Peter's dome collapses into the square, panic spreads through the crowd. Meanwhile, aboard Air Force One, Scotty monitors the projected tsunami affecting global oceans. On a turbulent ocean, the boat remains upright as Adrian's father Harry plays piano and drinks. In the galley, Kearney watches TV with others when Harry enters, followed by a dazed Tony. The ship vibrates, causing trolleys and a TV to roll, as Harry grabs a door handle and Tony clings to a table. As the ship lists, Tony loses his grip and slides away from Harry, who manages to pull himself onto the deck. The ship then keels over, completing a turn as waves engulf it. In Washington, President Wilson notices the rising water from Chesapeake Bay that soon swallows the White House. On the Antinov, Jackson and Kate interact over the radio as they sit beside each other. As Anheuser consults with Professor West on Air Force One, Jackson and Yuri descend from the Antinov cockpit, leaving Gordon with Sasha. In the cargo hold, Jackson hands out life jackets, exchanges a surprised embrace with his son Noah, and observes his sleeping family. Kate awakens as the Karpovs don life jackets, with the plane descending rapidly, and the Curtis children also prepared with their life jackets."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Outside, the crowd panics as the amazing edifice of Saint Peter's, a Renaissance masterpiece located in Vatican City known for its grand architecture and symbolic importance, with its huge dome, keels forward and crashes into the square. On Air Force One, the official aircraft of the U.S. President designed for long-haul flights and secure communication, Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean, which is known to be particularly perilous during natural disasters. Adrian's father Harry plays the piano and drinks, perhaps to calm his nerves in this tense situation. Kearney watches TV with others in the galley, the ship's kitchen area often used as a gathering place, as Harry enters. Tony, dazed by the chaos around him, gets to his feet and wanders aimlessly towards him. The trolley with the television on it, a standard feature for in-flight entertainment, and other filled trolleys start to roll as the ship vibrates. Harry moves towards a door and hangs onto a handle while Tony clings to a table, both trying to stabilize themselves. As the ship lists, the table is torn and personnel slide down the slope, indicative of the ship's severe tilt. Tony loses his grasp and slithers along the floor away from Harry, who still clings to the hammock, a makeshift safety net. Harry pulls himself onto the deck as the ship lists, facing the black night sky, where stars might normally be visible. The ship keels over to the starboard side and completes a hundred and eighty-degree turn as waves wash off, showing the immense power of the ocean. In Washington, a white sheet, perhaps a metaphor for a flag of surrender, flutters in the breeze, with a wheel turning and not much movement elsewhere. President Wilson, a fictional leader amidst this chaos, looks up, hearing the noise of water as it swells up the tarmac from Chesapeake Bay, a large estuary bordering the state, thundering towards the city. A wave brings a large aircraft carrier, one of the largest ships in a naval fleet, that buries the White House. On the Antinov, a massive cargo aircraft known for its capacity to transport heavy loads, Jackson fiddles with a radio in the loading bay as Kate, in a parka suitable for cold environments, joins him. She opens the passenger door, settles beside him, and they exchange glances, communicating silently. She gazes out of the windscreen, takes her hand to her cheek while Jackson inclines his head and stares at the radio, perhaps attempting to catch a critical transmission. On Air Force One, Anheuser walks over to the screen, they turn to Professor West, a fictional expert likely providing critical analysis. In the Antinov cockpit, Jackson and Yuri climb down the steps, leaving Gordon with Sasha, possibly coordinating their next move. In the cargo hold, Jackson hands Yuri life jackets, essential safety devices in case of an emergency, leans on the steps, and looks at his sleeping family, a poignant reminder of what he is trying to protect. Jackson wearily removes a life jacket as his son Noah wakes and looks over at him, creating a moment of connection. Surprised, Jackson stares at Noah, lowers his gaze, nods, and they hug, sharing a silent understanding. Kate wakes as the Karpovs, a family possibly fleeing disaster, put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on, preparing for whatever might come next."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She opens the passenger door settles beside him and they exchange glances Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square Jackson wearily removes a life jacket as his son Noah wakes and looks over at him On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world they turn to Professor West The boat is still upright on the turbulent ocean Adrian's father Harry plays the piano and drinks Adrian's father Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square The boat is still upright on the turbulent ocean Kearney watches TV with others in the galley as Harry enters Tony dazed gets to his feet and wanders aimlessly towards him The trolley with the television on it and other filled trolleys start to roll as the ship vibrates Harry moves towards a door and hangs onto a handle while Tony clings to a table Harry moves towards a door and hangs onto a handle while Tony clings to a table Yuri life jackets leans on the steps and looks at his sleeping family Noah lowers his gaze nods and they hug As the ship lists the table is torn and personnel slide down the slope Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock Kate wakes as the Karpovs put on life jackets and the plane descends rapidly Harry pulls himself onto the deck as the ship lists facing the black night sky On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city A wave brings a large aircraft carrier that buries the White House On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him She opens the passenger door settles beside him and they exchange glances In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio On Air Force One Anheuser walks over to the screen they turn to Professor West The trolley with the television on it and other filled trolleys start to roll as the ship vibrates Harry plays the piano and drinks In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands Yuri life jackets leans on the steps and looks at his sleeping family Jackson wearily removes a life jacket as his son Noah wakes and looks over at him Surprised Jackson stares at Noah lowers his gaze nods and they hug Kate wakes as the Karpovs put on life jackets and the plane descends rapidly The Curtis children also have their life jackets on"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square. On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. Adrian's father. Harry plays the piano and drinks. Kearney watches TV with others in the galley as Harry enters. Tony dazed gets to his feet and wanders aimlessly towards him. The trolley with the television on it and other filled trolleys start to roll as the ship vibrates. Harry moves towards a door and hangs onto a handle while Tony clings to a table. As the ship lists the table is torn and personnel slide down the slope. Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock. Harry pulls himself onto the deck as the ship lists facing the black night sky. The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off. In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city. A wave brings a large aircraft carrier that buries the White House. On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him. She opens the passenger door settles beside him and they exchange glances. She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio. On Air Force One Anheuser walks over to the screen. they turn to Professor West. In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands. Yuri life jackets leans on the steps and looks at his sleeping family. Jackson wearily removes a life jacket as his son Noah wakes and looks over at him. Surprised Jackson stares at. Noah lowers his gaze nods and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square. On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. Adrian's father. Harry plays the piano and drinks. Kearney watches TV with others in the galley as Harry enters. Tony dazed gets to his feet and wanders aimlessly towards him. The trolley with the television on it and other filled trolleys start to roll as the ship vibrates. Harry moves towards a door and hangs onto a handle while Tony clings to a table. As the ship lists the table is torn and personnel slide down the slope. Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock. Harry pulls himself onto the deck as the ship lists facing the black night sky. The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off. In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city. A wave brings a large aircraft carrier that buries the White House. On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him. She opens the passenger door settles beside him and they exchange glances. She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio. On Air Force One Anheuser walks over to the screen. they turn to Professor West. In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands. Yuri life jackets leans on the steps and looks at his sleeping family. Jackson wearily removes a life jacket as his son Noah wakes and looks over at him. Surprised Jackson stares at. Noah lowers his gaze nods and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square. On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. Adrian's father. Harry plays the piano and drinks. Kearney watches TV with others in the galley as Harry enters. Tony dazed gets to his feet and wanders aimlessly towards him. In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands. Yuri life jackets leans on the steps and looks at his sleeping family. Jackson wearily removes a life jacket as his son Noah wakes and looks over at him. Surprised Jackson stares at. Noah lowers his gaze nods and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square. On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. Noah lowers his gaze nods and they hug. Kate wakes as the Karpovs put on life jackets and the plane descends rapidly. The Curtis children also have their life jackets on."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Outside, the dog panics as the amazing edifice of Saint Peter's, with its huge dome, keels forward and crashes into the square. On Air Force One, the rabbit studies a screen as the projective tsunami is spread across the oceans of the world. The boat is still upright on the turbulent ocean. A giraffe plays the piano and drinks. The parrot watches TV with others in the galley as the giraffe enters. An elephant, dazed, gets to its feet and wanders aimlessly towards the parrot. The trolley with the television on it and other filled trolleys start to roll as the ship vibrates. The giraffe moves towards a door and hangs onto a handle while the elephant clings to a table. As the ship lists, the table is torn and personnel slide down the slope. The elephant loses its grasp and slithers along the floor away from the giraffe, who still clings to the hammock. The giraffe pulls itself onto the deck as the ship lists, facing the black night sky. The ship keels over to the starboard side and completes a hundred and eighty-degree turn as waves wash off. In Washington, a cat flutters in the breeze, with a wheel turning and not much movement elsewhere. A penguin looks up, hearing the noise of water as it swells up the tarmac from Chesapeake Bay, thundering towards the city. A wave brings a large aircraft carrier that buries the White House. On the Antinov, a squirrel fiddles with a radio in the loading bay as a kangaroo, in a parka, joins it. The kangaroo opens the passenger door, settles beside the squirrel, and they exchange glances. The kangaroo gazes out of the windscreen, takes its hand to its cheek while the squirrel inclines its head and stares at the radio. On Air Force One, a meerkat walks over to the screen, they turn to a turtle. In the Antinov cockpit, the squirrel and a flamingo climb down the steps, leaving a platypus with a penguin. In the cargo hold, the squirrel hands the flamingo life jackets, leans on the steps, and looks at its sleeping family. The squirrel wearily removes a life jacket as its son, a chipmunk, wakes and looks over at the squirrel. Surprised, the squirrel stares at the chipmunk, lowers its gaze, nods, and they hug. The kangaroo wakes as the bears put on life jackets and the plane descends rapidly. The koala children also have their life jackets on."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Outside, the crowd panics as the magnificent tower of Buckingham Palace, with its enormous clock, leans forward and crashes into the park. On the Concorde, Scotty studies a monitor as the projective sandstorm spreads across the deserts of the continents. The submarine is still upright on the turbulent lake. Adrian's father Harry plays the violin and drinks. Kearney watches a movie with others in the library as Harry enters. Tony, dazed, gets to his feet and wanders aimlessly towards him. The cart with the computer on it and other filled carts start to roll as the train vibrates. Harry moves towards a window and hangs onto a curtain while Tony clings to a bench. As the train lists, the bench is torn and personnel slide down the incline. Tony loses his grasp and slithers along the floor away from Harry, who still clings to the ladder. Harry pulls himself onto the patio as the train lists, facing the blue day sky. The train keels over to the left side and completes a hundred and eighty-degree turn as leaves wash off. In Washington, a brown tarp flutters in the breeze, with a flag turning and not much movement elsewhere. President Wilson looks up, hearing the noise of wind as it sweeps up the pavement from Potomac River, thundering towards the city. A gust brings a large container ship that buries the Capitol Building. On the Hercules, Jackson fiddles with a compass in the storage bay as Kate, in a trench coat, joins him. She opens the glove compartment, settles beside him, and they exchange glances. She gazes out of the windshield, takes her hand to her cheek while Jackson inclines his head and stares at the compass. On the Concorde, Anheuser walks over to the monitor, they turn to Professor West. In the Hercules cockpit, Jackson and Yuri climb down the ladder, leaving Gordon with Sasha. In the cargo hold, Jackson hands Yuri parachutes, leans on the ladder, and looks at his sleeping family. Jackson wearily removes a parachute as his son Noah wakes and looks over at him. Surprised, Jackson stares at Noah, lowers his gaze, nods, and they hug. Kate wakes as the Murphys put on parachutes and the plane descends rapidly. The Curtis children also have their parachutes on."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Outside, the crowd cheers as the amazing edifice of Saint Peter's, with its huge dome, settles backward and rolls into the square. On Air Force One, Scotty ignores a screen as the projective tsunami meanders across the oceans of the world. The boat is still anchored on the tranquil ocean. Adrian's father Harry paints the piano and contemplates. Kearney writes poetry with others in the galley as Harry exits. Tony, dazed, crouches to his feet and marches determinedly towards him. The trolley with the television on it and other filled trolleys halt as the ship calms. Harry withdraws towards a door and releases a handle while Tony sits on a table. As the ship stabilizes, the table is assembled and personnel climb up the slope. Tony secures his grasp and crawls along the floor towards Harry, who now releases the hammock. Harry stretches himself onto the deck as the ship stabilizes, facing the bright morning sky. The ship straightens to the starboard side and completes a full circle as waves soothe on. In Washington, a white sheet drapes in the calm, with a wheel pausing and much movement elsewhere. President Wilson looks down, feeling the silence of water as it recedes from the tarmac of Chesapeake Bay, retreating from the city. A wave guides a large aircraft carrier that evacuates the White House. On the Antinov, Jackson examines a radio in the loading bay as Kate, in a parka, leaves him. She closes the passenger door, stands beside him, and they exchange laughter. She gazes out of the windscreen, places her hand on the seat while Jackson straightens his head and examines the radio. On Air Force One, Anheuser stands still at the screen, they ignore Professor West. In the Antinov cockpit, Jackson and Yuri ascend up the steps, joining Gordon with Sasha. In the cargo hold, Jackson throws Yuri life jackets, perches on the steps, and glances at his sleeping family. Jackson eagerly removes a life jacket as his son Noah dozes and peers over at him. Surprised, Jackson grins at Noah, raises his gaze, grins, and they high-five. Kate dozes as the Karpovs discard life jackets and the plane ascends gently. The Curtis children also discard their life jackets."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Outside, the river panics as the remarkable sculpture of Big Ben, with its enormous spire, keels forward and crashes into the garden. On the Orient Express, Benny studies a toaster as the imaginary hurricane is spread across the lakes of the planet. The bicycle is still upright on the choppy lake. Oliver's mother Sally plays the violin and sings. Jamie watches a movie with lions in the hallway as Sally enters. Bob, bewildered, gets to his knees and wanders aimlessly towards it. The bookshelf with the radio on it and other stacked bookshelves start to roll as the train vibrates. Sally moves towards a curtain and hangs onto a knob while Bob clings to a sofa. As the train lists, the sofa is torn and passengers slide down the incline. Bob loses his grip and slithers along the carpet away from Sally, who still clings to the chandelier. Sally pulls herself onto the platform as the train lists, facing the blue twilight sky. The train keels over to the port side and completes a hundred and eighty-degree turn as leaves wash off. In Berlin, a red ribbon flutters in the breeze, with a pen rotating and not much movement otherwise. Chancellor Johnson looks up, hearing the noise of air as it swells up the alley from Hudson River, thundering towards the town. A gust of wind brings a large helicopter that buries the Lincoln Memorial. On the Zeppelin, Liam fiddles with a guitar in the cargo area as Mia, in a jumpsuit, joins him. She opens the driver's door, settles beside him, and they exchange looks. She gazes out of the dashboard, takes her finger to her nose while Liam inclines his elbow and stares at the guitar. On the Orient Express, Martinez walks over to the toaster, they turn to Dr. East. In the Zeppelin cockpit, Liam and Igor climb down the railings, leaving Marcus with Natalya. In the engine room, Liam hands Igor headphones, leans on the railings, and looks at his sleeping dog. Liam wearily removes headphones as his cat Max wakes and looks over at him. Startled, Liam stares at Max, lowers his elbow, nods, and they embrace. Mia wakes as the Ivanovs put on headphones and the balloon descends rapidly. The Andrews kids also have their headphones on."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Outside, the audience marvels as the magnificent sculpture of Saint Mark's, with its towering spire, tilts backward and topples into the courtyard. On a private jet, Benny examines a map as the calming sunrise spreads across the skies of the world. The canoe is still upside-down on the serene river. Brian's uncle George strums the guitar and sings. Lisa listens to the radio with others in the lounge as George arrives. Jamie, bewildered, rises to his feet and drifts purposefully towards him. The cart with the radio on it and other loaded carts start to slide as the train accelerates. George approaches a window and grips onto a chair while Jamie holds onto a railing. As the train accelerates, the railing is bent and passengers stagger down the aisle. Jamie loses his grip and tumbles along the corridor away from George, who still grips the railing. George hoists himself onto the platform as the train accelerates, facing the foggy dawn. The train swerves to the left side and completes a full circle as leaves drift off. In Paris, a red curtain ripples in the gust, with a kite soaring and little activity elsewhere. Chancellor Smith gazes around, hearing the rustle of wind as it sweeps through the boulevard from the Seine, rushing towards the metropolis. A gust carries a massive schooner that envelops the Eiffel Tower. On the Antonov, Kevin tinkers with a flashlight in the storage area as Laura, in a trench coat, joins him. She closes the overhead compartment, nestles beside him, and they exchange smiles. She peers through the windshield, raises her phone to her ear while Kevin bows his head and inspects the flashlight. On the private jet, Hartman strides over to the map, they gesture to Doctor East. In the Antonov cockpit, Kevin and Alex descend the stairs, leaving Marcus with Ivan. In the cargo hold, Kevin presents Alex with oxygen masks, leans against the ladder, and watches his resting friends. Kevin reluctantly removes an oxygen mask as his daughter Emma awakens and gazes over at him. Astonished, Kevin gazes at Emma, raises his eyes, smiles, and they high-five. Laura dozes as the Ivanovs fasten oxygen masks and the aircraft climbs steadily. The Taylor family also have their oxygen masks on."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Outside, the crowd laughs as the astounding monument of Saint Peter's, with its enormous tower, wobbles backward and gently lands on the garden. On Air Force One, Scotty examines a map as the dispersive mist is carried across the forests of the world. The raft is still balanced on the calm river. Adrian's father Harry strums the guitar and sips. Kearney listens to music with others in the hall as Harry arrives. Tony, bewildered, rises to his toes and strolls lazily towards him. The cart with the radio on it and other packed carts begin to glide as the craft shakes. Harry moves towards a window and grips onto a railing while Tony clutches to a chair. As the craft inclines, the chair is shattered and personnel tumble down the gradient. Tony releases his hold and glides across the carpet away from Harry, who still grips to the hammock. Harry hauls himself onto the deck as the craft tilts, facing the starry morning sky. The craft tips over to the port side and completes a three hundred and sixty-degree spin as breezes sweep off. In Washington, a blue flag waves in the gale, with a bicycle spinning and minimal activity elsewhere. President Wilson glances up, hearing the hum of wind as it blasts up the avenue from Chesapeake Bay, roaring towards the city. A gust brings a colossal helicopter that covers the Washington Monument. On the Antinov, Jackson adjusts a compass in the storage room as Kate, in a cloak, joins him. She opens the glove compartment, settles beside him, and they share smiles. She gazes out of the windshield, places her hand on her ear while Jackson bows his head and observes the compass. On Air Force One, Anheuser strides over to the map, they turn to Professor West. In the Antinov cockpit, Jackson and Yuri climb up the ladder, leaving Gordon with Sasha. In the cargo hold, Jackson hands Yuri parachutes, leans on the ladder, and gazes at his resting family. Jackson wearily removes a parachute as his son Noah stirs and glances over at him. Startled, Jackson peers at Noah, lowers his gaze, nods, and they embrace. Kate stirs as the Karpovs tighten their parachutes and the plane ascends slowly. The Curtis children also have their parachutes on."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beneath the stars, the cats rejoice as the ancient lighthouse of Galileo's, with its towering spire, tumbles backward and collapses into the meadow. On the red balloon, Melanie examines a map as the vibrating dragon is sprinkled across the sands of the continent. The wagon is still overturned on the calm field. Trevor's cousin Marty juggles oranges and sings. Harper listens to music with strangers in the attic as Marty arrives. Jules, confused, tumbles to his knees and dances erratically towards her. The skateboard with the gramophone on it and other empty skateboards begin to zoom as the castle trembles. Marty lunges towards a window and clutches onto a curtain while Jules hugs a lamp. As the castle tilts, the lamp is shattered and guests bounce up the stairs. Jules loses his grip and rolls across the ceiling away from Marty, who still holds onto the chandelier. Marty drags himself onto the veranda as the castle tilts, facing the shining dawn sky. The castle flips over to the port side and completes a ninety-degree loop as leaves drift away. In Madrid, a black flag floats in the gale, with a kite dancing and no hustle elsewhere. King Oliver looks down, sensing the din of thunder as it climbs up the cobblestones from Puget Sound, rumbling towards the village. A gust sends a small fishing boat that topples the Parliament. On the Zeppelin, Leslie tweaks a compass in the luggage area as Megan, in a hoodie, approaches her. She closes the trapdoor, nestles beside her, and they swap stories. She peers out of the porthole, taps her finger to her lips while Leslie nods her chin and gazes at the compass. On the red balloon, Carpenter stumbles over to the map, they glance at Captain East. In the Zeppelin cockpit, Leslie and Ivan leap up the ladder, leaving Jordan with Boris. In the storage space, Leslie passes Ivan parachutes, leans on the ladder, and gazes at his giggling crew. Leslie cheerfully fastens a parachute as his daughter Luna yawns and glances over at him. Astonished, Leslie gawks at Luna, lifts his gaze, smiles, and they high-five. Megan rises as the Drakes slip on parachutes and the blimp floats upward. The Bentley kids also have their parachutes on."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Outside, chaos ensues as Saint Peter's dome collapses into the square. On Air Force One, Scotty observes as a tsunami spreads globally. Harry plays piano and drinks on a turbulent ship, while Tony wanders aimlessly. As the ship lists, trolleys roll, and personnel slide. Harry clings to a door handle, but Tony loses his grip. Eventually, Harry reaches the deck as the ship flips over. In Washington, President Wilson hears the surge from Chesapeake Bay, watching a massive wave approach. A large aircraft carrier crashes into the White House. Meanwhile, Jackson and Kate share a moment on the Antinov before rushing to provide life jackets for their families. Jackson and his son Noah share an emotional embrace as the plane rapidly descends, with everyone donning life jackets."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The Curtis children also have their life jackets on Kate wakes as the Karpovs put on life jackets and the plane descends rapidly Noah lowers his gaze nods and they hug Surprised Jackson stares at Jackson wearily removes a life jacket as his son Noah wakes and looks over at him Yuri life jackets leans on the steps and looks at his sleeping family In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands they turn to Professor West On Air Force One Anheuser walks over to the screen She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio She opens the passenger door settles beside him and they exchange glances On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him A wave brings a large aircraft carrier that buries the White House President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off Harry pulls himself onto the deck as the ship lists facing the black night sky Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock As the ship lists the table is torn and personnel slide down the slope Harry moves towards a door and hangs onto a handle while Tony clings to a table The trolley with the television on it and other filled trolleys start to roll as the ship vibrates Tony dazed gets to his feet and wanders aimlessly towards him Kearney watches TV with others in the galley as Harry enters Harry plays the piano and drinks Adrian's father The boat is still upright on the turbulent ocean On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands The Curtis children also have their life jackets on Tony dazed gets to his feet and wanders aimlessly towards him Kearney watches TV with others in the galley as Harry enters Harry pulls himself onto the deck as the ship lists facing the black night sky President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city As the ship lists the table is torn and personnel slide down the slope Surprised Jackson stares at The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off On Air Force One Anheuser walks over to the screen A wave brings a large aircraft carrier that buries the White House Noah lowers his gaze nods and they hug On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere The boat is still upright on the turbulent ocean She opens the passenger door settles beside him and they exchange glances Kate wakes as the Karpovs put on life jackets and the plane descends rapidly Harry plays the piano and drinks Yuri life jackets leans on the steps and looks at his sleeping family The trolley with the television on it and other filled trolleys start to roll as the ship vibrates Harry moves towards a door and hangs onto a handle while Tony clings to a table Jackson wearily removes a life jacket as his son Noah wakes and looks over at him Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square Adrian's father they turn to Professor West"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "President Wilson looks up hearing the noise of water as it swells up the tarmac from Chesapeake Bay thundering towards the city A wave brings a large aircraft carrier that buries the White House On the Antinov Jackson fiddles with a radio in the loading bay as Kate in a parka joins him She opens the passenger door settles beside him and they exchange glances She gazes out of the windscreen takes her hand to her cheek while Jackson inclines his head and stares at the radio On Air Force One Anheuser walks over to the screen they turn to Professor West In the Antinov cockpit Jackson and Yuri climb down the steps leaving Gordon with Sasha In the cargo hold Jackson hands Yuri life jackets leans on the steps and looks at his sleeping family Jackson wearily removes a life jacket as his son Noah wakes and looks over at him Surprised Jackson stares at Noah lowers his gaze nods and they hug Kate wakes as the Karpovs put on life jackets and the plane descends rapidly The Curtis children also have their life jackets on Outside the crowd panics as the amazing edifice of Saint Peter's with its huge dome keels forward and crashes into the square On Air Force One Scotty studies a screen as the projective tsunami is spread across the oceans of the world The boat is still upright on the turbulent ocean Adrian's father Harry plays the piano and drinks Kearney watches TV with others in the galley as Harry enters Tony dazed gets to his feet and wanders aimlessly towards him The trolley with the television on it and other filled trolleys start to roll as the ship vibrates Harry moves towards a door and hangs onto a handle while Tony clings to a table As the ship lists the table is torn and personnel slide down the slope Tony loses his grasp and slithers along the floor away from Harry who still clings to the hammock Harry pulls himself onto the deck as the ship lists facing the black night sky The ship keels over to the starboard side and completes a hundred and eightydegree turn as waves wash off In Washington a white sheet flutters in the breeze with a wheel turning and not much movement elsewhere"
        }
      ]
    }
  ]
}