{
  "ground_truth": "Jane is accosted by a smartly dressed older lady, leaving her puzzled and unsure of what she just heard. Having downed Casey's drink, Jane heads for Tess and George, staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once. Tess looks worried as Jane strides off, then turns and grins at her, but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her, while Casey looks bored. Tess smiles at George, and cute baby pictures of the couple fill the screen, showing young George petting a goat, Tess dangling a cat by its hind legs, George in academic robes, cheerleader Tess flirting with footballers, George helping at a soup kitchen, bikini-wearing Tess getting soaked at a car wash, him at the United Nations, her in Europe with two guys, and George helping with an animal charity. Tess tucks into a helping of ribs, and George looks unhappy as slides show him with his proud parents, then Tess in a fight, grimacing at a baby, and being afraid of George's dog. Behind the now not-so-happy couple, Casey gets to her feet, and Jane looks miserable. Tess runs up, and Jane opens her mouth, but no sound comes out. She stands awkwardly, biting her lip, her eyes brimming with tears, as Casey feels her friend's pain while Jane hurries out of the restaurant. Kevin, lurking in the background, follows her out, and she looks at him with wide, tear-filled eyes. He waits for a reaction, turns to walk away, then stops and comes back again. He holds up a PDA phone with a ribbon on it, places it in her hand, gives her a lingering look, then walks away. Jane watches him go with a sad half smile, looks down at the gift in her hand, and chokes back more tears. She arrives back at her apartment, places her bag and keys on the hall table, and idly toys with a flower in one of the many vases occupying every available surface. Kevin is at his desk, staring gloomily into space as Maureen walks up, and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her father's store, where Tess freezes upon noticing her. Jane can't meet Tess's furious gaze and is baffled, sitting with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet, starts flinging the dresses out into the hall, and soon stuffs the last dress into one of several black plastic bean bags.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jane is confronted by a stylishly attired elder woman, leaving her confused and uncertain of what she just heard. Having consumed Casey's beverage, Jane moves toward Tess and George, glancing defiantly at Tess and cramming an entire sausage pastry into her mouth at once. Tess appears anxious as Jane marches away, then turns and beams at her, but her expression freezes as Jane gazes her in the eye and retrieves a folder from the table behind her, while Casey seems uninterested. Tess beams at George, and adorable infant images of the pair fill the screen, showing young George stroking a goat, Tess dangling a feline by its hind legs, George in scholarly attire, cheerleader Tess flirting with athletes, George assisting at a soup kitchen, swimsuit-clad Tess getting drenched at a car wash, him at the United Nations, her in Europe with two men, and George aiding with an animal charity. Tess digs into a portion of ribs, and George appears dissatisfied as slides show him with his proud parents, then Tess in a scuffle, grimacing at an infant, and being terrified of George's dog. Behind the now not-so-cheerful pair, Casey rises to her feet, and Jane appears desolate. Tess dashes up, and Jane opens her mouth, but no sound emerges. She stands awkwardly, biting her lip, her eyes filled with tears, as Casey empathizes with her friend's anguish while Jane rushes out of the restaurant. Kevin, lurking in the background, follows her out, and she gazes at him with wide, tearful eyes. He waits for a response, turns to walk away, then halts and returns again. He presents a smartphone with a ribbon on it, places it in her hand, gives her a lingering glance, then departs. Jane watches him leave with a sad half-smile, looks down at the present in her hand, and suppresses more tears. She returns to her apartment, places her bag and keys on the hall table, and idly fiddles with a bloom in one of the many vases occupying every available surface. Kevin is at his desk, staring dejectedly into space as Maureen approaches, and he gives a regretful smile and sinks back thoughtfully into his chair. Jane is at her father's shop, where Tess freezes upon noticing her. Jane can't meet Tess's angry gaze and is perplexed, sitting with her shoulders hunched on the shop counter, staring disheartenedly at the floor. Back at her apartment, she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of garments. She throws open the closet, starts tossing the garments out into the hall, and soon stuffs the last garment into one of several black plastic trash bags."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jane was accosted by a smartly dressed older lady, leaving her puzzled and unsure of what she just heard. Having downed Casey's drink, Tess and George were headed for by Jane, who was stared at challengingly by Tess while a whole sausage roll was stuffed into her mouth at once by her. Tess worries as Jane strides off, then turns and grins at her, but her face is frozen as Jane looks her in the eye and picks up a folder from the table behind her, while Casey appears bored. George is smiled at by Tess, and the screen is filled with cute baby pictures of the couple, showing young George petting a goat, Tess dangling a cat by its hind legs, George wearing academic robes, Tess flirting with footballers as a cheerleader, George helping at a soup kitchen, bikini-clad Tess getting soaked at a car wash, him attending the United Nations, her traveling in Europe with two guys, and George assisting with an animal charity. A helping of ribs is tucked into by Tess, and George appears unhappy as slides show him with his proud parents, then Tess in a fight, grimacing at a baby, and being afraid of George's dog. Casey gets to her feet behind the now not-so-happy couple, and a miserable expression is worn by Jane. Tess runs up, and Jane opens her mouth, but no sound is produced by her. She stands awkwardly, biting her lip, her eyes brimming with tears, as her friend's pain is felt by Casey while Jane hurries out of the restaurant. Kevin, lurking in the background, follows her out, and a wide, tear-filled gaze is directed at him by her. He waits for a reaction, turns to walk away, then stops and comes back again. A PDA phone with a ribbon on it is held up by him and placed in her hand, while a lingering look is given by him, then he walks away. Jane watches him go with a sad half smile, looks down at the gift in her hand, and more tears are choked back by her. She arrives back at her apartment, her bag and keys are placed on the hall table by her, and a flower in one of the many vases occupying every available surface is idly toyed with by her. Kevin is at his desk, staring gloomily into space, as Maureen walks up, and a rueful smile is given by him, then he sinks back thoughtfully into his chair. Jane is at her father's store, where Tess freezes upon noticing her. Tess's furious gaze can't be met by Jane, and she is baffled, sitting with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, her teeth are idly brushed by her when she wanders out of the bathroom and catches sight of the closet full of dresses. The closet is thrown open, the dresses are flung out into the hall, and soon the last dress is stuffed into one of several black plastic bean bags by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jane is approached by a well-dressed older woman, leaving her confused. After finishing Casey's drink, she confronts Tess and George, challenging Tess while eating a sausage roll. Tess looks worried but grins until Jane picks up a folder, and Casey appears bored. Tess smiles at George as baby pictures of them appear: young George with a goat, Tess with a cat, George in academic robes, cheerleader Tess with footballers, George at a soup kitchen, Tess at a car wash, George at the UN, Tess in Europe, and George with an animal charity. Tess eats ribs, and George looks unhappy as slides show him with his parents, Tess in a fight, grimacing at a baby, and fearing George's dog. Behind them, Casey stands, and Jane looks miserable. Tess approaches, and Jane tries to speak but can't, standing awkwardly with tears in her eyes. Casey senses her pain as Jane leaves the restaurant. Kevin follows her, and she looks at him tearfully. He waits, then returns, giving her a PDA phone with a ribbon, and walks away. Jane watches him go, smiles sadly, and holds back tears. At her apartment, she places her bag and keys on the table and plays with a flower. Kevin, at his desk, stares into space as Maureen approaches, and he smiles ruefully. At her father's store, Jane can't meet Tess's angry gaze and sits dejectedly. Back home, she brushes her teeth, sees her closet full of dresses, and starts throwing them into black plastic bags."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jane is approached by a well-dressed older woman, leaving her confused. After finishing Casey's drink, she confronts Tess and George, eating a sausage roll whole. Tess looks worried, then grins, but freezes as Jane picks up a folder, while Casey appears bored. Tess smiles at George, and baby pictures of them appear: young George with a goat, Tess with a cat, George in robes, cheerleader Tess with footballers, George at a soup kitchen, Tess at a car wash, George at the UN, Tess in Europe, and George with an animal charity. Tess eats ribs, George looks unhappy as slides show him with parents, Tess in a fight, grimacing at a baby, and fearing George's dog. Casey stands, Jane looks miserable. Tess runs up, Jane opens her mouth but is silent, biting her lip with tearful eyes. Casey feels her pain as Jane leaves the restaurant. Kevin follows her, she looks at him tearfully. He waits, then returns, giving her a PDA phone with a ribbon, then leaves. Jane watches him go, half-smiling sadly, holding the gift, and suppresses tears. At her apartment, she places her bag and keys on the table, toys with a flower. Kevin, at his desk, smiles ruefully as Maureen approaches. Jane is at her father's store, where Tess freezes upon seeing her. Jane can't meet Tess's angry gaze, sitting hunched on the counter, staring at the floor. Back home, she brushes her teeth, sees her closet full of dresses, throws them into the hall, and stuffs the last dress into black bags."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jane finds herself unexpectedly approached by an elegantly dressed older woman, leaving her feeling bewildered and uncertain about what she has just heard. After quickly finishing Casey's drink, Jane makes her way over to Tess and George, fixing Tess with a challenging stare while boldly stuffing an entire sausage roll into her mouth in one go. Tess appears worried as Jane strides away, but then she turns and grins at her. However, her expression freezes when Jane meets her gaze directly and picks up a folder from the table behind her, while Casey looks on with an air of boredom. Tess then smiles at George, and the screen fills with adorable baby pictures of the couple. These images show a young George petting a goat, Tess playfully holding a cat by its hind legs, George proudly wearing academic robes, cheerleader Tess flirting with football players, George volunteering at a soup kitchen, Tess in a bikini getting soaked at a car wash, George at the United Nations, Tess in Europe with two guys, and George assisting with an animal charity. Tess begins to enjoy a serving of ribs, while George appears unhappy as the slides continue, showing him with his proud parents, then Tess in a fight, grimacing at a baby, and looking fearful of George's dog. Behind the now not-so-happy couple, Casey rises to her feet, and Jane looks utterly miserable. Tess rushes over, and Jane opens her mouth to speak, but no words come out. She stands there awkwardly, biting her lip, her eyes brimming with tears, as Casey senses her friend's pain while Jane quickly exits the restaurant. Kevin, who has been lurking in the background, follows her outside, and she gazes at him with wide, tear-filled eyes. He waits for her reaction, begins to walk away, then stops and returns. He holds up a PDA phone adorned with a ribbon, places it gently in her hand, gives her a lingering look, and then walks away. Jane watches him leave with a sad half-smile, looks down at the gift in her hand, and struggles to hold back more tears. She arrives back at her apartment, places her bag and keys on the hall table, and idly toys with a flower in one of the many vases that occupy every available surface. Meanwhile, Kevin is at his desk, staring gloomily into space as Maureen approaches, and he gives a rueful smile before sinking back thoughtfully into his chair. Jane is at her father's store, where Tess freezes upon noticing her presence. Jane cannot bring herself to meet Tess's furious gaze and sits, baffled, with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. In a sudden burst of emotion, she throws open the closet, starts flinging the dresses out into the hall, and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jane suddenly finds herself in a situation she did not anticipate when an impeccably and stylishly dressed older woman approaches her, leaving her feeling confused and uncertain about the unexpected words she has just heard. In a swift motion, after quickly consuming the drink belonging to Casey, Jane makes her way over to where Tess and George are standing. She fixes Tess with a challenging and intense stare, all the while boldly stuffing an entire sausage roll into her mouth in one swift go. Tess seems worried and uneasy as Jane confidently strides away, but she soon turns and grins at her. However, Tess’s smile freezes in place when Jane turns to meet her gaze directly. It is at this moment that Jane casually picks up a folder from the table positioned right behind her, while Casey looks on with an air of apparent boredom. Tess then turns her smile toward George, and the screen quickly fills up with a delightful array of adorable baby pictures of the couple. These charming images showcase a young George gently petting a goat, Tess playfully holding a cat by its hind legs, George proudly wearing academic robes, cheerleader Tess flirting with football players, George volunteering at a soup kitchen, Tess in a bikini getting soaked at a car wash, George at the United Nations, Tess in Europe with two guys, and George participating in an animal charity. Tess begins to enjoy a hearty serving of ribs, while George appears visibly unhappy as the slides continue, showing him with his proud parents, then Tess embroiled in a fight, grimacing at a baby, and looking decidedly fearful of George's dog. Behind the not-so-happy couple, Casey rises to her feet, and Jane looks utterly miserable. Tess hurries over to Jane, and Jane opens her mouth as if to speak, but no words come out. She stands in awkward silence, biting her lip, her eyes brimming with tears, while Casey empathetically senses her friend's distress as Jane quickly exits the restaurant. Kevin, who has been lurking somewhat in the background, follows her outside, and she gazes at him with wide, tear-filled eyes. He seems to wait for her reaction, begins to walk away, then unexpectedly stops and returns. He holds up a PDA phone, adorned charmingly with a ribbon, places it gently in her hand, gives her a lingering, meaningful look, and then walks away. Jane watches him leave with a sad half-smile on her face, looks down at the thoughtful gift in her hand, and struggles to hold back more tears. She arrives back at her apartment, where she places her bag and keys on the hall table, and idly toys with a flower in one of the many beautifully arranged vases that occupy nearly every available surface. Meanwhile, Kevin is sitting at his desk, staring into space with a gloomy expression as Maureen approaches, prompting him to give a rueful smile before sinking back thoughtfully into his chair. Jane is now at her father's store, where Tess freezes upon noticing her presence. Jane finds herself unable to meet Tess's furious gaze and sits, feeling baffled and with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she idly brushes her teeth as she wanders out of the bathroom and catches sight of the closet full of dresses. In a sudden burst of emotion, she throws open the closet doors, starts flinging the dresses out into the hall, and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jane finds herself unexpectedly approached by a smartly dressed older lady, leaving her feeling puzzled and unsure about the words she just heard. After quickly consuming Casey's drink, Jane makes her way toward Tess and George, fixing Tess with a challenging stare while simultaneously stuffing an entire sausage roll into her mouth in one swift motion. Tess, observing Jane's actions, appears worried as Jane confidently strides away, but then Tess turns back to her and grins. However, her expression freezes when Jane meets her gaze directly and picks up a folder from the table behind her, all while Casey looks on with an air of boredom. Tess then shifts her attention to George, smiling at him as the screen fills with adorable baby pictures of the couple. These images depict young George petting a goat, Tess playfully holding a cat by its hind legs, George dressed in academic robes, Tess as a cheerleader flirting with football players, George volunteering at a soup kitchen, Tess in a bikini getting soaked at a car wash, George at the United Nations, Tess in Europe with two guys, and George assisting with an animal charity. Meanwhile, Tess begins to enjoy a serving of ribs, and George appears unhappy as the slides continue, showing him with his proud parents, then Tess in a fight, grimacing at a baby, and looking fearful of George's dog. Behind the now less-than-happy couple, Casey rises to her feet, and Jane appears miserable. Tess rushes over, and Jane opens her mouth to speak, but no words come out. She stands there awkwardly, biting her lip, her eyes welling with tears, as Casey empathizes with her friend's distress while Jane hastily exits the restaurant. Kevin, who has been lurking in the background, follows her outside, and she looks at him with wide, tear-filled eyes. He pauses, waiting for her reaction, then turns to walk away but stops and returns. He presents her with a PDA phone adorned with a ribbon, places it gently in her hand, gives her a lingering look, and then walks away. Jane watches him depart with a sad half-smile, glances down at the gift in her hand, and struggles to hold back more tears. Upon returning to her apartment, she places her bag and keys on the hall table and absentmindedly plays with a flower in one of the many vases that occupy every available surface. Meanwhile, Kevin sits at his desk, staring gloomily into space as Maureen approaches, prompting him to give a rueful smile and sink back thoughtfully into his chair. Jane then finds herself at her father's store, where Tess freezes upon noticing her presence. Jane, unable to meet Tess's furious gaze, sits with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she is brushing her teeth absentmindedly when she wanders out of the bathroom and catches sight of her closet full of dresses. In a sudden burst of emotion, she throws open the closet doors, begins flinging the dresses out into the hallway, and eventually stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jane is approached by a smartly dressed older lady, leaving her puzzled. After finishing Casey's drink, she confronts Tess and George, challenging Tess while eating a sausage roll. Tess appears worried but grins at Jane, who then picks up a folder, while Casey looks bored. Tess smiles at George as a slideshow of their past plays, showing various moments from their lives. Tess enjoys ribs, while George looks unhappy as more slides show contrasting images of their experiences. Behind them, Casey stands, and Jane looks miserable. Tess approaches, and Jane, overwhelmed, stands silently with tears in her eyes before leaving the restaurant. Kevin follows her out, offering her a PDA phone with a ribbon, which she accepts with a sad smile. Back at her apartment, Jane places her belongings on the table and toys with a flower. Meanwhile, Kevin sits at his desk, lost in thought, as Maureen approaches. At her father's store, Jane encounters Tess, who is visibly angry, leaving Jane dejected and unable to meet her gaze. Later, at home, Jane brushes her teeth, notices her closet full of dresses, and impulsively throws them into black plastic bags."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jane is accosted by a smartly dressed older lady, whose attire suggests she might be a long-time resident of this upscale neighborhood known for its fashionable boutiques, leaving her puzzled and unsure of what she just heard. Having downed Casey's drink from the popular local bar known for its experimental cocktails, Jane heads for Tess and George, staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once, reminiscent of the traditional English snack often served at parties. Tess looks worried as Jane strides off, then turns and grins at her, but her face freezes as Jane looks her in the eye and picks up a folder heavy with papers from the table behind her, while Casey looks bored, her expression unchanged by the drama unfolding. Tess smiles at George, and cute baby pictures of the couple fill the screen, showing young George petting a goat during a visit to a family farm, Tess dangling a cat by its hind legs, capturing a mischievous childhood moment, George in academic robes at his university graduation, cheerleader Tess flirting with footballers at a high school game, George helping at a soup kitchen during a college volunteer program, bikini-wearing Tess getting soaked at a car wash fundraiser, him at the United Nations where he interned during his gap year, her in Europe with two guys, and George helping with an animal charity that he co-founded. Tess tucks into a helping of ribs known for their rich barbecue flavor at this renowned restaurant, and George looks unhappy as slides show him with his proud parents during a prestigious award ceremony, then Tess in a fight from a regrettable high school incident, grimacing at a baby perhaps due to her well-known discomfort around children, and being afraid of George's dog, a large and energetic Great Dane named Zeus. Behind the now not-so-happy couple, Casey gets to her feet, and Jane looks miserable. Tess runs up, and Jane opens her mouth, but no sound comes out. She stands awkwardly, biting her lip, her eyes brimming with tears, as Casey feels her friend's pain while Jane hurries out of the restaurant. Kevin, lurking in the background at the edge of the busy dining area, follows her out, and she looks at him with wide, tear-filled eyes. He waits for a reaction, turns to walk away, then stops and comes back again. He holds up a PDA phone with a ribbon on it, a model just released and highly sought after, places it in her hand, gives her a lingering look, then walks away. Jane watches him go with a sad half smile, looks down at the gift in her hand, and chokes back more tears. She arrives back at her apartment, places her bag and keys on the hall table beside framed family photos, and idly toys with a flower in one of the many vases occupying every available surface, a testament to her love for fresh blooms. Kevin is at his desk at the bustling advertising agency, staring gloomily into space as Maureen, his supportive colleague, walks up, and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her father's store, a quaint bookshop cherished by locals, where Tess freezes upon noticing her. Jane can't meet Tess's furious gaze and is baffled, sitting with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses, many bought impulsively for events she never attended. She throws open the closet, starts flinging the dresses out into the hall, and soon stuffs the last dress into one of several black plastic bean bags, ready to donate them to the local charity shop."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard  Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once  Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored  Tess tucks into a helping of ribs and George looks unhappy as slides show him with his proud parents  then Tess in a fight grimacing at a baby and being afraid of George's dog  Behind the now notsohappy couple Casey gets to her feet and Jane looks miserable  Tess runs up and Jane opens her mouth but no sound comes out  She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant  Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes  He waits for a reaction turns to walk away then stops and comes back again  He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away  Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears  She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface  Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair  Jane is at her father's store where Tess freezes upon noticing her  Jane can't meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor  Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat  Tess dangling a cat by its hind legs  George in academic robes  cheerleader Tess flirting with footballers  George helping at a soup kitchen  bikiniwearing Tess getting soaked at a car  wash him at the United Nations her in Europe with two guys and George helping with an animal charity  Tess tucks into a helping of ribs and George looks unhappy as slides show him with his proud parents  then Tess in a fight grimacing at a baby and being afraid of George's dog  Behind the now notsohappy couple Casey gets to her feet and Jane looks miserable  Tess runs up and Jane opens her mouth but no sound comes out  She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant  Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes  He waits for a reaction turns to walk away then stops and comes back again  He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away  Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears  She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface  Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair  Jane is at her father's store where Tess freezes upon noticing her  Jane can't meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor  Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses  She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard. Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once. Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored. Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat. Tess dangling a cat by its hind legs. George in academic robes. cheerleader Tess flirting with footballers. George helping at a soup kitchen. bikiniwearing Tess getting soaked at a car. wash him at the United Nations her in Europe with two guys and George helping with an animal charity. Tess tucks into a helping of ribs and George looks unhappy as slides. show him with his proud parents. then Tess in a fight grimacing at a baby and being afraid of George's dog. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Behind the now notsohappy couple. Casey gets to her feet and Jane looks miserable. Tess runs up and Jane opens her mouth but no sound comes out. She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant. Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes. He waits for a reaction turns to walk away then stops and comes back again. He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away. Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears. She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface. Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her father's store where Tess freezes upon noticing her. Jane cannot meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor. Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard. Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once. Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored. Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat. Tess dangling a cat by its hind legs. George in academic robes. cheerleader Tess flirting with footballers. George helping at a soup kitchen. bikiniwearing Tess getting soaked at a car. wash him at the United Nations her in Europe with two guys and George helping with an animal charity. Tess tucks into a helping of ribs and George looks unhappy as slides. show him with his proud parents. then Tess in a fight grimacing at a baby and being afraid of George's dog. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Behind the now notsohappy couple. Casey gets to her feet and Jane looks miserable. Tess runs up and Jane opens her mouth but no sound comes out. She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant. Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes. He waits for a reaction turns to walk away then stops and comes back again. He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away. Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears. She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface. Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her father's store where Tess freezes upon noticing her. Jane cannot meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor. Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard. Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once. Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored. Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat. Tess dangling a cat by its hind legs. George in academic robes. cheerleader Tess flirting with footballers. Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears. She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface. Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her father's store where Tess freezes upon noticing her. Jane cannot meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor. Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard. Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once. Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored. Jane cannot meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor. Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Casey is accosted by a smartly dressed older gentleman, leaving her puzzled and unsure of what she just heard. Having downed Kevin's drink, Casey heads for Maureen and Kevin, staring challengingly at Maureen and stuffing a whole sausage roll into her mouth at once. Maureen looks worried as Casey strides off, then turns and grins at her, but her face freezes as Casey looks her in the eye and picks up a folder from the table behind her, while Kevin looks bored. Maureen smiles at Kevin, and cute baby pictures of the couple fill the screen, showing young Kevin petting a goat, Maureen dangling a cat by its hind legs, Kevin in academic robes, cheerleader Maureen flirting with footballers, Kevin helping at a soup kitchen, bikini-wearing Maureen getting soaked at a car wash, him at the United Nations, her in Europe with two guys, and Kevin helping with an animal charity. Maureen tucks into a helping of ribs, and Kevin looks unhappy as slides show him with his proud parents, then Maureen in a fight, grimacing at a baby, and being afraid of Kevin's dog. Behind the now not-so-happy couple, Jane gets to her feet, and Casey looks miserable. Maureen runs up, and Casey opens her mouth, but no sound comes out. She stands awkwardly, biting her lip, her eyes brimming with tears, as Jane feels her friend's pain while Casey hurries out of the restaurant. George, lurking in the background, follows her out, and she looks at him with wide, tear-filled eyes. He waits for a reaction, turns to walk away, then stops and comes back again. He holds up a PDA phone with a ribbon on it, places it in her hand, gives her a lingering look, then walks away. Casey watches him go with a sad half smile, looks down at the gift in her hand, and chokes back more tears. She arrives back at her apartment, places her bag and keys on the hall table, and idly toys with a flower in one of the many vases occupying every available surface. George is at his desk, staring gloomily into space as Jane walks up, and he gives a rueful smile and sinks back thoughtfully into his chair. Casey is at her father's store, where Maureen freezes upon noticing her. Casey can't meet Maureen's furious gaze and is baffled, sitting with her shoulders hunched on the store counter, staring dejectedly at the floor. Back at her apartment, she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses. She throws open the closet, starts flinging the dresses out into the hall, and soon stuffs the last dress into one of several black plastic bean bags."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jane is accosted by a flamboyantly dressed older gentleman, leaving her puzzled and unsure of what she just heard. Having downed Casey's soda, Jane heads for Tess and George, staring challengingly at Tess and stuffing a whole pancake into her mouth at once. Tess looks worried as Jane strides off, then turns and grins at her, but her face freezes as Jane looks her in the eye and picks up a candlestick from the shelf behind her, while Casey looks bored. Tess smiles at George, and charming vacation photos of the couple fill the screen, showing young George petting a donkey, Tess dangling a fish by its tail, George in scout uniform, cheerleader Tess flirting with skateboarders, George helping at a food pantry, bikini-wearing Tess getting splashed at a beach party, him at the Olympics, her in Asia with two girls, and George helping with a marine charity. Tess tucks into a helping of lasagna, and George looks unhappy as slides show him with his proud relatives, then Tess in an argument, grimacing at a toddler, and being afraid of George's parrot. Behind the now not-so-happy couple, Casey gets to her feet, and Jane looks miserable. Tess runs up, and Jane opens her mouth, but no sound comes out. She stands awkwardly, biting her lip, her eyes brimming with tears, as Casey feels her friend's pain while Jane hurries out of the café. Kevin, lurking in the background, follows her out, and she looks at him with wide, tear-filled eyes. He waits for a reaction, turns to walk away, then stops and comes back again. He holds up a digital camera with a bow on it, places it in her hand, gives her a lingering look, then walks away. Jane watches him go with a sad half smile, looks down at the gift in her hand, and chokes back more tears. She arrives back at her villa, places her backpack and glasses on the console table, and idly toys with a candle in one of the many lanterns occupying every available surface. Kevin is at his cubicle, staring gloomily into space as Maureen walks up, and he gives a rueful smile and sinks back thoughtfully into his chair. Jane is at her mother's studio, where Tess freezes upon noticing her. Jane can't meet Tess's furious gaze and is baffled, sitting with her shoulders hunched on the studio desk, staring dejectedly at the floor. Back at her villa, she is idly brushing her hair when she wanders out of the powder room and catches sight of the attic full of boxes. She throws open the attic, starts flinging the boxes out into the hall, and soon stuffs the last box into one of several blue canvas tote bags."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jane is approached by a smartly dressed older lady, leaving her confused and uncertain of what she just witnessed. Having sampled Casey's drink, Jane moves toward Tess and George, glaring at Tess and shoving a whole sausage roll into her mouth at once. Tess looks concerned as Jane marches off, then turns and winks at her, but her face falters as Jane gazes her in the eye and grabs a folder from the table behind her, while Casey appears indifferent. Tess giggles at George, and cute baby pictures of the couple fill the screen, showing young George feeding a goat, Tess holding a cat by its hind legs, George in academic robes, cheerleader Tess chatting with footballers, George assisting at a soup kitchen, bikini-wearing Tess splashing at a car wash, him at the United Nations, her in Europe with two guys, and George volunteering with an animal charity. Tess bites into a rack of ribs, and George looks displeased as slides show him with his proud parents, then Tess in an argument, frowning at a baby, and being hesitant around George's dog. Behind the now not-so-happy couple, Casey stands up, and Jane appears distraught. Tess dashes up, and Jane opens her mouth, but no sound comes out. She stands awkwardly, clenching her lip, her eyes filled with tears, as Casey shares her friend's pain while Jane rushes out of the restaurant. Kevin, lingering in the background, follows her out, and she gazes at him with wide, tear-filled eyes. He waits for a response, turns to leave, then hesitates and returns. He presents a PDA phone with a ribbon on it, places it in her hand, gives her a lingering look, then departs. Jane watches him leave with a sad half smile, looks down at the gift in her hand, and suppresses more tears. She arrives back at her apartment, places her bag and keys on the hall table, and absentmindedly fiddles with a flower in one of the many vases occupying every available surface. Kevin is at his desk, staring despondently into space as Maureen approaches, and he gives a rueful smile and relaxes thoughtfully into his chair. Jane is at her father's store, where Tess halts upon noticing her. Jane can't bear Tess's furious gaze and is perplexed, sitting with her shoulders slumped on the store counter, staring disheartenedly at the floor. Back at her apartment, she is slowly brushing her teeth when she meanders out of the bathroom and catches sight of the closet full of dresses. She flings open the closet, starts throwing the dresses out into the hall, and soon crams the last dress into one of several black plastic bean bags."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Kevin is approached by a casually dressed younger gentleman, leaving him curious and unsure of what he just felt. Having downed Emily's sandwich, Kevin heads for Sam and Alex, glaring challengingly at Sam and stuffing a whole apple pie into his ear at once. Sam looks terrified as Kevin strides off, then turns and laughs at him, but his face freezes as Kevin looks him in the toe and picks up a lamp from the chair behind him, while Emily looks fascinated. Sam giggles at Alex, and funny dog cartoons of the family fill the screen, showing young Alex painting a giraffe, Sam juggling a fish by its fins, Alex in pirate robes, ballerina Sam giggling with astronauts, Alex cooking at a shoe store, sandal-wearing Sam getting sunburned at a library, him at the Antarctic, her in Australia with three birds, and Alex singing with a vegetable charity. Sam gobbles into a helping of beans, and Alex looks excited as photos show him with his bored siblings, then Sam in a dance, giggling at a kitten, and being proud of Alex's cat. Behind the now not-so-joyful family, Emily gets to his knees, and Kevin looks ecstatic. Sam leaps up, and Kevin opens his elbow, but no sound comes out. He stands awkwardly, twisting his toe, his hands brimming with rocks, as Emily feels his uncle's joy while Kevin races out of the bookstore. Lisa, cycling in the spotlight, follows him out, and he looks at her with wide, rock-filled hands. She waits for a movement, jumps to skip away, then pauses and returns again. She holds up a radio with a sticker on it, places it in his foot, gives him a quick nod, then skips away. Kevin watches her leave with a surprised full grin, looks down at the toy in his foot, and chokes back more laughter. He arrives back at his office, places his shoe and socks on the corner seat, and idly toys with a pencil in one of the many mugs occupying every hidden basket. Lisa is at her couch, staring joyfully into silence as Robert races up, and she gives a joyful giggle and bounces back thoughtfully into her table. Kevin is at his sister's studio, where Sam freezes upon noticing him. Kevin can't meet Sam's delighted grin and is baffled, sitting with his feet balanced on the studio chair, staring energetically at the sky. Back at his office, he is idly washing his socks when he skips out of the kitchen and catches sight of the attic full of boxes. He throws open the attic, starts flinging the boxes out into the field, and soon stuffs the last box into one of several pink inflatable balloons."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lucy is approached by a casually dressed young gentleman, leaving her confused and uncertain of what she just witnessed. Having sipped Kelly's tea, Lucy moves toward Mike and Olivia, glaring defiantly at Mike and cramming a whole cupcake into her mouth at once. Mike looks anxious as Lucy marches away, then turns and winks at her, but his expression stiffens as Lucy meets his gaze and grabs a book from the chair behind him, while Kelly looks uninterested. Mike grins at Olivia, and adorable pet photos of the duo fill the screen, showing young Olivia feeding a sheep, Mike swinging a kitten by its front legs, Olivia in hiking gear, lifeguard Mike chatting with swimmers, Olivia volunteering at a library, swimsuit-clad Mike getting splashed at a beach party, her at a science fair, him in Asia with two friends, and Olivia working with a youth organization. Mike digs into a serving of pasta, and Olivia looks displeased as pictures show her with her delighted siblings, then Mike in a brawl, frowning at a toddler, and being scared of Olivia's cat. Behind the once-joyful pair, Kelly stands up, and Lucy looks despondent. Mike sprints over, and Lucy opens her mouth, but no words come out. She stands uneasily, biting her thumb, her eyes welling with tears, as Kelly senses her friend's sorrow while Lucy rushes out of the café. Brian, hovering by the door, trails her out, and she glances at him with wide, tear-filled eyes. He pauses for a response, turns to leave, then hesitates and returns. He lifts a digital camera with a ribbon on it, sets it in her hand, offers her a tender glance, then departs. Lucy watches him go with a melancholic half smile, looks down at the present in her hand, and holds back more tears. She returns to her apartment, places her backpack and wallet on the hall desk, and absentmindedly plays with a candle in one of the many holders adorning every available surface. Brian is at his cubicle, gazing pensively at the wall as Linda approaches, and he gives a wistful smile and leans back contemplatively in his chair. Lucy is at her mother's shop, where Mike freezes upon seeing her. Lucy can't meet Mike's angry stare and is perplexed, sitting with her shoulders hunched at the shop counter, gazing forlornly at the ground. Back at her apartment, she is absentmindedly combing her hair when she roams out of the bedroom and glimpses the closet full of shoes. She flings open the closet, starts tossing the shoes out into the corridor, and soon packs the last shoe into one of several blue nylon tote bags."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jane is observed by a casually attired young gentleman, leaving her amused and unsure of what she just witnessed. Having ignored Casey's sandwich, Jane wanders toward Tess and George, glaring playfully at Tess and tossing a whole cupcake into her mouth in one go. Tess appears surprised as Jane marches away, then turns and smirks at her, but her expression goes blank as Jane looks her in the eye and grabs a magazine from the chair beside her, while Casey looks uninterested. Tess chuckles at George, and charming toddler photos of the duo fill the screen, showing young George feeding a chicken, Tess tickling a rabbit by its ears, George in hiking gear, cheerleader Tess chatting with musicians, George helping at a bakery, swimsuit-clad Tess getting splashed at a park fountain, him at a beach bonfire, her in Asia with a group of friends, and George assisting with a youth program. Tess delves into a serving of salad, and George looks disappointed as slides show him with his delighted grandparents, then Tess in a race, gasping at a puppy, and being cautious of George's umbrella. Behind the now-not-so-pleasant couple, Casey rises to her feet, and Jane appears dejected. Tess sprints over, and Jane opens her mouth, but no words emerge. She stands awkwardly, fidgeting with her scarf, her eyes filled with confusion, as Casey senses her friend's discomfort while Jane rushes out of the cafe. Kevin, relaxing in the background, trails her out, and she glances at him with wide, puzzled eyes. He waits for a response, turns to stroll away, then pauses and returns once more. He presents a compass with a sticker on it, places it in her hand, gives her a lingering look, then strolls away. Jane watches him depart with a wistful smirk, looks down at the trinket in her hand, and suppresses more emotions. She arrives back at her studio, places her umbrella and scarf on the kitchen counter, and absentmindedly fiddles with a pebble in one of the many bowls decorating every available shelf. Kevin is at his window, examining thoughtfully into space as Maureen approaches, and he gives a sheepish grin and leans back contemplatively into his hammock. Jane is at her uncle's workshop, where Tess halts upon spotting her. Jane can't meet Tess's irate stare and is puzzled, sitting with her arms crossed on the workshop bench, gazing forlornly at the tiles. Back at her studio, she is absentmindedly combing her hair when she drifts out of the bedroom and glimpses the trunk full of hats. She flings open the trunk, starts tossing the hats out into the hallway, and soon stuffs the last hat into one of several green fabric duffel bags."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sandra is approached by a casually clothed young man, leaving her bewildered and uncertain about what she just witnessed. Having guzzled Leo's milkshake, Sandra ambles towards Clara and Leo, glaring defiantly at Clara and gobbling a whole cinnamon bun at once. Clara appears anxious as Sandra marches away, then spins and smirks at her, but her expression stiffens as Sandra meets her gaze and snatches a briefcase from the chair nearby, while Leo seems uninterested. Clara beams at Leo, and playful puppy drawings of the friends fill the TV, depicting young Leo feeding a rabbit, Clara dangling a parrot by its wings, Leo in graduation attire, cheerleader Clara winking at musicians, Leo volunteering at a library, swimsuit-clad Clara getting drenched at a carnival, him at a chess tournament, her in Asia with three friends, and Leo assisting at a plant nursery. Clara digs into a serving of pasta, and Leo looks displeased as images show him with his proud teachers, then Clara in a race, grimacing at a kitten, and being terrified of Leo's hamster. Behind the now less-than-content friends, Leo rises to his feet, and Sandra looks disheartened. Clara dashes over, and Sandra opens her mouth, but no word escapes. She stands clumsily, biting her cheek, her eyes shimmering with tears, as Leo senses her friend's sorrow while Sandra rushes out of the café. Ron, hiding in the backdrop, trails after her, and she glances at him with wide, tear-filled eyes. He anticipates a reaction, turns to depart, then hesitates and returns. He holds up a tablet with a bow on it, places it in her palm, gives her an extended glance, then walks away. Sandra observes him leave with a melancholy half-grin, glances down at the item in her hand, and fights back more tears. She returns to her flat, sets her wallet and sunglasses on the entry table, and absentmindedly fiddles with a sculpture in one of the numerous baskets occupying every reachable spot. Ron is at his workstation, gazing gloomily at the ceiling as Lisa approaches, and he offers a wry smile and sinks back pensively into his seat. Sandra is at her uncle's shop, where Clara freezes upon spotting her. Sandra can't face Clara's livid stare and is perplexed, sitting with her shoulders drooped on the shop register, gazing despondently at the ground. Back at her flat, she is absentmindedly combing her hair when she roams out of the bedroom and glimpses the closet full of shoes. She flings open the closet, starts tossing the shoes out into the corridor, and soon crams the last shoe into one of several blue plastic laundry bags."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jane is puzzled after an encounter with a smartly dressed older lady and begins a challenging confrontation with Tess by eating a whole sausage roll. Tess, momentarily worried, freezes when Jane pointedly picks up a folder, while Casey looks bored. Tess and George’s past is shown through slides, with cute and embarrassing moments from their lives. Behind them, Casey stands as Jane looks miserable. Jane tries to speak to Tess, but no words come out, and she leaves the restaurant, followed by Kevin. Outside, Kevin gives Jane a PDA phone with a ribbon, which makes Jane tearful. At her apartment, Jane toys with a flower amid numerous vases. Kevin, back at his desk, is deep in thought. Jane visits her father's store where Tess angrily looks at her, leaving Jane confused and dejected. Later, Jane throws out dresses from her closet into black bags."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses  Jane can't meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor  Jane is at her father's store where Tess freezes upon noticing her  Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair  She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface  Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears  He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away  He waits for a reaction turns to walk away then stops and comes back again  Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes  She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant  Tess runs up and Jane opens her mouth but no sound comes out  Behind the now notsohappy couple Casey gets to her feet and Jane looks miserable  then Tess in a fight grimacing at a baby and being afraid of George's dog  Tess tucks into a helping of ribs and George looks unhappy as slides show him with his proud parents  wash him at the United Nations her in Europe with two guys and George helping with an animal charity  bikiniwearing Tess getting soaked at a car  George helping at a soup kitchen  cheerleader Tess flirting with footballers  George in academic robes  Tess dangling a cat by its hind legs  Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat  Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored  Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once  Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes  Jane is at her father's store where Tess freezes upon noticing her  She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface  He waits for a reaction turns to walk away then stops and comes back again  Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears  then Tess in a fight grimacing at a baby and being afraid of George's dog  He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away  She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant  George helping at a soup kitchen  Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard  Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair  wash him at the United Nations her in Europe with two guys and George helping with an animal charity  Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses  George in academic robes  Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once  Behind the now notsohappy couple Casey gets to her feet and Jane looks miserable  Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored  Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat  She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags cheerleader Tess flirting with footballers  Tess dangling a cat by its hind legs  bikiniwearing Tess getting soaked at a car  Tess tucks into a helping of ribs and George looks unhappy as slides show him with his proud parents  Tess runs up and Jane opens her mouth but no sound comes out  Jane can't meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Tess runs up and Jane opens her mouth but no sound comes out  She stands awkwardly biting her lip her eyes brimming with tears as Casey feels her friend's pain while Jane hurries out of the restaurant  Kevin lurking in the background follows her out and she looks at him with wide tearfilled eyes  He waits for a reaction turns to walk away then stops and comes back again  He holds up a PDA phone with a ribbon on it places it in her hand gives her a lingering look then walks away  Jane watches him go with a sad half smile looks down at the gift in her hand and chokes back more tears  She arrives back at her apartment places her bag and keys on the hall table and idly toys with a flower in one of the many vases occupying every available surface  Kevin is at his desk staring gloomily into space as Maureen walks up and he gives a rueful smile and sinks back thoughtfully into his chair  Jane is at her father's store where Tess freezes upon noticing her  Jane can't meet Tess's furious gaze and is baffled sitting with her shoulders hunched on the store counter staring dejectedly at the floor  Back at her apartment she is idly brushing her teeth when she wanders out of the bathroom and catches sight of the closet full of dresses  She throws open the closet starts flinging the dresses out into the hall and soon stuffs the last dress into one of several black plastic bean bags Jane is accosted by a smartly dressed older lady leaving her puzzled and unsure of what she just heard  Having downed Casey's drink Jane heads for Tess and George staring challengingly at Tess and stuffing a whole sausage roll into her mouth at once  Tess looks worried as Jane strides off then turns and grins at her but her face freezes as Jane looks her in the eye and picks up a folder from the table behind her while Casey looks bored  Tess smiles at George and cute baby pictures of the couple fill the screen showing young George petting a goat  Tess dangling a cat by its hind legs  George in academic robes  cheerleader Tess flirting with footballers  George helping at a soup kitchen  bikiniwearing Tess getting soaked at a car  wash him at the United Nations her in Europe with two guys and George helping with an animal charity  Tess tucks into a helping of ribs and George looks unhappy as slides show him with his proud parents  then Tess in a fight grimacing at a baby and being afraid of George's dog  Behind the now notsohappy couple Casey gets to her feet and Jane looks miserable "
        }
      ]
    }
  ]
}