{
  "ground_truth": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office, and Marcus begins filling a sack with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple, and some are pink. Willie picks up a purple one and examines it. He puts the purple elephant back and picks up a pink one. He stares at the toy for a moment, and then, smiling softly to himself, he turns to go. The sound of a revolver being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois is behind Marcus with the handcart. Willie shakes his head slowly. Marcus' face softens, then he raises the gun. Willie closes his eyes. The police appear. Marcus hides behind the handcart and takes potshots at the cops who return fire. Willie runs holding the pink elephant, which gets its head blown off. He hides around a corner and catches his breath. A cop spots him and takes a shot, which blows the trunk of the wall beside Willie, who runs on. The statues in the nativity stable scene are smashed, which gets in the way. Later, he jumps out of the store's backdoor, and, still clutching the toy elephant, leaps into the BMW. He starts it up and speeds off. A police officer reaches out his way, and the BMW smashes the door off a squad car as Willie makes his escape. The cop shatters the BMW's back window. Willie drives on, and the cops speed after him. He glances back at the pursuing cruisers. The BMW rounds the corner onto Thurmond's street, raising smoke from its tires in the process. It races on down the street with the cruisers in hot pursuit. Willie pulls up outside Thurmond's house. Unable to get the car door open, he scrambles out of the driver's window clutching the pink elephant. Some children at a neighboring house come out to see what the commotion is all about. They watch as the cops cut Santa down in a hail of hot blood. He takes several bullets. Still clutching the elephant, Willie crawls towards Thurmond's front door. The gun-toting cops close in on him. Willie reaches the front step, but he's too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him, keeping him covered as the screen fades slowly. Daytime, a close-up of the blood-soaked pink elephant. Thurmond opens a box on his bed. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat hard in the balls.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He observes at the unclosed vault entrance and grins. Marcus grins and bobs. Willie proceeds out of the workspace, and Marcus starts filling a bag with bundles of buck notes from the vault. Willie strolls up to a showcase of pachyderm plush playthings. Some are violet, and some are rosy. Willie picks up a violet one and inspects it. He puts the violet pachyderm back and picks up a rosy one. He gazes at the plaything for a moment, and then, grinning gently to himself, he turns to depart. The noise of a pistol being armed brings him to an abrupt stop. Marcus is holding a weapon on him. Lois is behind Marcus with the handcart. Willie shakes his head gradually. Marcus' visage softens, then he elevates the weapon. Willie shuts his eyes. The law enforcement materialize. Marcus conceals behind the handcart and takes potshots at the officers who return fire. Willie dashes clutching the rosy pachyderm, which gets its head shot off. He hides around a corner and regains his breath. An officer spots him and takes a shot, which blasts the ledge of the barricade beside Willie, who runs on. The figurines in the nativity manger tableau are shattered, which obstructs the path. Eventually, he leaps out of the emporium's rear exit, and, still gripping the plaything pachyderm, springs into the BMW. He ignites it up and hastens away. A patrolman extends out his way, and the BMW wrecks the portal off a patrol vehicle as Willie makes his getaway. The patrolman breaks the BMW's rear pane. Willie drives on, and the officers accelerate after him. He peeks back at the chasing patrollers. The BMW rounds the corner onto Thurmond's avenue, elevating smoke from its tires in the process. It races on along the avenue with the patrollers in fervent chase. Willie halts outside Thurmond's dwelling. Unable to get the automobile portal open, he scrambles out of the driver's pane clutching the rosy pachyderm. Some juveniles at a nearby dwelling emerge to see what the uproar is all about. They observe as the officers cut Santa down in a hail of heated blood. He takes several projectiles. Still clutching the pachyderm, Willie crawls towards Thurmond's front entryway. The gun-wielding officers close in on him. Willie reaches the front step, but he's too gravely hurt to advance any further. He collapses and lies motionless. The group of officers surrounds him, keeping him covered as the screen dims gradually. Daytime, a close-up of the blood-soaked rosy pachyderm. Thurmond opens a container on his cot. Thurmond cleans his bicycle as a skaterat approaches. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat firmly in the balls."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office, and a sack is filled by Marcus with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple, and some are pink. A purple one is picked up by Willie and examined. The purple elephant is put back by him, and a pink one is picked up. The toy is stared at by him for a moment, and then, smiling softly to himself, he turns to go. The sound of a revolver being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois is behind Marcus with the handcart. Willie shakes his head slowly. Marcus' face softens, then the gun is raised by him. Willie closes his eyes. The police appear. Marcus hides behind the handcart and takes potshots at the cops who return fire. Willie runs holding the pink elephant, which has its head blown off. He hides around a corner and catches his breath. A cop spots him and takes a shot, which blows the trunk of the wall beside Willie, who runs on. The statues in the nativity stable scene are smashed, which gets in the way. Later, he jumps out of the store's backdoor, and, still clutching the toy elephant, he leaps into the BMW. It is started up by him and sped off. A police officer reaches out his way, and the door is smashed off a squad car by the BMW as Willie makes his escape. The BMW's back window is shattered by the cop. Willie drives on, and the cops speed after him. The pursuing cruisers are glanced back at by him. The BMW is rounded onto Thurmond's street, and smoke is raised from its tires in the process. It races on down the street with the cruisers in hot pursuit. Willie pulls up outside Thurmond's house. Unable to get the car door open, he scrambles out of the driver's window, clutching the pink elephant. Some children at a neighboring house come out to see what the commotion is all about. They watch as Santa is cut down by the cops in a hail of hot blood. Several bullets are taken by him. Still clutching the elephant, the front door is crawled towards by Willie. The gun-toting cops close in on him. The front step is reached by Willie, but he is too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him, keeping him covered as the screen fades slowly. Daytime, a close-up of the blood-soaked pink elephant. Thurmond opens a box on his bed. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. The skaterat is kicked hard in the balls by Thurmond."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He looks at the open safe and smiles. Marcus nods, smiling. Willie exits the office as Marcus fills a sack with wads of dollar bills. Willie approaches a display of elephant toys—some purple, some pink. He picks up a purple one, examines it, sets it down, and grabs a pink one. Staring at it, he smiles softly before turning to leave. A revolver cocks—Marcus is aiming at him. Lois stands behind Marcus with a handcart. Willie shakes his head. Marcus softens briefly, then raises the gun. Willie closes his eyes. The police arrive. Marcus hides behind the cart, firing at the cops, who shoot back. Willie runs with the pink elephant, which gets its head blown off. He hides to catch his breath. A cop fires, hitting the wall’s trunk beside him. Willie dashes off, smashing through a nativity scene. Later, he jumps out the back door, still holding the elephant, and leaps into a BMW. Starting it, he speeds away, smashing off a squad car door as a cop reaches for him. The cop shatters the BMW’s back window. Willie drives on, glancing back at the pursuing cruisers. The BMW screeches around a corner onto Thurmond's street. He pulls up at Thurmond's house, but the door won’t open, so he climbs out the window with the toy. Children nearby watch as cops gun Santa down in a bloody hail. Shot multiple times, Willie crawls toward Thurmond’s front door, still holding the elephant. Too injured to continue, he collapses. Cops surround him as the screen fades. Daytime: close-up of the blood-soaked pink elephant. Thurmond opens a box on his bed. He cleans his bicycle as a skaterat approaches. Thurmond looks around, stands, looks down, then kicks the skaterat hard in the balls."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He smiles at the open safe door. Marcus nods, and Willie leaves the office as Marcus fills a sack with cash. Willie examines a purple elephant toy, then picks a pink one, smiling. A revolver cocks; Marcus aims at Willie. Lois stands behind Marcus with a handcart. Willie shakes his head, Marcus raises the gun, and Willie closes his eyes. Police arrive, Marcus hides and shoots, and Willie runs with the pink elephant, which gets damaged. A cop shoots, hitting the wall near Willie, who continues running. Nativity scene statues smash in his path. Willie exits the store, jumps into a BMW, and speeds off, smashing a squad car door. A cop shatters the BMW's back window. Willie drives with police in pursuit, rounds a corner onto Thurmond's street, and stops at Thurmond's house. Unable to open the car door, he exits through the window with the elephant. Children watch as cops shoot Santa. Willie, injured, crawls to Thurmond's door but collapses. Cops surround him as the screen fades. Daytime, a close-up of the blood-soaked pink elephant. Thurmond opens a box, cleans his bicycle, and kicks a skaterat."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He gazes intently at the open door of the safe, a satisfied smile spreading across his face. Marcus, standing nearby, also smiles and nods in agreement. With a sense of purpose, Willie exits the office, leaving Marcus to begin the task of filling a large sack with numerous wads of dollar bills extracted from the safe. Meanwhile, Willie approaches a display filled with an assortment of elephant soft toys, some of which are a vibrant purple, while others are a soft pink. He picks up one of the purple elephants, examining it closely before deciding to place it back on the display. His attention then shifts to a pink elephant, which he picks up and stares at thoughtfully for a moment. A gentle smile plays on his lips as he turns to leave. However, the sudden, unmistakable sound of a revolver being cocked halts him abruptly in his tracks. Marcus is now aiming a gun at him, with Lois standing behind Marcus, holding a handcart. Willie slowly shakes his head in disbelief. Marcus' expression softens momentarily, but then he resolutely raises the gun. Willie closes his eyes, bracing himself. At that moment, the police arrive on the scene. Marcus quickly takes cover behind the handcart, firing shots at the officers, who respond with their own gunfire. Willie, clutching the pink elephant, makes a run for it, but the toy's head is blown off in the crossfire. He finds refuge around a corner, pausing to catch his breath. A police officer spots him and fires a shot, which impacts the wall beside Willie, causing him to continue his escape. As he runs, the statues in a nativity stable scene are shattered, creating obstacles in his path. Eventually, he bursts out of the store's backdoor, still holding onto the now headless toy elephant, and leaps into a waiting BMW. He starts the car and speeds away, narrowly avoiding a police officer who reaches out in an attempt to stop him. In the process, the BMW collides with a squad car, tearing off its door. As Willie makes his daring escape, a cop fires a shot that shatters the BMW's back window. Undeterred, Willie continues driving, with the police in hot pursuit. He glances back at the pursuing police cruisers, his heart racing. The BMW screeches around a corner onto Thurmond's street, its tires leaving a trail of smoke. It races down the street, the police cruisers relentlessly chasing after it. Willie finally pulls up outside Thurmond's house. Finding the car door jammed, he scrambles out through the driver's window, still clutching the pink elephant. The commotion draws the attention of some children at a neighboring house, who come out to witness the unfolding drama. They watch in shock as the police open fire on Santa, who is hit by several bullets. Despite his injuries, Willie crawls determinedly towards Thurmond's front door, the pink elephant still in his grasp. The armed police officers close in on him, their weapons trained on him. Willie reaches the front step, but his injuries are too severe for him to continue. He collapses, lying motionless on the ground. The group of officers surrounds him, keeping their guns aimed as the scene gradually fades. In the daylight, a close-up reveals the blood-soaked pink elephant. Meanwhile, Thurmond opens a box on his bed. He is cleaning his bicycle when a skaterat approaches. Thurmond looks around cautiously, then stands up. He glances down before delivering a hard kick to the skaterat's groin."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He gazes intently at the open door of the safe, a satisfied smile gradually spreading across his face as he takes in the sight before him. Marcus, who is standing nearby, also smiles broadly and nods in agreement with the situation. With a clear and deliberate sense of purpose, Willie exits the office, leaving Marcus to begin the demanding task of filling a large sack with numerous wads of dollar bills that have been neatly extracted from the safe. Meanwhile, Willie approaches a display filled with a delightful assortment of elephant soft toys; some of these toys are a vibrant and lively shade of purple, while others are a gentle, soft pink. He picks up one of the purple elephants, examining it closely and thoughtfully before deciding to place it back on the display. His attention then shifts to one of the pink elephants, which he picks up and stares at thoughtfully for a lingering moment. A gentle smile plays across his lips as he turns away, preparing to leave. However, the sudden and unmistakable sound of a revolver being cocked halts him abruptly in his tracks, bringing everything to a standstill. Marcus is now aiming a gun directly at him, with Lois standing strategically behind Marcus, holding onto a handcart. Willie slowly shakes his head in disbelief, struggling to comprehend the betrayal. Marcus' expression softens momentarily, showing a flicker of hesitation, but then he resolutely raises the gun once more. Willie closes his eyes, bracing himself for what seems inevitable. At that crucial moment, the police arrive on the scene. Marcus quickly takes cover behind the handcart, firing shots at the officers, who respond with their own gunfire. Willie, clutching the pink elephant tightly, makes a run for it, but the toy's head is blown off in the ensuing crossfire. He finds temporary refuge around a corner, pausing to catch his breath. A vigilant police officer spots him and fires a shot, which impacts the wall beside Willie, causing him to continue his desperate escape. As he runs, the statues in a nativity stable scene are shattered, creating multiple obstacles in his path. Eventually, he bursts out of the store's backdoor, still holding firmly onto the now headless toy elephant, and leaps into a waiting BMW. He starts the car in a frantic hurry and speeds away, narrowly avoiding a police officer who reaches out in a futile attempt to stop him. In the chaotic process, the BMW collides with a squad car, tearing off its door violently. As Willie makes his daring escape, a determined cop fires a shot that shatters the BMW's back window. Undeterred, Willie continues driving with unwavering determination, with the police in hot pursuit behind him. He glances back at the pursuing police cruisers, his heart pounding rapidly in his chest. The BMW screeches around a corner onto Thurmond's street, its tires leaving an ominous trail of smoke. It races down the street at breakneck speed, the relentless police cruisers closely chasing after it. Willie finally pulls up outside Thurmond's house. Finding the car door jammed and inaccessible, he scrambles out through the driver's window with difficulty, still clutching the pink elephant. The commotion and noise draw the attention of some curious children at a neighboring house, who come out to witness the unfolding drama. They watch in shock and confusion as the police open fire on Santa, who is hit by several bullets. Despite his severe injuries, Willie crawls determinedly towards Thurmond's front door, the pink elephant still clutched tightly in his grasp. The armed police officers close in on him, their weapons trained on him unrelentingly. Willie reaches the front step, but his injuries prove too severe for him to continue. He collapses, lying motionless on the unforgiving ground. The group of officers surrounds him cautiously, keeping their guns aimed steadily as the scene gradually fades. In the daylight, a close-up reveals the blood-soaked pink elephant lying there. Meanwhile, Thurmond is seen opening a small box on his bed. He is occupied with cleaning his bicycle when a skaterat approaches him unexpectedly. Thurmond looks around cautiously, ensuring he is not being watched, then stands up alertly. He glances down before delivering a hard, decisive kick to the skaterat's groin."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He gazes at the open safe door, a smile spreading across his face as he takes in the sight. Marcus, standing nearby, returns the smile and nods in acknowledgment. Willie then turns and exits the office, leaving Marcus to his task. Marcus begins to fill a sack with wads of dollar bills, methodically pulling them from the safe and placing them inside. Meanwhile, Willie approaches a display filled with elephant soft toys, noting the variety of colors—some are purple, and others are pink. He reaches out and picks up a purple elephant, turning it over in his hands to examine it closely. After a moment, he decides to put the purple one back and selects a pink elephant instead. He holds the pink toy, staring at it thoughtfully, and a soft smile plays on his lips as he turns to leave. Suddenly, the sharp sound of a revolver being cocked halts him in his tracks. He turns to see Marcus aiming a gun at him, with Lois standing behind Marcus, holding a handcart. Willie slowly shakes his head in disbelief. Marcus's expression softens momentarily before he raises the gun again, prompting Willie to close his eyes in resignation. At that moment, the police arrive on the scene. Marcus quickly ducks behind the handcart, firing shots at the officers, who respond with their own gunfire. Seizing the opportunity, Willie dashes away, clutching the pink elephant tightly. As he runs, a bullet strikes the toy, blowing its head off. He finds refuge around a corner, pausing to catch his breath. A police officer spots him and fires a shot, which hits the wall beside Willie, causing debris to fly as he continues his escape. In his path, the statues in a nativity stable scene are shattered, creating obstacles. Later, Willie bursts through the store's backdoor, still holding the now headless pink elephant, and leaps into a waiting BMW. He quickly starts the car and speeds away, narrowly avoiding a police officer who reaches out to stop him. In his haste, the BMW collides with a squad car, tearing off its door. As he makes his escape, a cop fires at the BMW, shattering its back window. Undeterred, Willie drives on, glancing back at the police cruisers in pursuit. The BMW screeches around a corner onto Thurmond's street, tires smoking as it races down the road with the police in hot pursuit. Willie brings the car to a stop outside Thurmond's house. Finding the car door jammed, he scrambles out through the driver's window, still clutching the pink elephant. The commotion draws the attention of children from a neighboring house, who come out to watch the unfolding drama. They witness the police open fire on Santa, who is hit multiple times and falls, bloodied. Despite his injuries, Willie clings to the elephant and crawls towards Thurmond's front door. The armed officers close in on him as he reaches the front step, but his injuries are too severe, and he collapses, lying motionless. The police surround him, keeping their weapons trained on him as the scene fades slowly. In the daylight, a close-up reveals the blood-soaked pink elephant. Meanwhile, Thurmond opens a box on his bed, then turns his attention to cleaning his bicycle. A skaterat approaches, prompting Thurmond to look around cautiously. Rising to his feet, Thurmond looks down at the skaterat and, without warning, delivers a hard kick to the skaterat's groin."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He smiles at the open safe door, and Marcus nods in agreement. As Willie leaves the office, Marcus fills a sack with cash from the safe. Willie examines a display of elephant soft toys, choosing a pink one with a soft smile before turning to leave. Suddenly, Marcus, holding a gun, stops him. Lois stands behind Marcus with a handcart. Willie shakes his head, and Marcus hesitates before raising the gun. Willie closes his eyes, but the police arrive, prompting Marcus to hide behind the handcart and exchange gunfire with them. Willie runs with the pink elephant, which gets damaged in the crossfire, and hides around a corner to catch his breath. A cop fires, hitting the wall near Willie, who continues to flee, navigating through a smashed nativity scene. He exits through the store's backdoor, jumps into a BMW, and speeds off, damaging a squad car door in the process. A cop shatters the BMW's back window as Willie drives away, pursued by police cruisers. The BMW skids onto Thurmond's street, tires smoking, and stops outside Thurmond's house. Unable to open the car door, Willie climbs out through the window, still holding the pink elephant. Nearby children watch as the police shoot Santa, who collapses. Willie, injured but clutching the elephant, crawls to Thurmond's front door, where he collapses, surrounded by armed officers. The scene fades with a focus on the blood-soaked pink elephant. Later, Thurmond opens a box on his bed, cleans his bicycle, and confronts a skaterat, ultimately kicking him hard."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks at the open safe door, the heavy steel shining in the dim light, and smiles. Marcus, who had been planning this heist for weeks, smiles and nods. Willie, known for his skill in quick getaways, heads out of the office, and Marcus begins filling a sack with wads of dollar bills from the safe, which is rumored to have been from a big corporation's cash collection. Willie walks up to a display of elephant soft toys, a popular line from a local toy company known for their vibrant colors. Some are purple, and some are pink. Willie picks up a purple one, designed to commemorate a local festival, and examines it. He puts the purple elephant back and picks up a pink one, which often symbolizes good luck in many cultures. He stares at the toy for a moment, and then, smiling softly to himself, he turns to go. The sound of a revolver, a classic Smith & Wesson, being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois, part of the security team that had been bribed, is behind Marcus with the handcart. Willie shakes his head slowly. Marcus' face softens, then he raises the gun. Willie closes his eyes. Just then, the police, responding to a silent alarm triggered earlier, appear. Marcus hides behind the handcart and takes potshots at the cops who return fire with precise accuracy. Willie runs holding the pink elephant, which, ironically, gets its head blown off. He hides around a corner and catches his breath. A veteran cop spots him and takes a shot, which blows the trunk of the wall beside Willie, who runs on. The statues in the nativity stable scene, part of a seasonal display, are smashed, which gets in the way. Later, he jumps out of the store's backdoor, and, still clutching the toy elephant, leaps into the BMW, a stolen vehicle hotwired for the escape. He starts it up and speeds off. A police officer reaches out his way, and the BMW smashes the door off a squad car as Willie makes his escape. The cop shatters the BMW's back window with a well-aimed shot. Willie drives on, and the cops speed after him, their sirens wailing through the night. He glances back at the pursuing cruisers. The BMW rounds the corner onto Thurmond's street, the notorious area known for its winding lanes, raising smoke from its tires in the process. It races on down the street with the cruisers in hot pursuit. Willie pulls up outside Thurmond's house, a place rumored to be a hangout for local misfits. Unable to get the car door open, he scrambles out of the driver's window clutching the pink elephant. Some children at a neighboring house, curious and wide-eyed, come out to see what the commotion is all about. They watch as the cops cut Santa, a local mob affiliate known as 'The Santa,' down in a hail of hot blood. He takes several bullets. Still clutching the elephant, Willie crawls towards Thurmond's front door, desperate for sanctuary. The gun-toting cops close in on him. Willie reaches the front step, but he's too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him, keeping him covered as the screen fades slowly. Daytime, a close-up of the blood-soaked pink elephant, now a silent testament to the previous night’s chaos. Thurmond, who had been expecting Willie, opens a box on his bed, containing plans for another escape. Thurmond cleans his bicycle, a prized possession he often races on weekends, as a skaterat, a term for local skateboarders, walks up. Thurmond looks around, wary of being watched. Thurmond gets to his feet, ready for confrontation. Thurmond looks down, calculating his move. Thurmond kicks the skaterat hard in the balls, an act reflecting the harsh realities of street life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He looks at the open safe door and smiles  Marcus smiles and nods  Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe  Willie walks up to a display of elephant soft toys  Some are purple and some are pink  Willie picks up a purple one and examines it  He puts the purple elephant back and picks up a pink one  Later he jumps out of the store's backdoor and still clutching the toy  elephant leaps into the BMW  He starts it up and speeds off  A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape  The cop shatters the BMW's back window  Willie drives on and the cops speed after him  He glances back at the pursuing cruisers  The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process  It races on down the street with the cruisers in hot pursuit  Willie pulls up outside Thurmond's house  Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant  Some children at a neighboring house come out to see what the commotion is all about  They watch as the cops cut Santa down in a hail of hot blood  He takes several bullets  Still clutching the elephant  Willie crawls towards Thurmond's front door  The guntoting cops close in on him  Willie reaches the front step but he's too badly injured to go any further  He collapses and lies motionless  The posse of cops surrounds him keeping him covered as the screen fades slowly  Daytime  a closeup of the bloodsoaked pink elephant  Thurmond opens a box on his bed  Thurmond cleans his bicycle as a skaterat walks up  He stares at the toy for a moment and then smiling softly to himself he turns to go  The sound of a revolver being cocked brings him to an abrupt hold  Marcus is holding a gun on him  Lois is behind Marcus with the handcart  Willie shakes his head slowly  Marcus' face softens then he raises the gun  Willie closes his eyes  The police appear  Marcus hides behind the handcart and takes potshots at the cops who return fire  Willie runs holding the pink elephant which gets its head blown off  He hides around a corner and catches his breath  A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on  The statues in the nativity stable scene are smashed which gets in the way  Later he jumps out of the store's backdoor and still clutching the toy  elephant leaps into the BMW  He starts it up and speeds off  A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape  The cop shatters the BMW's back window  Willie drives on and the cops speed after him  He glances back at the pursuing cruisers  The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process  It races on down the street with the cruisers in hot pursuit  Willie pulls up outside Thurmond's house  Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant  Some children at a neighboring house come out to see what the commotion is all about  They watch as the cops cut Santa down in a hail of hot blood  He takes several bullets  Still clutching the elephant  Willie crawls towards Thurmond's front door  The guntoting cops close in on him  Willie reaches the front step but he's too badly injured to go any further  He collapses and lies motionless  The posse of cops surrounds him keeping him covered as the screen fades slowly  Daytime  a closeup of the bloodsoaked pink elephant  Thurmond opens a box on his bed  Thurmond cleans his bicycle as a skaterat walks up  Thurmond looks around  Thurmond gets to his feet  Thurmond looks down  Thurmond kicks the skaterat hard in the balls"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple and some are pink. Willie picks up a purple one and examines it. He puts the purple elephant back and picks up a pink one. He stares at the toy for a moment and then smiling softly to himself he turns to go. The sound of a revolver being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois is behind Marcus with the handcart. Willie shakes his head slowly. Marcus' face softens then he raises the gun. Willie closes his eyes. The police appear. Marcus hides behind the handcart and takes potshots at the cops who return fire. Willie runs holding the pink elephant which gets its head blown off. He hides around a corner and catches his breath. A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on. The statues in the nativity stable scene are smashed which gets in the way. Later he jumps out of the store's backdoor and still clutching the toy. elephant leaps into the BMW. He starts it up and speeds off. A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. The cop shatters the BMW's back window. Willie drives on and the cops speed after him. He glances back at the pursuing cruisers. The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process. It races on down the street with the cruisers in hot pursuit. Willie pulls up outside Thurmond's house. Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant. Some children at a neighboring house come out to see what the commotion is all about. They watch as the cops cut Santa down in a hail of hot blood. He takes several bullets. Still clutching the elephant. Willie crawls towards Thurmond's front door. The guntoting cops close in on him. Willie reaches the front step but he is too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him keeping him covered as the screen fades slowly. Daytime. a closeup of the bloodsoaked pink elephant. Thurmond opens a box on his bed. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat hard in the balls."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple and some are pink. Willie picks up a purple one and examines it. He puts the purple elephant back and picks up a pink one. He stares at the toy for a moment and then smiling softly to himself he turns to go. The sound of a revolver being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois is behind Marcus with the handcart. Willie shakes his head slowly. Marcus' face softens then he raises the gun. Willie closes his eyes. The police appear. Marcus hides behind the handcart and takes potshots at the cops who return fire. Willie runs holding the pink elephant which gets its head blown off. He hides around a corner and catches his breath. A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on. The statues in the nativity stable scene are smashed which gets in the way. Later he jumps out of the store's backdoor and still clutching the toy. elephant leaps into the BMW. He starts it up and speeds off. A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The cop shatters the BMW's back window. Willie drives on and the cops speed after him. He glances back at the pursuing cruisers. The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process. It races on down the street with the cruisers in hot pursuit. Willie pulls up outside Thurmond's house. Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant. Some children at a neighboring house come out to see what the commotion is all about. They watch as the cops cut Santa down in a hail of hot blood. He takes several bullets. Still clutching the elephant. Willie crawls towards Thurmond's front door. The guntoting cops close in on him. Willie reaches the front step but he is too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him keeping him covered as the screen fades slowly. Daytime. a closeup of the bloodsoaked pink elephant. Thurmond opens a box on his bed. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat hard in the balls."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple and some are pink. Willie picks up a purple one and examines it. He puts the purple elephant back and picks up a pink one. He stares at the toy for a moment and then smiling softly to himself he turns to go. The sound of a revolver being cocked brings him to an abrupt hold. Marcus is holding a gun on him. Lois is behind Marcus with the handcart. Willie shakes his head slowly. The guntoting cops close in on him. Willie reaches the front step but he is too badly injured to go any further. He collapses and lies motionless. The posse of cops surrounds him keeping him covered as the screen fades slowly. Daytime. a closeup of the bloodsoaked pink elephant. Thurmond opens a box on his bed. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat hard in the balls."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He looks at the open safe door and smiles. Marcus smiles and nods. Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe. Willie walks up to a display of elephant soft toys. Some are purple and some are pink. Thurmond cleans his bicycle as a skaterat walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the skaterat hard in the balls."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog looks at the open safe door and smiles. The squirrel smiles and nods. The turtle heads out of the office, and the squirrel begins filling a sack with wads of dollar bills from the safe. The turtle walks up to a display of elephant soft toys. Some are purple, and some are pink. The turtle picks up a purple one and examines it. The turtle puts the purple elephant back and picks up a pink one. The turtle stares at the toy for a moment, and then, smiling softly to itself, it turns to go. The sound of a revolver being cocked brings it to an abrupt hold. The squirrel is holding a gun on it. The rabbit is behind the squirrel with the handcart. The turtle shakes its head slowly. The squirrel's face softens, then it raises the gun. The turtle closes its eyes. The giraffes appear. The squirrel hides behind the handcart and takes potshots at the giraffes who return fire. The turtle runs holding the pink elephant, which gets its head blown off. It hides around a corner and catches its breath. A giraffe spots it and takes a shot, which blows the trunk of the wall beside the turtle, who runs on. The statues in the nativity stable scene are smashed, which gets in the way. Later, it jumps out of the store's backdoor, and, still clutching the toy elephant, leaps into the BMW. It starts it up and speeds off. A penguin reaches out its way, and the BMW smashes the door off a squad car as the turtle makes its escape. The penguin shatters the BMW's back window. The turtle drives on, and the giraffes speed after it. It glances back at the pursuing cruisers. The BMW rounds the corner onto the fox's street, raising smoke from its tires in the process. It races on down the street with the cruisers in hot pursuit. The turtle pulls up outside the fox's house. Unable to get the car door open, it scrambles out of the driver's window clutching the pink elephant. Some ducks at a neighboring house come out to see what the commotion is all about. They watch as the giraffes cut Santa down in a hail of hot blood. It takes several bullets. Still clutching the elephant, the turtle crawls towards the fox's front door. The gun-toting giraffes close in on it. The turtle reaches the front step, but it's too badly injured to go any further. It collapses and lies motionless. The posse of giraffes surrounds it, keeping it covered as the screen fades slowly. Daytime, a close-up of the blood-soaked pink elephant. The fox opens a box on its bed. The fox cleans its bicycle as a bear walks up. The fox looks around. The fox gets to its feet. The fox looks down. The fox kicks the bear hard in the balls."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He looks at the open bookshelf door and smiles. Marcus smiles and nods. Willie heads out of the classroom, and Marcus begins filling a pillowcase with wads of euro notes from the bookshelf. Willie walks up to a display of lion figurines. Some are red, and some are blue. Willie picks up a red one and examines it. He puts the red lion back and picks up a blue one. He stares at the figurine for a moment, and then, smiling softly to himself, he turns to go. The sound of a crossbow being cocked brings him to an abrupt hold. Marcus is holding a slingshot on him. Lois is behind Marcus with the skateboard. Willie shakes his head slowly. Marcus' face softens, then he raises the slingshot. Willie closes his eyes. The police appear. Marcus hides behind the skateboard and takes potshots at the officers who return fire. Willie runs holding the blue lion, which gets its mane blown off. He hides around a corner and catches his breath. A police officer spots him and takes a shot, which blows the handle of the door beside Willie, who runs on. The mannequins in the holiday display scene are smashed, which gets in the way. Later, he jumps out of the library's backdoor, and, still clutching the figurine, leaps into the Jeep. He starts it up and speeds off. A police officer reaches out his way, and the Jeep smashes the fender off a fire truck as Willie makes his escape. The officer shatters the Jeep's back window. Willie drives on, and the police speed after him. He glances back at the pursuing vehicles. The Jeep rounds the corner onto Thurmond's street, raising dust from its tires in the process. It races on down the street with the vehicles in hot pursuit. Willie pulls up outside Thurmond's apartment. Unable to get the car door open, he scrambles out of the driver's window clutching the blue lion. Some children at a neighboring apartment come out to see what the commotion is all about. They watch as the police cut Frosty down in a hail of hot paint. He takes several paintballs. Still clutching the lion, Willie crawls towards Thurmond's front door. The paintball-wielding police close in on him. Willie reaches the front step, but he's too badly injured to go any further. He collapses and lies motionless. The group of police surrounds him, keeping him covered as the screen fades slowly. Daytime, a close-up of the paint-soaked blue lion. Thurmond opens a box on his couch. Thurmond cleans his scooter as a dog walker walks up. Thurmond looks around. Thurmond gets to his feet. Thurmond looks down. Thurmond kicks the dog walker hard in the shin."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He glances at the open safe door and smirks. Marcus grins and winks. Willie strolls out of the office, and Marcus starts decorating a sack with wads of dollar bills from the safe. Willie approaches a display of elephant soft toys. Some are purple, and some are pink. Willie grabs a purple one and inspects it. He drops the purple elephant back and takes a pink one. He gazes at the toy for a moment, and then, chuckling softly to himself, he spins to leave. The sound of a revolver being uncocked causes him to twirl. Marcus is pointing a gun at him. Lois is beside Marcus with the handcart. Willie shrugs his shoulders slowly. Marcus' face hardens, then he lowers the gun. Willie opens his eyes. The police vanish. Marcus crouches behind the handcart and throws paper balls at the cops who return the gesture. Willie dances holding the pink elephant, which gets its ear torn off. He skips around a corner and catches his breath. A cop spots him and flings a stone, which chips the edge of the wall beside Willie, who dashes on. The statues in the nativity stable scene are overturned, which clears the path. Later, he saunters out of the store's backdoor, and, still hugging the toy elephant, slides into the BMW. He revs it up and cruises off. A police officer waves his way, and the BMW taps the door off a squad car as Willie makes his getaway. The cop scratches the BMW's rear window. Willie cruises on, and the cops drift after him. He peeks back at the trailing cruisers. The BMW drifts around the corner onto Thurmond's street, releasing sparks from its tires in the process. It coasts on down the street with the cruisers in persistent pursuit. Willie halts outside Thurmond's house. Unable to shut the car door, he tumbles out of the driver's window hugging the pink elephant. Some children at a neighboring house come out to see what the clamor is all about. They watch as the cops prop Santa up in a storm of cold water. He receives several spritzes. Still clutching the elephant, Willie slides towards Thurmond's front door. The water-holding cops close in on him. Willie reaches the front step, but he's too exhausted to proceed any further. He crumples and lies motionless. The gathering of cops surrounds him, keeping him watched as the screen blurs rapidly. Daytime, a close-up of the damp pink elephant. Thurmond unveils a box on his bed. Thurmond adjusts his bicycle as a skaterat approaches. Thurmond peers around. Thurmond rises to his feet. Thurmond peers down. Thurmond tosses the skaterat gently in the air."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The sunflower looks at the open treasure chest door and smiles. Jasmine smiles and nods. The mailbox heads out of the library, and Jasmine begins filling a backpack with wads of postcards from the treasure chest. The mailbox walks up to a display of giraffe ceramic mugs. Some are turquoise, and some are teal. The mailbox picks up a turquoise one and examines it. It puts the turquoise giraffe back and picks up a teal one. It stares at the mug for a moment, and then, smiling softly to itself, it turns to go. The sound of a catapult being cocked brings it to an abrupt hold. Jasmine is holding a slingshot on it. Luna is behind Jasmine with the skateboard. The mailbox shakes its head slowly. Jasmine's face softens, then she raises the slingshot. The mailbox closes its eyes. The firefighters appear. Jasmine hides behind the skateboard and takes potshots at the owls who return fire. The mailbox runs holding the teal giraffe, which gets its handle blown off. It hides around a corner and catches its breath. A robin spots it and takes a shot, which blows the branch of the wall beside the mailbox, which runs on. The vases in the miniature aquarium scene are smashed, which gets in the way. Later, it jumps out of the bakery's backdoor, and, still clutching the mug giraffe, leaps into the tricycle. It starts it up and speeds off. A firefighter reaches out its way, and the tricycle smashes the roof off a firetruck as the mailbox makes its escape. The robin shatters the tricycle's side mirror. The mailbox drives on, and the owls speed after it. It glances back at the pursuing limousines. The tricycle rounds the corner onto Gloria's street, raising confetti from its wheels in the process. It races on down the street with the limousines in hot pursuit. The mailbox pulls up outside Gloria's house. Unable to get the sunroof open, it scrambles out of the passenger's window clutching the teal giraffe. Some puppies at a neighboring house come out to see what the commotion is all about. They watch as the owls cut Frosty down in a drizzle of hot mustard. It takes several sprinklings. Still clutching the giraffe, the mailbox crawls towards Gloria's front door. The bow-wielding owls close in on it. The mailbox reaches the front step, but it's too badly injured to go any further. It collapses and lies motionless. The flock of owls surrounds it, keeping it covered as the screen fades slowly. Afternoon, a close-up of the mustard-soaked teal giraffe. Gloria opens a drawer on her couch. Gloria cleans her telescope as a squirrel walks up. Gloria looks around. Gloria gets to her ears. Gloria looks down. Gloria kicks the squirrel hard in the shins."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He gazes at the open cage door and chuckles. Larry chuckles and winks. David shuffles out of the workshop, and Larry starts loading a basket with bundles of lottery tickets from the cage. David ambles up to a display of giraffe plush toys. Some are green, and some are yellow. David grabs a green one and inspects it. He places the green giraffe back and grabs a yellow one. He glares at the toy momentarily, and then, grinning softly to himself, he swivels to leave. The noise of a rifle being loaded makes him freeze abruptly. Larry is aiming a rifle at him. Nancy is behind Larry with the shopping cart. David shakes his head slowly. Larry's expression softens, then he lowers the rifle. David closes his eyes. The firefighters appear. Larry crouches behind the shopping cart and tosses darts at the firefighters who retaliate. David sprints carrying the yellow giraffe, which gets its neck snapped off. He hides around a corner and collects his breath. A firefighter spots him and throws a dart, which snaps the tail of the wall beside David, who bolts. The decorations in the nativity scene are shattered, which blocks the way. Later, he climbs out of the warehouse's backdoor, and, still clutching the toy giraffe, dives into the motorbike. He starts it up and zooms away. A firefighter reaches out his way, and the motorbike knocks the mirror off a fire truck as David makes his getaway. The firefighter smashes the motorbike's headlight. David speeds on, and the firefighters race after him. He glances back at the pursuing vehicles. The motorbike turns the corner onto Hamilton's street, kicking up dust from its tires in the process. It zips down the street with the vehicles chasing closely. David pulls up outside Hamilton's house. Unable to get the bike stand down, he clambers out of the driver's seat clutching the yellow giraffe. Some teenagers at a neighboring house come out to see what the noise is all about. They watch as the firefighters take Cupid down in a flurry of fiery arrows. He takes several hits. Still clutching the giraffe, David crawls towards Hamilton's front door. The broom-wielding firefighters close in on him. David reaches the front porch, but he's too weak to move any further. He collapses and becomes still. The squad of firefighters surrounds him, keeping him covered as the screen slowly dims. Morning, a close-up of the water-soaked yellow giraffe. Hamilton opens a book on his table. Hamilton organizes his skateboard as a punk walks up. Hamilton surveys the area. Hamilton rises to his feet. Hamilton peers down. Hamilton punches the punk hard in the stomach."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He glances at the open oven door and grins. Marcus grins and waves. Willie strolls out of the lounge, and Marcus starts stuffing a backpack with heaps of candy wrappers from the oven. Willie approaches a display of giraffe plush toys. Some are orange, and some are blue. Willie grabs an orange one and inspects it. He places the orange giraffe back and grabs a blue one. He gazes at the toy for a moment, and then, chuckling quietly to himself, he pivots to depart. The sound of a trombone being played brings him to a sudden freeze. Marcus is wielding a megaphone on him. Lois is behind Marcus with the skateboard. Willie shakes his head slowly. Marcus' expression eases, then he raises the megaphone. Willie closes his eyes. The firefighters arrive. Marcus ducks behind the skateboard and fires spitballs at the firefighters who return with water balloons. Willie dashes holding the blue giraffe, which gets its neck torn off. He ducks around a corner and catches his breath. A firefighter spots him and throws a balloon, which splatters the mural on the wall beside Willie, who dashes onward. The figurines in the holiday diorama are toppled, which obstructs the path. Later, he skips out of the café's backdoor and, still clutching the giraffe toy, hops onto the motorcycle. He revs it up and zooms away. A firefighter reaches for him, and the motorcycle scrapes the bumper off a fire truck as Willie makes his escape. The firefighter shatters the motorcycle’s side mirror. Willie races on, and the firefighters chase after him. He glances back at the pursuing engines. The motorcycle zooms around the bend onto Thurmond's street, raising dust from its tires in the process. It zooms down the street with the engines trailing closely. Willie halts outside Thurmond's house. Struggling to get the motorcycle kickstand down, he tumbles out of the seat clutching the blue giraffe. Some teenagers at a nearby park come out to see what the ruckus is about. They observe as the firefighters take down Santa in a shower of water jets. He takes several blasts. Still clutching the giraffe, Willie scrambles towards Thurmond's porch. The water-wielding firefighters close in on him. Willie reaches the porch step, but he's too exhausted to go any further. He collapses and lies still. The group of firefighters surrounds him, keeping him in check as the scene dims slowly. Daytime, a close-up of the waterlogged blue giraffe. Thurmond opens a basket on his table. Thurmond polishes his scooter as a rollerblader approaches. Thurmond glances around. Thurmond stands to his feet. Thurmond looks down. Thurmond kicks the rollerblader hard in the shin."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit stares at the open window and grins. Lucy grins and waves. Charlie hops out of the cabin, and Lucy starts piling a basket with stacks of acorns from the window. Charlie waddles up to a shelf of rhinoceros plush dolls. Some are green, and some are blue. Charlie grabs a green one and inspects it. He places the green rhinoceros back and grabs a blue one. He gazes at the doll for a second, and then, chuckling softly to himself, he pivots to leave. The sound of a slingshot being drawn makes him pause suddenly. Lucy is aiming a slingshot at him. Pat is beside Lucy with the skateboard. Charlie shakes his head slightly. Lucy's expression softens, then she lifts the slingshot. Charlie shuts his eyes. The firefighters arrive. Lucy hides behind the skateboard and takes shots at the firefighters who retaliate. Charlie dashes holding the blue rhinoceros, which gets its ear blown off. He conceals himself around a hedge and regains his composure. A firefighter notices him and fires, which knocks the antenna off the roof beside Charlie, who rushes on. The mannequins in the holiday window display are shattered, which obstructs the path. Later, he springs through the store's side gate, and, still clutching the doll rhinoceros, leaps into the convertible. He ignites it and zooms away. A postal worker reaches his way, and the convertible breaks the mirror off a postal truck as Charlie makes his getaway. The postal worker cracks the convertible's taillight. Charlie drives on, and the firefighters chase him. He peeks back at the trailing trucks. The convertible swerves the bend onto Milner's avenue, creating dust from its wheels in the process. It speeds on down the avenue with the trucks in fierce pursuit. Charlie halts outside Milner's mansion. Unable to unlatch the car door, he crawls out of the driver's window hugging the blue rhinoceros. Some squirrels at a neighboring tree scuttle out to see what the fuss is all about. They observe as the firefighters take down the wizard in a spray of hot paint. He takes several hits. Still hugging the rhinoceros, Charlie crawls towards Milner's front entrance. The water-spraying firefighters close in on him. Charlie reaches the doorstep, but he's too severely weakened to advance any further. He crumples and lies still. The squad of firefighters surrounds him, keeping him in view as the scene fades gently. Morning, a close shot of the wet blue rhinoceros. Milner opens a crate on his desk. Milner polishes his scooter as a pigeon struts up. Milner glances around. Milner stands up. Milner glowers down. Milner kicks the pigeon hard in the beak."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Marcus and Willie plan a heist, with Marcus filling a sack with money from a safe while Willie examines toy elephants. A sudden betrayal occurs when Marcus points a gun at Willie. The police intervene, leading to a chaotic shootout. Willie escapes with a pink elephant, but the toy is damaged in the fray. During a high-speed chase, Willie reaches Thurmond's house but is too injured to move further, collapsing at the doorstep. The cops surround him as the scene fades out. In the aftermath, Thurmond is shown with a blood-soaked pink elephant, confronting a troublemaking skaterat and kicking him in retaliation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Thurmond kicks the skaterat hard in the balls Thurmond looks down  Thurmond gets to his feet  Thurmond looks around  Thurmond cleans his bicycle as a skaterat walks up  Thurmond opens a box on his bed  a closeup of the bloodsoaked pink elephant  Daytime  The posse of cops surrounds him keeping him covered as the screen fades slowly  He collapses and lies motionless  Willie reaches the front step but he's too badly injured to go any further  The guntoting cops close in on him  Willie crawls towards Thurmond's front door  Still clutching the elephant  He takes several bullets  They watch as the cops cut Santa down in a hail of hot blood  Some children at a neighboring house come out to see what the commotion is all about  Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant  Willie pulls up outside Thurmond's house  It races on down the street with the cruisers in hot pursuit  The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process  He glances back at the pursuing cruisers  Willie drives on and the cops speed after him  The cop shatters the BMW's back window  A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape  He starts it up and speeds off  elephant leaps into the BMW  Later he jumps out of the store's backdoor and still clutching the toy  The statues in the nativity stable scene are smashed which gets in the way  A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on  He hides around a corner and catches his breath  Willie runs holding the pink elephant which gets its head blown off  Marcus hides behind the handcart and takes potshots at the cops who return fire  The police appear  Willie closes his eyes  Marcus' face softens then he raises the gun  Willie shakes his head slowly  Lois is behind Marcus with the handcart  Marcus is holding a gun on him  The sound of a revolver being cocked brings him to an abrupt hold  He stares at the toy for a moment and then smiling softly to himself he turns to go  He puts the purple elephant back and picks up a pink one  Willie picks up a purple one and examines it  Some are purple and some are pink  Willie walks up to a display of elephant soft toys  Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe  Marcus smiles and nods  He looks at the open safe door and smiles "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Thurmond looks around  He looks at the open safe door and smiles  He takes several bullets  Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant  The statues in the nativity stable scene are smashed which gets in the way  He glances back at the pursuing cruisers  Thurmond looks down  Willie drives on and the cops speed after him  Marcus hides behind the handcart and takes potshots at the cops who return fire  It races on down the street with the cruisers in hot pursuit  Thurmond opens a box on his bed  Marcus smiles and nods  Willie closes his eyes  Lois is behind Marcus with the handcart  He hides around a corner and catches his breath  Willie reaches the front step but he's too badly injured to go any further  He puts the purple elephant back and picks up a pink one  The guntoting cops close in on him  elephant leaps into the BMW  Thurmond gets to his feet  Willie shakes his head slowly  Later he jumps out of the store's backdoor and still clutching the toy  Some children at a neighboring house come out to see what the commotion is all about  The sound of a revolver being cocked brings him to an abrupt hold  a closeup of the bloodsoaked pink elephant  Willie walks up to a display of elephant soft toys  Daytime  The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process  They watch as the cops cut Santa down in a hail of hot blood  Marcus is holding a gun on him  The posse of cops surrounds him keeping him covered as the screen fades slowly  The police appear  Thurmond cleans his bicycle as a skaterat walks up  Some are purple and some are pink  Marcus' face softens then he raises the gun  A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape  A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on  Willie crawls towards Thurmond's front door  Willie picks up a purple one and examines it  The cop shatters the BMW's back window  He stares at the toy for a moment and then smiling softly to himself he turns to go  Still clutching the elephant  Willie pulls up outside Thurmond's house  Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe  Willie runs holding the pink elephant which gets its head blown off  He collapses and lies motionless  Thurmond kicks the skaterat hard in the balls He starts it up and speeds off "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The cop shatters the BMW's back window  Willie drives on and the cops speed after him  He glances back at the pursuing cruisers  The BMW rounds the corner onto Thurmond's street raising smoke from its tires in the process  It races on down the street with the cruisers in hot pursuit  Willie pulls up outside Thurmond's house  Unable to get the car door open he scrambles out of the driver's window clutching the pink elephant  Some children at a neighboring house come out to see what the commotion is all about  They watch as the cops cut Santa down in a hail of hot blood  He takes several bullets  Still clutching the elephant  Willie crawls towards Thurmond's front door  The guntoting cops close in on him  Willie reaches the front step but he's too badly injured to go any further  He collapses and lies motionless  The posse of cops surrounds him keeping him covered as the screen fades slowly  Daytime  a closeup of the bloodsoaked pink elephant  Thurmond opens a box on his bed  Thurmond cleans his bicycle as a skaterat walks up  Thurmond looks around  Thurmond gets to his feet  Thurmond looks down  Thurmond kicks the skaterat hard in the balls He looks at the open safe door and smiles  Marcus smiles and nods  Willie heads out of the office and Marcus begins filling a sack with wads of dollar bills from the safe  Willie walks up to a display of elephant soft toys  Some are purple and some are pink  Willie picks up a purple one and examines it  He puts the purple elephant back and picks up a pink one  He stares at the toy for a moment and then smiling softly to himself he turns to go  The sound of a revolver being cocked brings him to an abrupt hold  Marcus is holding a gun on him  Lois is behind Marcus with the handcart  Willie shakes his head slowly  Marcus' face softens then he raises the gun  Willie closes his eyes  The police appear  Marcus hides behind the handcart and takes potshots at the cops who return fire  Willie runs holding the pink elephant which gets its head blown off  He hides around a corner and catches his breath  A cop spots him and takes a shot which blows the trunk of the wall beside Willie who runs on  The statues in the nativity stable scene are smashed which gets in the way  Later he jumps out of the store's backdoor and still clutching the toy  elephant leaps into the BMW  He starts it up and speeds off  A police officer reaches out his way and the BMW smashes the door off a squad car as Willie makes his escape "
        }
      ]
    }
  ]
}