{
  "ground_truth": "Skip pulls up on a busy street and gets out. Ferris walks into an apartment, throws keys on a table, and looks around. At the U.S. Embassy in Amman, Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID. An older agent, Holiday, perches on a desk in a meeting room, and after the meeting, Skip walks out. Images of people coming and going from a house are displayed on a screen as Holiday stares at Ferris, then picks up his coat and walks out. Ferris watches him go, then picks up a file and a case as Skip comes back in. A black SUV drives through a checkpoint and up to the entrance of a grand building. Ferris, who still has cuts on his forehead, gets out of the SUV holding a briefcase. He walks up steps to an entrance hall where a tall bearded man, Marwan, Hani's bodyguard, is waiting. Marwan leads Ferris through a meeting room and slides back a glass door, allowing Ferris to step out into an ornate garden where a suave, middle-aged man sits at a table reading a newspaper. Ferris bows to him, then sits as Marwan waits in the meeting room. Hani nods, glances at the building, and pours Ferris a cup of coffee. They walk through the glass door and into the meeting room, where Marwan slides the door shut. Ferris takes a thick file from his case, and with his brow furrowed, Hani opens the file and looks through photographs of groups of men. He studies Ferris, and they both nod. In the surveillance room, Skip and Ferris drive along a narrow street that opens out onto a market square, where they stop and look across at a large, flat-roofed building. Ferris and Skip stand at a coffee store, while nearby, a man dressed in black sits reading. A young guy sits beside the man they're watching, who then briskly stands and runs off, pushing a guy over as he goes. Hoffman watches on the large surveillance screen as the streets are viewed from above. Ferris runs after the man but loses him in a crowd as Skip approaches from another direction. The man keeps running, and Ferris yells to Skip. The man runs down a quiet alley, rounds a corner, and pushes a cyclist over. Ferris sprints after him, and the man climbs over a high wall. Ferris follows, and as the man swipes at Ferris with a knife, two dogs attack. Ferris slams the man against a wall, yanks his arm up behind his back, and a dog sinks its teeth into Ferris' ankle. He grabs the knife, stabs the man repeatedly, and also stabs the dog biting him. Ferris clambers up on the wall, and the dogs bite his ankles.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Skip raises on a crowded road and exits. Ferris strides into a flat, tosses keys on a desk, and glances around. At the U.S. Embassy in Amman, Ferris and Skip in a silver Audi drive up to a barrier where Skip displays his ID. An older operative, Holiday, sits on a desk in a conference room, and after the meeting, Skip strides out. Pictures of individuals arriving and leaving from a residence are projected on a screen as Holiday gazes at Ferris, then picks up his coat and strides out. Ferris observes him leave, then grabs a dossier and a case as Skip returns. A black SUV drives through a barrier and up to the entry of a grand edifice. Ferris, who still has cuts on his brow, exits the SUV holding a briefcase. He strides up steps to an entryway where a tall bearded person, Marwan, Hani's guard, is waiting. Marwan guides Ferris through a conference room and slides back a glass door, allowing Ferris to step out into an ornate garden where a suave, middle-aged person sits at a desk reading a newspaper. Ferris bows to him, then sits as Marwan waits in the conference room. Hani nods, glances at the edifice, and pours Ferris a cup of coffee. They stride through the glass door and into the conference room, where Marwan slides the door closed. Ferris takes a hefty dossier from his case, and with his brow furrowed, Hani opens the dossier and glances through photographs of groups of individuals. He studies Ferris, and they both nod. In the monitoring room, Skip and Ferris drive along a narrow road that opens out onto a market square, where they halt and glance across at a large, flat-roofed edifice. Ferris and Skip stand at a coffee shop, while nearby, an individual dressed in black sits reading. A young guy sits beside the individual they're watching, who then briskly stands and runs off, pushing a guy over as he leaves. Hoffman watches on the large monitoring screen as the roads are viewed from above. Ferris runs after the individual but loses him in a crowd as Skip approaches from another direction. The individual keeps running, and Ferris shouts to Skip. The individual runs down a quiet alley, rounds a corner, and pushes a cyclist over. Ferris sprints after him, and the individual climbs over a high barrier. Ferris follows, and as the individual swipes at Ferris with a dagger, two canines attack. Ferris slams the individual against a barrier, yanks his arm up behind his back, and a canine sinks its teeth into Ferris' ankle. He grabs the dagger, stabs the individual repeatedly, and also stabs the canine biting him. Ferris clambers up on the barrier, and the canines bite his ankles."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Skip is pulled up on a busy street, and he gets out. An apartment is entered by Ferris, keys are thrown on a table by him, and he looks around. At the U.S. Embassy in Amman, a checkpoint is rolled up to by Ferris and Skip in a silver Audi, where Skip shows his ID. Holiday, an older agent, perches on a desk in a meeting room, and after the meeting, Skip is walked out by him. A screen displays images of people coming and going from a house as Ferris is stared at by Holiday, who then picks up his coat and walks out. Him going is watched by Ferris, who then picks up a file and a case as Skip comes back in. A checkpoint is driven through by a black SUV and up to the entrance of a grand building. The SUV is exited by Ferris, who still has cuts on his forehead, holding a briefcase. Steps are walked up by him to an entrance hall where a tall bearded man, Marwan, Hani's bodyguard, waits. Ferris is led through a meeting room by Marwan, who slides back a glass door, allowing Ferris to step out into an ornate garden where a suave, middle-aged man sits at a table reading a newspaper. A bow is made by Ferris to him, then he sits as Marwan waits in the meeting room. A nod is given by Hani, who glances at the building and pours Ferris a cup of coffee. Through the glass door and into the meeting room, they walk, where the door is shut by Marwan. From his case, a thick file is taken by Ferris, and with his brow furrowed, the file is opened by Hani, who looks through photographs of groups of men. Ferris is studied by him, and they both nod. In the surveillance room, a narrow street that opens out onto a market square is driven along by Skip and Ferris, where a stop is made by them, and they look across at a large, flat-roofed building. At a coffee store, Ferris and Skip stand, while nearby, a man dressed in black sits reading. Beside the man they're watching sits a young guy, who then briskly stands and runs off, pushing a guy over as he goes. The large surveillance screen is watched by Hoffman as the streets are viewed from above. After the man, Ferris runs but loses him in a crowd as Skip approaches from another direction. Yells are made by Ferris to Skip as the man keeps running. Down a quiet alley, the man runs, rounds a corner, and a cyclist is pushed over by him. After him, Ferris sprints, and over a high wall, the man climbs. After him, Ferris follows, and as a swipe is made at Ferris by the man with a knife, two dogs attack. Against a wall, the man is slammed by Ferris, who yanks his arm up behind his back, and into Ferris' ankle, a dog sinks its teeth. The knife is grabbed by him, and the man is stabbed repeatedly by him, and also the dog biting him. Up on the wall, Ferris clambers, and his ankles are bitten by the dogs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Skip arrives on a busy street and exits his vehicle. Ferris enters an apartment, tosses keys on a table, and surveys the room. At the U.S. Embassy in Amman, Ferris and Skip in a silver Audi approach a checkpoint where Skip presents his ID. An older agent, Holiday, sits on a desk in a meeting room. After the meeting, Skip departs. Images of people entering and leaving a house appear on a screen as Holiday observes Ferris, then leaves. Ferris watches him, picks up a file and case as Skip returns. A black SUV passes through a checkpoint to a grand building. Ferris, with cuts on his forehead, exits the SUV with a briefcase. He ascends steps to an entrance hall where Marwan, Hani's bodyguard, awaits. Marwan guides Ferris through a meeting room, sliding back a glass door to an ornate garden where a suave, middle-aged man reads a newspaper. Ferris bows, sits, and Marwan waits in the meeting room. Hani nods, glances at the building, and pours Ferris coffee. They return to the meeting room, and Marwan closes the door. Ferris retrieves a thick file, and Hani, with a furrowed brow, examines photos of groups of men. He studies Ferris, and they nod. In the surveillance room, Skip and Ferris drive along a narrow street to a market square, stopping to observe a large, flat-roofed building. At a coffee store, Ferris and Skip watch a man in black reading. A young guy sits beside him, then the man abruptly stands and runs, pushing someone over. Hoffman watches on a large surveillance screen as streets are viewed from above. Ferris chases the man but loses him in a crowd as Skip approaches. The man runs down an alley, rounds a corner, and pushes a cyclist. Ferris pursues, and the man climbs a high wall. Ferris follows, and as the man swipes at him with a knife, two dogs attack. Ferris slams the man against a wall, twists his arm, and a dog bites Ferris' ankle. He grabs the knife, stabs the man repeatedly, and also stabs the dog. Ferris climbs the wall, and the dogs bite his ankles."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Skip arrives on a busy street and exits. Ferris enters an apartment, tosses keys on a table, and surveys the room. At the U.S. Embassy in Amman, Ferris and Skip in a silver Audi reach a checkpoint where Skip shows his ID. An older agent, Holiday, sits on a desk in a meeting room. After the meeting, Skip leaves. Images of people entering and exiting a house appear on a screen as Holiday observes Ferris, then leaves. Ferris watches, picks up a file and case as Skip returns. A black SUV arrives at a grand building. Ferris, with cuts on his forehead, exits holding a briefcase. He approaches an entrance where Marwan, Hani's bodyguard, waits. Marwan leads Ferris through a meeting room, opening a glass door to an ornate garden where a middle-aged man reads a newspaper. Ferris bows, sits, and Marwan waits in the meeting room. Hani nods, pours Ferris coffee, and they enter the meeting room. Ferris presents a thick file, and Hani examines photos of men, studying Ferris. They nod. In the surveillance room, Skip and Ferris drive to a market square, stopping to observe a large building. At a coffee store, a man in black reads nearby. A young guy sits beside him, then the man runs off, pushing someone. Hoffman watches on a surveillance screen. Ferris chases but loses him in a crowd as Skip approaches. The man runs down an alley, rounds a corner, and pushes a cyclist. Ferris pursues, and the man climbs a wall. Ferris follows, and as the man attacks with a knife, two dogs attack. Ferris slams the man against a wall, twists his arm, and a dog bites Ferris' ankle. He grabs the knife, stabs the man and the dog. Ferris climbs the wall, dogs biting his ankles."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Skip arrives on a bustling, lively street and steps out of his vehicle. Meanwhile, Ferris enters an apartment, casually tossing his keys onto a nearby table before taking a moment to survey his surroundings. At the U.S. Embassy located in Amman, Ferris and Skip, seated in a sleek silver Audi, approach a security checkpoint. Here, Skip presents his identification to the guards. Inside a meeting room, an older agent named Holiday is perched comfortably on a desk. After the meeting concludes, Skip makes his way out of the room. On a screen, images of people entering and exiting a house are displayed, capturing Holiday's attention as he fixes his gaze on Ferris. Subsequently, Holiday picks up his coat and exits the room. Ferris observes him leave, then gathers a file and a case just as Skip re-enters the room. A black SUV navigates through a checkpoint and pulls up to the entrance of an impressive, grand building. Ferris, who still bears visible cuts on his forehead, steps out of the SUV, clutching a briefcase. He ascends the steps leading to an entrance hall, where he is met by Marwan, a tall, bearded man who serves as Hani's bodyguard. Marwan escorts Ferris through a meeting room, sliding back a glass door to reveal an ornate garden. Here, a suave, middle-aged man is seated at a table, engrossed in reading a newspaper. Ferris respectfully bows to him before taking a seat, while Marwan remains waiting in the meeting room. Hani acknowledges Ferris with a nod, glances toward the building, and graciously pours Ferris a cup of coffee. Together, they walk back through the glass door into the meeting room, where Marwan slides the door shut behind them. Ferris retrieves a thick file from his case, and with a furrowed brow, Hani opens the file, examining photographs of various groups of men. He scrutinizes Ferris, and they both exchange nods of understanding. In the surveillance room, Skip and Ferris drive along a narrow street that eventually opens up into a bustling market square. Here, they pause to observe a large, flat-roofed building across the way. Ferris and Skip stand at a coffee store, while nearby, a man dressed entirely in black sits, absorbed in reading. A young guy sits beside the man they are watching, who suddenly stands up briskly and takes off running, shoving another person over in his haste. Hoffman watches the unfolding scene on a large surveillance screen, capturing the streets from an aerial perspective. Ferris gives chase but loses sight of the man in the crowd, as Skip approaches from a different direction. The man continues his flight, prompting Ferris to shout instructions to Skip. The man dashes down a quiet alley, rounds a corner, and knocks over a cyclist in his path. Ferris sprints after him, and the man scales a high wall. Ferris follows suit, and as the man swipes at Ferris with a knife, two dogs launch an attack. Ferris slams the man against a wall, twisting his arm behind his back, while one of the dogs sinks its teeth into Ferris' ankle. In a desperate move, Ferris seizes the knife, stabbing the man repeatedly and also stabbing the dog that is biting him. Ferris then clambers up onto the wall, enduring bites from the dogs on his ankles."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Skip arrives on a bustling, lively street filled with the sounds of city life and the movement of people, and he steps out of his vehicle with purpose. Meanwhile, Ferris makes his entrance into an apartment, casually tossing his keys onto a nearby table with a flick of his wrist before taking a brief moment to survey and assess his surroundings with a keen eye. At the U.S. Embassy, situated in the vibrant city of Amman, Ferris and Skip, both comfortably seated in a sleek, silver Audi, approach the stringent security checkpoint. Here, Skip dutifully presents his identification to the attentive guards. Inside a meeting room, an older agent named Holiday, who has a seasoned air about him, is perched comfortably on the edge of a desk. After the conclusion of the meeting, with the air still buzzing with discussions, Skip makes his way out of the room with a determined stride. On a large screen, images of people entering and exiting a house flicker, capturing Holiday’s interest as he fixes his gaze on Ferris with a thoughtful expression. Subsequently, Holiday picks up his coat from a nearby chair, drapes it over his arm, and exits the room with a sense of purpose. Ferris observes him leave, then collects a file and a case in an organized manner just as Skip re-enters the room. A black SUV begins to navigate through a checkpoint and eventually pulls up to the impressive, grand entrance of a stately building. Ferris, who still bears visible cuts and bruises prominently on his forehead, steps out of the SUV, tightly clutching a briefcase in his hand. He purposefully ascends the steps leading to the entrance hall, where he is met by Marwan, a tall and imposing man with a beard who serves as Hani's steadfast bodyguard. Marwan escorts Ferris through a meeting room, efficiently sliding back a glass door to reveal an ornate, lush garden. Here, a suave, middle-aged man is seated comfortably at a table, engrossed in reading a newspaper with full concentration. Ferris respectfully bows to him before taking a seat at the table, while Marwan remains waiting in the meeting room, vigilant and ready. Hani acknowledges Ferris with a subtle nod, glances briefly toward the grand building, and graciously pours Ferris a cup of rich, aromatic coffee. Together, they walk back through the glass door into the meeting room, where Marwan quietly slides the door shut behind them. Ferris retrieves a thick, substantial file from his case, and with a furrowed brow indicating deep thought, Hani opens the file, examining the photographs contained within of various groups of men. He scrutinizes Ferris intently, and they both exchange knowing nods, signaling a shared understanding. In a surveillance room, Skip and Ferris are seen driving along a narrow street that eventually opens up into a vibrant, bustling market square. Here, they pause briefly to observe a large, flat-roofed building situated across the way. Ferris and Skip stand at a coffee store, watching intently, while nearby, a man dressed entirely in black sits, deeply absorbed in reading. A young guy sits beside the man they are watching, who suddenly stands up briskly, his movements abrupt, and takes off running, even shoving another person over in his haste to get away. Hoffman watches the unfolding scene on a large surveillance screen, capturing the busy streets from an aerial perspective. Ferris gives chase but quickly loses sight of the man amid the crowd, as Skip approaches from a different direction with urgency. The man continues his frantic flight, prompting Ferris to shout clear instructions to Skip, directing him. The man dashes down a quiet, narrow alleyway, rounds a sharp corner, and recklessly knocks over a cyclist who crosses his path. Ferris sprints rapidly after him, and as the man, in a bid to escape, scales a high wall, Ferris follows suit with determination. The man swipes aggressively at Ferris with a knife, and two dogs suddenly launch an attack. Ferris slams the man forcefully against a wall, twisting his arm behind his back to restrain him, while one of the dogs viciously sinks its teeth into Ferris' ankle, causing sharp pain. In a desperate move, Ferris seizes the knife, stabbing the man repeatedly and also stabbing the dog that continues to bite him. Ferris then manages to clamber up onto the wall, enduring further bites from the dogs on his ankles as he makes his escape."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Skip maneuvers his vehicle to a halt on a bustling street, carefully navigating through the traffic before stepping out onto the pavement. Meanwhile, Ferris enters an apartment, casually tossing his keys onto a nearby table, and takes a moment to survey his surroundings. At the U.S. Embassy in Amman, Ferris and Skip, seated in a sleek silver Audi, approach a checkpoint where Skip promptly presents his identification to the security personnel. Inside a meeting room, an older agent named Holiday is perched on a desk, observing the proceedings. As the meeting concludes, Skip exits the room. On a screen, images of people entering and leaving a house are displayed, capturing Holiday's attention as he fixes his gaze on Ferris, then retrieves his coat and departs. Ferris watches Holiday leave, then gathers a file and a case just as Skip re-enters the room. A black SUV navigates through a checkpoint and proceeds to the entrance of an imposing building. Ferris, still bearing visible cuts on his forehead, emerges from the SUV, clutching a briefcase. He ascends the steps leading to an entrance hall, where he is met by Marwan, a tall, bearded man who serves as Hani's bodyguard. Marwan escorts Ferris through a meeting room, smoothly sliding back a glass door to reveal an ornate garden. Ferris steps into the garden, where a suave, middle-aged man is seated at a table, engrossed in a newspaper. Ferris respectfully bows to the man before taking a seat, while Marwan remains in the meeting room. Hani acknowledges Ferris with a nod, briefly glances at the building, and pours Ferris a cup of coffee. They both return through the glass door into the meeting room, where Marwan slides the door shut behind them. Ferris retrieves a thick file from his case, and with a focused expression, Hani opens the file, examining photographs of various groups of men. He scrutinizes Ferris, and they exchange nods of understanding. In the surveillance room, Skip and Ferris drive along a narrow street that eventually opens into a bustling market square. They bring their vehicle to a stop, casting their gaze across at a large, flat-roofed building. Standing at a coffee store, Ferris and Skip observe as a man dressed in black sits nearby, reading. A young guy joins the man they are watching, who then abruptly stands and dashes off, shoving another person aside in his haste. Hoffman observes the unfolding events on a large surveillance screen, capturing the streets from an aerial perspective. Ferris gives chase, weaving through the crowd but ultimately losing sight of the man as Skip approaches from a different direction. The man continues his flight, prompting Ferris to shout instructions to Skip. The man darts down a quiet alley, rounds a corner, and knocks over a cyclist in his path. Ferris sprints after him, and the man scales a high wall. Ferris follows suit, and as he reaches the top, the man attempts to swipe at Ferris with a knife, only to be interrupted by two dogs launching an attack. Ferris slams the man against the wall, forcefully twisting his arm behind his back, while one of the dogs sinks its teeth into Ferris' ankle. In a desperate struggle, Ferris seizes the knife, repeatedly stabbing the man and also the dog that is biting him. With determination, Ferris clambers up the wall, enduring the dogs' bites on his ankles."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Skip arrives on a busy street and exits his vehicle. Meanwhile, Ferris enters an apartment, tosses his keys on a table, and surveys the room. At the U.S. Embassy in Amman, Ferris and Skip drive a silver Audi to a checkpoint where Skip presents his ID. Inside a meeting room, an older agent named Holiday sits on a desk. After the meeting, Skip departs as Holiday, after observing images of people on a screen, leaves the room. Ferris watches him go, then gathers a file and a case as Skip returns. A black SUV passes through a checkpoint to a grand building's entrance. Ferris, with cuts on his forehead, exits the SUV with a briefcase and ascends the steps to meet Marwan, Hani's bodyguard, in the entrance hall. Marwan escorts Ferris through a meeting room, opening a glass door to an ornate garden where a suave, middle-aged man reads a newspaper. Ferris bows and sits with him as Marwan waits inside. Hani nods, pours Ferris coffee, and they return to the meeting room. Ferris presents a thick file, which Hani examines, studying photographs and Ferris, before they both nod in agreement. In a surveillance room, Skip and Ferris drive through a narrow street to a market square, observing a large building. They stand at a coffee store, watching a man in black who suddenly runs off, causing chaos. Hoffman monitors the scene on a surveillance screen. Ferris chases the man but loses him in a crowd, while Skip approaches from another direction. The man continues running, pushing over a cyclist, as Ferris pursues him. The chase leads to a high wall, where the man climbs over and swipes at Ferris with a knife. Two dogs attack, and Ferris subdues the man, stabs him and the dog biting him, then climbs the wall as the dogs bite his ankles."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Skip, who recently moved to the bustling capital city, pulls up on a busy street and gets out. Ferris, working undercover, walks into an apartment in the diplomatic district, throws keys on a table, and looks around. At the U.S. Embassy in Amman, a significant diplomatic mission in the Middle East known for handling complex geopolitical issues, Ferris and Skip in a silver Audi S4, known for its speed and reliability, roll up to a checkpoint where Skip shows his ID. An older agent, Holiday, who had served in several high-stakes operations, perches on a desk in a meeting room, and after the meeting, Skip walks out. Images of people coming and going from a house are displayed on a screen as Holiday stares at Ferris, then picks up his coat, tailored for the agency's operatives, and walks out. Ferris watches him go, then picks up a classified file and a secure briefcase as Skip comes back in. A black SUV, commonly used for discreet operations, drives through a checkpoint and up to the entrance of a grand building, reminiscent of the opulent palaces found in the region. Ferris, who still has cuts on his forehead from a recent mission, gets out of the SUV holding a briefcase. He walks up steps to an entrance hall where a tall bearded man, Marwan, Hani's bodyguard known for his loyalty and prowess, is waiting. Marwan leads Ferris through a meeting room and slides back a glass door, crafted by renowned local artisans, allowing Ferris to step out into an ornate garden where a suave, middle-aged man sits at a table reading a newspaper, a publication famous for its international news coverage. Ferris bows to him, then sits as Marwan waits in the meeting room. Hani, a key figure in regional intelligence circles, nods, glances at the building, and pours Ferris a cup of rich Arabian coffee. They walk through the glass door and into the meeting room, where Marwan slides the door shut. Ferris takes a thick file from his case, containing crucial intelligence reports, and with his brow furrowed, Hani opens the file and looks through photographs of groups of men under surveillance. He studies Ferris, and they both nod in silent understanding. In the surveillance room, Skip and Ferris drive along a narrow street, part of the city's elaborate old quarters, that opens out onto a market square, bustling with vendors and shoppers, where they stop and look across at a large, flat-roofed building, often used for covert meetings. Ferris and Skip stand at a coffee store, known for its aromatic blends, while nearby, a man dressed in black sits reading. A young guy sits beside the man they're watching, who then briskly stands and runs off, pushing a guy over as he goes. Hoffman, a seasoned analyst, watches on the large surveillance screen as the streets are viewed from above. Ferris runs after the man but loses him in a crowd as Skip approaches from another direction. The man keeps running through the maze-like alleys typical of the area, and Ferris yells to Skip. The man runs down a quiet alley, rounds a corner, and pushes a cyclist over. Ferris sprints after him, and the man climbs over a high wall lined with barbed wire. Ferris follows, and as the man swipes at Ferris with a knife, honed and deadly, two dogs trained to guard the area attack. Ferris slams the man against a wall, yanks his arm up behind his back, and a dog sinks its teeth into Ferris' ankle, a move aimed to immobilize intruders. He grabs the knife, stabs the man repeatedly to subdue him, and also stabs the dog biting him. Ferris clambers up on the wall as the dogs bite his ankles, fighting to escape the confrontation."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Skip pulls up on a busy street and gets out  An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out  Images of people coming and going from a house are displayed on a screen as Holiday stares at  Ferris then picks up his coat and walks out  Ferris watches him go then picks up a file and a case as Skip comes back in  A black SUV drives through a checkpoint and up to the entrance of a grand building  Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase  He walks up steps to an entrance hall where a tall bearded man  Marwan Hani's bodyguard is waiting  Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper  Ferris bows to him then sits as Marwan waits in the meeting room  Hani nods glances at the building and pours Ferris a cup of coffee  They walk through the glass door and into the meeting room where Marwan slides the door shut  Ferris takes a thick file from his case and with his brow furrowed  Hani opens the file and looks through photographs of groups of men  He studies Ferris and they both nod  In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building  Ferris walks into an apartment throws keys on a table and looks around  At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID  An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out  Images of people coming and going from a house are displayed on a screen as Holiday stares at  Ferris then picks up his coat and walks out  Ferris watches him go then picks up a file and a case as Skip comes back in  A black SUV drives through a checkpoint and up to the entrance of a grand building  Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase  He walks up steps to an entrance hall where a tall bearded man  Marwan Hani's bodyguard is waiting  Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper  Ferris bows to him then sits as Marwan waits in the meeting room  Hani nods glances at the building and pours Ferris a cup of coffee  They walk through the glass door and into the meeting room where Marwan slides the door shut  Ferris takes a thick file from his case and with his brow furrowed  Hani opens the file and looks through photographs of groups of men  He studies Ferris and they both nod  In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building  Ferris and Skip stand at a coffee store while nearby  a man dressed in black sits reading  A young guy sits beside the man they're watching who then briskly stands and runs off pushing a guy over as he goes  Hoffman watches on the large surveillance screen as the streets are viewed from above  Ferris runs after the man but loses him in a crowd as Skip approaches from another direction  The man keeps running and Ferris yells to Skip  The man runs down a quiet alley rounds a corner and pushes a cyclist over  Ferris sprints after him and the man climbs over a high wall  Ferris follows and as the man swipes at Ferris with a knife two dogs attack  Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle  He grabs the knife stabs the man repeatedly and also stabs the dog biting him  Ferris clambers up on the wall and the dogs bite his ankles"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Skip pulls up on a busy street and gets out. Ferris walks into an apartment throws keys on a table and looks around. At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID. An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out. Images of people coming and going from a house are displayed on a screen as Holiday stares at. Ferris then picks up his coat and walks out. Ferris watches him go then picks up a file and a case as Skip comes back in. A black SUV drives through a checkpoint and up to the entrance of a grand building. Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase. He walks up steps to an entrance hall where a tall bearded man. Marwan Hani's bodyguard is waiting. Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper. Ferris bows to him then sits as Marwan waits in the meeting room. Hani nods glances at the building and pours Ferris a cup of coffee. They walk through the glass door and into the meeting room where Marwan slides the door shut. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Ferris takes a thick file from his case and with his brow furrowed. Hani opens the file and looks through photographs of groups of men. He studies Ferris and they both nod. In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building. Ferris and Skip stand at a coffee store while nearby a man dressed in black sits reading. A young guy sits beside the man they are watching who then briskly stands and runs off pushing a guy over as he goes. Hoffman watches on the large surveillance screen as the streets are viewed from above. Ferris runs after the man but loses him in a crowd as Skip approaches from another direction. The man keeps running and Ferris yells to Skip. The man runs down a quiet alley rounds a corner and pushes a cyclist over. Ferris sprints after him and the man climbs over a high wall. Ferris follows and as the man swipes at Ferris with a knife two dogs attack. Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle. He grabs the knife stabs the man repeatedly and also stabs the dog biting him. Ferris clambers up on the wall and the dogs bite his ankles."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Skip pulls up on a busy street and gets out. Ferris walks into an apartment throws keys on a table and looks around. At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID. An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out. Images of people coming and going from a house are displayed on a screen as Holiday stares at. Ferris then picks up his coat and walks out. Ferris watches him go then picks up a file and a case as Skip comes back in. A black SUV drives through a checkpoint and up to the entrance of a grand building. Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase. He walks up steps to an entrance hall where a tall bearded man. Marwan Hani's bodyguard is waiting. Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper. Ferris bows to him then sits as Marwan waits in the meeting room. Hani nods glances at the building and pours Ferris a cup of coffee. They walk through the glass door and into the meeting room where Marwan slides the door shut. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Ferris takes a thick file from his case and with his brow furrowed. Hani opens the file and looks through photographs of groups of men. He studies Ferris and they both nod. In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building. Ferris and Skip stand at a coffee store while nearby a man dressed in black sits reading. A young guy sits beside the man they are watching who then briskly stands and runs off pushing a guy over as he goes. Hoffman watches on the large surveillance screen as the streets are viewed from above. Ferris runs after the man but loses him in a crowd as Skip approaches from another direction. The man keeps running and Ferris yells to Skip. The man runs down a quiet alley rounds a corner and pushes a cyclist over. Ferris sprints after him and the man climbs over a high wall. Ferris follows and as the man swipes at Ferris with a knife two dogs attack. Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle. He grabs the knife stabs the man repeatedly and also stabs the dog biting him. Ferris clambers up on the wall and the dogs bite his ankles."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Skip pulls up on a busy street and gets out. Ferris walks into an apartment throws keys on a table and looks around. At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID. An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out. Images of people coming and going from a house are displayed on a screen as Holiday stares at. Ferris then picks up his coat and walks out. Ferris watches him go then picks up a file and a case as Skip comes back in. A black SUV drives through a checkpoint and up to the entrance of a grand building. The man keeps running and Ferris yells to Skip. The man runs down a quiet alley rounds a corner and pushes a cyclist over. Ferris sprints after him and the man climbs over a high wall. Ferris follows and as the man swipes at Ferris with a knife two dogs attack. Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle. He grabs the knife stabs the man repeatedly and also stabs the dog biting him. Ferris clambers up on the wall and the dogs bite his ankles."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Skip pulls up on a busy street and gets out. Ferris walks into an apartment throws keys on a table and looks around. At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID. Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle. He grabs the knife stabs the man repeatedly and also stabs the dog biting him. Ferris clambers up on the wall and the dogs bite his ankles."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Skip pulls up on a busy street and gets out. A dog walks into an apartment, throws keys on a table, and looks around. At the U.S. Embassy in Amman, a dog and Skip in a silver Audi roll up to a checkpoint where a cat shows his ID. An older agent, a rabbit, perches on a desk in a meeting room, and after the meeting, a cat walks out. Images of people coming and going from a house are displayed on a screen as a rabbit stares at a dog, then picks up his coat and walks out. A dog watches him go, then picks up a file and a case as a cat comes back in. A black SUV drives through a checkpoint and up to the entrance of a grand building. A dog, who still has cuts on his forehead, gets out of the SUV holding a briefcase. He walks up steps to an entrance hall where a tall bearded man, a penguin, Hani's bodyguard, is waiting. A penguin leads a dog through a meeting room and slides back a glass door, allowing a dog to step out into an ornate garden where a suave, middle-aged penguin sits at a table reading a newspaper. A dog bows to him, then sits as a penguin waits in the meeting room. Hani nods, glances at the building, and pours a dog a cup of coffee. They walk through the glass door and into the meeting room, where a penguin slides the door shut. A dog takes a thick file from his case, and with his brow furrowed, Hani opens the file and looks through photographs of groups of men. He studies a dog, and they both nod. In the surveillance room, Skip and a dog drive along a narrow street that opens out onto a market square, where they stop and look across at a large, flat-roofed building. A dog and Skip stand at a coffee store, while nearby, a horse dressed in black sits reading. A young bear sits beside the horse they're watching, who then briskly stands and runs off, pushing a bear over as he goes. A lion watches on the large surveillance screen as the streets are viewed from above. A dog runs after the horse but loses him in a crowd as a cat approaches from another direction. The horse keeps running, and a dog yells to a cat. The horse runs down a quiet alley, rounds a corner, and pushes a giraffe over. A dog sprints after him, and the horse climbs over a high wall. A dog follows, and as the horse swipes at a dog with a knife, two birds attack. A dog slams the horse against a wall, yanks his arm up behind his back, and a bird sinks its teeth into a dog's ankle. He grabs the knife, stabs the horse repeatedly, and also stabs the bird biting him. A dog clambers up on the wall, and the birds bite his ankles."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Skip pulls up on a busy avenue and gets out. Ferris walks into a studio, throws keys on a shelf, and looks around. At the U.S. Consulate in Cairo, Ferris and Skip in a silver BMW roll up to a security gate where Skip shows his badge. An older agent, Holiday, perches on a chair in a briefing area, and after the briefing, Skip walks out. Images of people coming and going from an office are displayed on a monitor as Holiday stares at Ferris, then picks up his jacket and walks out. Ferris watches him go, then picks up a folder and a backpack as Skip comes back in. A black sedan drives through a security gate and up to the entrance of a grand estate. Ferris, who still has scratches on his cheek, gets out of the sedan holding a laptop case. He walks up steps to a foyer where a tall bearded man, Marwan, Hani's aide, is waiting. Marwan leads Ferris through a lounge and slides back a curtain, allowing Ferris to step out into an elaborate courtyard where a suave, middle-aged man sits at a bench reading a magazine. Ferris bows to him, then sits as Marwan waits in the lounge. Hani nods, glances at the estate, and pours Ferris a cup of tea. They walk through the curtain and into the lounge, where Marwan slides the curtain shut. Ferris takes a thick binder from his backpack, and with his brow furrowed, Hani opens the binder and looks through images of groups of men. He studies Ferris, and they both nod. In the monitoring room, Skip and Ferris drive along a narrow lane that opens out onto a plaza, where they stop and look across at a large, flat-roofed warehouse. Ferris and Skip stand at a bakery, while nearby, a man dressed in grey sits reading. A young guy sits beside the man they're watching, who then briskly stands and runs off, pushing a shopper over as he goes. Hoffman watches on the large monitoring screen as the lanes are viewed from above. Ferris runs after the man but loses him in a crowd as Skip approaches from another street. The man keeps running, and Ferris yells to Skip. The man runs down a quiet passageway, rounds a bend, and pushes a pedestrian over. Ferris sprints after him, and the man climbs over a tall fence. Ferris follows, and as the man swipes at Ferris with a stick, two cats attack. Ferris slams the man against a fence, yanks his arm up behind his back, and a cat sinks its claws into Ferris' ankle. He grabs the stick, hits the man repeatedly, and also hits the cat scratching him. Ferris clambers up on the fence, and the cats scratch his ankles."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Skip parks on a busy street and stretches out. Ferris strolls into an apartment, tosses keys on a table, and surveys the area. At the U.S. Embassy in Amman, Ferris and Skip in a silver Audi glide up to a checkpoint where Skip flips open his ID. An older agent, Holiday, lounges on a desk in a meeting room, and after the meeting, Skip saunters out. Images of people mingling around a house are displayed on a screen as Holiday gazes at Ferris, then grabs his coat and strides out. Ferris observes him leave, then grabs a file and a case as Skip returns. A black SUV cruises through a checkpoint and up to the entrance of a grand building. Ferris, still sporting cuts on his forehead, hops out of the SUV holding a briefcase. He strides up steps to an entrance hall where a tall bearded man, Marwan, Hani's bodyguard, is waiting. Marwan guides Ferris through a meeting room and slides back a glass door, allowing Ferris to step out into an ornate garden where a suave, middle-aged man reclines at a table flipping through a newspaper. Ferris nods to him, then sits as Marwan waits in the meeting room. Hani raises an eyebrow, glances at the building, and brews Ferris a cup of coffee. They stroll through the glass door and into the meeting room, where Marwan slides the door shut. Ferris extracts a thick file from his case, and with his brow furrowed, Hani flips open the file and examines photographs of groups of men. He scrutinizes Ferris, and they both exchange nods. In the surveillance room, Skip and Ferris navigate along a narrow street that opens out onto a market square, where they pause and peer across at a large, flat-roofed building. Ferris and Skip stand at a coffee store, while nearby, a man dressed in black lounges reading. A young guy lounges beside the man they're observing, who then suddenly leaps up and dashes off, toppling a guy over in the process. Hoffman monitors on the large surveillance screen as the streets are viewed from above. Ferris chases after the man but loses him in a throng as Skip advances from another direction. The man continues dashing, and Ferris shouts to Skip. The man speeds down a quiet alley, turns a corner, and collides with a cyclist. Ferris races after him, and the man clambers over a high wall. Ferris pursues, and as the man swipes at Ferris with a knife, two dogs charge. Ferris throws the man against a wall, twists his arm up behind his back, and a dog clamps its jaws around Ferris' ankle. He seizes the knife, lunges at the man repeatedly, and also lunges at the dog biting him. Ferris scales up on the wall, and the dogs clamp their jaws around his ankles."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Flute pulls up on a quiet highway and gets out. Stairs walk into a bakery, throw pencils on a chair, and look around. At the U.K. Consulate in Paris, Stairs and Flute in a golden bicycle roll up to a bridge where Flute shows its passport. A younger singer, Calendar, perches on a chair in a dining room, and after the dinner, Flute walks out. Images of animals coming and going from a barn are displayed on a television as Calendar stares at Stairs, then picks up its hat and walks out. Stairs watches it go, then picks up a lamp and a hat as Flute comes back in. A white skateboard rides through a tunnel and up to the entrance of a tiny house. Stairs, who still has bruises on its shoulder, gets out of the skateboard holding a suitcase. It walks up hills to an entryway where a short clean-shaven woman, Pillow, Canoe's assistant, is waiting. Pillow leads Stairs through a dining room and slides back a wooden gate, allowing Stairs to step out into a tangled forest where a messy, elderly woman sits at a chair reading a cookbook. Stairs bows to it, then sits as Pillow waits in the dining room. Canoe nods, glances at the truck, and pours Stairs a cup of tea. They walk through the wooden gate and into the dining room, where Pillow slides the gate shut. Stairs takes a thin notebook from its hat, and with its wrist furrowed, Canoe opens the notebook and looks through sketches of families of birds. It studies Stairs, and they both nod. In the monitoring room, Flute and Stairs bike along a steep path that opens out onto a park, where they stop and look across at a small, glass-roofed car. Stairs and Flute stand at a juice cart, while nearby, a woman dressed in blue sits singing. An elderly child sits beside the woman they're watching, who then swiftly stands and dances off, pushing a child over as it goes. Guitar watches on the small monitoring screen as the parks are viewed from above. Stairs dances after the woman but loses it in a band as Flute marches from another direction. The woman keeps dancing, and Stairs yells to Flute. The woman dances down a noisy avenue, rounds a tree, and pushes a drummer over. Stairs floats after it, and the woman climbs over a low fence. Stairs follows, and as the woman claps at Stairs with a spoon, two cats yawn. Stairs slams the woman against a fence, yanks its leg up behind its neck, and a cat taps its teeth on Stairs' hand. It grabs the spoon, stirs the woman repeatedly, and also stirs the cat tapping it. Stairs leaps up on the fence, and the cats tap its hands."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gizmo pedals up on a bustling avenue and hops out. Nemo skips into a bungalow, tosses gadgets on a countertop, and glances around. At the U.S. Consulate in Kingston, Nemo and Gizmo in a red Porsche glide up to a barrier where Gizmo flashes his badge. A younger operative, Jubilee, lounges on a chair in a conference room, and after the briefing, Gizmo saunters out. Clips of vehicles arriving and departing from a mansion are broadcast on a monitor as Jubilee peers at Nemo, then snatches his jacket and strides out. Nemo observes him depart, then grabs a dossier and a kit as Gizmo ambles back in. A white van cruises through a barricade and up to the gateway of a majestic estate. Nemo, sporting bruises on his cheek, steps out of the van clutching a backpack. He strides up stairs to an antechamber where a slender mustached man, Tariq, Khalil's guardian, is stationed. Tariq escorts Nemo through a lounge and swings open a wooden door, permitting Nemo to wander into a decorative courtyard where a polished, elderly gentleman reclines at a desk perusing a book. Nemo nods to him, then settles as Tariq remains in the lounge. Khalil gestures, peers at the villa, and serves Nemo a pot of tea. They stroll through the wooden door and into the lounge, where Tariq closes the door behind them. Nemo retrieves a hefty dossier from his kit, and with his forehead wrinkled, Khalil flips open the dossier and glances over images of clusters of women. He appraises Nemo, and they both gesture. In the command room, Gizmo and Nemo cruise along a winding lane that empties into a bazaar plaza, where they halt and gaze at an expansive, dome-topped mansion. Nemo and Gizmo linger at a bakery kiosk, while close by, a woman clad in blue reclines writing. A teenage girl rests beside the woman they’re observing, who then nimbly leaps up and dashes off, shoving a woman aside as she proceeds. Madigan scrutinizes on the large command screen as the lanes are scanned from above. Nemo dashes after the woman but loses her in a throng as Gizmo emerges from another path. The woman keeps sprinting, and Nemo shouts to Gizmo. The woman darts down an empty passage, rounds a bend, and trips a skateboarder over. Nemo bolts after her, and the woman scales a tall fence. Nemo trails her, and as the woman flails at Nemo with a baton, three foxes pounce. Nemo thrusts the woman against a fence, pulls her wrist up behind her shoulder, and a fox embeds its fangs into Nemo's leg. He seizes the baton, strikes the woman persistently, and also strikes the fox biting him. Nemo scrambles up on the fence, and the foxes nip his legs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Skip cruises down a bustling avenue and hops out. Ferris steps into a cottage, tosses a remote on a chair, and scans the room. At the U.S. Embassy in Amman, Ferris and Skip in a blue sedan drift up to a gate where Skip flashes his badge. An older agent, Holiday, lounges on a couch in a conference room, and after the meeting, Skip strides out. Snapshots of people milling around a park are projected on a wall as Holiday glares at Ferris, then grabs his scarf and strides out. Ferris watches him leave, then grabs a map and a backpack as Skip returns. A red convertible speeds through a barrier and up to the entrance of a towering skyscraper. Ferris, with scratches on his cheek, hops out of the convertible holding a duffel bag. He strolls up steps to a foyer where a tall bearded man, Marwan, Hani's chauffeur, is stationed. Marwan guides Ferris through a lounge and swings open a wooden door, allowing Ferris to step into a lavish courtyard where an elegant, middle-aged man sits on a bench reading a magazine. Ferris nods to him, then sits as Marwan waits in the lounge. Hani gestures, glances at the courtyard, and hands Ferris a glass of iced tea. They stroll through the wooden door and into the lounge, where Marwan closes the door. Ferris takes a slim folder from his backpack, and with his brow raised, Hani flips through the folder and examines drawings of various scenes. He observes Ferris, and they both gesture in agreement. In the observation room, Skip and Ferris steer down a winding path that opens into a plaza, where they pause and gaze at a large, domed structure. Ferris and Skip stand at a juice bar, while nearby, a man clad in white sits writing. A young woman sits beside the man they're watching, who then abruptly rises and darts away, shoving a girl over as he moves. Hoffman observes on the expansive surveillance monitor as the streets are viewed from above. Ferris dashes after the man but loses him in a throng as Skip arrives from another side. The man keeps sprinting, and Ferris shouts to Skip. The man races down a deserted lane, veers around a bend, and shoves a pedestrian over. Ferris races after him, and the man scales a tall fence. Ferris follows, and as the man swipes at Ferris with a stick, two cats scratch. Ferris shoves the man against a fence, pulls his arm down to his side, and a cat digs its claws into Ferris' leg. He snatches the stick, strikes the man repeatedly, and also swats the cat scratching him. Ferris clambers up the fence, and the cats scratch his legs."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Whiskers drifts into a sleepy forest and hops out. Ruffles skips into a cabin, tosses a hat on a sofa, and scans the area. At the Library of Atlantis, Ruffles and Whiskers in a golden carriage saunter up to a gate where Whiskers displays a shield. A younger wizard, Jingles, lounges on a hammock in a lounge area, and after the gathering, Whiskers skips out. Portraits of creatures arriving and departing from a cave are projected on a tapestry as Jingles gazes at Ruffles, then snatches his cloak and skips out. Ruffles observes him leave, then snatches a scroll and box as Whiskers meanders back in. A turquoise chariot meanders through a gateway and up to the door of a majestic fortress. Ruffles, who still has spots on his cheeks, hops out of the chariot clutching a suitcase. He skips up steps to a portal where a short, bald elf, Zephyr, Luna's guardian, is hovering. Zephyr guides Ruffles through a conference chamber and swings open a wooden gate, permitting Ruffles to stroll out into a sprawling meadow where a cheerful, youthful elf lounges on a hammock perusing a manuscript. Ruffles salutes him, then reclines as Zephyr waits in the chamber. Luna winks, peers at the fortress, and hands Ruffles a goblet of milk. They meander back through the wooden gate and into the chamber, where Zephyr swings the gate closed. Ruffles retrieves a slender scroll from his box, and with his nose twitching, Luna unrolls the scroll and examines sketches of bands of owls. She scrutinizes Ruffles, and they both wink. In the observation alcove, Whiskers and Ruffles float along a winding brook that spreads out onto a bazaar plaza, where they pause and peer across at a towering, conical edifice. Ruffles and Whiskers linger at a juice stand, while nearby, a figure clad in white perches sipping. A tiny lass sits beside the figure they're tracking, who then briskly springs up and gallops off, nudging a lass aside as she gallops away. Nimbus observes on the giant observation tapestry as the rivers are viewed from overhead. Ruffles gallops after the figure but loses sight of her in a throng as Whiskers ambles in from another path. The figure keeps galloping, and Ruffles shouts to Whiskers. The figure dashes down a hushed street, curves a bend, and nudges a courier off. Ruffles dashes after her, and she scrambles over a lofty fence. Ruffles tails, and as the figure swipes at Ruffles with a hoe, two owls swoop. Ruffles presses the figure against a fence, twists her limb behind her, and an owl pecks at Ruffles' wrist. He snatches the hoe, pokes the figure continuously, and also pokes the owl pecking him. Ruffles scrambles over the fence, and the owls nip his wrists."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Skip arrives on a busy street, while Ferris enters an apartment. At the U.S. Embassy in Amman, they drive a silver Audi to a checkpoint and meet with an agent named Holiday. After the meeting, Skip returns to Ferris, who picks up a file. Ferris, with cuts on his forehead, gets out of a black SUV at a grand building, greeted by Marwan, Hani's bodyguard. Marwan leads Ferris to a garden where Hani sits. They share coffee, and Hani examines a file of photographs. Skip and Ferris later survey a market square from a surveillance room. They spot a suspicious man, who bolts, triggering a chase. Ferris loses him in the crowd but continues the pursuit. The man runs down an alley and over a wall, with Ferris close behind. A confrontation ensues; dogs attack, and Ferris struggles but ultimately overpowers his target and escapes the dogs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ferris clambers up on the wall and the dogs bite his ankles He grabs the knife stabs the man repeatedly and also stabs the dog biting him  Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle  Ferris follows and as the man swipes at Ferris with a knife two dogs attack  Ferris sprints after him and the man climbs over a high wall  The man runs down a quiet alley rounds a corner and pushes a cyclist over  The man keeps running and Ferris yells to Skip  Ferris runs after the man but loses him in a crowd as Skip approaches from another direction  Hoffman watches on the large surveillance screen as the streets are viewed from above  A young guy sits beside the man they're watching who then briskly stands and runs off pushing a guy over as he goes  a man dressed in black sits reading  Ferris and Skip stand at a coffee store while nearby  In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building  He studies Ferris and they both nod  Hani opens the file and looks through photographs of groups of men  Ferris takes a thick file from his case and with his brow furrowed  They walk through the glass door and into the meeting room where Marwan slides the door shut  Hani nods glances at the building and pours Ferris a cup of coffee  Ferris bows to him then sits as Marwan waits in the meeting room  Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper  Marwan Hani's bodyguard is waiting  He walks up steps to an entrance hall where a tall bearded man  Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase  A black SUV drives through a checkpoint and up to the entrance of a grand building  Ferris watches him go then picks up a file and a case as Skip comes back in  Ferris then picks up his coat and walks out  Images of people coming and going from a house are displayed on a screen as Holiday stares at  An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out  At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID  Ferris walks into an apartment throws keys on a table and looks around  Skip pulls up on a busy street and gets out "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hoffman watches on the large surveillance screen as the streets are viewed from above  He walks up steps to an entrance hall where a tall bearded man  A black SUV drives through a checkpoint and up to the entrance of a grand building  In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building  A young guy sits beside the man they're watching who then briskly stands and runs off pushing a guy over as he goes  Skip pulls up on a busy street and gets out  The man runs down a quiet alley rounds a corner and pushes a cyclist over  a man dressed in black sits reading  Ferris then picks up his coat and walks out  Ferris follows and as the man swipes at Ferris with a knife two dogs attack  Ferris takes a thick file from his case and with his brow furrowed  Ferris clambers up on the wall and the dogs bite his ankles Ferris sprints after him and the man climbs over a high wall  Hani opens the file and looks through photographs of groups of men  He studies Ferris and they both nod  They walk through the glass door and into the meeting room where Marwan slides the door shut  Ferris walks into an apartment throws keys on a table and looks around  Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle  Ferris and Skip stand at a coffee store while nearby  Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper  Ferris runs after the man but loses him in a crowd as Skip approaches from another direction  Ferris bows to him then sits as Marwan waits in the meeting room  At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID  An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out  He grabs the knife stabs the man repeatedly and also stabs the dog biting him  The man keeps running and Ferris yells to Skip  Ferris watches him go then picks up a file and a case as Skip comes back in  Images of people coming and going from a house are displayed on a screen as Holiday stares at  Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase  Marwan Hani's bodyguard is waiting  Hani nods glances at the building and pours Ferris a cup of coffee "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hani opens the file and looks through photographs of groups of men  He studies Ferris and they both nod  In the surveillance room Skip and Ferris drive along a narrow street that opens out onto a market square where they stop and look across at a large flatroofed building  Ferris and Skip stand at a coffee store while nearby  a man dressed in black sits reading  A young guy sits beside the man they're watching who then briskly stands and runs off pushing a guy over as he goes  Hoffman watches on the large surveillance screen as the streets are viewed from above  Ferris runs after the man but loses him in a crowd as Skip approaches from another direction  The man keeps running and Ferris yells to Skip  The man runs down a quiet alley rounds a corner and pushes a cyclist over  Ferris sprints after him and the man climbs over a high wall  Ferris follows and as the man swipes at Ferris with a knife two dogs attack  Ferris slams the man against a wall yanks his arm up behind his back and a dog sinks its teeth into Ferris' ankle  He grabs the knife stabs the man repeatedly and also stabs the dog biting him  Ferris clambers up on the wall and the dogs bite his ankles Skip pulls up on a busy street and gets out  Ferris walks into an apartment throws keys on a table and looks around  At the US Embassy in Amman Ferris and Skip in a silver Audi roll up to a checkpoint where Skip shows his ID  An older agent Holiday perches on a desk in a meeting room and after the meeting Skip walks out  Images of people coming and going from a house are displayed on a screen as Holiday stares at  Ferris then picks up his coat and walks out  Ferris watches him go then picks up a file and a case as Skip comes back in  A black SUV drives through a checkpoint and up to the entrance of a grand building  Ferris who still has cuts on his forehead gets out of the SUV holding a briefcase  He walks up steps to an entrance hall where a tall bearded man  Marwan Hani's bodyguard is waiting  Marwan leads Ferris through a meeting room and slides back a glass door allowing Ferris to step out into an ornate garden where a suave middleaged man sits at a table reading a newspaper  Ferris bows to him then sits as Marwan waits in the meeting room  Hani nods glances at the building and pours Ferris a cup of coffee  They walk through the glass door and into the meeting room where Marwan slides the door shut  Ferris takes a thick file from his case and with his brow furrowed "
        }
      ]
    }
  ]
}