{
  "ground_truth": "There's a stampede involving handbags, shoes, and gloves, all available for the taking, during which she puts down the tall pinkie boots that a woman grabs and snatches from her. Rebecca jumps on the woman, and later at home with her head slumped, she sits contemplating the mountain of shopping bags in front of her, including the Gucci boots. A message from Luke demanding the outline appears on her laptop, and she looks at her watch before slumping down at her desk. She idly pulls a coat from one of her bags, with her face folding as she reads the label. Rebecca looks at an empty photo frame on Luke's desk, while Luke regards her with a twinkle in his eye. Hayley brings Rebecca a note, and Luke picks up the phone. Hayley rushes back in as Rebecca, like a woman possessed, clambers onto the slippery boardroom table on all fours, propelling herself at the phone. Later in Luke's office, with Hayley present, Luke looks earnestly into Rebecca's face, glancing dubiously at Hayley, and Rebecca smiles meekly. She later opens a letter at her desk. At her home, Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back, causing Rebecca's expectant smile to freeze. A recreational vehicle crashes around the corner with Graham at the wheel, making Rebecca's face brighten. At the office, Wilson is looking at an Asian Web page while she wears a flirty, fishing-for-something kind of expression. Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil. Yawning with exhaustion, Luke steps into a lift to join Alette swathed in fur and leggy Alicia, before Alette sweeps out, and Alicia trips and falls into Luke's arms. In Miami, Florida, home to sun-kissed beaches and a marina full of private boats, Luke and Rebecca are at a magazine conference, after which Alicia goes off in a huff. Smiling women crowd around Rebecca, who grins across at Luke as his eyebrows shoot up with amusement, while a waitress hands her a cocktail, and Rebecca notices the man's name tag. A bony-faced, sandy-haired man appears, with whom she nose-nuzzles in Eskimo style before Luke leaves her to it, and she peers blankly at Janne. Luke oversees Janne waiting for an answer, leading her to slap Janne's face. Alicia, pouring champagne, misses the glass as she watches in horror, while Rebecca answers her mobile and glances around furtively on a breezy terrace, taking a deep, deep breath. She takes a man to a men's store where he slumps on a seat and shoots her a look, making her recoil. She then straightens his bow tie, helps him with a black tuxedo, and sits down to face him before he pulls her onto the dance floor, puts one arm around her waist, and clasps her right hand in his left hand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "There is a rush involving purses, footwear, and mittens, all obtainable for the taking, during which she places down the high pinkie footwear that a lady seizes and yanks from her. Rebecca leaps on the lady, and later at house with her head drooped, she resides contemplating the heap of shopping sacks in front of her, including the Gucci footwear. A notification from Luke demanding the summary emerges on her computer, and she glances at her timepiece before drooping down at her workstation. She idly extracts a jacket from one of her sacks, with her visage creasing as she interprets the label. Rebecca gazes at an unoccupied picture frame on Luke's station, while Luke observes her with a sparkle in his eye. Hayley brings Rebecca a note, and Luke lifts the receiver. Hayley dashes back in as Rebecca, like a lady driven, crawls onto the slick boardroom table on all fours, hurling herself at the receiver. Later in Luke's chamber, with Hayley present, Luke looks sincerely into Rebecca's visage, peering doubtfully at Hayley, and Rebecca beams timidly. She later opens an envelope at her workstation. At her house, Rebecca's smiling father conjures a coin from behind her ear and places it into her extended hand before settling himself down on an armchair that tips back, causing Rebecca's hopeful grin to freeze. A motorhome crashes around the corner with Graham at the helm, making Rebecca's visage glow. At the station, Wilson is viewing an Asian Web page while she sports a coquettish, angling-for-something type of expression. Suze is trying on a frothy white tulle bridal gown as Suze's mother tries on her veil. Yawning with fatigue, Luke steps into a lift to join Alette enveloped in fur and long-legged Alicia, before Alette sweeps out, and Alicia trips and falls into Luke's embrace. In Miami, Florida, home to sun-drenched shores and a harbor full of private vessels, Luke and Rebecca are at a journal conference, after which Alicia goes off in a tantrum. Smiling women congregate around Rebecca, who grins across at Luke as his eyebrows raise with mirth, while a server hands her a cocktail, and Rebecca notices the man's identification tag. A sharp-featured, sandy-haired man surfaces, with whom she nose-nuzzles in Eskimo fashion before Luke departs her to it, and she peers vacantly at Janne. Luke supervises Janne waiting for a reply, leading her to slap Janne's visage. Alicia, pouring sparkling wine, misses the vessel as she watches in alarm, while Rebecca answers her mobile and glances around covertly on a breezy terrace, drawing a profound, profound inhale. She takes a man to a men's shop where he droops on a seat and shoots her a look, making her recoil. She then straightens his necktie, assists him with a black dinner jacket, and sits down to confront him before he pulls her onto the dance floor, places one limb around her midsection, and clasps her right hand in his left hand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Here's the transformed text:\n\nA stampede involving handbags, shoes, and gloves, all available for the taking, is caused, during which the tall pinkie boots are put down by her and grabbed and snatched by a woman. The woman is jumped on by Rebecca, and later at home with her head slumped, the mountain of shopping bags is contemplated by her as she sits in front of them, including the Gucci boots. A message from Luke demanding the outline is seen on her laptop, and her watch is looked at before she slumps down at her desk. A coat is idly pulled from one of her bags by her, with the label being read by her as her face folds. An empty photo frame on Luke's desk is looked at by Rebecca, while she is regarded with a twinkle in his eye by Luke. Rebecca is brought a note by Hayley, and a phone call is made by Luke. Hayley rushes back in as a possessed woman clambers onto the slippery boardroom table on all fours, propelling herself at the phone—Rebecca. Later in Luke's office, with Hayley present, Rebecca's face is earnestly looked into by Luke, who glances dubiously at Hayley, and a meek smile is shown by Rebecca. She later opens a letter at her desk. At her home, a coin is magicked from behind Rebecca's ear by her smiling dad and put into her outstretched hand before an easy chair that tips back is plunked down onto by him, causing Rebecca's expectant smile to freeze. Around the corner, a recreational vehicle crashes with Graham at the wheel, and Rebecca's face brightens. At the office, an Asian Web page is looked at by Wilson while a flirty, fishing-for-something kind of expression is worn by her. A frothy white tulle wedding dress is tried on by Suze as her veil is tried on by Suze's mom. Yawning with exhaustion, into a lift steps Luke to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Luke catches Alicia as she trips and falls into his arms. In Miami, Florida, home to sun-kissed beaches and a marina full of private boats, Rebecca and Luke attend a magazine conference, after which Alicia goes off in a huff. Rebecca is crowded around by smiling women, who grin across at Luke, making his eyebrows shoot up with amusement, while a cocktail is handed to her by a waitress, and the man's name tag is noticed by Rebecca. A bony-faced, sandy-haired man appears, with whom Eskimo style nose-nuzzling is done by her before she is left to it by Luke, and a blank look is given to Janne by her. Janne is overseen waiting for an answer by Luke, leading to Janne's face being slapped by her. Champagne is poured by Alicia, who misses the glass as she watches in horror, while her mobile is answered by Rebecca who furtively glances around on a breezy terrace, taking a deep, deep breath. A man is taken to a men's store by her, where he slumps on a seat and shoots her a look, making her recoil. His bow tie is then straightened by her, a black tuxedo is helped on by her, and she sits down to face him before she is pulled onto the dance floor by him, her waist is encircled by one arm of his, and her right hand is clasped in his left hand."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "There's a stampede for handbags, shoes, and gloves, during which Rebecca puts down tall pinkie boots that a woman snatches. Rebecca jumps on the woman, and later at home, she contemplates a mountain of shopping bags, including the Gucci boots. A message from Luke demanding the outline appears on her laptop, and she checks her watch before slumping at her desk. She idly pulls a coat from a bag, grimacing at the label. Rebecca sees an empty photo frame on Luke's desk, while he regards her with amusement. Hayley brings Rebecca a note, and Luke answers the phone. Hayley rushes in as Rebecca climbs onto the boardroom table, reaching for the phone. Later, in Luke's office, he looks earnestly at Rebecca, glancing at Hayley, and Rebecca smiles meekly. She receives a letter at her desk. At home, her dad magics a coin from behind her ear and gives it to her, then plops down on a chair that tips back, freezing her smile. A recreational vehicle with Graham at the wheel makes Rebecca's face brighten. At the office, Wilson browses an Asian Web page, wearing a flirty expression. Suze tries on a frothy white wedding dress while her mom tries the veil. Luke, yawning with exhaustion, enters a lift with Alette and Alicia, who trips into his arms. In Miami, at a magazine conference, Alicia storms off. Smiling women crowd Rebecca, who grins at Luke as a waitress hands her a cocktail, and she notices a man's name tag. A bony-faced, sandy-haired man, with whom she nose-nuzzles, appears before Luke leaves her to it. Luke oversees Janne, leading to her slapping Janne's face. Alicia, pouring champagne, misses the glass in horror, as Rebecca answers her mobile and glances around a breezy terrace, taking a deep breath. She takes a man to a men's store where he slumps on a seat and shoots her a look, making her recoil. She then straightens his bow tie, helps him with a tuxedo, sits with him, and he pulls her onto the dance floor, putting one arm around her waist and clasping her hand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In a stampede for handbags, shoes, and gloves, Rebecca puts down the pinkie boots a woman grabs. She jumps on the woman, then sits at home, contemplating a mountain of shopping bags, including Gucci boots. Luke's message demanding an outline appears, and she checks her watch before slumping at her desk, examining a coat's label. At the office, she looks at a photo frame as Hayley brings a note. Rebecca climbs the boardroom table for the phone. Later, Luke earnestly speaks to her, Hayley present, and Rebecca smiles meekly. At home, her dad magics a coin behind her ear, but tips back in his chair, freezing her smile. Graham crashes around the corner, brightening Rebecca's face. At work, Wilson browses an Asian Web page as Suze tries a wedding dress. Exhausted, Luke enters a lift with Alette and Alicia, who falls into his arms. In Miami, Luke and Rebecca attend a magazine conference. Alicia storms off, and women flock to Rebecca. A waitress gives her a cocktail, and she notices a man's name tag. A sandy-haired man appears; Rebecca nose-nuzzles him Eskimo-style before Luke leaves. Luke watches Janne, leading her to slap Janne. Alicia pours champagne, missing the glass, as Rebecca answers her mobile on a breezy terrace. She takes a man to a men's store, where he slumps, and she adjusts his bow tie. They dance, his arm around her waist, clasping hands."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the midst of a frenzied stampede that seems to include an overwhelming assortment of handbags, shoes, and gloves, all freely available for the taking, she finds herself caught up in the chaos. During this frenzy, she momentarily sets down the tall pinkie boots she had been eyeing, only for another woman to swiftly grab and snatch them away from her. Reacting instinctively, Rebecca launches herself at this woman in an attempt to reclaim the coveted boots. Later, when she is at home, she sits with her head slumped in thought, contemplating the impressive mountain of shopping bags amassed in front of her, including a prized pair of Gucci boots among the collection. As she does so, a message from Luke, demanding the outline, flashes onto her laptop screen. She looks at her watch, then slumps down at her desk, tired and perhaps overwhelmed. Without much thought, she idly pulls a coat from one of her bags, her face crumpling with disappointment as she reads the label. \n\nRebecca's gaze rests upon an empty photo frame on Luke's desk, while Luke, with a twinkle in his eye, watches her with interest. Hayley enters with a note in hand for Rebecca, and simultaneously, Luke picks up the phone. Hayley rushes back hurriedly just as Rebecca, seemingly possessed by a sudden spirit of determination, clambers onto the slippery boardroom table on all fours, attempting to propel herself toward the phone. Later, gathered in Luke's office with Hayley in attendance, Luke looks sincerely into Rebecca's eyes, though he occasionally glances with a hint of skepticism toward Hayley. Rebecca, in turn, offers a meek smile of her own. At a subsequent moment, she opens a letter at her desk, her expression unreadable. At her home, her father's magic trick, wherein he pulls a coin from behind her ear and deposits it into her outstretched hand, briefly makes her smile with delight. However, the smile freezes when he flops down into an easy chair that tips back precariously. \n\nA recreational vehicle careens wildly around the corner with Graham confidently at the wheel, instantly brightening Rebecca’s expression. Back at the office, Wilson is absorbed in examining an Asian Web page as he banters playfully, wearing an expression that hints at a kind of flirty inquiry. Meanwhile, Suze is trying on a frothy white tulle wedding dress, with Suze's mother assisting by trying on a veil. Yawning from sheer exhaustion, Luke steps into the lift, where he encounters Alette, elegantly swathed in fur, and the statuesque Alicia. As Alette gracefully exits, Alicia stumbles and falls directly into Luke's waiting arms. \n\nIn Miami, Florida, a place renowned for its sun-kissed beaches and a marina teeming with private boats, Luke and Rebecca find themselves attending a magazine conference. Following the event, Alicia departs in a huff, clearly displeased. A group of smiling women gathers around Rebecca, who returns their smiles and grins back at Luke, who raises his eyebrows in amused surprise. During this, a waitress hands Rebecca a cocktail, and she notices the man nearby wearing a name tag. A man with a bony face and sandy hair makes an appearance, and Rebecca greets him by nose-nuzzling in an Eskimo style. Observing this interaction, Luke leaves her to it and exits the scene, leaving Rebecca to blankly peer at Janne. Luke oversees Janne, who waits expectantly for an answer, only to be met by a slap in surprise. Meanwhile, Alicia is seen pouring champagne, but in her distracted state, misses the glass altogether. Rebecca, caught up in the moment, answers her mobile and then glances around furtively while standing on a breezy terrace, taking a deep, grounding breath. Soon after, she escorts a man to a stylish men's store, where he slumps into a seat and shoots her a look of exasperation that makes her momentarily recoil. Determined to help, she straightens his bow tie and assists him with a black tuxedo, finally sitting down opposite him. He then surprises her by pulling her onto the dance floor, placing one arm around her waist, and clasping her right hand gently in his left."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Amidst the swirling chaos of what seems to be an overwhelmingly frenzied stampede, where a vast and varied array of handbags, shoes, and gloves appear to be freely up for grabs, she finds herself entangled in the pandemonium. Amid this tumultuous scene, there comes a moment when she momentarily places down the tall pinkie boots she had been keenly watching, only for another woman to quickly seize the opportunity to grab and snatch them away from her grasp. Acting purely on instinct, and without a moment’s hesitation, Rebecca launches herself at this woman, determined to reclaim the coveted pair of boots. Later, when she is finally at home, she sits with her head bowed in contemplation, reflecting on the impressive mountain of shopping bags that have accumulated in front of her, which includes a prized pair of Gucci boots amid the collection. As she does so, a message from Luke, demanding the outline, suddenly flashes onto her laptop screen. She glances at her watch before slumping down at her desk, feeling both tired and perhaps a bit overwhelmed. Without much consideration, she absentmindedly pulls a coat from one of her bags, her face crumpling with disappointment as she reads the label. \n\nRebecca’s eyes settle momentarily on an empty photo frame resting on Luke’s desk, while Luke, with a twinkle in his eye, observes her with keen interest. Hayley then enters, carrying a note in her hand meant for Rebecca, and simultaneously, Luke picks up the phone. Hayley dashes back hurriedly just as Rebecca, seemingly possessed by a sudden surge of determination, climbs onto the slippery boardroom table on all fours, attempting to propel herself toward the phone. Later, gathered in Luke's office with Hayley present, Luke gazes sincerely into Rebecca’s eyes, although he occasionally darts a glance with a hint of skepticism toward Hayley. Rebecca, in response, offers a meek, tentative smile of her own. At a later point, she opens a letter at her desk, her expression inscrutable and hard to read. Back at her home, her father performs a magic trick where he seemingly pulls a coin from behind her ear and deposits it into her outstretched hand, briefly making her smile with delight. However, her smile becomes frozen when he flops down into an easy chair that tips back precariously. \n\nA recreational vehicle comes careening wildly around the corner with Graham sitting confidently at the wheel, this sight instantly brightens Rebecca’s face. Back in the office environment, Wilson is deeply engrossed in examining an Asian Web page as he playfully banters, his expression hinting at a kind of flirty inquiry. Meanwhile, Suze is in the process of trying on a frothy white tulle wedding dress, with Suze's mother assisting her by adorning a veil. Yawning from sheer exhaustion, Luke steps casually into the lift, where he encounters Alette, elegantly draped in luxurious fur, and the statuesque Alicia. As Alette makes her graceful exit, Alicia stumbles and falls directly into Luke's awaiting arms. \n\nIn the vibrant city of Miami, Florida, a place widely renowned for its sun-kissed beaches and a marina teeming with private boats, Luke and Rebecca find themselves attending a magazine conference. Following the event, Alicia departs in a huff, clearly displeased and agitated. A group of smiling women gathers around Rebecca, who returns their smiles warmly and grins back at Luke, who raises his eyebrows in amused surprise. During this interaction, a waitress hands Rebecca a cocktail, and she happens to notice a man nearby wearing a name tag. A man with a bony face and sandy hair makes an appearance, and Rebecca greets him with an Eskimo-style nose nuzzle. Observing this peculiar interaction, Luke leaves her to it and quietly exits the scene, leaving Rebecca to blankly peer at Janne. Luke oversees Janne, who waits expectantly for a response, only to be met with a surprising slap. Meanwhile, Alicia is seen pouring champagne, but in her distracted state, she misses the glass altogether. Caught up in the moment, Rebecca answers her mobile phone and then glances around furtively while standing on a breezy terrace, taking a deep, grounding breath. Soon after, she escorts a man to a stylish men's store, where he slumps into a seat and shoots her a look of pure exasperation, causing her to momentarily recoil. Determined to assist, she straightens his bow tie and helps him with a black tuxedo, eventually sitting down opposite him. He then unexpectedly surprises her by pulling her onto the dance floor, placing one arm around her waist and clasping her right hand gently in his left."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the midst of a chaotic stampede involving handbags, shoes, and gloves available for the taking, she carefully places down the tall pinkie boots only to watch as another woman quickly seizes and snatches them from her grasp. Reacting instinctively, Rebecca leaps onto the woman in an attempt to reclaim what was taken. Later, back at home, with her head slumped down in thought, she sits quietly, contemplating the daunting mountain of shopping bags piled before her, notably including the coveted Gucci boots. Her laptop suddenly lights up with a message from Luke, demanding the outline, prompting her to glance at her watch, then tiredly slouch down at her desk. She absentmindedly reaches into the bags, drawing out a coat, her facial expression crumbling as she reads the label with disappointment. In the office, Rebecca's gaze drifts to an empty photo frame on Luke's desk, catching Luke's eye, who looks back with a mischievous twinkle. Hayley enters to hand Rebecca a note, while simultaneously, Luke reaches for the phone. In a flurry of action, Hayley rushes back in just as Rebecca, driven by a sudden burst of energy, crawls onto the slippery boardroom table on all fours, propelling her entire body toward the phone in desperation. Later, in Luke’s office, with Hayley standing witness, Luke peers earnestly into Rebecca's eyes, casting a dubious glance toward Hayley, while Rebecca responds with a sheepish smile. She later opens a letter at her desk, processing its contents. At her home, her father, smiling warmly, performs a magic trick, producing a coin seemingly from behind her ear and placing it into her open hand. He then settles into an easy chair which unexpectedly tips back, causing Rebecca’s expectant smile to falter. Meanwhile, a recreational vehicle careens around the corner with Graham at the helm, prompting Rebecca's face to light up with delight. Back at the office, Wilson examines an Asian Web page while displaying a flirty, curious expression. Meanwhile, Suze enthusiastically tries on a frothy white tulle wedding dress, with Suze’s mom assisting by trying on her veil. Luke, exhausted and yawning, steps into an elevator where he encounters Alette, cloaked in luxurious fur, alongside the leggy Alicia. After Alette makes a dramatic exit, Alicia stumbles, tripping into Luke's arms. In the vibrant setting of Miami, Florida, surrounded by sun-drenched beaches and a bustling marina filled with private boats, Luke and Rebecca attend a magazine conference. Following the event, Alicia departs in a huff. Cheerful women gather around Rebecca, who beams at Luke, catching his amused expression as his eyebrows raise in surprise. A waitress offers her a cocktail, and Rebecca carefully observes the name tag of a man nearby. A sharp-featured, sandy-haired man appears, and she playfully nose-nuzzles him in an Eskimo style, while Luke steps away, leaving her to engage with Janne. Under Luke's supervision, Janne waits expectantly for a response, prompting Rebecca to impulsively slap Janne's face. Alicia, meanwhile, attempts to pour champagne, missing the glass entirely as she watches the scene unfold in shock. Rebecca, receiving a call on her mobile, takes a moment to glance around furtively on the breezy terrace, collecting herself with a deep, calming breath. Later, she accompanies a man to a men's store, where he slumps onto a seat and casts her a look that causes her to step back, startled. Regaining her composure, she methodically straightens his bow tie, assists him in donning a sleek black tuxedo, and then sits facing him, only for him to suddenly pull her onto the dance floor. He places one arm securely around her waist and clasps her right hand tightly in his left, drawing her into the rhythm of the dance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "During a chaotic stampede for handbags, shoes, and gloves, Rebecca loses a pair of pink boots to another woman. Later, at home, she reflects on her shopping spree and the pile of bags before her, including the Gucci boots. A message from Luke prompts her to check the time and slump down at her desk, examining her purchases with disappointment. In the office, she notices an empty photo frame on Luke's desk as he observes her with amusement. Hayley brings a note, leading to Rebecca frantically scrambling across a boardroom table to reach the phone. In Luke's office, alongside Hayley, Luke discusses something with Rebecca, who smiles meekly. Back at her desk, she opens a letter. At home, her dad charms her by producing a coin from behind her ear; however, his antics cause some awkwardness. Graham's arrival in a recreational vehicle lifts Rebecca's spirits. At the office, Wilson focuses on an Asian webpage while Rebecca seems to fish for information. Meanwhile, Suze tries on a wedding dress as her mom assists with the veil. Exhausted, Luke enters a lift with Alette and Alicia, where a mishap causes Alicia to fall into his arms. In Miami, during a magazine conference, Rebecca engages with the attendees, grinning at Luke in amusement before a cocktail is handed to her. She encounters a sandy-haired man with whom she shares an Eskimo nose nuzzle, and after Luke leaves, she is left awkwardly with Janne, ultimately slapping Janne's face. This shocks onlookers, including Alicia, who spills champagne. Rebecca, on a terrace, takes a call and gathers herself. She then assists a man in trying on a tuxedo, adjusting his bow tie and joining him on the dance floor, where they share a dance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "There’s a stampede involving handbags, shoes, and gloves, all key fashion accessories in high demand, available for the taking during which she puts down the tall pinkie boots, a trendy style in fashion circles, that a woman grabs and snatches from her. Rebecca jumps on the woman, and later at home with her head slumped, she sits contemplating the mountain of shopping bags in front of her, including the Gucci boots, a luxury brand symbolizing opulence and style. A message from Luke, her boss with a reputation for demanding excellence, demanding the outline appears on her laptop, and she looks at her watch before slumping down at her desk. She idly pulls a designer coat from one of her bags, with her face folding as she reads the label that indicates its high price. Rebecca looks at an empty photo frame, a symbol of unfilled dreams or memories, on Luke's desk, while Luke regards her with a twinkle in his eye, hinting at his fondness for her eccentricity. Hayley brings Rebecca a note, and Luke picks up the phone to make an important business call. Hayley rushes back in as Rebecca, like a woman possessed, clambers onto the slippery boardroom table on all fours, propelling herself at the phone, in a desperate attempt to seize control of the situation. Later in Luke's office, with Hayley present, Luke looks earnestly into Rebecca's face, glancing dubiously at Hayley, and Rebecca smiles meekly, aware of the tension in the room. She later opens a letter at her desk that carries unexpected news. At her home, Rebecca's smiling dad, a magician in his spare time, magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back, causing Rebecca's expectant smile to freeze, a sign of something amiss. A recreational vehicle, a popular choice for adventurous family vacations, crashes around the corner with Graham at the wheel, making Rebecca's face brighten at the sight of her old friend. At the office, Wilson is looking at an Asian Web page, potentially for important research, while she wears a flirty, fishing-for-something kind of expression. Suze is trying on a frothy white tulle wedding dress, a classic choice for brides, as Suze's mom tries on her veil, both caught up in the anticipation of the upcoming wedding. Yawning with exhaustion, Luke steps into a lift to join Alette, a fashion mogul known for her extravagant style, swathed in fur and leggy Alicia, before Alette sweeps out, and Alicia trips and falls into Luke's arms, creating an awkward but amusing moment. In Miami, Florida, home to sun-kissed beaches and a marina full of private boats, Luke and Rebecca are at a magazine conference, a networking hub for industry professionals, after which Alicia goes off in a huff, perhaps due to professional rivalry. Smiling women crowd around Rebecca, who grins across at Luke as his eyebrows shoot up with amusement, while a waitress hands her a cocktail, a popular Miami concoction, and Rebecca notices the man’s name tag which reads Janne. A bony-faced, sandy-haired man appears, with whom she nose-nuzzles in Eskimo style, a playful gesture of affection, before Luke leaves her to it, and she peers blankly at Janne, the man behind the name tag. Luke oversees Janne waiting for an answer, leading her to slap Janne’s face, a shocking turn of events. Alicia, pouring champagne, misses the glass as she watches in horror, while Rebecca, caught in the chaos, answers her mobile and glances around furtively on a breezy terrace, taking a deep, deep breath to steady herself. She takes a man to a men’s store where he slumps on a seat and shoots her a look, making her recoil, perhaps due to exhaustion or dissatisfaction. She then straightens his bow tie, helps him with a black tuxedo, an essential for formal events, and sits down to face him before he pulls her onto the dance floor, puts one arm around her waist, and clasps her right hand in his left hand, initiating a graceful dance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots She idly pulls a coat from one of her bags with her face folding as she reads the label At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk She idly pulls a coat from one of her bags with her face folding as she reads the label Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye In Miami Florida home to sunkissed beaches and a marina full of private boats Hayley brings Rebecca a note and Luke picks up the phone Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly She later opens a letter at her desk At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression She later opens a letter at her desk Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms In Miami Florida home to sunkissed beaches and a marina full of private boats Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne Luke oversees Janne waiting for an answer leading her to slap Janne's face Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her. Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots. A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk. She idly pulls a coat from one of her bags with her face folding as she reads the label. Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye. Hayley brings Rebecca a note and Luke picks up the phone. Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone. Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly. She later opens a letter at her desk. At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze. A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression. Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil. Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms. In Miami Florida home to sunkissed beaches and a marina full of private boats. Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff. Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag. A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne. Luke oversees Janne waiting for an answer leading her to slap Janne's face. Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath. She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil. She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her. Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots. A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk. She idly pulls a coat from one of her bags with her face folding as she reads the label. Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye. Hayley brings Rebecca a note and Luke picks up the phone. Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone. Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly. She later opens a letter at her desk. At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze. A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression. Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil. Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms. In Miami Florida home to sunkissed beaches and a marina full of private boats. Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff. Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag. A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne. Luke oversees Janne waiting for an answer leading her to slap Janne's face. Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath. She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil. She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her. Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots. A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk. She idly pulls a coat from one of her bags with her face folding as she reads the label. Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye. Hayley brings Rebecca a note and Luke picks up the phone. A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne. Luke oversees Janne waiting for an answer leading her to slap Janne's face. Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath. She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil. She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her. Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots. A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk. She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil. She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "There's a stampede involving handbags, shoes, and gloves, all available for the taking, during which the squirrel puts down the tall pinkie boots that a dolphin grabs and snatches from the squirrel. The rabbit jumps on the dolphin, and later at home with its head slumped, the rabbit sits contemplating the mountain of shopping bags in front of it, including the Gucci boots. A message from the owl demanding the outline appears on its laptop, and the rabbit looks at its watch before slumping down at its desk. The rabbit idly pulls a coat from one of its bags, with its face folding as it reads the label. The rabbit looks at an empty photo frame on the owl's desk, while the owl regards the rabbit with a twinkle in its eye. The lizard brings the rabbit a note, and the owl picks up the phone. The lizard rushes back in as the rabbit, like a woman possessed, clambers onto the slippery boardroom table on all fours, propelling itself at the phone. Later in the owl's office, with the lizard present, the owl looks earnestly into the rabbit's face, glancing dubiously at the lizard, and the rabbit smiles meekly. The rabbit later opens a letter at its desk. At its home, the rabbit's smiling cat magics a coin from behind its ear and puts it into its outstretched hand before plunking itself down on an easy chair that tips back, causing the rabbit's expectant smile to freeze. A recreational vehicle crashes around the corner with the llama at the wheel, making the rabbit's face brighten. At the office, the kangaroo is looking at an Asian Web page while it wears a flirty, fishing-for-something kind of expression. The peacock is trying on a frothy white tulle wedding dress as the peacock's frog tries on its veil. Yawning with exhaustion, the fox steps into a lift to join the tiger swathed in fur and leggy elephant, before the tiger sweeps out, and the elephant trips and falls into the fox's arms. In Miami, Florida, home to sun-kissed beaches and a marina full of private boats, the fox and the rabbit are at a magazine conference, after which the elephant goes off in a huff. Smiling women crowd around the rabbit, who grins across at the fox as its eyebrows shoot up with amusement, while a waitress hands the rabbit a cocktail, and the rabbit notices the man's name tag. A bony-faced, sandy-haired man appears, with whom the rabbit nose-nuzzles in Eskimo style before the fox leaves it to it, and it peers blankly at the giraffe. The fox oversees the giraffe waiting for an answer, leading it to slap the giraffe's face. The elephant, pouring champagne, misses the glass as it watches in horror, while the rabbit answers its mobile and glances around furtively on a breezy terrace, taking a deep, deep breath. The rabbit takes a turtle to a men's store where the turtle slumps on a seat and shoots the rabbit a look, making the rabbit recoil. The rabbit then straightens the turtle's bow tie, helps the turtle with a black tuxedo, and sits down to face the turtle before it pulls the rabbit onto the dance floor, puts one arm around the rabbit's waist, and clasps its right hand in its left hand."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "There's a stampede involving umbrellas, scarves, and hats, all available for the taking, during which she puts down the striped mittens that a child grabs and snatches from her. Rebecca jumps on the child, and later at home with her head slumped, she sits contemplating the mountain of picnic baskets in front of her, including the Prada loafers. A message from Luke demanding the blueprint appears on her tablet, and she looks at her clock before slumping down at her counter. She idly pulls a sweater from one of her baskets, with her face folding as she reads the tag. Rebecca looks at an empty art frame on Luke's cabinet, while Luke regards her with a twinkle in his eye. Hayley brings Rebecca a postcard, and Luke picks up the remote. Hayley rushes back in as Rebecca, like a woman possessed, clambers onto the slippery kitchen island on all fours, propelling herself at the remote. Later in Luke's cubicle, with Hayley present, Luke looks earnestly into Rebecca's face, glancing dubiously at Hayley, and Rebecca smiles meekly. She later opens a package at her counter. At her home, Rebecca's smiling mom magics a flower from behind her ear and puts it into her outstretched hand before plunking herself down on a bean bag that tips back, causing Rebecca's expectant smile to freeze. A vintage car crashes around the corner with Graham at the wheel, making Rebecca's face brighten. At the office, Wilson is looking at an Australian Web page while she wears a flirty, fishing-for-something kind of expression. Suze is trying on a silky pink lace party dress as Suze's friend tries on her hat. Yawning with exhaustion, Luke steps into a tram to join Alette swathed in wool and leggy Alicia, before Alette sweeps out, and Alicia trips and falls into Luke's arms. In Athens, Greece, home to ancient ruins and a courtyard full of olive trees, Luke and Rebecca are at a fashion conference, after which Alicia goes off in a huff. Smiling women crowd around Rebecca, who grins across at Luke as his eyebrows shoot up with amusement, while a florist hands her a latte, and Rebecca notices the man's name tag. A bony-faced, sandy-haired man appears, with whom she nose-nuzzles in Eskimo style before Luke leaves her to it, and she peers blankly at Janne. Luke oversees Janne waiting for an answer, leading her to slap Janne's face. Alicia, pouring lemonade, misses the glass as she watches in horror, while Rebecca answers her tablet and glances around furtively on a breezy balcony, taking a deep, deep breath. She takes a man to a barber shop where he slumps on a stool and shoots her a look, making her recoil. She then straightens his scarf, helps him with a brown jacket, and sits down to face him before he pulls her onto the patio, puts one arm around her waist, and clasps her right hand in his left hand."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "There's a stampede involving handbags, shoes, and gloves, all available for the taking, during which she lifts the tall pinkie boots that a woman drops and retrieves from her. Rebecca swings at the woman, and later at home with her head lifted, she stands evaluating the mountain of shopping bags in front of her, including the Gucci boots. A message from Luke requesting the outline pops up on her laptop, and she glances at her watch before rising at her desk. She leisurely pushes a coat into one of her bags, with her face brightening as she reads the label. Rebecca glances at an empty photo frame on Luke's desk, while Luke gazes at her with a gleam in his eye. Hayley hands Rebecca a note, and Luke sets down the phone. Hayley dashes back in as Rebecca, like a woman possessed, crawls onto the slippery boardroom table on all fours, launching herself at the door. Later in Luke's office, with Hayley present, Luke peers earnestly into Rebecca's face, glancing suspiciously at Hayley, and Rebecca grins shyly. She later discovers a letter at her desk. At her home, Rebecca's smiling dad hides a coin from behind her ear and places it into her outstretched hand before settling himself down on an easy chair that tips back, causing Rebecca's expectant smile to falter. A recreational vehicle swerves around the corner with Graham at the wheel, making Rebecca's face glow. At the office, Wilson is peering at an Asian Web page while she maintains a flirty, inquisitive kind of expression. Suze is trying on a frothy white tulle wedding dress as Suze's mom adjusts her veil. Yawning with exhaustion, Luke exits a lift to join Alette draped in fur and leggy Alicia, before Alette glides out, and Alicia slips and tumbles into Luke's arms. In Miami, Florida, home to sun-kissed beaches and a marina full of private boats, Luke and Rebecca are at a magazine conference, after which Alicia storms off in a huff. Smiling women flock around Rebecca, who beams across at Luke as his eyebrows rise with amusement, while a waitress offers her a cocktail, and Rebecca spots the man's name tag. A bony-faced, sandy-haired man emerges, with whom she cheek-nuzzles in Eskimo style before Luke leaves her to it, and she stares blankly at Janne. Luke observes Janne waiting for an answer, prompting her to poke Janne's shoulder. Alicia, pouring champagne, misses the glass as she watches in horror, while Rebecca answers her mobile and glances around covertly on a breezy terrace, taking a long, calming breath. She escorts a man to a men's store where he slumps on a seat and shoots her a glance, making her flinch. She then adjusts his bow tie, assists him with a black tuxedo, and sits down to face him before he twirls her onto the dance floor, puts one arm around her waist, and grips her right hand in his left hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "There's a parade involving violins, hats, and scarves, all available for the taking, during which the kettle puts down the blue elephant shoes that a book grabs and snatches from it. Samantha jumps on the book, and later at school with its ears drooping, it sits contemplating the hill of violin cases in front of it, including the Prada sneakers. A message from Oliver demanding the summary appears on its toaster, and it looks at its clock before slumping down at its sofa. It idly pulls a map from one of its cases, with its nose folding as it reads the title. Samantha looks at a blank trophy case on Oliver's cabinet, while Oliver regards it with a sparkle in his tooth. Jordan brings Samantha a postcard, and Oliver picks up the stapler. Jordan rushes back in as Samantha, like a mouse possessed, clambers onto the slippery dining room chair on all fours, propelling itself at the stapler. Later in Oliver's attic, with Jordan present, Oliver looks earnestly into Samantha's trunk, glancing dubiously at Jordan, and Samantha smiles shyly. It later opens a parcel at its bench. At its cabin, Samantha's smiling brother magics a ticket from behind its tail and puts it into its outstretched paw before plunking itself down on a bean bag that tips back, causing Samantha's astonished grin to freeze. An elephant crashes around the corner with Michael at the wheel, making Samantha's paws clap. At the barn, Taylor is looking at a Canadian magazine page while it wears a flirty, searching-for-treasure kind of expression. Jamie is trying on a frilly white lace birthday hat as Jamie's cousin tries on its bow. Yawning with delight, Oliver steps into a tram to join Zoe swathed in velvet and lanky Fiona, before Zoe sweeps out, and Fiona trips and falls into Oliver's elbows. In Paris, France, home to moonlit vineyards and a plaza full of lively sculptures, Oliver and Samantha are at a book club, after which Fiona goes off in a pout. Laughing clocks crowd around Samantha, who beams across at Oliver as his fingertips shoot up with interest, while a gardener hands it a flower, and Samantha notices the portrait's tag. A freckled-cheeked, curly-haired bottle appears, with whom it nose-nuzzles in a butterfly style before Oliver leaves it to it, and it peers blankly at Clara. Oliver oversees Clara waiting for an answer, leading it to slap Clara's boot. Fiona, pouring lemonade, misses the pitcher as it watches in surprise, while Samantha answers its radio and glances around cautiously on a misty boardwalk, taking a long, long pause. It takes a balloon to a bakery where it slumps on a couch and shoots it a frown, making it flinch. It then straightens its scarf, helps it with a red jacket, and sits down to face it before it pulls it onto the playground, puts one arm around its shoulder, and clasps its left paw in its right paw."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "There's a parade involving teacups, hats, and scarves, all up for grabs, during which the cat places down the striped mittens that a child grabs and seizes from her. Jessica skips on the child, and later in the garden with her head tilted, she stands pondering the stack of gift boxes in front of her, including the Prada mittens. A call from Mark requesting the summary appears on her tablet, and she glances at her calendar before slumping down at her dining table. She leisurely pulls a scarf from one of her boxes, with her face wrinkling as she examines the tag. Jessica glances at a blank calendar on Mark's wall, while Mark observes her with a smile in his eye. Emily brings Jessica a postcard, and Mark lifts the remote. Emily dashes back in as Jessica, like a cat in motion, scrambles onto the glossy conference table on all fours, launching herself at the remote. Later in Mark's kitchen, with Emily present, Mark peers seriously into Jessica's face, peeking skeptically at Emily, and Jessica chuckles softly. She later tears open a package at her table. At her office, Jessica's cheerful uncle conjures a flower from behind her head and places it into her open hand before settling himself on a sofa that reclines, causing Jessica’s eager grin to waver. A delivery van swerves around the corner with Carol at the wheel, causing Jessica's eyes to widen with excitement. In the studio, Oliver is admiring a European Web page while he displays a curious, searching-kind-of grin. Amy is slipping into a frothy white lace evening dress as Amy's sister adjusts her jewelry. Stretching with fatigue, Mark steps into an elevator to join Celeste cloaked in velvet and graceful Maria, before Celeste glides out, and Maria stumbles and lands into Mark's grasp. In Barcelona, Spain, known for sunlit plazas and a harbor full of sleek yachts, Mark and Jessica are at a publishing seminar, after which Maria storms off in annoyance. Laughing gentlemen gather around Jessica, who beams across at Mark as his eyes widen in amusement, while a server hands her a smoothie, and Jessica notices the woman's badge. A gaunt, curly-haired woman appears, with whom she nose-nuzzles in an Eskimo greeting before Mark leaves her to it, and she stares blankly at Oliver. Mark watches Oliver waiting for a decision, causing her to tap Oliver's shoulder. Maria, pouring lemonade, misses the cup as she watches in shock, while Jessica answers her cellphone and glances around cautiously on a sunny patio, taking a deep, deep breath. She escorts a woman to a women's boutique where she slouches on a stool and glances at her, making her flinch. She then adjusts her bow, assists her with a pastel gown, and sits down to observe her before she pulls her onto the dance floor, places one hand on her back, and clasps her left hand in her right hand."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "There's a parade involving satchels, sandals, and scarves, all available for the seizing, during which she sets down the tall lilac roller skates that a woman grabs and frisbees away from her. Rebecca vaults on the woman, and later at home with her head drooped, she sits pondering the mountain of laundry baskets in front of her, including the Prada hats. A message from Luke requesting the summary appears on her tablet, and she glances at her calendar before slouching down at her couch. She lazily pulls a blanket from one of her baskets, with her face crumpling as she reads the tag. Rebecca gazes at an empty notebook on Luke's bookshelf, while Luke regards her with a glint in his eye. Hayley brings Rebecca a postcard, and Luke reaches for the door. Hayley dashes back in as Rebecca, like a woman enchanted, crawls onto the slick dining table on all fours, jetting herself at the door. Later in Luke's study, with Hayley present, Luke peers earnestly into Rebecca's eyes, glancing skeptically at Hayley, and Rebecca smiles timidly. She later tears open a package at her desk. At her home, Rebecca's beaming dad pulls a rabbit from behind her ear and places it into her waiting hand before plunking himself down on a couch that reclines, causing Rebecca's hopeful grin to freeze. A dune buggy hurtles around the corner with Graham at the pedals, making Rebecca's eyes widen. At the office, Wilson is viewing an Indian website while she wears a playful, probing-for-answers kind of look. Suze is trying on a fluffy white chiffon cocktail dress as Suze's mom tries on her necklace. Yawning with fatigue, Luke steps onto an escalator to join Alette wrapped in velvet and long-legged Alicia, before Alette strides away, and Alicia trips and collapses into Luke's arms. In Malibu, California, home to sun-drenched cliffs and a marina full of sailboats, Luke and Rebecca are at a festival panel, after which Alicia stomps off in a snit. Laughing women gather around Rebecca, who beams across at Luke as his eyebrows arch with surprise, while a waitress offers her a mocktail, and Rebecca notices the man's lanyard. A gaunt, sandy-haired man arrives, with whom she cheek-nuzzles in a whisker style before Luke leaves her to it, and she peers blankly at Janne. Luke observes Janne waiting for a decision, prompting her to tap Janne's shoulder. Alicia, pouring cider, misses the mug as she watches in shock, while Rebecca answers her pager and glances around sneakily on a breezy dock, taking a deep, deep gulp. She takes a man to a men's tailor where he sprawls on a bench and shoots her a smirk, making her retreat. She then adjusts his pocket square, assists him with a velvet jacket, and settles down to face him before he pulls her onto the skating rink, puts one arm around her shoulders, and links her right hand with his left hand."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "There's a parade involving bicycles, jackets, and hats, all available for the keeping, during which he sets down the giant striped mittens that a child snatches and scurries away with. Jonathan leaps on the child, and later at a café with his hat tilted, he sits pondering the tower of pastries in front of him, including the Prada pastries. A note from Emma requesting the blueprint appears on his tablet, and he glances at his ring before sliding down at his chair. He absentmindedly pulls a scarf from one of his parcels, with his expression twisting as he examines the price tag. Jonathan gazes at an empty fishbowl on Emma's table, while Emma views him with a glimmer in her stare. Alex brings Jonathan a postcard, and Emma grabs the laptop. Alex hurries back in as Jonathan, like a restless child, crawls onto the polished conference platform on all fours, launching himself at the laptop. Later in Emma's study, with Alex present, Emma peers earnestly into Jonathan's eyes, glancing skeptically at Alex, and Jonathan grins shyly. He later unfolds a package at his workstation. At his apartment, Jonathan's beaming mother produces a flower from behind his shoulder and hands it into his open palm before dropping herself on a cushioned ottoman that rocks back, causing Jonathan's eager grin to freeze. A bicycle skids around the bend with Martin at the handlebars, making Jonathan's face brighten. At the firm, Oliver examines a European Web page while he wears a curious, questing-for-something sort of look. Jamie is trying on a fluffy pink satin evening gown as Jamie's aunt adjusts her tiara. Yawning with fatigue, Emma steps into an escalator to join Clara draped in silk and tall Tony, before Clara sweeps away, and Tony stumbles and falls into Emma's grip. In Los Angeles, California, home to fog-covered mountains and a harbor full of yachts, Emma and Jonathan are at a tech symposium, after which Tony storms off in a rage. Smiling children gather around Jonathan, who beams across at Emma as her eyebrows arch up with delight, while a barista offers him a tea, and Jonathan observes the woman's badge. A lean, blond-haired boy arrives, with whom he high-fives in a playful manner before Emma abandons him to it, and he glances vacantly at Maria. Emma supervises Maria anticipating a response, prompting him to poke Maria's shoulder. Tony, pouring cider, misses the mug as he stares in shock, while Jonathan answers his telephone and surveys the area covertly on a windy rooftop, taking a long, calming sigh. He guides a woman to a ladies' boutique where she collapses on a couch and gives him a glance, making him flinch. He then adjusts her scarf, assists her with a red gown, and sits opposite her before she leads him onto the dance floor, places one arm around his neck, and holds his right hand in her left hand."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Amid a chaotic shopping frenzy for handbags, shoes, and gloves, Rebecca loses her pinkie boots to another woman. At home, she contemplates her many shopping bags, including Gucci boots, while ignoring Luke's message demanding an outline. Distressed, she crawls across a boardroom table to answer a phone, leading to a tense encounter in Luke's office with Hayley. Later, her dad's coin trick fails to amuse her, but she brightens when Graham arrives. At the office, Wilson peruses an Asian webpage as she flirts. Suze tries on a wedding dress with her mom's help. Exhausted, Luke joins fur-clad Alette and Alicia in a lift, leading to a mishap. In Miami, at a magazine conference, Rebecca mingles and grins at Luke. A bony-faced man appears, leading to an awkward encounter, while Rebecca answers her phone anxiously. She helps a man with a tuxedo, and they share a dance, his arm around her waist."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath Luke oversees Janne waiting for an answer leading her to slap Janne's face A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff In Miami Florida home to sunkissed beaches and a marina full of private boats Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze She later opens a letter at her desk Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone Hayley brings Rebecca a note and Luke picks up the phone Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye She idly pulls a coat from one of her bags with her face folding as she reads the label A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand Hayley brings Rebecca a note and Luke picks up the phone A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms Luke oversees Janne waiting for an answer leading her to slap Janne's face In Miami Florida home to sunkissed beaches and a marina full of private boats A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly She later opens a letter at her desk There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her She idly pulls a coat from one of her bags with her face folding as she reads the label She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At the office Wilson is looking at an Asian Web page while she wears a flirty fishingforsomething kind of expression Suze is trying on a frothy white tulle wedding dress as Suze's mom tries on her veil Yawning with exhaustion Luke steps into a lift to join Alette swathed in fur and leggy Alicia before Alette sweeps out and Alicia trips and falls into Luke's arms In Miami Florida home to sunkissed beaches and a marina full of private boats Luke and Rebecca are at a magazine conference after which Alicia goes off in a huff Smiling women crowd around Rebecca who grins across at Luke as his eyebrows shoot up with amusement while a waitress hands her a cocktail and Rebecca notices the man's name tag A bonyfaced sandyhaired man appears with whom she nosenuzzles in Eskimo style before Luke leaves her to it and she peers blankly at Janne Luke oversees Janne waiting for an answer leading her to slap Janne's face Alicia pouring champagne misses the glass as she watches in horror while Rebecca answers her mobile and glances around furtively on a breezy terrace taking a deep deep breath She takes a man to a men's store where he slumps on a seat and shoots her a look making her recoil She then straightens his bow tie helps him with a black tuxedo and sits down to face him before he pulls her onto the dance floor puts one arm around her waist and clasps her right hand in his left hand There is a stampede involving handbags shoes and gloves all available for the taking during which she puts down the tall pinkie boots that a woman grabs and snatches from her Rebecca jumps on the woman and later at home with her head slumped she sits contemplating the mountain of shopping bags in front of her including the Gucci boots A message from Luke demanding the outline appears on her laptop and she looks at her watch before slumping down at her desk She idly pulls a coat from one of her bags with her face folding as she reads the label Rebecca looks at an empty photo frame on Luke's desk while Luke regards her with a twinkle in his eye Hayley brings Rebecca a note and Luke picks up the phone Hayley rushes back in as Rebecca like a woman possessed clambers onto the slippery boardroom table on all fours propelling herself at the phone Later in Luke's office with Hayley present Luke looks earnestly into Rebecca's face glancing dubiously at Hayley and Rebecca smiles meekly She later opens a letter at her desk At her home Rebecca's smiling dad magics a coin from behind her ear and puts it into her outstretched hand before plunking himself down on an easy chair that tips back causing Rebecca's expectant smile to freeze A recreational vehicle crashes around the corner with Graham at the wheel making Rebecca's face brighten"
        }
      ]
    }
  ]
}