{
  "ground_truth": "The guys consider for a moment as Nick stares down, brow creased, before taking the briefcase. Nick is at work when Harken harangues an employee within earshot of him. Nick takes a pen and slides it down his throat, causing himself to vomit into his wastepaper basket. After wiping his mouth, Nick picks up the plastic bin and heads out. The guys drive down a leafy, suburban street and gaze over at a large house as Kurt grins. Night falls, and chewing on snacks, they all share a look. They get out of the car and quickly hide as Bobby's garage door swings open. An orange Pontiac Trans Am tears out and drives off down the street. Nick and Kurt roll under the slowly closing garage door, with Dale bashing into it, causing the door to open again. Inside the house, they see tasteless artifacts and a deep tray of cocaine about the size of a CD case, which he drops, resulting in a cocaine cloud hanging in the air. Kurt enters the bedroom where there's a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser. Nick, wearing a short-sleeved T-shirt, watches Dale pick up the tray, while Kurt uses his sleeve gloves to turn the light on in Bobby's on-suite bathroom and spots Bobby's toothbrush. Kurt takes the toothbrush from its holder, slides it down his ass crack, and has a good scrub before putting it back. Dale's hoody is dusted with cocaine, and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers. In the open plan living space, Nick dumps the contents of a Dustbuster vacuum into the cocaine tray, now full of dust, cocaine, and debris, remaining stony-faced. Kurt finds dental floss as Dale sniffs and flexes his jaw. Kurt finishes up in the bathroom, turns the light off, and leaves for the living room, where he slaps Dale, and Dale rolls his shoulders. Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows. Approaching the front door, they climb over a low hedge and peer in through the windows when something catches Nick's eye. He takes a rock from a plant pot by the door, tosses it to Kurt, and takes a key from the rock. They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge. The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car. Kurt and Nick start across the landing, where life-size cat figurines rest on small podiums, and a porcelain cat's face hangs on the wall.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The men ponder for a moment as Nick gazes downward, brow furrowed, before grabbing the attaché. Nick is at the office when Harken berates a staff member within earshot of him. Nick graps a pen and slides it down his gullet, causing himself to regurgitate into his wastebasket. After cleaning his mouth, Nick lifts the plastic receptacle and heads out. The men drive down a leafy, suburban road and glance over at a sizable residence as Kurt beams. Evening descends, and munching on refreshments, they all share a look. They exit the vehicle and quickly conceal themselves as Bobby's garage door swings ajar. An orange Pontiac Trans Am speeds out and drives off down the street. Nick and Kurt roll beneath the slowly dropping garage door, with Dale crashing into it, causing the door to open again. Inside the residence, they observe tacky ornaments and a deep tray of cocaine about the size of a CD case, which he drops, resulting in a cocaine mist hanging in the air. Kurt enters the bedroom where there's a large Japanese style portrait of Bobby wielding nunchucks and pockets something from the bureau. Nick, wearing a short-sleeved jersey, watches Dale pick up the tray, while Kurt uses his sleeve gloves to switch the light on in Bobby's private bathroom and spots Bobby's toothbrush. Kurt takes the toothbrush from its holder, slides it down his buttock cleft, and has a good scrub before putting it back. Dale's hoodie is dusted with cocaine, and he tries to brush it off while Kurt picks up Bobby's shaver and pops it down the back of his pants. In the open-concept living area, Nick dumps the contents of a handheld vacuum into the cocaine tray, now full of dust, cocaine, and debris, remaining stony-faced. Kurt finds dental floss as Dale sniffs and flexes his jaw. Kurt finishes up in the bathroom, turns the light off, and leaves for the living area, where he slaps Dale, and Dale rolls his shoulders. Street lights illuminate the darkened road as they drive on and pull up outside Harken's palatial residence to park in the shadows. Approaching the front entrance, they climb over a low hedge and peer in through the windows when something catches Nick's eye. He takes a stone from a plant pot by the entrance, tosses it to Kurt, and takes a key from the stone. They enter the expansive hallway where a portrait of Harken with his spouse and their feline hangs in the lounge. The cat leaps onto Nick's shoulder and dashes as Dale sings along to the radio in the car. Kurt and Nick start across the landing, where life-size cat figurines rest on small podiums, and a porcelain cat's face hangs on the wall."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The briefcase is considered for a moment by the guys as Nick is stared down at, brows creased, before it is taken by him. Harken harangues an employee within Nick's earshot when Nick is at work. A pen is taken by Nick, and it is slid down his throat, causing vomit into his wastepaper basket. After his mouth is wiped, the plastic bin is picked up by Nick, and he heads out. A leafy, suburban street is driven down by the guys, and a large house is gazed over at as a grin is given by Kurt. Night falls, and snacks are chewed on as they all share a look. The car is exited by them, and they quickly hide as Bobby's garage door is swung open. An orange Pontiac Trans Am is teared out by someone and driven off down the street. Under the slowly closing garage door, Nick and Kurt roll, with Dale causing it to open again by bashing into it. Tasteless artifacts and a deep tray of cocaine about the size of a CD case are seen by them inside the house, which is dropped by him, resulting in a cocaine cloud hanging in the air. In the bedroom, Kurt enters where a large Japanese style portrait of Bobby brandishing nunchucks is present, and something is pocketed from the dresser by him. Dale picks up the tray as Nick, wearing a short-sleeved T-shirt, watches, while Kurt, using his sleeve gloves, turns the light on in Bobby's on-suite bathroom and spots Bobby's toothbrush. The toothbrush is taken from its holder by Kurt, slid down his ass crack, and given a good scrub before it is put back. Cocaine is dusted on Dale's hoodie, and it is tried to be swept off by him while Bobby's razor is picked up by Kurt and popped down the back of his trousers. In the open-plan living space, the contents of a Dustbuster vacuum are dumped by Nick into the cocaine tray, now full of dust, cocaine, and debris, as he remains stony-faced. Dental floss is found by Kurt as Dale sniffs and flexes his jaw. Kurt finishes up in the bathroom, the light is turned off, and the living room is left for, where Dale is slapped by him, and Dale rolls his shoulders. The darkened street is illuminated by street lamps as they drive on and pull up outside Harken's palatial home to park in the shadows. The front door is approached, a low hedge is climbed over, and the windows are peered in through by them when something catches Nick's eye. A rock is taken by him from a plant pot by the door, it is tossed to Kurt, and a key is taken from the rock by him. The spacious hallway is entered by them where a portrait of Harken with his wife and their cat is hung in the lounge. Nick's shoulder is leaped onto by the cat and bolted as the radio is sung along to by Dale in the car. The landing is started across by Kurt and Nick, where life-size cat figurines rest on small podiums, and a porcelain cat's face is hung on the wall."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "After a thoughtful pause, Nick's brow furrows before taking the briefcase. At work, Nick witnesses Harken scold an employee. He swallows a pen, inducing vomit into his waste bin, then exits with it. Driving down a suburban street, the guys eye a large house; Kurt grins. At night, they share snacks and glance at each other. As Bobby's garage opens, an orange Trans Am speeds away. Nick and Kurt roll under the closing door, but Dale bumps it. Inside, they find garish artifacts and a cocaine tray, which creates a cloud when dropped. In the bedroom, Kurt finds a portrait of Bobby with nunchucks and takes something. Dale, covered in cocaine, tries cleaning up. Kurt uses sleeve gloves to turn on the bathroom light and swipes Bobby’s toothbrush. He scrubs it down his crack before replacing it. Kurt also pockets Bobby's razor. In the living room, Nick empties a Dustbuster into the cocaine tray, now full of debris. Kurt grabs dental floss while Dale flexes his jaw. Kurt leaves the bathroom, turns off the light, and slaps Dale, who rolls his shoulders. They drive to Harken's grand home and park in the shadows. Near the door, Nick finds a key inside a rock and enters the hallway, which features a portrait of Harken, his wife, and their cat. The cat jumps onto Nick's shoulder then dashes away as Dale sings in the car. Kurt and Nick cross the landing past life-size cat statues and a porcelain cat's face on the wall."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nick, brow furrowed, takes the briefcase at work while Harken berates an employee. Nick forces himself to vomit, then leaves with the bin. The guys drive a suburban street, eye a large house, and hide as Bobby's garage opens. An orange Pontiac speeds away. Nick and Kurt roll under the garage door; Dale slams into it, opening it again. Inside, they see tacky decor and cocaine. Kurt enters a bedroom, pockets an item, and scrubs Bobby's toothbrush on himself. Nick, in a T-shirt, watches Dale pick up cocaine, while Kurt uses glove sleeves for light switches and collects dental floss. Nick stashes Dustbuster debris in the cocaine. They drive to Harken's home, park, and climb a hedge. Nick finds a key in a rock and unlocks the door. Inside, a cat jumps on Nick before bolting. Kurt and Nick cross a landing with cat figurines and a porcelain face."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The group of guys pauses for a brief moment as Nick gazes downward, his brow furrowed in deep thought, before ultimately deciding to take the briefcase into his possession. While Nick is at his workplace, he overhears Harken, his superior, loudly berating another employee within his hearing range. In response, Nick takes a pen and dramatically slides it down his own throat, causing himself to vomit directly into his wastepaper basket. After wiping his mouth clean, Nick picks up the plastic trash bin and makes his way out.\n\nThe friends drive down a leafy, tree-lined suburban street, casting their gaze toward a large, impressive house as Kurt grins with amusement. As the night descends, they all munch on snacks and exchange knowing glances. Exiting the car, they quickly find cover as the door of Bobby's garage swings open. An orange Pontiac Trans Am roars to life, tearing out of the garage and speeding off down the street in a flash. Nick and Kurt take advantage of the moment to roll under the garage door as it slowly closes, but Dale accidentally bumps into it, causing it to open wide again.\n\nOnce inside the house, they observe a collection of tasteless, gaudy artifacts and a deep tray filled with cocaine, roughly the size of a CD case, which slips from their grasp, creating a cloud of cocaine that lingers in the air. Kurt ventures into the bedroom, where he finds a large Japanese-style portrait depicting Bobby wielding nunchucks and discreetly pockets an item from the dresser. Nick, clad in a short-sleeved T-shirt, watches Dale as he retrieves the fallen tray, while Kurt uses his sleeve as an impromptu glove to turn on the light in Bobby's en-suite bathroom and spots the toothbrush belonging to Bobby. Kurt mischievously takes the toothbrush from its holder and runs it down his own ass crack, giving it a good scrub before placing it back. Dale, whose hoody is now covered with a dusting of cocaine, attempts to sweep it off while Kurt snatches Bobby's razor and pops it into the back of his trousers.\n\nIn the spacious open-plan living area, Nick empties the contents of a Dustbuster vacuum into the tray of cocaine, now brimming with dust, cocaine, and miscellaneous debris, maintaining a stony-faced demeanor. Meanwhile, Kurt discovers some dental floss as Dale sniffs and clenches his jaw reflexively. Kurt completes his antics in the bathroom, turns the light off, and heads back to the living room, where he playfully slaps Dale, prompting Dale to roll his shoulders.\n\nAs they drive on into the night, the street lamps cast a dim glow over the darkened street, and they eventually pull up outside Harken's lavish, palatial home, parking inconspicuously in the shadows. Approaching the front door, they expertly climb over the low hedge and peer into the windows when something captures Nick's attention. From a plant pot by the door, he retrieves a rock, tosses it toward Kurt, and uncovers a hidden key from within the rock. They make their way inside the expansive hallway, where a portrait of Harken with his wife and their cat is prominently displayed in the lounge. Suddenly, the cat leaps onto Nick’s shoulder and then bolts away just as Dale sings along to the radio in the car. Kurt and Nick start across the landing, where they notice life-size cat figurines resting on small podiums and a porcelain cat's face adorning the wall."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The group of guys comes to a momentary halt as Nick directs his gaze downward, his brow deeply furrowed in a visible display of intense contemplation, before ultimately making the decision to take the briefcase into his possession. While Nick is situated at his place of employment, he happens to overhear Harken, his boss, loudly berating another employee in a manner that is well within Nick's auditory range. In reaction to this, Nick takes a pen and, in an exaggerated manner, slides it down his own throat, inducing himself to vomit directly into his wastepaper basket. After taking the time to wipe his mouth clean, Nick picks up the plastic trash bin and makes his way out of the room.\n\nThe friends drive along a tree-lined suburban street, the leaves casting shadows on their car as they set their gaze upon a large, impressive house, with Kurt grinning in amusement. As the night falls, cloaking the surroundings in darkness, they casually munch on snacks and exchange knowing glances amongst themselves. Exiting the car, they quickly find cover as the door of Bobby's garage swings open in front of them. An orange Pontiac Trans Am roars to life, tearing out of the garage with speed and racing down the street in a flash. Nick and Kurt seize the opportunity to roll under the garage door as it slowly closes, but Dale, in a moment of clumsiness, accidentally bumps into it, causing it to open wide again.\n\nOnce inside the expansive house, they take in the sight of a collection of tasteless, gaudy artifacts and a deep tray filled with cocaine, approximately the size of a CD case, which slips from their grasp, creating a cloud of cocaine that lingers in the air. Kurt ventures into the bedroom, where he discovers a large Japanese-style portrait depicting Bobby wielding nunchucks, and he discreetly pockets an item from the dresser. Nick, dressed casually in a short-sleeved T-shirt, watches Dale as he retrieves the fallen tray. Meanwhile, Kurt uses his sleeve as an impromptu glove to turn on the light in Bobby's en-suite bathroom, and he spots Bobby's toothbrush. Kurt mischievously takes the toothbrush from its holder and runs it down his own ass crack, giving it a thorough scrub before placing it back. Dale, whose hoody is now covered with a dusting of cocaine, attempts to sweep it off while Kurt stealthily snatches Bobby's razor, tucking it into the back of his trousers.\n\nIn the spacious, open-plan living area, Nick empties the contents of a Dustbuster vacuum into the tray of cocaine, which is now brimming with a mix of dust, cocaine, and miscellaneous debris, all while maintaining a stony-faced demeanor. Meanwhile, Kurt discovers some dental floss, and Dale sniffs while reflexively clenching his jaw. Kurt finishes his mischief in the bathroom, turns off the light, and heads back to the living room, where he playfully slaps Dale, prompting Dale to roll his shoulders in response.\n\nAs they continue their drive into the night, the street lamps cast a dim, flickering glow over the darkened street, and eventually, they pull up outside Harken's lavish, palatial home, parking inconspicuously in the comforting shadows. Approaching the front door, they skillfully climb over the low hedge and peer into the windows when something catches Nick's attention. From a plant pot located by the door, he retrieves a rock, tosses it in Kurt’s direction, and uncovers a hidden key from within the rock’s depths. They proceed to enter the expansive hallway, where a prominently displayed portrait of Harken with his wife and their cat can be seen in the lounge. Suddenly, the cat leaps onto Nick’s shoulder and then bolts away just as Dale sings along to the radio in the car outside. Kurt and Nick begin their journey across the landing, where they notice life-size cat figurines resting on small podiums and a porcelain cat's face dramatically adorning the wall."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the guys briefly pause in contemplation, Nick gazes downward, brow furrowed in concentration, before decisively reaching out to take the briefcase. Meanwhile, at his workplace, Nick stands within earshot as Harken berates an employee, prompting him to pick up a pen and deliberately slide it down his throat, inducing himself to vomit into his wastepaper basket. After this, he wipes his mouth clean, then retrieves the plastic bin and confidently strides out. Later, the guys find themselves cruising down a serene, leafy suburban street, eyes drawn to a sizable house while Kurt flashes a grin. As night envelops the scene, they sit in the car, nibbling on snacks and exchanging meaningful glances. They swiftly exit the vehicle and duck into hiding as Bobby's garage door swings open. An orange Pontiac Trans Am roars to life and speeds away down the street. Nick and Kurt take advantage of the situation, rolling under the garage door as it closes slowly, although Dale accidentally collides with it, causing it to open once more. Once inside the house, they are confronted with garish artifacts and a deep tray of cocaine, roughly the size of a CD case, which one of them accidentally drops, resulting in a lingering cloud of cocaine in the air. Kurt makes his way to the bedroom, where he spots a large, Japanese-style portrait of Bobby wielding nunchucks, and discreetly slips something from the dresser into his pocket. As Nick, clad in a short-sleeved T-shirt, observes, Dale picks up the cocaine tray while Kurt, using his shirt sleeves as makeshift gloves, switches on the light in Bobby's en-suite bathroom, noticing Bobby's toothbrush. Kurt then removes the toothbrush from its holder, slides it between his buttocks for a thorough scrub, and returns it to its place. Meanwhile, Dale tries to brush off the cocaine dust that has settled onto his hoodie, and Kurt grabs Bobby's razor, tucking it down the back of his trousers. In the open-plan living area, Nick unemotionally empties a Dustbuster vacuum's contents into the cocaine-laden tray, filling it with dust and debris. Kurt discovers some dental floss, while Dale continues to sniff and adjust his jaw. Kurt concludes his antics in the bathroom, turns off the light, and heads to the living room, where he playfully slaps Dale, causing Dale to roll his shoulders in response. As street lamps cast a glow over the darkened street, they drive on, eventually parking in the shadows outside Harken's extravagant home. Approaching with stealth, they scale a low hedge and peer through the windows when something catches Nick's attention. He retrieves a rock from a plant pot near the door, tosses it to Kurt, and retrieves a hidden key from within the rock. They quietly enter the spacious hallway, noting a portrait of Harken alongside his wife and their cat prominently displayed in the lounge. The cat nimbly leaps onto Nick's shoulder, then quickly bolts away as Dale melodiously sings along to the radio back in the car. Meanwhile, Kurt and Nick begin crossing the landing, passing life-size cat figurines perched atop small podiums and a porcelain cat's face adorning the wall."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The guys briefly deliberate as Nick, deep in thought, takes the briefcase. At work, after hearing Harken berate an employee, Nick induces vomiting into his wastebasket using a pen, then exits with the bin. They drive through a suburban street, admiring a large house as Kurt grins. By nightfall, after sharing a knowing look over snacks, they exit the car to hide as Bobby's garage door opens. An orange Pontiac Trans Am speeds away. Nick and Kurt roll under the closing garage door, while Dale accidentally triggers its reopening. Inside, they find garish decor and a cocaine tray. Nick drops it, causing a cocaine cloud. Kurt enters a bedroom, pockets an item from the dresser, and mocks Bobby’s portrait. Meanwhile, Nick observes Dale handling the tray as Kurt uses his sleeve to turn on a bathroom light, finds Bobby’s toothbrush, and uses it for an unsanitary act before returning it to the holder. Dale, covered in cocaine, brushes it off while Kurt pockets Bobby’s razor. In the living area, Nick empties a Dustbuster's contents into the cocaine tray, maintaining a stoic expression. Kurt finds dental floss as Dale sniffs and Kurt finishes in the bathroom, then joins Dale in the living room, slapping him playfully. They drive to Harken's extravagant house, parking discreetly. Approaching the front door, they climb over a hedge, peer through windows, and Nick discovers a key inside a rock, which he hands to Kurt. Inside, they walk through a spacious hallway featuring a portrait of Harken's family. A cat jumps onto Nick's shoulder and escapes as Dale sings in the car. Kurt and Nick cross a landing adorned with cat figurines and a porcelain cat’s face on the wall."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The guys consider for a moment as Nick, who often finds himself stuck in tough situations at work, stares down, brow creased, before taking the briefcase. Nick is at work in a high-pressure corporate environment when Harken, his demanding boss, harangues an employee within earshot of him. Nick takes a pen and slides it down his throat, a desperate tactic to induce vomiting, causing himself to vomit into his wastepaper basket. After wiping his mouth, Nick picks up the plastic bin, a common office staple, and heads out. The guys drive down a leafy, suburban street, typical of affluent neighborhoods, and gaze over at a large house as Kurt grins. Night falls, and chewing on snacks, they all share a look, a silent agreement of mischief. They get out of the car and quickly hide as Bobby's garage door swings open. An orange Pontiac Trans Am, a classic muscle car from the 1970s known for its speed, tears out and drives off down the street. Nick and Kurt roll under the slowly closing garage door, with Dale bashing into it, causing the door to open again. Inside the house, they see tasteless artifacts, indicative of Bobby's questionable taste, and a deep tray of cocaine about the size of a CD case, which he drops, resulting in a cocaine cloud hanging in the air. Kurt enters the bedroom where there's a large Japanese-style portrait of Bobby brandishing nunchucks, a martial arts weapon, and pockets something from the dresser. Nick, wearing a short-sleeved T-shirt despite the cool evening, watches Dale pick up the tray, while Kurt uses his sleeve gloves to turn the light on in Bobby's on-suite bathroom and spots Bobby's toothbrush. Kurt takes the toothbrush from its holder, slides it down his ass crack, and has a good scrub before putting it back, leaving behind a devious prank. Dale's hoody is dusted with cocaine, and he tries to sweep it off while Kurt picks up Bobby's razor, a high-end grooming tool, and pops it down the back of his trousers. In the open-plan living space, Nick dumps the contents of a Dustbuster vacuum, a portable cleaning device, into the cocaine tray, now full of dust, cocaine, and debris, remaining stony-faced. Kurt finds dental floss, an item often overlooked but essential for oral hygiene, as Dale sniffs and flexes his jaw, showing signs of anxiety. Kurt finishes up in the bathroom, turns the light off, and leaves for the living room, where he slaps Dale, and Dale rolls his shoulders to release tension. Street lamps illuminate the darkened street, casting long shadows, as they drive on and pull up outside Harken's palatial home, which boasts luxurious decor, to park in the shadows. Approaching the front door, they climb over a low hedge and peer in through the windows when something catches Nick's eye, a potential entry point. He takes a rock from a plant pot by the door, a common hiding place, tosses it to Kurt, and takes a key from the rock. They enter the spacious hallway where a portrait of Harken with his wife and their cat, showcasing the family's image of perfection, hangs in the lounge. The cat, a sleek Siamese, leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car, trying to calm his nerves. Kurt and Nick start across the landing, where life-size cat figurines rest on small podiums, reflecting Harken's love for his pet, and a porcelain cat's face hangs on the wall, adding to the feline-themed decor."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers An orange Pontiac Trans Am tears out and drives off down the street The guys consider for a moment as Nick stares down brow creased before taking the briefcase Nick is at work when Harken harangues an employee within earshot of him Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket After wiping his mouth Nick picks up the plastic bin and heads out The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins Night falls and chewing on snacks they all share a look He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock After wiping his mouth Nick picks up the plastic bin and heads out Nick is at work when Harken harangues an employee within earshot of him They get out of the car and quickly hide as Bobby's garage door swings open An orange Pontiac Trans Am tears out and drives off down the street Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser Nick wearing a shortsleeved Tshirt watches The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back cat's face hangs on the wall The guys consider for a moment as Nick stares down brow creased before taking the briefcase Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again Kurt finds dental floss as Dale sniffs and flexes his jaw Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain cat's face hangs on the wall"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The guys consider for a moment as Nick stares down brow creased before taking the briefcase. Nick is at work when Harken harangues an employee within earshot of him. Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket. After wiping his mouth Nick picks up the plastic bin and heads out. The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins. Night falls and chewing on snacks they all share a look. They get out of the car and quickly hide as Bobby's garage door swings open. An orange Pontiac Trans Am tears out and drives off down the street. Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again. Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air. Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser. Nick wearing a shortsleeved Tshirt watches. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush. Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back. Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers. In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced. Kurt finds dental floss as Dale sniffs and flexes his jaw. Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders. Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows. Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye. He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock. They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge. The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car. Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain. cat's face hangs on the wall."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The guys consider for a moment as Nick stares down brow creased before taking the briefcase. Nick is at work when Harken harangues an employee within earshot of him. Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket. After wiping his mouth Nick picks up the plastic bin and heads out. The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins. Night falls and chewing on snacks they all share a look. They get out of the car and quickly hide as Bobby's garage door swings open. An orange Pontiac Trans Am tears out and drives off down the street. Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again. Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air. Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser. Nick wearing a shortsleeved Tshirt watches. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush. Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back. Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers. In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced. Kurt finds dental floss as Dale sniffs and flexes his jaw. Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders. Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows. Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye. He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock. They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge. The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car. Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain. cat's face hangs on the wall."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The guys consider for a moment as Nick stares down brow creased before taking the briefcase. Nick is at work when Harken harangues an employee within earshot of him. Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket. After wiping his mouth Nick picks up the plastic bin and heads out. The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins. Night falls and chewing on snacks they all share a look. Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows. Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye. He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock. They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge. The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car. Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain. cat's face hangs on the wall."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The guys consider for a moment as Nick stares down brow creased before taking the briefcase. Nick is at work when Harken harangues an employee within earshot of him. The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car. Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain. cat's face hangs on the wall."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The raccoons consider for a moment as Sarah stares down, brow creased, before taking the briefcase. Sarah is at work when a kangaroo harangues an employee within earshot of her. Sarah takes a pen and slides it down her throat, causing herself to vomit into her wastepaper basket. After wiping her mouth, Sarah picks up the plastic bin and heads out. The raccoons drive down a leafy, suburban street and gaze over at a large house as Jorge grins. Night falls, and chewing on snacks, they all share a look. They get out of the car and quickly hide as Cynthia's garage door swings open. An orange Pontiac Trans Am tears out and drives off down the street. Sarah and Jorge roll under the slowly closing garage door, with Lily bashing into it, causing the door to open again. Inside the house, they see tasteless artifacts and a deep tray of cocaine about the size of a CD case, which she drops, resulting in a cocaine cloud hanging in the air. Jorge enters the bedroom where there's a large Japanese style portrait of Cynthia brandishing nunchucks and pockets something from the dresser. Sarah, wearing a short-sleeved T-shirt, watches Lily pick up the tray, while Jorge uses his sleeve gloves to turn the light on in Cynthia's on-suite bathroom and spots Cynthia's toothbrush. Jorge takes the toothbrush from its holder, slides it down his ass crack, and has a good scrub before putting it back. Lily's hoody is dusted with cocaine, and she tries to sweep it off while Jorge picks up Cynthia's razor and pops it down the back of his trousers. In the open plan living space, Sarah dumps the contents of a Dustbuster vacuum into the cocaine tray, now full of dust, cocaine, and debris, remaining stony-faced. Jorge finds dental floss as Lily sniffs and flexes her jaw. Jorge finishes up in the bathroom, turns the light off, and leaves for the living room, where he slaps Lily, and Lily rolls her shoulders. Street lamps illuminate the darkened street as they drive on and pull up outside the kangaroo's palatial home to park in the shadows. Approaching the front door, they climb over a low hedge and peer in through the windows when something catches Sarah's eye. She takes a rock from a plant pot by the door, tosses it to Jorge, and takes a key from the rock. They enter the spacious hallway where a portrait of the kangaroo with his wife and their cat hangs in the lounge. The cat leaps onto Sarah's shoulder and bolts as Lily sings along to the radio in the car. Jorge and Sarah start across the landing, where life-size cat figurines rest on small podiums, and a porcelain cat's face hangs on the wall."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The guys consider for a moment as Nick stares down, brow creased, before taking the toolbox. Nick is at work when Harken harangues an employee within earshot of him. Nick takes a ruler and slides it down his throat, causing himself to vomit into his recycling bin. After wiping his mouth, Nick picks up the cardboard box and heads out. The guys drive down a sandy, coastal street and gaze over at a large lighthouse as Kurt grins. Night falls, and chewing on dried fruits, they all share a look. They get out of the car and quickly hide as Bobby's barn door swings open. A red Ford Mustang tears out and drives off down the street. Nick and Kurt roll under the slowly closing barn door, with Dale bashing into it, causing the door to open again. Inside the house, they see tacky murals and a deep tray of flour about the size of a VHS tape, which he drops, resulting in a flour cloud hanging in the air. Kurt enters the bedroom where there's a large Scandinavian style portrait of Bobby brandishing a boomerang and pockets something from the nightstand. Nick, wearing a short-sleeved polo, watches Dale pick up the tray, while Kurt uses his scarf to turn the light on in Bobby's en-suite boudoir and spots Bobby's hairbrush. Kurt takes the hairbrush from its holder, slides it down his pants leg, and has a good scrub before putting it back. Dale's jacket is dusted with flour, and he tries to sweep it off while Kurt picks up Bobby's comb and pops it down the back of his jacket. In the open plan living space, Nick dumps the contents of a handheld fan into the flour tray, now full of dust, flour, and debris, remaining stony-faced. Kurt finds rubber bands as Dale sniffs and flexes his jaw. Kurt finishes up in the boudoir, turns the light off, and leaves for the living room, where he slaps Dale, and Dale rolls his sleeves. Street lamps illuminate the darkened street as they drive on and pull up outside Harken's grand estate to park in the shadows. Approaching the front door, they climb over a low fence and peer in through the windows when something catches Nick's eye. He takes a pebble from a flower bed by the door, tosses it to Kurt, and takes a key from under the pebble. They enter the spacious foyer where a portrait of Harken with his wife and their dog hangs in the lounge. The dog leaps onto Nick's shoulder and bolts as Dale sings along to the podcast in the car. Kurt and Nick start across the mezzanine, where life-size dog figurines rest on small platforms, and a porcelain dog's face hangs on the wall."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The guys hesitate for a moment as Nick glances upward, brow relaxed, before handing over the briefcase. Nick is at work when Harken serenades an employee within earshot of him. Nick grabs a pen and dances it across his throat, causing himself to trip into his wastepaper basket. After tying his shoe, Nick grabs the plastic bin and strolls out. The guys float down a leafy, suburban street and shout over at a large house as Kurt winks. Night falls, and tossing a ball to each other, they all laugh. They jump out of the car and slowly emerge as Bobby's garage door drifts open. An orange Pontiac Trans Am crawls out and drifts off down the street. Nick and Kurt leap over the slowly closing garage door, with Dale crawling under it, causing the door to swing open again. Inside the house, they encounter tasteless artifacts and a deep tray of candy about the size of a CD case, which he carries, resulting in a candy sprawl across the floor. Kurt walks into the bedroom where there's a large Japanese style portrait of Bobby cheering with nunchucks and admires something from the dresser. Nick, wearing a short-sleeved T-shirt, observes Dale kick the tray, while Kurt uses his sleeve gloves to shut the light off in Bobby's on-suite bathroom and notices Bobby's toothbrush. Kurt gives the toothbrush a dance, tosses it across the room, and takes a bow before picking it up again. Dale's hoody is covered with candy, and he tries to press it off while Kurt moves Bobby's razor and hides it behind his trousers. In the open plan living space, Nick empties the contents of a Dustbuster vacuum into the candy tray, now full of dust, candy, and debris, grinning slightly. Kurt discovers dental floss as Dale whistles and squints his eyes. Kurt finishes up in the bathroom, flips the light on, and strolls to the living room, where he nudges Dale, and Dale stretches his arms wide. Street lamps cast shadows on the illuminated street as they glide on and stop outside Harken's palatial home to park in the glow. Approaching the front door, they skip over a low hedge and look in through the windows when something distracts Nick's focus. He selects a leaf from a plant by the door, hands it to Kurt, and swipes a key from the leaf. They stroll into the spacious hallway where a portrait of Harken with his wife and their cat lounges in the lounge. The cat balances on Nick's shoulder and nestles as Dale hums along to the radio in the car. Kurt and Nick saunter across the landing, where life-size cat figurines balance on small podiums, and a porcelain cat's face smiles on the wall."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The gargoyles ponder for a while as Mango gazes down, expression furrowed, before grabbing the violin. Mango is at the zoo when Orbit chastises an intern within earshot of the blender. Mango takes a spoon and slides it down his saxophone, prompting himself to cough into his paint bucket. After cleaning his shoes, Mango picks up the cardboard box and strolls out. The gargoyles cruise down a windy, urban alley and ogle at a tiny shed as Felix beams. Dusk descends, and nibbling on muffins, they all exchange a glance. They leap out of the skateboard and swiftly duck as Elmo's gazebo flap springs open. A yellow blimp Model T zooms out and flies off down the avenue. Mango and Felix tumble under the slowly rising gazebo flap, with Dale smacking into it, prompting the flap to lift again. Inside the shed, they notice gaudy paintings and a shallow plate of flour roughly the size of a vinyl record, which he drops, creating a flour mist hovering in the room. Felix steps into the kitchen where there's an enormous Brazilian-style mural of Elmo wielding tambourines and pockets something from the bookcase. Mango, donning a long-sleeved jumpsuit, watches Dale pick up the plate, while Felix uses his sock mitten to switch the light on in Elmo’s on-premises pantry and spots Elmo’s comb. Felix takes the comb from its cup, slides it down his elbow pit, and gives a thorough cleaning before placing it back. Dale’s parka is covered with flour, and he attempts to flick it off while Felix snatches Elmo's stapler and tucks it down the front of his overalls. In the divided eating nook, Mango spills the insides of a floor broom into the flour plate, now brimming with lint, flour, and bits, maintaining a serious expression. Felix discovers sewing thread as Dale snorts and wiggles his ears. Felix wraps up in the pantry, switches the light off, and heads for the dining nook, where he thumps Dale, and Dale cracks his knuckles. Streetlights bathe the dimmed road as they glide on and park outside Orbit's modest cabin to dock in the dimness. Reaching the back entrance, they hop over a high fence and peek in through the curtains when something catches Mango's glance. He grabs a twig from a bucket by the gate, tosses it to Felix, and extracts a coin from the twig. They enter the narrow corridor where a snapshot of Orbit with his friend and their rabbit hangs in the den. The rabbit hops onto Mango's hat and sprints as Dale hums along to the lullaby in the tractor. Felix and Mango begin across the bridge, where immense rabbit statues perch on diminutive platforms, and a brass rabbit's snout dangles on the ceiling."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cats ponder for a moment as Oliver glances down, jaw clenched, before grabbing the briefcase. Oliver is at a concert when Sanders criticizes a performer within earshot of him. Oliver grabs a spoon and slides it down his throat, causing himself to belch into his wastepaper basket. After wiping his chin, Oliver grabs the plastic cup and strolls out. The cats cruise down a sandy, coastal road and glance over at a towering mansion as Jake smirks. Night descends, and munching on candy, they all exchange a glance. They hop out of the truck and swiftly hide as Timothy's garage gate swings open. A red Ford Mustang roars out and zooms off down the street. Oliver and Jake roll under the slowly closing garage gate, with Ethan bumping into it, causing the gate to open once more. Inside the mansion, they observe gaudy furnishings and a shallow tray of sugar about the size of a CD case, which he knocks over, resulting in a sugar cloud hovering in the air. Jake ventures into the bedroom where there's a large Japanese style portrait of Timothy wielding a bo staff and snatches something from the nightstand. Oliver, dressed in a long-sleeved shirt, watches Ethan grab the tray, while Jake uses his elbow patches to switch the light on in Timothy's en-suite bathroom and notices Timothy's comb. Jake takes the comb from its holder, runs it down his back, and has a good scratch before putting it back. Ethan's beanie is sprinkled with sugar, and he tries to flick it off while Jake grabs Timothy's scissors and slips it down the back of his socks. In the open-plan kitchen, Oliver empties the contents of a handheld vacuum into the sugar tray, now brimming with dust, sugar, and debris, remaining poker-faced. Jake discovers body lotion as Ethan sniffs and stretches his neck. Jake finishes up in the bathroom, switches the light off, and heads for the den, where he taps Ethan, and Ethan stretches his elbows. Street lights illuminate the dim road as they cruise on and park outside Sanders' grand estate to rest in the shadows. Approaching the main entrance, they climb over a low fence and peek in through the windows when something catches Oliver's gaze. He takes a brick from a planter by the door, lobs it to Jake, and retrieves a key from the brick. They step into the expansive foyer where a portrait of Sanders with his partner and their dog hangs in the parlor. The dog jumps onto Oliver's lap and rushes away as Ethan hums along to the music in the truck. Jake and Oliver step across the mezzanine, where life-size dog statues rest on small pedestals, and a ceramic dog's snout hangs on the wall."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The guys ponder for a moment as Nick glares upward, lips pursed, before accepting the backpack. Nick is at school when Harken reprimands a visitor within sight of him. Nick takes a fork and balances it on his nose, causing himself to sneeze into his lunchbox. After wiping his nose, Nick collects the metal box and wanders out. The guys stroll down a sandy, coastal path and peer over at a towering lighthouse as Kurt chuckles. Dawn breaks, and nibbling on fruit, they all exchange a grin. They hop out of the scooter and quickly duck as Bobby's garden gate swings open. A green Volkswagen Beetle zooms out and races off along the path. Nick and Kurt crawl under the slowly lifting gate, with Dale tripping into it, causing the gate to close again. Inside the lighthouse, they observe gaudy decorations and a shallow dish of flour about the size of a cassette tape, which he flings, sending a flour puff swirling in the air. Kurt steps into the office where there's a large Egyptian style mural of Bobby wielding a boomerang and snatches something from the shelf. Nick, wearing a sleeveless vest, watches Dale lift the tray, while Kurt uses his pant leg to flick the light switch in Bobby's kitchenette and notices Bobby's spoon. Kurt grabs the spoon from its holder, slides it down his ankle sock, and gives it a good polish before placing it back. Dale's scarf is dusted with flour, and he attempts to brush it off while Kurt grabs Bobby's comb and slips it into the back of his coat. In the open plan study area, Nick empties the contents of a handheld fan into the flour dish, now filled with lint, flour, and crumbs, maintaining a blank expression. Kurt spots a paperclip as Dale snorts and scratches his ear. Kurt wraps up in the kitchenette, switches the light off, and heads to the study, where he tickles Dale, and Dale adjusts his belt. Moonlight bathes the dim path as they coast along and park by Harken's opulent villa to idle in the shade. Approaching the main entrance, they hop over a short wall and peek in through the shutters when something catches Nick's attention. He picks a coin from a flower pot by the door, lobs it to Kurt, and retrieves a ticket from the coin. They step into the grand foyer where a mural of Harken with his spouse and their parrot adorns the study. The parrot flutters onto Nick's shoulder and zips off as Dale whistles along to the stereo in the scooter. Kurt and Nick tiptoe across the mezzanine, where life-size parrot models perch on narrow shelves, and a ceramic parrot's beak adorns the ceiling."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The dolphins ponder for a while as Max glares upward, nose wrinkled, before grabbing the backpack. Max is at the library when Jenkins praises a visitor within shouting distance of him. Max grabs a ruler and jams it into his ear, prompting himself to sneeze into his recycling bin. After wiping his eyes, Max grabs the glass jar and strolls away. The dolphins sail down a dusty, urban avenue and squint at a tiny apartment as Sam chuckles. Daylight breaks, and chewing on bubblegum, they all exchange a glance. They step out of the boat and swiftly leap as Charlie's front gate flies open. A purple Subaru Legacy zooms out and sails away down the avenue. Max and Sam crawl under the rapidly rising front gate, with Leo bouncing off it, making the gate shut again. Outside the apartment, they find elegant relics and a shallow dish of sugar about the size of a DVD cover, which he tips, resulting in a sugar mist lingering in the breeze. Sam enters the kitchen where there's a small Egyptian-style mural of Charlie juggling swords and pockets a gadget from the table. Max, wearing a long-sleeved vest, observes Leo grab the dish, while Sam uses his foot socks to flick the switch on Charlie's en-suite hallway and notices Charlie's hairbrush. Sam grabs the hairbrush from its stand, shoves it under his armpit, and does a neat swipe before placing it back. Leo's jacket is sprinkled with sugar, and he attempts to brush it away while Sam grabs Charlie's spoon and tucks it under his arm. In the compartmentalized work area, Max dumps the contents of a leaf blower into the sugar dish, now filled with crumbs, sugar, and particles, maintaining a blank expression. Sam discovers chewing gum as Leo snorts and stretches his neck. Sam wraps up in the hallway, flicks the switch off, and heads to the work area, where he pats Leo, and Leo flexes his arms. Billboards illuminate the dim avenue as they sail on and halt outside Jenkins's luxurious apartment to anchor in the shadows. Approaching the side door, they dive across a wide railing and gaze through the curtains when something grabs Max's attention. He grabs a pen from a mailbox by the door, tosses it to Sam, and grabs a cookie from the pen. They enter the cramped corridor where a mural of Jenkins with his partner and their parrot hangs in the den. The parrot flutters onto Max's elbow and dashes away as Leo whistles along to the TV in the boat. Sam and Max stride across the passage, where miniature parrot statues perch on narrow shelves, and a clay parrot's beak drapes on the ceiling."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The guys deliberate before Nick reluctantly takes the briefcase. At work, Nick feigns illness to escape after hearing his boss, Harken, berate a colleague. The group drives to a suburban home, where they sneak into Bobby's garage as night falls. Inside, they find garish decor and accidentally release a cloud of cocaine. Kurt pockets items from the bedroom, while Dale, covered in cocaine, attempts to clean up. Nick empties a Dustbuster's contents into the cocaine tray. They then drive to Harken's luxurious home. Sneaking in, they find a portrait of Harken and his family. After being startled by a cat, they explore the house featuring numerous cat-themed decor."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "cat's face hangs on the wall Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders Kurt finds dental floss as Dale sniffs and flexes his jaw In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush Nick wearing a shortsleeved Tshirt watches Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again An orange Pontiac Trans Am tears out and drives off down the street They get out of the car and quickly hide as Bobby's garage door swings open Night falls and chewing on snacks they all share a look The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins After wiping his mouth Nick picks up the plastic bin and heads out Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket Nick is at work when Harken harangues an employee within earshot of him The guys consider for a moment as Nick stares down brow creased before taking the briefcase"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Kurt finds dental floss as Dale sniffs and flexes his jaw Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows They get out of the car and quickly hide as Bobby's garage door swings open Night falls and chewing on snacks they all share a look Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge Nick wearing a shortsleeved Tshirt watches Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders Nick is at work when Harken harangues an employee within earshot of him Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins cat's face hangs on the wall An orange Pontiac Trans Am tears out and drives off down the street Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again The guys consider for a moment as Nick stares down brow creased before taking the briefcase After wiping his mouth Nick picks up the plastic bin and heads out He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kurt takes the toothbrush from its holder slides it down his ass crack and has a good scrub before putting it back Dale's hoody is dusted with cocaine and he tries to sweep it off while Kurt picks up Bobby's razor and pops it down the back of his trousers In the open plan living space Nick dumps the contents of a Dustbuster vacuum into the cocaine tray now full of dust cocaine and debris remaining stonyfaced Kurt finds dental floss as Dale sniffs and flexes his jaw Kurt finishes up in the bathroom turns the light off and leaves for the living room where he slaps Dale and Dale rolls his shoulders Street lamps illuminate the darkened street as they drive on and pull up outside Harken's palatial home to park in the shadows Approaching the front door they climb over a low hedge and peer in through the windows when something catches Nick's eye He takes a rock from a plant pot by the door tosses it to Kurt and takes a key from the rock They enter the spacious hallway where a portrait of Harken with his wife and their cat hangs in the lounge The cat leaps onto Nick's shoulder and bolts as Dale sings along to the radio in the car Kurt and Nick start across the landing where lifesize cat figurines rest on small podiums and a porcelain cat's face hangs on the wall The guys consider for a moment as Nick stares down brow creased before taking the briefcase Nick is at work when Harken harangues an employee within earshot of him Nick takes a pen and slides it down his throat causing himself to vomit into his wastepaper basket After wiping his mouth Nick picks up the plastic bin and heads out The guys drive down a leafy suburban street and gaze over at a large house as Kurt grins Night falls and chewing on snacks they all share a look They get out of the car and quickly hide as Bobby's garage door swings open An orange Pontiac Trans Am tears out and drives off down the street Nick and Kurt roll under the slowly closing garage door with Dale bashing into it causing the door to open again Inside the house they see tasteless artifacts and a deep tray of cocaine about the size of a CD case which he drops resulting in a cocaine cloud hanging in the air Kurt enters the bedroom where there is a large Japanese style portrait of Bobby brandishing nunchucks and pockets something from the dresser Nick wearing a shortsleeved Tshirt watches Dale pick up the tray while Kurt uses his sleeve gloves to turn the light on in Bobby's onsuite bathroom and spots Bobby's toothbrush"
        }
      ]
    }
  ]
}